{"id": 907481, "slug": "illuminaria-demo", "name": "Illuminaria Demo", "name_original": "Illuminaria Demo", "description": "The full version of Illuminaria is available on GOG.COM. You can purchase it here\n<br/><br/>\n\n\n\n\nA resource management game where you command a swarm of intelligent robots in a quest to save the world.\n<br/>\n<br/>\n<br/>\nChoose where to build, what resources to gather, and then watch the robots do the heavy lifting. They'll gather the resources, build, load weapons, fight, and respond to the world around them.\n<br/>\n<br/>\n<br/>\nInstead of having a sandbox world, you'll need to build several smaller bases with finite space. Be on the lookout as all the bases keep functioning at all times and can be attacked by the enemies.\n<br/>\n<br/>\n<br/>\nThe game has five regions, each with new resources and technologies to discover.\n<br/>\n<br/>\n<br/>\nVicious enemies of darkness will attack your base, attempting to destroy your reactors and steal your resources. Build turrets and load them up with ammunition to repel the attacks.\n<br/>\n<br/>\n<br/>\nAdventure and explore to find hidden treasures, and fight enemies in auto-battles. This way, you'll get rare resources to use to your advantage.Liberate the world by lighting beacons and crafting your own armyThe world of Illuminaria was taken over by darkness. Unravel the story about what happened on the planet as you clean and liberate the five regions by lighting beacons and sending your armies of golems to attack.", "metacritic": null, "released": "2022-08-03", "tba": false, "updated": "2023-01-13T05:23:51", "background_image": "https://media.rawg.io/media/screenshots/177/17757686f82e9906e31d77827b92fbf2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 348, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Selva Interactive"], "genres": [], "publishers": ["Wings", "Selva Interactive"], "esrb_rating": null}