{"id": 9074, "slug": "taichi-panda-heroes", "name": "Taichi Panda: Heroes", "name_original": "Taichi Panda: Heroes", "description": "Join the unlimited and intense real-time combat in Desperation Survival Update! As you hack, slash, and blast your way with Lion Heart Roar, the brand new huge and powerful, Mid-short range fighter! He is so good at AOE controlling and will indulge you in distinctive and dominative experience! Chinese Zodiac Battlefield is on the trigger, it’s your time to hit legendary. Clash against rivals in a vast fantasy world, team up with friends to explore the wild continent and raid Dungeons, and the brand new 12-players PvP Battleground. Are you able to transform yourself to an unstoppable fighter? Start playing Taichi Panda: Heroes today to write your own fate!<br/><br/>Return to the Stunning Taichi World<br/><br/>Travel back to the days before Taichi Panda, and discover the thriving fantasy kingdom. Explore a vast and exciting world of bandits and brawlers, mystics and maniacs, all rendered in PC quality graphics. Become the true celestial champion as fight, hack, bash, and cut your way to riches and glory in a fast-paced and 3D action adventure!<br/><br/>Command your Army of Heroes<br/><br/>Take control of a wide array of unique and powerful heroes with Taichi Panda: Heroes'  innovative multi-character system. Gather your forces and choose your squad to take the field, fighting through endless hordes and abominable beasts to seize the day. Mix and match your heroes and switch your main character to suit your strategy.<br/><br/>Explore the Far Corners of the Land<br/><br/>Many wonders lay hidden across the continent, waiting for heroes to discover them! Venture into the unknown and face the terrors that dwell within to uncover riches, treasures, and glory in a large-scale open game world. Battle alongside fellow players, take on special missions, and fight for survival with open player on player action! <br/><br/>Join Allies for Legendary Action<br/><br/>Stake your allegiance and fight for honor, power, or riches alongside friends in an online action adventure! Take on powerful beasts of unbelievable power alongside allies, and fight to become the ultimate champion with online Arenas. Join with friends in teams and Guilds to discover your own legendary Taichi adventure! <br/><br/>==Connect==<br/>Visit our official site to learn more about Taichi Panda: Heroes: http://panda2.snail.com/en<br/>Join the Taichi Panda: Heroes community and learn more on Facebook and our official Forum: <br/>Facebook Page: https://www.facebook.com/TaichiPanda2/<br/>Community Forum: http://panda2bbs.snail.com", "metacritic": null, "released": "2016-04-26", "tba": false, "updated": "2019-07-01T02:33:33", "background_image": "https://media.rawg.io/media/screenshots/ae4/ae41c1c20780da93d205d80c46351d4c_juRSjSs.jpg", "website": "http://panda2.snail.com/en/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 563, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Snail Games USA"], "genres": ["Action", "RPG"], "publishers": ["Snail Games USA"], "esrb_rating": "Teen"}