{"id": 907420, "slug": "darkness-revenge", "name": "Darkness Revenge", "name_original": "Darkness Revenge", "description": "Jill and Nathan are two special agents. The two agents, are on the verge of framing notorious billionaire Donald Patterson. Things go awry, however, and the two are killed.<br/>When it all seems to be over, the vampire Laura decides to save one of the two agents.<br/>Thus begins the revenge.<br/>Darkness revenge is an adult visual novel where you can play as Jill or Nathan. <br/>After the introduction you will then have to choose whether to play with a female or male role.<br/>There will be many choices to be made throughout the story, choices that will serve to change the story itself as well as the endings.<br/>You will be able to use your vampire powers, which, however, will not be infinite. In the statistics screen you will be able to read how many vampire points you get back. Once you run out, you will have to kill in order to get them back.<br/>Be very careful and save often, as some choices will prevent you from pursuing other stories! Some choices will lead to character death.<br/>Darkness revenge is thus a choice-based sandbox with multiple endings.<br/><br/>Features:<br/><br/>- 3000 Full Hd Images<br/>- 70 Full Hd Animations<br/>- 65000 Words<br/>- 550 Possible choices<br/>- Music &amp; Sound Effects<br/>- Multiple endings<br/>- Replay Gallery<br/>- Steam Achievement<br/>- Ren'py Engine<br/><br/><br/>Who will you choose? The sexy and brave Jill? Or the bold and determined Nathan?<br/><br/><br/>Amanda Patterson is the daughter of well-known industry magnate Donald Patterson. Her role in this story is pivotal. Something connects her to Laura, what is it?<br/>Laura is the vampire lady who will save Nathan or Jill. Why did she do that? She seems to be hiding something. Is she really as good a person as she says she is?<br/><br/><br/>Isabelle is the sister of the late Jill (she will appear only in Nathan's story). She is beautiful, but she could bring a lot of trouble....<br/>Annie will be in charge of giving the first nurturing to Nathan. She would seem naive and carefree, but, inside her, a deep dark force is ready to come out.<br/><br/><br/><br/>SOME OTHER CHARACTERS:<br/>Gilbert: One of Laura's vampires.<br/>Donald Patterson: Jill and Nathan's murder mandate.<br/>Liam Patterson: Donald's psychopathic son.<br/>Vanessa Reeves: Patterson family lawyer.<br/>Allison: Chain's Den mistress.<br/>Clara: One of the prostitutes at the Chain's Den.<br/>AND MANY MORE!<br/><br/><br/><br/><br/><br/><br/><br/>", "metacritic": null, "released": "2023-01-10", "tba": false, "updated": "2023-01-13T04:08:10", "background_image": "https://media.rawg.io/media/screenshots/94a/94a02f1dc4cf76a996ed75d90f2c71ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 488, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Deva Games"], "genres": ["Adventure", "Indie"], "publishers": ["Kinetic Novels"], "esrb_rating": null}