{"id": 907458, "slug": "siege-of-dungeon", "name": "Siege of Dungeon", "name_original": "Siege of Dungeon", "description": "Siege of Dungeon combines various rogue-lite elements with traditional turn-based RPG’s, creating a challenging and rewarding experience. In each one-of-a-kind randomly generated dungeon, countless rewards, events, enemies, and traps await. After each victory, your combination of character skills and relics will slowly shape your unique combat style. After successive heated battles, you will reach the deepest part of the dungeon and face the horrors that await.<h3>Charge into the cryptic dungeon</h3><br/>In this ever-changing, randomly generated Underworld, you will have to make decisions depending on the various locations of monsters and events, which will lead your team to crisis or victory!<h3>Explore individually or as a team</h3><br/>In the vast interconnected dungeon, only adjacent characters can fight as a party. Under the circumstance of being surrounded by monster swarms, should you stick together or sneak in separately? Do you split up to explore more ground or play it safe by sticking together?<h3>Deathmatches that come from sacrifices</h3><br/>In this underworld dungeon, you will discover relics and skills from adventurers’ past. Their unfulfilled ambitions will allow you to combine ever-changing battle strategies. When combining these two factors, use spectacular “burst” attacks to annihilate all enemies that stand in your way!<h3>Story</h3><br/>In the central sea area between the countries, a foreboding city with a dark castle suddenly emerged. Scholars have discovered from ancient texts that this castle is from an ancient dynasty that should have been eternally sealed with spells. Each country sent troops to investigate and found that there is an unfathomably deep dungeon under this deserted city. Many magical creatures lurk there, along with vast amounts of crystals and treasure.<br/><br/>Even though the rumors tell of the incredible depths, horrors, and deadly magical creatures, there are still many strong adventurers drawn to the power and fortunes, seeking to explore this unknown dungeon...<br/><br/>", "metacritic": null, "released": "2023-01-11", "tba": false, "updated": "2023-01-13T04:56:02", "background_image": "https://media.rawg.io/media/screenshots/f42/f4219a2cf36b91fd446cd218fea8a6ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "toplay": 1}, "playtime": 0, "achievements_count": 18, "ratings_count": 0, "suggestions_count": 398, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Binary Tree Studio"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": ["IndieArk", "firepillar2"], "esrb_rating": null}