{"id": 907450, "slug": "yeahfighting-girl", "name": "Yeah！Fighting Girl", "name_original": "Yeah！Fighting Girl", "description": "*this game is great on SteamDeck<br/><br/><strong><h3>Five girls to control, each with unique combat style.</h3></strong><br/>Five girls, different gameplay, different skills, different feel and combat strategies.<br/><br/><strong><h3>Go to the arena to earn money, winner take all but loser take half. Take risk to get rich！</h3></strong><br/>Every time the girls enter the arena, they need to challenge from the first tier. If you actively leave the arena before the start of each tier, you can exchange all the chips for money and take away. The higher the tier, the higher the reward, but if the challenge fails, half of the chips will be deducted and you will be forced to leave the arena. Whether to continue to pursue higher rewards, or to give up in time, is a question.<br/><br/><strong><h3>Roguelike gameplay, random levels and enemies, random blessings for each tier.</h3></strong><br/>Each tier of the arena will face random levels, different levels have different gameplay and enemies, defense, survival, treasure chests, customs clearance, boss challenges and so on. Each tier can choose random blessings that can help you win. Luck is also part of strength.<br/><br/><strong><h3>Finally, challenge the four dominators to set the girls free.</h3></strong><br/>After paying off the debt, you will challenge four bosses, who are the dominators of the arena. Defeat them and the girls will be completely free.", "metacritic": null, "released": "2023-01-11", "tba": false, "updated": "2023-01-13T04:45:15", "background_image": "https://media.rawg.io/media/screenshots/457/4577b6b96d172469ab0e3dfdbc54c09c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 485, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["YellowGames"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Casual", "Indie"], "publishers": ["YellowGames"], "esrb_rating": null}