{"id": 907594, "slug": "tower-defense-project-grc0", "name": "Tower defense project (Grc0)", "name_original": "Tower defense project (Grc0)", "description": "<p><strong>To play this game, you have to download the zip file, (unpack it,) and find the  'Tower defense' exe.</strong></p><p><strong>--- introduction ---</strong></p><p>My fourth unity project I have made as part of my study, and my final one of 2022. I was tasked to work in a group to create a tower defense game where enemies spawn in waves, and you can build towers to defend a home base.</p><p><strong>--- instructions ---</strong></p><p>The starting menu of the game explains itself quite well, these are simple buttons you can click on using your cursor.</p><p>The entire game is playable using only the mouse. </p><p>Your goal is to prevent enemies from reaching your crystal by placing towers. Enemies will charge at your crystal in an attempt to damage it, a healthbar is displayed on the left side of the screen.</p><p>Once you load into the game, the countdown for the first wave will start. The first countdown is longer than the countdown that occurs in between waves.</p><p>Enemies will start spawning in waves after each countdown, the countdown starts once the final enemy of the previous wave has spawned.</p><p>At any point during gameplay you can purchase towers, you do this by clicking on a gray tower base, and choosing between the options in the buy menu. You buy towers using currency you earn by defeating enemies and surviving waves. You can also sell towers if you want to change your strategy. <em>Be sure to always sell before buying a new tower, failing to do so currently has an unresolved issue that will cost you currency without replacing the old tower with a new one.</em></p><p><strong>Enemies</strong></p><p>There are 4 enemies types that may spawn during a wave.These are:</p><p>The wolf- a melee enemy with average hitpoints and average damage. The wolf is the slowest regular enemy.</p><p>The flower bud - a ranged enemy with fewer hitpoints, often spawn in greater numbers. The flower has an average movement speed.</p><p>The deathseed - a explosive enemy that will charge at greater speeds and explode upon contact. Very few hitpoints but have high damage.</p><p>The big bad wolf (boss) - This large enemy is incredibly slow, but has an incredible amount of hitpoints. It does no do large damage on its own, but its large nature makes it so it can absorb damage while other enemies swarm your home base.</p><p><strong>Towers</strong></p><p>You can purchase 4 different towers at varying prices, these all have different qualities. All towers will prioritize the enemy closest to the crystal</p><p>Bolt - the most basic tower, shoots individual bolts at enemies. it has average damage and high range and fire rate, it is also the cheapest option.</p><p>Bomb - the bomb tower functions similarly to the bolt tower, but when hitting an enemy, it will cause an explosion which damages surrounding enemies also. It has shorter range than the bolt tower, and fires slower also, but it makes up for it in damage potential because of the ability to hit many enemies per attack.</p><p>Fire - the fire turret is the most unique, constantly spinning, it damages all enemies within its short range. Fire turrets are great at lowering enemies hitpoints as the pass through, allowing other towers to finish of an easy kill. It is more expensive than other damage options.</p><p>Support - the support tower buffs all other (non-support) towers in its range, increasing the range at which those towers can fire at enemies. This simple buff has unique uses for strategy in combination with other towers.</p><p>When a tower damages an enemy, the enemy will flash red to indicate they got hurt.<br/></p><p><strong>--- art ---</strong></p><p>The map was constructed using Kenney's brilliant 'Tower DefenseKit'</p><p>Link to the itch.io page</p><p>The enemy assets have been purchased by a fellow group member from the unity asset store. It is Meshtint studio's adorable 'Monster Ultimate Pack 02 Cute Series'.</p><p>Link to the unity asset store</p><p><strong>--- potential improvements ---</strong></p><p>besides fixing a small bug that has to do with replacing towers by buying a new one on a tower base that already contains a turret, I would mostly improve the game in quantity.</p><p>Adding new unique enemies and turrets will greatly spice up the strategy involved in playing the game. </p><p>Different levels with unique pathways and turret placements will keep the game fresh for players.</p><p>I would add a upgrade path to towers, as to improve them outside of the buff from support turrets, so they may shine in their own unique ways.<br/></p>", "metacritic": null, "released": "2023-01-12", "tba": false, "updated": "2023-01-13T06:09:40", "background_image": "https://media.rawg.io/media/screenshots/ef5/ef5d48d0448b19b0734a361085808213.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Grc0"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}