{"id": 907626, "slug": "insomnia-itch-insomnia", "name": "INSOMNIA (itch) (INSOMNIA)", "name_original": "INSOMNIA (itch) (INSOMNIA)", "description": "WHAT IS INSOMNIA?\r\n<p><strong>Insomnia</strong> is a survival horror set in an ordinary family home. You are a divorced father, your daughter has been possessed by a powerful demon who replicates her nightmares in the real world. When she falls asleep in the night it's a rush for life for you to protect her but it's time to put an end to it. You have finally found an exorcist able to free your daughter from her torment and you will have to survive your last night waiting for his arrival.  Will you be capable enough to survive? <strong>Good luck<strong>.</strong></strong>\n</p>\n\r\nTHE GAME\r\n\n<p>The game will take place entirely in your home. Your daughter's nightmares will be real, they will torment you and try to kill you. You will have to be able to counter them and keep them at bay until the end of every hour of the night, after which the difficulty will increase making the game more and more challenging. Be careful, everything you see and hear may or may not be real. Don't let your insanity get the better of you.\r\n</p>\n\r\nFOLLOW US!\r\n\n<p>Follow us everywhere we go! (Especially on Discord!) www.linktr.ee/insomnia_indie\r\n</p>\r\n\r\nPLEASE READ\r\n\n<p>This is an Early Demo that I decided to release for the purpose of hearing from you what you think. Please I don't want any donation but please leave me your feedback and ideas here or everywhere you want as it will be crucial for the development of this game and a massive help for me in every way. An infinite thank you to who will! :)\r\n</p>", "metacritic": null, "released": "2023-01-12", "tba": false, "updated": "2023-01-13T06:21:45", "background_image": "https://media.rawg.io/media/screenshots/371/371b51644e81c0eee988c4b81f763ea5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Insomnia"], "genres": [], "publishers": [], "esrb_rating": null}