{"id": 907698, "slug": "road-2", "name": "Road.", "name_original": "Road.", "description": "<p>The project is a personal research output from the Royal College of Art - a minimalist game prototype that attempts to apply academic concepts to the gaming medium.</p>\n<p>In conducting my research on Context, I began by broadening my orientation and thinking to consider what was most pressing to me and most worthy of the attention I was devoting to it. The timeliness and level of discussion of the comments on the reading material in this regard became the source of my theoretical choices, thus the selection of Xiang Biao and Han Byung-Chul's material was in line with the source of my identity, and also the fact that they did provide very effective and critical thinking content in my first instance. At the same time, Xiang Biao's research approach to the observation and use of new content media helped me to further ignite this idea. The next step was to engage myself in this context, gaining a wealth of valuable thoughts and details in different interviews and tutorials, which helped me to guide the development of the narrative in the work. During the research process for the production, I participated in different creative communities of the game to get more work that was smaller in size, less developed and had time for cross-disciplinary discussions. These processes have helped me to define the niche of my work and to test my work within a moderate learning and development curve.</p>", "metacritic": null, "released": "2023-01-12", "tba": false, "updated": "2023-01-13T06:48:24", "background_image": "https://media.rawg.io/media/screenshots/0c4/0c471b7f643afe157a4ee7f3c8c65fcd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["WesJiaxiZhou"], "genres": [], "publishers": [], "esrb_rating": null}