{"id": 907839, "slug": "tablero-matematico", "name": "Tablero matematico", "name_original": "Tablero matematico", "description": "<p>Tablero Matemático es un juego muy adictivo y entretenido.</p>\n<p> Completa, poniendo los números que faltan para que concuerden con el resultado.</p>\n<p> Instrucciones del juego:</p>\n<p>- Cuando se inicie el juego, aparecerán 9 casillas, solo aparecerá un número, para guiarte para completar el Tablero matemático, Cada vez que pases de nivel, ese numero cambiara y no siempre aparecerá en la misma posición, son 3 filas y 3 columnas con sus respectivos resultados.\r\n  </p>\n<p>- Toca las casillas en blanco y cambiaran a color rojo, ahora es cuando debes pulsar un numero del 1 al 9.\r\n  </p>\n<p>- Fíjate en el resultado final, para colocar el número que falta.\r\n  </p>\n<p>- Si aciertas el numero de la casilla, ese número se pondrá en verde y ya no los puedes cambiar.\r\n  </p>\n<p>- Si te equivocas al poner el número, ese número se pondrá en rojo y te contará un fallo.\r\n  </p>\n<p>- Si pulsas en la casilla en blanco y no pones ningún número, te contara un fallo.\r\n  </p>\n<p>- puedes borrar el número, que has colocado mal con el botón CLR.\r\n  </p>\n<p>- Dispones de dos segundos para introducir un número.\r\n  </p>\n<p>- Dos modalidades de juego (Con tiempo y sin tiempo).\r\n  </p>\n<p>- Dispones de 90 segundos para completar el tablero.\r\n  </p>\n<p>- En los dos modos de juego, cuando falles tres veces, se acabará el juego.\r\n  </p>\n<p>- Cuando introduzcas los 8 números faltantes y no hayas completado el tiempo, pasaras de nivel.\r\n  </p>\n<p>- El numero de ayuda que te da el juego aparecerá en blanco y ese numero tampoco se puede cambiar.\r\n  </p>\n<p> Características del juego:</p>\n<p>- tres filas y tres columnas, con sus respectivos resultados.\r\n  </p>\n<p>- Guardó la puntuación más alta, en cada modo de juego.\r\n  </p>\n<p>- Nueve botones con nueve números y un botón de borrado.\r\n  </p>\n<p>- Niveles ilimitados.<br/></p>\n<p>- Juego de acción con emocionantes sonidos, música y animaciones.\r\n</p>", "metacritic": null, "released": "2023-01-12", "tba": false, "updated": "2023-01-13T07:42:38", "background_image": "https://media.rawg.io/media/screenshots/6f5/6f550e83d71868a2f2df7b4311d9da60.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Neda Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}