{"id": 907977, "slug": "solar-assaulted", "name": "Solar Assaulted", "name_original": "Solar Assaulted", "description": "How to Play\r\n<p>The sun is under attack and you're the last line of defense in this Galaga-style shoot-em-up. Fight your way through waves of enemies as you make your way from the edge of the solar system to our sun.</p>\r\nControls\r\n<ul><li>Arrow Keys - Move\r\n</li><li>(O)/Z - Shoot\r\n</li><li>(X)/X - Toggle selection for Blast and other special moves\r\n</li></ul>\n<p>Once the X button has been hit an icon will flash next to the ship, indicating that a special move is ready to be selected. If unlocked tapping an arrow key will activate the corresponding special move\r\n</p>\n<ul><li>Left/Right - Barrel Roll \r\n</li><li>Up - Blast\r\n</li></ul>\n<p>If the special move is not available the icon will disappear and you can resume flying like normal</p>\r\nUpgrades\r\n<p>Enemies will drop items that increase your shield/health, charge your secondary weapon, or unlock upgrades for your ship. Collect these charge your upgrade meter. Once full the upgrade selection menu will automatically populate. Choose an upgrade to get back to flying.</p>\r\nCredits\r\n<p>This game was written and designed by Alex Hayden, who works in customer service. This is my very first game and honestly my first experience coding in any way. This game was put together while following the Lazy Devs Academy video channel tutorial. \r\n</p>\n<p>Special thanks to Krystian Majewski for the extremely thorough and well-presented lessons. I've wanted to make a game for well over a decade and this tutorial series was exactly what I needed to get a completed game published. \r\n</p>\n<p>Thank you to my play testers: Nick, Phillip, and Wesley. Your feedback was invaluable. \r\n</p>\n<p>Thank you for playing!\r\n</p>\r\nDisclaimer\r\n<p>Feedback is definitely appreciated! I'd like to make more games and I'd like this game to be fun to play!\r\nThat being said, I'm aware of a few issues with this game:\r\n</p>\n<ul><li>Occasional waves get skipped entirely\r\n</li><li>[nil] displays when you are out of upgrades\r\n</li></ul>\n<p>I'd love to fix these, but I'm totally out of tokens. I'd be happy for any tips for guidance as well bugs you see that I don't have listed.\r\nThanks for the help!\r\n</p>", "metacritic": null, "released": "2023-01-11", "tba": false, "updated": "2023-01-13T08:37:55", "background_image": "https://media.rawg.io/media/screenshots/967/96784e4528078f335bd08f144d1f89a4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "macOS", "PC"], "developers": ["Mosthumble09"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}