{"id": 908087, "slug": "ash-of-gods-the-way", "name": "Ash of Gods: The Way", "name_original": "Ash of Gods: The Way", "description": "Build winning decks of warriors, equipment, and spells from four different factions in this story-driven tactical card combat game. Battle your way through a series of major tournaments, each with their own opponents, battlefields, and even rules. Earn new cards and upgrade your favorites, then combine them into any number of decks: you’re free to experiment as much as you like! Do prepare carefully for key battles with major characters: you’ll only get a few chances before defeat will change the course of the story, though the game continues…<br/><br/><br/><br/>All the while you will meet new characters, have conversations, and make decisions that will affect the fate of the entire world.<br/><br/><br/><br/>You play as Finn, a young man whose only hope of preventing a neighboring nation from attacking his home is to master the card game they use to teach aristocrats the art of warfare: the Way. Infiltrate the tournaments they hold, and you can get close to their elite commanders. What you do once you get there will be up to you. Just remember, your decisions have consequences!<br/><br/>The core gameplay is deceptively simple: every turn you can play one warrior, and one support card, then all your units will advance towards the enemy and attack if they can! But the challenge comes in what combinations you choose, how you build your deck, and when you hold back cards for a better opportunity. Your opponents play by the same rules… most of the time. Each battle can have different rules or special features that can be exploited by smart deck building!<br/><br/><br/><br/>Warriors range from front line brutes to fragile archers and supporting spellcasters. Equipment cards buff warriors on the battlefield, while spells can aid your fighters or harm the enemy. There’s no one way to play - build a deck that uses tough fighters with armor and healing to grind down your opponents, roll in with high damage archers and poison wielding bandits to put down enemy warriors before they can even react, and much more. With a huge range of cards to choose from, the number of possible combinations is enormous.<br/><br/><h3>EVERY BATTLE IS A NEW CHALLENGE!</h3><br/>Each battle in Ash of Gods: The Way is a carefully crafted test of your skills with different objectives and opponents. Whether you’re capturing checkpoints, defending your commander from a deadly enemy or fighting a series of one on one duels you’ll need all your wits about you to prevail. The outcome of every battle is significant!<br/><br/><br/><br/>Make sure to use every detail of the battlefield to your advantage. You’ll encounter traps which can be a danger or an opportunity depending on your strategy, and power runes which could change the course of a battle entirely!<br/><br/>If your current tactics aren’t working out, just switch out your cards and upgrades to try something different — there’s no penalty for experimentation or changing strategy.<br/><br/><h3>CHOOSE YOUR WAY</h3><br/>Ash of Gods: The Way is a novel genre mix of RPG style conversations, a collectible card game, and a turn-based tactical battle — your choices in all of these areas will influence the outcome of your story. <br/><br/><br/><br/>You build your deck in Ash of Gods: The Way with a combination of character cards and support cards. Your characters are deployed to the battlefield, while support cards boost your characters or cast powerful spells. Both types of card can be upgraded to become stronger, and characters can even gain brand new skills like cunning counter-attacks or armor smashing strikes.<br/><br/><br/><br/>Each card belongs to one of five distinct factions in the game, all with their own synergies and metagame strengths. Earn new cards by winning battles, buying them, or completing special tasks. You can mix and match faction cards as you wish, or focus on just one — it’s your call — your way.<h3>INTERACTIVE STORY WITH MULTIPLE ENDINGS</h3><br/>The story centers on young Finn who is sent on a dangerous mission that could stop a murderous war… but on his journey he'll learn that some of his enemies are quite different from what he’s been told. There will be hard decisions to make and Finn will have to live with the consequences. In addition to the non-linear main plot, told through (fully voice acted) cutscenes and conversations, there are also side quests to explore.<br/><br/><h3>EXPLORE OTHER GAMES IN THE ASH OF GODS UNIVERSE!</h3><br/>Ash of Gods: The Way is our second game in the Ash of Gods universe — our first game, Ash of Gods: Redemption is a turn-based RPG with tactical combat, CCG elements and a heavily interactive story with major decisions to make which are literally life or death. But even if your leader falls it isn’t the end — the story will continue…<br/><br/>https://store.steampowered.com/app/691690/Ash_of_Gods_Redemption/<br/><br/>There’s even more to discover on our website! Take a look if you’re interested in games for other platforms. And last but certainly not least, you can join us on Discord for all the latest Ash of Gods updates!<br/><br/>", "metacritic": null, "released": "2023-01-11", "tba": false, "updated": "2023-07-21T07:09:10", "background_image": "https://media.rawg.io/media/screenshots/e61/e6108d3ec5b0bd6e62c85817a7ab0e3d.jpg", "website": "http://ashofgods.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 7, "toplay": 7, "dropped": 2, "playing": 2}, "playtime": 7, "achievements_count": 37, "ratings_count": 4, "suggestions_count": 434, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["AurumDust"], "genres": ["Adventure", "RPG", "Strategy", "Indie", "Puzzle"], "publishers": ["AurumDust", "Game Seer"], "esrb_rating": null}