{"id": 9081, "slug": "strike-knight", "name": "Strike Knight", "name_original": "Strike Knight", "description": "STRIKE KNIGHT is the next great free and highly addictive game from Backflip Studios, makers of the popular PAPER TOSS.  Please enjoy this timing based arcade bowling game with great caution, as it is completely and totally absorbing.  Hours will be lost, work neglected and friends upset at the amount of time you spend with STRIKE KNIGHT.<br/><br/>STRIKE KNIGHT is a puck bowling game of timing and skill where your goal is to play well enough to avoid the constant heckling of the knight himself.  Fear not young squire, for you have it in you to play through the taunts of the STRIKE KNIGHT.  <br/><br/>The scoring system is slightly different than traditional bowling, it is based on your ability to time your shots in conjunction with your ability to pick up spares and strikes.  If you love flinging a puck at stuff, cool sounds, intense animations, timing based challenges and the outright admiration of your friends and family, then you will love this game.  Please enjoy!<br/><br/>STRIKE KNIGHT includes:<br/>• Puck bowling physics<br/>• Insanely cool knight animations<br/>• Pass-and-play mode for up to 4 players<br/>• Real heckling from knight and other patrons<br/>• Bowling sounds<br/>• Dimly lit tavern scenario<br/>• Timing based flash bar<br/>• Real lightning sounds and effects<br/>• Plus+ integration<br/>• Awe inspiring voiceovers<br/>• Infinite replayability<br/><br/>We at Backflip Studios love making games and we appreciate that you play them with passion.  Please continue to send us valuable feedback.<br/><br/>Try out our other games:  PAPER TOSS, RAGDOLL BLASTER 2, HARBOR HAVOC 3D, RAGDOLL BLASTER and PAPER TOSS: WORLD TOUR.<br/><br/>If you care to follow us on Twitter:  @backflipstudios<br/><br/>Thank you for playing!", "metacritic": null, "released": "2010-05-17", "tba": false, "updated": "2019-10-22T14:30:16", "background_image": "https://media.rawg.io/media/screenshots/9ac/9ac9c8a03b01d61a361503852c0f6445.jpeg", "website": "http://www.backflipstudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Backflip Studios"], "genres": ["Action", "Sports"], "publishers": ["Backflip Studios"], "esrb_rating": "Everyone 10+"}