{"id": 908117, "slug": "beat-shot-death", "name": "Beat | Shot | Death", "name_original": "Beat | Shot | Death", "description": "<p><strong>Beat | Shot | Death </strong>est un jeu de second semestre de seconde année au sein de l'ICAN. Il a été réalisé par François Jourdain ,Denis Yang et moi-même.</p><p><strong>Inputs / Touches :</strong></p><p>Visée : Déplacement souris</p><p>Tir : Clic gauche</p><p>Déplacement : ZQSD</p><p>Roulade : Espace</p><p><strong>Pitch :</strong> Incarnez un as de la gâchette et infiltrez un laboratoire ennemi afin d'éliminer un maximum d'opposants tout en gardant un bon rythme de tir.<br/></p>\n<p>\n</p>\n<p><strong>But :</strong> Éliminer tout le danger en fermant toutes les portes et en tuant tous les ennemis.\r\n</p>\n<p>\n</p>\n<p><strong>Gameplay : </strong>Shoot them up à la troisième personne, en vue Top Down. Le joueur doit agir en rythme avec le tempo de la musique qui est indiqué par l'environnement et son viseur. Il peut donc tirer ou rouler, et réussir ces actions si elles sont en rythme. De plus, s'il réussit à réaliser d'affilé plusieurs actions en rythme, il augmentera son combo qui lui permettra de faire plus de dégâts. Il peut aussi se déplacer librement dans l'espace tout en étant soumis à des lois physiques similaires aux nôtres. Le viseur lui, n'est pas au centre de l'écran, mais sur la souris, ce qui permet d'orienter l'avatar, qui lui est au centre de l'écran. Le caractère des ennemis permet au joueur de les utiliser les uns contre les autres. Les joueurs devra donc tirer sur les boutons de portes afin de les fermer et de stopper le flux constant d'ennemis. Une fois toutes les portes fermées et les ennemis éliminés, le joueur devrait faire face au boss (non créé dans notre dernière version).\r\n</p>\n<p>\n</p>\n<p><strong>Genre :</strong> Shoot them up</p>\n<p><strong>Plateforme :</strong> PC\r\n</p>\n<p><strong>Nombre de joueur : </strong>1 joueur\r\n</p>\n<p><strong>Public cible : </strong>Hard Gamer / Soft Gamer</p><p><strong>PS :</strong> Cet version n'est qu'une version de test, elle ne sera pas améliorée. Il n'y a aucun feedback pour la roulade si on la rate et il reste beaucoup de bugs, cependant, les mécaniques principales du joueur fonctionne et le combo est fonctionnel.</p>", "metacritic": null, "released": "2023-01-11", "tba": false, "updated": "2023-01-13T09:34:57", "background_image": "https://media.rawg.io/media/screenshots/593/593b5f98e7ca07fb2ae64f2de0468775.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kimjy"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}