{"id": 90816, "slug": "beneath-floes", "name": "Beneath Floes", "name_original": "Beneath Floes", "description": "<p><em>Beneath Floes </em>is a short work of interactive fiction written by Kevin Snow, the creator of Bravemule, with artwork from Patrick Bonaduce and sound from Priscilla White.</p><p>Qikiqtaaluk, 1962. The sun falls below the horizon and won't return for months. You wander the broken shoreline, wary of your mother's stories about the qalupalik. Fish woman, stealer of wayward children: she dwells beneath the ice.</p><p>Thanks to people's support from a Kickstarter campaign, <em>Beneath Floes </em>is available in English and Inuktitut for free.</p><p><strong>Credits<br/></strong></p><p>Bravemule<br/>Story: Kevin Snow<br/>Artwork: Patrick Bonaduce<br/>Sound: Priscilla Snow<br/>Logo Design: Mike LeMieux<br/><br/>Pinnguaq<br/>Lead Translation: Susa Qappik<br/>Alethea Arnaquq-Baril<br/>Ryan Oliver<br/>Michael Despault<br/>Evan Despault<br/>Nyla Innuksuk<br/></p><p>Many thanks to Pinnguaq and the Nunavut Film Development Corporation for assistance with oversight, feedback, and distribution. All faults are my own. Additional thanks to the localization's 143 Kickstarter backers, who made this possible with their support.<br/></p><p><strong>Content Warning<br/></strong><em>Beneath Floes</em> contains depictions of violence.</p><p><strong>Reviews</strong><br/></p><p><em>\"[Beneath Floes is] also about storytelling, and what stories mean as they're passed on and retold to different people across years. It's a mite spooky and unpleasant and cruel and warming and I'll stop listing adjectives if you go play it.</em><em>\"<br/></em>- Alice O'Connor, Rock, Paper, Shotgun</p><p><em>\"Aside from the chilling sound design, the words themselves are presented rhythmically, emulating the master oral storyteller's attention to tempo and cadence. The major beats in the story make for a gripping experience that's sustained throughout, the call of the qalupalik as bewitching as it is frightening.</em><em>\"</em><br/>- Jess Joho, Killscreen</p><p><em>\"I appreciated, too, the passages where material that relies on cultural context is presented just clearly enough for someone not native to the Arctic to understand, but yet not overly explained.</em><em>\"</em><br/>- Emily Short</p>", "metacritic": null, "released": "2015-01-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/336/3363e993933a6c2aace0c4f9519ebcd6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Kevin Snow"], "genres": [], "publishers": [], "esrb_rating": null}