{"id": 908298, "slug": "a-maze-ing-zombie-antics", "name": "A-maze-ing Zombie Antics", "name_original": "A-maze-ing Zombie Antics", "description": "<p>By December of 2022, I had abandoned Cocos2d-x and gotten the hang of Godot. I wanted to try out the new tilemap system in Godot 4, so I decided to take another stab at the zombie game. I started the project on December 18th.</p>\n<p>By around New Years, the project was going so smoothly, I thought to myself, \"If I had a deadline to release a minimal deliverable product, anything that could technically be called a complete game, within one month's work, I could probably pull it off.\"</p>\n<p>Then I thought, \"This could actually be a good way to stay focused on releasability and avoid the creeping featurism that's ruined my past projects: Every month or so, I'll release a prototype showcasing the features I've implemented so far. I'll shoot for one prototype per letter of the alphabet, and see how many letters it takes to make a respectable game.\"</p>\n<p>Now, it's January 10th 2023, 8 days ahead of my deadline, and I have not made a respectable game. I have made a complete game. It has a title screen. It has one level, which is more than zero. There is a player character you can control with a mouse, keyboard, or controller. There are zombies you can kill, and that will try to kill you. There are baseball bats you can pick up, equip, and use to kill zombies more efficiently. There is a maze you are trying to escape from before the zombies kill you. You can win by escaping the maze or lose by being killed by zombies.</p>\n<p>It's not a good game. It's complete game. It's called \"A-maze-ing Zombie Antics\". See? even the title is terrible. It needs optimizing and almost certainly has plenty of bugs I haven't found yet.</p>\n<p>But it's an actual game you can play, and that's all I was going for this month.</p>", "metacritic": null, "released": "2023-01-10", "tba": false, "updated": "2023-01-13T10:44:37", "background_image": "https://media.rawg.io/media/screenshots/104/10441c7301efcbd17f82c063111b6e37.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MrSluagh"], "genres": ["Action"], "publishers": [], "esrb_rating": null}