{"id": 90832, "slug": "age-of-conquest-iv-itch", "name": "Age of Conquest IV (itch)", "name_original": "Age of Conquest IV (itch)", "description": "<p>\r\n\tAge of Conquest is a turn-based grand strategy wargame. Command your armies in one of the many ancient and medieval countries including the Roman Empire, the Inca, France, Russia, Japan or the Chinese Dynasties. From Rome to Asian nations, you create your own warring experience. Wage colossal wars solo, against the AI, or take on your gaming friends in cross-platform multiplayer games. Form alliances and fight co-op style with the AI and other players for ultimate victory.\r\n</p>\n<p>\r\n\tRange of functionality is comprised of expansion, diplomacy and managing your nation's finances and economy. You do your best to keep your population happy. You forge alliances and together you take on your enemies. Are you ready for the challenge? Will your place be in the history books or in the mud? Assemble your armies, take on the world and achieve greatness in this epic historical strategy game.\r\n</p>\n<ul>\n<li>Turn-based grand strategy game with maps &amp; nations from all over the world.</li>\n<li>Challenging AI for single player games based on a genetic algorithm.</li>\n<li>Cross-platform multiplayer &amp; hotseat-Play including co-op team games.</li>\n<li>Diplomacy management of economy &amp; population.</li>\n<li>Map scenarios including Europe, Colonization, Asian Empires, World Conquest and many more.</li>\n<li>Map editor and a central server to host and distribute player-modded bundles.</li>\n<li>Empires including the Roman Empire, Carthage, Persia, Celts and Inca amongst others.</li>\n<li>High score, playing statistics, achievements and multiplayer ELO-ranking.</li>\n<li>Engaging music, sound effects and fantastic graphics.</li>\n</ul>\n<p>\r\n\tThe game includes one map for FREE. Other maps are available for download and cost <strong>$3.99+ for single maps or $19.99 for all maps</strong>. Multiplayer games are generally free to join. Hosting multiplayer games costs 5 cents/game. There is no subscriptions. This game is NOT pay-to-win.\r\n</p>\n<p>\r\n\tThe game does not contain any spyware, malware or third party software of such kind. Although the game has been thoroughly tested, it is possible that the game runs slow or not at all on certain devices. If you are having problems or are not happy with your purchase, feel free to contact us via email at any time. For a full refund please include your order information for a speedy response.\r\n</p>\n<p>\r\n\tIf you like this game, please also try our other strategy games. You should be able to find the games in the same marketplace!\r\n</p>\n<p>\r\n\tThanks &amp; Enjoy the Game!<br/>noblemaster ]:-D</p>", "metacritic": null, "released": "2016-04-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9b1/9b10b0a04f4037e1ecf19fe31c9d3e43.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["noblemaster"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}