{"id": 90843, "slug": "the-esc4pe", "name": "The Esc4pe", "name_original": "The Esc4pe", "description": "+38.000 visits &amp; +20.000 downloads! Thanks all of you, guys! :D<br/><br/>Featured on GameJolt marketplace with +30.000 downloads! \r\n<p>This project is made as practical exercise for the \"Master in Video Game Development with Unity3D &amp; 3DS Max Official Autodesk (MPV)\" of CICE Madrid (http://cice.es/curso/master-en-desarrollo-de-videojuegos-con-unity-y-3dsmax/).</p>\n<p>\r\n\tA \"primitive shooter\" developed in one month with technical restrictions based on the topics seen in class until the project start date. The game is not optimized (its performance is not stable).\r\n</p>\n<p>\r\n\tSupport \r\n\t<strong>XBox360 Controller</strong> in all PC platforms (implementing the input map for Linux and OSX following the information found on this wiki).\r\n</p>\n<p>\r\n\tThe game is initially designed to be played in 5~10 minutes (It can take 20~30 minutes to complete).\r\n</p>\n<p>\r\n\tDeveloped and full tested under:\r\n</p>\n<ul>\n<li>Intel Core i5-2500 @ 3.30GHz</li>\n<li>8GB RAM</li>\n<li>AMD Radeon HD 6800 Series (with Crimson drivers)</li>\n<li>Windows 10 Pro x64</li></ul>\r\n\r\nLinks\r\n<ul>\n<li>Game web site: http://portfolio.visualstudioex3.com/2017/02/20/the-esc4pe-a-primitive-shooter/</li>\n<li>Post on my blog, Visual Studio EX3, with more details (ES): http://visualstudioex3.com/blog/gamedev/the-esc4pe-un-primitive-shooter-hecho-en-unity3d/</li>\n<li>Twitter (ES): @ex3_tlsa</li>\n<li>Facebook (ES): http://www.facebook.com/visualstudioex3</li>\n</ul>\r\n\r\nAfter start a new game, first learn the input controls\r\n<p>\r\n\tYou can find the input controls layout, for \r\n\t<strong>Keyboard &amp; Mouse</strong> and <strong>XBox360 Game Controller,</strong> in the main menu by clicking on <strong>Controls</strong> button.\r\n</p>\n<p>\n</p>\n<p>\n</p>\r\n\r\nChange log\r\nUPDATED 14 mar 2017: Fixed mouse issue\r\n<p>Some user reporting a problem with the mouse control. The problem seems to be a great acceleration or zero response, which makes the game unplayable. This was a bug in my code, and as promised, I publish an new update with the bug fixed. I also take this opportunity to include some improvements and changes:</p>\n<ul><li>Fixed problem with mouse input (thanks for you feedback, guys!). Reprogrammed the mouse input. Now, you can configure both horizontal and vertical sensitivity in a major range of values.</li><li>Added trigger event when the first sniper soldier not spawn their weapon when he died. In this case, if the player advances in the scenary, automatically get the rifle weapon.</li><li>Fixed some colliders in some columns on tower base in outdoor zone (remove transparent zones).</li><li>Added some fences in outdoor zone for forcing the player to pass near of the tower ladder.</li><li>Minor changes on first area (a little surprise when you pick up the second handgun).</li></ul>\n<p>Ensure that you downloaded the last update. You must see in the bottom of the main menu the following text: <strong>UPDATE #2 (14 MAR 2017)</strong><br/></p>\r\nUPDATED 02 MAR 2017: Fixed download issue\r\n<p>\r\n\tIn the past days, several users have experienced some kind of problem with the download links. Initially, the download links pointed to the files in my portfolio web site (an external server). Now, I uploaded on itch.io the download files. This will be fixed the download issue on some users.</p>\n<p>Take this opportunity, and thanks for the feedback received from the video reviews, I fixed some little bugs and implement some improvements:<br/></p>\n<ul><li>Fixed final message text.</li><li>Fixed a couple of sound effects that not working.</li><li>Now, the grenades explodes inmediately on enemy contact (This will make grenades more useful!)</li><li>Increased the Final Boss enemy life (remember the grenades!)</li><li>The items in Final Boss arena (placed on columns) now are respawnables: respawn mid armor, mid medpacks, mid shotgun ammo and small grenades pack after 10 seconds of picking up the last item. This prevents the player from running out of ammo or life &amp; armor in the Final Boss battle.</li></ul>\n<p>Have fun! :)</p>\n<p>P.D.: This game will not receive new updates, bug fixes or new version with more levels. Remember, It's only a practical exercise made for my game development master degree i'm currently taken :)<br/></p>", "metacritic": null, "released": "2017-02-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0d4/0d4195fd815b44578289407853eca4f3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 418, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["[EX3]"], "genres": ["Action", "Shooter", "Adventure"], "publishers": [], "esrb_rating": null}