{"id": 90849, "slug": "godhood-itch", "name": "GODHOOD (itch)", "name_original": "GODHOOD (itch)", "description": "<p>\r\n\tGODHOOD details the interactions between Riff, a young writer, and his original character, Avadra, who suddenly and inexplicably manifests herself in real life through circumstances unknown! Knowing what his character is capable of and fearing the worst, Riff sets out to masquerade as one of her followers in an attempt to prevent the very events he wrote about from taking place.\r\n</p><p>\r\n\tThe gameplay revolves around attacking enemies to the rhythm of the music in order to build up flow, unleashing massive explosive attacks on down beats to defeat hordes of enemies in a single blow. Players can switch between rhythms depending on the given situation and can even defy the rhythm if the moment demands it, but true power lies within the explosive attacks and to perform them, you need to keep your cool.\r\n</p>GODHOOD Alpha:<p>\r\n\tGODHOOD is still very early in development and his just entered open alpha! The alpha version of GODHOOD features the first half of the first chapter, as well as a WIP introductory cutscene!\r\n</p>Planned Features:<p>\r\n\tPlanned features for the complete product include:\r\n</p><ul>\n<li>Seven chapters featuring unique gameplay and music</li>\n<li>Multiple difficulties that do more than just scale the damage</li>\n<li>Practice Mode! Get comfortable with the music before you play with it IMPLEMENTED!</li>\n</ul>", "metacritic": null, "released": "2016-03-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9d4/9d4264d255a6f0d57b68b5d099f62a91.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GekidoRising"], "genres": ["Action"], "publishers": [], "esrb_rating": null}