{"id": 90878, "slug": "ananias-roguelike-itch", "name": "Ananias Roguelike (itch)", "name_original": "Ananias Roguelike (itch)", "description": "<p>\n<br/>\n</p><p>\r\n\tAnanias is a dungeon adventure game in which you explore an ancient ruins complex fighting its monstrous inhabitants and trying to survive to the bottom level, where you may find an ancient artifact to save the world.Every time you play the game will create a new dungeon full of challenges and surprises for you in 5 different environments populated with monsters and ancient magical artifacts.\r\n</p><p>\r\n\tThere are eight different player classes, each one designed with an unique play style. Some of them are combat focused while others must rely on the items found on the dungeon to survive.<br/>\n</p><p>\r\n\tAs you advance through the game, you will find more than 40 different monsters with distinct skills and features, you will be able to charm them using magic spells and make them follow you in your quest; using ancient magic found in the dungeon you will also unlock the powers and skills hidden on their evolved forms.\r\n</p><p>\r\n\tUnlike classic roguelikes adapted to modern media, in Ananias there is no cumbersome movement or complex commands, however all the features from the genre that make the games fun are kept: turn based combat, random level generation and long term item strategy are among the things that make every adventure into the dungeon enjoyable.\r\n</p><p>\r\n\tYou can also play along with your friends in the online mode; the game keep all friends up to date with their adventures in real time, so you can set up challenges or just have fun seeing your friend's characters die in the dungeon.\r\n</p>Alchemist<p>\n</p><p>\r\n\tShoots liquid at enemies (Acid, Liquid Fire, and other potions)\r\n</p><p>\r\n\tCan mix reagents into potions without danger of an explosion.\r\n</p>Arcane<p>\n</p><p>\r\n\tCasts offensive spells without danger of them backfiring\r\n</p><p>\r\n\tCan cast the most powerful spells\r\n</p><p>\r\n\tExtends power of magic wands\r\n</p>Paladin<p>\n</p><p>\r\n\tCan use all weapons and armor without becoming encumbered\r\n</p><p>\r\n\tParries attacks using its weapons\r\n</p><p>\r\n\tExtends lifetime of weapons\r\n</p>Hunter<p>\n</p><p>\r\n\tWhen fighting using a bow...\r\n</p><p>\r\n\t...never misses a shot\r\n</p><p>\r\n\t...performs critical damage\r\n</p><p>\r\n\t...prevents arrows from breaking\r\n</p><p>\n<strong>Fellowship Edition</strong>\n</p><p>\r\n\tThe fellowship edition allows you to access the four extra classes: Barbarian, Slayer, Monk and Sage. If you like the game please support it's development by acquiring it. More content is always added!\r\n</p>Slayer<p>\n</p><p>\r\n\tCan slash through enemies while walking\r\n</p><p>\r\n\tJumps over the enemies from the distance\r\n</p><p>\r\n\tExpert with throwing knifes and axes\r\n</p>Barbarian<p>\n</p><p>\r\n\tCharges against enemies while running.\r\n</p><p>\r\n\tGains strength when low on health.\r\n</p><p>\r\n\tRecovers health by defeating foes.\r\n</p>Ailorus Monk<p>\n</p><p>\r\n\tAttacks enemies from the distance with a flying kick.\r\n</p><p>\r\n\tHis unarmed attacks have increasing damage based on his power.\r\n</p><p>\r\n\tImmune to poison and spell maladies.\r\n</p>Dumeril Sage<p>\n</p><p>\r\n\tCan cast elemental spells scrolls several times and unleash their full power.\r\n</p><p>\r\n\tCan cast high level spells safely\r\n</p>", "metacritic": null, "released": "2015-04-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a15/a15df966b453d09960f09d4b9c05d9ac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Slashie"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}