{"id": 908706, "slug": "henrys-solid-adventure", "name": "Henry's Solid Adventure", "name_original": "Henry's Solid Adventure", "description": "<p>Henry's Solid Adventure</p>\n<p>Henry's Solid Adventuer is a game made by me alone. This is a school project for the classes \"Game development\". The goal of this project is to make a 2D platformer game using the Monogame Platform/Engine.\r\n</p>\n<p>Goal</p>\n<p>The goal of this game is to surive and defeat the evil wizard who is planning to make your beloved land his. A part of your beloved land is already full of monsters roaming around.\r\n</p>\n<p>Controls</p>\n<p>Arrow keys and both Azerty and querty automatic support\r\n</p>\n<ul><li>Left: Q/A/left arrow\r\n</li><li>Right: D/right arrow\r\n</li><li>Jump: Z/W/space bar/up arrow\r\n</li><li>Roll: left/right Shift\r\n</li><li>Attack: A/Q\r\n</li><li>Block: E\r\n</li><li>Interact: F/Enter\r\n</li><li>Inventory: I\r\n</li><li>Pause/Exit: Escape\r\n</li></ul>\n<p>Mouse is only used for clicking buttons\r\n</p>\n<p>Henry</p>\n<p>Henry has a shield that can block any kind of damage. Henry has 20 HP and does 4 base damage.\r\n</p>\n<p>Enemies</p>\n<p>There are 3 main enemies roaming henry's lands:\r\n</p>\n<ol><li>Skeleton: has 9 HP, does 5 damage and detects you whenever you enter his platform.\r\n</li><li>Slime: has 6 HP and does 3 damage. It can only detect you within a few meters.\r\n</li><li>Bat: has 3 HP, does 4 damage and tracks you within a 50 meters range.\r\n</li></ol>\n<p>Boss</p>\n<p>The evil wizard Harry has some tricks up it's sleeves. First of all he has 40 HP and does 5 damage per hit. He can also spell a magic cast and summon a Sand worm.\r\n</p>\n<p>The boss battle has 3 tiers. Tier one is when the boss has &gt;50% HP. Tier 2 when the bos has between 50% and 25% HP, Tier 3 below or at 25% HP. Every tier change, the boss will teleport you back to teh begining and resummon the enemies. His spell casts will also change.\r\n</p>\n<p>Magic</p>\n<p>Can be casted every 5 seconds and does 4 damage on tier one, 7 damage on tier two and 10 damage on tier three. This is only casted in the distance\r\n</p>\n<p>Worm</p>\n<p>Can be casted every 7 seconds near him. It has 50 HP and can be killed.\r\n</p>\n<p>Traps</p>\n<p>Troughout the map are mutliple traps layed out, all will require you to use an ability or a plan so that you won't get killed.\r\n</p>\n<p>Shop and potions</p>\n<p>Every level except the boss fight contains a shop with potions to help you trough the fright. These are Heaing, Damage Buff, Jump Boost, Slow Falling, Speed buff, inivibility and undying. These effects are explained within the shop and inventory display.\r\n</p>\n<p>Thank you for playing this game</p>\n<p>Please feel free to leave me some feedback! My Discord: Temptica#2561 My official Discord server server: https://discord.gg/SEXGwQDQVb\r\n</p>", "metacritic": null, "released": "2023-01-09", "tba": false, "updated": "2023-01-13T13:33:29", "background_image": "https://media.rawg.io/media/screenshots/97a/97a1f2e6f1e927a0cf0d4fa16fc3dc16.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Temptica"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}