{"id": 908854, "slug": "pulling-teeth-ludum-dare-52-jam-version", "name": "Pulling Teeth - Ludum Dare 52 Jam Version", "name_original": "Pulling Teeth - Ludum Dare 52 Jam Version", "description": "In this job, you reap what you sow...\r\nA game made in 72 hours for Ludum Dare 52. Theme: Harvest\r\nStory:\r\n<p>This tooth fairy is trying to save up enough teeth for retirement (he never quite explained what that means though…) and decides that letting nature take its course is too slow.</p>\n<p>In this game, you play as a tooth fairy with a day job working at a candy stand. Make your stand as enticing as possible for the children so they can speed up the process of wiggling out those pesky baby teeth.\r\n</p>\n<p>Then at night, it’s time to harvest. You’ll assume your true form and sneak into homes to collect your bounty. If you were a good sales-fairy, you’ll find some extra teeth under their pillows, wedged free from caramels and chewy delights.\r\n</p>\n<p>But if you get caught, you’ll be chased out into the street with nothing to show for it! So be careful.\r\n</p>\n<p>And no, we don’t know what he does with all the teeth…\r\n</p>\n\r\nControls:\r\nDay Shift:\r\n<p>Press <strong>E</strong> to start your day</p>\n<p>Move between slots at your stand with <strong>A - D</strong> on your keyboard.\r\n</p>\n<p>Click the <strong>Shop </strong>button in the top-right corner to buy candy, use the <strong>Place </strong>button next to each item to set the item out for sale in the slot you’re standing in. <em>Be careful, </em>as you can place over an existing item and lose it forever.\r\n</p>\n<p>Customers will look for their favorite candies, but if you don’t have them, they may haggle to buy a second favorite for less. Or they’ll just walk away angry and you make no money.\r\nYou have until <strong>Sundown </strong>to sell as much candy as you can - and hopefully you’ll be able to find more teeth when the <strong>Night Shift </strong>starts…</p>\n\r\nNight Shift:\r\n<p>Time to reap your reward!</p>\n<p>Choose a house, then <strong>mash the space bar</strong> in time. If you’re fast, you can grab your treasure before anyone notices. Don’t worry, you’ll leave some cash behind as part of the trade.\r\n</p>\n<p>If you fail in your task, you’ll be spotted and chased out into the street with nothing to show for it! So be careful.\r\nYou have until <strong>Sunrise </strong>to complete your dark harvest. Maybe you’ll finally earn enough teeth to retire and get that dream house in the bog you’ve always dreamed of.</p>\r\nCredits:\r\n<p><strong>Art / Animation / Writing:</strong> Deprecat</p>\n<p><strong>Programming / Lead Game Design:</strong> MattH</p>\n<p><strong>Project Management / Music / SFX: </strong>NoStressWes</p>", "metacritic": null, "released": "2023-01-09", "tba": false, "updated": "2023-01-13T14:34:24", "background_image": "https://media.rawg.io/media/screenshots/f4b/f4b3cce45f2916d75f08929f1d327feb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Deprecat", "Kalikazu", "NoStressWes"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}