{"id": 90889, "slug": "try-to-fall-asleep-itch", "name": "Try To Fall Asleep (itch)", "name_original": "Try To Fall Asleep (itch)", "description": "<p>John Herrin survived a horrible accident and in the result, he damaged his brain and memory. Only Dr. Rick Norberg and the friendly robot \"AB\" can help John to recover from his brain damages and restore his broken memory. By falling asleep and rediscovering the past in his dreams, John can restore his memory and remember who caused the unfortunate catastrophe in one of the most secretive laboratories of the \"Revivel\" company. But due to John's brain damage, falling asleep won't be as easy as it seems at first... John will start to see hallucinations and hear sounds that will only make it harder to fall asleep. Only by dealing with his fears and staying calm, he can successfully fall asleep, otherwise, his overwhelmingly huge stress might cause him a fatal outcome...</p>\n\n<ul><li>At the bottom left corner of the screen, there's an \"Info Panel\", which displays John's \"Stress Level\" and \"Sleep Level\". Hallucinations, sounds and visions can cause the Stress Level to rise up and if it reaches 100%, John will have a heart attack and the game will be over. To lower the Stress Level, simply open your eyes and/or turn on the light.</li><li>The Sleep Level shows how tired John is and if it reaches 100%, John will fall asleep. Close your eyes and keep them shut to reach 100%.</li><li>If a monster appears, hide under the blanket and wait until it goes away.</li></ul>\n\n<p><strong>LATEST WORK IN PROGRESS</strong></p>", "metacritic": null, "released": "2018-04-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/41f/41fd1d0255d2042ed7378cc21b8442a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AmberDrop"], "genres": ["Adventure", "Simulation"], "publishers": [], "esrb_rating": null}