{"id": 908973, "slug": "arnold-the-reaper", "name": "Arnold the Reaper", "name_original": "Arnold the Reaper", "description": "Welcome to Arnold the Reaper.\r\nVoting\r\n<p>Please vote on my game &lt;3\r\n    </p>\r\nTheme\r\n<p>This game was written for Ludum Dare 52  with the theme <strong>Harvest.<br/></strong></p>\r\nGameplay - Video\r\n\n<p> <br/></p>\r\nStory\r\n<p>You are Arnold. A pirate who, let's face it, is not the most confident. You aren't really sure why you are on a pirate ship or how your life keeps taking turns. One day your ship gets raided by the government and you take a cannonball to the face—instant kill. You wake up to find Death standing in front of you. For the first time in your life, you confidentially and totally scared out of your life, pull the trigger of your pistol. But Death must exist? What happens? Let's see!<br/></p>\r\nGameplay\r\n<p>You start in the main menu to get a look at the land. Afterwards, you start on the pier while Death instructs you to help repay for what you have done. Third-person run around with combat via a scythe and NPCs that chase and attack you. You have to harvest enough souls in order to fulfil Death's quota for the day since...well you know...you shot him and all.<br/></p>\r\nDeveloper Comments\r\n<p>This game has been a breeze and had nothing but reward developing it. Everything just seemed to go right. I guess that's a nod to my knowledge getting better. The only troublesome part was deploying on Windows. Linux worked the first time and at the time of writing this, I'm on 3 hours trying to debug why it's not compiling. I'm now updating VS and Windows (:. <br/><br/>But the game did go very well. Everything just worked and the UI kit and sounds are just spot on. I've enjoyed working on this. The entire game has given me Family Guy Death / Evil Dead / Grim Fandango vibes. Had a lot of fun working on this.<br/></p>\r\n What I did well\r\n<ul><li>UE5 Nanite, Lumen make the low poly work look smashing. </li><li>The gameplay is fun and I often found myself playing it for fun.</li><li>The main menu is very nice. The music paired with the UI and the background action. (chefs kiss) </li><li>The combat actually works really well with Arnold attacking the NPCs.</li></ul>\r\nWhat I would do better next time\r\n<ul><li>Plan out my tasks ahead of time. I found myself putting more and more notes down of things I wanted to do, towards the end rather than at the start when I could have compensated for them. Basically, better planning</li><li>Get some better animations. Mixamo is good and all, but no root motion and with a very tedious search, there is only so much you can do. I need to find a new kit or find a way to make better animations. (Does anyone fancy gifting me a mocap suit :P)</li><li>Get over the phobia of trying new gameplay styles. I always try to stick to what I know, and it's a bad path to be on. This time I tried to branch into combat more and it worked really well.</li><li>Improve IK Rigging. For some reason, some models and animations just don't pair up nicely. They are either raised on the Z axis or some limbs don't rotate correctly. Like A pose to T pose models, I think?</li><li>I need to get better at lighting and having polished SFX.</li></ul>\r\nNew things I've learnt\r\n<ul><li>UE Behaviour trees. I'm getting better and more confident in them. Solving beginner bugs that I keep creating. </li><li>Animation montages and animation blueprints. I'm becoming a lot more confident in using them. Quickly whipping out animation paths without much googling. </li></ul>\r\nKnown bugs\r\n<ul><li>AI walks into walls / NPCs. Every so often they'll walk into a wall or an NPC and just look confused. Its funny but yeah :P</li><li>On your death, every so often you can spin around on the floor or he tries to put away his weapon. </li></ul>", "metacritic": null, "released": "2023-01-09", "tba": false, "updated": "2023-01-13T15:25:52", "background_image": "https://media.rawg.io/media/screenshots/5d9/5d989c45afa962b286e602058c4f4467.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["D3kryption"], "genres": ["Action"], "publishers": [], "esrb_rating": null}