{"id": 909018, "slug": "crop-drop-heho", "name": "Crop Drop (heho)", "name_original": "Crop Drop (heho)", "description": "Intro\r\n<p>One morning you wake up and realize to your surprise that you have become a farmer. Maybe you were before, but that doesn't matter now. The important thing is that you are standing in front of a farm and you are completely unaware of how to operate it. So you do what any responsible food producer does and read the farm's instruction manual. </p>\n<p>Here you quickly learn that the proper use of the farm is relatively simple, at least the first of the hundreds of pages seem quite clear: you plant stuff like this, and then you harvest it. Some of the stuff grows better when planted next to other stuff.</p>\n<p>So far so good. Now try to grow as much grain as possible and don't let the aliens steal your cows.</p>\r\nThe Game\r\n<p>This game is about planting and harvesting crops.</p>\n<p>To win a level you need to reach the goal written at the top.</p>\n<p>To plant crops or play an effect select a card on the right. Crops come as tiles. You need to find an empty slot on your field for them (red means it does not fit here).</p>\n<p>Click to drop the crops onto your field. Rotate a tile by pressing the right mouse button or using the buttons on the bottom of the screen</p>\n<p>Crops on the field become harvested whenever a row or column is full. Each harvested crop will give you one dollar.</p>\n<p>You will get bonus points for</p>\n<ul><li> Wheat - The more wheat is in a row the more bonus points you get</li><li>Apples &amp; Pears - Apples and pears generate extra points when they are adjacent to each other</li></ul>\r\nEffects\r\n<ul><li>Watering Pot: Crop on selected field will spread to free neighboring fields.</li><li>Spade: Remove crops on all fields covered by the tile.</li></ul>", "metacritic": null, "released": "2023-01-09", "tba": false, "updated": "2023-01-13T15:44:41", "background_image": "https://media.rawg.io/media/screenshots/a41/a412d6e8254e4064ec13f849038dbc94.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["heho"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}