{"id": 90907, "slug": "daddy-lies-demo", "name": "Daddy Lies (Demo)", "name_original": "Daddy Lies (Demo)", "description": "<p>When Finn was eighteen, he knew exactly where he was heading in life. He was slated to graduate high school as valedictorian, attend an Ivy League school to study law on a three-fourths scholarship, walk away with a Masters, and become a politician that represented Ohio in the US Senate. It didn't quite line up with his (admittedly far-fetched) dreams of being a star pianist in the New York Philharmonic, but it was what his <em>father </em>dreamed for him.</p>\n<p>It's difficult to do pursue either of those dreams when your father casts you out onto the street for kissing another boy, though; it didn't take long for both of their dreams to crumble away.</p>\n<p>Now, at twenty-four, Finn has no vision of his future. All Finn has time to do is work, take care of his daughter, work more, and leave work to go to more work. And, when it isn't enough to keep a roof over Ava's head and food in her belly, he works even further into the night with three glasses of Cabernet in his system and the scent of shame clinging to the sheets.</p>\n<p>He can't remember the last time he slept a full eight hours, or even ate a proper meal. He can no longer recall when he last made it through an entire day without a panic attack. In the back of his mind he knows that this is no way to live, but he refuses to complain or torment himself with ideas of what could have been. As far as he's concerned, just the fact that he and Ava are finally away from <em>him </em>is finally something to thank his stars for.</p>\n<p>Until Koloa makes it his mission to teach Finn what it means to finally <em>live</em>.</p>\n<p>Daddy Lies is Studio Senpai's first visual novel, and is currently still in progress with 160k words and several story choices to make. The demo is free, but please consider supporting our Patreon! You can also follow the development on our Twitter and Facebook.<br/><br/></p>", "metacritic": null, "released": "2018-01-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d4d/d4db02a8f7831d37864e633fb964d6ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["StudioSenpai"], "genres": [], "publishers": [], "esrb_rating": null}