{"id": 90909, "slug": "nano-play-alpha", "name": "Nano Play (Alpha)", "name_original": "Nano Play (Alpha)", "description": "<p>\r\n\t🔗 http://nano-racing.com/nano-play<br/>\n</p><p>\r\n\t🇬🇧 \r\n\t<strong>Presentation:<br/>\n</strong>\n</p><p>\n<strong>Introduction:</strong><br/>\r\n\tNano Play is a RC Quadcopter Simulator that plunges the player into the FPV racing world. It incorporates all the characteristics and flight behavior of drones and allows you to learn, to train yourself or simply to have fun, alone or online with your friends.\r\n</p><p>\n<br/>\n<strong>Features:</strong><br/></p><ul><li>\r\n\t Realistic: Flight physics is as realistic as it is pleasant. You can even try your own settings.\r\n\t</li><li>\r\n\t Various environments: urban or natural landscapes, indoors and outdoors.\r\n\t</li><li>\r\n\t Flight modes: \"Angle\" (with stabilization) for beginners &amp; \"Accro\" for experts.\r\n\t</li><li>\r\n\t Quality graphics: balance performance and quality according to your PC.\r\n\t</li><li>\r\n\t Multiplayer: LAN or online.\r\n\t</li></ul><p>\n<br/>\n<strong>Controls:</strong><br/>\r\n\tThe drone is controlled with a gamepad (ex: xbox 360) or with an usb radio controller .\r\n\t<br/>\r\n\tYou will need to go to the game Settings page to set up your gamepad or radio controller.\r\n\t<br/>\n<br/>\n<strong>Disclaimer:</strong><br/>\r\n\tNano Play is still under development. Some features may be incomplete, absent or contain bugs.\r\n\t<br/>\r\n\tWe believe, however, that the project is sufficiently advanced to allow novice or expert pilots to have fun and practice.\r\n\t<br/>\n<br/>\r\n\tWe are very open to feedback and suggestions you can make on this page (Community section) or by email via play@nano-racing.com.\r\n\t<br/>\n<br/>\r\n\tHave fun!\r\n❤️️</p><p>\r\n\t🇫🇷 \r\n\t<strong>Présentation: <br/>\n</strong>\n</p><p>\n<strong>Introduction</strong>:<br/>\r\n\tNano Play est un simulateur de quadcoptère qui plonge le joueur dans le monde des courses FPV (vol immersif). Il reprend toutes les caractéristiques et comportements de vol des drones. Il permet ainsi d'apprendre, de se perfectionner ou simplement de s'amuser, seul ou en ligne avec des amis.\r\n</p><p>\n<strong>Fonctionnalités</strong>:<br/>\n</p><ul>\n<li>Réaliste: La physique de vol se veut aussi réaliste qu'agréable. Vous pouvez même essayer vos propres réglages.</li>\n<li>Environnements variés: paysages urbains ou naturels, en intérieur et en extérieur.<br/>\n</li>\n<li>  Modes de vol: \"Angle\" (avec stabilisation) pour les débutants &amp; '\"Accro\" pour les experts.</li>\n<li>Graphismes de qualité: équilibrez performance et qualité en fonction de votre pc.</li>\n<li>  Multijoueur: sur réseau local ou en ligne.</li>\n</ul><p>\n<strong>Contrôles:<br/>\n</strong>Le drone se pilote avec un gamepad (ex: xbox 360) ou avec une radiocommande de modéliste en USB.<br/>\r\n\tVous devrez vous rendre sur la page Settings du jeu pour régler votre gamepad ou radiocommande.\r\n\t<br/>\n</p><ul>\n</ul><p>\n<strong>Avertissement</strong>:<br/>\r\n\tNano Play est encore en cours de développement. Certaines fonctionnalités peuvent être incomplète, absente ou contenir des bugs.\r\n\t<br/>\r\n\tNous estimons cependant que le projet est suffisamment avance pour permettre aux pilotes débutant ou expert de s'amuser et s'entrainer.\r\n</p><p>\r\n\tNous sommes très ouverts aux retours et suggestions que vous pourrez nous faire sur notre page itch.io (section Community) ou par mail via play@nano-racing.com.\r\n</p><p>\r\n\tBon jeu !\r\n\t❤️️<br/>\n</p><ul>\n</ul>", "metacritic": null, "released": "2017-02-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ed2/ed22d3d5599979a4ae1e70133ff6c9c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Nano Racing"], "genres": ["Simulation", "Racing"], "publishers": [], "esrb_rating": null}