{"id": 909052, "slug": "variety-megajam-22", "name": "Variety Megajam 22'", "name_original": "Variety Megajam 22'", "description": "<p>Four Strange little games for the 2022 Variety Megajam. Each inspired by a poem. I had big dreams of making  ten games, and then big dreams of making five, but I am willing to settle for four.  Each ended up a bit larger than I expected, but overall I am pretty satisfied.<br/></p>\n<p>All games have an ending. Some have more than one! One even has a super secret ending!<br/></p>\n<p>Same controls for all games:</p>\n<p>Arrows/Wasd to move</p>\n<p>down/S  to pick up or drop an object. <br/></p>\n<p>Q to Quit to level select</p>\n<p>R to restart</p>\n<p>M to mute music</p>\n<p>~~~~~~~~~~~~~~~~~~~~~~<br/></p>\n<p>Some key ramblings copy and pasted from a dev log that may be of interest:</p>\n<p>A couple self imposed restrictions/rules/guidelines I have been thinking about- <br/></p>\n<ol><li> Use 10x10 px tiles. This is already forcing me to think a bit about window size.  usually work with 16x16 so I am playing around trying to find what dimensions look good with 10x10\r\n</li><li>Package all games within the same project. I think this will feel nicer and more cohesive (and probably less work) than multiple individual itch projects</li><li> All games should use same character - I built out a very simple character color selector (edited)\r\n</li><li>All games will be some kind of side view platformer tile based thing (going with what I am comfortable with due to time constraints)\r\n</li><li> Let myself be super loose and weird with the games and not worry too much about them working properly</li><li> All games should use a different aspect ratio, currently the application is like 300x300,  so each game will be a different ratio screen size that fits within that\r\n</li></ol>\n<p>I like this idea of forming a game around a bunch of loose memories/reactions tied to the poem, and I think it would be cool to approach all the games this way.</p>\n<p>Sort of just musing here now, but when I first started working with reusing images as tilesets I found it very exciting to look at essentially abstract and arbitrary images and try and figure out how they could be used as an environment\r\n</p>\n<p><em>[</em>6:58 PM<em>]</em>\"hmm these tiles kind of look like a fence so maybe my game should have a fence\"\r\n</p>\n<p><em>[</em>6:59 PM<em>]</em>This approach of just using scraps of memories/personal bits and then trying to force a system around them feels kind of similar\r\n</p>", "metacritic": null, "released": "2023-01-09", "tba": false, "updated": "2023-01-13T15:57:37", "background_image": "https://media.rawg.io/media/screenshots/940/9409e01c2cffa1a2574e44dd65cf20fc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MatthewLacker"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}