{"id": 909141, "slug": "zomvester", "name": "Zomvester", "name_original": "Zomvester", "description": "<p>If you kill a zombie, plants grow on the dead body with a low probability. Plants that have finished growing exhibit their unique abilities by type. If you harvest a plant, you can acquire its ability, and the more you harvest, the stronger it will be. Grow and harvest plants to survive zombies as long as you can!</p>\n<ul><li>Controls Move character -&gt; W, A, S, D Harvest &amp; Attack -&gt; mouse left click Put water &amp; Give water -&gt; mouse right click\r\n</li></ul>\n<ul><li>Plant Plants grow automatically when exposed to light for a long time, and grow immediately when watered. Growth is from level 0 to level 3, and when you reach level 3, you unlock unique abilities.\r\n</li></ul>\n\n<p><bellflower></bellflower></p>\n<ul><li>GROWTH COMPLETED -&gt; It shines light around. If you are in a place where the light hits you, your hp will gradually fill up.</li><li>HARVESTED -&gt; Increased field of view and enhanced base health regeneration.</li></ul>\n<p><nepenthes></nepenthes></p>\n<ul><li> GROWTH COMPLETED -&gt; Fires a projectile to attack zombies in range.</li><li>HARVESTED -&gt; Fires a projectile in the direction you are facing.\r\n</li></ul>\n<p><ivy></ivy></p>\n<ul><li>GROWTH COMPLETED -&gt; Binds zombies in the surrounding area so they cannot move for a while. </li><li>HARVESTED -&gt; Fires vines that bind zombies around the player. And, increases the player’s max HP.\r\n</li></ul>\n<p><cistus> </cistus></p>\n<ul><li>GROWTH COMPLETED -&gt; Causes an ultimate explosion that instantly kills all zombies around it. Instead, it has a long cooldown. </li><li>HARVESTED -&gt; Causes explosions that instantly kill zombies in around the player. And, Increases the player’s basic attack.\r\n</li></ul>\n\n<p>Map Water can be obtained from pools throughout the map. Day and night exist, and at night the field of vision narrows and plants can’t growing automatically.</p>\n<p>Good Luck!\r\n</p>", "metacritic": null, "released": "2023-01-09", "tba": false, "updated": "2023-01-13T16:34:53", "background_image": "https://media.rawg.io/media/screenshots/b42/b4233a8404ea680ba5c4144a1bb60cda.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Goodbye_flash"], "genres": [], "publishers": [], "esrb_rating": null}