{"id": 90914, "slug": "project-nostalgia-two-worlds-one-soul", "name": "Project Nostalgia: Two Worlds | One Soul", "name_original": "Project Nostalgia: Two Worlds | One Soul", "description": "<p>\n</p>\n<p>\r\n\tIn \r\n\t<strong>Nostalgia</strong>, you play as <strong>Alice</strong>, a child kidnapped and forced to take part in Project Nostalgia, a chain of experiments conducted to confirm the existence of an <strong>alternate universe</strong>. Other victims her age wanted nothing more than to escape. Alice, however, suffered from family abuse before her capture, and this science facility could in fact be a new home for her.\r\n</p>\n<p>\r\n\t12 years later, the victims managed to flee from the facility. Some simply wanted to move on, while others thirsted for revenge. Meanwhile, their counterparts in the alternate universe were screaming to be let loose. Alice must pick a side, and she only prayed her decision would not anger her alter ego.\r\n</p>\n<p>\n<strong>Features</strong>:\r\n</p>\n<p>\n<strong>Two worlds, one soul:</strong> Just about every character in this adventure will have their alter egos to deal with. These counterparts may share the same soul, but there is no guarantee that they will get along.\r\n</p>\n<p>\n<strong>Environment interaction:</strong> Players will investigate various locations throughout the game. Find, combine and use items to solve puzzles and survive in the tense world of Nostalgia.\r\n</p>\n<p>\n<strong>Animated graphics:</strong> Our team is working hard to deliver animated graphics onto your screen. We hope you will like them!\r\n</p>\n<p>\n<strong>Multiple endings:</strong> We want the story to incorporate plenty of twists, and the team has two alternate endings in mind so far.\r\n</p>\n<p>\n<strong>Voice acting:</strong> Nostalgia will feature voice acting during key moments of the game.\r\n</p>\n<p>\n<strong>This is a prototype</strong><br/>\n</p>\n<p>\r\n\tNew Screenshots:\r\n</p>\n<p>\n<br/>\n</p>\n<p>\n</p>\n<p>\n</p>\n<p>\n</p>", "metacritic": null, "released": "2016-03-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/734/7342407c186617513ebefd584a4e1f8a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["MagnaStudios"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}