{"id": 909244, "slug": "harvest-of-the-gods", "name": "Harvest of the Gods", "name_original": "Harvest of the Gods", "description": "<p>In 'Harvest of the Gods,' players take on the role of a powerful deity who must gather the souls of mortals in order to sustain their divine powers. The player must navigate through a series of increasingly difficult realms, each with its own unique challenges and enemies, in order to collect the souls they need to continue their journey.\r\n</p>\n<p>As the player progresses through the game, they will encounter a variety of creatures and obstacles that stand in their way. With the use of their godly powers and strategic gameplay, players must overcome these challenges and defeat powerful bosses in order to harvest the souls they need.</p>\n<p>This game is unique in that it was designed and developed using AI-generated content, including this description. By using artificial intelligence to generate as much of the game's design and content as possible, we hope to create a truly one-of-a-kind and immersive gaming experience.</p>\n<p>Controls (Keyboard and Mouse):<br/>    Movement: WASD keys or arrow keys<br/>    Bolt of lightning: Space bar or left mouse button<br/>    Earthquakes: E or right mouse button<br/>    Healing aura: Q or left shift<br/>    Teleportation: T or left control</p>\n<p>Controls (Controller):<br/>   Movement: left joystick<br/>   Attack: right joystick click\r\n<br/>   Lightning: A button<br/>   Earthquake: B button<br/>   Heal: X button<br/>   Teleport: Y button<br/>   Pause: Start button</p>\n<p>----------------------------</p>\n<p>Ok, human here.  I wanted to do this project as a bit of an experiment to see how far AI technology could be pushed as it currently stands.  It's fascinating how rapidly AI is progressing with things like ChatGPT, so I asked it to design a game with the theme \"Harvest\".  The first design was a very generic farming simulator, so I asked it to come up with a design that was not farming related:</p>\n<p>And Harvest of the Gods was born!  With a good bit of coaxing I asked it to come up with pretty much every element of the game, though I didn't have time to implement it all, especially since I was trying to convince it to write usable GDScript code for Godot.  Each line had about a 50/50 shot of being correct, so a whole script pretty much never was, but sometimes it came up with some really impressive or unexpected ways to implement things.  It would likely have been much faster to implement things myself, but I'm pretty experienced with Godot, so this is a pretty powerful tool for developers learning new languages and engines.</p>\n<p>The downside is that it often gives wrong answers very confidently:</p>\n<p>While I was fighting ChatGPT trying to get it to write usable code, I was also generating images with Stable Diffusion.  In AI's current state, trying to get something that looks good and consistent is probably more work than creating art from scratch if you're a talented artist, but it was an interesting exercise.</p>\n<p>Most of the creatures generated, if they were more than a discombobulated mess, were cropped or occluded in some way and needed to be extended/altered, and of course alpha masked.  Do you know how hard it is to generate a centaur?  The one I finally ended up using had a horse head, which was kind of funny, but nothing else was really close enough.</p>\n<p>For the music, I used something called \"riffusion\" which used images of sound (spectrograms) to train.  A lot of the stuff it generated sounded terrible, but I just threw in \"Harvest of the Gods\" and it made something that was not completely unpleasant.  Unfortunately, it was a whole bunch of independent segments that had to be manually lined up and pieced together to make a continuous song, but it had a couple little groovy moments.</p>\n<p>I could not find any AI for generating sound effects, so I had to settle for the next best thing:  Asking Chat GPT what sounds to record to make the sound samples I wanted.  It suggested things like flapping a bed sheet for the wings, swinging a rope or broom for the teleport, and a deep sine wave with some noise, distortion, and reverb for the earthquake.  So I went with that.</p>\n<p>For the voice, I used uberduck.ai with an emulation of Mufasa's voice and pitched it down slightly.  There are better tools out there, but I don't know what they are (if any are even freely available).</p>\n<p>It was a big debate about whether or not I should enable ratings for graphics and audio, because 1) I was really curious, as kind of a social experiment, how a deliberately AI driven game would rank in these categories, 2) it was actually a lot of time and labor to make anything remotely game-worthy, and 3) having a game explicitly using AI getting rankings might sway the official rules one way or another.</p>\n<p>Ultimately, I decided to opt-out, but I'd be interested to hear how you'd rank it in those categories in the comments.</p>", "metacritic": null, "released": "2023-01-09", "tba": false, "updated": "2023-01-13T17:18:44", "background_image": "https://media.rawg.io/media/screenshots/596/59688579f0c36922e28f3c1c11ab569c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["jitspoe"], "genres": ["Action"], "publishers": [], "esrb_rating": null}