{"id": 909208, "slug": "landmine-seeker", "name": "Landmine Seeker", "name_original": "Landmine Seeker", "description": "<p>Made for Ludum Dare 52</p>\n<p>In LANDMINE SEEKER you wont harvest some boring carrots or lame pumpkins. Nah… In LANDMINE SEEKER, you’re going to harvest landmine cause this is fucking war and your troops are fucking stupid !</p>\n<p>As an ungrateful kid, you wouldn’t care for the death of some unknows soldiers, but not day because… Damn ! You dad is one of them !</p>\n<p>This is why you have decided to take your best metal detector and go to the battelfield ! He may be a pain in the ass sometimes, but your dad won’t die cause of a freaking landmine, you swear !</p>\n<p>MISSION</p>\n<p>Roam all over the battlefield in order to detect land mines !</p>\n<p>Remove them and be quick before your dad’s troops begin to move FORWARD !</p>\n<p>And keep in mind that the more soldiers get to the other side of the battlefield, the bigger are the chances for your dad to survive !</p>\n<p>FEATURES</p>\n<p>- Best tech gather in your detector metal, so it never fails !</p>\n<p>- Pixel art at its finest for the finest pixel deaths</p>\n<p>- Soldiers acting like real ones, ever forward ! From the left to the right !</p>\n<p>- Landmine everywhere !</p>\n<p>Oh… And, of course, war is not a game… but you’ll get a score anyway !</p>\n<p>QUOTES</p>\n<p>\"Most games are pretty simple. You jump on enemies, you die, you have to insert another quarter to continue. The LANDMINE SEEKER changed that.\" Game Designer of LANDMINE SEEKER</p>\n<p>« Landmines explode, soldiers run and kid harvests, what a wonderful game to play » Developer of LANDMINE SEEKER</p>\n<p>Completed in 12h</p>\n<p>Space to harvest landmines and arrows to move</p>\n\n<p>Image by https://www.freepik.com/free-vector/war-and-conflict-landscape-with-people-figth...</p>", "metacritic": null, "released": "2023-01-09", "tba": false, "updated": "2023-01-13T17:02:46", "background_image": "https://media.rawg.io/media/screenshots/e01/e01ac3ac08ec850ccb439b58f4ab3f75.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Animapix"], "genres": ["Action"], "publishers": [], "esrb_rating": null}