{"id": 909269, "slug": "chronicle-rewritten", "name": "Chronicle: Rewritten", "name_original": "Chronicle: Rewritten", "description": "<p>\n</p>\n<p><strong>Chronicle: Rewritten</strong> is a recreation of <strong>Jagex's original collectable card game, Chronicle: Runescape Legends.</strong> The game was taken offline on the 6th of August 2018 and hasn't been accessible ever since. Until now!\r\n</p>\n<p>This remake is built from the ground up with the goal of having this game playable until the end of time. As long as there is a download available somewhere, you will be able to play it!<br/>\n</p>\n<p>Download the latest version below or on \r\n  <strong>\r\n    chroniclerewritten.com</strong>, and join us on \r\n    <strong>Discord</strong>\r\n   and \r\n    <strong>Reddit</strong>.\r\n</p>\n<p>\n<br/>\n</p>\n<p>\n<strong>\n</strong>\n<br/>\n</p>\n<p>Dive into <strong>single-player,</strong>\n<strong>multiplayer</strong>, and my personal favourite, <strong>asynchronous multiplayer</strong>! \r\n</p>\n<p>Or mix it up and change the game rules to how you want to play.  Want to try out new card combinations that were never available in the original game? Or change how the starting player is determined? It's all up to you. <br/>\n</p>\n<p>Currently, 326 out of the original 419 cards are included, with more on the way with every update.</p>\n<p>\n<br/>\n</p>\n<p>We're currently very close to bringing the game on par with the original. Only 3 key features are missing: the remaining 93 cards, an in-game deck editor and the dungeoneering game mode (draft).</p>\n<p>Along with a nice tutorial, these have the highest priority. But we're not stopping there! The foundations have already been laid out for custom card modding, single-player campaigns (like the original \"Trials of Radimus\") and many more! <br/>\n</p>\n<p>If you like this project and want to follow its journey through development, please consider following us on the social media platforms above.</p>\n<p>Thank you for showing interest in this project, and I'll see you around!<br/></p>", "metacritic": null, "released": "2023-01-09", "tba": false, "updated": "2023-01-13T17:28:33", "background_image": "https://media.rawg.io/media/screenshots/bcb/bcb660cd87478c4160917a3a07a18589.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kapistijn"], "genres": ["Adventure", "Strategy"], "publishers": [], "esrb_rating": null}