{"id": 909487, "slug": "backyard-fruitball-ld52", "name": "Backyard Fruitball (LD52)", "name_original": "Backyard Fruitball (LD52)", "description": "<p>A goofy little idea I came up with as soon as I saw the theme. The goal was to create an interesting game where you need to control two different characters in tandem to succeed. My original thought was that the game would have that “easy to learn, difficult to master” curve, which it sort of does, except I don’t think it’s a lot of fun to try and master right now.\r\n</p>\n<p><strong>The goal: knock all of the fruit down with the Hitter (blue with club), and get beneath them with the Catcher (purple with basket), as quickly as possible.</strong>\n</p>\r\nQuick and Dirty Postmortem\r\n<p>If I had committed my full weekend to it, here are some things I would have worked on:\r\n</p>\n<ul><li>Better graphics (duh)\r\n</li><li>More polish/“juice”\r\n</li><li>Better controls\r\n</li><li>Something more compelling with the fruit spawns\r\n</li><li>Any sort of music (I have no idea how to make it)\r\n</li></ul>\n<p>The Hitter controls don’t feel too great, but I was really trying to simplify things by not letting you strafe in the air, the idea being you could focus on moving the Catcher while waiting for the perfect time to swing the bat. I had envisioned a “mastery” where you start off by getting them both into the right position first, then doing the jump, but eventually you could potentially be juggling multiple apples into the air while simultaneously trying to maneuver the Catcher beneath them as you went. The latter didn’t pan out too well, but there’s still some optimization you can do.\r\n</p>\n<p>All-in-all, I did manage to create what I’d pictured, it just isn’t as fun as I’d hoped; maybe with some tweaking it could get there, but I’ll probably just shelve this and call it a successful experiment. Thanks for checking it out!\r\n</p>", "metacritic": null, "released": "2023-01-09", "tba": false, "updated": "2023-01-13T18:57:31", "background_image": "https://media.rawg.io/media/screenshots/ea5/ea54391963d16a18050ee06ceb4564ac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["twchapman"], "genres": [], "publishers": [], "esrb_rating": null}