{"id": 90945, "slug": "ristorante-amore", "name": "Ristorante Amore", "name_original": "Ristorante Amore", "description": "<p>Ristorante Amore is a Cyanide Tea production originally released April 1, 2012. It was created in a month for NaNoRenO 2012. All writing and programming was done by Lore. All art was done by Auro-Cyanide. The interface was a group effort, though Lazcht designed almost all of the assets.  </p><p>Gameplay involves typical visual novel fare such as making decisions at different points in the plot in order to get (at least) one of three different prologue endings and nine different post-prologue endings. We hesitate to assign a label/genre to the game, but the closest things would probably be sci-fi (no, really) and slice of life. </p><p><strong>STORY</strong></p><p>Lily Kingston has just graduated from college and is trying to find a new job! Lost and alone, she's helped out by her uncle, who is the owner of a fancy Italian restaurant. She begins working there as a waitress even though she has no experience. Clumsy and yet endearing, she tries hard at her new job and is often helped by her attractive male co-workers... Could one of them win her heart or will their secrets threaten a budding relationship...? <br/></p><p><strong>THINGS OF NOTE</strong></p><ul><li>PRESS [P] TO BRING UP THE PREFERENCES/OPTIONS MENU IN-GAME. Other keybindings (unique to RisAmo) are listed in the help.txt file and/or are explained in the main menu help scenes.</li><li>The prologue has 3 different endings. These do not count towards game completion, it's just that you have to beat the prologue at least once in order to play the post-prologue. (obviously?)</li><li>The post-prologue has 9 different endings. Of those, 5 of them have CGs. However, you need to get all 9 endings to full-comp the game and unlock everything.</li><li>The help button in the main menu does something different than the help button everywhere else. It would behoove you to see what the \"main menu help\" is like before and after beating the prologue, as the scenes you get are different. Once you've beaten the prologue, it's no longer possible to watch the prologue version of the \"main menu help\" unless you delete your save files/persistent data.</li><li>A German version of the game is available here.</li></ul>", "metacritic": null, "released": "2015-09-23", "tba": false, "updated": "2019-07-20T23:26:42", "background_image": "https://media.rawg.io/media/screenshots/4fa/4fa267319139e4a7ac0469c38870bb2d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["Cyanide Tea"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}