{"id": 909597, "slug": "room-of-no-escape-canceled", "name": "Room of no Escape (canceled)", "name_original": "Room of no Escape (canceled)", "description": "<p>Room of no Escape<br/>by Xitilon &amp; Esdeer<br/>version 0.11</p>\n<p>Ludum Dare #37 Theme: One room</p>\n<p>Made with Game Maker 8.1</p>\n<p>Controls:<br/>Arrows - move<br/>Z - shoot/summon<br/>X - choose<br/>Enter - start/continue<br/>Q/A, W/S, E/D, R/F - change Red, Green, Blue, Alpha screen overlay color</p>\n<p>This prototype was made on Ludum Dare #37 Jam - the one that was going to migrate to the new ldjam.com site, but Mike told us to post on the old one anyway.</p>\n<p>Oddly enough, neither we did have much time on our hands to polish our game. We've tried to fit into GameBoy limitations, and I think we did fairly well, but then we've realized some problems about the game itself.</p>\n<p>The idea was to make a Castle of no Escape spin-off, with only one room, in a tower-defence survival mode, but without the towers. Say, Battle City with its Construction Mode between the waves. But upon testing, it became obvious that 7x7 tiles Room isn't really sufficient for that kind of gameplay. Everything goes on too fast, and enemies need advanced pathfinding, which I was never good at.</p>\n<p>Other than that, the deadline for our main game \"Castle of no Escape 2\", which is headed towards Steam, is approaching, and today I've received a bunch of messages from several interested people. So, sadly enought, we must finish that thing first, and maybe return to the Room of no Escape later. Anyway, I wish you have some minutes of fun with the prototype! At least I did, both with making and testing it. Note that it has no ending. No escape, you've got the idea, eh?</p>\n<p>There are also two music tracks made by Esdeer, but we didn't decide where they belong, so we leave you with an option to listen to them as you want.</p>\n<p>http://ludumdare.com/compo/ludum-dare-31/?action=preview&amp;uid=47350 (unavailable online as of 2023, you can see the internet archive but it doesn't even have the screenshots, only the same text you're reading here)</p>\n<p>11.12.2016</p>", "metacritic": null, "released": "2023-01-09", "tba": false, "updated": "2023-01-13T19:40:18", "background_image": "https://media.rawg.io/media/screenshots/9c1/9c11d4b966b22fba16097a68edf05f6c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Xitilon"], "genres": ["Action"], "publishers": [], "esrb_rating": null}