{"id": 909689, "slug": "snowball-fight-benjamin-zanini", "name": "Snowball Fight (Benjamin Zanini)", "name_original": "Snowball Fight (Benjamin Zanini)", "description": "<ul><li><strong>Moteur</strong>: Unity 3D</li><li><strong>Équipe</strong>:  3 personnes</li><li><strong>Rôles</strong>: Développeur, Intégrateur, Son</li></ul>\r\nRésumé\r\n<p>Le joueur doit d'abord passer par une phase de questionnaire qui concerne une station de ski et, dans le cas où le questionnaire est validé, le joueur pourra accéder à la phase de jeu. Il incarne un personnage qui affronte d'autres joueurs (IA) dans une bataille de boules de neige.</p>\r\nContexte\r\n<p>Ce projet s'inscrit dans le cadre d'une demande fictive d'une station de ski. Celle-ci veut créer un module compatible SCORM avec un jeu concours composé de 5 questions sur la station et/ou son univers et comme question subsidiaire un mini jeu en 2D pour départager les concurrents.\r\n</p>\n<p>Ce jeu cible les personnes participant au jeu concours pour gagner un forfait semaine dans la station de ski.</p>\r\nGameplay\r\n<p>Le joueur peut se déplacer sur l'écran et lancer des boules de neige sur les ennemis. Il devra esquiver et survivre le plus longtemps possible. Il doit penser à recharger ses boules de neige (il peut en stocker 10) et dispose de 3 vies.</p>\n<p>Le joueur peut se déplacer via les touches WASD et les flèches directives. Pour recharger ses boules de neige, il doit maintenir la touche R. Pour tirer sur ses ennemis, il doit appuyer sur la touche ESPACE.</p>", "metacritic": null, "released": "2023-01-08", "tba": false, "updated": "2023-01-13T20:16:10", "background_image": "https://media.rawg.io/media/screenshots/f2b/f2b1c9abb18cd87efa3e57e8ad037bc4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Benjamin Zanini"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}