{"id": 909713, "slug": "rootbound-rampage", "name": "Rootbound Rampage", "name_original": "Rootbound Rampage", "description": "Welcome to the Garden of Madness!\r\n<p>Rootbound Rampage is a Roguelite game that you control a growing up plant and the enemies are the farmers trying to harvest you.</p>\r\nWant to know more?\r\n<p>In this game, you control a small plant that is trying to grow and survive in a field full of danger. Your main enemies are the farmers who are trying to harvest you and other plants for their crops.</p>\n<p>To defend yourself against the farmers, you can use various abilities that are unlocked as you grow. For example, you may start out with a simple vine attack, but as you grow bigger you might unlock more powerful abilities such as a root strike or a seed blast.\r\n</p>\n<p> The levels in this game are procedurally generated, so each run will be different and offer new challenges and opportunities to grow. As you progress through the game, you will encounter more powerful farmers and other dangers that will test your skills and resourcefulness.\r\n </p>\n<p> If you are defeated, you will have to start over from the beginning, but you will also have the opportunity to <strong>unlock new Skills</strong> that can help you in future runs. Can you survive long enough to become a fully-grown plant and defeat the farmers once and for all?</p>\r\nHow to Play it:\r\n<p>Rootbound Rampage is a Roguelite with Permadeath and persistent skills.Meaning that if you die, it's over and you'll have to start again, but the skills you unlocked will be taken into account in the next run.</p>\n<ul><li>Use W,A,S,D to control the character. You can also do this with the Right Mouse Button.</li><li>To attack or use a skill, hold the left mouse button and interact with the skill menu.</li></ul>\n<p>Survive the maximum amount of levels you can without getting Harvested by the Farmers.</p>\n<p><strong>Have fun!</strong></p>", "metacritic": null, "released": "2023-01-08", "tba": false, "updated": "2023-01-13T20:25:00", "background_image": "https://media.rawg.io/media/screenshots/450/45033aa3773e7557456fae3b81b168ac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Uniday Studio"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}