{"id": 909798, "slug": "bing-in-wonderland", "name": "Bing in Wonderland", "name_original": "Bing in Wonderland", "description": "<h3>Join our discord, help us make game better.</h3><strong>Discord: https://discord.gg/m9VhhjDCsW</strong><br/><br/> (we are still working on the better english version.)  :D<br/><br/>Bing in Wonderland is a new entry in the Wanba Warriors franchise. A Roguelite monster killing satisfaction galore without any exploration elements. The game is filled to the brim with exotic enemies and stages with a collection of deep and robust boons, weapons, and items plus an abundance of pointless features and useless details. You will be encapsulated by the unique Butt Slam mechanic a vague and abstract art style that puts Picasso to shame.<h3>Many types of weapons.</h3>The game currently features bow, spear, cannon, axe and harp. <br/><h3>Butt Slam</h3>Put your booty to work in a fast-paced combat where your butt is your ultimate weapon.<br/><h3>Colorful and varied progression</h3>The game features many unique items and boons to be explored and combined by the player to form their unique combat style.<br/><h3>Waves of enemies</h3>Different enemies appear in different stages with great variety, some shoots thunder while some shoots thunder poop.<br/><h3>AAA experience</h3>Although an Indie game studio, we wanted to create a game rivaling that of other triple A games; so we simply redefined the A in triple A. The game features A lot of pancakes, A lot of Money and A lot of fishes.<br/>", "metacritic": null, "released": "2023-01-12", "tba": false, "updated": "2023-01-16T04:01:12", "background_image": "https://media.rawg.io/media/screenshots/ba6/ba69d564c42390fee9e5409a34e1b130.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 13, "beaten": 2}, "playtime": 7, "achievements_count": 64, "ratings_count": 0, "suggestions_count": 308, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wanba Studio"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Wanba Studio"], "esrb_rating": null}