{"id": 909790, "slug": "within-the-backrooms", "name": "Within the Backrooms", "name_original": "Within the Backrooms", "description": "<h3>The Game</h3><br/>Within the Backrooms is a liminal exploration game with light puzzle elements. Use tools you find and mysterious floppy disks to traverse the world, uncover the secrets of the Backrooms, and find out why you're here. Try not to get lost in the winding maze of the Lobby, explore the abandoned and decrepit Mall, relive childhood memories in the unsettling Playground, and experience sublimity in the placid, yet haunting, Pool.<h3>The World</h3>Explore a vast world of liminal spaces. Providing an uncanny nostalgia where reality isn't quite the same. Featuring 4 unique and diverse main floors and many different-sub floors to find, there's secrets lurking around every corner. Given nothing, you must be adventurous and clever. Question everything you see and trust nothing they say.<h3>The Graphics</h3><br/>Within the Backrooms pays homage to a time where edges were jagged and textures pixelate from afar. The game replicates the style of the PS1 era and plays in the same aspect ratio.<br/><br/><h3>Reviews</h3>\"The game is a blast. The aesthetic exudes mid 90s design, the music captures the atmosphere perfectly, the surrealist character designs and optical illusion levels were pure mindf***ery. I feel there's a lot that I left unexplored and hidden in the maze of walls. I like the puzzle solving that opens up parts of the level. At points it felt like I was in a living version of that old school screensaver.\" - FREAKBAiT @freakbait", "metacritic": null, "released": "2023-01-12", "tba": false, "updated": "2023-01-16T03:51:54", "background_image": "https://media.rawg.io/media/screenshots/b1e/b1e51ef9c4f2ec5b733ce8d0d8a4d45b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Andrew Brenes"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Andrew Brenes"], "esrb_rating": null}