{"id": 909757, "slug": "hearty-harvest", "name": "Hearty Harvest", "name_original": "Hearty Harvest", "description": "What is the game?\r\n<p>Hearty Harvest is a relaxing puzzle game about growing and harvesting plants. With a unique take on the typical match-3 style, you’ll be harvesting crops till the cows come home. 👩‍🌾\r\n</p>\r\nHow is it unique?\r\n<p>You do not score points for simply grouping plants together. Instead, each plant grows every turn and when it is fully grown you score points. However, plants will only grow if they are next to another plant of the same color. More plants of the same color will cause them to grow even faster.\r\n</p>\r\nWho made it?\r\n<p>Mike, Ryan, and Trevor! We are a group of friends with no real game development experience that like to do Jams together. This is our second Jam as a group, if you’d like to see what we made for our first jam, check out Moirah’s Manor!\r\n</p>\r\nWhat is the target audience?\r\n<p>This game is intended to be a mobile game (Try it out on your phone!) that appeals to people who like puzzle games but want something different than the typical bejeweled or candy crush. It is also a great game for anyone who likes casino games but doesn’t want to spend money.\r\n</p>\r\nWhat’s next for the game?\r\n<p>We would love to publish this on mobile app stores eventually, but first we need an artist to create us actual assets for the game instead of using the free / generated assets we have now.\r\n</p>\n<p>As far as features, the biggest missing feature is supporting swiping to swap plants instead of clicking. It is partially working but was more challenging than we thought to get it right.\r\n</p>\n<p>Lastly, adding more content and features to the game. Like different effects that can happen on the different moon phases, other choices instead of seeds each turn (extra growth, etc), additional levels to play, and more design to make the game feel more polished.\r\n</p>", "metacritic": null, "released": "2023-01-05", "tba": false, "updated": "2023-01-13T20:42:29", "background_image": "https://media.rawg.io/media/screenshots/3bd/3bd84c4f3baaf3686b33665d8f1896a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "macOS", "PC"], "developers": ["tobiusthegrand"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}