{"id": 909704, "slug": "ether-warp", "name": "Ether Warp", "name_original": "Ether Warp", "description": "<p>In the far, far future, humanity depends on the <em>exceedingly</em> valuable Ether Crystals to power modern technology. These crystals are only found in highly dangerous asteroid belts, but the Federation-mandated warp gates allow for slightly-less-deadly transportation between the sectors. Not to mention the ever-present space pirates that seek to destroy and salvage harvester ships. Regardless of the dangers, as an Ether Harvester Unit, it is your sole responsibility to collect and transport these invaluable gems! Have a safe trip!</p>\n<p>Collect Ether Crystals and avoid deadly space pirates. Enter a Warp Gate and prestige to obtain powerful upgrades (from a pool of 17 unique upgrades) to harvest more and more crystals! Every time you warp, pirates lock on to your location easier and arrive in larger masses. Perhaps eventually you will be able to purchase the most prized contraption in our day and age: the <em>FTL OVERDRIVER</em>. Good luck!</p>\r\nTools:\r\n<ul><li>Engine: Unity 2021</li><li>IDE: JetBrains Rider (C#)</li><li>Music: Ableton Live 11 Lite</li><li>Audio: jsfxr, Audacity, Ableton</li><li>Fonts: (a la Google Fonts) Patrick Hand, Rock Salt</li><li>Art: Photoshop 2023</li></ul>\n<p>This game was made in 48 hours for Ludum Dare 52 with the theme <em>Harvest</em>. View the results here!</p>\r\nChanges made during the submission hour\r\n<p>- Fixed the \"FTL OVERDRIVER\" upgrade from being able to be purchased multiple times</p>", "metacritic": null, "released": "2023-01-08", "tba": false, "updated": "2023-01-13T20:21:20", "background_image": "https://media.rawg.io/media/screenshots/2b6/2b696ae4026e2802b07a73d5a723a716.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Celtican"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}