{"id": 909781, "slug": "supplice-wip", "name": "Supplice [WIP]", "name_original": "Supplice [WIP]", "description": "<p>Supplice is a stylish throwback shooter inspired by the mid-90s FPS glory days and the legendary Doom modding community. Mixing the retro stylings of 90s era shooters with colorful graphics and frantic gameplay, it creates an experience that&#39;s ever so familiar but also exciting and fresh.</p>\n<hr />\n<p>Humanity has outgrown its cradle. The progress of technology has created prosperity, but has brought along with it overpopulation. There&#39;s an uncountable number of worlds ready to be terraformed. But the only way to reach these planets, and save humanity, is to harness the power of the Sun and crack open the space-between-spaces. The Flux Gate technology indulges humanity&#39;s lust for cosmic expansion... but at what cost?</p>\n<p>In Supplice, you are a young engineer sent off to terraform an extremely distant world. Disaster falls upon the colony after an anomaly envelopes the Flux Gate facility, flooding the world with strange trans-dimensional horrors. You quickly find yourself to be the lone survivor of the brutal invasion. It&#39;s too late to save the colony, but you vow to take vengeance on the trans-dimensional aggressor who turned your new home into a violent bloodbath. You are alone and outnumbered, but you are not outgunned. And it&#39;s time to return the favor.</p>\n<ul>\n<li>A full-length campaign filled with locales ranging from lush forested colonies, industrial superstructures, derelict space stations, dark laboratories, and biotechnological nightmare worlds.  </li>\n<li>An original story told through gameplay, environmental set-pieces, intermission animations, and secrets.  </li>\n<li>Classic and colorful spritework painting the entire experience.  </li>\n<li>A legion of biomechanical beasts, grotesque creatures, and ethereal nightmares that you&#39;ll have to contend with.  </li>\n<li>A devastating arsenal of beautifully animated weapons.  </li>\n<li>Tons of items, power-ups, and gadgets to aid you in combat.  </li>\n<li>An original soundtrack crafted by James Paddock (Jimmy), with a special arranged version produced by Sarah Mancuso (esselfortium).  </li>\n</ul>\n<p>Supplice is brought to you by a team of Doom mod scene veterans and renowned FPS creators:</p>\n<ul>\n<li>Brett &#39;Mechadon&#39; Harrell - lead designer, lead level designer (Doom mapping legend, project founder)  </li>\n<li>James &#39;Jimmy&#39; Paddock - lead composer (known from his midi soundtracks to Sigil, Prodeus)  </li>\n<li>Aleksander &#39;Cage&#39; Kowalczyk - lead artist, project coordinator (art lead for Ion Fury)  </li>\n<li>Jackson &#39;Bouncy&#39; Marriott - sound designer (Doom mod scene vet)  </li>\n<li>Maciej &#39;PillowBlaster&#39; Banowski - gameplay designer, scripts (author of acclaimed Doom mods such as Russian Overkill, The Guncaster)  </li>\n<li>Sarah &#39;Esselfortium&#39; Mancuso - music producer (Doom mapping legend known for Back To Saturn X)  </li>\n</ul>\n<p>Survive, adapt, and strike back!</p>", "metacritic": null, "released": "2023-03-30", "tba": false, "updated": "2023-02-21T15:33:56", "background_image": "https://media.rawg.io/media/screenshots/576/57662b8917db7ee065c955efbaa96390.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 403, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": [], "genres": ["Action", "Shooter", "Indie"], "publishers": ["Hyperstrange"], "esrb_rating": null}