{"id": 909821, "slug": "confabulation-2", "name": "Confabulation", "name_original": "Confabulation", "description": "You wake up at your home, but something does not seem right. Looking around your house, you begin to notice things are different than what you remember. You use a camera to take photos to reveal the truth, to remember what was there. Your memory is fading; the longer things remain different, the faster you succumb. Keys to find, mysteries to solve, a home to explore. You need to keep your memory intact to put together pieces of your life and remember who you are and what has happened. Only then will you get the peace that you desire.<br/><br/><br/>During your play-through, you will need to study the layout of the home and what each room looks like. Over time, things will change and it is up to you to correct what changes in order to keep your sanity in tact. The more you let your sanity drain the more horror elements will occur and things that will change. If you let your sanity drain too far you will succumb and lose. There is no saving, a loss will end your play and you will need to restart.<br/><br/>What you will be doing while playing:<br/><ul><li>Take photos of objects that have changed to return them to normal and prevent sanity loss.<br/></li><li> Solve puzzles around the house to keep unlocking new rooms.<br/></li><li> Piece together story elements to progress the main story and discover what happened. Piecing together the entire story is how you win.<br/></li><li> Take pills to restore memory and keep your sanity in check.<br/></li><li> All puzzles, changing objects, horror elements and story elements are randomized on each play, allowing multiple plays to keep each play feeling different.<br/></li><li> A normal and hard difficulty setting, both difficulties unlocked from the start.<br/></li><li> Normal difficulty is meant to be an appropriate challenge, ramping up in difficulty the longer you play. <br/></li><li> Hard difficulty is meant to be very challenging, introducing many new things that can change, increased puzzle difficulty and less overall time. <br/></li><li> Statistics to track what you have accomplished and your best completed time for each difficulty.</li></ul>", "metacritic": null, "released": "2023-01-13", "tba": false, "updated": "2023-01-16T04:32:05", "background_image": "https://media.rawg.io/media/screenshots/84c/84c737b94440e601de3612b6c6329ff5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 329, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Authogin"], "genres": ["Adventure", "Indie"], "publishers": ["Authogin"], "esrb_rating": null}