{"id": 909851, "slug": "ascent-of-ashes", "name": "Ascent of Ashes", "name_original": "Ascent of Ashes", "description": "\nBUILD A NEW HOMEBuild your survivors a base where they can rest and trade stories between adventures. Farm crops, tame alien beasts, incorporate salvaged technology and fortify your home against hostile intruders\n<br/>\n<br/>\n\n  ENGAGE IN DEEP TACTICAL COMBATPrevailing in combat will require more than just point-and-click. A detailed hit simulation and health system will mean that even non-lethal hits can render a survivor unable to go on. Suppressive fire might pin an enemy in place, but the ammunition used up may leave you ill-equipped to fight the next encounter effectively\n<br/>\n<br/>\n\n  DRIVE RESTORED VEHICLESIt's a big world out there. To get around you will need better transportation than your legs can provide. One of the things setting Ascent of Ashes apart from other games of this genre is the ability to restore and drive vehicles.\n<br/>\n<br/>\n\n  LEAD YOUR SURVIVORSEach survivor has their own unique personality and motivations. As colony leader it is up to you to find and recruit capable survivors to fill gaps in your roster against ever increasing challenges. Can you keep everyone happy, secure and motivated?\n<br/>\n<br/>\n\n  EXPLORE A STRANGE NEW WORLDYou will find yourself in an expansive, procedurally generated world filled with different biomes and points of interest. To survive the post-apocalypse you'll have to brave the pre-collapse ruins and the many dangers that they hold.\n<br/>\n<br/>\n\n  CHALLENGE A DYNAMIC AIIt's not enough to just have an in-depth combat system with a variety of mechanics. You also need opponents capable of using those mechanics to challenge you. Enemies will possess varying degrees of intelligence. Taking on a disorganized band of raiders will play very differently from fighting a squad of well-trained Remnant soldiers.\n<br/>\n<br/>\n\n  FROM THE ORGINAL CREATORS OF COMBAT EXTENDEDCombining the deep simulation of classic post-apocalyptical survival titles with the tactical challenge of classic real time and turn-based gems, the original creators of RimWorld's heralded Combat Extended mod present a fresh take on the colony sim genre that emphasizes exploration, tight balance and strategic gameplay.MODDING SUPPORTOur team has its roots in mod-making and we've been fortunate to have been part of many great modding communities over the years. That's why with Ascent of Ashes, we want to give something back to those communities. We're building the game's engine from the ground up to be easily extendable, and thanks to our extensive experience in creating mods ourselves we know exactly what kind of support mod-makers need. Ascent of Ashes is a game developed by modders, for modders.", "metacritic": null, "released": null, "tba": false, "updated": "2023-01-16T05:13:15", "background_image": "https://media.rawg.io/media/screenshots/1aa/1aa453d77e961527529e0c944d6ab87a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vivid Storm Interactive"], "genres": [], "publishers": ["Camlann Games"], "esrb_rating": null}