{"id": 909891, "slug": "craft-valley-building-game", "name": "Craft Valley - Building Game", "name_original": "Craft Valley - Building Game", "description": "► CAN YOU BE CRAFTY?<br/><br/>Ever dreamed of creating your own little world? Well, now you can in this fun block-based crafting game that starts with just one little square of land in the ocean—you’ll need to be crafty and resourceful to build out from there and create a green and pleasant land for you and your new friends. Mine, farm, build and craft your way to a whole new world in this entertaining simulator that provides hours of fun for players of all ages.<br/><br/>► ROME WASN’T BUILT IN A DAY<br/><br/>You start the game surrounded by ocean, so if you don’t want to stay stranded like a shipwreck, you’ll have to get building. Start by expanding the land you’re standing on block by block, and you’ll soon be building houses, farms, factories and all sorts of other constructions until eventually you have a whole beautiful world thriving with industry and commerce.<br/><br/>► THIS WORLD OF MINE<br/><br/>You’ll need all sorts of resources for your construction projects, so before you craft, you’ll have to mine. In Craft Valley, there’s a huge range of different materials needed for building projects, so you have to hunt down exactly the right species of tree, type of rock, or specific metal that each object requires—and sometimes you’ll have to build the land to extract them from first!<br/><br/>► TOOLS OF THE TRADE<br/><br/>There’s a lot to mine in this simulator game, and you’ll have to start by digging with your bare hands, but soon you’ll be able to craft basic tools, and then you can race through the stages of human progress from the stone age to the modern world, making more and more advanced instruments on your workbench. They’ll make extracting resources faster and allow you to access a greater range of materials.<br/><br/>► THAT’S ANOTHER STORY<br/><br/>In Craft Valley, everything happens in stages—construct buildings wall by wall and story by story, and you’ll get rewards for each stage you complete. You can also level up your instruments to speed up your work, and increase your character’s mining and crafting abilities until he’s a real master of all trades. The march of progress is unstoppable!<br/><br/>► YOU DON’T HAVE TO GO IT ALONE<br/><br/>Think you’re all alone in this brand-new world? You’ll soon find there are lots of other characters around. Whether you’re looking for more construction and craft jobs, hoping to outsource some of your work, or just want someone to chat to, you’ll find new people to interact with around every corner.<br/><br/>► GOOD THING YOU TOOK THOSE SWIMMING LESSONS<br/><br/>However much you build up your world, there’ll still be plenty of sea around, and sometimes the fastest way to get from A to B is straight across it. You won’t have to walk on water, though—your character is an excellent swimmer, so drive right in!<br/><br/>► VARIETY IS THE SPICE OF LIFE<br/><br/>Looking for a new block-based building game with a quirky style of its own, entertaining gameplay and a huge range of in-game activities? Download this fun world-building simulator now and get out into the big wide world—once you’ve built it, that is!<br/><br/>Privacy Policy: https://say.games/privacy-policy<br/>Terms of Use: https://say.games/terms-of-use", "metacritic": null, "released": "2022-12-18", "tba": false, "updated": "2023-01-16T05:58:01", "background_image": "https://media.rawg.io/media/screenshots/7cb/7cb6363706c8da72a537330bd4eedc78_VgO6Fhc.jpg", "website": "https://say.games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SayGames"], "genres": ["RPG", "Casual"], "publishers": ["SayGames"], "esrb_rating": "Everyone 10+"}