{"id": 909890, "slug": "dumb-ways-to-die-dumb-choices", "name": "Dumb Ways to Die: Dumb Choices", "name_original": "Dumb Ways to Die: Dumb Choices", "description": "You have saved the Beans from difficult and dangerous situations multiple times. Now they are going on a fun vacation! But will they be safe this time? Would you save them again this time from all the challenges?<br/><br/>Help the Dumb Ways To Die Beans to stay alive in this fun and addictive, yet tricky choices based logic puzzle game! If you love problem solving and testing your IQ, this brain teaser game will have you thinking and using your wit. Choose the correct option so the Beans can stay alive and enjoy their vacation. Be careful as they will not do well if you choose the wrong choice.<br/><br/>Unlock the funny story of their adventures, meet the other Beans — Find your favourite Bean! There are many of them!<br/><br/>Features:<br/>1. Interesting progressive story<br/>Each level has a unique, addictive, and funny story. You’ve tried the right choice? Why not go back and see what the wrong choice would bring you?<br/>2. Simple yet addictive puzzles<br/>Sick of difficult and complicated games? This game is easy to play! Just choose what you think the Beans should do in every situation.<br/>3. A lot of levels to unlock<br/>There are many levels to unlock! Keep playing to proceed and unlock all the levels!<br/><br/>Dumb Ways To Die: Dumb Choices is playable by anyone at any age. Download the game to start your adventure with the cute Beans and save their vacation!", "metacritic": null, "released": "2022-12-21", "tba": false, "updated": "2023-01-16T05:57:00", "background_image": "https://media.rawg.io/media/screenshots/1c7/1c76ebf3d8835c1d17a2572a62f59f61_2FbUawd.jpg", "website": "https://www.dumbwaystodie.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Metro Trains Melbourne"], "genres": ["Casual", "Puzzle"], "publishers": ["Metro Trains Melbourne"], "esrb_rating": "Everyone 10+"}