{"id": 90986, "slug": "undertale-kissy-cutie", "name": "Undertale: Kissy Cutie", "name_original": "Undertale: Kissy Cutie", "description": "<p><em>Long ago, two races ruled Earth… but you already knew that. This is not the story of how monsters where trapped underground, this is the story of how they tried to return to the surface. After they were freed, monsters tried to live along side humans. But as expected, humans didn’t exactly welcome them with warm arms. With humans being attacked and monsters disappearing, the only chance for peace seems to be convincing the daughter of the mayor, the manager of the orphanage Frisk grew up in, that monsters are not as bad as they may seem. But strange nightmares seem to haunt you at night, and you are losing your determination. Can you make peace between humans and monsters? What are these memories that haunt you? Can you free everyone this time?</em></p>\n\n<p>In this game Frisk takes the role of the ambassador to bring peace once and for all between humans and monsters. The objective of the game is to convince humans that monsters are not evil. To do that you have to pick a monster to spend time with Sona, the daughter of the mayor. The game plays like a dating sim, but everything is purely platonic. This is not a story of romance, but a story about friendship, struggle, hope and bonds, where discrimination, prejudice, abuse and manipulation are the villains.\r\n  </p>\n<p>The <strong>demo is 30 minutes long</strong> and it has the <strong>full introduction</strong> to the story. We hope that at least an alpha is ready by the end of august with a rough version of all the paths.</p>\n\n<p>There are 4 paths: Papyrus, Sans, Undyne and True; with 3 endings in total: Genocide, Neutral and True. </p>\n<p>All the main monsters appear in the game: Alphys, Mettaton, ASGORE, Toriel, Muffet, Monster Kid, BurgerPants and many others.</p>\n<p>Several humans original characters appear in the game as well. </p>\n\n<p>Remember that we are always looking for artists and coders to help us finish and improve this game. So if you are interested in participating please send us a message and a sample of your work.</p>\n<p>So far we have more than half of what we need. </p>\n<p> Story 100% </p>\n<p> Characters 80% </p>\n<p> Backgrounds 60% </p>\n<p> Coding %20</p>\n\n<p><strong>Contact Info</strong></p>\n<p>Tumblr</p>\n<p>Twitter</p>\n<p>Email:avalonlake@gmail.com</p>", "metacritic": null, "released": "2017-07-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c21/c212c0784abfacfb6cc1db19437bee5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Roseradetea"], "genres": [], "publishers": [], "esrb_rating": null}