{"id": 909896, "slug": "real-car-master-racing-city", "name": "Real Car Master - Racing City", "name_original": "Real Car Master - Racing City", "description": "Real Car Master: Racing City Game 3D provides you with a stunning experience with the latest-updated engine, stunning 3D graphics, fast-furious racing experience and the most luxury cars that you can get in real life. Specially, the game is crash-free so you will not be disrupted from enjoying your game journey. You can compete with other racers to be the best one in town.<br/><br/>Real Car Master: Racing City Game 3D :<br/>- Multi language versions:<br/>We have many different languages for your own choice for the best gaming experience.<br/>- A wide selection of cars:<br/>Want to experience A-class cars ? This game is suitable for you since there are plenty of sport and mordern cars like Porsche, Bugatti, Chevrolet, Aston Martin and Audi ... You can also unlock many exclusive features to customize car body paint, the rims, and wheels or apply different-looking body parts to race with around the world.<br/>- Diffrerent game modes:<br/>Take your car driving skills to a new level with the career mode or compete against other players in multi-player mode. There is also time-limited mode for a tight and breath-taking experience. Controls are customizable for the best suit of your own playing style.<br/><br/>- Variable events:<br/>Play different in-game events &amp; don’t forget to check lots of other modes for a fresh twist on racing. Win top prizes in the Championship. Racing in over 100 city maps.<br/><br/>- Quality graphics:<br/>We have tried our best to bring to you the most realistic 3D graphics for a speed driving experience. We also provide you unique HD 3D graphics features detailed car damage, fully functional rearview mirrors, and dynamic reflections for truly HD racing.<br/><br/>- Impressive sound:<br/>Better music, better experience. Beside qualified graphics, we also focus on enhancing sound effect quality. Enjoy the music while playing our games. Music off is avalable in the setting button.<br/>Real Car Master: Racing City Game 3D let you be a professional driver both in driving.<br/><br/>Our game is free but ads are supported. If you have any complains, please read our policy or reach out to us for more information.", "metacritic": null, "released": "2022-12-19", "tba": false, "updated": "2023-01-16T06:03:09", "background_image": "https://media.rawg.io/media/screenshots/905/905f4e9291acea44909b3257021df3ae.jpg", "website": "https://tripsoft.io", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ngoc vinh trading service company"], "genres": ["Simulation", "Racing"], "publishers": ["NGOC VINH TRADING SERVICE COMPANY"], "esrb_rating": "Everyone 10+"}