{"id": 909889, "slug": "rogue-with-the-dead-idle-rpg", "name": "Rogue with the Dead: Idle RPG", "name_original": "Rogue with the Dead: Idle RPG", "description": "Rogue with the Dead is an original roguelike RPG where you command and power up troops on an endless, looping journey.<br/>What kills you makes you stronger.<br/><br/>An innovative game from room6, the team that has brought you such successes as Unreal Life and Gen’ei AP.<br/><br/>◆Defeat the Demon Lord<br/>Your mission is to lead an envoy of soldiers for 300 miles, in order to defeat the Demon Lord at the end.<br/>Completing quests and killing monsters will earn you coins that you can use to make your troops stronger.<br/>They fight automatically, and you can choose to either wait and watch them have at it or join the battle yourself.<br/><br/>Soldiers respawn after they’re killed, but you don’t. You’ll lose all soldiers, money, and items, except for artifacts, and you’ll have to start over.<br/><br/>To stand a chance against the powerful bosses impeding your progress, you’ll need to collect as many artifacts as you can. Defeating them, in turn, will grant you more artifacts.<br/><br/><br/>◆Many different playstyles<br/>・Power up soldiers, defeat monsters, and clear dungeons<br/>・An endless loop of dungeons<br/>・Hire healers, summoners, magicians, and more to fight for you<br/>・Focus on knights for close-range attacks or upgrade your wizards to crush enemies long-range? The choice is yours<br/>・Defend yourself from the incoming enemies in true tower defense fashion<br/>・Power up quests to earn more coins automatically in idle mode<br/>・No annoying controls required as most of the game can be played while idling<br/>・Find even stronger soldiers to defeat tough bosses<br/>・Collect many useful artifacts<br/>・Gather ingredients to cook meals to enhance your soldiers’ powers<br/>・Compete with other players in the online leaderboard<br/>・Roguelite mechanics, making you stronger every time you start over<br/><br/>◆A beautiful pixel art world<br/>Travel through a fantastic world and its story drawn in beautiful pixel art. Enjoy the journey to the Demon Lord’s castle together with your troops and your guide Elly.<br/>Little by little, you’ll find out about what happened before your arrival, and Elly might know more than she lets on...<br/><br/>◆Watch the numbers grow<br/>At first, you’ll deal 10 or 100 points of damage. As you progress with the upgrades, the numbers will grow in the millions, billions, trillions... Enjoy the exponential growth of your power.<br/><br/>◆A varied roster of soldiers<br/>Swordsman<br/>A basic warrior unit with high health who fights on the front line to protect other soldiers.<br/><br/>Ranger<br/>An archer that can attack from afar. However, it is slower and has less health than warriors.<br/><br/>Pigmy<br/>A tiny warrior with low health and weak attack, but very fast movement. It can quickly sneak close to enemies to attack them directly.<br/><br/>Sorcerer<br/>A magician that deals high damage to enemies within an area. However, it is slow and rather fragile.<br/><br/>...and many more.<br/><br/>◆Artifacts that power you up<br/><br/>・Increase attack by 50%<br/>・Protect magicians from 1 attack<br/>・Increase all coins earned by 50%<br/>・1% of all soldiers' attack is added to the tap attack<br/>・Soldiers have a 1% probability of spawning at giant size<br/>・Necromancers can summon 1 additional skeleton<br/><br/>...and many more<br/><br/>◆If you’re tired, just idle<br/>If you want to take a break, just close the game. Quests will still continue even while you’re not playing the game. When you come back, you’ll have more coins to power up your soldiers and defeat that boss that has been giving you trouble.<br/>You can play for a few minutes at a time, so it’s perfect to fill in those little pockets of time throughout the day.<br/><br/><br/>◆You’ll probably like this game if...<br/>・You like idle games<br/>・You like “clicker” games<br/>・You want something to do in your spare time<br/>・You like strategy games<br/>・You like RPGs<br/>・You like pixel art<br/>・You want the game to progress while you're afk<br/>・You like tower defense games<br/>・You like roguelike or roguelite games<br/>・You like playing online<br/>・You like endless dungeon exploration games<br/>・You like seeing numbers grow exponentially<br/>・You go hard", "metacritic": null, "released": "2022-09-07", "tba": false, "updated": "2023-01-16T05:56:06", "background_image": "https://media.rawg.io/media/screenshots/67b/67b3f973e7f6f45471dc553c8ae8c0b5_yXUHBnb.jpg", "website": "https://www.room6.net/theroguewithdead", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["room6"], "genres": ["RPG", "Strategy"], "publishers": ["room6"], "esrb_rating": "Everyone 10+"}