{"id": 909867, "slug": "garden-balls-pin-pull-game", "name": "Garden Balls: Pin Pull Game", "name_original": "Garden Balls: Pin Pull Game", "description": "Pin Balls UP – Puzzles and gardening combined!<br/><br/>Are you a puzzle fan who also loves gardening? Ever wondered how you could combine your two favorite hobbies into one major grand adventure? You could always grow a hedge maze, of course, but it would take a while and not all of us have the space. Or sit in your yard doing jigsaw puzzles, but what happens when a nasty rain hits the skies? Well, now there’s finally another option — you can test your logic  in tricky physics-based puzzles while also tending a garden of beautiful pot plants as they blossom and grow in this fun and original game.<br/><br/>Give your plants the food they need!<br/><br/>- Slide pins and move sections to guide the little colored nutrient balls down the pipe to your hungry plants. Autogenerated levels means an endless stream of new puzzle challenges and the chance to go on earning rewards and upgrading your garden endlessly.<br/><br/>- Over 30 puzzle-game mechanisms give your logic a real workout. Make sure the balls don’t escape, multiply their number on the way down, and avoid hazards including fire and explosions to ensure your little green friends get the goodness they need.<br/><br/>- Delightful original graphics, fun animations, and beautiful sound design enhance your puzzle-solving entertainment. Plus, extensive personalization options include over 50 different skins for balls and 50 different designs of pins, so you can ensure your puzzles are aesthetically pleasing as well as rewarding.<br/><br/>- Collect two galleries of flowers and nine different plants — sunflower, anthurium, cactus, myosotis, narcissus, pansy, protea, strelitzia, and tulip . Then tend, feed, and combine them to lead them through a unique sequence of growing stages till they finally blossom in a riot of gorgeous blooms.<br/><br/>- Don’t forget the watering! In this game, watering isn’t just an essential gardening exercise, it’s also a way to boost your idle income. And it’s not the only one: there are loads of other ways to get free bonuses including bonus levels with free coins and coin rewards for returning players.<br/><br/>Gardening was never this much fun!<br/><br/>Engage your puzzle-game brain, get your nimble green fingers moving and escape into hours of logic fun. Work with the laws of physics and plot the optimal course for the balls, then let them loose, and watch as they shoot down the pipes with an immensely satisfying clatter.", "metacritic": null, "released": "2020-04-15", "tba": false, "updated": "2023-01-16T05:30:18", "background_image": "https://media.rawg.io/media/screenshots/caa/caab5ea9499688b1fc4ee3bbbe199013.jpg", "website": "https://hypercell.games/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hypercell Games"], "genres": ["Casual", "Puzzle"], "publishers": ["Hypercell Games SIA"], "esrb_rating": "Teen"}