{"id": 90981, "slug": "into-the-valley", "name": "Into the Valley (itch)", "name_original": "Into the Valley (itch)", "description": "<p>The game features a host of colourful and unique(ly bat-shit insane) characters whom you can have branching conversations with. Throughout the world are hundreds of books, documents and diagrams with which you must piece together the past.</p>\n<p>A bright aesthetic is juxtaposed with increasingly dark themes as the game progresses and you slowly gain an understanding of the events which took place. The game is entirely focussed around exploring and gaining an understanding of the valley society through conversations with the survivors and finding the remanents of those who have already perished.</p>\n\n<p><strong>THE DEMO</strong></p>\n<p>The demo is a showcase of the look and feel of the game, but is just a tiny taste of what is to come. The game opens up a lot after the initial sequence shown in the demo, its intended more of a showcase of the mechanics of the game and visual style than a representation of what the finished game will be like. </p>\n<p><strong>The game is still in fairly early development and I am working on it alone. If you want to support the project consider donating or following me on Twitter and YouTube. </strong></p>\n\n<p><strong>Patreon: https://www.patreon.com/IntoTheValley</strong><br/></p>\n<p><strong>YouTube:</strong> https://www.youtube.com/channel/UCUf_WrUQjDWnkR17WMGEMag</p>\n<p><strong>Twitter:</strong> https://twitter.com/DevResin</p>\n\n<p><em>Note: I don't have any experience building to OSX or Linux so please report any OSX or Mac loading problems</em></p>", "metacritic": null, "released": "2018-08-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b8c/b8c44379f3bdcac9ffa1890d713da8e1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Resin"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}