{"id": 909822, "slug": "zombie-admin", "name": "Zombie Admin", "name_original": "Zombie Admin", "description": "<strong>It's the zombie apocalypse, but you can't miss a work day!</strong> <br/>Your job has become significantly more difficult now that all your coworkers are trying to eat your brain. Scavenge for weapons, survive... and don't forget to restock the toner cartridges over at accounting. This humorous top-down shooter has you working your way up the corporate ladder, all the way to the rescue helicopter on the rooftop.<h3>FEATURES</h3><ul><li> Play solo or with a colleague in local co-op!<br/></li><li> Shoot zombies using keyboard/mouse or gamepad!<br/></li><li> Eight procedurally generated floors!<br/></li><li> Eight deadly zombie coworkers!<br/></li><li> Five different weapons!<br/></li><li> A lot of work to do!<br/></li><li> Coffee!<br/></li><li> Toilets?!</li></ul><h3>EMPLOYEE HANDBOOK</h3><br/>We would like to personally welcome you to the office family. As administrator, your job is to keep our office running smoothly.<br/><br/><h3>- Your Health Is Important To Us -</h3>Doing your job (or getting bitten by your coworkers) can be stressful. Be sure to drink enough coffee to keep you going. If you become aware that all that drinking is beginning to negatively affect your productivity, we are legally obligated to inform you that you are free to use any of the multiple bathrooms available on each floor.<h3>- Safety First -</h3>A safe work place is a happy work place, this is why we have placed multiple firearms on each floor of the office. Feel free to use them if you have to—your coworkers can be replaced.<h3>- Performance Reviews -</h3>We will regularly evaluate your performance to help you grow to your full potential. While these evaluations are not mandatory, our company has a long and proud history of rewarding achievement.", "metacritic": null, "released": "2023-01-13", "tba": false, "updated": "2023-01-16T04:33:19", "background_image": "https://media.rawg.io/media/screenshots/72a/72aaf0e9a7e86315637c71cfe788a7f3.jpg", "website": "https://hastilyassembled.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Hastily Assembled Games"], "genres": ["Action", "Indie"], "publishers": ["Hastily Assembled Games"], "esrb_rating": null}