{"id": 909963, "slug": "the-ancestral-legacy-2", "name": "The ancestral legacy", "name_original": "The ancestral legacy", "description": "Kyung Lee arrives at a country village to spend summer vacation. <br/>His peace and quiet are ruined by an unwanted encounter.<br/><br/>\"You are of the Lee line?\"<br/>\"I will watch all from within your own eyes\"<br/>\"Do not worry. A reward will surely follow.\"<br/><br/>The spirit slowly starts to change Kyung and the people around him.....<br/><br/><br/># An exciting visual mystery novel game<br/>'The Ancestral Legacy' is a brand new mystery thriller visual novel game that keeps you on the edge of your seat. <br/>'The Ancestral Legacy' is an interactive mystery novel, true to the genre, and uses an easy to use messenger format.<br/><br/># Main features<br/>- A mystery that will keep you guessing until the very end<br/>- The story changes with every choice you make <br/>- Unique visuals will maximize the horror <br/>- Various layouts that flow with the story of the visual mystery novel<br/>- Distinctive and bewitching characters perfect for the thriller<br/>- The changing fate of the characters based on the main character's choices<br/>- Achievements to unlock, various endings and an epilogue to read <br/>- Witty conversation to keep you glued as you dive into the mysterious story<br/><br/># The Ancestral Legacy is just for you!<br/>- For fans of '7Days' and 'Underworld Office' <br/>- For fans of horror games, story games, thriller games<br/>- For fans of easy games, indie games, mystery games<br/>- For fans of animatronics, ghost games, spirit games and other horror simulation games<br/>- For fans of text games like light novels or visual novels<br/>- For fans of horror games, thriller games, chatting games, novel games, decision games<br/>- For fans of decision games, episode simulation games and other games where you make the choice", "metacritic": null, "released": "2022-04-14", "tba": false, "updated": "2023-01-16T07:06:14", "background_image": "https://media.rawg.io/media/screenshots/4c9/4c9253a5a05681e8a50c98451eea39f5_1mGzDQK.jpg", "website": "http://www.buffstudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Buff Studio"], "genres": ["Adventure", "Simulation"], "publishers": ["Buff Studio"], "esrb_rating": "Everyone 10+"}