{"id": 9099, "slug": "zombie-commando", "name": "Zombie Commando", "name_original": "Zombie Commando", "description": "You have no choice: kill or get killed. <br/><br/>Do you really believe you could survive this zombie world as a lone ranger? Think again: be realistic and be a TEAM. <br/><br/>Zombie Commando is a real-time teamwork zombie slaughtering game with FANTASTIC PIXEL GRAPHICS. Build and command a team of 8 eccentric characters and lead them around the world to hunt down zombies in Egypt, China, some secret lab, abandoned military bases and even an icy dungeon! All this with the tip of just one finger...<br/><br/>As a team commander, you know better than anyone how important good member selection and combination are to succeed. In Zombie Commando, you have 15 unique classes to choose from. Classic tank, sniper, area attack, special weapon effects, you name it! Not to mention you can upgrade your soldiers... and see very special things happening to their gear!<br/><br/>But what is a hero without proper enemies? Well, not much of a hero... That&amp;#39;s why you’ll come across many many kinds of monsters during your journey, and notably some HUGE desperate BOSSES! Zombie Commando is not just a zombie-slaughtering game: it requires from you to be tactical! You need to kill zombies, sure, but also to rescue civilians, escort VIP, hold grounds, operate traps, and understand bosses’ skills!<br/><br/>Zombie Commando currently has 50 levels spread in 5 unique chapters... And more will be added with future updates.<br/><br/>FEATURES:<br/><br/>• Simple but in-depth 1-finger team control <br/>• Optimized AI system <br/>• Fantastic pixel graphics <br/>• 15 unique playable classes <br/>• 5 big bosses and 18 unique zombies <br/>• 50 levels within 5 chapters <br/>• Various mission objectives and challenges <br/>• Challenge your friends with Game Center", "metacritic": null, "released": "2014-07-17", "tba": false, "updated": "2019-10-22T14:30:17", "background_image": "https://media.rawg.io/media/screenshots/643/64377b63769f1a13899fb356feaeb1d0.jpeg", "website": "http://www.bulkypix.com/games", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bulkypix"], "genres": ["Adventure", "Arcade"], "publishers": [], "esrb_rating": "Teen"}