{"id": 909967, "slug": "block-blast-adventure-master", "name": "Block Blast Adventure Master", "name_original": "Block Blast Adventure Master", "description": "Meet Block Blast Adventure Master, the perfect block puzzle game that will relax your mind while you from block puzzle after block puzzle and go on massage your brain, fun and addicting!<br/> <br/>Have you ever played woody puzzle game? Do you like cube block game and grid game? Block Blast Adventure Master is the game for you because it combines the free block game with the best cube block grid game.<br/> <br/>This free block game makes playing block puzzle fun. If you love block puzzles, this game is sure to get you excited. Block Blast Adventure Master is also the perfect puzzle game to keep your brain active hard.<br/> <br/>Starting off easy, this block puzzle game will keep you immersed in pure block puzzle bliss. With unlimited tries, you can go on and on, taking your IQ score to new heights!<br/> <br/>Block Puzzle Game Features:<br/>• A classic block puzzle game for all ages.<br/>• Enjoy building blocks anytime, anywhere.<br/>• No wifi required, great for killing time.<br/>• Free block puzzle games and story adventure mode.<br/> <br/>How to play the block puzzle game:<br/>• Drag and drop cube blocks into an 8x8 grid.<br/>• Fill rows or columns with blocks to eliminate them.<br/>• If there are no remaining blocks, the game is over.<br/>• Blocks cannot be rotated, making it more challenging and uncertain<br/> <br/>How to get a high score in this block puzzle game:<br/>• Use the blank space on the board wisely to create more possibilities.<br/>• Try deleting multiple lines at once to get a higher score.<br/>• Plan ahead for more communities than just the current one.<br/>• Choose the best position for the block based on the shape of the block.<br/> <br/>In this block puzzle game, you will also experience the new and original COMBO gameplay. Drag and drop blocks onto the board, fill a row or column to complete elimination, clearing multiple rows or columns at once will result in cool elimination animations and bonus points. The more COMBOs you perform, the more points you earn. Test your IQ and exercise your brain in Block Blast!<br/> <br/>Follow us at Facebook: Block Blast<br/>Suggestions or Comments? Give us a shout at blockblast@hotmail.com", "metacritic": null, "released": null, "tba": false, "updated": "2023-01-16T07:12:05", "background_image": "https://media.rawg.io/media/screenshots/477/477ca28fdccab40b2e04f6ec9533c42e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Hungry  Studio"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": "Everyone 10+"}