{"id": 9100, "slug": "elemental-knights-online", "name": "Elemental Knights Online", "name_original": "Elemental Knights Online", "description": "Achievement of Three Million Installations of Elemental Knights Series!!<br/>We are very thankful for all and provide these specials.<br/><br/>- Get rewarded as much as you play ELEMENTAL KNIGHTS ONLINE（EKO）<br/><br/>ELEMENTAL KNIGHTS ONLINE is a real-time, full 3D MMORPG that you can play with anyone in the world!<br/><br/>Join your friends on a grand adventure through mysterious lands with eccentric locals...<br/><br/>Also, you can get a limited cosplay item by<br/>getting a stamp once a day and saving them!<br/><br/>{Update}<br/>New function to convert/trade cosplay items &amp;amp; medals,<br/>Gacha sale featuring items from popular series,<br/>Raid battle against a huge boss character with your friends,<br/><br/>And a whole lot more is in the works!<br/>Stay tuned!<br/><br/>This game features:<br/><br/>- Monk, thief, bishop, wizard, magiknight, and more job-classes<br/>- Thousands of items, a trillion combinations, and cosplay gear such as Neko Ears<br/>- Hundreds of NPCs and over 100 quests<br/>- Party creation with up to four people<br/>- Free chat, emoticons, and gestures let you communicate in fun and meaningful ways<br/>- Play in English or Japanese<br/>- Grassy plains, forests, deserts, underground canals, haunted castles, and more.<br/><br/><br/>===================================================================<br/>●The World&amp;#39;s Destiny<br/><br/>Spirits, creatures, and humans have been blessed with technology and magic as a means of living thanks to ELEMENTAL: the power that dwells inside all of nature and the resting place of the gods.<br/><br/>300 years ago, lust for this power drove the citizens of this world into a Great War with one another. But four heroes stood up in the name of peace and restored harmony the land…<br/><br/>But recently the monsters and spirits have grown violent. The Dragons awaken from a three century slumber. A wave of tragic incidents ensues...<br/><br/>Each country sends out their knights and adventurers to investigate the bizarre happenings. What is the meaning of all this?<br/><br/>Now you must take up your arms and armor. On your journey you shall encounter beautiful witches, humble townspeople, discouraged knights, breathtaking sights, and wicked adversaries.<br/><br/>Let nothing prevent you from solving the mystery behind the recent chaos! Our world is in peril.<br/>===================================================================<br/><br/><br/>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++<br/>Join us on FACEBOOK: http://www.facebook.com/ElementalKnightsOnline<br/>Follow us on TWITTER: http://twitter.com/Ekoworlds<br/>Watch us on YOUTUBE: http://www.youtube.com/user/EKOworlds<br/>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++<br/><br/><br/><br/>*A list of all compatible devices can be found in the FAQ*<br/>-------------------------------------------------------<br/>Frequently Asked Questions<br/>http://www.winlight.co.jp/connect/en/eko_faq/<br/>-------------------------------------------------------", "metacritic": null, "released": "2011-10-28", "tba": false, "updated": "2019-10-22T14:30:17", "background_image": "https://media.rawg.io/media/screenshots/e8e/e8eb7f9d78b116e919004a01feb24161.jpeg", "website": "http://www.winlight.co.jp/en/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["WINLIGHT"], "genres": ["Adventure", "RPG"], "publishers": ["WINLIGHT"], "esrb_rating": "Everyone 10+"}