{"id": 91017, "slug": "starblast-itch", "name": "Starblast (itch)", "name_original": "Starblast (itch)", "description": "<p>Starblast is a fun, fast paced online multiplayer arcade space shooter. Take control of your spaceship, mine asteroids, increase your stats, upgrade to different types of spaceships with improved stats and weapons. Fight against other players and rob their gems. Starblast offers 31 unique ship models, thousands maps, 10 weapon classes and special powers. You can play 4 game modes: survival, teams, deathmatch and a last awesome new gamemode to be unveiled on official release day. A custom game creator allows creating private sandboxes or public special events, with a wide range of customization settings. The Pro Deathmatch Championship is a permanently running Starblast e-sport competition with leaderboards.</p>\n<p><strong>Game modes</strong><br/></p>\n<ul><li>Survival mode: Mine, upgrade your ship, steal gems, fight and be the last survivor. </li><li>Team mode: 3 teams, each team has a base space station. Mine crystals and bring them back to the base station to upgrade it. Rob crystals from enemy teams by attacking their base station or attacking their mining missions. Destroy enemies and their space stations to win. You can play different roles for your team: defend your station, go mining, escort large but slow mining ships, attack other team's missions or assault their stations.</li><li>Deathmatch: pick one of two ships for the round, kill your targets, be the first to earn 12 points to win the round ; you will be ranked in the Pro Deathmatch Championship</li><li>An awesome new mode will be unveiled on release day</li></ul>\n<p><strong>Ship tree</strong><br/>The Starblast ship tree features 7 tiers and 31 unique spaceships with different laser patterns and abilities.<br/></p>\n<br/><br/><br/>\n<p><strong>Secondary weapons</strong><br/>You can acquire and use different types of secondary weapons and powers allowing to build different offensive and defensive strategies.<br/></p>\n<p><strong>Ship Customization</strong><br/>You have access to a range of custom materials for your spaceship (Titanium, Carbon, Alloy, Gold), different laser styles (Doubled, Lightning, Digital), custom ingame badge (Pirate, Invader, Reddit, Youtuber, Paw, Star). More materials, lasers, badges will come.</p>\n<p><strong>Custom games</strong><br/>Starblast allows you to create custom games with specific options: change the size of the map, the asteroids patterns, crystal value, asteroid strength, ships speed, starting ship, number of teams, size of the space stations etc. More customization options to come!<br/>You can share your custom game and thus use this system to create private parties or public events.</p>\n<p><strong>More details</strong><br/>We use procedural generation to create different star systems and asteroids fields. You will almost never play twice in the same arena, with the same asteroids configuration.</p>\n<p>See you soon ingame, Commander!<br/></p>", "metacritic": null, "released": "2017-06-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bf0/bf0454fd8501efb12d5f9e609d05f5b9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 297, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Neuronality"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}