{"id": 91023, "slug": "vanishing-stars-colony-wars", "name": "Vanishing Stars: Colony Wars", "name_original": "Vanishing Stars: Colony Wars", "description": "<strong>VANISHING STARS : COLONY WARS<br/>DEMO<br/></strong>\n\n<p>BEWARE! This is only a demo of our game concept. More is coming soon! So please subscribe if you want to receive future versions of the game.</p>\n<p> «<strong><em> Vanishing Stars: Colony Wars </em></strong>» is a MMO Tower Defense game inside a huge galaxy where people fight in a persistent world to conquer new planets and explore the galaxy.</p>\n<p>This  solo demo has been made for Paris Games Week 2016 and now we want to share it with you.<strong>Share with your friends, enjoy and have fun!</strong></p>\r\nStory\r\n<p>On February 7, 2252, an army of gigantic spiders and insects launched a surprise attack on the Earth. Appearing near the Solar System aboard a gigantic Centipede, these fearless warriors quickly reduced earth orbital defense systems to a state of total chaos.</p>\n<p>Human technology was unable to fight against the speed and numbers of the invaders. Earth's defense was rapidly abandoned in order to concentrate on evacuation. While the Triumvirate still continues to resist thanks to its colonies on Mars and Tau Ceti, the rest of the refugees went in search of a new planet to call home, one far from our solar system.</p>\n<p>In « <strong><em>Vanishing Stars: Colony Wars</em></strong> », you play as a human troop commander whose mission is to survive by colonizing the galaxy and destroying enemy factions. The game is a MMO Tower Defense with mixed PvE and PvP allowing players to explore the galaxy, conquer new planets occupied by the Myriad and rapidly play against others players human factions.</p>\n<p>By exploring the galaxy, planet by planet, you must:</p>\n<ul>\n<li><strong>Launch the offensive</strong> against enemy bases in order to conquer many planets</li>\n<li><strong>Take control of your new planets and organize their defenses.</strong></li>\n<li><strong>Upgrade your towers and troops</strong> in your mothership using loots earned during your battles</li>\n</ul>\n<p> Website - Facebook - Twitter - Discord - Dev Blog</p>", "metacritic": null, "released": "2017-09-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5f8/5f8bf654b3b212e09369e075c9df10ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ninpo"], "genres": ["Action", "Strategy"], "publishers": [], "esrb_rating": null}