{"id": 91035, "slug": "two-interviewees", "name": "Two Interviewees", "name_original": "Two Interviewees", "description": "<p>\n<strong>OPEN-SOURCE PROJECT:</strong>\n</p>\n<p>\r\nhttps://github.com/maurovanetti/two-interviewees\r\n</p>\n<p>\n<strong>UPDATE v1.4:</strong></p>\n<ul><li>New Korean translation.</li>\n</ul>\n<p>\n<strong>ENGLISH:</strong>\n</p>\n<p>\r\n\tTwo people are unemployed. They are going to be interviewed today and if they manage to make a good impression they will get the job.\r\n</p>\n<p>\r\n\tThe questions are the same, the answers are the same, but the interviewees are not the same: one is Martin, a man, the other one is Irene, a woman. Should it make any difference?\r\n</p>\n<p>\r\n\tThis is a narrative mini game created in Italian by indie developer Mauro Vanetti in one day during the Narrative Game Design course held by We Are Müesli in Bologna in January 2016. It's now being published in English, Italian, French, Spanish, Brazilian Portuguese and Korean with a revamped graphics by Emanuele Klemp in order to spread awareness about gender discrimination in access to work.\r\n</p>\n<p>\r\n\tThis game is free. Donations will only be used to promote it.\r\n</p>\n<p>\n<strong>ITALIANO:</strong>\n</p>\n<p>\r\n\tDue persone sono senza lavoro. Hanno un colloquio proprio oggi e se riescono a fare una buona impressione saranno assunti.\r\n</p>\n<p>\r\n\tLe domande sono uguali, le risposte sono uguali, ma i candidati non sono uguali: uno è Marzio, un uomo, l'altra è Irene, una donna. Fa differenza?\r\n</p>\n<p>\r\n\tQuesto è un giochino narrativo creato in lingua italiana dallo sviluppatore indipendente Mauro Vanetti nel corso di un giorno durante il corso di Narrative Game Design tenuto da We Are Müesli a Bologna nel gennaio 2016. È stato adesso ripubblicato in italiano, inglese, francese, spagnolo, portoghese brasiliano e coreano con una grafica tutta nuova a cura di Emanuele Klemp con lo scopo di diffondere consapevolezza sulla discriminazione di genere nell'accesso al mondo del lavoro.\r\n</p>\n<p>\r\n\tQuesto gioco è gratuito. Le donazioni saranno usate esclusivamente per la sua promozione.\r\n</p>\n<p>\n<strong>FRANÇ</strong><strong>AIS:</strong>\n</p>\n<p>\r\n\tDeux personnes sans emploi. Elles ont un entretien aujourd'hui et si elles arrivent à faire bonne impression, elles auront le boulot.\r\n</p>\n<p>\r\n\tLes questions sont les mêmes, les réponses sont les mêmes, mais les candidats ne sont pas les mêmes : l'un est Martin, un homme, et l'autre est Irène, une femme. Est-ce que ça à une importance ?\r\n</p>\n<p>\r\n\tCeci est un petit jeu crée originalement en italien par le développeur indépendant Mauro Vanetti en un seul jour, pendant le programme Narrative Game Design de We Are Müesli. Il est maintenant publié en français, anglais, italien, espagnol, portugais brésilien et coréen avec des graphismes améliorés par Emanuele Klemp pour sensibiliser à la question de la discrimination sexuelle pour l'accès à l'emploi.\r\n</p>\n<p>\r\n\tCe jeu est gratuit. Les donations ne serviront qu'à sa promotion.\r\n</p>\n<p><strong>ESPAÑOL:</strong></p>\n<p>Dos personas están desempleadas. Ambas van a ser entrevistadas hoy y, si consiguen causar una buena impresión, conseguirán el puesto de trabajo.</p>\n<p>Las preguntas son las mismas, así como las respuestas, pero las personas entrevistadas no son las mismas: una es Marcos, un hombre, y la otra es Laura, una mujer. ¿Debería haber alguna diferencia?</p>\n<p>Este es un minijuego narrativo creado en un día, en italiano, por un desarrollador indie llamado Mauro Vanetti, durante el curso Narrative Game Design organizado por We Are Müesli en Bologna, en enero de 2016.</p>\n<p>Actualmente se ha publicado en inglés, italiano, francés, castellano, portugués brasileño y coreano, con nuevos gráficos de Emanuele Klemp, para concienciar a las personas sobre la desigualdad de género en el acceso al mundo laboral.</p>\n<p>Este juego es gratuito. Las donaciones se destinarán exclusivamente a su promoción.<br/></p>\n<p>\n<strong>SOURCES / FONTI / REFERENCIAS / RÉFÉRENCES:</strong><br/>\n</p>\n<ul>\n<li><em>The gender pay gap in the European Union (fact sheet)</em></li>\n<li><em>Strategic Engagement for Gender Equality 2016-2019<br/>\n</em></li>\n<li><em>Gender inequality</em></li>\n<li><em>Statistical data on women entrepreneurs in Europe</em></li>\n<li><em>Gender pay gap statistics</em></li>\n<li><em>The Global Gender Gap Index 2015</em></li>\n<li><em>A New Method to Understand Occupational Gender Segregation in European Labour Markets</em></li>\n<li><em>Pregnancy and Maternity Related Discrimination and Disadvantage</em></li>\n<li><em>Molestie sessuali e ricatti sul lavoro in Italia</em></li>\n<li><em>The Simple Truth about the Gender Pay Gap</em></li>\n<li><em>Your Right to Equal Pay</em></li>\n<li><em>Salario anual medio, mediano y modal. Salario por hora. Brecha salarial de género (no ajustada) en salarios por hora</em></li>\n<li><em>Los perfiles de la discriminación en España: Análisis de la Encuesta CIS-3.000</em></li><li><em>The Pursuit of Gender Equality</em></li></ul>", "metacritic": null, "released": "2016-02-15", "tba": false, "updated": "2024-01-08T18:35:45", "background_image": "https://media.rawg.io/media/screenshots/42e/42ec251e0f7f9fa157f8c5a8bdb0715d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Mauro Vanetti"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}