{"id": 910532, "slug": "hotel-horror-visiting", "name": "Hotel Horror Visiting", "name_original": "Hotel Horror Visiting", "description": "<p>The size compression has been adjusted, so playing the game directly will cause the player's visual movement to be restricted, but! Here is a way to solve this problem: <strong><em>After entering the game screen, please click on the blank space of the web page, causing the game to freeze. After 3-5 seconds, you can open the full-screen mouse and click the game, and the mouse disappears from the game screen, then The game can be played normally!</em></strong> thank you all. （If there are still visual errors, please continue to try to click on the blank space again and wait for the game to refresh.）</p>\n<p>Sorry guys！！！Because the game file is too large, uploading the web version is restricted, so textures, music boxes, and models are all compressed. I hope you can better feel the game atmosphere on the web page (try to keep the full-screen game)  <br/></p>\n<p>Next is the game story background, game rules, and game operation guide</p>\n<p>WSAD moves up, down, left, and right </p>\n<p> E Turns the flashlight on or off  R can switch lights (only for lights in bars) </p>\n<p> Press and hold SHIFT to walk, can accelerate walking  </p>\n<p>SPACE is the jump key (you can jump when necessary）</p>\n<p>In the position of the ellipse shape, the effect of discoloration will appear when the mouse is clicked.<br/></p>\n\n<p>If you are interested in the prototype of the game story, please read the story before exploring the game!<br/></p>\n<p>original story（By myself）: A family of three is here for vacation This hotel is quite in line with the needs of this family Dad likes to drink, and the hotel has a bar Mom likes to read books to edify herself. The hotel also has cafes and books As for the children, they have been talented in art since they were young, and they really love and hate art. The hotel also has a gallery and observation deck but who knows I was called back to work overtime before I had enough fun. just live in this hotel Stayed for three days and three nights, no, three days and two nights It's the night of the third day.</p>\n<p>On that night, the husband and wife were enjoying a romantic time outside, drinking red wine and talking about love, and planned to go to a hot spring in the evening. The child was tired from playing during the day, so I gave him a tablet to watch cartoons at night, and he could be obedient.</p>\n<p>But who knows that the husband and wife should have received the call at about the same time, and they received a call from the police saying that his home was stolen, and his wife also received a notice from the company to go back immediately. If she doesn't go back this time, the child will be dismissed. I'm still young, but I just keep complaining. Forget it, who would have thought that when it was time to pay, it was stormy outside, the sky was clear during the day, and at night, suddenly...</p>\n<p>Had to rush back to the hotel He came back out of breath and most of his body was wet The atmosphere suddenly rose They arrived at the hotel lobby first. The waiter was very polite and gave them towels to wipe their bodies. While wiping their bodies, they went to the front desk and said that they needed to check out early. I can only tell them that the money cannot be refunded, but the room will be reserved for them. This made the family of three even angrier. They only stayed for three days after booking for seven days, and they wasted four days’ rent in vain.</p>\n<p>After arguing with the front desk for a few minutes, the whole family decided to give up the money and go back. I was even more anxious to go back. After answering the phone, I booked a ticket to go back. The child didn’t know anything, anyway, I just watched it with headphones. with cartoon  Going upstairs from the front desk to the room, the couple is arguing so loudly that maybe even the people in the restaurant can hear it.</p>\n<p>The child just sat on the sofa at the front desk and continued to watch cartoons. He didn’t even know that his parents went upstairs, but it seemed that the child was tired of watching and wanted to get up for activities. A waiter said that the child walked around the hotel after his parents went upstairs. After running around, I saw something that I didn’t understand, so I asked the waiter. He said that the last time he saw the child was at the gallery. He seemed to be looking for his favorite painting because he was stopped by the waiter when he touched it with his hands. Later, I don’t know where the child went (it fell into the well）</p>\n<p>Time does not lie, the hotel will ring every hour The front desk is also strange. The parents have not come down since they went upstairs. Why did the children disappear as they walked? The waiter at the front desk is not busy, so I want to go to Wenwen and the others to see what else they need, but when I just went upstairs, I can only hear the waiter's cry, and the waiter fainted  Later, the police arrived, cordoned off the scene, and carried the dead bodies of the parents out. The waiter who fainted later never came to work again The waiter who was present that day wondered not why all this happened, but what about the child?<br/></p>\n\n<p><strong>END！！！</strong></p>\n<p><strong>In fact, everything the player sees is from the child's perspective. His parents are alive and the hotel is open as usual. A waiter who fainted and was absent from work was absent due to medical reasons and personal issues. So it's all a child's fantasy world. So give your children more love, and don't let them see anyone close to them, or what they hear and see is domestic violence.</strong>\n</p>", "metacritic": null, "released": "2023-01-15", "tba": false, "updated": "2023-01-16T11:08:51", "background_image": "https://media.rawg.io/media/screenshots/d67/d67b91eb809be7ca85f095ee700de855.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Eidio"], "genres": [], "publishers": [], "esrb_rating": null}