{"id": 910806, "slug": "the-dragnet-case-re-release", "name": "The Dragnet Case Re-Release", "name_original": "The Dragnet Case Re-Release", "description": "<p>\"Do you ever get a feeling of deja vu?\" asked Sam. \"I feel like we've told this story before.\"</p>\n<p>\"Don't worry Sam things have changed since we first told your story. For a start, we have both grown older and with the distance of time we found a few errors.\"</p>\n<p>\"Like what?\" asked Sam indignantly. </p>\n<p>\"Well, we left some players stranded in a jail cell with no way out, other players stranded in the back of a taxi, and let's not forget the room no one could get into.\"</p>\n<p>\"Surely just a couple of corrections were needed, not a whole new release.\"</p>\n<p>\"There is also the matter of the platform we told your story on. When we first tried to tell it we only had PAWS to use and that limited the end audience. Now we have been able to move to DAAD we are able to reach a wider audience. To avoid confusion between the two versions it was better to re-release.\"</p>\n<p>\"I suppose you have a point,\" said Sam grumpily \"but I liked the old loading screen better.\"</p>\n<p>\"Fair enough, but the trade-off is that the cactus on your desk gets to stay green.\"</p>\n<p>\"Well it's been nice chatting, but  I've still got cases to solve,\" said Sam donning his trilby and walking out his office door.</p>\r\nThe Game\r\n<p>You play the role of Sam Boon, an L.A. Private Detective. Ask anyone around here and they will have heard of you, however, most of them will question if you are still in business. Times have been hard the last 10 years, cases are fewer, pay less, and mostly involve finding lost cats. </p>\n<p>That is about to change, just as you are wondering where your next case will come from fate intervenes in the form of gunfire.</p>\r\nPlaying the Game\r\n<p>The game is an old-school text adventure, so put away your joysticks and get your fingers ready for some typing exercise.</p>\r\nTo Move\r\n<p>Movements are all in compass directions, therefore you can go North, East, South, and West. To do this you can type</p>\n<p>GO NORTH, or NORTH or for short just N.</p>\n<p>You can also go UP (U) or Down (D)</p>\r\nInteraction\r\n<p>To progress through the game you will need to interact with your environment and objects.</p>\n<p>If you type LOOK or L your current location will be redescribed.</p>\n<p>Objects can be EXAMINED or just X, for example (if you are brave enough) X SINK.</p>\n<p>Things can also be OPENED, CLOSED, LOCKED, UNLOCKED, PULLED, PUSHED, and INSERTED.</p>\r\nInventory\r\n<p>You can only carry a limited number of objects, sometimes to get a new object you will need to drop one.</p>\n<p>To add or remove objects you need to GET or DROP them, for example, GET HAT or DROP HAT.</p>\n<p>If an item is clothing you can WEAR it or REMOVE it.</p>\n<p>To see what you are carrying type INVENTORY or I.</p>\n<p>This should be enough to get you started, there is plenty more to discover.</p>\n<p>Be aware there are several ways to die in this game.</p>\r\nStarting the game\r\nSPECTRUM\r\n<p>There are several versions for the Spectrum machines. There is a 48K text-only version available in TAP and TZX formats. The 128K versions have occasional graphics and come in TAP, TZX, and DSK formats.</p>\n<p><strong>To load the tape version</strong></p>\n<p>Insert the TAP or TZX file, type LOAD \"\" and Enter. Then start the tape playing. Unless you have a machine with the Loader menu. Obviously, if you have copied the TAP file to a genuine cassette tape the instructions are slightly different, but if you are retro enough to do this you don't need to be told how to load.</p>\n<p><strong>To load disk version +3</strong></p>\n<p>Insert the DSK file and use the loader menu.</p>\r\nCOMMODORE C64\r\n<p>There are two version for the Commodore 64. Both are available in C64 disk format. The first version is full screen text only. The second version is half screen and uses high res graphics in key locations.</p>\n<p><strong>To Load the disk version</strong></p>\n<p>Insert the disk, type LOAD \"*\",8,1 and enter.</p>\n<p>Note loading from devices other than device 8 is not currently supported.</p>\r\nCOMMODORE PLUS 4\r\n<p>There is one version for the Plus 4 which contains graphics.</p>\n<p><strong>To load the disk version</strong></p>\n<p>Insert the disk, type LOAD\"*\",8 and enter. Then type Run enter.</p>\r\nAMSTRAD CPC\r\n<p>There are two versions for the Amstrad CPC both are available in DSK format. </p>\n<p> The first version is full screen text only. The second version is half screen and uses high res graphics in key locations.\r\n</p>\n<p><strong>To Load the disk version</strong>\n</p>\n<p>Insert the disk, type  RUN\"DAAD</p>\r\nAMSTRAD PCW\r\n<p>This is available as a DSK file and is currently only available in text only.</p>\n<p><strong>To Load the disk version</strong>\n</p>\n<p>Insert the disk, type  RUN\"DAAD\r\n</p>\r\nDOS/WINDOWS\r\n<p>This is available as a zip file. Unpack the contents of the zip file.</p>\n<p><strong>To run in Windows</strong></p>\n<p>Double-click on DRAGNET.BAT to open the included DOS BOX which will run the game.</p>\n<p><strong>To run in DOS</strong></p>\n<p>In the folder labeled GAME run the DRAGNET.BAT file.</p>\r\nATARI ST\r\n<p>This is provided as a .ST disk image.</p>\n<p><strong>To run</strong></p>\n<p>Locate the file Dragnet.prg and run this.</p>\r\nAMIGA\r\n<p>This is provided as an ADT disk image.</p>\n<p><strong>To run</strong></p>\n<p>Insert disk it should auto boot.</p>", "metacritic": null, "released": "2023-01-14", "tba": false, "updated": "2023-01-16T13:16:43", "background_image": "https://media.rawg.io/media/screenshots/5de/5de34dcf8ef27ac0b6ead04da23d301a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TaskmasterSoftware"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}