{"id": 910847, "slug": "elemental-quest-nightguarder", "name": "Elemental Quest (nightguarder)", "name_original": "Elemental Quest (nightguarder)", "description": "Description\r\n<p>Elemental quest is a 2D platform  game developed in Godot Engine. It takes place in a sci-fi <em>fiction world</em>, full of danger and nature <em>elements</em>. Choose your character to go on an epic journey !<br/></p>\r\nStory\r\n<p>Game begins and is set in a post-apocalyptic world - wasteland. But this wasteland is like no other, mainly because the story is placed in a fictional world, where anything can be seen. Story starts when our character stumbles upon ancient ruins, which remained from the ancient civilization. As we progress more, we learn more about this mysterious civilization and our character. Help your hero complete his journey and fulfil his destiny.\r\n</p>\r\nGoal\r\n<p>Your goal is to help your warrior conquer and harness the power of the elements, to eventually survive in this harsh environment. You will be taught skills and powers to defeat enemies and bosses. Each warrior has its own destiny and has to face multiple decisions that determine his fate. It is up to the player's decision on how the game ends. </p>\r\nRoadmap\r\n<ul><li>(Current release). Basic controls (attack, move) should be handled. First basic layout of the map etc.</li></ul>\n<ul><li>(v2). First Quest should be available. Get all the keys to progress to next level! Enemies also now attack you.</li><li>(v3). Better UI. Add a menu for in-game settings, such as sound and graphic options. Introduce new weapons and power-ups. Improve map design and level progression.</li></ul>\n<ul><li> (v4). Add multiplayer support. Players can now play with friends and compete in a leaderboard. </li><li>(v5). Add more levels, enemies, and boss battles. Implement a save system, allowing players to pick up where they left off.</li><li> (v7). Add achievements and rewards for players to strive for.</li></ul>", "metacritic": null, "released": "2023-01-14", "tba": false, "updated": "2023-01-16T13:35:32", "background_image": "https://media.rawg.io/media/screenshots/0ae/0aece0a1f8ece0867f3efe14e1c105ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["nightguarder"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}