{"id": 9108, "slug": "snow-fight", "name": "Snow Fight", "name_original": "Snow Fight", "description": "Snow Fight is an addictive and fun soldier command game,  the aim of which is to conquer a smorgasbord of enemy hideouts, collecting various medals as you go.    To achieve this, players command an elite squad of snowball slinging warriors who must capture the enemy snowmen and flags.<br/><br/>Gameplay video:<br/>http://bit.ly/sd-sn-v<br/><br/>Snow Fight provides a fun control system, combining drawing and taping.  Players direct their commandos by drawing the path they would like them to take, then throwing snowballs at all-comers as they follow the path.<br/><br/>There are a variety of medals available, which are up for grabs for each level.  The better the outcome of each level, the better the medal, ranging from simply capturing the flag, to perfect completion without get being hit.<br/><br/>Each soldier has limited health, so if they are hit enough times they will be out of the game.  They can also only carry limited snowballs, so a player&amp;#39;s strategy of when to reload is critical.  There are also bonuses to look out for, including; replenish health, instant reload, and increase snowballs.<br/><br/>Players will find themselves crossing rivers, crouching behind trees, skirting around houses and avoiding ambushes, all in an attempt to win the...<br/><br/>... Snow Fight!!!<br/><br/>Game Features:<br/>• Addictive and cool gameplay<br/>• Universal app for iPhone and iPad<br/>• Splendid pixel graphics<br/>• 40+ levels.<br/>• Game Centre integration for achievements and most perfect levels<br/>• Multitasking support<br/>• Game state saved<br/><br/>REVIEWS:<br/>&amp;quot;a really fresh-feeling real-time strategy game... you’ll find Snow Fight hard to put down.  4.5/5 &amp;quot; toucharcade.com<br/><br/>&amp;quot;I’ve been playing Snow Fight all day, and must admit that it has done quite a bit to brighten my day.&amp;quot; techcrunch.com<br/><br/>&amp;quot;go grabbit now!&amp;quot; iPhonelife.com<br/><br/>&amp;quot;Snow Fight is good... 4/5&amp;quot; iphoneappreviews.com<br/><br/>NOTES:<br/><br/>If you have re-installed Snow Fight and have already purchased all levels, then do the following to restore:<br/><br/>1) Tap &amp;quot;Unlock all Levels&amp;quot;<br/>2) You will see the message &amp;quot;Confirm You In App Purchase.  Do you want to buy one Unlock All Levels for XXX&amp;quot;<br/>3) Dont worry, if you&amp;#39;ve already purchased it, you wont be charged twice.<br/>4) Tap &amp;quot;Buy&amp;quot;,  then enter your password.<br/>5) You will get the message &amp;quot;You&amp;#39;ve already purchased this. Tap OK to download it again for free&amp;quot;", "metacritic": null, "released": "2011-12-07", "tba": false, "updated": "2019-10-22T14:30:17", "background_image": "https://media.rawg.io/media/screenshots/801/801f88e5ee64257079694b6822ea7d85.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sauce Digital"], "genres": ["Action", "Strategy"], "publishers": ["Sauce Digital"], "esrb_rating": "Everyone 10+"}