{"id": 91080, "slug": "retech", "name": "ReTech", "name_original": "ReTech", "description": "ReTech\r\n\n<p>This is ReTech, a game I have been developing on my own over a year now. It is an open-world survival game, in a low poly art style. At the moment, you can explore the map, collect resource and craft new items, and much more.</p>\n\n<p>You obviously have to survive somehow. You can find vital resources in various locations around the map, or you can hunt your own food.</p>\n\n<p>But nothing is easy when having to survive on your onw! To get to the stuff you want, you have to defeat enemies defending important locations. You can do this with your weapon of choice, ranging from machetes to sniper rifles.</p>\n\n<p>If you found a good spot and have the basic resources needed to survive, you can also start building your own base. Chop down wood and stone to create your shelter!</p>\n\n<p>This version of the game contains all the base features that a survival game need. At the moment you can:</p>\n<ul>\n<li>Explore a cool large map</li>\n<li>Gather resources in the environment (rocks, tree stumps and fallen trees are harvestable)</li>\n<li>Fight enemies in town locations to get to the loot you want</li>\n<li>Scavenge for food and water to keep yourself alive</li>\n<li>Craft tools, components, building parts and much more to suit your needs</li>\n<li>Build a base, to have some shelter at night</li>\n</ul>\n<p>In future releases, I will add stuff like farming and automation, electricity production and exciting machines, so stay put!</p>\n<p>I really want to create a game that everybody likes, so if you have a suggestion, just write a short review on the feedback page.</p>\n<p>You can also check out my YouTube channel, where I post funny videos of the game every now and then</p>\n<p>Cheers,</p>\n<p>Federico, developer of ReTech</p>\r\nTutorial\r\n<p>Don't know how to play? Don't worry, here's a little explanation of how to get started.</p>\n<p>More info on http://www.retechgame.com/wiki.php.</p>\r\nControls\r\n<br/>\n<br/>Loot\r\n<p>Loot spawns at various locations around the map. Once collected, it will respawn in 15 minutes. Usually the same type of loot is found in a specific location, for example, rifler will spawn in military hangars, whereas food will spawn in civilian houses.</p>\r\nResources\r\nTo gather wood, find one of these and chop them down with your tool of choice:Fallen tree:Or tree stump:To get stone and metal ores find these rocks:\r\n\n<p>The rest of the stuff in game isn't harvestable at the moment. However, you can remove blocks you placed with the same method  you use to gather resources.</p>\r\nCrafting\r\n<p>To craft something, you first need a crafting workbench, like the \"carpenter bench\". Then, you simply drag the items needed in the crafting inventory and select the item you want to craft. Click \"Craft\" and your item will begin crafting. Every craftable item has to be crafted at a specific workbench. Most workbenches can be crafted in the \"tool station\" workbench.</p>\n<p>Here's a list of all the recipes:</p>\n\n\n<p>I recommend you to look at it on http://www.retechgame.com/wiki.php, since it's wider and better to see there.</p>\r\nBuilding\r\n<p>Building parts can be acquired by finding them as loot or by crafting them out of wood parts. To build, simply equip the structure. A preview will appear, indicating where it will go. If it is green, it can be placed. Press <strong>Left Mouse Button</strong> to rotate a structure.</p>\n<p>Structures or any other blocks can be removed using a tool like \"stick and stone\" or a pick.</p>", "metacritic": null, "released": "2017-11-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9ed/9ed217fd6808eae2bf175a739a09ab13.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["fedj99"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}