{"id": 910980, "slug": "abyss-itch-toclafane", "name": "Abyss (itch) (Toclafane)", "name_original": "Abyss (itch) (Toclafane)", "description": "<p>Hi Folks, </p>\n<p>i'm getting into learning game development again but this time in GODOT. this old project of mine was an old piece of work i played around with</p>\n<p>and i have sadly lost the project files since. I have recovered the code for it along with the assets but as of yet i am yet to rebuild it in unity to develop it further.</p>\r\nWHAT IS ABYSS\r\n<p>Abyss is a very simple fps i build following tutorials online for unity while editing the code in my own way to make it work for what i wanted.</p>\r\nFeatures\r\n<ul><li>endless play area</li><li>relentless enemy's who hunt and multiply very fast</li><li>Insta-death</li><li>basic high-score feature</li><li>footstep sounds!</li><li>blood rain</li></ul>\n<p>it has a menu &amp; very basic high-score feature and should continue until you are taken out by the enemy. the terrain is generated in-front of and behind the player so in theory unless i broke something developing this you should just be able to run and run and run forever.</p>\n<p>i did not get around to adding sound into the game before i lost the project apart from menu music.</p>\n<p>i seriously suggest listening to something epic like the doom soundtrack while playing.</p>\n<p>if people think this is a cool idea i will possibly reload up unity and try to rebuild it either from scratch or from the recovered code &amp; assets i was able to rip from the game files.</p>\r\nDisclaimer\r\n<p>this is by no means a completed work and i'm not sure it ever will be but i had fun making it &amp; wanted to share my first steps into game development.</p>\n<p>plenty of unity assets were used making it too because i had no idea where to start with code but i do remember changing quite a bit of it to work for the idea i had and i was very pleased with what i had been able to do with little to no training.</p>\n<p>enjoy and let me know what you think :)</p>\r\nToclafane", "metacritic": null, "released": "2023-01-13", "tba": false, "updated": "2023-01-16T14:34:08", "background_image": "https://media.rawg.io/media/screenshots/af3/af3b09e2212b67b0c042983c2e84511a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Toclafane"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}