{"id": 911082, "slug": "shauns-turn-based-battle-system", "name": "Shaun's Turn Based Battle System", "name_original": "Shaun's Turn Based Battle System", "description": "<p>Patreon access.</p>\n<p>A JRPG style, turn based battle system built in GameMaker, inspired by the style of Final Fantasy games.  This project contains the GameMaker source code &amp; end result of an upcoming free YouTube tutorial series. Purchases and support via Patreon go towards enhancing this project and also funding the creation of more tutorials and resources for everyone!</p>\n<p>Use this as a template or foundation for your own game's battle system, use it as a handy reference when following the upcoming tutorial series, or simply learn from the techniques used in the sourcecode.</p>\n<p><strong>This is currently the finished first draft of a project that is functionally complete, but is still being refined and refactored over time. You can expect further updates especially after the release of the video tutorial series.</strong><br/></p>\n<p>Q: Can I use this with your ARPG project?</p>\n<p>A: Yes! While it won't be quite as simple as smashing both projects together, it shouldn't be far off either. There's nothing I'm aware of that would make the two projects incompatible. This is a battle system that is designed to be as agnostic as possible when it comes to the rest of your game.</p>\n<p>All included code and game assets* are free to use by anyone for commercial purposes, but the project should not be redistributed \"as is\".</p>\n<p><em>*also contains fonts by Daniel Linssen, all other assets were created by me.</em></p>", "metacritic": null, "released": "2023-01-13", "tba": false, "updated": "2023-01-16T15:22:52", "background_image": "https://media.rawg.io/media/screenshots/5d0/5d0821acb3732da43fbcc2e02fbaa222.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ShaunJS"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}