{"id": 91113, "slug": "castle-defense-itch", "name": "Castle Defense (itch)", "name_original": "Castle Defense (itch)", "description": "<p><em><strong>This game is created for #LOWREZJAM 2016 challenge.</strong></em></p>\n<p>You need to defend the castle besieged by bad guys (easily identified by their dark armours). Hold out for 9 turns until reinforcements arrive.</p>\n<p>The game is card-based and it reproduces some of the Hearthstone's mechanics. Each turn you get a random card which represent a useful action. During your turn you can perform maximum 2 actions. Here is the list of all possible actions:</p>\n<ul><li>You can send a <strong>Defender</strong> to defend the castle. Defenders can't attack, but they don't let enemies attack the castle until they get killed.</li><li>You can send an <strong>Attacker</strong> to attack enemy units.</li><li>You can order your <strong>Archers</strong> to shoot. Your archers are not particularly good, so they will inflict only moderate damage to one random enemy unit.</li><li>You can order to use a <strong>Ballista</strong>. The ballista will destroy any enemy unit you want with just one shot.</li><li>You can use <strong>Magic</strong> to attack all the enemies at the same time. Very effective against a large army.</li><li>You can try to play for time and <strong>Repair</strong> your castle.</li><li>You can take <strong>Counsel</strong> with your officers. This will give you 3 additional cards.</li><li>You can send a <strong>Call</strong> for help. It will take you one turn closer to the victory.</li></ul>\n<p><em>Made with Haxe + OpenFL.</em></p>", "metacritic": null, "released": "2016-04-15", "tba": false, "updated": "2019-08-28T23:26:10", "background_image": "https://media.rawg.io/media/screenshots/6d0/6d0402105f2e8b474ff69ae0c66f2598.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["watabou"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}