{"id": 911266, "slug": "treasure-runner-itch", "name": "Treasure Runner (itch)", "name_original": "Treasure Runner (itch)", "description": "<p>Small console project made for an in-house Game Jam at NBCC Game Development.\r\n </p>\n<p>This Game Jam was organized by the NBCC - Game Development  students to practice after the first Fall term. The only experience  they had at this moment was to create games with console output.\r\n </p>\n<p>The GJ's restrictions were to build a console game with the theme <strong>Treasure Hunt</strong>.\r\n </p>\n<p>Treasure Runner is an Auto-run platformer where all levels  are located within a map. The objective is for the player to find the  trasure hidden within the island.\r\n </p>\n<p>Each time the player travels to a new node, they must run  certain distance. As the player goes north, the distances become larger,  with more enemies and faster. The player has only five lives and  falling into a pit is game over.\r\n </p>\n<p>In retrospective, the game can have many gameplay  adjustments to make the game easier to beat. Like reseting lives each  level, or gaining lives as the player reaches certain distances.\r\n </p>\n<p>The key is giving priority to the pits and watch out when they are at the larges size because the timing must be almost perfect.\r\n </p>\n<p>This was a project that helped me understanding how to stream a random level and implementing graphs in a game.\r\n </p>\n<p>The code can have many design improvements like modulating the pages and having a page manager.\r\n</p>", "metacritic": null, "released": "2023-01-13", "tba": false, "updated": "2023-01-16T16:45:22", "background_image": "https://media.rawg.io/media/screenshots/c1a/c1abec8db410aba332e427391ce7f2a0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dario Urdapilleta"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}