{"id": 911287, "slug": "3d-shooter-project", "name": "3D shooter project", "name_original": "3D shooter project", "description": "<p><strong>To play this game, you have to download the zip file, (unpack it,) and find the  '3d shooter test' exe.</strong></p>\n<p><strong>--- introduction ---</strong></p>\n<p>this is my second school project made in unity. We were tasked to make a 3d shooter game with patrolling enemies, multiple weapons that have unique stats. It also needed to have multiple pickups. This project is by far the most visually lacking of all my work, something Ive since learned from.</p>\n<p><strong>--- instructions ---</strong></p>\n<p>The start menu explains itself quite well, the buttons are clickable using your cursor. Once loaded into the game you will spawn outside a building. you can walk around using WASD, swap your weapons using 1, 2 and 3. Look around using the mouse and shoot using the left mouse button. There is a multitude of enemies surrounding a building. and 2 enemies patrolling on the inside also. These enemies can be shot down using your various weapons.</p>\n<p>Weapon 1 - pistol, Has a medium range, average damage and needs to be fired using individual mouse pressed.</p>\n<p>Weapon 2 - laser. Has a short range, does very low damage incredibly rapidly, which ends up dealing good damage over time. This weapon allows you to hold down the mouse button.</p>\n<p>Weapon 3 - sniper. Very high range, does incredibly high damage. Only contains one bullet.</p>\n<p>Reloading/ammo - when pressing R, you reload your weapon. When out of ammo, you can pick up sion orbs to refill the ammo reserves of the weapon you are currently holding. You can view your ammo in the bottom left of the screen.</p>\n<p>Health - You have limited HP, you can see your hp in the top left corner of the screen. You can refill your health with green orbs.  Once your healthbar is empty, you will die. after which you can chose to go back to the menu, or retry the level.</p>\n<p>Enemies wield a weapon and also have a certain amount of health. They patrol using waypoints, and will follow and chase the player when they are able to see them, once in range they will start firing at the player. They are able to lose track of the player when you are at too large a distance or hiding from enemies. Defeat all enemies to win.</p>\n<p>You can pause the game using the escape key.</p>\n<p>Ammo can be refilled by picking up cyan orbs.</p>\n<p>Health can be refilled by picking up green orbs.</p>\n<p>You have a minimap on the top right corner of your screen, which will give you a top down overview of the map.</p>\n<p><strong>--- art/improvements ---</strong></p>\n<p>There is no art in the game outside of regular 3d shapes and objects. Capsules are human characters, buildings are boxes and so are your weapons.</p>\n<p>If I would ever revisit this project, the first thing I would do is overhaul everything visually. I would add weapon and player models, as well as models for the buildings. I would also add visual effects to the guns firing, and a visual effect of enemies being damaged. With this I would also rework the map and enemy placement to be more challenging and interesting.</p>\n<p>I am currently aware of one bug that causes enemies to not properly respect a weapons firerate when leaving and reentering their shooting range, this doesn't often occur naturally but can still be noticeable and bothersome.</p><p>--- code ---</p><p>Github repository. Note this is a 2 man project so not all code is my own. <br/></p><p>A word document is included in the repository due to Itch.io character limit. I have described some enemy behavior in there</p>", "metacritic": null, "released": "2023-01-12", "tba": false, "updated": "2023-01-16T16:57:20", "background_image": "https://media.rawg.io/media/screenshots/98d/98d0d9c6f0b75cdd422293c2627394c5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Grc0"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}