{"id": 911241, "slug": "aequitas-the-offset", "name": "Aequitas: The Offset", "name_original": "Aequitas: The Offset", "description": "<p><strong>Genres</strong>: Superhero Fiction, Action, Mystery, Romance</p>\n<p><strong>Rating</strong>: 16+ for depictions of violence, drug use, mature themes, and language.</p>\n\n<p>Aequitas. A household name (...or at least it had been six years ago). It would’ve been impossible for the team not to have gained any attention. After all heroes, in general, attracted a lot of attention- teen heroes- let alone a group of them was always going to attract the interest of the world.</p>\n<p>Stopping crimes, fighting villains, protecting civilians- heroics added a sense of completion that other things in life couldn’t.</p>\n<p>Of course, all good things in life have to come to an end including the group that once protected the bustling city of Metanoia. However, despite the name losing its renown, a part of you still can’t help but feel the slightest bit of pride whenever the name of the ragtag group of young heroes is uttered. You suppose that is to be expected on some level. After all, you used to lead it.</p>\n<p>• Play as a former(?) vigilante that is suddenly thrown back into the world of heroics. Once the (superpowerless) leader of an unstoppable group of heroes, you are now job-hopping in order to stay afloat.</p>\n<p>• Train a new group of (unskilled) new young (far too young) heroes (not at all against your will)!</p>\n<p>• Customize your MC’s current personality (their past personality is a different story…) and appearance!</p>\n<p>• Reunite with your former teammates and look back on what exactly led to your team disbanding (and try not to repeat your past mistakes).</p>\n<p>• Form bonds with new friends and rebuild bonds with old ones.</p>\n<p>• Reminiscence on your past and remind yourself what led you down the path of heroics in the first place.</p>\n<p>• Romance your former (friends) teammates</p>\n<p>• Defeat the villains and save the world (again). Obviously.</p>\n\n<p><strong><em>The (Original) Team [ROs]</em></strong></p>\n<p><strong>Alexandria “Alex” Andeno </strong>[She/Her]</p>\n<p>Alias: Elysian</p>\n<p>The former co-leader of Aequitas, Alexandria Andeno is a force to be reckoned with. With her tactical mind as well as her unbeatable strength and stamina, Alex acts as the perfect warrior as well as the perfect protector to both civilians and her fellow heroes. </p>\n<p>With her diplomatic and compassionate disposition, she easily fell into the role of the team “big sister” and it was a title she wore with pride. She is someone that had always given great advice so it is unsurprising that she went on to become a therapist. However, there seems to be shadows of discontentedness hiding in different aspects of both her personal life and career.</p>\n<p><strong>Napoleon Jasper “Jasp” Walker </strong>[He/Him]</p>\n<p>Alias: Momentum</p>\n<p>Your (former?) best friend. Loudmouthed and snarky, Jasper’s mouth runs almost as fast as him (a remarkable feat truly). Due to his (self-given) role as the goofball (moron) and prankster of the team, Jasper was not only a thorn in your side but also everybody else's. </p>\n<p>Despite his rashness, Jasper is incredibly skilled and intelligent- a fact that is made abundantly clear from the awards hanging on his childhood bedroom wall as well as his job as a scientist at one of the most technologically advanced labs in the world. However, despite his flaws, you can always count on him to have your back (or at least that’s how it used to be).</p>\n<p><strong>Zhiuxzoe “Zoe” Smith </strong>[She/Her]</p>\n<p>Alias: Onism</p>\n<p>An alien from another planet, Zoe is truly an interesting being to be around. Despite her overly naive attitude, her bubbly and kind disposition makes it truly difficult to be mad at her. </p>\n<p>The most (openly) upset about the team disbanding, she is the only one who has gone out of their way to keep in contact with all of the former members. Her overly inquisitive and curious nature led her to journalism which she does an exceptional job in despite it putting her in a position where her out-of-this-world nature being revealed is at risk.</p>\n<p><strong>Rowan Parker</strong> [He/Him]</p>\n<p>Alias: Kalon</p>\n<p>Rowan Parker is the human embodiment of a forest fire- intense, pretty from a distance, and will 100% burn you if you get too close. </p>\n<p>The former “bad boy” of Aequitas and currently a mechanic, his hot-headed demeanor is what led to him being the first to leave the team and was the main factor in his (initially one-sided) rivalry with you. Rowan is the only other (former) member of Aequitas that still fights crime, of course nowadays he’s leaning more towards “anti-hero” than hero…</p>\n\n<p><strong>Vesper ??? </strong>[They/Them]</p>\n<p>Alias: Lacuna</p>\n<p>The kid that (forced) got you back in the game. An individual made up of all-knowing smiles and snarky remarks, Vesper is an enigma that nobody can truly solve. They usually put up a hyperactive and occasionally “ditzy” attitude…although sometimes if you look close enough you can see something else lurking in the depths of their eyes.</p>\n<p><strong>Leonardo “Leon” Cabello [He/Him]</strong></p>\n<p>Alias: Curio</p>\n<p>Compassionate yet uncertain, Leon is quite clearly the newest to the heroics business (of course that might be because of the ancient artifact forcing him into it…). With managing both schoolwork and heroics as well as being the only one on the team with any common sense, Leon has his work cut out for him.</p>\n<p><strong>Juniper “Juni” Kent [She/Her]</strong></p>\n<p>Alias: Apricity</p>\n<p>Loud, hyperactive, and a bit obnoxious, Juniper Kent is about everything you would expect a teenage superhero to be. You’re more likely to find her playing on her phone than patrolling the city but behind her, somewhat childish and excitable personality lies a truly kind and selfless individual that wants to help others.</p>\n<p><strong>Lenora “Nora” Croce [She/Her]</strong></p>\n<p>Alias: Moira</p>\n<p>Painfully timid and incredibly kind, Nora is one of the most selfless people you will ever meet which is saying a lot considering she is in a group of other heroes. She would give you the clothes on her back and more if she needed to. Just make sure not to get on her bad side…</p>\n<p><strong>Sebastian Barrere [He/Him]</strong></p>\n<p>Alias: Calamity</p>\n<p>The human version of the anti-christ, Sebastian Barrere is bratty, uptight, and just a little bit petty. Wanting nothing more than to prove himself both to the world and his mother, Sebastian focuses all his time on getting stronger. However, there might be something kinder lurking beneath the surface of his prickly attitude.</p>", "metacritic": null, "released": "2023-01-13", "tba": false, "updated": "2023-01-16T16:34:39", "background_image": "https://media.rawg.io/media/screenshots/36f/36ff89fa6b63a3792d2623b4af43c962.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Enigma1247"], "genres": ["Action"], "publishers": [], "esrb_rating": null}