{"id": 91120, "slug": "midboss-itch", "name": "MidBoss (itch)", "name_original": "MidBoss (itch)", "description": "<p>\n</p>\n<p>\n<strong>MidBoss: The possession based graphical roguelike.</strong><br/>\n<em>A turn-based procedurally generated death labyrinth.</em>\n</p>\r\nVisit the official site for more information\r\n\r\nAbout\r\n<p>\r\n\t\r\n\tMidBoss is a video game about possessing your defeated enemies in order to become stronger. You play the weakest of the dungeon denizens, an imp with no ability other than possessing other creatures. Your goal is to defeat and possess increasingly stronger creatures, unlocking their abilities for yourself and becoming stronger as you go along, and eventually defeat and become the dungeon's ultimate endboss.\r\n</p>\n<p>\n</p>\n<p>\r\n\tBuy MidBoss now and you will get a \r\n\tSteam key as well.\r\n</p>\r\nSubscribe\r\n<p>\r\n\tThe easiest way to keep up-to-date on changes is to \r\n\tsubscribe to our newsletter.\r\n</p>\r\n\r\nFeatures\r\n\r\n<ul>\n<li>Possess your enemy and gain their strengths and skills</li>\n<li>An absolute mess of abilities. We've got your passives, your actives, and your innates! There are over 60 unique abilities to discover and learn.</li><li>Choose between Hardcore mode (only 1 life), 1UP mode (5 lives), and <br/>Narrative mode (infinite lives and buffs to explore the game)</li>\n<li>Lots of equipment to find, seven types of weapons, shields, armor, boots, and accessories in 6 different rarity flavors!</li>\n<li>Randomized potions every game. Who knows what's in these mystery bottles! (optional)</li>\n<li>Dynamic music system that ups the musical excitement when enemies are about.</li>\n<li>Quick Play mode for shorter, more condensed play sessions.</li>\n<li>Custom Game mode that allows you to play the game the way you want to.</li>\n<li>Share your crushing defeats with your friends through the use of death cards, images which contain embedded data which lets players load the card in their game, inspect your run's stats, and replay it using the same seed and settings.</li><li>Spend death cards to start your next run with items you had when you died.</li>\n<li>Beat the game and get a special card which unlocks a new game+ mode. Start over with your items, abilities, or both!</li>\n<li>Cratefish as a currency!</li>\n<li>Traps as well as unidentified and cursed items.</li>\n<li>Trade with and sell unwanted items to a mysterious merchant.</li>\n<li>Single-file save and resume, you don't even have to click any buttons for your game to save, it's all taken care of.</li>\n<li>Like tooltips? We've got tooltips for <em>everything!</em> All the information you need at your fingertips.</li>\n<li>Lots of crates, chests, and other containers to pillage. Find the royal chest that spawns on every floor for extra sweet loot!</li>\n<li>Playable with either mouse and/or keyboard. Pick whatever control scheme you like!</li>\n<li>Line of sight and fog of war systems, and none of that cone of sight stuff. We assume you can look over your shoulder.</li>\n<li>Full options menu including key rebinding, resolution options, and more! (FoV slider coming soon)</li>\n<li>Miss the good old days? Got some nostalgia for those eye-bleeding CGA cyans and magentas? Miss the old Gameboy days, or were you more of a C64 fan? We've got you covered with 12 unlockable retro mode filters!</li>\n</ul>\n<p>\n</p>", "metacritic": null, "released": "2015-02-20", "tba": false, "updated": "2019-08-28T23:26:10", "background_image": "https://media.rawg.io/media/screenshots/3e4/3e45d28589d0dc98c561ea01a595483e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 384, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Eniko"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}