{"id": 911318, "slug": "life-is-fleeting-new-harvest", "name": "Life is Fleeting: New Harvest", "name_original": "Life is Fleeting: New Harvest", "description": "<p>This is my entry for Ludum Dare 53</p><p>The theme was Harvest and it seemed like a perfect excuse to remake my Ludum Dare 51 entry. The game is less polished and focused but far more ambitious. I tried a bunch of things I've never done before in games development which means things are a bit buggier though more feature complete.</p><p>There are bugs, there are issues and the gameplay loop could be better but I was trying a lot of new things to me and between game breaking bugs and figuring stuff out I just didn't have the time to fix them.</p><p>Regardless, thank you for trying it out!</p><p><strong>Here's how to play:</strong><br/></p><p>Controls:</p><p>•WASD/Arrow keys/Control pad to move</p><p>•Space/Left Click/A Button on controller to interact or use </p><p>•Escape to pause •Left click to interact with menus<br/></p><p><strong>Goal:</strong> Give your favourite NPC 3 gifts to win at life. Both require a present matching the colour of shirt they are wearing</p><p><strong>Gameplay</strong><strong>:</strong> Grab your tools off the floor and get to farming. Use the hoe on farmland tiles to till the soil and the watering can on tilled soil to water it. Plant seeds on tilled soil and water planted crops to make them grow. It takes 3 days for crops in watered soil to finish growing and be harvestable. Be careful as some farmland tiles are fickle and will not allow you to farm them!</p><p>Take harvested crops to the big box next to your farmhouse and interact with it to sell them. Take your money to the shop to the right and buy more seeds to farm with. If you have enough, you may buy gifts that can be given to NPCs with a heart next to them.</p><p>You have 24 hours each day to farm, shop and do your tasks and each day lasts 30 seconds.</p><p>----------------------------------------------------------------------------</p><p><strong>New things I worked on:</strong>\n</p>\n<p>• A settings menu with key rebinding that can  be reset to default, a volume slider and the ability to choose which tile targeting system you wish to use\r\n</p>\n<p>•Pausing with a built in settings menu\r\n</p>\n<p>•A hotbar with its own selection cursor and the use of an array to track inventory\r\n</p>\n<p>•A shop\r\n</p>\n<p>•Tracking everything in regards to progress, time and date, and farming states between scenes\r\n</p>\n<p>•Using a new app to create audio with\r\n</p><p><strong>Issues:</strong></p><p>•Some farm tiles cannot be farmed on</p><p>•There are graphical bugs between scenes</p><p>•Some error and tip messages will cause the boxes for them to persist indefinitely</p><p>•The volume slider does not work well if at all<br/></p><p><strong>Features that had to be cut:</strong></p><p>•The ability to just hold down a button to be able to keep using a tool or plant as you moved about. A bug that couldn't be fixed on time meant it had to be cut</p><p>•A tool shop where the player would purchase and potentially upgrade tools</p><p>•An actual menu for the shop</p><p>•NPC dialogue and menus</p><p>•NPC animations</p><p>•NPCs being able to wander about<br/></p>", "metacritic": null, "released": "2023-01-09", "tba": false, "updated": "2023-01-16T17:08:47", "background_image": "https://media.rawg.io/media/screenshots/088/088e2088fbdabfc757a2a9b87693222d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Sarah"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}