{"id": 911397, "slug": "2022-john-deere-9rx", "name": "2022 John Deere 9RX", "name_original": "2022 John Deere 9RX", "description": "<p>The 2022 John Deere 9RX is a progression of the best-selling 9RX. Featuring a more powerful John Deere engine that is now rated at 640 horsepower this tractor can go anywhere. Whether it's tillage, application, seeding, planting, or carting, the 9RX provides the power and performance needed to get the job done. </p>\n<p>Now that the ol PR statement is out of the way I thought I'd tell you a little more about this project. Since the beginning of 2022 I've been working on this beast, it started with a custom set of narrow tracks for the base game 9rx, which then morphed into 40-inch tracks, and then 40-inch at wide spacing, and so and so forth. Later I decided to pull the giant 3d model into blender and start looking at it, and long story short I rebuilt the entire model from scratch, without a trace of the base-game model remaining. The 3d model is considerably more fire in blender but due to the existence of the potato Pc, I decided to lower the poly count and make it more usable on less high-end PCs. this way anybody can enjoy the mod without torpedoing the game's performance. </p>\n<p>The tractor now sort of sits in a late beta limbo, but I thought I'd toss it out to the world to see what yall thought. My testing team has been working around the clock this December to squash the bugs with me and together I think we got most of them. It's also been run through about 100 hours of rigorous in-game work (specifically, lots of seeding and planting near peak loads for the tractor) to make sure that It doesn't have any conflicts with any implements or combos. I begrudgingly got it to work with SIID's Big John Saddle Tanks so that you can extend your Lf capacity when planting. and I may build in compatibility with his Demco tanks as well, not sure yet. </p>\n<p>Although Deere is an American brand, this tractor is really meant for the rolling hills of Saskatchewan rather than some flat plains in Deer Creek, (like the screenshots may suggest). As I see a lot of these things IRL and they are capable of some truly monstrous things, which I have tried to recreate in this mod. So put her through her paces and enjoy. <br/></p>\n\n<p>For more cool screenshots and project updates check out my FB Page. Thanks </p>\n<p>https://www.facebook.com/profile.php?id=100089054239341<br/></p>\n\n<p>P.S. I will be making some updates in the future and I may be releasing the full-fledged 4k version at a later date, but It would take a lot of interest because that is gonna take an age to do.</p>\n\n<p>Changelog.</p>\n<p>Release v0.81 beta release for yall to try</p>\n<p>update v0.87 fixed all broken textures fixed design configs issue so now all configs are available. sorry for the confusion enjoy.</p>\n\n\n<p>P.P.S. + credits even though I remodeled as much as I could with my limited skill set, there are still a few remaining graphical assets from various places. The CB radio is off siid's 9rt, and so is the Rockbox. meanwhile, there are also still a few remaining assets from the giants rx. I'm working on making a new Rockbox and radio but for the time being, it is what it is.</p>", "metacritic": null, "released": "2022-12-29", "tba": false, "updated": "2023-01-16T17:41:25", "background_image": "https://media.rawg.io/media/screenshots/1ac/1ac5040e4814ea34c7c6b3d080f6090a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Technical Farms Modding"], "genres": [], "publishers": [], "esrb_rating": null}