{"id": 911334, "slug": "you-versus-the-world", "name": "You Versus The World", "name_original": "You Versus The World", "description": "<p><strong>Make sure to use full screen for the best playing experience!</strong></p><p><strong>Bug: The card “Ray of Light” wrongly <em>removes</em> one sunlight point instead of adds one. </strong>(Thanks to @cagibi for finding the issue).</p>\n<p>You play against the world in a chess-like, card-management harvesting game.</p>\n<p>The goal is simple: Have the more harvest points than the World does at the end of 6 rounds. If you've bested The World after 6 matches, you win.\r\n</p>\n<p>There are three Attributes for each plant: Temperature, Sun Light, and Water Rating. Each plant has a preferred range in each Attribute. There are three Attribute qualities: Positive (Diamond Symbol), Neutral (Dash Symbol), Negative (X Symbol).\r\n</p>\n<p>You can only Harvest plants that have Diamonds in all three Attributes. The World can only Harvest plants that have X’s in every Attribute. Hover over plants on the board to see their current Attributes. Press SPACE to toggle the quick status icons on each plant to see their current Attribute status.\r\n</p>\n<p>Use cards from your hand to nurture the plants on the board, manipulating the plant’s Attributes. Each card moves one of the Attribute up or down the scale. To use a card from your hand, hover over it then click. The card will Activate and, for most cards, you will need to resolve the Action by hovering then clicking over a board Tile or row/column.\r\n</p>\n<p>Each card use costs one of your three Action points, shown in the bottom right corner. After you run out of Action points, your turn is over and it’s The World’s turn. You can end your turn early by clicking the circle arrow in the bottom right.\r\n</p>\n<p>Each new turn, you draw 3 cards. However, max hand size is six.\r\n</p>\n<p>--------------------------</p>\n<p>Made in 48 hours by bricabrac for the Ludum Dare 52 game jam (themed \"harvest\").</p>", "metacritic": null, "released": "2023-01-08", "tba": false, "updated": "2023-01-16T17:14:16", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Echo GameWorks"], "genres": [], "publishers": [], "esrb_rating": null}