{"id": 911454, "slug": "elemental-raiders", "name": "Elemental Raiders", "name_original": "Elemental Raiders", "description": "Assemble your team of Elemental Heroes, create a deck of strategic skills, and unleash powerful abilities to defeat your opponents! Elemental Raiders is a fast-paced hero battler that combines features from collectible card games and multiplayer RPGs. <br/><br/><strong>HEROES</strong><br/>Unlock legendary Heroes from 3 powerful elements: Water, Fire, and Nature. Craft the perfect team with special traits and visuals, plus over 15 unique skills for each Hero. Create endless combinations to outwit your opponents and become the master of Runaria.<br/><br/><br/><br/><strong>SKILLS</strong><br/>Skills are at the heart of the game, with different attributes that will define the outcome of the fight. Collect more than 135 skills with unique stats, attributes, and rarities, ranging from Uncommon to Legendary. Level up your skills and gain an edge over your opponents!<br/><br/><br/><br/><strong>PvP ARENA BATTLES</strong><br/>Step into the Arena and compete against other players in an exciting PvP battle! Compete and fight your way up the ranks, earning trophies and reaping rewards like Chests and Rune Stones - join the Arena and battle for victory!<br/><br/><br/><br/><strong>PvE RAIDS</strong><br/>Test your strength and join thrilling PvE Raids! Rise to the challenge and complete the different stages to defeat the Evil Gods! Each week brings new and more difficult raids. Reach farther stages and get greater rewards like powerful Chests and amazing Skins.<br/><br/>", "metacritic": null, "released": "2023-01-16", "tba": false, "updated": "2023-03-30T02:55:46", "background_image": "https://media.rawg.io/media/screenshots/41f/41f0a536dd53b655dd6aa9b4bd70d3d0.jpg", "website": "https://www.elementalraiders.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 100, "ratings_count": 1, "suggestions_count": 276, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["G4AL Entertainment"], "genres": ["RPG", "Strategy"], "publishers": ["G4AL Entertainment"], "esrb_rating": null}