{"id": 911431, "slug": "horror-haze", "name": "Horror haze", "name_original": "Horror haze", "description": "You woke up on earth in a strange and completely unfriendly world called purgatory, full of mysteries and dangers. How did you get here? Was it an accident or someone's malicious intent that caused you to be here?<br/><br/><br/><br/>You urgently need to get out of here, every minute spent here brings you closer to certain death. The portal leading to freedom is closed, the four caretakers who maintain it in working condition have been kidnapped by demons.<br/><br/>Destroy all devourers. At first glance, they are immortal, but in fact they have a weak point. Their hearts are hidden in secret places. Find the eaters heart and burn them in the fire.<br/><br/>Be careful, besides the devourers, other monsters also live in purgatory. Find the Frostbite magic, with its help you will turn your enemies into ice.<br/><br/>The invisibility magic will help you sneak past hostile creatures unnoticed.<br/><br/>Having studied the ability - transmutation, you can turn into a mouse and make your way through minks and small gaps without any problems.<br/><br/>The ability to \"true vision\" will help you see hidden things that were previously invisible<br/><br/>Find and use keys, collect artifacts, solve puzzles and pick ingenious locks.<br/><br/>Don't let the demons take over your soul, free the custodians and open the portal to freedom!<br/><br/><br/><br/>Can you survive?<br/><br/>Attention! The game contains frightening scenes, moderate unrealistic violence, as well as heartbeat and bloodstains on the screen when the main character loses health.", "metacritic": null, "released": "2023-01-17", "tba": false, "updated": "2023-01-20T03:06:30", "background_image": "https://media.rawg.io/media/screenshots/65d/65de03761f4b89d17bbfc5d55f6fcfeb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 524, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Escape Horror Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Escape Horror Games"], "esrb_rating": null}