{"id": 91145, "slug": "plain", "name": "Plain", "name_original": "Plain", "description": "<p><strong>Story:</strong><br/></p>\n<p>Riley is a completely unremarkable woman, if you were to ask her.<br/>A plane ride towards a job that could change her destiny ends in disaster<br/>when there's a critical engine failure during flight. It would be the end<br/>for Riley too, were it not for a <em>remarkable</em> woman who claims to be<br/>from the year 2165.</p>\n<p>Yup, it's a time travel story folks.</p>\n<p><strong>Characters</strong>:</p><p> </p><p>The protagonist. Riley was a sous chef for years, mistreated and underappreciated in the kitchen.  The very day she was going to interview for a position as head chef at a fancy restaurant, she was in a plane crash and died. Or she would have been if she wasn't brought to the future. But in this world, cooking is a dying art, and she's the only one who can revive it. She decides to attempt being a professional chef again in an attempt to prove she can make a significant contribution to society. If she can't, however, the consequences could be far more severe than just having to go back to school.</p>\n<p> </p>\n<p>A historian from the year 2165. Her job is to travel back in time and investigate events that happened in the past without disrupting the future. She's a fun-loving woman who knows what she wants, and isn't afraid to go after it. Finding Riley has made no significant contributions to society, she decides to bring her into the future to allow her a second chance after hitting it off on the plane.</p><p>The head historian and a very strict, serious woman. She doesn't appreciate Max's nonsense and if the woman wasn't so good at her job Cecilia would have fired her long ago. She respects confidence and intelligence. Her outwardly frigid demeanor might make it hard for people to get a read on her, but Cecilia isn't afraid to speak her mind and make her thoughts known.</p>\n<p><strong>Stats</strong>:</p>\n<p>Word count: 40,000 words<br/>Rating: 16 + for alcohol use and suggestive themes<br/>Price: Free!</p>\n<p><strong>Team</strong>:<br/></p>\n<p>Head writer: Averxy<br/>Second writer: Minyan <br/>Sprite artist: Minyan<br/>BG artist: Ludeshka <br/>CG artist: pinkllama <br/>GUI artist: Minyan<br/>Programmer:BáiYù<br/>Composer: warmsundae</p>", "metacritic": null, "released": "2016-10-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0bd/0bd137d1d1f61a51e73c00abb5445f06.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Fablesoft"], "genres": [], "publishers": [], "esrb_rating": null}