{"id": 911441, "slug": "for-your-tranquility", "name": "For Your Tranquility", "name_original": "For Your Tranquility", "description": "<h3>In 1988, a body of a Frogman has been found dead.</h3><h3>Presumed cause of death: Drowning</h3><br/>In 1988, a dead body was found at a riverside and sent to the morgue for autopsy.<br/>During the autopsy, a lot of irregularities were found on his body.<br/>As you collect evidence at the scene of the crime and find more information...<br/>Who is the real culprit? Why was the victim killed? What was the motive for the murder?<br/><br/><br/>Are you ready to uncover the truth?<br/><br/>“For Your Tranquility” is an investigation game where you become a Medical Examiner and uncover the truth by collecting evidence, performing autopsies, and investigating crime scenes to solve the case. <br/><br/><h3>Collect evidence from the crime scene.</h3>The smallest clue can be the key to solving the case! Even the seemingly trivial might be a key piece of evidence.<br/><br/><br/><h3>Use various pieces of equipment in the autopsy room to collect evidence.</h3>Magnifying glass, cotton swab, tweezers, scalpel to analyze the body and find out the truth.<br/><br/><br/><h3>Case Log</h3>The evidence you find will be logged to the case log. Check the log and solve the crime!<h3>Endings based on your deductions</h3>You have collected a lot of evidence and made your deduction. It is now time to check if you have solved the case. <br/>If your deductions are correct, the truth will be revealed. Otherwise, the case will go unsolved, forever.", "metacritic": null, "released": "2023-01-15", "tba": false, "updated": "2023-01-20T03:17:42", "background_image": "https://media.rawg.io/media/screenshots/4bc/4bcf9223660444da29a6aed0efb46f7a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Gamesung Games"], "genres": ["Adventure", "Indie"], "publishers": ["Gamesung Games"], "esrb_rating": null}