{"id": 911406, "slug": "fable-2-game-of-the-year-edition", "name": "Fable II - Game Of The Year Edition", "name_original": "Fable II - Game Of The Year Edition", "description": "<p>Kill or save a life, punish a thief or pull him out of a criminal life, become a glorified hero or a merciless tyrant? Fable 2 gives you uncompromising freedom of choice! Do as your conscience or intuition tells you, because this is your life. Fable 2 opens up incredible opportunities to develop your own destiny. Marrying, having children, raising offspring and becoming a happy patriarch are just a few of the options available.</p>\n<p>But what will the world be like after you? Dark times await the great empire, and only in your power to return sunlight to the realm of darkness or plunge the universe into chaos. Huge caves, frightening dungeons and ancient catacombs await you on an exciting journey, from where you can hear the howls of the dead. It will not be easy, but this is the path of a true hero. Fight hand to hand, use various weapons, use magic wisely. Fable 2 is a world of discoveries and endless possibilities.</p>\n<p>Game of the Year Edition includes:</p>\n<p>&quot;The original game</p>\n<p>&quot;Two expansions: Knothole Island and See the Future</p>\n<p>&quot; Decide for yourself. Marry, settle down, raise children, or spit on everything and be a bachelor until the end of your days? Both options are possible in Fable 2. Life is in full swing in a huge kingdom, and you are directly involved in all the most interesting events. Arrange a fight in a pub, rob His Majesty&#39;s stagecoach, save the village from the invasion of monsters - decide for yourself what to do, but remember - only you are responsible for all actions.</p>\n<p>Fairytale Kingdom. The events of Fable 2 take place 500 years after the passions that raged in the first part. The world of Albion has changed incredibly: firearms have appeared in it, marvelous cities and entire capitals have grown. Charming places with their beauty will captivate you for a long time, awakening the spirit of the explorer.</p>\n<p>&quot; Fatal consequences. Every step you take will affect the future. Stone walls will no longer rise in place of the burned camp, and a trampled wheat field can cause famine in the nearest village.</p>\n<p>&quot; A fight for life, but for death. Spears and swords, bows and crossbows, ancient destructive magic - all this will help you save your life. The unique combat system of Fable 2 allows you to instantly switch between different styles and use all available options.</p>\n<p>&quot;A dog is a man&#39;s friend. A dog will always protect and help on a hike. In addition, it is an excellent friend and even a silent companion. Cherish your pet, heal and protect, and one day he will save your life!</p>\n<p>&quot;Journey Together. In a land full of danger, the help of a friend is especially needed. With improved multiplayer, a friend can join you at any time to save or conquer the world of Albion together.</p>", "metacritic": null, "released": "2009-09-07", "tba": false, "updated": "2023-05-23T08:20:58", "background_image": "https://media.rawg.io/media/games/e38/e38ad1364212ad43fdeb2a8ea3b1f719.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 550, "game_series_count": 0, "reviews_count": 1, "platforms": ["Xbox 360"], "developers": ["Lionhead Studios"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Microsoft Game Studios"], "esrb_rating": null}