{"id": 911408, "slug": "ghostware-arena-of-the-dead", "name": "GHOSTWARE: Arena of the Dead", "name_original": "GHOSTWARE: Arena of the Dead", "description": "<p>GHOSTWARE is a retro-fps combining the lore-heavy plot and exploration of adventure games with the fast action of &#39;90s shooters. You and other ghosts have been trapped inside an Arena FPS created by a Wizard&#39;s unwillingness to overcome his nostalgia. Escape the past, shoot your way out.</p>\n<hr />\n<h1>&gt;info</h1>\n<p>GHOSTWARE is a retro-fps combining the lore-heavy plot and exploration of adventure games with the fast action of &#39;90s shooters.<br />\nIt&#39;s a unique hybrid that borrows the atmospheric gameplay and one-of-a-kind weaponry of Unreal, and blends them with metroidvania sensibilities and late 90s internet culture.</p>\n<h1>&gt;story</h1>\n<p>You are Molly, and you&#39;ve been dead for quite a while. But this is about to change.</p>\n<p>In one last attempt to bring back a forgotten videogame from his childhood, a mysterious Wizard resorts to a forbidden ritual.<br />\nYou and other ghosts are taken away from your eternal slumber, and trapped inside an Arena Shooter reconstructed from the mage&#39;s own memories.<br />\nHe aims to make the undead his own playerbase, reluctant pawns impersonating 90s shooters archetypes, bound to frag one other for as long as the Wizard commands.</p>\n<p>However, the recklessness with which the magic ritual was conducted will soon start to show its consequences, and the ever thinning boundary between the magical dimension of the Arena and the real world will soon catch the interest of others...</p>\n<h1>&gt;features</h1>\n<p><strong>CAMPAIGN</strong></p>\n<ul>\n<li><strong>Shoot your way out of the decaying reality you’ve been tossed into</strong><br />\nSwitch between an array of deadly weapons, each one better fit to a different scenario  </li>\n<li><strong>Friends or foes</strong><br />\nSurvive the arena by playing solo in frantic deathmatches, or team up with other ghosts in the classic modes of King Of The Hill and Capture The Flag!  </li>\n<li><strong>Make your choices</strong><br />\nMeet a full cast of characters throughout your journey: win the favor of others to unlock additional paths or discover new items.  </li>\n<li><strong>Explore the remnants of forgotten websites and abandoned maps</strong><br />\nFind secret passages, unlock cheat codes and figure out what the outside world has been up to while you were away.  </li>\n</ul>\n<p><strong>ARCADE</strong></p>\n<ul>\n<li><strong>Instant action!</strong><br />\nCustomize every aspect of the match: choose your favorite map, your rulesets, your skill level, and hit play for a quick shootout!  </li>\n<li><strong>Friends and foes</strong><br />\nArcade matches aren&#39;t canon, choose your favorite character to play as!  </li>\n<li><strong>Very Important Playerperson</strong><br />\nExperience a whole set of maps built exclusively for the Arcade mode!</li>\n</ul>", "metacritic": null, "released": "2023-04-12", "tba": false, "updated": "2023-04-14T06:52:44", "background_image": "https://media.rawg.io/media/screenshots/8fd/8fd84c633d868edd2e254723383914f7.jpg", "website": "https://daevteam.itch.io/ghostware", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "beaten": 1, "toplay": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 352, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Daev Team"], "genres": ["Action", "Shooter", "Adventure", "Indie"], "publishers": ["Hyperstrange"], "esrb_rating": null}