{"id": 911461, "slug": "starless-hotel", "name": "Starless Hotel", "name_original": "Starless Hotel", "description": "During a stormy night, Kyle Hoover is forced to spend the night in a 5-star hotel in the middle of nowhere in Kansas. He will soon discover that the hotel is quiet and nobody seems to be there – only the rainstorm and the thunders outside are audible. <br/><br/>Sometime, the ‘voices’ of her lost daughter makes their appearance in the corridors of the hotel. In addition, once he find the key of his room and go to sleep, a terrible fate falls on him. In fact, when he wakes up, the hotel has 4-stars, and not 5-stars anymore. This is reflected also in the general design of the hotel, with a darkish tone.<br/><br/>Kyle try to find a way out of the hotel, but with no result. Eventually, he goes to sleep again. <br/><br/>When he wakes up, the hotel has 3-stars… <br/><br/>And so on…<br/><br/>Always…<br/><br/>Forever…<br/><br/>Will you be able to escape from this impossible situation?<br/><br/>___________________________________________________<br/><br/><strong>General Gameplay Features</strong><br/>Starless Hotel is a unique horror game where you need to explore the same environment but more and more horrific when the game evolves. <br/>The core of the gameplay of Starless Hotel is centered on solving puzzles, by finding keys, reading documents and finding codes for safes. <br/><br/><strong>Detailed Gameplay Features</strong><br/>The game is divided in 6 sections: in each section, the main character (Kyle) have to find a way to access a specific room of the hotel. <br/>The player can do this by looking for keys around the areas. In order to find each specific key, there will be hints around the hotel. <br/>These hints are in forms of notes, newspapers and drawings, that the player need to interpret in order to find the object of interest. <br/><br/><strong>Main Game Aspects</strong><br/>- A weird mystery to solve<br/>- An investigation of a strange hotel that changes aspect every night<br/>- Frequent jumpscares during the exploration of the hotel<br/>- An amazing backstory and psychological plot", "metacritic": null, "released": "2023-01-16", "tba": false, "updated": "2023-01-20T03:44:06", "background_image": "https://media.rawg.io/media/screenshots/259/2591f04763bf991f860f8a3dd2838e40.jpg", "website": "http://pulsarnikproductions.com/index.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pulsarnik Productions"], "genres": ["Adventure", "Indie"], "publishers": ["Pulsarnik Productions"], "esrb_rating": null}