{"id": 911579, "slug": "find-the-alien-2", "name": "Find the Alien 2", "name_original": "Find the Alien 2", "description": "Looking for fresh alien games? Now aliens are traveling through history to replace all people with their own kind. Find the impostors and kill them to save the Age. We introduce part II of the game with fully new story. Welcome to Find the Alien 2!<br/><br/>Follow the aliens and travel through the history. Start a rescue operation from the Stone Age. Keep traveling between worlds and killing aliens. Look around and feel the vibe of the era. Agree that this is more breathtaking than reading about history in books.<br/><br/>In this game you will see lots of interesting characters from different times of history. Meet dinosaurs, ancient people, famous historical figures such as Cleopatra and King Arthur. But remember, you are here to find the aliens and stop the invasion!<br/><br/>When you get to a new place, first scan everything you see. Aliens can replace people, animals and even things. Remember where you saw the alien when you used the UFO scanner. Then use the blaster to kill the aliens. It becomes more difficult when the number of aliens increases and they start to move. Don't kill real people or animals. In this case, you will fail.<br/><br/>MAIN HIGHLIGHTS<br/>•\tHistorical places<br/>Travel through the Stone Age, Ancient Egypt, the Middle Ages, the era of piracy, the Wild West, the present and the future.<br/><br/>•\tFamous characters<br/>Complete the levels and save cave people, dinosaurs, ancient Egyptians, Cleopatra, medieval peasants, knights in armor, King Arthur, Lady of the Lake, pirates, cowboys, sheriffs, bandits and some cyber punk cyborgs.<br/><br/>•\tThoughtful plot<br/>This game has 3D graphics and storyline with funny moments and characters. All these features will completely immerse you in the plot of the game. And you will forget what time it is. Are you ready to fight the Alien King?<br/><br/>Download Find the Alien 2 and save the earth in the past, present and future. Be the first to uncover the mysteries of the history and stop the alien invasion.", "metacritic": null, "released": "2022-12-28", "tba": false, "updated": "2023-01-20T06:07:18", "background_image": "https://media.rawg.io/media/screenshots/71c/71c820692a1d8e0768e8b511c0b6d5c6_kp4QBIE.jpg", "website": "https://moonee.io", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MOONEE PUBLISHING"], "genres": ["Action", "Adventure"], "publishers": ["MOONEE PUBLISHING"], "esrb_rating": "Teen"}