{"id": 911506, "slug": "monster-girl2", "name": "Monster Girl2", "name_original": "Monster Girl2", "description": "<h3>The game is introduced</h3>As a casual puzzle game (spot the difference), it is perfect for training your observation. In the game, there are numerous hidden spots on the character's accessories and background. You need to spot 8 to15 differences in each stage to complete the mission.<h3>Game mode</h3>Game mode to find different, have more than one branch. It takes about 20 to 30 minutes to complete a single session.<br/><br/>If you encounter some problems, you can contact us here↓↓↓<br/>https://discord.gg/fwsd39uPb8<h3>Role Introduction</h3><br/>Butterfly<br/>The girl named Yingtai who met in the garden was struggling to find her lost memory and her lifelong pursuit.<br/><br/><br/>Qing &amp;Bai<br/>The blue and white sisters who came to chat up next to the West Lake, the old bridge in rainy days, held up an oil-paper umbrella. This scene seems to have been seen somewhere<br/><br/><br/><br/>Ling<br/>The scars on the unidentified zombie that came to you from the mass grave seem to tell her tragic past<br/><br/><br/>Cat<br/>The cat demon girl who suddenly broke into your room at night, with her nimble eyes staring at you under the bright moonlight.<br/><br/><br/>Ling Shan<br/>It seems that the girl in ancient costume who met in the strange world can know more about the secret of the demon master from her<br/>", "metacritic": null, "released": "2023-01-18", "tba": false, "updated": "2024-04-15T13:22:03", "background_image": "https://media.rawg.io/media/screenshots/170/1700be2cf8dafc85ce5db2fd574f97c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 54, "beaten": 1, "toplay": 1}, "playtime": 1, "achievements_count": 69, "ratings_count": 2, "suggestions_count": 295, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["JKSoft"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["ohiyosoft", "JKGames"], "esrb_rating": null}