{"id": 911575, "slug": "ancients-reborn-mmorpg", "name": "Ancients Reborn: MMORPG", "name_original": "Ancients Reborn: MMORPG", "description": "Ancients Reborn is a popular MMORPG that combines the intricate mechanics of a modern online role-playing game, with the nostalgic lineage of old-school MMORPG adventure games. Play casually with your friends or as a hardcore adventurer and destroy your enemies in battle.<br/><br/>Beautifully Crafted Fantasy Adventure<br/>A hand-crafted vibrant 3D fantasy world with a feel similar to classic old-school MMO role-playing games.<br/>Feel the nostalgia of a classic dungeon crawling experience with unique styles of play and a modern look and feel. Adventure your way through a glorious open world.<br/><br/>Elegant Offline Automation System<br/>Casually progress when offline by hiring workers to mine ore, catch fish, and chop trees. Then take your resources to be crafted into useful equipment, weapons, and food for healing while adventuring.<br/>A fantastic old-school role-playing experience, but with casual role-playing advantages!<br/><br/>Defeat Epic Dungeon Bosses<br/>Crawl through the huge open-world labyrinths and catacombs in a party with your friends, defeating ancient dragons and hoards of godly, legendary enemies.<br/><br/>Style your Appearance<br/>Thousands of possible character configurations and customizations. Utilize uniquely stylized armor and the best weapons to further enhance your look.<br/><br/>Conquer a Vast Variety of Skills and play styles<br/>From combat skills and equipment crafting to cooking and mining, there is a huge range of character skills to level up.<br/>Play as a merchant and trade with other players to become a popular hero known throughout the kingdom, or partner with guild friends to form a legendary clan. Mastering your skills will make you a legend in this Open-World MMORPG.<br/><br/>Exciting PvP and PvE<br/>A multiplayer role-playing game where you raid tombs for legendary loot, slay dragons, and vanquish beasts.<br/>Play online as a dragon hunter or a humble merchant. Only you can carve out your fabled destiny.<br/>It's a top RPG experience, so you will easily find other battle-worthy opponents for some challenging player vs player (PvP) action.<br/>A fantasy game filled with adventures and the best MMORPG quests, top RPG battles and fun awaits.<br/><br/>Leaderboards and Events<br/>Rise to glory and be recognized by thousands of other players competing on the multiplayer leaderboards!<br/>Enjoy the social aspects of a large open-world MMORPG with immortal dungeons and exciting RPG encounters.<br/><br/>A Massively Multiplayer Online Role-Playing Game for players who enjoy open-world fantasy adventures.<br/><br/>Join us on Discord:<br/>https://discord.gg/CdzJp3B", "metacritic": null, "released": "2022-12-23", "tba": false, "updated": "2023-01-20T06:03:39", "background_image": "https://media.rawg.io/media/screenshots/2e4/2e4af308827783652f961a0dc1756181_kvcCYA9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 365, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Xisle Games"], "genres": ["Adventure", "RPG"], "publishers": ["Xisle Games"], "esrb_rating": "Everyone 10+"}