{"id": 911518, "slug": "warhammer-age-of-sigmar-soul-arena", "name": "Warhammer Age of Sigmar: Soul Arena", "name_original": "Warhammer Age of Sigmar: Soul Arena", "description": "Soul Arena is a next generation free-to-play autobattler set in the exciting fantasy universe of Warhammer: Age of Sigmar.<br/><br/>Join us in this epic turn based war through the Mortal Realms and finetune the tactics and strategy of your team in this auto chess inspired game that took off with a boom.<br/><br/><h3>CHOOSE YOUR CAPTAIN</h3>You can bet that no Underlords or Legends are needed here. YOU and your tactics are the heroes. Before entering a match you will pick the captain that suits how you want to play and fight, depending on whether you want to go for control, midrange or aggro.<br/><br/><br/><h3>MATCH 3 UNITS TO UPGRADE</h3>Your “chess pieces” or units are the core of your Warhammer: Age of Sigmar army. Collect and merge similar units from the shop and upgrade them to become even stronger when you clash in battle.<br/><br/><br/><h3>CREATE SYNERGIES</h3>It can be a puzzle to outsmart and draft better than your opponent, but the odds are with you if you take advantage of the powerful bonuses that can be unlocked by mixing units from the different factions and classes from the shop.<h3>BE THE LAST PERSON STANDING</h3>Like in a battle royale you have to be the last person standing while the magic you conjure makes your opponents twitch on the ground. Evolve to become an auto chess hero!<br/><br/><br/><h3>SINGLE PLAYER OR MULTIPLAYER</h3>Try out the epic single player AI puzzle mode or play online against friends and other players from around the world. Join PvP lobbies and tournaments and take your army to the next level.<h3>RANKED MATCHMAKING</h3>Queue up and climb the ranks on the ladder one teamfight at a time through the advanced ELO system. Make your profile number 1 worldwide.<br/><br/><br/><br/><br/>Please see the Trophy Games Privacy Statement to know more about your data protection at: https://trophy-games.com/legal/privacy-statement<br/> <br/>Warhammer Age of Sigmar: Soul Arena © Copyright Games Workshop Limited 2023", "metacritic": null, "released": "2023-01-19", "tba": false, "updated": "2023-01-20T04:55:36", "background_image": "https://media.rawg.io/media/screenshots/f2d/f2dea88aaf1bc12f73fbfa32fb79916a.jpg", "website": "https://soularena.gg/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 16}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 460, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Trophy Games"], "genres": ["Strategy", "Simulation"], "publishers": ["Trophy Games"], "esrb_rating": null}