{"id": 911521, "slug": "a-matter-of-principle", "name": "A Matter of Principle", "name_original": "A Matter of Principle", "description": "Here is an interactive comics novel about one of the most high-profile events of the 20th century. There are many theories about what exactly happened on June 28, 1914 in Sarajevo. A deliberate attempt? A tragic accident? Masonic conspiracy?<br/><br/>The Bosnian Serb Gavrilo Princip killed the heir to the Austro-Hungarian throne, Franz Ferdinand, which became a formal reason to start the first world war of its kind ... But who was Princip and what led him to this act? Who was Franz Ferdinand and how did he meet that fateful day? What do they have in common and could war have been avoided?<br/><br/>Inside the game you will find answers to these questions, as well as the majestic interiors of Austria-Hungary and the nature of the Balkan Peninsula from the pen of Askold Akishin, one of the greatest comics artists.<h3>Game Features:</h3><ul><li> The recognizable style of Askold Akishin - dynamic black and white expressive drawings made in a comics style panels,<br/></li><li> Complete, gripping story,<br/></li><li> Interactive polling system, <br/></li><li> Quiz,<br/></li><li> Luxurious gallery from different artists, </li></ul>and much more!<br/><br/>Embark on an exciting journey to the beginning of the 20th century and see the origins of the first World War of its kind.<br/><br/>If you are not familiar with the history of Gavrilo Princip and Franz Ferdinand, this will be the most fascinating history lesson of your life. If you are familiar, you will find a unique immersion in that era, you will be able to see the significant events of those years, as well as consider this amazing story from different angles, in detail.", "metacritic": null, "released": "2023-01-19", "tba": false, "updated": "2023-01-20T04:59:01", "background_image": "https://media.rawg.io/media/screenshots/5cc/5cc138234d942c2f4b0e1e7c3ec8f627.jpg", "website": "http://dillyframe.games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 36, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DillyFrame"], "genres": ["Casual", "Indie"], "publishers": ["DillyFrame"], "esrb_rating": null}