{"id": 911543, "slug": "amnesia-the-bunker", "name": "Amnesia: The Bunker", "name_original": "Amnesia: The Bunker", "description": "<p>Amnesia: The Bunker is a first-person horror game from the makers of SOMA and Amnesia.<br />\nLeft all alone in a desolate WW1 bunker with only one bullet remaining in the barrel, it’s up to you to face the oppressing terrors in the dark. Keep the lights on at all costs, persevere, and make your way out alive. A truly intense horror experience.<br />\nRISING TENSION<br />\nImmerse yourself in the multiple ways of tackling survival. In the shoes of the French soldier Henri Clément, you are armed with a revolver gun, a noisy dynamo flashlight, and other scarce supplies to scavenge and craft along the way. With randomization and unpredictable behavior, no play-through is the same.<br />\nHunted by an ever-present threat reacting to your every move and sound, you must adapt your play-style to face hell. Every decision will change the outcome of how the game responds. Actions bear consequences.<br />\nESCAPING THE NIGHTMARE<br />\nSolve things your own way in a semi-open world. You must explore and experiment to make your way out. Figure out what’s going on down here - what has happened to the other soldiers? Where have all the officers gone? What diabolical nightmare lurks underneath this hellscape? Unravel the mysteries of the Bunker and get to know the nooks and crannies of this cruel sandbox to up your odds of survival.<br />\nFEATURES<br />\nDynamic and ever-present monster that reacts to player actions.<br />\nConstant tension - Time is not on your side.<br />\nTactile and physics based interactions with the world.<br />\nScavenge for resources and craft tools to aid your survival.<br />\nMultiple solutions to problem solving in a non-linear open world.</p>", "metacritic": null, "released": "2023-06-06", "tba": false, "updated": "2024-04-12T09:03:58", "background_image": "https://media.rawg.io/media/games/a45/a45abc50643f0fa355f5cb24cbb94744.jpg", "website": "https://amnesiathebunker.com/", "rating": 3.84, "rating_top": 4, "added_by_status": {"yet": 30, "owned": 62, "beaten": 63, "toplay": 85, "dropped": 26, "playing": 8}, "playtime": 6, "achievements_count": 5, "ratings_count": 66, "suggestions_count": 242, "game_series_count": 3, "reviews_count": 68, "platforms": ["PC", "Xbox Series S/X", "PlayStation 4", "Xbox One"], "developers": ["Frictional Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Frictional Games"], "esrb_rating": null}