{"id": 911527, "slug": "red-wukong", "name": "Red Wukong", "name_original": "Red Wukong", "description": "<h3>Storyline:</h3>In the depths of planet Paragon, inside the Arcan Mines, the great drills never stop working. But that day a strange red light was all around, workers talked about some energy popping up in the air. Tremors interrupted and broke some tracks, platforms have fallen. And than, in a weird Terminator style, Red Wukong was there. Now he will face the Kaizan Empire that controls the planet, but no one knows his purposes.<br/><br/><br/>Red Wukong is a 3d action platformer with a beat 'em up style combat. Each level has different enemies and secrets, also the world map where you enter the levels is highly explorable and hides some dungeons. <br/><br/>Red Wukong is a solo dev project with some gameplay aspects heavily influenced by old snes platform classics, bringing then to the new generation. The game is powered by Unreal 5 and use assets from Paragon game. New techniques like Nanite and Lumem for global Illumination are widely used.<br/><br/><ul><li><strong>Combat</strong> - Action and challenge in a beat 'em up style combat, Red Wukong can attack and defend with his staff, he can also jump on enemies heads to cause damage and in some levels it has some hidden powers.<br/></li><li><strong>Exploration</strong> - Each level has a lot to explore, in some parts of the game you can find Relic Dungeons which are small hidden maps where Red Wukong has to beat a wave of enemies to escape and get the reward.</li></ul>", "metacritic": null, "released": "2023-01-19", "tba": false, "updated": "2023-01-20T05:06:49", "background_image": "https://media.rawg.io/media/screenshots/f77/f77bcd47cdaf831e4d3fbe46f511ae04.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 513, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Overcode Games"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Overcode Games"], "esrb_rating": null}