{"id": 911566, "slug": "tap-legends-tactics-rpg", "name": "Tap Legends: Tactics RPG", "name_original": "Tap Legends: Tactics RPG", "description": "Adventurers, ready to join this immersive strategy adventure like no other? More than 60 diverse and unique heroes from 6 different Classes are waiting for your command! Make good use of equipment and artifacts, pay attention to faction balances and synergy traits, build up your strongest hero squad and be the legend! <br/><br/>==== FEATURES ====<br/><br/>【Auto combat, Idle style. Battle-and-rest makes it the best!】<br/><br/>Auto-chess mode allows heroes to automatically cast spells throughout the whole process. Easy-to-play operations, short-time and fast-paced battles, fantastic 3D modeling, high-quality animation performance, diverse hero images and dazzling in-battle special effects… ingenious designs are everywhere, making every battle a super cool and shocking experience! Afraid of repeating boring routine and becoming tired? Don't worry, your hero squad will automatically fight for you when you are offline, and you are sure to claim Gold, Exp, equipment and other bountiful resources easily for free every day simply by logging in!<br/><br/>【Collect and cultivate, be a legend on the state!】<br/><br/>Multiple heroes are waiting for your recruitment and training! Go to the tavern to see which powerful heroes you are going to have an adventure with. Here, the concise and limited hero pool spares you from redundant troubles. Each hero has its own unique skills, as well as distinctive faction, race, and class traits. Use your strategy throughout the game, make good use of resources and traits and voila, the legendary team is right on your hands!<br/><br/>【Colorful game modes, amazing adventure experience!】<br/><br/>In the continent of Evloyia, any experience will be exciting. You can tour around to accumulate basic resources in an airship but level up like a rocket. Would like to make a clean sweep of treasures? Infinity Tower is all you need. Heroes there guard treasures you want. Phantasm Maze is the best place for curious adventurers, mysterious and dangerous. And according to surviving adventurers who’ve been there, everything changes every time you enter it... even the rewards you may get. The Rift of Time can reverse time, taking you to the space where ancient Artifacts were hidden. Find them if you dare, a variety of relics would protect you along the way. Go to the Bounty Board to accept Quests and become a dashing bounty hunter? Sounds nice. Still not enough? Then challenge the Brawler Club, the heroes there are incredibly powerful. Be careful, your victory won't be easy, but the rewards awaiting are totally worth a try!<br/><br/>【Duel with elites, the crown awaits!】<br/><br/>No matter what stage you are in, you can find a suitable place for competition. Duel with other adventurers on the current server or across. Do you have the ambition to slash a way out? Can you defeat all elite adventurers and make it to the top? Come to Arena and write the answer with your power!<br/><br/>【Join a guild, unite as one!】<br/><br/>Adventurers do not always fight alone. Rivals or brothers? You can be both at the same time. Form or join a guild, challenge mighty guild bosses with comrades from all over the world, participate in Guild War and dominate! You can also enjoy many customized Guild Technology, getting rewards bonus and power enhancement! Communication has no barrier. You can play with adventurers from all over the world and chat in real time. Our Chat function supports multi-language one-click translation, making everything you want to convey convenient and fun!<br/><br/>No more waiting, now’s the time! Start your journey with your own heroes and head for the the continent of Evloyia now!", "metacritic": null, "released": "2022-09-14", "tba": false, "updated": "2023-01-20T05:55:21", "background_image": "https://media.rawg.io/media/screenshots/af0/af073686e58a107fac907324bce6140d_3ZCqUXc.jpg", "website": "https://www.droidhen.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["DroidHen"], "genres": ["RPG", "Card"], "publishers": ["DroidHen"], "esrb_rating": "Teen"}