{"id": 911526, "slug": "rapscallions-on-deck-a-friendship-otome", "name": "Rapscallions On Deck - A Friendship Otome", "name_original": "Rapscallions On Deck - A Friendship Otome", "description": "Mistaking Larsa for a boy, four pirates kidnap her because they’re in desperate need of a swabbie. And that’s how Larsa finds herself on board a pirate ship in the middle of the ocean... As she grows closer to her crewmates, she realizes that they aren't bad or dangerous people despite being pirates, they are just mischievous rascals. Will Larsa be able to bond with these pirates as she sails the seas and goes on adventures with them?<br/><br/><br/><br/><br/>Larsa (Renameble) is a tough tomboy who doesn't want to show any weakness. As the swabbie of the crew, her job is to tirelessly mop the deck every single day. Life on board a pirate ship is strange to get used to. It doesn't help that her crewmates are weirdos.<br/><br/><br/>Milos is the ship's navigator. He spies on people— I mean, ships. Sailing gets boring, so he likes to peep at his crewmates to pass the time. He knows everyone's secrets...<br/><br/><br/>Jun is the ship's gunner. He will turn berserk if he can't fire his canon every 5 hours. Man's a maniac. Please stop him from destroying everything. He can't shut up.<br/><br/><br/>Otto is the ship's carpenter and surgeon. Fixing humans is the same as fixing ships, right...? You just need to saw stuff...? If you ever ask him for an amputation, he will do it gently???  <br/><br/><br/>Kagi is the ship's captain. He acts way too carefree and childish to be a pirate. You don't need food and water to sail the high seas when there's friendship!!! He will cry if his crewmates fight. <br/><br/><br/>Side characters who you'll meet on the adventure. They are romanceable.<br/><br/><br/><br/>- 26 CGs<br/>- 55K Words<br/>- 9 Endings<br/>- Renameable MC<br/><br/><br/>", "metacritic": null, "released": "2023-01-19", "tba": false, "updated": "2023-01-20T05:05:46", "background_image": "https://media.rawg.io/media/screenshots/bd9/bd929d24d8d289286ae435f10a41e58b.jpg", "website": "https://chanimk19.wixsite.com/chanimk", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 311, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["ChaniMK"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["ChaniMK"], "esrb_rating": null}