{"id": 911630, "slug": "stickteam", "name": "StickTeam", "name_original": "StickTeam", "description": "<p>English 💀💀 : </p>\n<p>I'll be direct, StickTeam is a trashy RPG videogame, made with the hated RPGMAKER MZ, with questionable graphics and an even more questionable story. The game was originally published on GameJolt, in spanish, of course, since it sucks it was removed and we took the opportunity to upload it here.</p>\n<p>The only salvageable thing about this interactive aberration is its moderately good music.</p>\n<p>kill me please.</p>\n<p>For part of my fictitious contract I have to explain its features:</p>\n<p>100+ annoying drab and vomit poorly designed enemies.</p>\n<p>Groovy music.</p>\n<p>A story so cringe that it will induce at least three suicidal thoughts after witnessing it.</p>\n<p>Oh, and if you're that creepy weirdo who searched for \"FUTA FURRY EROTIC RPG\", then this only meets the first category, it's an RPG.</p>\n<p>That's all. Please, the only justification for your own download would be that you didn't read this description.</p>\n<p>If this didn't have Moghunter's plugins, I probably wouldn't even dare to upload this.<br/></p>\n\n<p>Español:</p>\n<p>Seré directo, StickTeam es un videojuego RPG repugnante, hecho con el tan odiado RPGMAKER MZ, con un apartado gráfico cuestionable y una aún más cuestionable historia. El juego fue publicado originalmente en GameJolt, en español, claro que como es una mierda fue removido y aprovechamos para subirlo aquí.</p>\n<p>Lo único rescatable de esta aberración interactiva es su música medianamente buena.</p>\n<p>Máteme porfavor.</p>\n<p>Por parte de mi contrato ficticio tengo que explicar sus características:</p>\n<p>100+ enemigos molestos monótonos y vomitivos diseñados pobremente.</p>\n<p>Música.</p>\n<p>Una historia tan cringe que te inducira por lo menos tres pensamientos suicidas tras presenciarse.</p>\n<p>Oh, y si eres ese raro asqueroso que buscó \"RPG ERÓTICO FUTA FURRO\", pues este solo cumple con la primera categoría, es un RPG.</p>\n<p>Eso es todo. Porfavor la única justificación de su descarga propia sería que no leíste esta descripción.</p>\n<p>Si esto no tendría los plugins de Moghunter, probablemente ni me atrevería a publicar esto.<br/></p>", "metacritic": null, "released": "2023-01-20", "tba": false, "updated": "2023-01-20T06:28:05", "background_image": "https://media.rawg.io/media/screenshots/8aa/8aa6ada9763286f8735a0a0e2a915b28.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Eyebox Games"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}