{"id": 911764, "slug": "crime-opera-ii-the-floodgate-effect", "name": "Crime Opera II: The Floodgate Effect", "name_original": "Crime Opera II: The Floodgate Effect", "description": "<p><strong>Contact Us: </strong>crimeoperastudios@gmail.com</p>\n<p>Twitter\r\n</p>\n<p>Facebook</p>\n<p><strong>DEMO: </strong>https://crimeoperastudios.itch.io/crime-opera-ii-demo</p>\n<p><strong>Details:</strong>\n</p>\n<p><strong>Play Styles: </strong>Kinetic or with Choices</p>\n<p><strong>Main Route: </strong>Over 107k words</p>\n<p>The second novel in the Crime Opera series, The Floodgate Effect is a kinetic novel about a mafia family known as the Gallos. The story is told through the eyes of the young men and women of the Gallo family, who range from the ages of 11-24, as they begin to enter into a life of crime.</p>\n<p><strong>---------------------------------------------------------------------------------------</strong></p>\n<p><strong>WARNING: </strong>If you have yet to read the first novel in the series, “Crime Opera: The Butterfly Effect\", it is highly recommended you do so before reading the following spoilers!</p>\n<p>---------------------------------------------------------------------------------------</p>\n<p>The story begins 9 years after The first Crime Opera tale. Xander Gallo is now bitter, alone, and out of control. He is causing problems for not only other families within the crime syndicate, but for the younger Gallo members as well. Those who remained behind to continue the family legacy are soon forced to take sides with or against Xander Gallo, while others who have seemingly moved on with their lives are pulled back in against their will.</p>\n<p>Crime Opera is a tale of loyalty and deceit, murder and survival, and both the strength and frailty of familial bonds. This particular novel serves as the second part of a much longer saga, following the Gallos from childhood to old age as they are pitted against the outside forces of the mafia world, and eventually, each other as well. </p>\n<p>As with the previous novel, this installment is divided into four books (24 chapters total). Expect many unexpected twists and turns, questionable alliances, and false setups within.</p>\n\n\n<p> </p>\n<p><strong>PROTAGONISTS</strong> </p>\n\n<p>19 years old. Oldest son of Xander. Currently studying in University, unable to cope with the criminal lives of his family members.  </p>\n<p>17 years old. Youngest son of Xander. Finishing high school, working for Xander.</p>\n\n<p>15 years old. Youngest daughter of Xander. Has moved on from past traumas with the help of her best friend and boyfriend. </p>\n\n<p>24 years old. Xander’s nephew, and 2nd in command of the Gallo businesses. </p>\n\n<p>16 years old. Oldest niece of Xander, and subjected to most of his abuse.   </p>\n\n<p>11 years old. Youngest niece of Xander. Dreams of a better life elsewhere.</p>\n<p> </p>\n<p><strong><br/>SUPPORTING CAST</strong> Patriarch of the Gallo family. Bitter, alone, easily angered, and often violent.\r\n  </p>\n<p>Cousin to Xander, works closely with Kevin on family business.</p>\n\n<p>21 years old. Plays a minor role in this novel. <br/></p>\n\n<p>And many more!</p>\n\n<p>\n</p>\n\n<p><strong>SBester – Writer/Programmer -</strong> </p>\n<p>\"English Literature graduate (as well as a few other degrees). This series is pretty much an excuse to put those writing skills to use in a semi-professional way, I suppose. I’ve been writing Crime Opera over the last 7 and a half years as a response to the anti-hero fad that’s been so popular as of late, in an attempt to fix what has bothered me about it for so long. I currently work as a financial aid rep at a College, and in my spare time I am either writing these novels, reading, playing video games, or playing guitar with my band (EX-GRAVITUS).\"</p>\n\n<p> \r\n\r\n<strong>Jaytee Sketch – Character Artist -</strong> </p>\n<p>\"A freelance artist with an Economics Degree and an MBA. I have been doing art all of my life, as it’s something I love and enjoy doing as a hobby (which eventually became a job). Now I take it very seriously, doing game assets for indie game studios (like TopHatStudios) which includes backgrounds and sprites for Visual Novels as well as other commission jobs (such as small animations, portraits, and art assets). When I read Sean's trilogy I loved it and thought it deserved to be brought to life as a commercial venture. I feel happy when I can inspire others through my art, and with this project I think I'll manage to do that and more.\" \r\nhttps://twitter.com/jtSketch\r\nhttp://jtsketch.tumblr.com/</p>\n\n<p>\n<strong>Solo Acapello – Musician -</strong> </p>\n<p>\"Musician with a Master's degree in Music Composition. I've been writing music for a long time and have always wanted to use my skills to help tell a story. This is the perfect chance for that. While I have had pieces performed by the Toledo Symphony and String Quartet, among others, I am looking forward to creating music for games and am currently doing so full time.\" \r\nhttps://soundcloud.com/solo-acapello </p>\n\n<p>\n<strong>Giao Nguyen - Background Artist -</strong> </p>\n<p>\"Hi, My name's Giao, and I'm an artist from Vietnam. I worked as a background artist for an anime studio for 8 years (BIHOU Studio/ Japan), and now I have become a concept/illustration artist for a game company (VNG/VietNam). I always want to challenge myself with freelance jobs as well.\"\r\nhttps://www.artstation.com/giaonp</p>\n<strong>ADDITIONAL:</strong>\n<p><strong>Brandon Caskanette - </strong>Just happens to be besties with the lead writer. Brandon is a graphic designer who created the title poster, logos, and kickstarter images for the project. </p>\n<p><strong>Trey Fletcher (Valhalla) - GUI - </strong>Also did the GUI for the first game. <br/> https://www.deviantart.com/wingedvalhalla </p>\n<p><strong>WhiteCharisma - Trailer/Opening Video -</strong> Also did the video for the first game.\r\nhttps://lemmasoft.renai.us/forums/viewtopic.php?t=40065 </p>\n<p><strong>ExGravitus -</strong> Video Music Theme - My band, a Symphonic Metal project, contributed a track (the one you hear in the video)!\r\nhttps://soundcloud.com/exgravitus</p>\n<p><strong>Troubleshooting Tips:</strong></p>\n<p>          If you're having issues loading, you may have used the \"Quick Save\" option by clicking the save icon on the right (during gameplay). To use your Quick Load file, you'll need to get back into gameplay and hit the load icon on the right. You can access the main Save and Load screens from the main menu, or by right clicking during gameplay and using the icons on the left.</p>\n<p>          The Gallery feature was cut after the kickstarter failure, as we were unable to obtain the funds needed for full CGs. Our sincerest apologies.</p>", "metacritic": null, "released": "2023-01-19", "tba": false, "updated": "2023-01-20T07:32:56", "background_image": "https://media.rawg.io/media/screenshots/ffa/ffa2b3ef09345c55fe4d0557cef6a331.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Crime Opera Studios"], "genres": [], "publishers": [], "esrb_rating": null}