{"id": 911782, "slug": "bomberman-at-home", "name": "Bomberman At Home", "name_original": "Bomberman At Home", "description": "<p>Bomberman At Home, its a game that i made, inspired in the classical serie of games Bomberman, specifically Bomberman Neo from 1997. I made this game in class, when i was learning about multiplayer, so with the use of photon, i recreated the masterpiece of Bomberman Neo to play with my friends.<br/></p>\n<p>The game can be played up to 4 players.</p>\n<p>How to Play : First create a room by writing a name for it and then click on \"Create Room\". Then tell your friends to join by writing the room name and then clicking on the \"Join Room\" button. Once you are all inside the game, click on the button that says \"Player X\" until it turns green. Once all players are green, the host can start the game.</p>\n<p>Objective : Be the last man standing. Explode your friends, or watch them explode themselves to win the game.</p>\n<p>Controls : </p>\n<p>WASD : Movement</p>\n<p>SpaceBar : Place Bomb</p>\n\n<p>PowerUps : There are 4 PowerUps</p>\n<p>More Bombs (Bomb with a +1 sign in it) : Means you can place 1 more bomb at the same time on the field.</p>\n<p>More Power (Bomb with a fire symbol) : Means your bombs explode 1 square further in every direction.</p>\n<p>More Speed (Red Boot) : You move faster.</p>\n<p>Kick (A boot kicking a bomb): You can kick bombs if you walk towards them and they will follow a straight line until they touch anything or if they explode.</p>", "metacritic": null, "released": "2023-01-19", "tba": false, "updated": "2023-01-20T07:40:19", "background_image": "https://media.rawg.io/media/screenshots/513/513ed7371d83e0fc9d08d1e3570b3873.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kings"], "genres": [], "publishers": [], "esrb_rating": null}