{"id": 912097, "slug": "feather-islands", "name": "Feather Islands", "name_original": "Feather Islands", "description": "<p>Feather Islands is a 3D point and click adventure game in which the player controls a bird protagonist on the hunt to find resources for building nests to prepare for the harsh winter ahead. The bird traverses through a unique environment filled with mini islands to hop between, whilst avoiding enemies who want to steal precious resources, hunting for valuable items to help progression e.g. weapons to fight enemies and talking to NPCs to gain quests. </p>\n<p><strong>Mechanics:</strong></p>\n<ul><li>Main menu screen displays controls, instructions and game title along with background highlighting the core fantasy-driven design theme of the game as well as the animated bird protagonist. \r\n</li><li>Mini island level design - the level comprises of small floating islands the bird hops between, increasing exploration. \r\n</li><li>NPCs around the map provide the player with quests to gain resources with simplistic dialogue system. Player gets rewarded a leaf resource. Interests player with unique dialogue. \r\n</li><li>Resource collection - players collect a honey resource from enemies for quests utilising a combat system which increases player interaction within the game world. Creates a feeling of motivation for players to collect the correct resources to aid progression. \r\n</li><li>Farming system - Built into a plant store ui, players purchase crops using leaf resource whilst planting and harvesting crops interacting directly with the game world. Provides a calming, fun feature for players to engage with.\r\n</li><li>Nest Building - each nest requires a different set of crops to build, which increases the uniqueness on each build, and decreases boredom for the player. Building utilises a grid ui type system.</li></ul>", "metacritic": null, "released": "2023-01-18", "tba": false, "updated": "2023-01-20T10:31:19", "background_image": "https://media.rawg.io/media/screenshots/aec/aecacb36b0973b0bba066547038d3e32.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hattie"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}