{"id": 91206, "slug": "an-edelweiss-resolve", "name": "An Edelweiss' Resolve", "name_original": "An Edelweiss' Resolve", "description": "GET THE WALKTHROUGH HERE!\r\n<p>After living your whole life as a normal high school student, a fateful meeting with a powerful witch shows that you are actually a witch, too! And now she hired you as her apprentice while paying for education in a better school that teaches magic... and giving you a chance to meet magic casters like you.</p>\n<p>Also, what's with the atmosphere saying <em>danger</em> everywhere? Is it because people despises witches as the fairytale's villain, or because of the rumors about students being kidnapped?</p>\n<p><strong>An Edelweiss' Resolve</strong> is a GxB visual novel featuring:</p>\n<ul><li><strong>40,000+ words</strong> better love story than Twilight, since you can actually date the vampire AND the werewolf.</li><li><strong>Nameable protagonist</strong> with no default name (because we want to).</li><li><strong>Three bachelors</strong> to choose, with good and bad ending for each route.</li><li><strong>Lots of choices</strong> (some of them might <em>drastically</em> alter the conclusion).</li></ul>\n<p><strong>Important note</strong>: Kieran (the vampire)'s route is locked at the first playthrough; you have to finish at least one ending from Johann or Alaric's route to unlock his route. The recommended playing order is <strong><em>Johann </em>-&gt; <em>Alaric </em>-&gt; <em>Kieran</em></strong>.<br/></p>\n<p><em>(although if you're here only for the story, Johann's route can be skipped since Kieran's story will explains everything.)</em></p>\n<p>This game was submitted as a college project, but in the future I might want to remake the game (and definitely hiring a beta, since English is not my first language). You are encouraged to answer these questions so I know how should I improve:<br/></p>\n<ol><li>Which one is your favorite route and ending? Why?</li><li>Are there parts of the story that should be extended or cut? Why?</li><li>How about the character development? Which part should be improved more?</li><li>Was the conflict interesting enough? Are there scenes that should be developed more?</li></ol>\n<p>And lastly, thank you for playing!</p>", "metacritic": null, "released": "2018-05-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/591/59154121d736f0d4979741950271b9b9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["chocochino"], "genres": [], "publishers": [], "esrb_rating": null}