{"id": 912137, "slug": "loopcube", "name": "LoopCube", "name_original": "LoopCube", "description": "<p>LoopCube</p>\n<p>1. Introduciton</p>\n<p>You are chasing the blue cube but stuck in a loop path</p>\n<p>It is a gamejam achievement which theme is loop</p>\n<p>Made in Godot, using temlpate: https://github.com/BenjaminNavarro/godot-template-2d</p>\n<p>2. Tutorial</p>\n<p>WASD or Arrow keys control movement</p>\n<p>Space Key control jump</p>\n<p>Target is to catch blue cube</p>\n<p>3. Elsewhere</p>\n<p>itch.io: https://cheapmeow.itch.io/loopcube</p>\n<p>Youtube: </p>\n\n<p>4. Level Explanation<br/></p>\n<p>Level1</p>\n<p>The blue square moves in a circular motion with a fixed center and a fixed radius, taking the meaning of the rotation of the circle to point the circle.</p>\n<p>Program: Use (player to target) cross product (center to target) to calculate the rotation speed of the blue square around the center of the circle.</p>\n<p>If the player approaches the target along the tangential direction of the movement of the blue square, it will instead make the target move faster.</p>\n<p>The solution is to approach the target along the radial direction of the blue square's movement, so that the target's movement range is small.</p>\n<p>Level2</p>\n<p>Sisyphus will push a boulder from the bottom of the mountain forever and ever, and every time the boulder reaches the top of the mountain, the stone will roll back to the original point.</p>\n<p>This level is modeled after the mythology, placing blue squares where you have to push stones to reach them. Pushing the stone to the top of the mountain cannot always push down the blue square, it needs a certain angle and strength, which is where the difficulty and fun of the game lie.</p>\n<p>Program: fully hosted by physical, with minimal amount of code.</p>\n<p>Level3</p>\n<p>The direction of movement of the main character and the blue square is opposite. However, the protagonist cannot walk directly with the blue square, because there are obstacles in the middle of the map.</p>\n<p>If you want to avoid obstacles and find other ways to try to get closer to each other, you will only end up at the two poles of mutual movement forever, and the cycle continues.</p>\n<p>The solution is to hit the obstacle, according to the nature of the obstacle, get stuck on the blue square, change the position of the blue square relative to the protagonist, and finally make there is no obstacle between the two.</p>\n<p>Program: Copy and paste protagonist's control code and add a minus sign.</p>\n<p>Level4</p>\n<p>In the third level, the two are in a cycle of getting close to each other but cannot touch each other. Naturally, there is another cycle of movement away from each other. This is how the fourth level came out.</p>\n<p>There are many forms of moving away from each other, here is still the way of using gravity.</p>\n<p>Calculate the position of the protagonist relative to the center point of the map, and the opposite direction of the obtained vector is the direction of gravity that keeps the other away from the protagonist.</p>\n<p>Added Tilemap rotation and some decorations to make the gravity direction change more noticeable.</p>\n<p>Program: calculate gravity vector, Tilemap rotation, others hosted by physics.</p>\n<p>Level5</p>\n<p>Simply making a misleading layout for the player will make the player try the intuitively least effortful solution. If the solution does seem to be close to success, then the player may still be willing to try this dead end even if they find that their intuition is wrong. In the end, the player is caught in a cycle of \"failure\"-\"research this dead end, try again\"-\"fail again\"-\"research this line of thought again\".</p>\n<p>Here, following Mario's classic clearance interface, a level is made to seduce people to jump over the flagpole. The player jumps from the top of the step just short of the flagpole, but always one step short.</p>\n<p>The solution is to walk towards the borders of the map, and the player will teleport from one border to the other. This is the exact opposite direction of the dead end players have been trying to do.</p>\n<p>Program: Teleportation Boundary.</p>", "metacritic": null, "released": "2023-01-18", "tba": false, "updated": "2023-01-20T10:53:46", "background_image": "https://media.rawg.io/media/screenshots/2e3/2e397b1fcf3b83b075b46472c968d7f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "PC"], "developers": ["CheapMeow"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}