{"id": 912211, "slug": "gameartopia", "name": "Gameartopia", "name_original": "Gameartopia", "description": "<p><strong>La version HTML5 es una versión simplificada y necesita un ordenador bastante potente. Se recomienda descargar y jugar la versión instalable.</strong><br/></p><p>\n</p>\n<p>GameArtopia – Archivo Virtual Jugable del GameArt catalán,  iberoamericano e internacional, es el primer catalogo jugable sobre el  subgénero del Game Art.\r\n    </p>\n<p>Con ello presentamos obras de artistas reconocidos por el sistema del  arte que han utilizado el juego y videojuego de forma creativa,  decidiendo marcar el foco de análisis en Cataluña, España y  latinoamericano.\r\n    </p>\n<p>Con este archivo pretendemos cartografiar los múltiples territorios  que el Game Art ha intervenido e impulsado estableciendo vínculos con  comunidades, colectivos e instituciones que desde Cataluña y el resto  del mundo crean a partir de ese marco. \r\n    </p>\n<p>En el espíritu propio de Arsgames hemos decidido experimentar con el  formato del archivo aprovechando estrategias de ludificación para  acercarse a nuevos públicos y crear relaciones de colaboración con  colectivos, museos, instituciones y entidades del arte.\r\n      </p>\n<p>El juego, desarrollado en con el software Godot Engine, permite acceder a más de 30 obras de arte.\r\n <br/></p>\n\n<p>Catálogo Gameartopía<br/></p>", "metacritic": null, "released": "2023-01-18", "tba": false, "updated": "2023-01-20T11:29:12", "background_image": "https://media.rawg.io/media/screenshots/fa6/fa66f860a1225be6d67a26ae8328ce0e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "macOS", "PC"], "developers": ["arsgames"], "genres": [], "publishers": [], "esrb_rating": null}