{"id": 91229, "slug": "rxcovery", "name": "Rxcovery", "name_original": "Rxcovery", "description": "<p>You are dreaming.    </p>\n<p>You are unconscious in a hospital bed.  Your insurance only covers 30 more minutes of life support.  After that, you'll be unplugged, and that will be the end.  </p>\n<p>But all is not lost!  You have 30 minutes to explore your dream and collect dream money.  Maybe you can collect enough, and you'll live to see another day - in real life this time!  <br/></p>\n<p>It won't be easy, though.  Demonic nurses and orderlies pop up at every turn.  Fight them with weapons and magic, and recruit allies to help you along your way, including Recovery, the helpful android nurse of your dreams!  Or nightmares... </p>\n\n<p>Features: <br/></p>\n<ul><li>Recruit up to 24 cute characters of 4 different races: Humans, Witches, Beastmen, and Droids.    </li><li>Battle with swords or guns, or your own fists.  You get stronger depending on what skills you use!  </li><li>Learn spells from seven schools of magic, including Angel Magic, Candy Magic, and Crystal Magic.  </li><li>Explore the mazelike hospital for a million secrets!  Okay, not a MILLION, but there's kind of a lot.  </li><li>Take advantage of the New Game+ feature.  After a Game Over, start again with all of your acquired skills, money, and items.  It gets easier every time!  </li><li>Features all original graphics and music!</li></ul>\n<p>Also find it here, on RPG Maker dot net <br/></p>\n<p>Content Warning:  self-harm is mentioned once.  <br/></p>\n<p><strong>Rxcovery Tips (added 1/21/2018):</strong></p>\n<ul><li><strong>Try everything!  This game gives you a million ways to experiment.  If you hit a wall, change up your strategy!  </strong></li><li><strong>To get the maximum amount of character development in the least amount of time: use every type of skill.  Each skill type (fist, sword, magic, etc.) improves a different set of stats and unlocks a different branch of abilities.  If you use every skill type you've got at least once per battle, you'll become a powerhouse in no time! </strong></li><li><strong>Don't neglect the \"Punch\" skill.  It's the key to unlocking some of the most ridiculously powerful skills in the game (not for Witches or Droids though)!  </strong></li><li><strong>The \"Guard\" function will increase your Attack stat x3 for the next turn.  <br/></strong></li><li><strong>The Bazookas are a crutch for when you're in a pinch, but relying on them too much will lead to having really weak characters! </strong></li><li><strong>There is a secret character who doesn't look like much, but has a kind of magic that nobody else does.  This magic is stupid-powerful - he can learn a spell that can take down most bosses in one hit.  If you're really sick of these bosses, maybe hunt around for this secret character instead...</strong></li></ul>\n\n<p>***UPDATE 7/26/2018***</p>\n<p>Uploaded Version 6!  A few more bug fixes and cosmetic things are fixed.  See Readme for details. </p>", "metacritic": null, "released": "2017-12-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/05b/05b6223ad7d5b1db061d3b55cd97e19d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["L.O.V.E. games"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}