{"id": 912394, "slug": "brave-soul-itch", "name": "Brave Soul (itch)", "name_original": "Brave Soul (itch)", "description": "<p>English:</p>\n<p>The game is available in Spanish, English and French languages.</p>\n<p>\"Brave Souls\" is a 2D Action Rogue-Like video game inspired by \"Vampire Survivor.\"\r\n</p>\n<p>The small but brave mouse \"Mouz\" must survive endless waves of enemies for 10 minutes. To do this, he must equip himself with weapons he will obtain by leveling up.\r\n</p>\n<p>Can you survive long enough to tell your story or will you be overrun by the enemies? Don't let the enemies surround you!\r\n</p>\n<p>If you liked my work and want to support me, you can make a donation through PayPal or leave a comment about what you thought of my game. Your support is very valuable to me and will help me continue creating games. Thank you for your support!</p><p>--------------------------------------------------------------------------------------------------------------------</p><p>Spanish:</p>\n<p>El juego está disponible en los idiomas Español, Inglés y Francés.<br/></p>\n<p>\"Brave Souls\" es un videojuego 2D del género Action Rogue-Like inspirado en \"Vampire Survivor\".\r\n</p>\n<p> El pequeño pero valiente ratoncito \"Mouz\" deberá sobrevivir a interminables oleadas de enemigos durante 10 minutos. Para ello, deberá equiparse con armas que obtendrá al subir de nivel. \r\n</p>\n<p>¿Podrás sobrevivir el tiempo suficiente para contar tu historia o serás abordado por los enemigos? ¡No dejes que los enemigos te rodeen!\r\n</p>\n<p>Si te ha gustado mi trabajo y quieres apoyarme, puedes hacer una donación a través de PayPal o dejar tu comentario sobre lo que te pareció mi juego. Tu apoyo será muy valioso para mí y me ayudará a seguir creando juegos. ¡Gracias por tu apoyo!\r\n</p>", "metacritic": null, "released": "2023-01-17", "tba": false, "updated": "2023-01-20T12:56:57", "background_image": "https://media.rawg.io/media/screenshots/df1/df105d56499c4d9a7a33e3fe51fbef42.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Highest"], "genres": ["Action"], "publishers": [], "esrb_rating": null}