{"id": 912451, "slug": "nukleer-defans", "name": "Nükleer Defans", "name_original": "Nükleer Defans", "description": "Dijital oyun mekaniği dersi final projesi olarak geliştirilen Nükleer Defans isimli bu oyun android cihazlar için geliştirilmiş gerçek zamanlı strateji (RTS) ve üs savunmadır (base defense).  Erdem Kılıç tarafından geliştirilmiştir. Oyunda bulunan tüm assetler Erdem Kılıç tarafından üretilmiştir.\r\n\r\nNükleer Defans isimli bu oyunu yüklendiğim bu noktada öylece bırakmayı düşünmüyorum. Oyunun daha çok içeriğe ve daha iyi bir oynanışa ihtiyacı olduğunu düşünüyorum. Bunun için bu projeyi devam ettirme planım var. Tabi öncesinde yapmak için hazırlandığım bu projeden çok daha detaylı ve büyük oyunlar var. Öncelikle bu oyunları tamamlayıp en kötü durumda belirli bir noktaya getirip ondan sonra bu projeye döneceğim. Benim içinde daha iyi olacaktır. Uzun süredir bu projeye kafa yorduğum için ara ara çok basit şeyleri gözden kaçırıyorum. Bu yüzden bir süre ara verip tekrar bakacağım. Bu proje hakkında düşüncelerinizi ve geri dönüşlerinizi bekliyorum.\r\nOyun yüksek çözünürlük için geliştirilmiştir (2340). Eğer oyunu oynayacağınız cihazın çözünürlüğü düşük ise 1920 koduna sahip dosyayı indirmenizi rica ediyorum. \r\n\r\nOyun akışı hakkında temel  bilgiler\r\n-&gt; Oyun akışı: üzerinize doğru gelen düşmanları durdurmak ve yok etmek için market bölümünden asker veya yapı satın alıp düşmanların karşısına yerleştirmektir.\r\n-&gt; Satın alınabilecek askerlerin ve yapıların farklı özellikleri vardır.  Oyuncu bu özellikleri tespit edip çeşitli oynama şekilleri deneyerek  ve değişik stratejiler oluşturarak düşmanları engeller.\r\n-&gt; Oyun içinde toplamda 5 seviye bulunur. Her bir seviye içinde 5 küçük saldırı dalgası vardır. Bu küçük saldırı dalgalarının belirli süreleri vardır. 5 Küçük saldırının  süresi dolduğunda bulunan tur bitmiş olur ve öbür seviyenin kilidi açılır.\r\n-&gt; Oyun turları ortalama 15-20 dakika arasında sürmektedir ve her tur bir öncekinden daha zor olur.\r\n-&gt; Oyun içerisinde market sekmesinden oyuncu geliştirmeler sekmesine ulaşabilir. Oyuncu bu kısımdan sadece bulunduğu seviye için yükseltmeler yapar. Bu yükseltmeler sonucunda yeni birimleri satın alabilir hale gelir.\r\n-&gt; Kısaca döngü seviye  içinde gelen düşmanlara karşı savaşmak için asker satın al ve konuşlandır, askerler savaşırken düşmanları inceleyerek stratejiler oluştur ve turu geç şeklindedir.\r\n\r\nOyunda bulunan yapılar\r\n-&gt; Çiftlik yapısı, ortalama bir cana sahiptir ve saniye başına az miktarda para kazandırır.\r\n-&gt; Ahır yapısı, ortalamadan biraz fazla cana sahiptir ve saniye başına çok miktarda para kazandırır.\r\n-&gt; Sera yapısı, yüksek bir cana sahiptir ve saniye başına çok yüksek miktarda para kazandırır.\r\n-&gt; Ahır, çiftlik ve sera yapıları oyun içi ekonomi destekleyici yapılardır.\r\n-&gt; Sur yapısı, inşa edilebilir toplamda 4 farklı sur bulunmaktadır. Tur başladığında sadece birinci seviye sur açıktır. Diğer surlar geliştirme marketinden para ile açılır. İkinci seviyeden itibaren oyuncu surlara özel asker yerleştirebilir. Surun seviyesi yükseldikçe hem canı hemde konuşlandırılabilecek asker sayısı artar. Bu da oyundaki haritayı büyütmenin bir yoludur.\r\n-&gt; Surlar oyundaki savunma yapılarıdır. Canları çok yüksektir.\r\n\r\nOyundaki karakterler\r\n-&gt; Humocu karakteri: yakın saldırı karakteridir. Toplamda üç seviyesi bulunur her seviyede canı ve hasarı artar. İlk iki seviyesinde hayatta kalma süresi vardır. Üçüncü seviyede ise böyle bir süre yoktur. Yükseltme marketinden geliştirilir.\r\n-&gt; Sagiterius karakteri: menzilli saldırı karakteridir. Toplamda üç seviyesi bulunur her seviyede canı ve hasarı artar. Tüm seviyelerinde hayatta kalma süresi vardır. bu süre her seviyede artar (yani daha uzun süre hayatta kalır). Yükseltme marketinden geliştirilir.\r\n-&gt; Armatis karakteri: savunma karakteridir. Toplamda üç seviyesi bulunur her seviyede canı artar. Hasar vermez sadece saldırıları engeller. Hayatta kalma süresi yoktur. Yani canı azalıp ölene kadar hayatta kalır. Yükseltme marketinden geliştirilir.\r\n-&gt; Vagus karakteri: toplu hasar veren bir karakterdir. Seçildiği noktadan başlayarak bulunduğu satır boyunca önüne çıkan tüm düşmanlara saldırarak ilerler. Canı yoktur. Saldırısını tamamlayınca yok olur. Yükseltme marketinden geliştirilir. Toplamda üç farklı seviyeye sahiptir.\r\n-&gt; Karakterler geliştirildikten  sonra alt seviyedeki karakterlere erişim engellenmez. Oyuncu bu karakterleri kullanabilmektedir. Bu sayede farklı stratejiler oluşturulabilir.\r\n\r\nOyunda bulunan düşmanlar\r\n-&gt; Lacerta: sıradan insanların zombileşmiş halidir. Yakından saldırı yaparlar. Tek başına pek etkili olmasa da sürü halinde etkilidir.  Canları ve hasarları diğer düşmanlara göre azdır.\r\n-&gt; Mustelus: dönüşmüş bilim insanıdır. Uzun mesafeli saldırı yaparlar (<strong>YAKINDA EKLENECEK</strong>). Tek başına pek etkili olmasa da sürü arkasında etkilidir.  Canları ve hasarları diğer düşmanlara göre azdır.\r\n-&gt; Natrix: Dönüşmüş vücut geliştirme sporcusudur. Tek başına pek etkili olmasa da sürü oluşturma konusunda etkilidir. Daha nadir görülürler; canları ve hasarları diğer düşmanlara göre fazladır.\r\n-&gt; Sparus: dönüşmüş askerdir. Ortalamadan az sıklıkta görülür. Saldırı tipi yakınlaşıp vurma şeklindedir. Tek başına pek etkili olmasa da sürü oluşturma konusunda etkilidir. Daha nadir görülürler; canları ve hasarları diğer düşmanlara göre fazladır.\r\n-&gt; Felis: dönüşmüş obez, oyun bağımlısıdır. Ortalamadan az sıklıkta görülür. Saldırı tipi yakınlaşıp vurma şeklindedir. Tek başına pek etkili olmasa da sürü oluşturma konusunda etkilidir. Canları ve hasarları diğer düşmanlara göre fazladır.\r\n-&gt; Kekos: Dönüşmüş şehir magandasıdır. Ortalama sıklıkta görülür. Ortalama sıklıkta görülür. Canları ve hasarları diğer düşmanlara göre fazladır. Çok hızlılar. Tek başına pek etkili olmasa da sürü oluşturma konusunda etkilidir. \r\n-&gt; Köpek: dönüşmüş köpektir. Ortalamadan çok daha sık görülür. Saldırı tipi yakınlaşıp ısırma şeklindedir.Canları ve hasarları diğer düşmanlara göre azdır.\r\n-&gt; Kaplan: dönüşmüş kaplandır. Ortalamadan çok daha az sıklıkta görülür. Saldırı tipi yakınlaşıp ısırma ve pençeleme şeklindedir. Tek başına pek etkili olmasa da sürü oluşturma konusunda etkilidir. Canları ve hasarları diğer düşmanlara göre fazladır.\r\n-&gt; Fil: dönüşmüş fildir. Çok nadir sıklıkta görülür. Saldırı tipi yakınlaşıp kafa darbesi vurma şeklindedir. Tek başına fazlası ile etki oluşturabilir. Düşmanları ve binaları kolaylıkla yıkabilir ve ezebilir. Canı ve hasarı çok fazladır.", "metacritic": null, "released": "2023-01-17", "tba": false, "updated": "2023-01-20T13:23:24", "background_image": "https://media.rawg.io/media/screenshots/31a/31a974d3b665930c7e65802897507428.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Erdem Kılıç"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}