{"id": 91249, "slug": "xenomarine-itch", "name": "XENOMARINE (itch)", "name_original": "XENOMARINE (itch)", "description": "<p>\n</p>\n<p>XENOMARINE is a dark, atmospheric, sci-fi/horror themed roguelike in which you play a space marine exploring an alien-infested space station. Starting out with little more than a crowbar, you will fight to survive against over 120 increasingly powerful alien species, as you progress as far as you can through infinite randomly generated levels. </p>\n<p>With no starting classes, develop your character entirely by means of in-game choices: choose between over 70 skill levels as you gain experience from combat, and create a unique build each time you play by finding and choosing between hundreds of unique usable items and individually upgradable weapons and armor.</p>\n<p>WARNING: This game is hard! Expect to die soon and often when first starting out, and in the default 'roguelike' game mode death is permanent - meaning you will have to start again from level 1. But don’t worry: each playthrough will be different because so many parts of the game are randomly generated (in a way that’s carefully fine-tuned for balance).</p>\n\n<p>\r\n\tSee \r\n\tthe game website for more info and the development blog for details of recent updates, or \r\n\tfollow Xenomarine on Twitter\r\n</p>\n<p><strong>GAME FEATURES:</strong></p>\n<ul>\n<li> Rich, Tactical Turn-based Combat</li>\n<li>Infinite, randomly generated levels</li>\n<li>Atmospheric 3D lighting </li><li>Unique useable items such as scanners, stimpacks and directional forcefields</li>\n<li>Over 140 unique enemy types (in Alpha)</li><li>Over 70 learnable skill upgrades</li><li>Random miniquests</li>\n<li>Multiple damage types and status effects</li><li>Crafting (craft items from scrap and upgrade weapons and armor)</li>\n<li>Hack drones and turrets; deploy traps; use alien tech </li><li>Intuitive user interface, with mouse-only and keyboard-only support</li><li>Realistic sci-fi sounds including randomly generated atmosphere sounds</li></ul>\n<p><strong>WHAT CAN I DOWNLOAD NOW?</strong>\n</p>\n<p>\n</p>\n<p>XENOMARINE is currently in development, but is available to download in two different versions.</p>\n<p>With the recently released BETA the game is now complete in terms of mechanics and content, though there may be some bugs.</p>\n<p>There is also a free DEMO version, consisting of the first 3 levels of the Beta, making it a fun, playable minigame.</p>\n<p>Full release is expected to be released in Summer 2018 on PC, Mac and Linux. </p>", "metacritic": null, "released": "2016-01-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/de6/de6e25ce378e98d6de7c0b7ee181f26b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Logophil"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}