{"id": 91243, "slug": "vive-nights-at-freddys-a-vr-fan-remake", "name": "Vive Nights at Freddy's: A VR Fan-Remake", "name_original": "Vive Nights at Freddy's: A VR Fan-Remake", "description": "<p>This is a room-scale remake of the original Five Nights at Freddy's, designed for the HTC Vive (Oculus Rift with Touch support now included for testing!)  This demo includes the first three nights; in the future it will be expanded to a full 5+ nights, and may include a few twists and turns of its own...</p>\n<p>You can find some gameplay videos tracking my development progress here: https://www.youtube.com/user/Dielji<br/></p>\n<p>You can also keep an eye on my twitter for teasers and release notifications: https://twitter.com/Dielji</p>\n<p>This is a 100% free fan-remake; all credit for the original game goes to Scott Cawthon (http://scottgames.com/ and http://fnafworld.com/)  You won't fully appreciate this game unless you've played the original FNAF, so please go buy it and support Scott!<br/></p>\n<p>The models for all the Animatronics are rynfox's meshes (https://rynfox.deviantart.com) downloaded from NeonZero13 (https://sketchfab.com/danteduarteg) on Sketchfab, and the textures are a mashup of their work and that of Superkerbin (https://sketchfab.com/superkerbin); I also used Superkerbin's cupcake.<br/> These models are licensed under CC Attribution.</p>\n<p>All art and gameplay is subject to change!  Many of the texture and audio assets used in this game came from the original FNAF, and credit for them goes to Scott and/or the folks Scott licensed them from, as appropriate.  Please don't sue me!</p>\n<p>Instructions:<br/>Using the trigger of the Vive controller, remove the time card for the night you wish to play from the time card receptacle located to the right of the punch-clock.  Insert your time card into the slot on the underside of the punch-clock, then firmly press the button on the top of the punch-clock to begin the night.  The monitor in front of you is used to view the security camera feeds.  Hold the power button down to keep the monitor on (gotta conserve power after all!) and press the buttons below the monitor to switch feeds.  There are buttons next to the doorways on your right and left to control the doors and hallways lights.  Good luck!</p>\n<p>Note: Other people watching your gameplay will see a map showing the locations of the animatronics and other useful information.  If you prefer to keep your viewers in suspense, you can toggle this display on and off by tapping the \"M\" key on your keyboard.</p>", "metacritic": null, "released": "2017-05-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/022/022fd6352630c7fd11513bdc59c5e104.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dielji"], "genres": [], "publishers": [], "esrb_rating": null}