{"id": 91259, "slug": "super-mario-power-star-frenzy", "name": "SUPER MARIO Power Star Frenzy", "name_original": "SUPER MARIO Power Star Frenzy", "description": "<p><strong>PSF WEBSITE</strong><strong>:</strong><br/>https://www.powerstarfrenzy.com<br/><strong>DISCORD SERVER:</strong><br/>https://discord.gg/V4UcHAg<br/><strong>YOUTUBE CHANNEL:</strong><br/>https://www.youtube.com/c/randomnick<br/><strong>TWITTER:</strong><br/>https://www.twitter.com/randomnick64</p>\n\n<p>Power Star Frenzy combines many of the great aspects from previous Mario games, and adds it into one amazing experience! It features things like New Super Mario Bros.' excellent level design and 2 player versus mode, Super Mario 64's Power Stars and exploration, Super Mario Galaxy's platforming, Mario and Luigi's humor and characters, and so much more.</p>\n<p>Power Star Frenzy is based on pure exploration and adventure, and isn't just get from Point A to B like in most recent Mario games. This fangame brings Mario back to his roots, and implements some new abilities and gives the Mario formula a fresh new feel!</p>\n<p>This fangame started developed all the way back in September of 2014, but was a completely different fangame that you see before you right now! So much has changed over the years, and things are only going to get better and better! But now since it's 2018 I started ported the game over onto a new engine. Rather than making it using GameMaker 8.1, I'm porting it over to GameMaker Studio.</p>\n<p>My goal is to make one of the most creative, funnest, and most anticipated fangames of all time! So please give the game a shot and tell us what you think! If you like you can join our Discord server for regular updates, and talk among the Power Star Frenzy community!</p>", "metacritic": null, "released": "2018-04-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/701/701ee5714ab0de068e0e5712d7c77cc6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Random.NICK"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}