{"id": 912533, "slug": "bartles-mission", "name": "Bartle’s Mission", "name_original": "Bartle’s Mission", "description": "<p><strong>Bartle’s Mission is our Final Game Project for the BUG Game Lab (Bahçeşehir University Digital Game Design Undergraduate Program).</strong><br/></p>\n<p><strong>Bartle’s Mission is an isometric fast-pace shooter game. By combining skills beyond our control in different ways, we try to stop the robot uprising.</strong></p>\n\n<p><strong>Gameplay: </strong>\n</p>\n<p>We control the security robot in a factory where artificial intelligence robots are rising. We have different abilities that can be attached to the surfaces of our bodies, which are cube-shaped, but these abilities are not under our control. These are abilities that can be activated by themselves. Combining these abilities in different ways, we fight by taking different approaches against the enemies.</p>\n\n<p><strong><strong>Main Character Bartle:</strong> </strong></p>\n<p>A character that can be equipped with skills on 3 different surfaces, and whose upper body and lower body move differently from each other. All of the skills attached to it have different usage schemes. It has a structure that can move itself with its lower body and can change the direction of its surfaces with its upper body.\r\n</p>\n\n<p><strong>Skills: </strong>\n</p>\n<ul><li><strong>Force Shield Skill: </strong>An energy shield that repels incoming bullets and protects the character. Its active time is 3 seconds. The recharge time is 10 seconds.\r\n  </li><li><strong>Laser Beam Skill: </strong>An ability that when active fires a single laser beam damaging enemies. Its active time is 3 seconds. The recharge time is 10 seconds.\r\n  </li><li><strong>Portal Skill: </strong>Portal Ability: When the skill is activated, the player able to switch between portals that open to 2 random locations. Portals open time is 5 seconds. Recharge time is 10 seconds.   </li><li><strong>Speed Skill: </strong>When the ability is activated, the character's speed is doubled and it moves 2 times faster. Active time is 5 seconds. The recharge time is 10 seconds.\r\n</li></ul>\n\n<p><strong>Enemies:</strong></p>\n<ul><li><strong>Kamikaze:</strong> An enemy robot type following us. They come and attack the player. When they enter main character's area, they explode and damage us. Each damage takes 25 health.\r\n  </li><li><strong>Turret:</strong> The type of enemy that stands still and targets the player. They shoot normally. Each damages takes 25 health.\r\n  </li><li><strong>Pyramid:</strong> The type of enemy that stands still and targets the player. An enemy type that rotates 360 degrees and shoots lasers from 4 different surfaces. Each damage takes 25 health.\r\n  </li><li><strong>Armed Drone:</strong> An enemy type with an AI that moves by patrolling and targeting the player. An enemy with standard laser fire. Each damage takes 25 health.\r\n  </li><li><strong>Beam Column: </strong>An enemy type that shoots beam waves from the underside of his structure. Each damage takes 25 health.\r\n</li></ul>\n<p> \r\n  </p>\n<p><strong>Main Story:</strong></p>\n<p>A story set in America in the year 2108. Raven technology company is now number 1 in the world in robot production. They manufacture and sell different service robots all over the world. The R-100 class were the first class of home service robots. These robots, which had a human-like appearance and structure, were only robots that acted according to the commands of their owners and had no other function than housework. Then a class of robots was developed specifically for the military. R-200 class. This class was much faster, durable and stronger than many other robot classes. However, their intelligence and ability to react to events were not yet at the level the company wanted. They also began to develop the R-300 class. They worked to make it both stronger and smarter than the R-200 class. They designed a cube body and a robot structure that can move much faster. They developed a modular class of robots where different tools and weapons can be attached to 3 different surfaces. These robots were both much more intelligent and much stronger due to their modular structure. The character we control is a robot with the R-300 class and its name is Bartle. One day, as a result of a systemic error, many of the robots riot and try to create chaos and start a rebellion against the company. We are a security robot that stops this uprising. But there is an issue. Because of the systemic error, the tools attached to the 3 surfaces are not under Bartle's control. It cannot control these skills in any way. They are all became self-activated. So, Bartle's job is not easy.</p>\n\n<p><strong>Team:</strong></p>\n<p>Barış Tolon: Game Design, Sound Design</p>\n<p>Kerem Aktuna: Game Programming</p>\n<p>Emre Elbir: 3D Art, VFX Art</p>\n<p>Yasemin Beddal: 3D Art, UI Art</p>\n<p>Yağız Erdemir: Level Design</p>\n\r\n\r\nW,A,S,D: Moving \r\nQ: Rotate Body\r\nE: Interaction", "metacritic": null, "released": "2023-01-17", "tba": false, "updated": "2023-01-20T14:01:54", "background_image": "https://media.rawg.io/media/screenshots/2a4/2a4b65b6a4504d84d077285cda128831.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BarisTolon"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}