{"id": 912608, "slug": "ananse", "name": "Ananse", "name_original": "Ananse", "description": "<p>Ananse is an exciting new video game that puts you in the shoes of the legendary West African trickster, Ananse.<br/></p>\n<p>Explore the mystic world of West African mythology with Ananse in an all new experience that combines the rich traditions of West African folklore with the modern world of video gaming. Test your reflexes with fast-paced movement, battle enemies in frantic action sequences, and join forces with powerful allies. With stunning graphics, intense combat, and an unforgettable story, this is the perfect way to experience the epic tales of Ananse.</p>\n\n\r\nOVERVIEW\r\n\n\r\nGameplay:\r\n<p>In Ananse, players will face off against ferocious monsters, powerful bosses, and other formidable foes. As they progress through the game, they’ll find themselves in different realms, each with it's own unique challenges. In these realms, they will meet unique characters, many of whom are based on characters from West African folklore.</p>\n\r\nGraphics:\r\n<p>The game features stunning 3D visuals that bring the world of Ananse to life. The comic book inspired environments are detailed and immersive, allowing you to explore different realms like they were ripped out of a comic book page.</p>\n\r\nSound:\r\n<p>The game's vibrant, fast-paced soundtrack will keep your heart racing as you explore Ananse's unique world. The sound design creates an atmosphere that is both intense and atmospheric, perfect for the world of Ananse. Every sword clash, spell cast, and explosion will sound like it's right in front of you!</p>\n\r\nControls:\r\n<p>Ananse features intuitive controls that are easy to learn and use, utilizing a mix of keyboard and mouse inputs or you can just plug in a controller and play. Take control of Ananse, the legendary spider-trickster and use his magical powers and special attacks with on-screen guides that can be turned off at anytime. <br/></p>\n\r\nSpecial Abilities:\r\n<p>The game features combat elements that require players to use spells, charms and special abilities to battle enemies. Ananse has a number of special abilities that can be triggered with the arrow keys as indicated in the prototype. You can fly, summon clones, become invisible or turn into the legendary spider!</p>\n\r\n\r\nPROTOTYPE\r\n<p>This video game prototype is a work in progress and should not be considered a finished product. The game is currently in the early stages of development and we are working towards creating a unique and engaging experience for our players. We are focusing on creating an immersive and beautiful world for Ananse to explore, as well as ensuring that the controls are smooth and intuitive.</p>\n<p>We look forward to sharing more updates on our progress as we move closer to the vertical slice. Stay tuned for more information!</p>\n\n\r\nDrop Your Comments\r\n<p>We look forward to hearing your feedback and suggestions as the game progresses. Let us know what you think and what you'd like to see in the future!</p>\n\n\n\n\n\n<p>While Ananse is in pre-production, the project is yet unfunded. If you believe in this project, consider becoming a supporter on Patreon.</p>\n\n\n\n\n<p>You can tune in to the Unchained Universe on Youtube, Twitter, Instagram, Facebook, TikTok and Twitch.<br/></p>", "metacritic": null, "released": "2023-01-17", "tba": false, "updated": "2023-01-20T14:34:33", "background_image": "https://media.rawg.io/media/screenshots/595/595216c56a186c5dab1a1506588d5d18.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mathias Asamoah"], "genres": ["Action"], "publishers": [], "esrb_rating": null}