{"id": 912721, "slug": "rehabilitation-at-lost-drift", "name": "Rehabilitation at Lost Drift", "name_original": "Rehabilitation at Lost Drift", "description": "<p>\"Rehabilitation at Lost Drift\" is a transmedia horror game in which you'll have to help an alien to overcome his traumas and addictions using your cell phone and your creativity. The player will have access to the traumatic memories of GB-64, but in order to uncover his past, he must pay attention to the clues he left behind in our present. These are found in the streets of Buenos Aires and in their social networks. GB-64 is part of our society. Help him.<br/></p>\n<p>GB-64 bottomed out. The past haunts him and every minute in space becomes unbearable. His addiction to injection drugs worsened after the suicide of his friend BS-97 and his body is on the brink of collapse. Chroma (GB-64's friend and producer) locks him in different rooms of the ship to help him rehabilitate. The player will take control of GB-64 to help GB-64 overcome his addiction as he tries to escape the rooms before going berserk.</p>\r\n\r\nFeatures\r\n<p>-The player has a \"withdrawal\" bar that will go up as time progresses.</p>\n<p>-This bar rises faster when the player is not interacting and slower when they are looking for information on computers or manipulating objects to solve a puzzle.</p>\n<p>- The bar drops quite a bit (positive) when the player finds personal information about GB-64.</p>\n<p>- When the bar is too high: tense sounds, on-camera filter, dimmed lights, appearances by BS-97, etc.</p>\n<p>-The player will be able to store objects in his inventory and use them, while the graphic pieces will be able to scan them to save them in his composition screen.</p>\n<p>-You can use a cell phone to decipher puzzles.</p>", "metacritic": null, "released": "2023-01-16", "tba": false, "updated": "2023-01-20T15:28:25", "background_image": "https://media.rawg.io/media/screenshots/7fe/7fe6887002a5252e4b816214609918a1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GetOut Studio"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}