{"id": 912754, "slug": "avici-hell", "name": "Avīci hell", "name_original": "Avīci hell", "description": "<p>In October 1973, Ingrid Olderck entered DINA with the rank of lieutenant and joined the institution's women's school, where some 70 women were tortured and repressed as opponents of the military dictatorship. In 1974, DINA created the first detention centres, including Venda Sexy, where Ingrid was tortured and raped using a dog named \"Volodya\".</p>\n<p>She trained her dog \"Volodya\" to commit violent and sexual violence against political prisoners, both male and female. Later, she left the intelligence agency for unknown reasons, and she was assassinated shortly after and was shot in the brain, but she did not die strangely. She was later brought to court for her atrocities, but she said she was shot in the brain and lost her memory, so she went unpunished. The bullet in this person's brain has never been removed, and finally died of health problems at the age of 57, and has not been punished.</p>\n<p>”Avīci hell“is one of the hells (Naraka) in Hinduism and Buddhism, In Buddhism, it is the lowest level of the Naraka or \"hell\" realm, with the most suffering, into which the dead who have committed grave misdeeds may be reborn.</p>\n<p><strong>Her relationship with the dog, her body, her fears and her frustrations reveal a deep division between her and the country. </strong><strong>I made this game as a satire of her and as an exploration of human rights.</strong></p>\n<p><strong>Reference: </strong></p>\n<ol><li> Porteous, Clinton. \"Chile's Pinochet victims testify\". BBC.\r\n</li><li>Cádiz, Pablo. \"Fallo histórico contra 'Venda Sexy', el centro de torturas a mujeres de la dictadura de Pinochet\". <em>El País</em> (in Spanish). \r\n</li><li>\"La Venda Sexy, el centro de tortura de Pinochet contra la mujer que se vende al mercado inmobiliario\".\r\n</li><li><em>Informe de la Comisión Nacional de Verdad y Reconciliación</em> (in Spanish). Santiago de Chile: Reedición de la Corporación Nacional de Reparación y Reconciliación. 1996. p. 468.\r\n</li><li><em>nforme de la Comisión Nacional de Comisión Prisión Política y Tortura</em> (in Spanish). Santiago de Chile: Ministerio de Interior. 2005. p. 443.\r\n</li><li> \"Chile. Mañana, miércoles 11, el centro de torturas y exterminio Ex Venda Sexy será declarado Monumento Histórico\". <em>Kaos en la red</em> (in Spanish). \r\n</li><li>Vargas, Vanessa \"Exigen que el Estado compre \"Venda sexy\", el lugar donde reinó la violencia político sexual de la dictadura\". <em>El Ciudadano</em> (in Spanish).\r\n</li><li> \"Realizan velatón en memoria de ex-integrante de la DINA\". EMOL. 11 March 2001.\r\n</li><li>\"Item 000494 - Ingrid Olderock\". <em>Museo de la Memoria y los Derechos Humanos</em>. \r\n</li><li> \"\"La mujer de los perros\": La historia de impunidad y barbarie de Ingrid Olderock en la DINA\". <em>El Dínamo</em>. 18 November 2014. \r\n</li><li>Donoso, Claudia (4 March 2020). \"A la vuelta de la esquina: Una entrevista con Ingrid Olderock\". <em>Ecfrasis</em>. \r\n</li><li>(Guzmán, 2014 &amp; p=175)\r\n</li><li>Nanjari, Mónica (2022-02-14). \"\"Bestia\": la siniestra hija de alemanes que inspiró un corto nominado a un Óscar\". <em>Deutsche Welle</em> (in European Spanish). \r\n</li><li>Fajardo, Marco (10 September 2014). \"El horror de Ingrid Olderock, la más siniestra de la DINA\". <em>El Mostrador</em>.\r\n</li><li> \"Entrenó perros para violar y mandó a torturar a su hermana: quién era Íngrid Olderöck\". <em>Clarín</em>. 2022-02-08. \r\n</li></ol>", "metacritic": null, "released": "2023-01-16", "tba": false, "updated": "2023-01-20T15:42:13", "background_image": "https://media.rawg.io/media/screenshots/dd3/dd3b1e42533f86264d4ab9cb6d944a1b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Lianqi"], "genres": [], "publishers": [], "esrb_rating": null}