{"id": 913191, "slug": "yin-mi-ren-wu-the-secret-ops", "name": "隐秘任务 the Secret Ops", "name_original": "隐秘任务 the Secret Ops", "description": "\"The Secret Ops\" is an independent third-person shooter game made by one person. The game has a compact plot and moderate difficulty. Perfect for all fans of indie games and shooters.<br/>\r\nAlthough the game is an independent game made by individuals, the relevant functions are complete, and the use of facial capture technology, as well as the powerful support of Metahuman and Unreal Engine for the performance, make the CG of the game even better.<br/>\r\ngame background<br/>\r\nThe background of this work takes place in the near future. A super-government secret agency-UNBSEPA caused accidents due to insufficient research on unknown alien technology, resulting in a small-scale invasion of alien races. Players will act as agents of the agency and will eliminate the danger posed by the accident. You will have enough ammo to face different enemies, remember, some enemies are very cunning, they know to hide in the shadows.<br/>\r\ngame scene<br/>\r\nThe game scene of this work can be roughly divided into 5 major areas, namely the \"office area\", which is the office area for civilian staff. Typically file management, operational deployment, and meeting areas. A secret subway line handles all entry and exit.<br/>\r\nThe second area is the \"scientific research area\", which is a reverse engineering area, which converts alien technology into technology that can be applied by earth's civilization.<br/>\r\nThe third area is the \"experimental area\", which is an area for research on the discovery of certain abnormal civilizations.<br/>\r\nThe fourth area is the \"weapon development area\", which is used to develop weapons and equipment that can be applied to generation in order to deal with sudden disasters.<br/>\r\nThe fifth area is the \"Core Research Area\", a secret buried in this area, which players will discover by themselves at the end.<br/>\r\nthe enemy you encountered<br/>\r\nAccording to first-hand accounts, four different alien races were present in the leak. There are two kinds of IQ that are not too high, and the latter two are very smart. They are crafted to evade your pursuit.", "metacritic": null, "released": "2023-01-21", "tba": false, "updated": "2023-01-23T02:48:07", "background_image": "https://media.rawg.io/media/screenshots/8de/8de31e242f9d274b6733db2137053112.jpg", "website": "https://space.bilibili.com/38823444?spm_id_from=333.1007.0.0", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 299, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PeterJuee"], "genres": ["Adventure", "Indie"], "publishers": ["PeterJuee"], "esrb_rating": null}