{"id": 913270, "slug": "lockdown-2024", "name": "Lockdown 2024", "name_original": "Lockdown 2024", "description": "<p>Lockdown 2024 is a point-and-click adventure game with a linear story line. It is about a young man (18) who’s lived a very sheltered life. His father and stepmother allowed no extracurricular activity, no internet, and no fraternizing with the opposite sex. A new strain of Covid is discovered and the government has instituted a new lockdown. Our hero’s father passed away during the first pandemic and now he’s the only man in a house full of women. He will need to attend university (college) on-line, help the women around the house and discover some secrets about his and his family’s past.<br />\nFeatures:<br />\nOver 5000 images<br />\n300+ Animations<br />\nAll images rendered in 4k (3840x2160)<br />\n4 Engaging (skippable) mini-games; Lock picking, Fix the pipes, Computer Hacking, Basketball<br />\n3 Preset Options of play style to allow you to play as you want (can be fine-tuned in game)<br />\nOver 15 exciting scenes to unlock<br />\n23 separate locations to exploreThe housemates<em>Indicates a relationship that is customizable.<br />\nYour stepmom</em>, Devon, is the matriarch of the house. She’s very strict and sometimes overbearing.<br />\nMaria, your step-grandma<em>, is Devon’s mother. She’s kind and loving and serves as a teacher to our hero.<br />\nAmber, you stepsister</em>, is Devon’s eldest daughter. Amber is fashion conscious and more worldly than our hero. She’s also really mean.<br />\nEmma, your other stepsister*, is Amber’s younger sister. She’s sweet and innocent and is the same age as the main character.<br />\nJasmin is friends with Amber. She’s sporty and very promiscuous.<br />\nNaomi is an exchange student and friends with Emma. She likes computers, cosplay, and other geeky stuff.<br />\nThe live-in maid Isabella starts working in the house just as the outbreak begins.</p>", "metacritic": null, "released": "2023-01-20", "tba": false, "updated": "2024-03-06T23:32:34", "background_image": "https://media.rawg.io/media/games/b6b/b6b94c4089497458a9321c6452db594c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 301, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["480 Games"], "genres": ["Adventure"], "publishers": ["480 Games"], "esrb_rating": null}