{"id": 913258, "slug": "starlite-defender-of-justice-ultimate-hd-edition", "name": "STARLITE: Defender of Justice Ultimate HD Edition", "name_original": "STARLITE: Defender of Justice Ultimate HD Edition", "description": "STARLITE: Defender of Justice Ultimate HD Edition<br/><br/>In the year 2170 an alien threat known as the CYRONS invaded the planet Earth with intent of hostile takeover. Using Alien spores launched from their home world, the Cyrons have managed to break through Earth's defense force and have infected the human race with a deadly virus that has killed nearly one third of human life on the planet.<br/><br/>Those who survived took shelter underground or anywhere they could while many others managed to flee the planet, making the great journey to the nearest exoplanet; Wolf Alpha 1061.<br/><br/>Those who didn't die from the virus were turned into mindless Zombies attacking anyone that was left, further helping spread the virus.<br/><br/>On top of that the alien spores contained a bacteria that was bio engineered with advanced technology to infect all technological systems causing world wide disasters and often turning security droids against the very humans they were supposed to protect.<br/><br/>The cops and the military were quick to fall... So the world's Governments formed an alliance.<br/><br/>Sharing all of their resources they decide to create a new organization called STARLITE.<br/><br/>These would be the best of the best soldiers fighting back with advanced technology and new enhanced GENETIC ALTERNATIONS that made them stronger, faster and more adaptable for a battle of this magnitude.<br/><br/>Humanity will not give up without a fight… and the fight has just begun...<br/><br/>We are . . . THE STARLITE AGENTS: Defenders of Justice!!<br/><br/><br/>- Top Down hack &amp; slash action game<br/>- Free flow combo system featuring Psi-weapons<br/>- Play as AGENT 69 - one of STARLITE'S tops agents<br/>- Collect POWER-UPS to unleash devastating blows on the UN-dead<br/>- Collect points to access new Costumes<br/><br/>NEW ULTIMATE HD EDITION: <br/><br/>- NEW UPDATE HD graphics<br/>- NEW Updated Combat SYSTEM +<br/>- NEW Costumes<br/>- NEW COMBOS<br/>- NEW Attacks<br/>- NEW enhanced targeting system<br/>- NEW Updated HD LIGHTING (REAL TIME) +<br/>- NEW ENEMY VARIATION +++<br/><br/>STARLITE [PC] versus STARLITE [PS4]", "metacritic": null, "released": "2023-01-22", "tba": false, "updated": "2023-01-23T04:17:00", "background_image": "https://media.rawg.io/media/screenshots/001/00124a7bb9d1be2dbac982da35264203.jpg", "website": "https://www.xcogames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 341, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Xcogames"], "genres": ["Action", "Adventure"], "publishers": ["Xcogames"], "esrb_rating": "Mature"}