{"id": 913219, "slug": "human-or-not", "name": "Human or Not", "name_original": "Human or Not", "description": "Noah Stevenson is an immigration officer on a future Earth. His job is to investigate passengers entering Earth and decide if they are human or not. While most aliens can enter Earth legally, some alien species are not welcomed. Unwanted aliens may choose to trick the immigration authorities and impersonate humans. These aliens must be detected and arrested. However, things are not as easy as they seem.<br/><br/>There are several interrogation methods available to Noah to carry out his work. Some encounters can be scary, some can be funny, and sometimes it can feel tedious, but Noah needs this job to make enough money to reunite with his sister who resides in one of the human colonies in space.<br/><br/>Will Noah choose to do his job, earn the money, and leave Earth? Or maybe he has other plans?<br/><br/>\"Human or Not\" is a casual game that puts the player in the shoes of an immigration officer and allows them to decide who can enter Earth. Between shifts, the player meets different characters and makes decisions about Noah's life.<br/><br/>Features:<br/><ul><li> Interrogate passengers in your high-tech booth. A glass barrier is included.<br/></li><li> Press the \"HUMAN\" or the \"ALIEN\" button for each and every passenger you inspect.<br/></li><li> Use different inspection methods as they become available.<br/></li><li> Speak with different NPCs, including your sister.<br/></li><li> Earn cash.<br/></li><li> Choices are meaningful!<br/></li><li> Endings are multiple.<br/></li><li> Riding the tram is free. Space flights are not.</li></ul>", "metacritic": null, "released": "2023-01-20", "tba": false, "updated": "2023-01-23T03:22:48", "background_image": "https://media.rawg.io/media/screenshots/5a3/5a38dfc731e08fc1c81b64b48d1b9bc9.jpg", "website": "https://eis-interactive.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Haguy Eis"], "genres": ["Casual", "Indie"], "publishers": ["Eis Interactive"], "esrb_rating": null}