{"id": 913227, "slug": "tristiarestore", "name": "Tristia:restore", "name_original": "Tristia:restore", "description": "<h3>Product Overview</h3>\"Tristia: restore\" is a new title planned for the 20th anniversary of the release of the original \"Tristia of the Deep-blue Sea.\"<br/>Following the character design and worldview of E-ji Komatsu, who has attracted many fans, the heroine Nanoca's town-building part is expressed in an intuitive action game that anyone can easily enjoy.<h3>Story</h3>To rebuild the deserted marine city of \"Tristia,\" the genius inventor girl \"Nanoca Franca\" begins her mission to revitalize the city!<br/>Invent and create items from a variety of materials and develop Tristia within the requested deadline!<h3>Gameplay</h3>Nanoca's workshop, where she has come to revitalize the city, is constantly bombarded with requests to invent and create items.<br/>Not only does she has to use her brain, but sometimes she is pressed for time and has to run left and right around the workshop to fulfill the requests.<h3>Staff</h3>Planning &amp; Production: KOGADO STUDIO, INC.<br/><br/>Character design: E-ji Komatsu<br/>Director: Hinata Anan <br/>Scenario writer: Naoyuki Takeuchi<h3>Voice Cast</h3>Nanoca Flanka: Ayako Kawasumi <br/><br/>Stuka: Jurota Kosugi <br/>Faury Carat: Marina Ono <br/>Nene Hampden: Sakura Nogawa <br/>Reygurett Kutanie: Kanoko Hatamiya <br/>Rafarew: Akane Tomonaga<br/><br/>※Mouse support is not available", "metacritic": null, "released": "2023-01-20", "tba": false, "updated": "2023-01-23T03:32:44", "background_image": "https://media.rawg.io/media/screenshots/2c6/2c641387658e7472a2b128fbb525c1e6.jpg", "website": "https://tristia.kogado.com/restore/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KOGADO STUDIO"], "genres": ["Action"], "publishers": ["Komodo"], "esrb_rating": null}