{"id": 913224, "slug": "olgob-the-bold", "name": "Olgob The Bold", "name_original": "Olgob The Bold", "description": "Olgob The Bold is a <strong>Metroidvania Soulslike</strong> by a <strong>solo dev</strong>.<br/><br/>The story of an orc from a small tribe in the Greenskin Barrens. From a <strong>blue-collar, working-class family</strong>, hunting down <strong>billionaire Bear Lords</strong> who have taken control of the world by <strong>exploiting</strong> the labour of <strong>poor orcs</strong>. <br/><br/>Ruling with cruel <strong>taxes up to 75%</strong> for small business owners. And letting their bear friends register companies in <strong>tax havens</strong> in the Forgotten Lands. Olgob is the <strong>Strong Orc Leader</strong> they need to come and fix all their problems. <br/><br/>Play and help Olgob give power back to the people by <strong>overthrowing the government</strong> of the oppressive Bear Lords. <br/><br/><br/><br/>Join Olgob on his journey through the Mutating Castle to collect <strong>20 bear asses</strong> for a stranger in the woods... <br/><br/>That is it. This is your quest. The only quest you have in this game. Just the one. <strong>Collect 20 bear asses</strong>. <br/><br/><h3>Mutating Castle</h3><br/>Players will traverse the Mutating Castle with <strong>interconnected areas</strong>, and changing pathways. Your world will change as you progress through the story.<br/><br/><h3>Story and Lore Rich World</h3><br/>Discover the origin and story of the Bear Lords and their ascension as you piece together the secrets of the Mutating Castle.<br/><br/><h3>Slow Deliberate Combat</h3><br/>Nothing is claimed easily. You will scratch and claw to victory every step of the way. You may say it is... just like <strong>Dark Souls</strong>.<br/><br/><h3>Colorful Cast of NPCs</h3><br/>This game is all about the <strong>power of friendship</strong>. if you cannot do something alone, there is always someone who you can passively talk to and they will do nothing.<br/><br/><br/><br/>I plan on releasing free <strong>DLCs</strong> depending on how well this does.<br/>You can contact me at crabjuicegaming@gmail.com regarding any issues you may encounter in the game.", "metacritic": null, "released": "2023-01-20", "tba": false, "updated": "2023-01-23T03:29:11", "background_image": "https://media.rawg.io/media/screenshots/0d9/0d9fdbedc7c34a6a0b830e991962da81.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Big Baby"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Big Baby"], "esrb_rating": null}