{"id": 913209, "slug": "nope-nope-nope-nurses", "name": "Nope Nope Nope Nurses", "name_original": "Nope Nope Nope Nurses", "description": "<h3>FEATURES</h3><ul><li>A visual novel about a hospital where all the nurses are the worst<br/></li><li>Full Japanese voice acting by seasoned professionals</li></ul><h3>SUMMARY</h3>Yamada falls into the clutches of the “OG Three,” a triple threat of veteran nurses!<br/><br/>■Meet the sinister trio that even the other nurses fear!<br/>“Begrudging Nurse” Tachibana, “Insidious Nurse” Kurokawa, “Violent Nurse” Yamaguchi, and “Demotivational Nurse” Hiramatsu.<br/>Just like the rumors said, this hospital’s got nothing but nurses with the worst personalities.<br/><br/>I had no idea there could be anybody worse than them!<br/>These three aren't just nasty… They’re pure evil.<br/><br/>Some are obsessive, some wicked, and others unpredictable.<br/>They're the absolute worst—and that's what makes them the best!<br/><br/>■A Story That’s Gaining Speed!<br/>Man, all I did was break some bones and get hospitalized.<br/>And yet everyone treats me like the scum of the earth!<br/>Plus, recently things here have been feeling off.<br/>Like there’s a dark cloud hanging over you no matter where you go…<br/><br/>The basic gameplay loop is that these awful nurses give main character Yamada a hard time, over and over again.<br/>But they're very creative, so it never gets stale—and this time, the story that’s been waiting in the wings is finally taking center stage.<h3>CHARACTERS</h3><br/>“Obsessive Nurse” Numajiri<br/>Voice: Kazuha<br/>One of the veteran nurses that make up the “OG Three” at the hospital I’m in.<br/>Out of all the other nurses here, I’m scared of her the most.<br/>Since the day she became my primary nurse, she has been incessantly whispering horrible things into my ear.<br/>And the more I show it's getting to me, the happier she gets. I really wish she would leave me alone.<br/>However, Numajiri seems to like me or something because whether I’m sleeping or going to the convenience store, she always follows me around.<br/><br/><br/>“Black-Hearted Nurse” Kiritani<br/>Voice: Ren Toyotaka<br/>Another member of the “OG Three.”<br/>When Yamaguchi told me my primary nurse for this week would be Kiritani, she looked at me like she was pitying me.<br/>I heard that Kiritani is a former delinquent who was feared by everyone in her hometown…<br/>But I’m not gonna trust the rumors! After all, Kiritani seems nice, inside and out. Maybe a bit frail-looking, but a real beauty with presence. Calling someone like that a former delinquent has got to be some kind of terrible joke. She actually treats me in the nicest way possible…<br/><br/><br/>“Psychopathic Nurse” Tendo<br/>Voice: Miru<br/>Tendo is the last of the “OG Three.”<br/>She’s an eccentric person who’s always laughing. Is she always in a really good mood, or is she just completely cracked...?<br/>I think that rather than seeing me as a patient that needs assistance, she sees me more as a rarity and thus a friend worth playing with... or maybe a toy? <br/>Any way you slice it, she’s a very dangerous person with no common sense.<br/>But since she’s the daughter of the head nurse who basically runs this hospital, no one can tell her off.<br/>Will I make it to my discharge date safely?", "metacritic": null, "released": "2022-04-27", "tba": false, "updated": "2024-02-19T06:52:16", "background_image": "https://media.rawg.io/media/screenshots/ef0/ef0a164562c187bef1d41399819ef3de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dark One!"], "genres": ["Adventure"], "publishers": ["Shiravune"], "esrb_rating": null}