{"id": 913266, "slug": "image", "name": "Image", "name_original": "Image", "description": "WARNING: This game contains flashing lights, loud sounds, and lots of jumpscares.<h3>Description</h3>Image is a first-person psychological horror game. Explore haunted, ever-changing environments in an atmospheric, confused world and enjoy a truly terrifying gaming experience.<h3>Environment</h3>Image takes place in a haunted house full of traps. The game features lots of interactions with objects in the house to make you feel better while playing. At the same time, the game itself is very random and sometimes confusing. You will wander through long corridors that take you to places you can't even imagine. Each room in the house will show you its spooky story, which will immediately draw you into the confusing and creepy world of Image. The game takes you through a handful of strange places, only to reveal the truth.<br/><br/><br/><h3>Storyline</h3>The Image story begins with you being in the house at night. You play as a 10-year-old boy named Sam who falls asleep watching TV while waiting for his family. Sam is home alone, waiting for his family to return. But it's been too long. Sam decides to go looking for them. But he discovers that he's not home alone. In the first few moments you are introduced to the paranormal phenomena that have begun to occur in the house. The main task of The Picture is to find all five artifacts and build a pentagram, which will then open the way to unravel the mystery and find your family.<br/><br/><br/><h3>Entities</h3>The entities that are in the house can't hurt you, they're ghosts that just haunt you or observe what you're doing. Entities only want to frighten you into trying to find the truth. Entities cause paranormal phenomena that rebuild and change the whole house. Because of this, the game seems confused and random.<br/><br/><br/><h3>Gameplay</h3>The image game is controlled by a keyboard and mouse. There are no weapons that would allow you to defend yourself. You'll be able to capture key elements, interact with the environment, and look for things that can help you uncover the truth 34.<br/><br/><br/><br/><br/>Watch out for the 34.", "metacritic": null, "released": "2023-01-20", "tba": false, "updated": "2023-01-23T04:26:29", "background_image": "https://media.rawg.io/media/screenshots/a90/a90f8c5af27fe6b6bbf0927b4eec038f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 260, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Galacic Games"], "genres": ["Action", "Adventure"], "publishers": ["Galacic Games"], "esrb_rating": null}