{"id": 913332, "slug": "wildlands-fmlad", "name": "WildLands (Fmlad)", "name_original": "WildLands (Fmlad)", "description": "<p><strong>Created by Fmlad for the 48 hour Minijam 124: Warmth Gamejame. Enjoy!</strong><br/><br/>As you venture deeper into the woods, the mist thickens and the trees loom taller. The ruins you stumbled upon seem ancient, with moss-covered stones and ivy crawling over the crumbling walls. The bonfires, unlit for who knows how long, are scattered throughout the ruins, their ashes cold and forgotten. <br/><br/>You can't shake the feeling that you're being watched, as if the very trees themselves are keeping watch over these sacred ruins. But there's also a sense of mystery and intrigue that draws you further in, as if the ruins hold secrets just waiting to be uncovered.<br/><br/><strong>You might want to run the windows version if you are suffering with poor performance in the WEBGL.</strong><br/><br/><strong>- Final Note; </strong>Apologies if there are any hard/soft lock game breaking bugs, please notify me if you encounter any and i will fix up asap. There is a lot thrown into this gamejam and It might be my best work for scope, however due to the size, bugs may be present, I did my best after 100's of playthroughs to squash all of them.<br/><br/><strong>Controls:</strong><br/>WASD = Movement<br/>E = Interact<br/>Mouse = Clicking some UI.<br/><br/><strong>Credits:<br/></strong>Art - Fmlad<br/>Coding - Fmlad<br/>Music - Listed below &amp; Freesound.<br/><br/>\"Spirit of the Girl\" Kevin MacLeod (incompetech.com)<br/>Licensed under Creative Commons: By Attribution 4.0 License<br/>http://creativecommons.org/licenses/by/4.0/</p>", "metacritic": null, "released": "2023-01-23", "tba": false, "updated": "2023-01-23T05:16:44", "background_image": "https://media.rawg.io/media/screenshots/f6f/f6fb1dbcf6750efd3826079e7e4d7fee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Fmlad"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}