{"id": 91362, "slug": "headspun-dazed-edition", "name": "Headspun: Dazed Edition", "name_original": "Headspun: Dazed Edition", "description": "\n<p><strong>Cortex is in ruins. </strong><br/><br/>After waking from a five week coma, Theo Kavinsky finds his life in disrepair, and with no memory of the accident, it’s up to Ted and Teddy – the conscious and subconscious voices in his head – to work out what happened, and put his life back on track. <br/><br/><strong>Headspun </strong>is an FMV/Adventure hybrid which puts you in the shoes of Ted: the Director of Cortex - the rational, intelligent voice in Theo's head. What Ted thinks is best for Theo isn't necessarily a view shared by Teddy, however; the primal, emotional subconscious voice... <br/><br/>In the process of repairing Cortex, re-hiring a team and finding out what happened the night of the accident, Ted and Teddy must cast aside their differences and learn to work together. Headspun is a game about recovery, discovery, and the ongoing battle between logic and emotion. </p>\n\r\nFEATURES\r\n<ul><li>Rich FMV story-telling</li><li>Branching dialogue - sway the outcome of your interactions</li><li>Rebuild Cortex - earn Neuros to hire staff and commission renovations </li><li>Retrieve Lost Memories and work out what happened the night of Theo's accident</li><li>Original Synthwave Score from Soho Loop</li></ul>\r\n\r\nTHE DAZED EDITION\r\n<p><strong><em>IMPORTANT PLEASE READ :</em></strong> Headspun: Dazed Edition is an early access version of the game. If you're looking for a final, slick game experience and want to experience the story in its finished form - <strong>please wait for the full release.</strong> If you're happy getting stuck into something unfinished and would like to involve yourself in the remainder of development - the Dazed Edition might be for you. </p>\n<p>Anybody that purchases the DRM-free Dazed Edition will also be entitled to a Deluxe Edition Steam key when the full release rolls around later next month. This is a chance to check out the game in a slightly earlier state, as we put those final few bits and bobs into the game, fix any bugs, and polish all the way until release. </p>\n<p>Superstring is a one-man band, and Headspun is releasing early in the form of the Dazed Edition to catch bugs and optimise in a way simply not possible with one PC and one pair of eyes. </p>\n<p>Fair warning: there are bugs, there is content that still needs to be populated, and it *may* break on you. <strong>Sorry!</strong> We'll be patching and uploading new builds as often as we're able, however - so bear with us and we'll get that problem of yours fixed. </p>\n<p>We're all ears for bugs and feedback, of course: <strong>support@superstring.studio</strong></p>\n<p>Anybody who sends through a bug or meaningful piece of feedback will be <strong>added to the credit-list</strong> for the final game, too, alongside our eternal gratitude. </p>\r\n\r\nFAQ\r\n<p>WILL HEADSPUN ALSO BE RELEASED ON STEAM?<br/>It will indeed. Purchasing the Dazed Edition here on Itch will also secure you a Steam key for the full release of the game.  </p>\n<p><strong>WILL THE PRICE REMAIN THE SAME FOR THE FINAL RELEASE?<br/></strong>No - the Dazed Edition is cheaper, as it's unfinished; it could be seen as an Early Bird price for the full release. </p><p><strong>I'M DIGGING THE SYNTHWAVE MUSIC - TELL ME MORE!?</strong><br/>Headspun's OST has been composed by UK-based electronic outfit Soho Loop, with composer Stephen Willey also looking after the sound design in the game. </p><p><strong>I'VE FOUND A BUG / GOT A PROBLEM / WANT TO TELL YOU SOMETHING!</strong><br/>Great! Sling us a line at support@superstring.studio, or drop us a note on any of the channels below. </p>\r\n\r\nSUPERSTRING\r\n<p><strong>Superstring is a London-based micro-studio with macro-ambition. Headspun </strong>due for release on PC and Mac in September 2018. </p>\n<p>Don't be a stranger...<br/></p>\n<ul><li>Follow  Superstring on Twitter </li><li>Say hi on Facebook</li><li>Chat with us on Discord</li><li>Join our mailing list</li><li>See our pretty photos on Instagram</li></ul>", "metacritic": null, "released": "2018-08-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8fd/8fd6f2d81e3905f18049e013b09dd022.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Superstring"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}