{"id": 913677, "slug": "tower-jet", "name": "Tower Jet", "name_original": "Tower Jet", "description": "<p>A Platformer with a jetpack and missiles. Shoot targets and collect robot parts to assemble \"friendly\" robots. (Plot twist: they're not friendly). The red tiles heat up the jetpack, supercharging it. The blue tiles cool it off, reducing its power. There are 6 levels in total - good luck! <br/></p>\n<p>Movement is via the WASD, power the jetpack with J, fire missiles with N, and jump with M. You can also zoom in/out with a mouse's scroll wheel or repeated Up/Down arrow keys.</p><p>If you end up stuck in any walls, you should be able to shoot your way out of it - worst case you can regen a different version of the same level with Shift+R.<br/></p>\n<p>Created for the Godot Wild Jam #53. This is part of my Dino Godot games playground, which is completely open source (repo here).<br/></p>\n<p>'Tower' as a reference to Towerfall, an all-time fave. I dream of one day creating something as fun as Towerfall!</p>\n<p>I spent most of the jam prototyping/wrestling with procedural level generation - in the end I wasn't able to get it integrated properly on time - I'd hoped to provide 'infinite' random levels as you 'climb' the tower. These levels were generated and saved in Godot's editor. For now, you can live-regenerate any level with a new seed while playing with Shift+R.</p>\n<p>Credits:</p>\n<p>Coldfire-gb 4 color palette by Kerrielake: https://lospec.com/palette-list/coldfire-gb<br/></p>", "metacritic": null, "released": "2023-01-22", "tba": false, "updated": "2023-01-23T07:53:28", "background_image": "https://media.rawg.io/media/screenshots/40a/40a62d6cca7f27f7d748870b24136a3b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["russmatney"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}