{"id": 91360, "slug": "the-red-strings-club-itch", "name": "The Red Strings Club (itch)", "name_original": "The Red Strings Club (itch)", "description": "<p><strong>The Red Strings Club </strong>is a cyberpunk narrative experience about fate and happiness featuring the extensive use of pottery, bartending and impersonating people on the phone to take down a corporate conspiracy. <br/><br/>The professed altruistic corporation Supercontinent Ltd is on the verge of releasing Social Psyche Welfare: a system that will eliminate depression, anger and fear from society. However, the bartender of a clandestine club and a freelance hacker don't regard this evolution as an improvement but as brainwashing. Alongside unwitting company employees and a rogue empathy android, the duo will pull all the strings they can to bring down this scheme.</p>\n\r\nCyberpunk Thriller Narrative\r\n<p>Uncover a mysterious corporate program that promises a blissful existence while debating what does happiness means and what lengths are permissible to obtain it.</p>\n\r\nPsychological Bartending\r\n<p>Read your customer's’ mood and mix the perfect cocktail to manipulate the client's emotions in order to gather the information you want and progress your agenda of stopping Supercontinent's plans.</p>\n\r\nGenetic Implant Pottery\r\n<p>Design genetic implants at a high-tech lathe to change the attitude and direction of the corporation’s most influential executives.</p>\n\r\nVocal Corporate Espionage\r\n<p>Assume the voice of important figures in the Social Psyche Welfare project and play their own motivations against each other over the phone to uncloak their plans.</p>", "metacritic": null, "released": "2018-05-25", "tba": false, "updated": "2019-08-28T23:26:08", "background_image": "https://media.rawg.io/media/screenshots/79b/79b794cccd1af68e6ecb2d8bb6449e37.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Devolver Digital"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}