{"id": 91364, "slug": "glitched", "name": "GLITCHED (itch)", "name_original": "GLITCHED (itch)", "description": "<p>The demo and pre-order will be avaible today at 6PM CST!<br />\nGLITCHED is a choice-based RPG coming to PC and Mac in Fall 2018.<br />\nFollow us to keep up with development!<br />\nTwitter | Tumblr | Facebook<br />\nWhen a glitch appears in the world of Soren, an unexpected hero, Gus, becomes aware of you- the player. Together with Gus, you will make choices that will shape the story and world around you.  Discover the world of Soren and solve the mystery of the glitch. As the story unfolds, Gus might start to question what role you have in his world.<br />\nFeatures:<br />\nEssence System<br />\nAs you make choices, Gus&#39;s essence will change. Gus&#39;s essence determines his personality and will cause characters to react differently to him. As you meet characters of each essence and watch how Gus changes, the nature of essence will become more clear.Real Branching Story<br />\nMany choices you make will  lead you down different paths. Gus&#39;s essence might change how a situation plays out, causing a whole new story to take place.Conflict System<br />\nBefore most battles, you&#39;ll be able to sort things out the good old fashion way- by talking. The tension meter will gauge how close you are to resolving the conflict peacefully or how close you are to jumping into a brawl. When multiple characters are involved in a conflict, you may have to pick a side.FATE Battles<br />\nIf a conflict goes bad, you&#39;ll be forced to battle. Combat in GLITCHED uses a simple turn-based RPG style, with a twist of cards and energy. When card charges run out, you&#39;ll have to refresh decks to keep going. Collect different cards for your many allies and build your dream team.Gus<br />\nTalk to Gus to learn more about him and the world. Your friendship with Gus might be important to how he handles certain situations. Gus will also learn more about you as you talk about life, existence, or whatever random thought pops into his head.<br />\nDemo Version<br />\nA demo of GLITCHED is avaible now! Check out the download link below to play. You can also pre-order the game now, with an expected release around Fall 2018. This is a demo version, so there may still be a few bugs or glitches!<br />\nPlease click here to report a bug or issues with the demo.<br />\nWe also have a general survey for feedback. Please let us know what you think about the game so far, feedback can help us focus on areas that might need a bit of love before release.<br />\nClick here to fill out a feedback survey. Thank you!<br />\nMac version coming soon!<br />\nNOTE: You will need an updated version of DirectX to play the Windows demo. Grab the download from Microsoft here.<br />\nClick here to view a channel log of changes for V.2</p>", "metacritic": null, "released": null, "tba": true, "updated": "2022-02-01T02:13:01", "background_image": "https://media.rawg.io/media/screenshots/08f/08f6e905ac40350d227c5a561baa7d55.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EnHouseStudios"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}