{"id": 91376, "slug": "starry-night", "name": "Starry Night", "name_original": "Starry Night", "description": "<p>Starry Night (2018) is a game that was made with Novelty Visual Novel Maker Engine. This game is like a simulation that you will play as a role of a male student, and your goals is to make it to the end of school year by studying, participating in school activities, and making new friends.</p>\n<p>NOTE: Please switch to Windows Mode if you are going to input your name. (Maybe a simple bug), then after that you may now enjoy the Fullscreen Mode.</p>\n<p>The game takes place in a small city we're a man (Default name Dave, can be fix) was moved and transferred to a a new school because he was always bullied by his classmates. Then he expected that students from his new school was different so he will be able to start a new life and make friends. However, making a new friend is not easy since he is a stranger for the others.</p>\n<p>Game features:</p>\n<ul><li>A story driven that may bring you to a different story paths based on your choices and stats earned.</li><li>6 available endings, including 4 best different endings, 1 good ending, and 1 worst ending.</li><li>Your achievements will be acknowledge at the Honors' Awarding Event</li><li>Multiple interactions like working, hanging out with others, studying, giving gifts, etc.</li><li>Special events like festivals, birthday celebrations, contest, etc.</li><li>Invite female students to dance or to come with you during festivals.</li><li>Talk and gift to your classmates you loved most.</li></ul>\n<p>And you are allow to fall in love with 4 candidate bachelorettes:</p>\n<ul><li>Annie: The smartest in class, multiple-awarded student. She spent her free time at studying and reading novels so she doesn't have any close friends.</li><li>Joyce: A shy-type student who is isolated to everyone. She spent her time just hanging out at the school rooftop and watching people from above.</li><li>Lucy: An artist. She acts like a boy or a tough woman. But she's caring and kind woman. She spent her time by drawing landscapes or portraits. She also like video games and reading mangas.</li><li>Quinn: She's cheerful and energetic. An optimistic person that she want to be a successful cook one day. She's training now at the cafe.</li></ul>\n<p>If you have any concerns, please do not hesitate to contact me.</p>", "metacritic": null, "released": "2018-04-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/865/865fa6d85d14b15caa669cbfd76f54e6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["V0idPH"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}