{"id": 91396, "slug": "tryst-itch", "name": "TRYST (itch)", "name_original": "TRYST (itch)", "description": "TRYST is a 3D ambient 1-2 player local co-op puzzle platformer. That description is a mouthful for such a simple concept.\r\n\r\n<p>\r\n\tForces unknown seem to be trying to keep you two apart. Your goal is to traverse and conquer the mysterious environment and reunite with your lover's warm embrace.\r\n</p>\n<p>\r\n\tWith a heavy focus on cooperation and 10 levels increasing in challenge and complexity, you'll need to work together, plan ahead, develop strategies, and exercise those beautiful brains if you want to see the light. Remember, love conquers all.\r\n</p>\n<p>\r\n\tFor the ultimate experience, share a single controller with your partner. Or, if you're a glutton for punishment, you can go solo with a single controller. That's how the pros do it.\r\n</p>\n<p>\r\n\tThis game is downloadable on Windows and Mac.\r\n</p>\n<p>\n<strong>One Player = one controller</strong>\n</p>\n<p>\n<strong>Two Players = keyboard OR one controller OR two controllers</strong>\n</p>\n<p>\r\n\tThis game was conceived and prototyped within 48 hours for the Toronto Global Game Jam in 2015. We then spent a year tweaking and polishing it in our free time.\r\n</p>\n<p>\r\n\tDeveloped by Ryan Welham, Mike Gillespie, and Sean Leach.\r\n</p>\n<p>\n<br/>\n</p>\r\n* Button mapping and movement speed have been fixed for keyboard users!  *\r\n<p>\n<br/>\n</p>", "metacritic": null, "released": "2016-06-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2d8/2d8dd04ed0f8816dae55d6a90e6e08b7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["Welham14"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}