{"id": 913965, "slug": "pattern-blue", "name": "Pattern Blue", "name_original": "Pattern Blue", "description": "<p>Made for the  Wild Game Jam for Godot.<br/>godotwildjam.com<br/></p>\n<p>The world needs your help! Wait no that's the other guy, the world needs their help, your job is to stop him! END THE WORLD! Destroy all humans, and remember, have fun!</p>\n\n<p>Controls:<br/>Arrow Keys/Wasd  - Move.</p>\n<p>Left click/Space - Pick up materials.</p>\n<p>Right click/E Key - Drops Materials.</p>\n<p>Goals:<br/>Prevent Humanity from assembling it's goal via any means necessary.</p>\n<p>Instructions:<br/></p>\n<p>Picking up snow and dropping it will create areas of slowed movement for human vehicles.<br/></p>\n<p>\"Ocean\" will destroy enemy troops.</p>\n<p>Fresh water does nothing to enemies, but makes you very durable while holding it.<br/> <br/>The gameplay is kinda a strategy game almost, lay down snow to defend against enemy movements, make sure to read the instructions for a good time! and remember sometimes, killing the supply vehicles, isn't always the best course of action, if they are on a particularly long supply route, maybe a lot of snow and just letting them take forever is a better course of action?<br/><br/>Note:</p><p>Lot of crashes when switching scenes, that's why there's a button on the main menu at the bottom right to take you to the final level!<br/></p><p>ONLY WINDOWS TESTED!</p>\n<p>There are Linux and mac builds there and your results may vary.<br/>That being said the game is also somewhat resource demanding, so your PC also may have trouble with the game in general, I did a lot of optimizing but a lot of it came down to the navmesh system handling that many units, in the future I may end up implementing a different option if I go into another \"Bullet hell\"? not even sure what I would call this, direction.<br/></p>", "metacritic": null, "released": "2023-01-22", "tba": false, "updated": "2023-01-23T10:07:04", "background_image": "https://media.rawg.io/media/screenshots/e87/e8727107a95bd8a8ffa11a3fb0d067d5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Bonkahe"], "genres": ["Action", "Strategy"], "publishers": [], "esrb_rating": null}