{"id": 91390, "slug": "lije", "name": "Lije", "name_original": "Lije", "description": "<p>Making her way through the everlasting mists of a strange country, a young woman strives to stray  from the path that has been chosen for her by men, societies and gods.<br/><br/>Lije is a 2D RPG, inspired both by japanese (strong characters) and western tradition (freedom of action in a coherent environment).<br/>The game will be released in 5 episodes, for PC Windows, MacOS, Linux and PS4.<br/><br/>In Lije's world, beliefs shape reality. Should a rumor spread enough, that it would materialize. On the other hand, should a person be too isolated, a place only to exist in the minds of a few old people then it would disappear in the permanent mist that bathes the world: Rim. The player will explore this dangerous place and will be able to use its unique features: they will refresh and use peoples memories, will pull back forgotten places from Rim, will turn to mist any obstacle that would stand in their way.<br/></p><p>---<br/>Dans les brumes permanentes d'une étrange contrée, une jeune femme lutte pour sortir du chemin qui a été tracé pour elle par des hommes, des sociétés et des dieux.</p><p>Lije est un RPG 2D, inspiré à la fois de la tradition japonaise (personnages forts) et de la tradition occidentale (liberté d'action dans un univers cohérent). Le jeu est prévu en 5 épisodes, sur PC Windows, MacOS, Linux et PS4.</p><p>Dans l'univers de Lije, la croyance crée le réel. Si une rumeur se répand suffisamment, elle va se matérialiser. Au contraire, si un individu se retrouve isolé, si un endroit n'existe plus que dans la mémoire de quelques personnes agées, il va disparaître dans la brume permanente qui baigne le monde : Bordure. Le joueur explorera cet univers dangereux et pourra utiliser ses propriétés : il réveillera et utilisera les mémoire des gens, fera émerger des endroits oubliés de Bordure, effacera dans la brume les obstacles qui se dressent sur sa route.</p>", "metacritic": null, "released": "2015-05-22", "tba": false, "updated": "2019-08-28T23:26:08", "background_image": "https://media.rawg.io/media/screenshots/eaa/eaa05727b2df5d324a26a87de9a5d2a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 410, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rufflerim"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}