{"id": 914003, "slug": "autarky-2", "name": "Autarky 2", "name_original": "Autarky 2", "description": "<p>This is a village building game with a twist and based on a fiscal policy called \"Autarky\".\r\n </p>\n<p> You start with a small number of villagers in feudal times and you  need to grow your village into a bigger village. You don't collect  resources or build structures. \r\n </p>\n<p>You have just one option: for each villager, you need to assign an occupation.\r\n </p>\n<p> The villagers will collect resources\r\n The villagers will build structures\r\n The villagers will buy and sell goods\r\n The villagers will rest and work.\r\n The villagers make all the choices - except one - their occupation. That's your choice. \r\nIf  you get the balance between the occupations wrong then your village  won't thrive. Too many farmers and they won't thrive. Too many woodsmen and they won't be able to farm. Not enough craftsmen and you won't have  enough luxury items. Get the right balance and adapt to growth and your  small village becomes a town - a town the villagers built with your  help. The town becomes a city based on a strong economy - an economy  based on Autarky.\r\n This is a functional proof-of-concept and a labor of love.\r\n </p>\n<p>Some people like to watch fish for an hour - would you watch this village for an hour?\r\n Four occupations with more to come.</p>\n<p>Instructions listed on this page: https://github.com/togfoxy/Autarky2<br/></p>\n\n<p>**********************************************************************************<br/></p>\n\n<p>This is an idle 'game' that lets you chill and relax and watch sims move around the screen. You have just one job - assign trades that balance the economy. Assign well and your village will grow. Assign poorly and ... well ...</p>\n<p>**********************************************************************************<br/></p>\n\n<p>This project is an experiment to see if I can simulate a feudal economy. Players with knowledge of economies are welcome to try this simulator and suggest ways to make it accurate and educational. Post comments below.  :)</p>", "metacritic": null, "released": "2023-01-22", "tba": false, "updated": "2023-01-23T10:22:53", "background_image": "https://media.rawg.io/media/screenshots/811/81169ebcc402218bc69c7ceb22e1e530.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fox"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}