{"id": 91413, "slug": "zero-sum-stalemate-manager", "name": "Zero Sum: Stalemate Manager", "name_original": "Zero Sum: Stalemate Manager", "description": "<p>The global financial collapse of 2026 marked the dawn of a new age of chaos around the world. Alliances shattered and revolution burns throughout regions previously believed unshakable. </p><p>It is in this dark future that the shadowy Pyramid organization has reassigned your position in Financial Oversight to Conflict Management. Your task: Spearhead Pyramid's new, more aggressive, \"fundraising\" efforts by manipulating these revolts into unwinnable wars while selling both sides the materials required to continue fighting.</p><p>The world order must be restored. Control is your burden.</p><ul><li>Experience a revolutionary new form of RTS that challenges you to play both sides and avoid victory at all costs.</li><li>Manipulate the conflict by funding production, creating false orders, and blackmailing the influential.</li><li>Manage massive stalemates consisting of more than 100 units.</li><li>Plan your moves carefully to avoid suspicion lest either side uncovering your nefarious plans.</li><li>Play several challenging scenarios or create your own.</li></ul><p>Bigger in Texas Update (v1.1)</p><p> This update to Zero Sum : Stalemate Manager brings you to the south-central United States where the ferocious fighting of the newly formed Lone Star Republic holds a wealth of profit for prospective Pyramid operatives. </p><p>Enjoy the new Texas map available for Custom scenario play. This map, the largest yet, features a unique split-faction layout for the biggest and wildest firefights imaginable. Also included is two new scenarios: The Two-star difficulty Texas Flood and the three-star difficulty Lone Star Rebellion.</p>", "metacritic": null, "released": "2017-04-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c87/c878b1967899ae072877a94429b5f747.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["MikeyKae"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}