{"id": 91421, "slug": "highway-blossoms-remastered", "name": "Highway Blossoms: Remastered", "name_original": "Highway Blossoms: Remastered", "description": "HIGHWAY BLOSSOMS REMASTERED\r\nThe update some of you asked for\r\n<p>Highway Blossoms: Remastered is the new definitive romance treasure hunt road trip experience. Most importantly, it's now fully voiced in English by a talented cast of actors. We've also remastered the soundtrack for a better listening experience, touched up the art for a better viewing experience, and added a Chinese translation for a better Chinese reading experience.</p>\n\n\n<p> </p>\n<p>Highway Blossoms is a short <em>yuri </em>(lesbian) story set in the American Southwest. After an old gold rush miner's journal is discovered, supposedly detailing where he hid parts of his stash, a nationwide craze begins as would-be prospectors try to solve its clues and strike it rich. </p>\n<p>Amber couldn't care less. Wandering the desert in a recently-inherited motorhome, she mourns the loss of her grandfather - indifferent and unaware of the hunt happening around her. It's not until she meets Marina, a young hitchhiker lost in New Mexico that the girls get swept up in the rush. </p>\n<p> </p>\n\n<ul><li>At least tens of words, maybe even hundreds. Although the last word count puts it around 90,000, so expect 6 or so hours of reading.</li><li>Grand, hand-painted vistas of actual landmarks in the western United States, all in glorious 1080p detail. </li><li>A huge soundtrack featuring the works of Anna Logue, Jake Abernathie, Able Kirby, and other friends of AlienWorks. Sounds right at home on your in-dash cassette tape player. </li><li>Accessibility options for days, including the ability to skip through everything in less than five minutes. But who would wanna do that?</li><li>Alternate silly content for second readthroughs that AlienWorks let the programmer write. This may or may not have been a good idea.</li></ul>\n<p>There is a free patch available for the game that adds in the adult content. It is totally optional and is not necessary for completing all of the achievements in the game.<br/><br/>Please note that applying this patch might make your previous save files unusable. Some people have had issues, others have not. You can hold ctrl to skip through previously read content at high speed though. HIGH SPEED FLOWER BLOOM.<br/><br/>WARNING: By downloading and installing this mod and/or by accessing the highwayblossoms.com website, you certify that you are over the age of 18. This patch adds content that is not suitable for small children.<br/><br/>Download at: http://highwayblossoms.com/hbadult/<br/><br/>To install, simply paste 'adult.rpa' into \"Highway Blossoms/game/\"<br/></p>\n<p>REGARDING THE ANDROID VERSION: We have removed the Android version of the game as we are not able to upgrade it to the Remastered version and cannot continue supporting it. Thank you to everyone who downloaded and tried that version of the game.</p>", "metacritic": null, "released": "2016-06-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/002/0028fa55cbae3e64ef3b7ce386ad6401.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 8, "owned": 2, "beaten": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC", "Linux"], "developers": ["AlienWorks"], "genres": [], "publishers": [], "esrb_rating": null}