{"id": 914367, "slug": "foosyeah", "name": "FOOSYEAH!", "name_original": "FOOSYEAH!", "description": "<p>Get ready to dominate the virtual foosball field with <strong>FOOSYEAH!, </strong>the ultimate foosball-inspired gaming experience.  This game is packed with intense action, realistic graphics, and intuitive controls that will blow your mind. Inspired by the classic game of foosball, <strong>FOOSYEAH!</strong> adds a unique twist with soccer-inspired movements. Challenge the AI or take on your friends in local multiplayer matches and show them who's boss. Customize your team and make them stand out on the field.  Play now and experience the ultimate foosball-soccer gaming experience! Are you ready to rule the virtual football world? Prove it with <strong>FOOSYEAH!</strong>\"</p>\n<p>Players can use the mouse to select menu options and navigate through the game's interface. However, when playing,  it is recommended to use an Xbox One gamepad. You can find the detailed explanation in the \"Controls\" option in the game's Settings menu and how to use the Xbox One gamepad efficiently and be able to take full advantage of the game features.</p>\n<p>Main movements<br/></p>\n<p><strong><em>Shoot</em></strong> is a basic move in FOOSYEAH that allows players to shoot the ball towards the opponent's goal. To perform this move using the Xbox One controller, players will need to press the right bumper button when the ball is near the player. FOOSYEAH will automatically identify which player is closest to the ball and that player will kick it. This move is useful for creating scoring opportunities </p>\n<p><strong><em>Pass</em></strong>  allows players to pass the ball to a teammate. To perform this move using the Xbox One controller, players will need to press the left bumper button when the ball is near the player. FOOSYEAH will automatically identify which player is closest to the ball and that player will smoothly kick the ball to a nearby teammate. This move is useful for maintaining possession of the ball.</p>\n<p><strong><em>Chip Pass</em></strong>  To perform an aerial pass using the Xbox One controller, players will need to move the right stick upward and press the left bumper button simultaneously. This move allows players to pass the ball over the heads of their opponents, allowing them to bypass the defense and set up scoring opportunities. It can also be used to surprise the opponent and catch them off guard. The chip pass is a powerful move that requires precise timing and good aim to execute correctly. It is a advanced move that can give you a significant advantage in the game, but you need to master the timing and the aiming.\r\n  \r\n</p>\n<p><strong><em>Quick Pass &amp; Shoot</em></strong> is another special move in FOOSYEAH that allows players to quickly pass and shoot the ball. To perform this move using the Xbox One controller, players will need to keep the right bumper button pressed when the ball is in line with the player. This move allows players to quickly pass the ball to a nearby teammate and shoot it towards the goal in one swift motion. It can be useful for quickly catching the opponent off guard and creating scoring opportunities. However, it also requires precise timing and aim to execute correctly. This move can be a great addition to your gameplay arsenal, but remember that it also requires good reflexes and knowledge of the game mechanics.</p>\n<p><strong><em>Rods Movement</em></strong>   To perform this move using the Xbox One controller, players will need to move the right stick up and down. The rod of players that is closer to the ball will follow that movement and move up and down accordingly.  It is a key feature to master to be able to play at a higher level and take advantage of the game mechanics.</p>\n<p><em><strong>Rods Rotation  </strong></em>In contrast to traditional foosball where rotation is primarily used for shooting, in FOOSYEAH rotation can be used to control the ball when it is a little away from the players or to let the ball pass without touching it. To perform this move using the Xbox One controller, players will need to move the left stick left and right. </p>\n<p><strong><em>New ball</em></strong>   if the ball goes out of the stadium or stays in a dead position, players can press the key \"B\" or the small center right button on their gamepad to restart the game with the ball placed at the center of the field. This feature ensures that the game keeps moving and players can keep playing without losing momentum.</p>\n<p><strong><em>Escape</em></strong>  players can press the Escape key on their keyboard to access the in-game menu or quit options.</p>\n<p>In FOOSYEAH, the Menu selections can be made using a mouse or a keyboard. The mouse allows for easy navigation and selection of the different options on the menu. Players can simply click on the desired option to select it.  <br/></p>\n<p>Technology used:  UNITY Version 2020.3.17f1, C#, MIXAMO and ChatGPT</p>", "metacritic": null, "released": "2023-01-21", "tba": false, "updated": "2023-01-23T13:03:31", "background_image": "https://media.rawg.io/media/screenshots/570/57052b5d611bc5b0edc2afcbb293cb12.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["OscarSM"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}