{"id": 914491, "slug": "the-necromancers-guide-to-the-apocalypse", "name": "The Necromancer's Guide to the Apocalypse", "name_original": "The Necromancer's Guide to the Apocalypse", "description": "<p>My first large-scale unity project, saved here for posterity's sake.</p>\n<p>The Necromancer's Guide to the Apocalypse puts you in the role of a necromancer who has awoken from your ancient slumber to reap a terrible vengeance on the modern world. Just one problem, the world has already ended while you were asleep and is now a wasteland prowled by the undead. </p>\n<p>Using your necromancy you convert the shambling corpse of former preper Andy into the first of many skeletal minions, but Andy has no intention of being a mindless puppet and some impresses on you which of you is calling the shots. And so with his revolver and your not-quite-total mastery of the dark arts, you and andy set out into the wastes.<br/></p>\n<p>The executable contains what is best described as a vertical slice prototype of The Necromancer's Guide to the Apocalypse. It features the battle system, the map system and minion customization. <br/></p>\n<p>Rather than a full procedurally generated map to run through, this prototype  contains a number of pre-made locations that can be looped between indefinitely.</p>\n<p>This project had a lot of firsts for me and so there are many many flaws in the prototype. So be prepared for blurry sprites, blurry text, a text dump in place of a tutorial and a total absence of any audio. You have been warned.</p>\n<p>Currently I have no intention of returning to this prototype but I do retain some affection for the idea and so time will tell if a new version, forged in the fires of greater experience will see the light of day.</p>\n<p>For now, I hope this prototype brings you some amusement.<br/></p>", "metacritic": null, "released": "2023-01-20", "tba": false, "updated": "2023-01-23T14:01:27", "background_image": "https://media.rawg.io/media/screenshots/d73/d738dc52452df2bb2de1d9271081391a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TimberRoar"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}