{"id": 914502, "slug": "squids-manslaughter", "name": "SQUID'S MANSLAUGHTER", "name_original": "SQUID'S MANSLAUGHTER", "description": "<p>Another game by Jason Kumori...<br/></p>\n<p><strong>Disclaimer...</strong></p>\n<p>This game is for big teenagers, it contains several reality questioning topics...</p>\n<p><em>First, Do A Little Prayer And Read These Receptions...</em></p>\n\n<p><strong>--SUPPORT AND LINKS--</strong></p>\n<p>If you'd like to support this project, please consider buying the soundtrack on Bandcamp, that, or buying the game for any price. Each donation is deeply appreciated, don't hesitate to send me a message as well, I'd be more than happy to respond!</p>\r\nBANDCAMP\r\n<p><strong>RPG MAKER.NET</strong></p>\n<p>This project was initially made as a simple parody, however, it blossomed into something far bigger than initially planned... The reconstruction was due to a certain special someone testing the game early on, formerly, it was known as Cease, but has since been reworked. This game all started based on multiple reoccurring dreams I had about this horrifying bag lady chasing me, but that's the simplified version. It's had a rocky development, partly due to life events and working two fast food jobs, but despite that, it's finally here!</p>\n\n<p>Squid's Man Slaughter tells the tale of a pathetic introverted creature, having an equally pathetic goal to collect trading cards and office men slaves. The end result, while vague, is guided by a squid lady named Squiggly that our hero befriended on the internet. The mystery about Squiggly is uncovered as the game goes on, her faults, past love life, children, crimes against humanity, it's all there, hidden in the vast abyss of the gamblers paradise... You will slowly learn the horror of your immunity to the pearls of death, as you test your life 9 times... HAVE A GOOD TIME...<br/></p>\n\n<p>The bleak future, World War 3 proceeded beyond a point in which humanity couldn't handle. God has rejected man kind, now all that inhabits earth are bizarre mutants that have formed into abominations, vaguely resembling creatures of old. Chaos seeks order, several, now in delusion, look to take the crown as deity. The highest ranking out of them, a guy named Joel, not too different from you and me, sitting on the top, wrongly all knowing, as he preaches false doctrine, doing away with all that is sacred and pure. The corrupt aim to resurrect the world with ideologies, can you triumph without being diluted by false prophets?</p>\n\n<p>Squid's Man Slaughter is a dungeon crawler, minigame collection hybrid. It contains several fully fleshed out card games dispersed throughout. It includes highly versatile party customization, and battles that never repeat, there is also a way to converse with enemies to potentially change the course of a situation. The game contains 8 hours of gameplay, 3 different endings that you can see in one play through, just be careful about your finances. There's always someone trying to scam or tax you for a provided service...<br/></p>\n<p><strong>--CLOSURE AND CREDITS--</strong></p>\n<p>This has been the most challenging game I've developed by far. Managing my time has been difficult, I've had moment where I felt like it was meaningless, however, I have learned a great deal through this project. My final take away is, if you have any idea for a project, put it out there, there's no such thing as bad art, it's all subjective, there will always be at least one person who enjoys what you've created, if it's what your heart leads you to do, never hesitate.</p>\n<p><em>~Thank you...</em></p>", "metacritic": null, "released": "2023-01-20", "tba": false, "updated": "2023-01-23T14:06:59", "background_image": "https://media.rawg.io/media/screenshots/fe3/fe383b7c56fc995d7b746c0bb8573bf7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 297, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["No"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}