{"id": 914663, "slug": "invasion-of-the-geminorons", "name": "Invasion of the Geminorons", "name_original": "Invasion of the Geminorons", "description": "<p><strong><em>Invasion of the Geminorons</em></strong> is a sci-fi puzzle game for Game Boy Color and Analogue Pocket.</p>\n<p>The download includes a .gbc ROM file for use with an emulator or a real Game Boy Color, a .pocket file for use with an Analogue Pocket, and a PDF manual.</p>\n<p>\n<strong>&gt;&gt;&gt; Get the game on a real cartridge at\r\nFerrante Crafts. &lt;&lt;&lt;<br/></strong></p>\r\nPlaying the web version\r\n<p>Click on the embedded player to enable sound.</p>\n\r\nHardware requirements\r\n<ul>\n<li>To run on original hardware, the .gbc ROM file needs to go on a cartridge. There are no special requirements for cartridges; multi-game carts like the Everdrive GB and EZ Flash Junior will work, but so will any basic reflashable 32k cart.</li>\n<li>You need a Game Boy Color, or compatible console (e.g. Game Boy Advance). A monochrome Game Boy (DMG, light, pocket) or Super Game Boy will <em>not</em> work.</li>\n<li>The .pocket file runs directly from the SD card of an Analogue Pocket, with no cartridge required.</li>\n</ul>\r\nEmulators\r\n<p>\r\nIf you don't have a compatible console, you can still play the game using an emulator. Install a Game Boy Color emulator and use it to open the .gbc file. For best results, I recommend using SameBoy or bgb. Run in Game Boy Color mode.<br/></p>\n<p>\n</p>\r\nAcknowledgements\r\n<p><em>Invasion of the Geminorons</em> was playtested by Cian O'Carroll, Coffee \"Valen\" Bat, Geonjaha, Alphaknight, oshf, RedOctorok and YoshiTuk.<br/></p>\n<p>The music driver is hUGEDriver by Nick Faro.</p>\n<p>The emulator used for the web version is binjgb by Ben Smith.</p>\n<p>The game is built with GBDK-2020 and  SDCC , and wouldn't have been possible without all of the people who contributed to those projects.</p>\n<p>Míle Buíochas!</p>", "metacritic": null, "released": null, "tba": false, "updated": "2023-01-23T15:19:53", "background_image": "https://media.rawg.io/media/screenshots/d9b/d9bcf7db416257d1dda15bba25d7cb16.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["gearfo"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}