{"id": 914783, "slug": "shadow-gambit-the-cursed-crew", "name": "Shadow Gambit: The Cursed Crew", "name_original": "Shadow Gambit: The Cursed Crew", "description": "<p>Ahoy, cursed pirate!</p>\n<p>This is Shadow Gambit: The Cursed Crew, an all-new stealth strategy game set during an alternate history of the Golden Age of Piracy.</p>\n<p>The Curse of Lost Souls haunts the mysterious island chain known as the Lost Caribbean, which is under the control of the terrible forces of the Inquisition. They despise all that is supernatural and use soul devouring fire to hunt cursed pirates like you!<br />\nAssemble Your Cursed Pirate Crew:<br />\nEmbark on a journey with cursed pirate Afia and seek the legendary Black Pearls to revive a cursed crew of your own. Each of your eight shipmates is a playable character with an individual personality and armed with unique supernatural powers. Launch friend or foe with Gaëlle&#39;s magical cannon, use Mr. Mercury&#39;s soul anchor to open a magic portal or dash across spacetime for split second stealth attacks with Afia&#39;s mythical sword.</p>\n<p>Outsmart Your Enemy:<br />\nPull-off an epic heist and salvage a mysterious treasure of otherworldly power to defy the army of the Inquisition. Infiltrate their fortresses. Sneak behind enemy lines. Cleverly combine the magical skills of your crew to take out a variety of enemies with carefully considered tactics. Feel like a brilliant mastermind when your plan clicks perfectly into place!</p>\n<p>Your Ship, Your Home:<br />\nJoin The Red Marley, a ghost ship with a living soul. On deck, plan your next adventure or just hang out with your crew mates while they enjoy their un-life. Get to know these legendary cursed pirates of the Lost Caribbean. With individual character missions find out about their backstories, learn who they are and what led them on their cursed journeys.</p>\n<p>Explore the Lost Caribbean:<br />\nGo ashore a variety of exotic islands in the Lost Caribbean. From locales oozing with cursed soul magic to tropical beaches and lively pirate shanty towns: Every island is a unique hand-crafted sandbox where adventures await.</p>\n<p>Play It Your Way:<br />\nFreely select your crew members before embarking on each mission. Utilize their unique abilities to find new strategies against the forces of the Inquisition. Plot your own path to enter and exit each island, be stealthy or more head-on in your play style and use the environment to your advantage. It&#39;s your playground to experiment in!</p>\n<p>Manipulate Time and Experiment:<br />\nThe powerful time-manipulating magic of your ghost ship is yours to wield. Pause time to consider your strategic choices or queue up multiple character actions. Capture a memory of every passing moment, to instantly return to if things go south. Change your approach and tactics to discover own unique solutions to each moment in the game – in your own time!<br />\nSYSTEM REQUIREMENTS</p>", "metacritic": null, "released": "2023-08-17", "tba": false, "updated": "2024-02-25T10:21:47", "background_image": "https://media.rawg.io/media/games/e63/e63debd47c79933a6814fbc88b1198c3.jpg", "website": "https://shadowgambit.com", "rating": 4.2, "rating_top": 5, "added_by_status": {"yet": 20, "owned": 27, "beaten": 13, "toplay": 70, "dropped": 7, "playing": 10}, "playtime": 1, "achievements_count": 50, "ratings_count": 19, "suggestions_count": 529, "game_series_count": 0, "reviews_count": 20, "platforms": ["Xbox Series S/X", "PlayStation 4", "PlayStation 5", "PC"], "developers": ["Mimimi Productions"], "genres": ["Action", "Adventure", "RPG", "Strategy"], "publishers": ["Mimimi Games", "Mimimi Productions UG"], "esrb_rating": null}