{"id": 914788, "slug": "steamworld-build", "name": "SteamWorld Build", "name_original": "SteamWorld Build", "description": "One final landrush! The planet is dyin', Astrid, and it's dig or die trying! <br/><br/>That mine under our town is sitting empty, and wouldn't you know there's rumours of ancient tech down there that might help us out of this predicament. Round up the posse, circle the wagons, and let's get to buildin' a new home! Collect resources above ground and ores down below so we can get those wealthy bots in here to help us build bigger, and we can get the heck out of here!<br/><br/><br/><br/><br/>As your borders expand, new steamfolk will find their way to you! Every bot is crotchety in their own way, and it's up to you to keep them steaming along. Barter to boost efficiency, keep goods flowing to and from the mines and keep everyone happy to make them work their darndest and hardest.<br/><br/><br/><br/><br/><br/>Stare into the abyss long enough and it might just stare back... we're going looking for riches and something down there doesn't want to share! Have gun, dig gravel, and make sure the mines don't collapse upon you as you defend yourselves from the creepy crawlies that lurk within...<br/><br/><br/><br/><br/><ul><li>Break ground on a bustling SteamWorld town, inspired by the Old West.<br/></li><li>Keep your steambots from getting cranky by ensuring their complex needs get met<br/></li><li>Dig deep and spread wide to produce resources to aid your search for ancient technologies<br/></li><li>Defend your mine from the creepy varmints that lurk deep below your town<br/></li><li>Trade resources at the local train stop and welcome special visitors who'll lend a hand<br/></li><li>Five distinct maps littered with secrets for the discerning SteamWorld explorer to find<br/></li><li>Developed from the ground up for both mouse and controller, whichever takes yer fancy.<br/></li><li>Four difficulty levels, including a sandbox difficulty for when you just want to Build!</li></ul>", "metacritic": null, "released": null, "tba": true, "updated": "2024-02-06T20:40:41", "background_image": "https://media.rawg.io/media/screenshots/021/0210c19118196286b417613e30fc2a0b.jpg", "website": "https://steamworldgames.com/", "rating": 4.08, "rating_top": 4, "added_by_status": {"yet": 7, "owned": 13, "beaten": 12, "toplay": 17, "dropped": 4, "playing": 2}, "playtime": 5, "achievements_count": 28, "ratings_count": 13, "suggestions_count": 377, "game_series_count": 5, "reviews_count": 13, "platforms": ["PC"], "developers": ["The Station", "Thunderful Development"], "genres": ["Strategy", "Simulation"], "publishers": ["Thunderful Publishing"], "esrb_rating": null}