{"id": 914880, "slug": "spunkstock-music-festival", "name": "SpunkStock: Music Festival", "name_original": "SpunkStock: Music Festival", "description": "<p>SpunkStock involves a simple, yet diverse system as it&#39;s core gameplay. Create your own playstyle by selecting various &quot;modifiers&quot; to shape how you play. Explore and get to know unique characters with fully animated scenes.Diverse Modifier SystemChoose between 20+ unique modifiers to shape your experience. You can choose modifiers that support you, or choose modifiers that are challenging, but offer greater rewards. You can keep things simple, or stack modifiers together and create some very challenging results. It&#39;s up to you.<br />\nA Festival Where Sex Is An Avid themeSneak backstage in a festival, and build relationships with the artists. Every artist will have a fully animated base scene, additional optional Hcontent, and variations.Get Rewards With Various CurrenciesCompleting songs will reward you with Reputation. Mastering a song will reward you with tokens. These can all be used in a shop to unlock various Quest items, cosmetics, or Pin-ups for your viewing pleasure.Various EndingsSpunkStock will have ending variations depending on your relationships with the cast of characters.Mini-gamesTake a break with one of the mini-games across SpunkStock. Including a platforming section, a haunted hall, and various other arcs with unique mechanics.</p>", "metacritic": null, "released": "2023-01-26", "tba": false, "updated": "2023-04-05T16:17:31", "background_image": "https://media.rawg.io/media/games/f4b/f4bb0548fc0708284f336d35e168c859.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 256, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "PC"], "developers": ["RegulusNSFW"], "genres": ["Action", "Indie"], "publishers": ["RegulusNSFW"], "esrb_rating": null}