{"id": 914827, "slug": "project-mirror-2", "name": "Project: Mirror", "name_original": "Project: Mirror", "description": "<h3>Welcome to Project: MIRROR! </h3><br/><br/><br/><h3>Cool badges, emoji, steam backgrounds and trading cards coming soon!</h3><br/><br/><br/><br/><br/><br/>Tired after a hard day at work?  Then <strong>Project: MIRROR!</strong> is all you need.  In a world full of magic and fantastic creatures, the souls of beautiful girls are shattered into several pieces during a violent and powerful storm.  You, as one of the survivors of this disaster, are the only one who can help the beauties revive their souls.<br/><br/><br/><br/><br/><br/><h3>Gameplay:</h3><br/><strong>Project: MIRROR!</strong> is a fascinating puzzle game about making combinations of multiple crystals! 100 vibrant levels with hot girls and a variety of visual, sound effects await you. <br/><br/><ul><li>In this game you have to correctly pick up the same crystals in a row so that they disappear. Your goal is to score points and unlock new levels.<br/></li><li>After you pass several levels, you will have beautiful girls available in the gallery Collect the necessary number of points and conquer one level after another with beautiful and amazing girls.</li></ul><br/>With each new level, collecting souls and smashing crystals will become more and more interesting! Enjoy a fun game and beautiful, hot girls at the same time! Lots of cool levels with great effects are waiting for you! You'll be hooked on this game!<br/><br/><br/><br/><br/><br/><h3>Game features:</h3><br/><ul><li> Incredible visuals<br/></li><li> Complete levels and get stars<br/></li><li> Unlock and collect images<br/></li><li> Get 100 achievements<br/></li><li> Relax to the music during the game<br/></li><li> You can skip any level with one tap <br/></li><li> Enjoy your day with cute girls!</li></ul>", "metacritic": null, "released": "2023-01-23", "tba": false, "updated": "2023-10-26T16:43:14", "background_image": "https://media.rawg.io/media/screenshots/671/67178b0d9581ae1b83f6b196e093c8c8.jpg", "website": "https://twitter.com/F430_", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 4, "achievements_count": 131, "ratings_count": 0, "suggestions_count": 534, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["430Games", "Artist BOA"], "genres": ["Casual"], "publishers": ["MediBang", "430Games"], "esrb_rating": null}