{"id": 914832, "slug": "stellas-pointless-castle-awakening", "name": "Stella's Pointless Castle Awakening", "name_original": "Stella's Pointless Castle Awakening", "description": "The mysterious cathedral of Luna Beatrice was founded by Luna and Beatrice. Luna is the Queen of the Kingdom of Lunaria and Beatrice is her top general. The cathedral is located in the heart of the capital, where Luna lives with her subjects. This place is where all important royal affairs take place. It's also where a lot of people come for spiritual guidance.<br/>\n<br/>\r\nLuna has always been a very serious person who doesn't seem to have much interest in anything other than governing her nation. She often keeps herself locked away from the public due to her busy schedule. Although she loves her country deeply, she also feels that this is not enough reason for her life to be lived. She wishes to find something else which gives meaning to her life. Unfortunately, nothing ever seems to satisfy her. Whenever she finds solace through some activity or hobby, it would only end up leaving her empty and dissatisfied after a period of time. To cope with this empty feeling, she ordered her subjects to renovate the cathedral and the library. Years later her fruits of labour is presented to new visitors and each are delivered with an experience of a lifetime. <br/>\n<br/>\r\nStella's Pointless Castle Awakening is a third-person puzzle adventure game that takes place in a mysterious castle. The player controls a female knight and embarks on a little adventure to uncover the truth about the site. There are many obstacles that will prevent the player from finding the truth behind everything but everything will slowly start to make sense the more the player investigates the points of interest in the game.<br/>\n<br/>\r\nSolve puzzles and collect items to increase your score! Interactive environmental puzzle based progression and the high score based arcade gameplay loop are the main features of this game. This game suits those who seek casual experiences and challenging arcade-style gameplay. <br/>\n<br/>\r\nThere are multiple ways to complete the game loop and that will be up to you the player to find out!<br/>\r\nThe game has a story but it isn't the main focus of the game, the game is fully focused on the character's interaction with the environment. The decisions you make matter and they will determine whether or not you will reach its end!<br/>\n<br/>\r\nBy making your purchase, you get the up-to-date full game, no DLC, and no micro-transactions. <br/>\r\n(The game supports mouse and keyboard controls. Controllers are not supported.)", "metacritic": null, "released": "2023-01-24", "tba": false, "updated": "2023-01-27T03:20:25", "background_image": "https://media.rawg.io/media/screenshots/0af/0affbef04740ef672bca601fe4a69981.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kingdom Pots"], "genres": ["Action", "Adventure", "RPG", "Casual"], "publishers": ["Kingdom Pots"], "esrb_rating": null}