{"id": 914842, "slug": "neptunia-sisters-vs-sisters", "name": "Neptunia: Sisters VS Sisters", "name_original": "Neptunia: Sisters VS Sisters", "description": "Neptunia™: Sisters VS Sisters is an action RPG set in the vibrant world of Gamindustri. Hack 'n' slash your way through hordes of dangerous enemies found in the many dungeons throughout the land while trying to defeat a mysterious, new phenomenon that threatens life itself. Lead the Goddess Candidates, the younger sisters of the 4 Goddesses of Gamindustri, through their first adventure to save the world!<h3>Key Features</h3><strong>C-C-C-Combo Maker!</strong> – As you make your way around the lands of Gamindustri, you'll encounter a multitude of enemies - it's time to fight! Employ combos and chain your attacks together in real-time. Take control of the battlefield in a unique tactical action battle system!<br/><br/><strong>Get the Planeptune Look </strong>– Throughout the game you'll discover fun accessories to deck out and customize your party members. After completing the game for the first time, you can show off your style in the new Photo Mode! You'll also unlock two BRAND NEW characters created by two legendary game developers - Higurashi from Ryukishi07 and Shanghai Alice from ZUN!<br/><br/><strong>Do You Hear the People Chirp?</strong> – In the wake of the devastation wrought by the Trendi Phenomenon, the vast majority of the population has turned to the rPhone for all manner of daily life, including communication. On your journey, connect to the Chirper social network to take on a variety of side quests put out by those in need and earn special rewards!<br/><br/><strong>Match Game '23</strong> – On the battlefield you can have three party members out at a time. Match up your team members with a partner for stat increases and elemental bonuses. The stronger the bond, the better the bonus!<h3>Story</h3>While the Goddesses were out responding to a distress call from the faraway PC Continent, Nepgear and the other Candidates were dispatched to an abandoned research facility in order to investigate a monster outbreak.<br/><br/>It was there that they encountered the Ashen Goddess, who trapped them in a capsule and placed them in a deep sleep. By the time they awoke, they were astonished to discover that 2 years had passed.<br/><br/>After they emerge from slumber, they learn that Neptune has been missing since her mission to the PC Continent 2 years ago, and in the absence of its Goddess and Candidate, Planeptune was ravaged by a series of strange outbreaks, collectively referred to as the Trendi Phenomenon.<br/><br/>Suddenly finding herself robbed of home and family, Nepgear is met with the greatest challenge she's ever faced. <br/><br/>This is a story about finding hope in the midst of despair, and the rebirth of a Goddess in the wake of destruction.", "metacritic": null, "released": "2023-01-24", "tba": false, "updated": "2023-09-15T00:17:29", "background_image": "https://media.rawg.io/media/screenshots/000/000d05f5617caed65fba507aa0655b18.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 7, "toplay": 4, "dropped": 1}, "playtime": 4, "achievements_count": 28, "ratings_count": 2, "suggestions_count": 460, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Idea Factory", "Compile Heart"], "genres": ["Action", "RPG"], "publishers": ["Idea Factory"], "esrb_rating": null}