{"id": 914912, "slug": "hot-sento-girls-and-love", "name": "Hot Sento Girls and love", "name_original": "Hot Sento Girls and love", "description": "\"Hot Sento Girls and love” is a visual novel game with no choice.Story\nWhy do I have to dress up as a woman!?\n<br/>\n<br/>\nAsahi Kirisaki, who was just taking it easy during his summer vacation, finds out that his grandmother has been hospitalized.\n<br/>\n<br/>\nAnd his grandma's hospitalization put the Sento she ran in danger of having to close permanently.\n<br/>\n<br/>\nWanting to do something about it, he talked to his sister, Jun Kirisaki, about it.\n<br/>\nShe asked him if he was really serious about it.\n<br/>\n<br/>\nAfter Asahi replied \"of course I'm serious!”,\n<br/>\nJun handed him a paper bag.\n<br/>\nInside there was a wig and girls' clothes.\n<br/>\n<br/>\nJun explained the basic rule of Himenoyu which Asahi had totally forgotten:\n<br/>\nthat it has to be a woman sitting behind the attendant’s booth.\n<br/>\n<br/>\nAsahi had to figure out how to wear girls’ clothes.\n<br/>\n<br/>\nIn addition, because Asahi had accidentally walked in on the part-time worker, Chika Kirie, while she was taking a shower, he also has to dress up as a girl to hide his identity from her. \n<br/>\n<br/>\nIn this way, Asahi reopened his grandma’s Sento business while dressing as a girl.\n<br/>\n<br/>\nWhat will happen to Sento in the future?\n<br/>\nCan Asahi pull off his crossdressing without being exposed?\n<br/><br/>\n<p>This Game may contain content not appropriate for all ages or may not be appropriate for viewing at work.</p>", "metacritic": null, "released": "2022-08-31", "tba": false, "updated": "2023-01-27T05:14:00", "background_image": "https://media.rawg.io/media/screenshots/03a/03a8a2ba0ff41746936ca356e7906442.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 266, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["iMel", "Rosetta"], "genres": [], "publishers": ["iMel"], "esrb_rating": null}