{"id": 914914, "slug": "fantasy-tavern-sextet-vol2-adventurers-days-2", "name": "Fantasy Tavern Sextet - Vol.2 Adventurer's Days", "name_original": "Fantasy Tavern Sextet - Vol.2 Adventurer's Days", "description": "The 2nd part of a 3 part series!\n<br/>\n<br/>\nIt is an adventure game where you can enjoy a slapstick love harem play with laughter, tears, and a little H in a bar in a different world.\n<br/>\n<br/>\nThe \"E-mote\" engine that can move illustrations smoothly and three-dimensionally is used for standing pictures in the game.\n<br/>\nThe characters displayed on the screen move as if they were alive.STORYOne day, several days after our protagonist the young cook in the back of an Akihabara maid cafe got transported to another world, our hero gets paid a visit by the lady knight Dahlia at Lupine's tavern.\n<br/>\n<br/>\nDahlia proclaims to the hero, \"I want you to make me a woman,\" which leads to all kinds of misunderstandings with Lupine and Daisy, who have a barrage of questions!\n<br/>\n<br/>\nAfter getting filled in on what she actually meant, it's revealed that Dahlia's aim is to defeat a monster who only preys on women. However, for Dahlia, who has only ever lived by the sword, femininity feels like an alien concept. \n<br/>\n<br/>\nTo help increase her feminine charms, Dahlia becomes a waitress at Lupine's Tavern, and her inexperience leads to all kinds of trouble with the guests!\n<br/>\n<br/>\nOur hero has no idea that this turn of events will lead him to help Dahlia and Veronica take down their archnemesis from the past...CHARACTER\n<br/>\nDahlia\n<br/>\nCV:Matsuda Risa\n<br/>\n<br/>\nDahlia is a lady knight and regular customer at The Stray Sheep.\n<br/>\nShe's on a journey pursuing a particular monster,\n<br/>\nbut also is lending her support in the revival of the tavern.\n<br/>\n<br/>\n<br/>\nVeronica\n<br/>\nCV:Tezuka Ryoko\n<br/>\n<br/>\nVeronica is mage with a great fondness for drinking.\n<br/>\nShe's always kidding around, but her skill with magic is top class.\n<br/>\nShe and Dahlia are life partners.Feature\n・Smooth character animation via the E-mote system\n<br/>\n・Different  routes and ED\n<br/>\n・High quality event CG\n<br/>\n・Story set in an actual Japanese townSTAFF\n・Illustration: WaonInui\n<br/>\n・Scenario: Linkedbrain Inc.\n<br/>\n・Producer/Planner: Yujiro Usuda\n<br/><br/>\n<p>This Game may contain content not appropriate for all ages or may not be appropriate for viewing at work.</p>", "metacritic": null, "released": "2021-02-17", "tba": false, "updated": "2023-01-27T05:17:09", "background_image": "https://media.rawg.io/media/screenshots/fef/feffb2442499d5accfc7a22acd140c5a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 457, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["qureate", "iMel"], "genres": [], "publishers": ["qureate"], "esrb_rating": null}