{"id": 914902, "slug": "agent-roy-zombie-hunt", "name": "Agent Roy - Zombie Hunt", "name_original": "Agent Roy - Zombie Hunt", "description": "<h3>Agent Roy - Zombie Hunt</h3><br/>Agent Roy - Zombie Hunt is the second instalment of the Agent Roy series.It is a thrilling 3rd person action shooter game. The horror is back. 300 Zombies. 15 houses. 1 village. Agent Roy, with his impeccable skills and vision, has accepted the challenge. He has to face his worst nightmares and bring the nation to peace. <br/><br/><h3>Story</h3>Canory Village, home to four active Nuclear power plants, is directly responsible for supplying energy and power to the national grid. Over 300 people work here in shifts. These workers stay around the plants in the same village. <br/><br/>Things were working as usual and as per plan, until a safety test went rogue which resulted in the horrific poisnous xenon gas leak<br/><br/>Usually a festive and hearty village, after the blast the occupants of the entire village is either dead or missing with no sign of life anywhere. Whoever was alive are evacuated out.<br/><br/>Four months have passed like this, without a pinch of life in the area. <br/>Suddenly the village is hit by a heavy flood. A footage shows something disturbing, all the corpses in the village are now rising from the dead, killing and eating each other and the zombies are now approaching the mainland.<br/><br/>As per the sources, every household which once existed in the village is now affected and the entire area is now filled with cannibal zombies. <br/>The government is helpless with the chaos around, and none of the Special forces are ready to help the country from its downfall.<br/><br/>Agent Roy has accepted the challenge. Can he complete this almost impossible mission?<h3>Key Features</h3><strong>Intriguing Terrain</strong><br/>Set in a Dangerous and Engaging map, you will be fascinated to want more!<br/><br/><strong>Action Packed</strong><br/>Pushes the boundary of 3rd person shooter, Multiple types of Zombies - it challenges you to your worst limits!<br/><br/><strong>Simple Controls</strong><br/>Powerful, but easy-to-use game controls that enables you to enjoy the game to its fullest!", "metacritic": null, "released": "2023-01-26", "tba": false, "updated": "2023-01-27T04:55:41", "background_image": "https://media.rawg.io/media/screenshots/87c/87c3501bbd7c1542868be4800c1f7f00.jpg", "website": "https://agentroy.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 280, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Royex Studio"], "genres": ["Action", "RPG"], "publishers": ["Royex Technologies"], "esrb_rating": null}