{"id": 91505, "slug": "melody-itch", "name": "Melody (itch)", "name_original": "Melody (itch)", "description": "<p><strong>MELODY</strong><br/><strong>THE COMMUNITY DRIVEN RHYTHM GAME</strong><br/>Facebook | Development Log | Subreddit | Donate</p><p>MELODY is a free to play mobile rhythm game with a dedication towards beautiful art and rewarding, exciting gameplay. We of the development team have envisioned MELODY to suit a wide audience of gamers and encourage players to play it as they'd like; </p><strong>MELODY OFFERS</strong>:<ul><li>A thoughtful, deep storyline with cinematic cutscenes and an immersive world</li><li>An engaging game mode with explosive visuals </li><li>A community say in the music we source from artists</li></ul><p><strong>COMMUNITY DRIVEN CONTENT: <br/>HAVE A SAY IN THE GAME, NOW AND ALWAYS</strong></p><p>MELODY will thrive on its music selection and we're committed to releasing playable tracks that our players want to hear. We've decided to introduce crowdfunding in a unique manner to keep the game free to play while delivering what our users want:</p><p>Each in game track costs money to produce; from the art, animations, and reworking of code, to licensing the actual tracks for commercial use. In order to meet this requirement multiple times to release new content, we put up a minimum quota, funded by players, to release new songs in a DLC pack. Once our quota is met, we will go into production of new playable tracks. This is where the community gets a voice; whoever donates to this cause get a say in what tracks we pursue. Want us to vigorously pursue a new Porter Robinson track? What about your own band's song? With your backing, we'll go for it.<br/></p><p><strong>HOW TO PLAY</strong></p><p>We'lll be releasing an update soon that has animated instructions in game, but before that; a text based version:</p><p>Notes come randomly from all directions toward the center of the screen. Once the note reaches the white ring, tap on the note. If it was successful, the ring will pulse gray and the note will break into little particles. If the note is not hit, it'll break apart into red particles at the sphere in the center. Right now, there is no health to fail a song, so feel free to just play through it. </p><p>WHAT DO YOU THINK? HAVE FEEDBACK FOR US?<br/>Tell us what we're doing right and what can be improved on at this feedback link. </p>", "metacritic": null, "released": "2015-06-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9b4/9b4b190340e028c4b98e7e0f91650038.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["melodygame"], "genres": [], "publishers": [], "esrb_rating": null}