{"id": 915237, "slug": "lost-awakening-chapter-1", "name": "Lost Awakening, Chapter 1", "name_original": "Lost Awakening, Chapter 1", "description": "<p><strong>Discover the grand mystery behind the island you wake up on...<br/></strong></p>\n<p><strong>Chapter 1 -----&gt; Chapter 2 -----&gt; Chapter 3 </strong></p>\n<p>-------\r\n</p>\n<p><strong>WISHLIST THE LOST AWAKENING REMAKE ON STEAM!</strong>\n</p>\n\n<p><strong>=================</strong></p>\n<p>Lost Awakening is a strange and comedic point-and-click puzzle adventure, with witty dialogue and an intriguing story. Discover the grand mystery behind the strange island that you wake up on. The island's great secret isn't a smoke monster or an ancient fraternal rivalry, but it may just blow your socks off.\r\n</p>\n<p>Along the way of our character's journey, you'll hear his whole catalog of obnoxiously pun-tastic whit, which is certainly not juxtaposed to the atmosphere of the island. Lost Awakening uses its unique music and art style to create an atmosphere not only of mystery and intrigue, but also of hilarity and absurdity. \r\n</p>\n<p>The game's puzzles, just like the atmosphere, exude uniqueness. While they will, no doubt, at times leave the player thinking long and hard, the puzzles are always fair and sensible. They are easy enough for any player to be capable of solving them with enough time, yet difficult enough for every player to feel satisfied at every point of progression.\r\n</p>\n<p><strong>=================</strong></p>\n<p><strong>JOIN US ON DISCORD!</strong>\n</p>\n<p>\n</p>\n<p><strong>=================</strong></p>", "metacritic": null, "released": "2023-01-26", "tba": false, "updated": "2023-01-27T07:27:35", "background_image": "https://media.rawg.io/media/screenshots/3eb/3eb53a8702b620eb4573612bd6b7142f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Hambug Games"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}