{"id": 915289, "slug": "invasion-evasion-earths-destruction", "name": "Invasion Evasion: Earth's Destruction", "name_original": "Invasion Evasion: Earth's Destruction", "description": "<p>Welcome to <strong>Invasion Evasion: Defend </strong><strong>the earth.</strong></p>\n<p>Use <strong>spacebar</strong>, <strong>w</strong>,<strong> or up arrow to go up, </strong><strong>don't press anything to go down.</strong></p><p>Watch out for the next game, escape to space</p>\n<p>[<strong>STORY]</strong></p>\n<p>your flying powers were too powerful for humans to comprehend so they sent you away... launched into space. Many years later you discover the green and blue planet that you loved... but something was different. The Earth was a desolate wasteland, ravaged by an alien invasion. The cities have been reduced to rubble, their towering skyscrapers now nothing more than twisted metal and broken concrete. The streets are littered with debris, and the only signs of life are the scattered survivors, struggling to survive in the ruins. The once-blue skies are now clouded with ash and smoke, the result of the relentless bombardment from the alien ships. The oceans, once teeming with life, are now barren and lifeless, their waters poisoned by the invaders' weapons. The once-green forests and fields have been reduced to ash and dust, the only remaining vegetation being twisted and mutated by the radiation. The humanity is on the brink of extinction, with few resources and no hope left. But you won't let this happen. There is one spot of life still left, the aliens know this and they have been waiting. NOW YOU MUST SURVIVE AND DEFEND YOUR BELOVED EARTH!</p>", "metacritic": null, "released": "2023-01-26", "tba": false, "updated": "2023-01-27T07:49:56", "background_image": "https://media.rawg.io/media/screenshots/cac/caca24c5c1158e5829d6e79681a2baa5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["V0ld"], "genres": [], "publishers": [], "esrb_rating": null}