{"id": 91525, "slug": "wobbegong-land", "name": "Wobbegong Land", "name_original": "Wobbegong Land", "description": "<p>~nothing but islands~</p>\n<p>this is an ecological, impressionist, arcade life sim. well it's a cute low rez software world. well it's a silly bouncy car game thing. you're a little blue amphibious car/creature. you're good at bouncing, and swimming, and dreaming. live your life out in these islands, isthmuses, atolls, arroyos, lagoons, billabongs, barachois and beaches, deltas and fjords and mangroves and meres, tide pools, puddles and tarns.</p>\n<p>~</p>\n<p>this game is a work in progress. it's <strong>nowhere near finished</strong>.. releasing builds now just for fun.. every few months, i spend a couple weeks tinkering with it. nobody knows when it may be done. there's no sound or music yet.</p>\n<p>paying a bit is appreciated if you'd like to support my work, but you're totally welcome to download it for free. </p>\n<p>this build contains two .exe files: one fullscreen, one windowed. fullscreen is locked to 1920x1080 for now.</p>\n<p>~</p>\n<p>how to play:</p>\n<p>it only has keyboard controls at the moment. cursor keys are all you need.....<br/>LEFT and RIGHT to drive left and right.<br/>UP and DOWN to swim up and down. <br/>also UP to squirt water and wall jump, <br/>DOWN to pogo on stars you've dug up.</p>\n<p>ADVANCED TECHNIQUE spinbounce: fly backwards through the air until you pulse, then flip forwards again. spinbounce is activated upon landing. UP/DOWN keys cancel spinbounce (try chaining these for SECRET TECHNIQUE nosebounce!!)</p>\n<p>leap into Space Things to warp to different islands. (or press N to restart the game if you get stuck)</p>\n<p>find a place you feel at home, sit back on your wheels, relax...</p>\n\n\n<p> BONUS NOTES</p>\n<p>* apparently this runs double speed on 120hz monitors. vroom!</p>\n<p>* the music in the video is not part of the game (yet?). check my stuff on bandcamp if you want a copy - [eryngi bandcamp] [zzaapp records] =)</p>", "metacritic": null, "released": "2018-02-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/39f/39f44dc18885de5666e97c0ede29832b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["ERYNGI"], "genres": ["Action"], "publishers": [], "esrb_rating": null}