{"id": 9153, "slug": "tetris-blitz", "name": "Tetris Blitz", "name_original": "Tetris Blitz", "description": "Experience the new high-speed, action-packed take on the iconic block puzzle game! It’s two-minute Tetris® with exciting fresh features, including a stunning look and feel, rewarding Power-Ups to get as you climb levels, and intense Battles with friends. Best of all, it’s free. <br/><br/>UNLOCK GAME CHANGING POWER-UPS<br/>Supercharge your game and trigger point-boosting reactions with exciting Power-Ups and Finishers like Frostbite, Crusher, Mino Rain, and more. Each Power-Up and Finisher has a unique action in the game that provides the best way to play, compete, and earn your highest score yet!<br/> <br/>PLAY YOUR WAY<br/>Race to reach top scores, clear a set number of lines with specific Power-Ups, or collect as many Coins as you can. Complete Daily Challenges and level up to play bonus Gold Rush rounds and win even more rewards.  <br/> <br/>FEEL THE FRENZY<br/>Enjoy awesome explosive effects and earn double points when you trigger the elusive Frenzy mode. Clear back-to-back lines to stay in Frenzy and get blown away by stunning cascades that keep the points rolling in.<br/> <br/>BATTLE FRIENDS FOR VICTORY<br/>Aim for a personal best score and earn bragging rights as you fly past your friends on Leaderboards. Match your skills against other players in head-to-head BLITZ Battles, or race to victory in limited-time Tournaments and see if you can take home the win.<br/> <br/>User Agreement: terms.ea.com<br/>Visit https://help.ea.com/ for inquiries. <br/><br/>EA may retire online features and services after 30 days’ notice posted on www.ea.com/1/service-updates.<br/>Important Consumer Information: This app: Requires acceptance of EA’s Privacy &amp;amp; Cookie Policy and User Agreement; collects data though third party ad serving and analytics technology (See Privacy &amp;amp; Cookie Policy for details), contains direct links to social networking sites intended for an audience over 13; contains direct links to the Internet.<br/><br/><br/>Tetris ® &amp;amp; © 1985~2016 Tetris Holding. All Rights Reserved.", "metacritic": null, "released": "2013-05-23", "tba": false, "updated": "2019-09-17T12:34:17", "background_image": "https://media.rawg.io/media/screenshots/bde/bde92c356326c0cc9aff3dabb8c2f4a8.jpg", "website": "http://www.ea.com/iphone", "rating": 3.18, "rating_top": 3, "added_by_status": {"yet": 3, "owned": 55, "beaten": 3, "dropped": 4}, "playtime": 0, "achievements_count": 17, "ratings_count": 11, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 11, "platforms": ["Android", "iOS"], "developers": ["Electronic Arts"], "genres": ["Puzzle"], "publishers": ["Electronic Arts"], "esrb_rating": "Everyone 10+"}