{"id": 915338, "slug": "coroa-de-escamas", "name": "Coroa de Escamas", "name_original": "Coroa de Escamas", "description": "Enredo\r\n<p>Há muitos anos no passado, o mundo era governado por seis divindades distintas, cada uma era responsável por um poder conhecido como \"elemento\". Com esses poderes, essas divindades controlavam o fluxo de todas as coisas, como a forças da terra, a velocidade dos ventos, a temperatura das lavas, o crescimento das plantas, até mesmo o ir e vir da vida.</p>\n<p>Foi então, que uma raça de seres vivos encontraram uma maneira de obter acesso a esse poder. Multiplicando-se e tomando terras, esses seres começavam a se tornar mais hostis, até que depois de séculos e séculos, uma guerra estourou. Com a vitória, estes seres, agora conhecidos como \"os filhos dos homens\", ao expulsarem todas as divindades deste mundo, guerreiam entre sí usando os poderes elementais... Mas ainda há uma chance!</p>\n<p>Existe uma lenda, o líder da revolução, aquele que voltará para reclamar o trono dos seus antepassados, aquele que busca o que é seu por direito. O descendente direto das antigas divindades que usará de sua coragem para juntar seguidores, tomar de volta seu trono e novamente tomar posse da Coroa de Escamas!</p>\n<p>Nessa história, controlamos Ryu (masculino) ou Ryo (feminino), que foi adotado(a) por um pequeno vilarejo em uma ilha congelada, após a morte de sua mãe ao lhe dar a luz. Até que um dia um estranho homem vestindo uma armadura negra aparece e afirma que Ryu/Ryo é muito mais do que apenas um(a) adolescente e que há um futuro muito grandioso pela frente.</p>\r\nSobre a DEMO\r\n<p>Logo abaixo você encontrará o download da demo versão 1.0. Gostaria de alertá-los que existem uma série de bugs e alguns problemas de plugins que eu ainda não consegui resolver, além de possíveis erros de digitação e de português (por mais que eu revise, muitos passam por mim despercebidos). Por favor apreciem a história e o entretenimento que quero passar pra vocês, acredito que os bugs não irão atrapalhar sua experiência.<br/></p>", "metacritic": null, "released": "2023-01-25", "tba": false, "updated": "2023-01-27T08:11:54", "background_image": "https://media.rawg.io/media/screenshots/15b/15b27cc9475dd46ca8c2b8f2ce51ee12.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kitto_Santana"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}