{"id": 915599, "slug": "a-little-story-of-p", "name": "A Little Story of P", "name_original": "A Little Story of P", "description": "A Little Story of Prambanan\r\n\n<p>Bandung is a magical knight from the Penging Kingdom and has 2 genie bodyguards named Bondo and Woso so it is known as Bandung Bondowoso. The Penging Kingdom led by Bandung Bondowoso conquered the Prambanan Kingdom and killed King Prabu Baka. Bandung Bondowoso was crowned to occupy the palace of the Prambanan Kingdom, and take care of all the needs there. Inside the Bandung Bondowoso palace, he fell in love with a very beautiful woman named Roro Jongrang, the daughter of Prabu Baka, the king of the Prambanan Kingdom who was conquered by Bandung Bondowoso. Of course Bandung Bondowoso's love was rejected because he had killed Prabu Baka, the father of Roro Jongrang. Bandung Bondowoso insisted until Roro Jongrang made his last request, namely that 1,000 temples be made in one day before dawn and the cock crows. Here is the story...\r\n</p>\n<p>\n</p>\n<p>- Team Rehunter Playground\r\n</p>\n<p> Alghifar Abdul Ghoffar - Game Designer \r\n</p>\n<p> I Gusti Ngurah Agung R Aditya A Saputra - 2D Artist\r\n</p>\n<p>Ibrahim Hafizhuddin Muttaqi - Game Programmer\r\n</p>\n<p>Abdul Azziz Bian Azzura - Game Programmer\r\n</p>\n\n<p>this is repost  from   https://arthurknight24.itch.io/a-little-story-of-prambanan and I added a few additional assets picture for this page</p>\n<p>while this is team project for gamejam+,  we actually had 3days to make but unfortunately we only have 1 day  to finish it because of other activities we need to attend<br/></p>\n<p>for the character was inspired by  cyberpunk style pixel art<br/>and tile map by legacy fantasy asset</p>", "metacritic": null, "released": "2023-01-25", "tba": false, "updated": "2023-01-27T10:09:42", "background_image": "https://media.rawg.io/media/screenshots/c53/c53d25f2a40ea788291d699624fec545.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ATWO"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}