{"id": 91568, "slug": "gift-shop-factory", "name": "Gift Shop Factory", "name_original": "Gift Shop Factory", "description": "<p>This is my entry for GBJAM 6, and my first time working alone in a JAM (pixelart, coding and music). Gift Shop Factory is a score action-puzzle game where you have to assembly the final parts of the products that will be sold as gifts. Grab the piece from the pipe, throw it to match its correspodent part and safely put the final product on the warehouse's passage. Don't mix stuff up, dont break anything either! The boss is watching you and will be fire if you make too much mistakes. Try to survive until your shift time is over and aim to the highscore!</p>\n<p><strong>A CHALLENGE FOR YOU!! </strong>Although this is an endless game, at the end of your shift, the boss will comment on your perfomance. Will it be bad... or it will be good? There's different comments she can give you, but will be able to make she thinks your job was \"very impressive\"? This is the best comment you can get from her, so try your best to impress her!</p>\n<p><strong>NOTES</strong><em> (please read before playing)</em></p>\n<p>- Because this game was made for a Jam, it may contains some bugs I overlooked because the time. Please report me back if you find something weird so I'll fix and reupload the game after this Jam is over.<br/>- This game is better played at Fullscreen, some bugs may occours while playing in Windowed Mode so I recommend playing in Fullsreen if possible.<br/>- If you open the game and the screen is white, goes to Windowed Mode (Alt + Enter), to see the image, then Alt + Enter again to go back to Full Screen.<br/>- If you open the game for a second time after you have played (or at least have reached the title screen after the introduction), but you don't see the message 'ESC: SKIP' on top-left at the introduction, it means the game failed to save your progress (this is rare to occurs). You can still skip the intro by pressing ESC though I highly recommend see the funny introduction to learn how to play (and because it was an extra work I did too, lol).<br/>- I hope you enjoy playing this game! I'd love to see your feedback and if you like this game, you can try other games at my page. <strong>Thanks for playing!!</strong></p>", "metacritic": null, "released": "2018-08-24", "tba": false, "updated": "2019-08-28T23:26:07", "background_image": "https://media.rawg.io/media/screenshots/fcf/fcf3dfc93bf6c9bc173cb00594c17819.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["manoelpdb"], "genres": ["Action"], "publishers": [], "esrb_rating": null}