{"id": 915657, "slug": "tap-the-cube-an-ai-made-this-game", "name": "Tap the Cube (An AI Made this Game)", "name_original": "Tap the Cube (An AI Made this Game)", "description": "<p>This game was designed bt ChatGPT and the code was generated by ChatGPT. The image assets were generated by Dalle2 with prompts generated by ChatGPT.</p>\n<p>The game was made on livestream.</p>\n\n<p>Here's the game design ChatGPT made:<br/></p>\n\n<p>Game Title: \"Tap the Cube\"</p>\n<p>Objective: The player must tap a cube that appears on the screen as quickly as possible. The game will track the player's score, which is the number of times the player successfully taps the cube before it disappears.</p>\n<p>Instructions:</p>\n<ol><li>The game will start with a 3-second countdown.</li><li>After the countdown, a cube will appear on the screen at a random location.</li><li>The player must tap the cube before it disappears (after 2 seconds).</li><li>If the player successfully taps the cube, their score will increase by 1 and a new cube will appear at a random location.</li><li>If the player fails to tap the cube before it disappears, the game will end and their final score will be displayed.</li></ol>\n<p>Assets:</p>\n<ul><li>A cube object (can be created using Unity's built-in 3D objects)</li><li>A simple text object to display the countdown, score, and final score</li><li>Background music and sound effects (can be found in Unity's built-in assets or obtained from a third-party source)</li></ul>\n<p>Scripts:</p>\n<ul><li>A script to handle the countdown and cube spawning</li><li>A script to handle the player's input (tapping the cube)</li><li>A script to track the player's score and end the game</li></ul>\n<p>This is a basic example, and there are many ways to expand and improve upon the game, but this should give you an idea of how to get started.</p>", "metacritic": null, "released": "2023-01-24", "tba": false, "updated": "2023-01-27T10:34:10", "background_image": "https://media.rawg.io/media/screenshots/029/029d5a1bf9042ac667e726ac6b97955e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Lua Lucky"], "genres": [], "publishers": [], "esrb_rating": null}