{"id": 915787, "slug": "clothing-store-zem", "name": "Clothing Store (Zem)", "name_original": "Clothing Store (Zem)", "description": "<p>You can check the project git repository directly at:<br/>https://github.com/Zem1991/Clothing-Store<br/></p>\n<p>--<br/></p>\n<p>I did this project as a job interview/test. The assignement was to create a playable clothes shop within 84~96 hours. It went pretty much like a Game Jam does, which means: crunch time, doing stuff I'm not familiar with and having fun above all else. In the end I got pretty satisfied with the final result, especially because I managed to do everything on time and even threw in two extras - inventory management and a dialogue system.</p>\n<p>Sadly graphics are not my forte, but I'm never content with having to scavenge free art assets made by several people with several methods and personal takes. So, yes, I did draw everything. My only imposed limitation was using the Master System Palette.</p>\n<p>Also I have to say that my previous, personal and ancient works on RPG Maker 2003 are still present in my drawing skills.</p>\n<p>Regarding audio, I sampled my own voice as the voice of the singular NPC - the Shopkeeper. All other sound effects were from freesound.org. The music track used was taken from zapsplat.com.</p>\n<p>I wish I could have added more actual content to the game. Initially I planned around 4 to 8 pieces of clothing for each type - head, torso, legs and feet. However, I never had done before an animation system where your character and each individual piece of equipment/clothing animate together.</p>\n<p>When I realized how much work it could become, for a thing that I could very well have to replace at the last second, for a project with a set deadline, I settled for only one shirt and one pair of pants only. At least it's possible to see them animate together with the character.</p>\n<p>Anyway, it was a fun experience, and I did learn some new things from it.</p>\n<p>If you wish to test it, I provided a build, compiled with WinRar/7Zip. Instructions:<br/>* WASD to move around<br/>* E to interact (must be close to something interactable)<br/>* I to open/close inventory (there is also a button on the HUD that you can click)<br/>* ESC to close any window<br/>* You can exit the game by interacting with the front door or by clicking Exit Game on the HUD.</p>", "metacritic": null, "released": "2023-01-24", "tba": false, "updated": "2023-01-27T11:30:59", "background_image": "https://media.rawg.io/media/screenshots/4d0/4d05a178bdbf072e5a9a137d42367d33.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zem"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}