{"id": 915778, "slug": "white-in-the-dark", "name": "White in the dark", "name_original": "White in the dark", "description": "<p>In this game you explore around with your flashlight and try to find the end. There will be enemies so be careful. Some levels require set amount of keys to open the door. Have fun. </p>\n<p>This is the game i made when i started learning making it. It is my first project. It was sitting on my hard drive and i thought why not upload it on itch.io? So here it is. If you guys like it i can continue developing it. </p>\n<p>Notes :</p>\n<p>*There is a secret in the level 3. If you manage to get to the left you will find it</p>\n<p>*If your weapon doesnt shoot when it should just switch weapons and it will work. It is a bug</p>\n<p>*Quality setting does nothing.</p>\n<p>*Your total coin count is saved. It does nothing also. I don't know why i did it.</p>\n<p>*Music might suck because i made it :) </p>\n<p>*That health bar took me 6 hours to make!</p>\n<p>*You can enter every level with the input bar on the main menu. Just type level number and hit enter.</p>\n<p>*Total of 13 levels i think.</p>\n<p>*Every time you load a level background(the one you cant interact) is generated randomly. its cool i think.</p>\n<p>*Expect bugs.</p>\n<p>*If you stuck just restart or load up another level on main menu.</p>\n<p>*Comment if you played and want me to develop further.</p>\n<p>*This game only available here . You are so special :)</p>", "metacritic": null, "released": "2023-01-24", "tba": false, "updated": "2023-01-27T11:27:15", "background_image": "https://media.rawg.io/media/screenshots/87d/87d5f7199a7f19654b269b6e7cb9f007.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AgerGames"], "genres": ["Shooter", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}