{"id": 91575, "slug": "card-defense", "name": "Card Defense", "name_original": "Card Defense", "description": "<p>\r\n\tTower defense meets card game!\r\n</p><p>\n<strong>Controls!</strong>\n</p><p>\n<strong>A + D: Scroll Camera Left / Right</strong>\n</p><p>\n<strong>Spacebar: Speed up time</strong>\n</p><p>\n<strong>Left + Right arrow keys: Change screen upscaling</strong>\n</p><p>\r\n\tMade for #GBJam 5.</p><p>\r\n\tChangelog\r\n</p><p>\r\n\tVersion 1.1 (10/14/2016)\r\n</p><ul>\n<li>New card! Removes target rock or structure. Unlocks at wave 10.</li>\n<li>Card++ chance to draw reduced and unlocks at wave 10 instead of 5.</li>\n<li>Magic tower chance to draw increased, starting cost reduced to 20, and attack speed increased.</li>\n<li>Blade tower cost scaling increased to 2 per time played, and chance to draw increased.</li>\n<li>Archer tower attack speed increased and damage increased.</li>\n<li>Spacebar can now be held to speed up time.</li>\n<li>Added indicators for A + D scrolling the camera.</li>\n<li>Enemy speeds increased.</li>\n<li>Enemy initial health reduced.</li>\n<li>Enemy health gain per wave now increases on waves 5, 15, 25, and 50.</li>\n<li>Starting gems is now 10. (up from 8)</li>\n<li>Starting lives is now 5. (up from 3)</li>\n<li>Fixed bug with death animation.</li>\n<li>Fixed bug where Heal's card cost was not scaling.</li>\n<li>Fixed bug where camera upscaling was only showing part of the screen.</li>\n</ul><p>\n<br/>\n</p><p>\r\n\tCreator's post-project perspective:\r\n</p><p>\r\n\tOverall this project did not reach the height I was wanting in terms of strategic choice variety the player has. I think this mixture of genres has a lot of potential, and I'll probably spend some time building upon it in the future. The only big feature I did not find time to fit in was enemy abilities, which is why there is such a variety of enemies some of which are the same stats wise.\r\n</p><p>\r\n\tThe jam limitations were extremely useful from a learning perspective. Each individual pixel is valuable and you will be forced to think creatively to solve related problems. This was the longest jam I have done, as well as the first jam where I was putting my more complex programming knowledge against the clock. The jam's length also tested my will; The last few days I was struggling to push myself to finish, almost giving up on the last day. The artist I had started the jam with also dropped out mid way through the week, forcing myself to come up with art- <em>something I usually use as an excuse</em>- on my own. I'm really glad I didn't give up in the end.\r\n</p><p>\r\n\tThis is an excellent portfolio piece, even if it stays as-is. I'm really glad to have taken part.\r\n</p>", "metacritic": null, "released": "2016-10-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4fd/4fd75b25b911ea31f420767dc89a0e6c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bamboy"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}