{"id": 915938, "slug": "gravity-express", "name": "Gravity Express", "name_original": "Gravity Express", "description": "<p>In Gravity Express, you battle gravity while transporting cargo through abandoned mines.</p>\n<p>Clients will demand speedy delivery, fuel economy, and won't be paying for your funeral. You better find your way fast while avoiding the rocky walls, magnets and cannons that spell your doom.<br/></p>\r\nFeatures\r\n<ul>\n<li> A Playdate First: Full Motion Video cutscenes and level-previews</li>\n<li>Explore 25 levels, with 3 challenges to complete for each level</li>\n<li>7 hazards; such as cannons, magnets and one-way gates</li>\n<li>5 pickups like keys, turbo and fuel</li>\n<li>No loading screens, anywhere. @Guv_bubbs: <em>\"This... this feels snappy!\"</em></li>\n<li>Unique levels with their own characteristics: maze, speedway, zen, easy and hard</li>\n<li>Fully customizable button mapping, physics and graphics styles. Want to turn gravity upside down? Go crazy!</li>\n</ul>\r\nSwitch it up!\r\n<p>Gravity Express allows you to switch between crank and button control schemes during gameplay.<br/>Together with re-assignable buttons - another Playdate first -, this leaves the choice of how you want to play the game firmly in your hands.<br/>Note: this functionality is in beta, but already in a good shape for general use.</p>\r\nWhat others are saying about Gravity Express\r\n\r\n  \r\n    No doubt in my mind that this is the slickest Playdate game so far. Top tier production!\r\n<br/>\r\n  \r\n  — Matt Septhon, Daily Driver\r\n\r\n\r\n  \r\n    Gravity Express feels splendid to play with its solid frame rate and smart controls.\r\n      I see it living on my Playdate for a long time.<br/>\r\n  \r\n  — @Guv_Bubbs, Playdate Squad\r\n\r\n\r\n  \r\n    Definitely among the most fully-realized games on the Playdate.<br/>\r\n    Bravo!<br/>\r\n  \r\n  — @Professir\r\n\r\n\r\n  \r\n    This is great! I've beaten all the levels twice now on my playdate, and it is great fun. The easier levels are very meditative.<br/>\r\n  \r\n  — @Karl Smith\r\n\r\n\r\n  \r\n    Starting video was amazing. I cried like a ***** when I was watching it!<br/>\n<br/>Incredibly cool.<br/>\r\n  \r\n  — @fnc12\r\n\r\n\r\n  \r\n    My most anticipated Playdate game, and it did not disappoint.<br/>\r\n    It looks and sounds amazing!<br/>\r\n  \r\n  — @Rebecca\r\n\r\nWindows Simulator compatability\r\n<p>\r\n  Unfortunately, a bug exists in the Playdate Simulator for Windows that causes severe flickering during video playback.\r\n  Players can skip video segments using the A button.\r\n  This issue does not affect the Playdate hardware or Mac and Linux Simulators.\r\n  The issue has been reported to Panic.\r\n</p>", "metacritic": null, "released": null, "tba": false, "updated": "2023-01-27T12:35:47", "background_image": "https://media.rawg.io/media/screenshots/028/028dc8fd3c227f0de068ff364990da2e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nino"], "genres": ["Action", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}