{"id": 91592, "slug": "spearena", "name": "Spearena", "name_original": "Spearena", "description": "The local multiplayer party game about spearing your friends, family, co-workers and acquaintances\r\n\r\n\t<em>Spearena (:Spear-ena. ) </em><br/>\n<br/>\n<em>1. Verb; The dashingly clever way of joining the words Spear and Arena into one cohesive title made to describe the art of throwing a flaming spear into your friends avatar and watching them become enraged by your actions </em><em>.</em>\n<p>\n</p>\n<p> <strong>In Spearena there is one simple objective: beat your friends and win the game.</strong>\n</p>\n<p> <strong>you can achieve this in multiple ways, but the most obvious is through the use of your sole weapon: a Throwing Spear. Battle and annoy your buddies through 9 maps to prove you're the true master of twin stick shooting and the ultimate spear thrower. Take advantage of the environment and a wide variety of power ups to play the game in your own way.</strong>\n</p>\n<p> <strong>But always remember Rule #1 of Spearena: Your spear is your own and only you alone can use it. </strong>\n</p>\n<p> <em><br/> </em>\n</p>\n<p>\n</p>\n<p>\tNot only can you throw a spear into your friends digital face but you can;</p>\n<p>\t blow them up with \t<strong>explosive </strong>spears, set them on <strong>fire</strong>, <strong>double</strong> (and <strong>triple</strong>) penetrate them or <strong>dash</strong> away,</p>\n<p>\tall through the use of powerups which are scattered around the maps of Spearena,</p>\n<p>\tdon't be a spawn vulture though as you never know what surprises may await you...</p>\n<p>\n</p>\n<p>\t\tRule number 2 of Spearena; your friends are no longer your friends.</p>\n<p>\tactivate <strong>F</strong><strong>lame Walls</strong>,<strong> Pit-fall traps</strong> and the ever classic<strong> </strong><strong>E</strong><strong>xplosive barrels.</strong>\n</p>\n<p>\ttrap your friends or be trapped</p>\n<p>\tOR play defensively, activate <strong>Barriers</strong>, <strong>Ramps</strong>, <strong>Lifts</strong> and <strong>Doors</strong> to shiled yourself from the spear filled fury of your fellow player.</p>\n<p>\n</p>\n<p>\tIn Spearena there are multiple ways to piss off your buddies</p>\r\nFree for all:\r\n<p>\tfight every player for themselves, first to reach the score limit wins! good old traditional deathmatch fun!</p>\r\nElimination:\r\n<p>\tEach player has 3 lives, last man standing wins \t\n</p>\n<p> <em>hint: in this game mode there are extra life power ups, those are gonna be your best friend</em>\n</p>\r\nKing of the Kill:\r\n<p>\tKing of the Hill, but with more impetus. Once you reign King of the Hill for long enough a single kill inside the \"hill\" will earn you a match win, however being killed results in you being dethroned. Regain points lost from your bitter dethroning and make the Kill in the Hill to win.</p>\n<p> <br/>\n</p>\n\n\n<p><em> In the game's current state most of this content is implemented in some way, but this is still in early access, all feedback, positive or negative is welcome, as are feature requests and bug reports</em><br/></p>", "metacritic": null, "released": "2017-03-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/840/840b7efc59da6d4aabc272d1d3981e61.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Iron Moon Studios"], "genres": ["Action"], "publishers": [], "esrb_rating": null}