{"id": 91599, "slug": "east-van-ep", "name": "east van EP", "name_original": "east van EP", "description": "<p>\n<strong>What the flip is this?</strong></p>\n<p>\r\n\tEast Van EP is a collection of four games spanning several years of my growth as an artist and game maker. I think videogames, as a concept, should be more like music, so I've decided to pretend like they are. Purchase the EP now and you will receive three games right now as well as Scary Tapes when it is released. AT NO ADDITIONAL CHARGE!!!!!! WOW!!!! EXTRA FINE DEALS!!!!</p>\n<p><strong>lol. who is this?</strong></p>\n<ul><li>@ceMelusine</li><li>vancouver glitchpunk</li><li>made Glitchhikers with Silverstring Media</li><li>runs Heart Projector Arcade with some dope ass people</li><li>standing right behind u... (jk that's actually a ghost)</li></ul>\n<p>\n<strong>Games</strong></p>\n<ol>\n<li>ORACLE</li>\n<li>Summon The Apgrod</li>\n<li>Star Swim</li>\n<li>Scary Tapes (Coming Late 2018 FOR REALS)</li></ol>\n<p><strong>ORACLE</strong></p>\n<p>Its about being an oracle. I know riiiiiiight. Procedurally Generated Surreal Visions! Prophecies! Ancient Transcendent Horrors! Networks of Signification!</p>\n<p>Music by Dissonant Descendant</p>\n<p>Cover Art by Mariella Villalobos</p>\n<p><strong>Summon The Apgrod</strong><br/></p>\n<p>Who or what is The Apgrod? Find out in this dreamy bartender simulator. First person shooters! Math! Procedural summoning ritual! Three cosmic endings! Big hats!</p>\n<p>Music by Dissonant Descendant</p>\n<p>Cover Art by Mariella Villalobos</p>\n<p>Logo by Valérie Tartavel-Jeannot</p>\n<p>Trailer by Wayward</p>\n<p><strong>Star Swim</strong></p>\n<p>Ever find yourself awakening inexplicably next to a closed, public pool at night? Experience* this adventure firsthand in this short, swimming-pool horror game. Join us for a swim under the stars!</p>\n<p>*Presented in full three dimension!</p>\n<p>Music by Kyle Yakashiro<br/></p>\n<p>Cover Art by Mariella Villalobos<br/></p>\n<p><strong>Scary Tapes</strong></p>\n<p>These tapes will be scary in 2018. Yes i think so. Quote me on it see if i care.</p>\n<p><strong>stuff ppl said about the games. omfg &lt;3</strong><br/></p>\n<p><em>\"Indie game developer ceMelusine makes brief, simple games that offer the player poignant moments of loneliness.</em><em>\"</em> - Leigh Alexander (Offworld)</p>\n<p><em>\"As simple as the gameplay is, every time I boot it up, I find myself hypnotized by the atmosphere and the language. There's something about Oracle that feels oddly grand and ancient.\"</em> - Danielle Riendeau (Polygon)<br/></p>\n<p><em>\"Like the declarations of Mountain, I find the symbols and prophecies pleasing to contemplate; they're little focuses for reflection.\"</em> - Alice O'Connor (Rock Paper Shotgun)</p>\n<p><em>\"The games juxtapose the arcane and the comfortable, asking you to find meaning and purpose.\" </em>- Heather Alexandra (Kotaku)</p>\n<p>\n<strong>But ceMelusine! I can't afford to pay for these games/am press!</strong></p>\n<p>\r\n\tThat's totally cool. I still want you to play the games, so feel free to email me at ceMelusine (at) gmail.com and tell me which games you are interested in playing. I'll will totally hook you up with a copy. Also maybe follow me on the tweester or something (@ceMelusine).</p>\n<p><strong>Special Thanks</strong></p>\n<p>Claris Cyarron, Brendan Vance, Emily Yakashiro, Hannah Marie, Liberty Bell, Lucas J.W. Johnson &amp; especially to all my awesome contributors.</p>", "metacritic": null, "released": "2014-08-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9ac/9acb8920e9d35533cdf177a86a4fa78c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["ceMelusine"], "genres": [], "publishers": [], "esrb_rating": null}