{"id": 915937, "slug": "hartenjagen", "name": "Hartenjagen", "name_original": "Hartenjagen", "description": "<p>A variation on the popular card game Hearts, literally translated from Dutch as \"Chasing/Hunting Hearts\".  Compete against 3 AI opponents in a classic trick-taking card game to win the fewest <strong>Hearts</strong> and <strong>Queens</strong> and be declared the winner. To advance the game, press the A button.  The game rules (also accessible from within the game) are as follows: </p>\r\nPlayers play 1 card each in turn, following the lead suit where possible. The highest-ranked card of the lead suit wins the trick, and the winner leads the next trick. Players may not lead with <strong>Hearts</strong> until a <strong>Heart</strong> has been played. The aim of the game is to avoid winning tricks containing <strong>Hearts</strong> and <strong>Queens</strong>. If a player cannot follow the lead suit, they must play according to the following hierarchy: <strong>Queen of Hearts</strong> (14 points), any <strong>Heart</strong> (1 point), any <strong>Queen</strong> (13 points), any other card. Fewest points accumulated after 4 rounds wins.\r\nWhichever player wins the first trick is given the option to declare that they will attempt to '<strong>shoot the moon</strong>'. If that player declares so and then successfully takes all 65 points in that round, they will instead score 0 points and all other players will score 65 points each. Be warned though: if a player declares they are <strong>shooting the moon</strong> and fail to take all the points in that round they will instead automatically score the maximum 65 points and all other players will score 0 points. Happy hunting.\r\n<p>There are two ways you can play this game:<br/></p>\n<ul><li>You can sideload it to your Playdate console. Instructions can be found here: https://help.play.date/games/sideloading/\r\n</li><li>Or you can download it to your PC/Mac and play it in the Playdate Simulator. The Playdate Simulator is included in the free Playdate SDK, available at: https://play.date/dev/\r\n</li></ul>", "metacritic": null, "released": "2023-01-17", "tba": false, "updated": "2023-01-27T12:35:13", "background_image": "https://media.rawg.io/media/screenshots/2d7/2d7d9a7f70ca6cc0b9dbff3f40e9793c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["uNclearPhysicist"], "genres": [], "publishers": [], "esrb_rating": null}