{"id": 916004, "slug": "gilbert-slaughtermatic", "name": "Gilbert (Slaughtermatic)", "name_original": "Gilbert (Slaughtermatic)", "description": "<p><strong>Controls</strong>: \r\n  You can <strong>Flap </strong>with <strong>Space</strong>, and <strong>Flip </strong>with the <strong>Left and Right Arrow Keys</strong>.<br/></p>\n<p>Hello. I am brand spankin' new to game development. This page is mainly to archive this project for myself to look back on but anyone is welcome to try it out. As you can probably see it runs in browser or you can download a zip containing the .exe.<br/></p>\n<p>The flipping wasn't really viable until I added a new bird. It was small and I adjusted everything for it and now flipping is totally viable. When you flip your movement direction changes so its high risk. Very high skill ceiling on this one. Watch out.</p>\n<p>The game is very silly imo and I had a ton of fun learning and making it. I can't wait to make something new.  I may add to this if I get very bored but I think this is all that I really want to do with it. <br/></p>\n<p>This is my 'Flappy Bird' style game from the Game Maker's Toolkit tutorial. Its a very good tutorial imo. I love that it was left open-ended and I got to figure out a lot of stuff on my own. Perfect format. I added a few things to it. New original bird, original sound, and the ability to flip to gain extra points. I think the flipping is pretty fun. I left in some of the tutorial assets (I think the pipes and clouds are all I left I may change them later).<br/></p>", "metacritic": null, "released": "2023-01-23", "tba": false, "updated": "2023-01-27T13:06:40", "background_image": "https://media.rawg.io/media/screenshots/632/6321f0f35f4ab080be5992c64226b8a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Slaughtermatic"], "genres": [], "publishers": [], "esrb_rating": null}