{"id": 916166, "slug": "decraft", "name": "Decraft", "name_original": "Decraft", "description": "<p>In \"Decraft,\" players take on the role of a master crafter who has been tasked with undoing the work of a rival artisan who has been creating powerful magic items with a dark intention. The rival artisan has created powerful magic items, but with a dark intention, the player's goal is to reverse the crafting process and undo the magic imbued in the items, preventing them from being used for evil.<br/></p>\n<p>The game takes place in a fantasy world, where players must navigate through various crafting stations and gather materials to undo the crafting process. However, instead of creating new items, players must use their skills to dismantle and deconstruct the existing items, breaking them down into their original components. As players deconstruct more and more items, they begin to notice a change in the world. The rival artisan's power starts to wane, and the dark energy that was emanating from the magic items begins to dissipate.\r\n</p>\n<p>As players progress through the game, they will encounter various challenges, such as powerful enchantments and traps that were placed on the items to protect them from being dismantled. But with the help of their crafting skills and knowledge, players can outsmart them and continue their mission.\r\n</p>\n<p>As the players deconstruct more and more items, they begin to piece together the connections between the items and the rival artisan's true plan. They soon realize that the fate of the world is inextricably linked to the rival artisan's magic items. In the end, players must make a final, crucial decision that will determine the outcome of the game and the fate of the world.</p>", "metacritic": null, "released": "2023-01-23", "tba": false, "updated": "2023-01-27T14:23:04", "background_image": "https://media.rawg.io/media/screenshots/580/580beda01e8169500884a2f4ec3c8e12.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["noyloy"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}