{"id": 916153, "slug": "space-harvest-itch-thunderchief-extraspicyy", "name": "Space Harvest (itch) (ThunderChief, ExtraSpicyy)", "name_original": "Space Harvest (itch) (ThunderChief, ExtraSpicyy)", "description": "<p>Space Harvest, an entry to the Ludum Dare 52 Game Jam:</p><p>https://ldjam.com/events/ludum-dare/52/space-harvest-4<br/></p>\n<p>This advanced space station for alien plants will face a terrible ending if you take your time, their death will be on your conscious, shame.\r\n</p>\n<p>As a biologist you love plants, your mission here : collect and gather the exact needed power to get through the teleporter that will lead you to the control room, and finally charging up the Solar Wind Shield. There is a lot of components laying around, with various power income but you would only need 6. Science Fiction never said that things will be easier in the future, those new architectures look fine but a bit mazed up.\r\n</p>\n<p>To get through this, your supervisor wrote up a note with some instructions : “In order to maintain those plants of yours alive, you need to use your muscles (how ironic)\r\n</p>\n<ul><li>Use your muscles “W, A, S, D or ARROWS” to move around ;\r\n</li><li>Use your muscle “E” to pick up items, you lazy worker ;\r\n</li><li>Use your muscle “T” to drop items, but don’t mess your workplace up ;\r\n</li><li>Use your muscle “Left Control” to crouch ;\r\n</li><li>Use your muscle “Left Shift” to sprint, go faster dummy ;\r\n</li><li>Need a break ? Pause Time by Using “Escape”;\r\n</li><li>Use your dexterity “Mouse wheel” to go through your inventory;\r\n</li></ul>\n<p>You better keep this place up and working before I come back, Your delighted boss, Andrew\r\n</p>\n<p>PS : Don’t forget who made this place up :\r\n</p>\n<ul><li>ThunderChief, Developper in charge\r\n</li><li>ExtraSpicyy: 3D Modeling and Texturing\r\n</li><li>Routard : 3D Modeling and Level Design”\r\n</li></ul>\n<p>I hope that you will make it on time.\r\n</p>", "metacritic": null, "released": "2023-01-23", "tba": false, "updated": "2023-01-27T14:18:05", "background_image": "https://media.rawg.io/media/screenshots/15a/15ad3b6cf56034b88fd7a8dc8de01dda.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ThunderChief", "ExtraSpicyy"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}