{"id": 91615, "slug": "empires-of-the-undergrowth-early-access", "name": "Empires of the Undergrowth - Early Access", "name_original": "Empires of the Undergrowth - Early Access", "description": "<p><strong>Please note Empires of the Undergrowth is currently in Early Access.</strong></p><p><em>\"Your queen has set up home beneath a rotting log. She is fat, and vulnerable.  Her first brood will need to move quickly if the colony is to survive. Their priority now is to find food, and there is plenty around; but there are other hungry creatures in the undergrowth. The workers will need to be vigilant.\"</em><br/></p>\n<p>\r\n\tEmpires of the Undergrowth is an ant colony management game, in a fast-paced real-time strategy style. The player excavates their nest underground, constructing tunnels and chambers to store food and raise brood. On the surface, the ants claim territory, gather resources, overwhelm fearsome arachnids and clash with other colonies. Nest design, army size, composition and attack timing are key to securing victory.\r\n</p>\n<p>Missions are narrated from the perspective of a documentary film maker studying the ants, who offers intelligent insight into the goings-on of the colony and the undergrowth beyond. The primary game mode in early access is Formicarium, where you take ownership of a home colony of unique DNA-harvesting ants as they work to assimilate the desirable traits of their foes. You can upgrade them by playing one-off missions, sometimes with your home colony and sometimes with other ant species.<br/></p>\n<ul>\n<li>Carve out and construct your underground nest to suit your strategy</li>\n<li>Engage in fast-paced colony versus colony combat above ground</li>\n<li>Play as different ant species and explore their unique traits and weaknesses</li>\n<li>Encounter and overpower dangerous beetles, arachnids and other awesome arthropods</li>\n<li>Grow your pet formicarium over time by completing missions</li>\n</ul>", "metacritic": null, "released": "2016-05-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/592/59254815f00a0abc06bbda17af4572ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 437, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Slug Disco"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}