{"id": 916251, "slug": "crazy-cretaceous", "name": "Crazy Cretaceous", "name_original": "Crazy Cretaceous", "description": "<p>Save your dinosaurs from extinction</p>\n<p>Everybody knows how it all ended for dinosaurs, millions of years ago. Now that you hold their destiny into your hands, will it be played differently ? Try making a difference : influence their mutations to help them strive in harsher and harsher conditions.\r\n</p>\r\nRules\r\n<p>Save your dinosaurs from extinction by choosing the right mutation cards. Help them become faster and smarter to overcome the harshness of this cruel world. \r\n</p>\n<p>At the beginning of the game, you’ll be asked to choose one mutation card. Afterwards, each time your dinosaurs eat red leaves, you’ll gain experience points. When you reach a new level, you can choose another card and help your dinosaurs evolve to a better version of themselves. \r\n</p>\n<p>As the game goes on, your dinosaurs will eat green leaves to stay alive. If they’re unable to eat enough, they will die and a tomb will appear at their previous position.\r\n</p>\n<p>When dinosaurs are too old, they’ll fall on the ground and die.\r\n</p>\n<p>In order to build up your score and show your skills to the whole world, guide your dinosaurs towards the yellow leaves. Each time they can get their paws on one of them, your score will skyrocket.\r\n</p>\n<p>And, in case you didn’t notice, there’s a T-rex running around. Small advice : stand clear of him. His hunger has no limit.\r\n</p>\r\nControls\r\n<p>The player can choose mutation cards by clicking on them when they appear in front of his very eyes. \r\n</p>\n<p>On the mutation cards selection screen, you can turn off the volume, turn off the particles and make the mutation cards selection screen transparent.\r\n</p>", "metacritic": null, "released": "2023-01-23", "tba": false, "updated": "2023-01-27T15:00:17", "background_image": "https://media.rawg.io/media/screenshots/ba5/ba5c876ad52c174b71f79537059bafb5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Folchamp"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}