{"id": 916265, "slug": "cvc-presents-roberto-farmermuns-horrific-planting-", "name": "CVC Presents: Roberto Farmermun's Horrific Planting Adventure 2023", "name_original": "CVC Presents: Roberto Farmermun's Horrific Planting Adventure 2023", "description": "<p>You are Roberto Farmermun recent purchaser of an allotment. You naively thought you could make a quick buck from selling veg from your land, but turns out it takes a while for stuff to grow. So decide to borrow some radiated heavy water from your local nuclear waste dump to speed up the growing process. It has some interesting side effects, but the plants grow quicker at least. <br/></p>\n<p>Game loop: Hold space to dig earth, hold space to plant seeds and hold shift water  them to grow crops (potato and corn). You will need to contiue to water  the crop until it is fully grown. Weeds can grow on dug earth, weeds can be dug up by holding space.\r\n</p>\n<p>Kill  the crop with left click for melee and right click for ranged (only  weedkiller damages at the moment). Killing a crop will give you food,  with the amount depending on the crop. Weeds will also grow, killing  weeds will not give any food.\r\n</p>\n<p>Food acts as health and currency. At  night you will need to buy new seeds, fatigue, water, weedkiller and  ensure you still have enough food as health to survive.\r\n</p>\n<p>Doing actions uses fatigue, if you run out of fatigue you will become slower and less effective. <br/></p>\n<br/><br/><br/>\n<p>Controls: Left Click: Attack Right Click: Ranged attack Hold space: Dig / Plant (hold until the ground has changed) Hold shift: Water (only works when water selected) Q: Switch between weedkiller and water ranged attack E: Switch between potato and corn seeds.</p><br/><br/><br/><br/><br/><br/><br/><br/>Pyxel was used to create the pixel art. Pixels is a 2015 science fiction comedy film[3][6] directed by Chris Columbus, written by Tim Herlihy and Timothy Dowling, and produced by Columbus, Adam Sandler, Allen Covert, and Mark Radcliffe.[5] Based on the 2010 short film of the same name by Patrick Jean, the film stars Sandler, Kevin James, Michelle Monaghan, Peter Dinklage, Josh Gad, and Brian Cox. Combining computer-animated video game characters and visual effects, the film follows an alien race misinterpreting video feeds of classic arcade games as a declaration of war, resulting in them invading Earth using technology inspired by 1980s games such as Pac-Man, Space Invaders, Arkanoid, Galaga, Centipede and Donkey Kong. To counter the invasion, the United States hires former arcade champions to lead the planet’s defense. Principal photography on the film began on May 28, 2014, in Toronto; filming was completed in three months.<br/>", "metacritic": null, "released": "2023-01-23", "tba": false, "updated": "2023-01-27T15:05:36", "background_image": "https://media.rawg.io/media/screenshots/c8b/c8bcde259efd4a2e9e82e73a676219f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["We Are Not Spies"], "genres": [], "publishers": [], "esrb_rating": null}