{"id": 916304, "slug": "welcome-itch-benjamin-zanini", "name": "Welcome (itch) (Benjamin Zanini)", "name_original": "Welcome (itch) (Benjamin Zanini)", "description": "<ul><li><strong>Moteur : </strong>Unity 3D\r\n</li><li><strong>Equipe :</strong> 5 personnes</li><li><strong>Rôles :</strong> Développeur, Intégrateur, Tests</li></ul>\r\nContexte\r\n<p>Ce jeu a été réalisé en équipe sous Unity, à la demande de Hervé Pingaud, professeur des universités dans le cadre d'un module sur les systèmes d'information.</p>\r\nRésumé\r\n<p>Le jeu Welcome est un Serious Game, orienté gestion, servant de sensibilisation aux systèmes d’information. Il s’agit d’un jeu solo, où le but est de faire circuler via un long tapis roulant des patients entrants au service obstétrique de l'hôpital. De leur entrée dans le service jusqu’à leur sortie. Pour ce faire, le joueur doit effectuer des minis jeux lui permettant de faire avancer correctement le tapis et ainsi assurer une bonne circulation des patients. Ce jeu privilégie l'abstraction de l’organisation des services hospitaliers à une simulation très poussée et réaliste.</p>\r\nGameplay\r\n<p>Le joueur sera d'abord amené sur la carte du jeu, où il verra des patients apparaître petit à petit, de plus en plus rapidement, en fonction du temps. Il pourra drag &amp; drop les patients, qui ont une petite bulle indiquant le service qu'ils veulent rejoindre, pour les amener à ce-dit service. Il entrera alors dans un mini-jeu qu'il devra compléter pour valider les attentes du patient. Une fois que le patient ne nécessite plus aucune consultation, la bulle indiquant le service dont il a besoin disparaît et le joueur peut alors le drag &amp; drop dans la zone d'arrivée.</p>", "metacritic": null, "released": "2023-01-23", "tba": false, "updated": "2023-01-27T15:26:17", "background_image": "https://media.rawg.io/media/screenshots/330/3301331f5f0b7381ffa1446584ffcf41.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Android", "PC"], "developers": ["Benjamin Zanini"], "genres": ["Educational", "Puzzle"], "publishers": [], "esrb_rating": null}