{"id": 91647, "slug": "tales-of-saleana", "name": "Tales of Saleana", "name_original": "Tales of Saleana", "description": "<p><em>Saleana is a 20 years-old vampire living with her grand-parent. </em><br/><em>It is a must for a 20 years-old vampire to go on a lone human hunt but our missy outright opposes it.</em><br/><em>The reason? It's because she doesn't drink human blood like others.</em></p>\n<p><em>But finally, after all the nagging and pleading of her grand-parent, she decides to give it a try.</em><br/><em>Who could be more suitable to be her target than this random handsome guy she meets on the road?</em><br/><em>But wait, he's a priest???</em></p>\n<p><strong>Help Saleana gain the heart of her love interest and drink his blood in this forbidden comedic romance! Or you could diverge her attention to <em>other </em><em>love interests! </em></strong></p>\n<p><strong>Your choice will shape her future!</strong></p>\n<p>*The demo contains around 7000 words and approximately 30 minutes gameplay, depending on your reading speed. </p>\n<p>*The option menu isn't fully customised as of the moment due to time constraint, but we will fix this in our official release of the game.</p>\n<p>Since this is our first time making a game, there bounds to be mistakes and places for improvement; we would be very eager to receive any comments and suggestions on how we can make it better!</p>\n<p>We hope you have an enjoyable experience with this demo! </p>\n<p>Thank you very much!<br/></p>\n<p>Follow any updates of the game on our facebook page: </p>\n<p>https://www.facebook.com/HarmoniaProxPro/</p>", "metacritic": null, "released": "2017-02-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/114/1143af85525eaa79d3e5f14ce1bb335f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 231, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["HarmoniaProxPro"], "genres": [], "publishers": [], "esrb_rating": null}