{"id": 916507, "slug": "efpiyes", "name": "Efpiyes", "name_original": "Efpiyes", "description": "Efpiyes was inspired by the venerable shooters of the 90s: an era of straightforward, fast-paced action, LAN parties and creative tools you didn't need a gamedev degree to use. It's about fun with friends and running, jumping, shooting mayhem.<h3>Multiplayer</h3><br/>Host and join games over Steam. Choose good old-fashioned Deathmatch or change it up with some King of the Hill or Tag.<br/>Game Modes Currently Implemented:<br/><ul><li> Deathmatch: Kill other players. Player with highest kills minus deaths wins.<br/></li><li> King of the Hill: Occupy the hill and fight off other players. Player with most time on the hill wins.<br/></li><li> Tag: First player to die becomes It. Whoever is killed by the It player becomes It. Player who spends the least time It wins.<br/></li><li> Anti-Tag: First player to get a kill becomes it. Whoever kills the It player becomes It. Player who spends the most time It wins.<br/></li><li> Steal the Bacon: A ball spawns somewhere on the map. The ball can be picked up and will be dropped when you die. Player with the most time carrying the ball wins.<br/></li><li> Grim Piñata: Same as Steal the Bacon, but more balls keep spawning over time. Each ball carried counts additively towards your time.</li></ul><h3>Bots</h3><br/>Add bots to your game for solo practice or to add extra spice to multiplayer games. The bots know how to play all game modes, and can be adjusted to a wide range of difficulty levels.<h3>Map Editor</h3><br/>Design your own maps with the built-in map editor and share them with your friends. Maps are voxel-based for simple, intuitive editing.", "metacritic": null, "released": "2023-01-29", "tba": false, "updated": "2023-01-30T03:05:15", "background_image": "https://media.rawg.io/media/screenshots/9fb/9fb3144392c432aacb3a201292a31079.jpg", "website": "https://www.youtube.com/channel/UCn9EGV-p5EajdRd_Eh8w-vg", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Karl John Goebel"], "genres": ["Action", "Indie"], "publishers": ["Karl John Goebel"], "esrb_rating": null}