{"id": 916550, "slug": "bloody-lonely-cold", "name": "bloody lonely cold", "name_original": "bloody lonely cold", "description": "For love, to save her father, and to find her mother, she traveled the world alone, bravely fighting the battle of faith against the dark forces!<br/><br/>The background of the story is in the future, in 2035, there is a small leak in the waste pool of a nuclear power plant in Japan, which has been leaking into the nearby sea for many years. There are unwitting fishermen nearby who are fishing all year round, and the main eaters of seafood are residents of nearby villages (the environment around the nuclear power plant is relatively closed). Although some villagers showed various strange symptoms one after another, no one paid much attention to it. In recent years, cats, dogs, cattle, sheep and other livestock have often been lost.<br/><br/>The heroine is called Zhengguang Fengsha. Her parents divorced when she was 8 years old. Her mother took her 6-year-old sister to the United States. She and her father have been fishing for a living.<br/><br/>When Zhengguang Fengsha was 16 years old, many people in the village near the nuclear power plant developed serious illnesses, including Zhengguang Fengsha's father, who were sent to the hospital. Who knows that the hospital is the real beginning of the nightmare, and the crazy professor will transform Zhengguangfengsha's father into a monster in the form of a Bose-Einstein condensate.<br/><br/>Don't be afraid, don't hesitate, don't be afraid, let's follow Zhengguangfengsha's brave progress and explore bravely. Fight against the crazy professor, save your own father, save those persecuted by the professor, save the world. For the justice and light in my heart, bravely face all kinds of monsters and fight without hesitation!<h3>Features:</h3>Sci-Fi Horror - What kind of chemical reaction will be produced by the combination of sci-fi and horror? You will discover different horror elements and look forward to your exploration.<br/>Horror Labyrinth - a labyrinth theme added to the game, you will become a labyrinth explorer and collect all kinds of key escape items. In the dark and scary hospital corridors, your potential will be greatly stimulated and you will experience endless decryption joy Bundle.<br/>Story-driven exploration - Only by seriously exploring the various environments in the game and using your logical thinking ability can you help Zhengguang Fengsha get out of the dark and terrifying hospital and help Zhengguang Fengsha find the key clues to save her father.", "metacritic": null, "released": "2023-01-28", "tba": false, "updated": "2023-01-30T04:05:03", "background_image": "https://media.rawg.io/media/screenshots/829/829bdfb4fd9b98256e5fa55b43f24538.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["yx"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["yx"], "esrb_rating": null}