{"id": 916557, "slug": "terror-endless-night", "name": "Terror: Endless Night", "name_original": "Terror: Endless Night", "description": "Manage your crew\n<br/>\nEach crew member is a living person with their own skills, and they all have their needs that need to be taken care of but so does the ship. Assign shifts, manage your supplies, and pass laws, all to one end - survive.\n<br/><br/>\nMake decisions and live with their consequences\n<br/>\nTrapped in ice and with limited supplies, you’ll be forced to make difficult decisions to keep your crew alive. Will you show compassion or let the shattering frost reduce human lives to a cold-hearted calculus? Will you die with dignity or feed on your comrade’s body to live another day? What will you do?\n<br/><br/>\nStay sane\n<br/>\nThe harsh cold and the polar night are reasons enough for someone to break. Add hunger, pain, and seeing your crewmates perish, either from the elements or by their own hand, and the weight of your reality becomes simply unbearable. You may yet come back from this mission, but will it be with body and brain intact?\n<br/>\n<br/>\n<br/>\nTerror: Endless Night is a strategy game, kept in the 19th century. It is inspired by true events. The story puts you onboard a ship sailing on a rescue mission to find two ships of the Royal Navy. The two missing ships: HMS „Erebus” and HMS „Terror” were heading to the Arctic to find a passage to East Asia. Unfortunately, all hearing of them has been lost. The purpose of your expedition was to find them and discover the fate of their crew-including your son. Your ship became trapped on the icy surface of the ocean and you found yourself stuck with your crew in the middle of the ice desert. Your fate became unknown, just as it is unknown whether you survive and discover what happened to the other two missing ships and your son.\n<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2023-01-30T04:16:41", "background_image": "https://media.rawg.io/media/screenshots/d58/d58e72addf28ba2e83761e23b7e5eb6a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 472, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Unseen Silence"], "genres": [], "publishers": ["Feardemic"], "esrb_rating": null}