{"id": 916502, "slug": "sex-adventures-the-job-promotion", "name": "Sex Adventures - The Job Promotion", "name_original": "Sex Adventures - The Job Promotion", "description": "<p>About the game<br />\nAn explicit erotic visual novel following the story of two women in a competition with each other, to seduce their boss for a job promotion.<br />\nVisual Novel Description<br />\nThe road to become a Vice President in this dreadful company is definitely not an easy one. It requires a lot of hard work, countless sleepless nights and a hard stomach. Because there are a helluva lot of asses to kiss in the company, and unfortunately, not all of them are young and pretty.<br />\nBut Bridget Jones never faltered a step in the big journey.<br />\nShe kissed those asses, one by one, and never complained. She also did the hard work and missed hours of precious beauty sleep, all for a chance to someday get a chair at the big boys’ table and secure her future.<br />\nHer chance is now here and it came in the form of an old partner in crime – Declan – who was voted as the new and shiny President of the company, in much need of a vice President. And guess who made that happen for bad boy Declan? That’s right, your one and only Bridget Jones.<br />\nFinally – FINALLY – her dream was only a signature away.<br />\nSo imagine her surprise when she saw her name written under the one of Angela Bennet – the obnoxious assistant who barely made it out of college. When Declan was asked to pick a name to promote as his new VP, he surprisingly put hers at the top of the list, leaving Bridget no other choice but to fight for her dream job once again.<br />\nAnd oh, how she loves a good cat fight.<br />\n…<br />\nDid Bridget manage to convince Declan to choose her?<br />\nFollow the story and find out…<br />\nFeatures<br />\n- 50+ HD renders<br />\n- Animations</p>", "metacritic": null, "released": "2023-01-27", "tba": false, "updated": "2023-02-06T10:16:13", "background_image": "https://media.rawg.io/media/games/2f3/2f35f014edae096b1c6f362637f87fb8.jpg", "website": "http://www.exosyphen.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 328, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EroticGamesClub"], "genres": ["Casual", "Indie"], "publishers": ["EroticGamesClub"], "esrb_rating": null}