{"id": 916648, "slug": "genome-ziro-dev", "name": "Genome (Ziro Dev)", "name_original": "Genome (Ziro Dev)", "description": "<p>Discover a game world unlike any other, brought to life by the power of AI! Our game combines Cellular Automata, Genetic Algorithms, and advanced pathfinding techniques to create a procedurally generated map. Intelligent agents use GOAP planning and option stacking to make decisions and move about the world in real-time, powered by an efficient A* implementation. Explore a dynamic world where the height of each node is calculated based on its distance to the coast. Experience the unique blend of cutting-edge AI techniques in this one-of-a-kind game. Download now to start your journey.</p>\n<p>The map is generated using Cellular Automata, a simulation technique that generates complex patterns from simple rules. This results in a procedurally generated game world that offers a different experience each time you play.\r\n</p>\n<p>The characters in the game are created and evolved using Genetic Algorithms, which simulate the process of natural selection to create optimized solutions. In this case, the characters are optimized for gameplay.\r\n</p>\n<p>The agents use a Goal Oriented Action Planning (GOAP) system to make decisions about what actions to take, making them more intelligent and adaptive. The option stack processes these decisions efficiently and allows for multiple agents to request paths without affecting performance.\r\n</p>\n<p>The game's A* implementation is highly optimized, allowing for over a hundred agents to efficiently find paths without impacting performance. This makes the game world feel alive, as agents move and interact in real-time.\r\n</p>\n<p>Finally, the map uses an algorithm to calculate height based on the distance of each node to the coast. This results in a dynamic and interesting game world that changes as the player explores it.\r\n</p>\n<p>In this unique gaming experience, you start by choosing your race and being dropped into the world. Observe and evaluate your agents as they move about the procedurally generated map, using Genetic Algorithms to evolve and adapt to their surroundings. Your goal is to survive as long as possible and create the dominant race. However, the other agents in the world are evolving at the same time, using GOAP planning and option stacking to make decisions and explore the dynamic environment.<br/></p>", "metacritic": null, "released": "2023-01-29", "tba": false, "updated": "2023-01-30T04:56:26", "background_image": "https://media.rawg.io/media/screenshots/d42/d42b2ae1fc7baab9992b63a32b642431.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ziro Dev"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}