{"id": 916767, "slug": "alux", "name": "ALUX", "name_original": "ALUX", "description": "<p>Después de años en calma, una pequeña aldea situada en el sur de lo que hoy en día se conoce como México, fue atacada por una criatura horripilante, el Ek-Chapat. A esta bestia se la describe como un enorme ciempiés con siete cabezas humanas. Cada cierto tiempo, el Ek-Chapat sale del Inframundo para comer humanos y esta vez la aldea tuvo la mala suerte de encontrarse en medio de su cacería. Tras la terrible masacre que ocurrió,  los siete supervivientes buscaron la ayuda de un chamán y le dieron su sangre para juntos crear a Alux, un ser de barro que les dará venganza y salvará a las almas de sus familiares del temible Ek-Chapat.</p>\n<p><strong>MECÁNICAS:\r\n</strong></p>\n<p>Las mecánicas de Alux son muy fáciles, para avanzar hacia adelante presione la D, para ir hacia atrás la A y para saltar W. También puedes lanzar dardos para matar a los enemigos presionando el espacio. Tendrás que rescatar las almas de los 5 Nahuales pasando por encima de ellas esquivando a numerosos enemigos que tendrás que averiguar cómo hacerlo y saltar sorteando obstáculos para avanzar y acabar matando a Ek Chapat en una pelea épica, el cual tiene tres cabezas y muchas ganas de seguir comiendo. ¿Alux es inmortal? Por supuesto que no, Alux tiene tres tamaños ya que está hecho de barro, por cada golpe que reciba decrece y si está en el más pequeño morirá, puedes recuperar vida en los charcos de barro que harán que crezcas y guardar tu progreso en los tótems que están por el mapa que hacen la función checkpoints.</p>\n<p><strong><em>EXTRAS:</em></strong>\n</p>\n<p><em>-Alux: Los aluxes, guardianes de la selva, con una estatura que sólo se acerca a la altura de las rodillas de una persona promedio, y con la apariencia de personas ancianas en miniatura, tradicionalmente vestidas a la usanza maya, son seres que habitan en las selvas del sur de México, llenando estos territorios de leyendas y magia. Siguiendo la leyenda de los sabios mayas se debe crear figuras de aluxes, usando barro virgen extraído de alguna cueva a la que no hubiera entrado mujer alguna. La leyenda cuenta que, otro de los ingredientes esenciales para la creación de este ser fantástico, eran nueve gotas de sangre de quien iba a ser su dueño, formando de esta manera  una alianza sólida entre humano y criatura. Una vez que la figura de barro estaba lista se entregaba a su dueño y éste lo colocaba en un altar. Por las noches, el alux cobraba vida para cuidar las propiedades del dueño y sus animales, ahuyentar a los intrusos de la tierra, jugándoles bromas, perdiéndolos del camino a través de sonidos, arrojándoles piedras o simplemente asustándolos. (https://ilovepm.com/la-leyenda-de-los-aluxes-mayas/)\r\n</em></p>\n<p><em>-Nahual: el nahual o animal espiritual es concebido como un alter ego de la persona cuyos destinos están ligados, indefectiblemente, uno del otro. Así, los males que aquejan a uno son sufridos por el otro, ya corporalmente ya espiritualmente. De ahí la extendida creencia y las múltiples narraciones de las muertes sufridas por personas al momento que su animal-nahual es muerto. (https://es.wikipedia.org/wiki/Nahual#Nahual_como_animal_tutelar_o_esp%C3%ADritu_...)</em></p>\n<p><em>-Balam: Balam significa jaguar en lengua maya.\r\n</em></p>\n<p><em>-Huay Pek: Mucho se ha hablado de las leyendas mayas, y precisamente en el municipio de Ticul en Yucatán, se dice a finales del siglo XVII vivía un curandero que se llamaba Juan Moo, quien también tenía la habilidad de convertirse en un “huay pek” es decir, en el “perro brujo”, se dice que era uno de los más poderosos y era conocido hasta en Campeche y Quintana Roo ya que su forma de curar era realmente asombrosa. Entre las leyendas de Yucatán se sabe que Juan Moo era un hombre a quienes muchas personas le tenían respeto sin importar que muchas autoridades religiosas lo tacharan de pagano y lo tachaban de malo. (https://www.maravillasdeyucatan.com/leyendas/la-leyenda-del-huay-pek/)</em></p>\n<p><em>-Serpiente Cola Negra: La Serpiente Cola Negra es una criatura maya; no se incluye dentro del rubro mitológico debido a que carece de carácter divino. Las creencias populares la describen con una longitud de dos a cuatro metros, piel con diversos tonos de gris y cola bífida. (https://es.wikipedia.org/wiki/Serpiente_cola_negra_(criatura_fant%C3%A1stica_may...)</em></p>\n<p><em>-Ek Chapat: El Ek Chapat (cuyo nombre se traduce como el “Señor Escolopendra”), aguardaba con admirable paciencia el paso de los caminantes por su guarida, y los acosaba con acertijos indescifrables que tenían que adivinar para poder continuar su camino. Si el caminante fallaba en resolverlos, era desollado y devorado vivo por las siete cabezas del monstruo. (https://sipse.com/novedades-yucatan/leyendas-mayas-temido-monstruo-ek-chapat-142434.html)</em>\n</p>", "metacritic": null, "released": "2023-01-29", "tba": false, "updated": "2023-01-30T05:49:41", "background_image": "https://media.rawg.io/media/screenshots/93f/93fbc0eab019eb1b3995925c444b65ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Tabasco Games"], "genres": ["Action", "Shooter", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}