{"id": 916784, "slug": "tanto-faz-colher", "name": "Tanto Faz Colher", "name_original": "Tanto Faz Colher", "description": "<p>No futuro, na cidade de<em> NeoDiadema</em>, existe um laboratório que funciona como um centro de pesquisas com foco em mutantes. Em meio da área dos mutantes de médio risco, está Colher, um garoto peculiar, com quatro olhos em sua face. Ele tem uma enorme facilidade de aprender, apenas observando situações e informações ele consegue assimilar e reproduzir com precisão, seja lá o que for. Seu traço especial é possuir o poder de telecinese, conseguir mover objetos que não estão muito longe dele utilizando apenas a força de sua mente.</p>\n<p>Durante um dia rotineiro o homem com rosto de rato libertou a si mesmo e Colher, o situando em seu discurso sobre a \"Anarquia Mutante\". Após a fuga de homem com rosto de rato, Colher começa a explorar o complexo, conhece outros mutantes e mesmo com as palavras do homem rato uma outra coisa lhe chama mais atenção: as propagandas de “<em>Içai, o Açaí do futuro</em>”. Isso desperta em Colher uma meta: sair do laboratório para comer açaí.</p>\n<p>Se durante esse caminho ele se deparar com algumas coisas bizarras, bem bizarras, é parte de sua árdua jornada. Se aproveitando da movimentação causada pelas peripécias do homem rato siga em direção ao refrescante e nutritivo shake de açaí.</p>", "metacritic": null, "released": "2023-01-29", "tba": false, "updated": "2023-01-30T05:56:36", "background_image": "https://media.rawg.io/media/screenshots/466/46645f6da7d6a25d868af6386dc6f352.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Homens do Pilar", "Igor Ponciano"], "genres": ["Adventure", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}