{"id": 9167, "slug": "medal-of-gunner", "name": "Medal of Gunner", "name_original": "Medal of Gunner", "description": "Earn your wings, and a few meritorious medals along the way by blasting WWII bad guys out of the sky. <br/><br/>Medal of Gunner gets you closer to a Second World War dogfight than you ever imagined an app could. This fighter plane FPS experience puts you in the gunner’s position, and makes your skill and savvy the factors that make or break these world-shaping missions. Flight sim elements add convincing authenticity, while Medal of Gunner’s FPS appeal gets your adrenaline pumping.<br/><br/>Air battles played an incredibly crucial role in the Second World War, and now you can feel the rush of being a pivotal part of those deadly encounters. Complete missions, protect the lives of your brothers in arms, annihilate the enemy, and dominate the skies to achieve victory. Gorgeous 3D graphics, authentic audio, and the satisfaction of inset views of your successes as enemy planes plummet earthward keep the excitement level high and the action addictive.<br/><br/>■ FEATURES<br/>▷ Console quality 3D graphics, smooth animation, realistic textures, and authentic planes and weaponry serve as the perfect eye candy for WWII buffs and create a unique environment for FPS lovers<br/>▷ Innovative and intuitive controls parallel the reality of being a WWII gunner, while making full use of the extensive capabilities of iOS.  <br/>▷ Tilt controls for aiming adjust authentic gunner style sights to hone in on planes as your radio man alerts you to their presence—if you don’t blast them away before he gets a chance. <br/>▷ Multiple gunner positions including Left and Right Waist, Top, Ball, Bomb, and Tail turrets (to name a few) give the elite gunner full coverage of the sky in a smooth scrolling 3D environment<br/>▷ Three difficulty levels present perfect pacing for all experience levels and provide hours of replay value<br/>▷ 7 formation types present new strategic challenges as you work to protect your combat buddies and rid the skies of enemy aircraft.<br/>▷ Face off with fighters of 8 different types, boasting different armor and arsenals to hone your skills<br/>▷ Multiple weapons and tactical abilities require even more tactical finesse to master as you progress<br/>▷ Meet familiar foes in buffed up boss form and prove you’ve got what it takes to win one for the Allies<br/>▷ Score medals for conduct, earn lucky amulets, decorate your windshield with stats-bumping 40s pin up beauties, earn game-play bonus items from downed planes, and upgrade your offensive and defensive capabilities, raise your rank and experience Medal of Gunner at its finest!<br/><br/>★ Keep up with the latest Pictosoft for updates, events, and more! ★<br/>* Like us: http://www.facebook.com/pictosoft.global<br/>* Follow us: http://www.twitter.com/pictosoft", "metacritic": null, "released": "2011-08-30", "tba": false, "updated": "2019-10-22T14:30:19", "background_image": "https://media.rawg.io/media/screenshots/bf7/bf769c76098bb13155e327af5fb883d0.jpeg", "website": "http://www.facebook.com/pictosoft.global", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["(C) PictoSoft"], "genres": ["Action", "Simulation"], "publishers": ["(C) PictoSoft"], "esrb_rating": "Everyone 10+"}