{"id": 916922, "slug": "power-surge-rayurebob", "name": "Power Surge (RayureBob)", "name_original": "Power Surge (RayureBob)", "description": "<p><strong>DISCLAIMER - THIS WILL PROBABLY MAKE YOU EYES BLEED !</strong></p>\r\nPRESS <strong>ESCAPE </strong>TO EXIT !\r\n<p>This game is not your personal hell, you can get out through the pause menu.</p>\n<p>\n</p>\n<p>\n</p>\n<strong>WASD</strong> WORK AS INPUTS !\r\n<p>It4s just thqt ze are french qnd ze didn4t think thqt ze zould releqse it online qt qny point&lt; But it zorks&lt; </p>\r\nHello\r\n<p>This a student game on which I and 3 of my classmates worked on for the final project of our game design studies. It is very rough around the edges, but it still manages to work, kinda.</p>\n<p>It features:</p>\n<ul><li><strong>A wave-based procedural difficulty</strong><br/>Enemies come in waves, with their number and overall stats increasing with each wave cleaned. This would allow an infinite runtime if it wasn't for our questionable programming choices. At some point it will break, but hopefully you'll enjoy getting there.</li><li><strong>An approachable and isntantly fun progression system<br/></strong>This was one of our main goal. Between waves, you get between 2 and 3 chests, each making you choose one upgrade among 3 other, randomly picked. An upgrade can just increase some stats, or fully add a mechanic on hitting or on killing an enemy. </li><li><strong>A palpable power progression with a juicy gameplay</strong><br/>Each upgrade has a clear and instantaneous effect. At some point in your run, your screen will be loaded with damage or effect popups or visual effects which purpose is to make you feel like you have indeed worked your way where you are.</li></ul>\n<p>It's far from being good, be we took great pleasure in exploring what we wanted to make with it. It also served as a in depth dive in programming and optimization. And on a game design ground, we had to ask ourselves plenty of passionnating questions on flow, juiciness and balancing. It was a great learning experience.</p>\n<p>NB: You might see some shallow similarities with Vampire Survivors. Know that this game's development stopped in june 2021, while Vampire Survivor came out in december 2021. So who copied on whom huh ? Poncle, <em><strong>way</strong></em> ahead of you. We're watching you. </p>", "metacritic": null, "released": "2023-01-29", "tba": false, "updated": "2023-01-30T06:49:04", "background_image": "https://media.rawg.io/media/screenshots/84d/84d5dd08df22ea7c2cca11529926883b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RayureBob"], "genres": ["Action"], "publishers": [], "esrb_rating": null}