{"id": 91705, "slug": "kings-of-lionhill", "name": "Kings of Lionhill", "name_original": "Kings of Lionhill", "description": "Story\r\n<p><em>These are turbulent times. In Lionhill, old King Gerald lies on his deathbed. While his older son, prince Roderik, prepares his regency, Kings Geralds bastard son plots to become king with the support of dukes. </em></p>\n<p><em>Meanwhile the church is divided in hatred and controversy. The Council of Everrun ends in bloodshed, as the Violet Circle tried to overthrow Archbishop Reginald.</em></p>\n<p><em>Meanwhile, deep in the mines under the Shimmering Highlands, the dwarves fight a hopeless battle against the hordes of Goblins. Ordun Silverbeard, King on the Golden Throne, rushes to the bridge of Dain, to stop the goblin assault.</em></p>\n<p><em>Far down south, within the woods of Eilbalar the old trees whisper of the return of the elves.</em></p>\n<p><em>In the north, the folks flee in terror, because the frost orcs raiders have even reached the outskirts of Cainhorn forest. With their brutality and hunger unmatched, the ordinary people can only flee.</em></p>\n<p><em>Far away from all this, I was raised in a small village in the northern realm. I had a precious and wonderful childhood. I remember how I catched my first fish. How I kissed my first girl. How I forged my first sword. Soon the time, at the end of my childhood, that I left my small village to travel to the big city of Lionhill.</em></p>\n<p><em>Only hard labour and cunning bargain will bring my dynasty to the top. But I have be careful. Intrigues and schemes rule in this town. Do I have the edge to outwit them all?</em></p>\r\nInfo\r\n<p>Kings of Lionhill is a RPG politics and trading simulation game. It is inspired by the Guild, Crusader Kings 2 and other medieval trading simulation games. The main goals is to create a more immersive and seamless experience for the player taking part in the political landscape of a medieval kingdom. </p>\n<p>The player has to manage a workshop. Assigning workers, buy ressources and sell products at the market. He can upgrade his workshop for increase productivity or even build a bigger workshop to produce more refined products.</p>\n<p>The player can also take part on the political stage. Six stages of political levels are there to be climbed. Each offering a bigger reward and more power for the player to climb even higher. </p>\r\nWhat comes next?\r\n<ul><li>At least two more craft professions for the player to choose from</li><li>Additional usable items to influence people or enhance your character</li><li>Random events that affect the market (like wars, refugees, forest fires, new technologies, new sources of ressources like new mines)</li><li>Owning multiple workshops and houses</li><li>Having to make decisions during political events based on the current office the player is part of</li><li>More interactions with the npcs</li></ul>", "metacritic": null, "released": "2018-03-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/246/24603a4359310f7bac368c7fc06f1d77.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Felski"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}