{"id": 91716, "slug": "electric-highways-itch", "name": "Electric Highways (itch)", "name_original": "Electric Highways (itch)", "description": "<p><strong>Electric Highways</strong> is a game that's all about experience and exploration. Everything in this game, especially visuals and music, has been created for the purpose of giving the player a certain kind of emotion. The setting takes place in a surreal, virtual world, made out of abstract 3d graphics, where the player must explore ten levels, each with an individual theme. </p><p>Игра доступна на двух языках. The game has two language options.<br/></p><p><em>The year is 2072. Virtual reality has become a worldwide phenomenon, allowing people to sink into the virtual web, while experiencing isolation in real life. A VR engineer has finished his virtual reality project, but before uploading it on the web, he decides to visit it for the last time, plunging deeper into his own surreal world.</em><br/> <br/> The atmosphere of the game has been inspired by early 80's electronic music (including such examples as <strong>Gary Numan</strong> and <strong>Depeche Mode</strong>), <strong>System Shock</strong> and the 1984 version of the film <strong>Metropolis</strong>. In some ways, the game is like an interactive conceptual music album, where each level is like a short song. The project features a 100% original soundtrack inspired by classic electronic music.</p><p><strong>Disclaimer:</strong> Only play the game if you're fine with the visuals presented in trailer and screenshots. May not be suitable for people with epilepsy. You have been warned.<br/> <br/> <strong><em>Controls:</em></strong><br/> </p><ul><li>WASD - Move</li><li>Mouse - Look</li><li>E - Use</li><li>Space - Jump</li><li>Esc - Menu</li></ul><p><em><strong>Credits:</strong></em></p><p>Zykov Eddy - Lead Developer (http://eddyprojects.blogspot.ru/)<br/> Xitilon - Composer (http://r0.faisu.net)</p><p>Special thanks to: Nerdybat, Ivan Azarov, Micky C, Artem Nevinchanyi, Esdeer,  James Stanfield (for water texture), Lezing,  dv49, all 80's new wave artists</p><p>Enjoy the game!<br/></p>", "metacritic": null, "released": "2015-09-05", "tba": false, "updated": "2019-08-28T23:26:06", "background_image": "https://media.rawg.io/media/screenshots/202/202dba54c418e0b7afb8d3af7a950bea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zykoveddy"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}