{"id": 91710, "slug": "edgy-fantasy-battle-deluxe", "name": "Edgy Fantasy Battle Deluxe", "name_original": "Edgy Fantasy Battle Deluxe", "description": "<p><em>\"I mean, if your flashy magic attack causes a flood, or a landslide, or a forest fire, whatever, sooner or later it will become pretty uncomfortable to stay in one place\".</em> <br/></p>\n\n<p><strong>Story: </strong>your party is level 99 now. Long gone are the days when fireballs and ice arrows were your deadliest magic. Now, you are capable of summoning grand avalanches and meteor showers, volcanic eruptions and earth-splitting quakes. Time for the showdown!</p>\n<p>One more boss fight, and we're done here, no need to hold back. Besides, all those cataclysmic events are, like, abstract representations of your power level and don't <em>actually </em>happen, right?  <br/>It would be very, very inconvenient if they did.</p>\n<p>Oh wait—</p>\n<p>***<br/></p>\n<p><strong>Features:</strong><br/></p>\n<ul><li>Manage a group of trusted friends whose bonding happened off-screen!  </li><li>Defeat the evil sorceress who doesn't even know why she's here!</li><li>Unleash your arsenal of crazy Limit Break tier spells!</li><li>...and try not to run out of tiles to cast them.</li><li>Play in browser!</li></ul>\n<p><strong>Controls: </strong>on empty space, left-click and drag to rotate the camera, right-click and drag to adjust the view, mouse wheel to zoom.  <br/></p>\n<p>After you character's action gauge fills, pick <strong>attack </strong>to damage the boss directly, or <strong>guard </strong>from an upcoming strike. Your epic <strong>magic </strong>is your main source of power, but the spells need to be cast on certain tiles, corrupting or destroying them in the process.  </p>\n<p><em>Check out additional tips by pressing the <strong>[ ? ]</strong> button in-game.</em></p>\n<p>***</p>\n\n<p>Code: Yanrishatum. Art: ZeusDex and Micchan.  <br/>Gamedesign, story: Shess. Music: Theodote.</p>", "metacritic": null, "released": "2018-08-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8e3/8e3d6c73e6466760a3b7bf2463d1d9e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Yanrishatum", "Shess"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}