{"id": 917224, "slug": "human-upgrade-labs", "name": "Human Upgrade Labs", "name_original": "Human Upgrade Labs", "description": "<p>In this game you will be playing a role of a fool, I'm sorry, a volunteer who signed up to participate in the tests going on in the Human Upgrade Labs in the far future Earth. You heard  rumors that anyone who manages to pass the various tests and lessons designed to improve you in every conceivable way will have new and amazing possibilities unlocked in life. That, or  be completely broken mentally.<br/></p>\n<p>The lessons you take will essentially be various mini games placed in several different categories. The mini games will  include things like taking an unfair quiz:</p>\n\n<p>Teaching a robot to feel:</p>\n\n<p>Finding patterns among various pieces of futuristic and legacy technology:</p>\n\n<p>Analyzing the features of a bioengineered monster:</p>\n\n<p>Learning about the history of this strange future world by unscrambling engravings on an ancient monument:</p>\n\n\n<p>Of course that's not all. Along the way you will learn bits and pieces about this strange world that often perplexes even the people who live in it. What are these futuristic technologies? Why is everyone so casual about extreme body modification and why do some people choose to look and live as if they were cartoons? WHY IS THE PLANET CUBE SHAPED and why hasn't anyone told you about all this even though you grew up in this place?</p>\n<p>You will encounter some strange people( I think they are people) who work in these labs:</p>\n\n\n<p>You will get involved with the fashion of the future, by taking a lesson in it and also by customizing your captor. I mean instructor:</p>\n\n\n\n\n<p>So. The game is still very much still in development, but the 13 lessons/mini games that are in this version are fully playable and many more will follow.  I have so many ideas that it's not even funny and the plan is to keep updating every time I have a few new levels ready.  Whether those are completely new kind of lessons or more lessons in the same categories already here.</p>\n<p>The images I included probably gave you a hint, but I am primarily a visual artist and I work as an illustrator and concept artist in daily life. I am making this game by myself whenever I can find free time. It serves as an outlet for a lot of my stranger ideas and a great motivator to keep pushing my art skills. Obviously I'm learning a lot about programing, game design, world building etc along the way. I like to experiment with various art styles and different subject matter so I came up with the concept for this game in order to be able to place all those different ideas in one game and still somewhat make sense. My previous game - Dream mechanic, served the same purpose, but this one gives me so much more freedom due to the mini game approach. Obviously not everything I come up with can fit in due to story reasons, or maybe because something wouldn't make sense game play-vise and stay as little side projects, but in this game variety is the key. I enjoy making that and I enjoy playing games that provide something different from the standard forest and lava levels and I hope that you will enjoy that aspect of this game as well.</p>\n<p>This is very much a passion project and I do pretty much whatever I like here, but I still want to make this game fun, obviously. Don't hesitate to offer suggestions or comments, even if they are not super positive. People in the past have given me advise that helped make my previous games better and it's always a great feeling to get involved in some aspect of playing these games and not even notice how the time passes, even though I know them inside out. I want others to get dragged into it in the same way. For example, I did quite a bit of procrastinating just messing around with the character customization feature in this game ever since I included it months ago, haha.<br/></p>", "metacritic": null, "released": "2023-01-28", "tba": false, "updated": "2023-01-30T08:54:00", "background_image": "https://media.rawg.io/media/screenshots/015/015427dfeb5c5d415711d764e8f01ce6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Augustinas Raginskis"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}