{"id": 91731, "slug": "tracks-the-train-set-game-2", "name": "Tracks: The Train Set Game", "name_original": "Tracks: The Train Set Game", "description": "<p>Build the train sets of your childhood dreams with an easy-to-use editor. Just indicate where you want to build and Tracks does all the hard work for you, effortlessly mapping out turns, junctions and crossings under your command.</p>\r\n\r\nTracks: The Train Set Game\r\nis in Steam Early Access\r\n(Click me to open in the Steam client instead)\r\nFollow progress on my \r\n\tTumblr or Twitter\r\n\r\n<ul><li>Use a variety of decorative pieces to create your own little villages</li><li>Place unique track shapes and configurations beyond what you would normally find in a physical train sets</li><li>Physics objects to play with</li><li>Interactive mechanisms like bridges and lifts give you more freedom in moving around the environment<em> (coming soon)</em></li><li>Play in free-mode to build at your leisure without any set objectives, or play one of several gamemodes</li></ul>\r\nRide the rails\r\n\r\n<p>Once you’ve created your rail network, you can ride along from inside your train, in first person. You’ll have full control of your vehicle in this view and will be able to adjust the train’s speed and direction. <br/></p>\r\nVaried Environments\r\n\r\n<p>Varied environments await, acting as playgrounds in Tracks: The Train Set Game. Enjoy the diverse themes, go off the rails and ride along the furniture. Each environment contains unique features for you to experiment with and incorporate into your track designs.<br/></p>\r\nOptional objectives\r\n\r\n<p>Play how you want! Be entirely free of restrictions in free play mode, or pick one of the objective based gamemodes. In passenger mode, small wooden people will appear around the room on the pieces of furniture. You need to build Platforms for them to get to, pick them up and take them to their destination.<br/><br/></p>\n<p>System minimum requirements:<br/>Windows 7<br/>Core i3 2Ghz<br/>4GB RAM<br/>Dedicated graphics card with 1GB memory<br/></p>", "metacritic": null, "released": "2017-09-28", "tba": false, "updated": "2022-11-27T06:52:06", "background_image": "https://media.rawg.io/media/screenshots/1d1/1d1e1b1b686e17ce86ea266c2b9a2c1f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Dr. Whoop"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}