{"id": 917335, "slug": "chess-visualizer", "name": "Chess Visualizer", "name_original": "Chess Visualizer", "description": "<p><strong>[The project is under active development, with possible bugs and work-in-progress features that might not be the most convenient to use. However it is also fairly usable at this point.]</strong></p>\n<p><strong>Check out the free demo version below before committing to support the project!</strong></p>\r\nSummary\r\n<p>The application helps you analyze chess games by visualizing numerous aspects of positions.<br/></p>\n<ul><li>Field coloring</li></ul>\n<p>Chequerboard colors indicate if a square is attacked/defended by pieces. More or less attackers/defenders adjust the color further. Try different color schemes with pressing the keys '[' or ']'.</p>\n<ul><li>Engine line arrows for<ul><li>best moves</li><li> full engine lines (one at a time)</li></ul></li></ul>\n<ul><li>Engine piece weights<ul><li>Piece size</li><li>Piece color</li></ul></li></ul>\n<ul><li>Forcing move arrows<ul><li>Checks</li><li>Attacks against pieces with a higher piece value</li><li>Attacks against unprotected pieces</li></ul></li></ul>\n<ul><li>Target pieces</li></ul>\n<p>A target mark indicates if a piece has equal amount of attackers and defenders therefore open to attacks.</p>\n<ul><li>Import/Export<ul><li>The current full game can be exported to lichess with the export button.</li><li>Games can be started with a specific position by entering them as a FEN to the edit box at the bottom of the screen.</li></ul></li></ul>\n<p>Press 'H' to display key binds to toggle visualization options.</p>\n<p>Currently all visualization features are only toggled by shortcut keys. Settings and profiles that would bind setting preferences are among the plans to implement if there is interest and support for further development.</p>\r\nBackground\r\n<p>I have been looking for an application for quite a while that can visualize more of what is happening on the chess board than the usual best engine moves.</p>\n<p><strong>How many pieces attack or defend a square?</strong></p>\n<p><strong>Are there more attackers than defenders?</strong></p>\n<p><strong>What is the series of the moves the engine suggests after the first one?</strong></p>\n<p><strong>Why isn't this possible to visualize on lichess or chess.com?</strong></p>\n<p><strong>Why isn't there a chess UI app that allows for scripting what to show on the board?</strong></p>\n<p>While there are partial solutions for these, like hovering your mouse over the engine line on lichess, they are quite far from what I would like to see. After finding no real solutions to these problems I just decided to look into implementing them: first the open source lichess chess board drawing component, chessground that I found fairly complicated to pick up, then other open source chess apps. As I realized on the go, chess engines don’t expose much besides the best n lines that you could use for other visualization purposes. While looking at these apps I stumbled upon Sebastian Lague’s Chess AI project that was very close to what I needed to start to implement my ideas. After some square coloring experiments I could see that it would work and I quite liked what I was able to see. My son is an expert chess player and he had several ideas that would be really nice to have for people who just picked up chess and don’t have the experience that would allow to see them. We added the option to see forcing moves in a position. This took a fairly long time to implement and there are still features (like x-ray) that should be there in the full solution. The existing features are quite fun to experiment with, so I decided to make it available for others as well. I hope you like it!</p>", "metacritic": null, "released": null, "tba": false, "updated": "2023-01-30T09:42:48", "background_image": "https://media.rawg.io/media/screenshots/275/2752baed1518c4809a629f19964e5c37.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["tamasmartinec"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}