{"id": 917417, "slug": "destructive-dave", "name": "Destructive Dave", "name_original": "Destructive Dave", "description": "<p>In Destructive Dave you play as Dave, An Angry man who's going around destryoing a small city for his own reasons. Weild: The Rocket Launcher, Pistol, Baseball Bat and a Frying Pan to destroy buildings, \"Knockout\" police and gain as many points as you can in 2 mintues.</p>\n<p>With ragdolls and satisfying destruction physics and Emotes, Destructive Dave can be an amusing game, a boredom killer, something to just play and come back to at any time.</p>\n\n<p>This Game is best played with a controller</p>\n\n<p>Controls:</p>\n<p>Left Trigger: ADS (Aim Down Sights)</p>\n<p>Right Trigger: (Shooting/Melee)</p>\n<p>Left Stick: Movement</p>\n<p>Right Stick: Camera Movement, Weapon and Emote stick (When button is held down)</p>\n<p>Right Bumper (Held): Weapon Wheel</p>\n<p>Left Bumper (Held): Emote Wheel</p>\n<p>D-Pad: Go Through UI Menu's</p>\n<p>A (Xobx), X (Playstation), B (Switch): Confirm UI Option</p>\n<p>X (Xbox), Square (Playstation), Y (Switch): Interact with beachball</p>\n<p>Options button (+ on switch, Options on playstation and Menu Button on xbox): Pause</p>\n\n<p>This game was made for a Year Two Group Project for the University of Northampton.</p>\n\n<p>Group members and their roles:</p>\n\n<p>Ben (Designer): Project Lead, UI Artist, 3D Modeler (Building interior and exterior) , Level Designer and VFX Designer</p>\n<p>Jake (Designer): Game Design Lead, Character Rigger and Animator, Police Ragdoll System and Game QA Tester.</p>\n<p>Renars (Designer): Music Designer, Level Designer and Menu Designer.<br/></p>\n<p>Uhuru (Designer): SFX Designer</p>\n<p>Reuben (Programmer):  Destruction Physics, Shooting system, Ammo UI programming, Health system, Hot Dog Stand, Emote System, Game Loop, End Screen programming, NPC Movement, Objectives programmer, Scene loader, Player Spawning.</p>\n<p>Alanah (Programmer): Player Movement programmer, Tutorial Scene programmer and Credits programmer</p>\n<p>Dylan (Programmer): Programming Lead, Police AI (Spawning, movment, shooting) UI Programming, settings menu programming and Challenge Markers. </p>\n<p>Isaac (Artist): Art Lead, UI Concepts, Almost all textures in game, Player, NPC and Police Modeler, Trash and Grass Decals, Melee Weapons Modeler, Exterior Modeler (Buildings, Beach Models, Bin Bags, Lamp Posts, Traffic Lights, Billboards), 2 Billboards posters, Finalised Roads with Textures and Logo Concepts.</p>\n<p>Adeena (Artist): Character Concept artist for Dave, 3D Modeler (Cars, Ranged Weapons: Pistol and Rocket Launcher, Trees, Duck Bullet, Pipes, Health Pickup (Hotdog), Hotdog Stand and Police Car (All with Textures)), Billboard Poster Artist and Finalized Logo Design.</p>", "metacritic": null, "released": "2023-01-27", "tba": false, "updated": "2023-01-30T10:18:51", "background_image": "https://media.rawg.io/media/screenshots/078/0783b341f615d35e03e694693fc4a7d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Arker Entertainment"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}