{"id": 917615, "slug": "game-mechamix-vol-i", "name": "Game MechaMIX Vol. I", "name_original": "Game MechaMIX Vol. I", "description": "\"A game mechanics M I X!\"\"  - [ENG]\n<p>You play as a spaceship captain who has crashed into an apparently abandoned unknown island.  There you will meet these strange creatures called \"Nutmin\" that, strangely,  seem to respond to your whistle. </p>\n<p>With your new found friends you will need to reach back to your spaceship to return to your home planet. But not before collecting as much exotic fruits as you want from the island!</p>\n<p>But wait, why these containers have pipes!?You can even enter them and travel across the actual container sides!?</p>\n<p>In this singleplayer game you will have to go back to your spaceship using two game mechanics from different and beloved video game franchises while navigating through the island and collecting as much fruit as you can find before you escape.</p>\n<strong>Nutmin dislike dark places! </strong>So they won't follow you through pipes. But don't worry the island has plenty of them!\r\n\r\n\r\n\"¡Un M I X de mecánicas de juego!\"  - [ESP]\r\n<p>Juegas como un capitán cuya nave espacial se ha estrellado en una isla desconocida y aparentemente abandonada. Allí conocerás a estas extrañas criaturas llamadas Nutmin que, por alguna razón, responden a tu silbato.</p>\n<p>Con tus nuevos amigos deberás volver de vuelta a tu nave espacial para poder regresar a tu planeta natal, ¡pero no sin antes recolectar toda la exótica fruta que quieras de la isla!</p>\n<p>Pero espera...¿Por qué los contenedores tienen tuberías? ¿¡Que puedes incluso entrar en ellas y caminar literalmente por los lados de los contenedores!?</p>\n<p>En este juego de un jugador, deberás regresar a tu nave espacial usando dos mecánicas de juego de franquicias de video juegos diferentes y queridas, a la vez que recolectando toda la fruta que puedas a lo largo de la isla antes de irte.</p>\n<strong>¡A los nutmin no les gustan los sitios oscuros!. </strong>Así que no te seguirán a través de las tuberías. Pero no te preocupes, ¡la isla está repleta de Nutmin!\r\n\r\n\r\nControls - Overworld\r\n<ul><li>WASD to move the player.\r\n</li><li>Right click to whistle the Nutmin.\r\n</li><li>Left click to throw the Nutmin.\r\n</li><li>Mouse middle button to move the camera.\r\n</li><li>Escape - Pause.</li></ul>\r\nControls - 2D sections\r\n<ul><li>A and D to move the player.\r\n</li><li>Space to jump.</li><li>Escape - Pause.<br/>\n</li></ul>\r\nCredits\r\n<ul><li>Design, Code, UI, 3D Character and Nutmin - NestorSaga</li><li>2D Character - TimeBandit360</li><li>Title Design - David Capel</li><li>Assets - Kenney</li><li>Music - Pixabay</li></ul>\n<p>\n</p>", "metacritic": null, "released": "2023-01-27", "tba": false, "updated": "2023-01-30T11:50:16", "background_image": "https://media.rawg.io/media/screenshots/b25/b256cf4bb17bf93e44d7178a929f14c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NestorSaga"], "genres": ["Simulation", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}