{"id": 91763, "slug": "polybot-7", "name": "POLYBOT-7", "name_original": "POLYBOT-7", "description": "<p>You are POLYBOT-7, the latest in a line of  fully-modular robot designs being put through The Gauntlet.</p>\n<p>Tactical positioning is crucial since you're not only under fire from other robots, you also automatically attract and attach nearby components until your slots are full--everything from various power sources and propulsion units to numerous types of utilities and weapons.</p>\n<p>Your parts <em>will</em> be destroyed, but you can blast other robots to pieces and let the salvage fly over to equip you, or find caches of even better parts to really show them what you're made of!</p>\n<p>If you're good enough, on your way through The Gauntlet take on additional challenges to acquire upgrades that expand your number of available slots until you finally have space for up to a couple dozen different components at once.</p>\r\nHelp\r\n<p>In-game tutorial messages and context help will teach the basics, but key to survival is the Purge mechanic. Sometimes you may want to drop your parts, but you can only do this by\"purging\" them, which destroys half of what you have while scattering the rest across the ground. Then you're free to rebuild by moving towards (hopefully) the remaining or other nearby parts that you want to attract. The Purge mechanic requires 100 turns to charge before it can be used again, however, so be careful in choosing when to carry it out.</p>\n<p>POLYBOT-7 is available with both a tileset and in glorious ASCII form, which you can toggle at the press of a button (F3!). It also supports movement via mouse, numpad, arrows, and vi-keys out of the box, along with a ton of other customization options.</p>\n<p>See the manual included with the game (also online here) for more info! (includes a list of mechanics and tips)<br/></p>\n<p>Installation and troubleshooting info can be found in the included readme file.  Although the download is only available for Windows, POLYBOT-7 works perfectly in Wine so playing it on Mac/Linux is possible, too. (In the latter case simply \"wine POLYBOT-7.exe\" in a terminal  will do.)<br/></p>\r\nHistory\r\n<p>POLYBOT-7 was developed as a project for the 2018 7DRL challenge, based on the source of a much bigger project. For more information and development details , see the release announcement on the dev blog, as well as the in-depth four-part postmortem.</p>\n<p>If you enjoy POLYBOT-7's style but want more, check out my magnum opus that I've been working on full-time for over five years now: Cogmind (also on Steam). It features a much bigger world to explore, and far more polish and content. (You also have a lot more control over your build; while similar in style and theme, POLYBOT-7 is a rather different experience.)<br/></p>\r\nCredits\r\n<p>Josh \"Kyzrati\" Ge (@GridSageGames) — Developer<br/>\r\nKacper Woźniak (@ThKasparrr) — Tileset</p>", "metacritic": null, "released": "2018-03-12", "tba": false, "updated": "2019-08-28T23:26:06", "background_image": "https://media.rawg.io/media/screenshots/bb7/bb7004d281af60e89f3a16bbe34ccb83.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kyzrati"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}