{"id": 917691, "slug": "mars-2089", "name": "Mars: 2089", "name_original": "Mars: 2089", "description": "<p>In the distant year of 2089, humans have managed to colonize other planets in the solar system, including Mars. You are a lowly farmer living on the outskirts of one of the biggest settlements on the red planet. But when your family is murdered by an unknown mercenary, your peaceful life is thrown into chaos as you descend into the undercity and seek your vengeance.</p>\n<p>PRODUCTION NOTES:</p>\n<p>Mars: 2089 is a text-based narrative game made through the program Twine. It follows you, a farmer living on the outskirts of an advanced martian colony, as you undertake a quest for revenge after the murder of your family at the hands of a mysterious mercenary. Along the way, you will meet friends, foes, tricksters, and more, and you must navigate the city by making various choices that can all lead to a different outcome.\r\n </p>\n<p>The writing and creation of this game took about four months, from the middle of October 2022 to the end of January 2023. My main motivation for creating the game was to prove to myself that I could make a narrative-based game within a set timeframe. This was challenging for many reasons. The first was the sheer scope; the total word count of the project was around 70,000 words and it features nearly 500 passages, much larger than anything else I have undertaken considering I started this project with most of my writing experience being based in screenwriting. Second was the timeframe, which I ended up having to move from December of 2022 to a last-chance release date of early February 2023 due to some personal issues. The third and biggest challenge was creating an interesting narrative. While I usually plan for a long time in advanced how I want my stories to unfold, I started writing Mars: 2089 on a whim and let the story come as I wrote, which turned out to be a whole lot more challenging than I anticipated. As tough as it was, though, I am proud of the fact that I was able to create this, even if it isn’t as perfect or polished as I would’ve hoped. While many of the narrative beats were incredibly difficult to work into the story and some of the world building needed more details/expansion, there were some elements were incredibly rewarding to write, and that made all the struggles worth it.\r\n </p>\n<p>I am treating this project less as a final product and more as a practice exercise for narrative design and early draft of a story I hope to one day expand upon. I can obviously see many of the flaws with the piece-some story beats are less than perfect and the prose is very obviously written by a newcomer to a novelistic style-but I’ve been drafting possible ideas for the story in novel form and I love what this process has taught me about making a branching narrative and the dedication that goes into making each choice matter.\r\n </p>\n<p>Anyways, that’s enough about that. I hope you all enjoy this silly (well, more of depressing) thing I made. \r\n</p><p>P.S. Don't mind the cover art for the game. I'm not a great digital artist, I just wanted to make this thing feel a bit less like a default game. </p>", "metacritic": null, "released": "2023-01-27", "tba": false, "updated": "2023-01-30T12:26:44", "background_image": "https://media.rawg.io/media/screenshots/05a/05a8e20b2315001bec59a2743a13987f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["NoahWT"], "genres": ["Action"], "publishers": [], "esrb_rating": null}