{"id": 917779, "slug": "space-mechanic-simulator-prologue", "name": "Space Mechanic Simulator: Prologue", "name_original": "Space Mechanic Simulator: Prologue", "description": "Space Mechanic Simulator: Prologue is an introduction to a world where you will have to face many problems, look for solutions, and thus achieve the impossible. All spiced up with a compelling story. The action of the Prologue takes place before the story of the full game.<br/><br/><h3>Welcome to AstrOpticon</h3>As a rising star of AstrOpticon Corporation, you will discover all the secrets of space mechanics' craft. You'll find out how hard it is to repair in zero gravity while keeping a close eye on resources that disappear in the blink of an eye.<h3>Zero Gravity</h3>The gameplay is based on moving in a weightless state using your high-end spacesuit while maintaining your fuel and oxygen levels. Flying using your thrusters is an art that you will have to master, otherwise, you will pay dearly for the resources.<br/><br/><h3>HUB</h3>Your interactive HUB will provide the necessary information about your mission status, showcase your license levels, which you will be able to raise over time, and check out a handful of statistics that will help you improve your performance. You will also be able to spend your money on interesting upgrades.<h3>Complex repairs</h3>Complex repairs require sophisticated tools. Therefore, as an employee of AstrOpticon Corporation, you have access to the latest technological advances, including an orbital screwdriver, magnetic wrench, high-end oscilloscope, gauge, or even an IR scanner. All of them will help to perform serious repairs.<br/><br/><h3>Astro 0221 reports for duty</h3>During the course of the game, you will come across devices with hundreds of parts. You will face hydraulic problems and examine electrical boxes in search of the proper voltage.<h3>The beauty of Space</h3>The story of prologue takes place on the orbits of Earth and Mars. You will also be able to visit the surface of the red planet with the most advanced rover. Admiring the scenery is an added benefit of this work.<h3>Features:</h3><ul><li>Extremely complex objects containing an enormous number of parts<br/></li><li>A tool wheel containing: Screwdriver, wrench, gauge, oscilloscope, IR scanner<br/></li><li>Extensive storyline<br/></li><li>Interactive HUB where you will be able to monitor and control the entire course of the game<br/></li><li>Skill development system<br/></li><li>Ability to scrap old parts<br/></li><li>Ability to print new parts<br/></li><li>High level of realism<br/></li><li>Ability to perform hydraulic and electrical repairs<br/></li><li>Resources such as fuel or oxygen</li></ul><br/><br/><br/>https://store.steampowered.com/app/995680/Dangerous_Truck/", "metacritic": null, "released": "2023-01-30", "tba": false, "updated": "2023-12-15T03:01:26", "background_image": "https://media.rawg.io/media/screenshots/25a/25a7517b1853b4bea2f69a5ab5a5b528.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 392, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Atomic Jelly"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["PlayWay", "Atomic Jelly"], "esrb_rating": null}