{"id": 917792, "slug": "elohim-eternal-the-babel-code", "name": "Elohim Eternal: The Babel Code", "name_original": "Elohim Eternal: The Babel Code", "description": "<strong>Confirmed to work on Steam Deck!</strong><br/><br/>Explore a vibrant world where ancient religions fuse with technology in this character-driven JRPG. Master deep turn-based combat as you battle with divine magic against beasts with mecha parts. Embark on a grand adventure to retrieve the sacred Babel code needed to come face-to-face with your Gods.<br/><br/><br/><br/>Play the role of Joshwa Asa, a soldier blindly devoted to his gods, and who is on the verge of losing everything he’s trained for. To make himself worthy to his superiors, he takes on a mission to infiltrate enemy territory and obtain a sacred code that could bring humankind closer to their Makers. But when secrets long buried are unraveled and a deadly cult will do anything to keep them hidden, Joshwa must question his beliefs and find the truth before the gods send flames of mass destruction.<br/><br/><br/>Enter an exotic setting that blends the best of fantasy and science fiction, all through the lens of ancient religion backed by years of research into Judaism and Christianity, as well as ancient Babylonian, Sumerian and Egyptian religions.<br/><br/><br/>Reveal enemy weaknesses and use divine magic to decimate your foes. Use that same divine magic to boost your power and break enemy shields. <br/><br/><br/>Equip elemental and divine magic and gear your characters with the right weapons and armor to challenge and defeat any enemy, even those sent by the Gods.", "metacritic": null, "released": "2023-01-30", "tba": false, "updated": "2023-02-03T03:46:03", "background_image": "https://media.rawg.io/media/screenshots/6ac/6ac92a6f473a55a4ef93afa190718fd7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 435, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["George Alexandros"], "genres": ["RPG"], "publishers": ["George Alexandros"], "esrb_rating": null}