{"id": 917787, "slug": "paperback-adventures", "name": "Paperback Adventures", "name_original": "Paperback Adventures", "description": "Combine word wizardry and superior strategy in this roguelike deckbuilding adventure. Craft a unique deck of letter cards throughout each journey, collect rewards from your victories, and each adventure unlocks new cards. Defeat your opponents, hopping from one genre to the next until you beat the final boss.<br/>\n<br/>\r\nWord crafting<br/>\r\nSpell a word with the letter cards available to you in every turn of a battle. Those cards will influence your defensive and offensive power for that turn. But choose your words carefully–the first or last letter of your word, depending on which way you lay your cards, will have the biggest impact. Because every card in your deck is also a letter, your deckbuilding decisions also affect your word crafting capabilities.<br/>\n<br/>\r\nSynergies<br/>\r\nEven heroes need help. Discover and purchase items and McGuffins during your adventure to support your deck of letter cards and help you defeat enemies. Apart from your starting items, the options presented to you during each game are randomized, so you’ll need to find a way to combine all your contrasting tools into a synergistic machine.<br/>\n<br/>\r\nDiscovery<br/>\r\nEnjoy a highly replayable roguelike game where every game presents you with new challenges and synergies to explore. Playthroughs let you unlock powerful new options for your characters and dangerous new challenges to keep things interesting.<br/>\n<br/>\r\nStory<br/>\r\nHelp the fictional novelist Paige Turner as she brainstorms her latest bestselling novel. You can’t let stodgy genre conventions get in the way, so be prepared to face all sorts of surprising enemies and collect a lot of…distinct loot as you piece a strange story together. Play as different genre-based characters, each with their own strengths, weaknesses, and playstyles.", "metacritic": null, "released": "2023-01-30", "tba": false, "updated": "2023-02-03T03:39:54", "background_image": "https://media.rawg.io/media/screenshots/62f/62fd0eeeaffbba2fd64fc52348735b79.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tim Fowers", "Jeff Krause", "Skye Larsen", "Alex Krause"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Fowers Games"], "esrb_rating": null}