{"id": 917808, "slug": "spellmasons", "name": "Spellmasons", "name_original": "Spellmasons", "description": "Spellmasons is a turn-based, tactical roguelike where you devise spell combinations to overcome an onslaught of relentless enemies. Play solo or team up with your friends in online cooperative multiplayer, and delve into the intricacies of magic where clever combinations yield powerfully satisfying results.<br/><br/><br/><br/>Conjure spells from an ever-growing repertoire in order to vanquish the forces of corruption, save your friends, and ultimately cleave a path of mangled viscera towards the great dark wizard that eagerly awaits your confrontation!<br/><br/><br/><br/>Each level is procedurally generated, providing you with endless means of avoiding an increasingly imminent demise by using walls, pits of questionable liquids, traps, and more to your advantage.  As you learn the many ways that your spells combine with each other and how they affect your enemies, your allies, and the environment, you will become more resourceful and adept at handling the most difficult encounters.<br/><br/><br/><br/>Spellmasons supports online multiplayer so you can coordinate and strategize with your friends!  The unique faction-based turn system allows you and your fellow mages to move, cast, and act simultaneously. Set up one-timers, alley-oops, and other epic cooperative maneuvers with impunity!<br/><br/><br/><br/>Unleash dangerously powerful endgame spell combinations where one small difference can mean the simultaneous death of every enemy on the map or the end of your run! (Seriously, you will blow yourself up.)<br/><br/>Spellmasons is a thoughtful, deliberate turn-based experience. Take your time, think creatively, and watch all of your devious plans unfold just like your diabolical little heart intended!", "metacritic": null, "released": "2023-01-31", "tba": false, "updated": "2023-02-03T04:08:15", "background_image": "https://media.rawg.io/media/screenshots/cf5/cf587fd91ca950c918f7478f6f872f82.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Octavia Blue"], "genres": ["Strategy", "Indie"], "publishers": ["Octavia Blue"], "esrb_rating": null}