{"id": 917823, "slug": "battle-of-vukovar-rain-of-steel", "name": "Battle of Vukovar: Rain of Steel", "name_original": "Battle of Vukovar: Rain of Steel", "description": "This strategy wargame takes you through a real-life map of the city of Vukovar during the 90s and the fight for it's liberation. You can join the historic fight by playing with your team against another team of players or by yourself against bots. Communicate and coordinate with your team players to accomplish your goals using real weapons used during the war.<h3>Game Mode</h3><br/>Choose one of the several modes in PLAY TRAINING to play against other players or an AI:<br/><br/><ul><li> CONQUEST: control the objectives to earn points over time, the more objectives you control the faster your team gets points<br/></li><li> RUSH: destroy or defend the objectives, if the attacker team runs out of reinforcements, the defender team wins<br/></li><li> KILL CONFIRMED: kill players of the opposing team and collect the dogtags to earn points, you can also collect dogtags from your team to deny the points for the other enemy team<br/></li><li> TEAM DEATMATCH: kill the enemy players to get points. Team must reach 100 kills to win the match<br/></li><li> CAPTURE THE FLAG: capture the enemy flag and bring it to your own base to make points, if the enemy team has your flag, you will have to retrieve it first<br/></li><li> FREE FOR ALL: kill every other player to get points</li></ul><h3>Training Mode</h3><ul><li> ALL MODS INCLUDED<br/></li><li> FRIENDLY FIRE<br/></li><li> ENABLE BOTS: enable 2 teams of bots, both offering a maximum of 16 of them<br/></li><li> AI DIFFICULTY: RECRUIT, REGULAR, VETERAN</li></ul><h3>Historic Features</h3><br/>The map used in the game accuretly represents the city of Vukovar during it's occupation in the 1990s. Choose on whose side you're playing by picking either the 204th brigade that is liberating the city or the Rebel team trying to seize it. Support your team by picking one of the three classes. Attack your enemys and accomplish your objectives using real weapons and equipment from the war:", "metacritic": null, "released": "2023-01-31", "tba": false, "updated": "2023-02-03T04:27:14", "background_image": "https://media.rawg.io/media/screenshots/af4/af4764282005142e352ca967009a69c4.jpg", "website": "https://crogamedevs.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 398, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cro Game Developers"], "genres": ["Action", "Strategy", "Simulation"], "publishers": ["Cro Game Developers"], "esrb_rating": null}