{"id": 917834, "slug": "slippery-flippers-episode-one-amulet-of-the-gods-2", "name": "Slippery Flippers: Episode One - Amulet of the Gods", "name_original": "Slippery Flippers: Episode One - Amulet of the Gods", "description": "Slippery Flippers: Episode One - Amulet of the Gods takes place on the chilly snow planet of Trion XY7N, where a prestigious museum is hosting new artifact exhibits from around Universe 3-6-07.<br/><br/>Orlando and his crew are looking for their next gig, and the museum is a prime target with their priceless relics on display. Not to mention this mysterious \"Amulet of the Gods\" with unknown godlike power is sitting there, waiting to be stolen.<br/><br/>Can this crew of misfits outwit Riggs and Luca, the local law enforcement, and steal the Amulet of the Gods?<br/><br/>Play Slippery Flippers: Episode One - Amulet of the Gods and see if Orlando can lead his crew to riches or ruin!<br/><br/><br/>Looking for something to steal and sell, Orlando and his crew come across a museum ad announcing new exhibits of valuable artifacts. Upon a closer look, they discover the Amulet of the Gods. This mysterious amulet, first discovered on Chohines, has been around for centuries and is said to hold the power of the gods, though its exact power has yet to be discovered.<br/><br/>This Amulet of the Gods sounds like the perfect mission for this crew of outlaws on the search for their next big payday.<br/><br/><br/><ul><li>Orlando is a cocky penguin and the crew's leader who left behind his former life as a farmer and cowboy on Pluto in search of excitement. In his search, he and his childhood friend Chip stole a spaceship and left the planet.<br/></li><li>Walter is a quiet polar bear who thinks actions speak louder than words. Though he's typically quiet in demeanor, if you get him on the topic of art (especially fine art) or classical music, he'll talk your ear off!<br/></li><li>Veda is a stylish axolotl who was a fashion designer before turning to a life of crime. She loved to win, and when she got second place, she lost it, stealing both the prize money and the winning dress.<br/></li><li>Chip is a tech enthusiast krill who is Orlando's childhood friend. Using his wit, Chip was able to steal the spaceship that got them off Pluto. Though he's their “eye in the sky,” he wishes to contribute more to their crew aside from making gadgets.</li></ul><br/><br/><br/><ul><li>17k words (about an hour and a half of playtime)<br/></li><li>Four endings to the heist (3 bad ends, 1 true end)<br/></li><li>A comedy-adventure visual novel with a menagerie of critters<br/></li><li>8 vibrant backgrounds &amp; 6 CGs</li></ul>", "metacritic": null, "released": "2023-02-02", "tba": false, "updated": "2023-02-03T04:40:47", "background_image": "https://media.rawg.io/media/screenshots/852/85258354160fcd8f1b5706a3842dafb0.jpg", "website": "https://snowhavenstudios.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Snowhaven Studios"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Snowhaven Studios"], "esrb_rating": null}