{"id": 917858, "slug": "rhythm-sprout-sick-beats-bad-sweets", "name": "Rhythm Sprout: Sick Beats & Bad Sweets", "name_original": "Rhythm Sprout: Sick Beats & Bad Sweets", "description": "<p>Rhythm Sprout is a handcrafted fast-paced rhythm action with original music and a wacky story mode.<br />\n- Step to the rhythm / Fight to the beat<br />\n- Remix levels with modifiers<br />\n- Follow a quirky self-aware story in between<br />\nKEY FEATURES<br />\nHANDCRAFTED LEVELS<br />\nEvery music track goes together with a unique and detailed 3D environment designed around its theme and story beat. Keep an eye out for little events and easter eggs throughout the levels!<br />\nORIGINAL SOUNDTRACK<br />\nAll the music is crafted exclusively for the game with creative beatmaps in mind. It results in high sync between sound and gameplay – you&#39;ll feel it!<br />\nMusic themes are inspired by different genres such as EDM, K-POP, Drum’n’Bass, Disco, Lo-fi hip-hop, even Metal, and much more.<br />\nA WACKY STORY TO FOLLOW<br />\nFollow Sprout - the Chosen Onion - on his lightweight and self-aware adventure between music levels. Make funny dialogue interactions, full of silly jokes and pop culture references. Help the adorable inhabitants of the Vegetable Kingdom and face a charming cast of Sweet Villains.<br />\nINFINITE REPLAYABILITY AND CHALLENGE WITH LEVEL MODIFIERS<br />\nAside from difficulty modes and highscore achievements, there are several modifiers to ramp up the challenge and replay value.<br />\nMix different level modifiers to get unique results:<br />\n- Speed up any song with the Turbo Mode<br />\n- Refresh your muscle memory using the Mirror Mode<br />\n- Shuffle the notes to get a unique beatmap<br />\n- Or wing it entirely with the always-changing Totally Random Mode<br />\nOn top of that, Rhythm Sprout features gimmicky bonus levels for extra fun.<br />\nCUSTOMIZATION<br />\nDid we mention the unlockable outfits for Sprout?<br />\nAs well as skins for your weapon!</p>", "metacritic": null, "released": "2023-01-31", "tba": false, "updated": "2023-11-29T23:01:26", "background_image": "https://media.rawg.io/media/games/4aa/4aa9c91f8fca57c5cdfa8c357ef1492b.jpg", "website": "https://www.rhythmsprout.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 8, "beaten": 3, "toplay": 1, "dropped": 2}, "playtime": 2, "achievements_count": 22, "ratings_count": 1, "suggestions_count": 362, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["SURT"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["tinyBuild"], "esrb_rating": null}