{"id": 917844, "slug": "towers-deck", "name": "Towers Deck", "name_original": "Towers Deck", "description": "Towers Deck is a roguelike tower defense deck building game. Buying cards, using them to destroy enemy waves, researching new technologies - all leads to one goal - protect the castle at all costs.<br/>\n<br/>\r\nPick your heroes<br/>\n<br/>\r\nEach run you will combine two heroes to synergise their deck powers and find new strategies. Each hero comes with its individual cards, technology tree and game starting stats. Combine the two heroes and find the best way to utilize their abilities.<br/>\n<br/>\r\nResearch new technologies<br/>\n<br/>\r\nYou will have the choice in which field to improve. Will you choose to further develop your character's abilities? Or start a new technology path to improve? All new research contributes to your gameplay - you can get more coins, new cards, more castle health and many others.<br/>\n<br/>\n<br/>\r\nPrepare for battle<br/>\n<br/>\r\nAfter drawing cards it is time for preparations. Use your cards to get more coins or mana, build towers, use spells to enhance tower abilities or impact enemies' paths.<br/>\n<br/>\r\nExpand your map<br/>\n<br/>\r\nBegin your turn by expanding land. Each game you will create a completely different map. Each land expansion may come with a variety of different terrain, on which your towers will get different bonuses. You can get more damage, attack speed or range depending on where you choose to place your tower.<br/>\n<br/>\r\nUpgrade your deck<br/>\n<br/>\r\nBuy new cards - each card has charges, after using it corresponding number of times it will be destroyed, so your deck will evolve through the run. Plan and buy accordingly, improve your deck and use the best card combinations to survive the longest.<br/>\n<br/>\r\n*This is a solo developed passion project, so there may be bugs and your feedback is very important", "metacritic": null, "released": "2023-02-01", "tba": false, "updated": "2023-02-03T04:54:49", "background_image": "https://media.rawg.io/media/screenshots/1f4/1f402d49ddff40a6cacacef2225efa68.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Emilijus Games"], "genres": ["Strategy", "Indie"], "publishers": ["Emilijus Games"], "esrb_rating": null}