{"id": 917889, "slug": "inward-2", "name": "Inward", "name_original": "Inward", "description": "<ul><li>Build a daily mindfulness meditation practice through innovative gameplay<br/></li><li>Design your sanctuary with elements earned through the habit-building progress<br/></li><li>Track your progress through the collection of trees you have nurtured on your journey<br/></li><li>From the creator of Playne: The Meditation Game</li></ul><strong><h3>Cultivate Habits for Calm and Healing</h3></strong><br/>Inward is a journey of self-discovery and personal growth designed to promote positive well-being through habit-forming gameplay<br/><br/><ul><li> Discover mindfulness through guided meditations<br/></li><li> Express and reflect on your experiences with various journaling techniques<br/></li><li> Guided meditations that adapt to your session length </li></ul><strong><h3>Create a Beautiful Sanctuary</h3></strong><br/>Watch your well-being thrive as you revisit Inward and establish daily habits. As you grow, the game world transforms and expands, granting you access to new elements to create a personalized sanctuary that reflects your journey.<br/><br/><ul><li> Customize your sanctuary with a variety of elements, including grass, flowers, and wildlife<br/></li><li> Unlock visual upgrades as you form habits for improved well-being<br/></li><li> Create a personalized refuge that embodies your growth journey.</li></ul><strong><h3>Discover and Grow Your Own Tree Species</h3></strong><br/>Create and name your own unique tree species among the hundreds of thousands waiting to be discovered. Select the trunk, branches, and leaves of your creation in Inward, and let other players find it. Join forces to bring back the thriving forests of the past.<br/><strong><h3>From the Developer</h3></strong><br/>I am grateful for your support of my small game. Everything I share through Inward is based on my personal experiences and what has helped me in my journey towards well-being. Your early support as a self-published game developer means the world to me, thank you.", "metacritic": null, "released": "2023-02-02", "tba": false, "updated": "2023-02-03T05:52:45", "background_image": "https://media.rawg.io/media/screenshots/699/699bb0715f08d1418a60bfe9baf9578a.jpg", "website": "https://www.patreon.com/krishs", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Krish Shrikumar"], "genres": ["Simulation", "Indie"], "publishers": ["Krish Shrikumar"], "esrb_rating": null}