{"id": 917812, "slug": "phanotia-i-escavive", "name": "PHANOTIA I: ESCAVIVE", "name_original": "PHANOTIA I: ESCAVIVE", "description": "\"Phanotia I: Escavive\" is an ARPG game using pixel style. Players will play the role of \"Connecticut\" to find rescue in the wilderness and make the Mobile Fortress \"Oslou\" out of danger.<br/>\r\nOn May 29, 7317, the giant city of Goldberg fell across the board, and the army of Sha beasts entered the imperial city, announcing the fall of the giant city of Goldberg. A large herd of Sha beasts galloped in the direction of the last group of evacuated people, and the Mobile Fortress Oslou took on the task of attracting the Sha beasts and luring them away. Unexpectedly, there was a very powerful level Star in the herd of Sha beasts. Oslou was severely injured, escaped by chance, and broke down in the wilderness. Due to the severe damage, the Oslou was unable to communicate with the outside world. \"Connecticut\" took on the heavy responsibility of seeking rescue and getting the Oslou and her friends out of danger.<br/>\r\n\"Phanotia I: Escavive\" is independently produced by Kanngi. Players can experience excellent plots and relatively excellent vertical paintings in the game. Of course, the game contains a lot of sincerity, and players can experience exquisite level design and smooth game experience. the entire \"Phanotia\" series has a magnificent world view, which will be presented to all respected players in the future.", "metacritic": null, "released": "2023-01-31", "tba": false, "updated": "2023-02-03T04:12:41", "background_image": "https://media.rawg.io/media/screenshots/a73/a73c12884f592330f38f6a735ebd0361.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KANNGI", "YUGKON UNION"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["YUGKON UNION"], "esrb_rating": null}