{"id": 9180, "slug": "coors-light-super-refresh-men", "name": "Coors Light Super Refresh-Men", "name_original": "Coors Light Super Refresh-Men", "description": "Beat the heat. Save the Rockies.<br/><br/>The Coors Light® Refresh-Men return to do battle with Scorcher, who has set the Rockies ablaze! Defeat Scorcher’s Fire Clan minions and restore the ice cold refreshment of Coors Light to the world.<br/><br/>With a brand new team of Refresh-Men at your side, journey through the Rockies and put a stop to Scorcher’s plan in this retro brawler. Journey through new environments, each with unique enemies and dangers. Harness the power of combos and special attacks to take down your foes. Watch the story unfold, and beat the heat once and for all!<br/><br/>FEATURES:<br/><br/>FOUR PLAYABLE CHARACTERS<br/>Play as your favorite member of the Refresh-Men: Rocky, Flurry, Avalanche or Blizzard. Each character has unique stats and special abilities.<br/><br/>DRAMATIC BOSSES<br/>Pit your skills up against an array of fearsome enemies with their own deadly attacks.<br/><br/>STRATEGIC COMBAT MOVES<br/>Deploy uppercuts, charge-up smashes, and overhead throws to control your enemies<br/><br/>MIGHTY POWERUPS<br/>Use these powerful enhancements to defeat your foes! The Chill Shield grants you invulnerability, while the Silver Bullet increases your attack power and speed.<br/><br/>DEADLY HAZARDS<br/>Avoid traps and obstacles in the environment as you adventure through the game.<br/><br/><br/>Due to the references to alcohol, Apple classifieds this app as 17+. However, since the application is sponsored by the Coors Brewing Company, by downloading it you state that you are over the age of 21.", "metacritic": null, "released": "2015-10-31", "tba": false, "updated": "2019-10-22T14:30:19", "background_image": "https://media.rawg.io/media/screenshots/928/9281dcf3a09231fc47959bdccf6a4ce4.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MillerCoors"], "genres": ["Action", "Adventure"], "publishers": ["MillerCoors"], "esrb_rating": "Mature"}