{"id": 918026, "slug": "lumien", "name": "Lumien", "name_original": "Lumien", "description": "More than 60 students of the Media Informatics and Interactive Entertainment program at Mittweida University of Applied Sciences have developed their own game within 11 months - Lumien.<br/><br/>Lumien is a fast-paced third-person platformer in which you explore the ruins of an ancient civilization and breathe life back into it. On your way past the various defenses, you'll be helped by the Orbs, fueled by the mysterious powers of the civilization.<h3>Rapid Platforming</h3><br/><br/><br/><br/>To match the existing dangers, you'll have to acquire the civilization's technology, through various abilities. These will let you advance faster and faster and overcome previously insurmountable obstacles.<h3>Unique Orbs</h3><br/>Beyond the diverse movement abilities, you'll be able to use various orbs. These orbs work both as an extension of your movement and as your best means to dodge enemies. You'll be able to send them in specific directions and then activate them manually to unleash their special powers.<h3>Interactive Obstacles</h3><br/><br/><br/><br/>On your way, traps and enemies await you, which will try to stop you. You'll encounter spike traps, guided by the self-defense system of civilization. But those obstacles can also bring you closer to your goal if you manipulate them cleverly. Additionally, with the orbs you can have an influence on the state of the level, which can disable traps or allow you to bypass them completely.<h3>Key Features</h3><br/><ul><li>Simultaneous coordination of up to two orbs with unique abilities<br/></li><li>An interactive environment that you can manipulate with the help of the orbs<br/></li><li>Fast-paced third-person platforming with a dash of action<br/></li><li>An underground civilization characterized by a mysterious knowledge network </li></ul>", "metacritic": null, "released": "2023-02-02", "tba": false, "updated": "2023-03-31T05:04:02", "background_image": "https://media.rawg.io/media/screenshots/6f5/6f519c241caff63363a916d1c0fa57de.jpg", "website": "https://beta-mittweida.de/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["games-studieren", "Martin", "Benny", "Tiogiras", "ithilnarmo", "Frejia", "JohannesBaetz-code", "Mertyn", "Citus", "Flann", "nosleep999", "Xa4", "Sothe0", "Angenakoi", "Ekto", "Annie Simon", "duckistopheles", "Remezoker", "Jannick Mitsch", "Annabell Schuetze", "havoc", "Queen1997", "April", "JEP", "Julian Schreiter", "BlackLotus1902", "Ben", "MI Matrikel 20"], "genres": ["Action", "Adventure", "Strategy", "Puzzle"], "publishers": ["Hochschule Mittweida"], "esrb_rating": null}