{"id": 91803, "slug": "modlands", "name": "MODLANDS (itch)", "name_original": "MODLANDS (itch)", "description": "WELCOME TO MODLANDS!!!\r\n<p><strong>Modlands</strong> is a highly-moddable colony sim with Twitch integration!<br/></p>\n<ul><li>Build worlds for your Twitch chat to live in as colonists!</li><li>Co-operate with the chat to build a base and defend it!</li><li>Your audience members can cooperate, role-play, or fight to the death in your world!</li></ul>\n<p>FOLLOW me here on itch.io to hear whenever I post new builds! :D<br/></p>\n\r\nBIG UPDATE COMING END OF AUGUST!\r\n<p>At the end of August, Modlands will be getting a big update! This update will add:</p>\n<ul><li>Blockchain-based items that people can buy, sell and trade! Everyone who has bought the game, or backed it on Patreon before then, will get exclusive items as a reward.</li><li>The game will go free-to-play; instead of a separate demo build, there will be one build that everyone can download and play freely.</li><li>Gameplay updates - RTS-style controls to directly control colonists, and a Quest System to better introduce all the systems of the game</li><li>Support for Mixer and YouTube chat - supporting the other major streaming platforms, in addition to Twitch :)</li></ul>\n\r\nLINKS\r\n<ul><li>Watch streams of the game &amp; its development every weekday, by following the Twitch Channel and Mixer Channel! This is a great place to try out the game and give me feedback on the chat-player experience, or to give me any kind of feedback on the game and get a live response!</li><li>Catch VIDEO DEVLOGS and other fun on the YouTube Channel!</li><li>Talk to me and chat with Modlands fans on the Discord Community</li><li>Get daily info on updates and when livestreams are happening on Twitter</li><li>Support ongoing development of Modlands and get special benefits, like your own character in the game, by joining the Patreon!</li></ul>", "metacritic": null, "released": "2018-01-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1c5/1c5f07b29d2f37f94f666e275d2cd5f9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["triplejumpgames"], "genres": ["RPG", "Simulation"], "publishers": [], "esrb_rating": null}