{"id": 918141, "slug": "mars-hack", "name": "Mars Hack", "name_original": "Mars Hack", "description": "<p>Mars-hack est un jeu en 2D pixelisé conçu pour deux joueurs sur un seul clavier. Le jeu se déroule sur Mars et implique deux joueurs qui s'affrontent en ayant chacun cinq vies. L'objectif est de toucher cinq fois l'adversaire pour remporter la victoire. Afin de vaincre votre adversaire, vous pouvez utiliser diverses tactiques telles que le jetpack pour éviter les ennemis, ainsi que les murs et les plateformes pour vous accrocher.\r\n</p>\n<p>Pour y jouer, l'un des joueurs utilise les flèches (haut, gauche et droite)pour se déplacer et Shift pour tirer. L'autre joueur utilise les touches qzd (azerty) pour se déplacer et la touche f pour tirer.\r\n</p>\n<p>Le jeu a été conçu par une équipe composée de Enzo Borel, Albina Stashenko, Camille Bento Canastra, Sam Guedon, Maxime Petit et Etienne Kinderstuth. Chacun de ces développeurs a apporté son expertise et son savoir-faire pour créer un jeu excitant et captivant.\r\n</p>\n<p>L'équipe à aussi enregistrer les effets sonores et crée des gifs.\r\n</p>\n<p>Il peut être joué  avec un ami ou un membre de la famille, ce qui en fait un excellent choix pour les soirées en famille ou entre amis.\r\n</p>\n<p>Mars-hack est un jeu passionnant qui offre une expérience de jeu inoubliable pour les joueurs de tout âge. Alors, si vous êtes à la recherche d'un jeu divertissant et captivant, téléchargez Mars-hack dès maintenant ! \r\n</p>", "metacritic": null, "released": "2023-02-02", "tba": false, "updated": "2023-02-03T07:51:19", "background_image": "https://media.rawg.io/media/screenshots/408/408a096039556191a47fa4bf71af34d5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Camille BENTO CANASTRA"], "genres": ["Action"], "publishers": [], "esrb_rating": null}