{"id": 91837, "slug": "rogue-empire-the-prelude", "name": "Rogue Empire: The prelude", "name_original": "Rogue Empire: The prelude", "description": "<p>The main campaign takes place decades after <em>The Prelude</em>, with the world of Ethistos submerged in shadows!</p>\n<p>Additional features you can expect in <em>The main Campaign</em>:</p>\n<ul><li>Create a character from 7 race choices and 5 classes with distinct game play styles! </li><li>Explore a vast world map!</li><li>A lot of environments: Lava, Jungle, Dessert, Ice, ruins, etc</li><li>More  boss fights!</li><li>Gather soul essence during your several adventures and unlock new content/perks.</li></ul>\n<p><strong>Game tips and instructions (for the prelude)</strong></p>\n<p>You have an in game tutorial system to help you along and a manual (esc -&gt; manual), but I will give you some pointers here for successful adventure:</p>\n<ul><li>The game is turn based, so think carefully before acting. Sometimes it is better to wait for the enemy to come close or even run than go in Leeroy style!</li><li>The character is a warrior and can feel fairly tanky later in the game. This can let to overconfidence. Try to have always 50% + hp.</li><li>'R'resting is your friend. Try to do it in small rooms and close the door.</li><li>Don't underestimate the power of wands to get out of some sticky situations.</li><li>For the moment when going to another level monsters won't follow. This might change in the future... or not ;)</li><li>You might notice small blue souls flying around the level, they hit you at where the next level is.</li></ul>", "metacritic": null, "released": "2016-12-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/322/3223bc268cdcbbf5a39733297f58ced6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Rogue Empire"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}