{"id": 91847, "slug": "powerglove", "name": "Powerglove", "name_original": "Powerglove", "description": "<p>\r\n\tThe world's fossil resources are exhausted. Two polar subterranean thermal reactors supply the increasing energy demand of mankind. An explosion in the Northern polar thermal reactor has destroyed all primary and secondary energy connections and contact with the engineers and rescue robots has been lost.</p>\n<p>\r\n\tWithout an energy supply the death of billions is imminent! We need the five control diamonds to engage the station's backup systems. Use the shielded suit and the <strong>Powerglove </strong>to protect you against the maintenance robots.</p>\n<p>\r\n\tYou're our only hope!</p>\n<p>\n<strong>Powerglove</strong> is a classic-era run 'n' gun game developed by Lazycow for the 30 year old Commodore 64 home computer, initially released as an entry in the 2013 RGCD 16K C64 Game Development Competition (where it placed 3rd out of 15 entries). The final version was released as a 16KB physical game cartridge in September 2014, complete with additional content and features.</p>\n<p>\r\n\tGuide the hero through the polar thermal reactor complex, navigate the complex network of transport tubes, locate the five control diamonds and blast away every rogue robot that stands in your path!</p>\n<p>\r\n\tThis itch.io exclusive PC/Mac OSX/Linux version of the game is based on the Commodore 64 original (with some minor enhancements, such as parallax scrolling and optional pimped spritework).</p>\n<p>\n<strong>Powerglove</strong> features:</p>\n<ul>\n<li>Classic run 'n' gun action!</li> <li>Seven types of fiendish mechanical monsters to vanquish!</li> <li>Cool stuff to collect (including Powerboots)!</li> <li>Authentic and pimped C64 artwork!</li> <li>SID Soundtrack by Cyborgjeff!</li> <li>Controller support!</li></ul>\n<p>\n<strong>Buy Powerglove on Cartridge for your Commodore 64 Computer!</strong></p>\n<p>\r\n\tEnjoyed <strong>Powerglove</strong> on your modern-day PC? Have an old Commodore 64 stashed away in the loft? Well, you'd be a fool not to grab a physical copy of the C64 version - it comes boxed with a poster, map, little vinyl stickers and everything, just like in the good old days! </p>\n\n<p>\r\n\tHead on over to our online store to order your copy today :)</p>\n<p>\n<em>(The C64 version is available to buy as a physical cartridge. A2 and A3 posters are also available for purchase).</em></p>\n<p>Please note that the downloadable Commodore 64 version available here is primarily for use with emulators, but can also be run on a real C64 via hardware such as the 1541 Ultimate II. For emulator users, we recommend VICE, as it works on a variety of operating systems and is very user friendly. In fact, we've even included a pre-configured 32-Bit Windows copy with the download together with some simple user instructions (we're nice like that).</p>\n<p><strong>The Windows, Linux and Mac OSX versions of Powerglove are ALL available for FREE, whereas t</strong><strong>he Commodore 64 version of the game is available for download if you pay $2.99 or above.</strong></p>", "metacritic": null, "released": "2014-09-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/887/887dc00f62f797f9ac5cd95b1ca73e2c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["RGCD.DEV"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}