{"id": 91857, "slug": "yggdrasil-chronicles-a-tale-of-cindrivia", "name": "Yggdrasil Chronicles - A Tale of Cindrivia", "name_original": "Yggdrasil Chronicles - A Tale of Cindrivia", "description": "<p><strong>Yggdrasil Chronicles - A Tale of Cindrivia</strong> is a turn-based JRPG, set in a fantasy world named Cindrivia. This game is made on RPG Maker VX Ace by Ryan Entertainment Studio. This game is free-to-play,  which means you have to pay nothing to experience. However, we will be very grateful if a small donation is made.  We are also developing the sequel called \"Yggdrasil Chronicles - A Record of Valkadia\", so if you feel interested, please visit our Facebook page for more information: https://www.facebook.com/RyanEntertainmentStudio <br/></p>\n<p>To download the game, please follow our provided Google Drive link. We are truly sorry for this inconvenience because of 750 MB limited by Itch.io</p>\n<p>Estimated Playtime: 20 Hours</p>\n<ul><li><strong>General Story</strong></li></ul>\n<p>Hundred years ago, The Illuminati Order, originally formed by a demon named Lucifer, plunged the whole world into Chaos. With his mighty power, he slowly turned this living world into a dead one. However, six remarkable warriors, calling themselves Warriors of The Holy Alliance, possessed the power of faith and justice, stood against The Illuminati as the last hope of Cindrivia. With the help of six Heavely Artifacts sent down by Aina The Goddess of Night, they finally put an end to Lucifer and his Illuminati Order. The world of Cindrivia then found peace again for a while. Many years have passed, and now The Illuminati is being brought back by a mysterious wizard so-called Ryan The Illuminator. The existence of Cindrivia and even The Yggdrasil Tree is in danger once again.</p>\n<ul><li><strong>Highlighted features:</strong></li></ul>\n<p>- Turn-based ATB battle system: Actions are depended on this system to be performed during a battle. Just be patient and wait for your ATB gauges to be filled.</p>\n<p>- Manual Stat Distribution: There are four stats that you can distribute by yourself to build up your characters. They are Vitality, Strength, Dextirity and Mentality which directly affect your characters' power.</p>\n<p>- Day &amp; Night Circle + Lighting Effect System:  We do provide a day-night circle which can affect some of your actions in game and also an awesome light effect system to enhance the visual effects of the game.</p>\n<p>- Quest &amp; Achievement System: As a must-have in every RPG game, we divide our quests into two types: Main Quests and Side Quests. Completing the main quests provides you a full understanding of the story while the side quests and achievements provide you handsome rewards to make your journey much easier.</p>\n<p>- Crafting and Enhancing Equipments: Defeating monsters, collecting the materials from them to craft some unique equipment. The equipment can also be enhanced (+1, +2, etc) to provide better stats. Over 100 items to be discovered!</p>\n<p>- Class Changing System: You can change your characters' classes to higher ones when they reach a certain level. This will provide them a better bonus to their parameters and some more new skills.</p>", "metacritic": null, "released": "2017-11-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5b4/5b4bdceb72fd31819ba8e949f42be480.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 328, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ryan Entertainment"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}