{"id": 918669, "slug": "grabe-4x4-demo-10-free-beat-em-up-beatemup", "name": "GRABE 4X4 (Demo 1.0) Free Beat 'em up beatemup", "name_original": "GRABE 4X4 (Demo 1.0) Free Beat 'em up beatemup", "description": "<p><strong><em>C O R E   G A M E   M E C H A N I C</em></strong><br/></p>\n<p>This is <strong>the first Beat Em Up to implement the innovative 4x4 stylistic combat system</strong> as the game core mechanic. <strong>The 4x4 system uses 4 basic buttons and </strong>each button is capable to execute different combo attacks, jump attacks, dash attacks and grab attacks.<br/></p>\n<p>In this game <strong>YOUR ENEMY HAS MORE INTEL ABOUT YOU</strong> and that's the main reason why they can just detect most of your attacks and moves. Randomly they can detect 2 buttons from your 4 active attack buttons at a time. So that means they can block, dodge or even counter your attack <strong>if you hit them pressing the wrong button</strong>. </p>\n<p>On the other hand, the 4x4 system is offering the player a <strong>27 different attack options and mechanics</strong> to deal with these problem but <strong>you need to detect which attack will work or not,</strong><strong> only by directly engaging with your enemies</strong>.</p>\n\n<p><strong>IT IS HIGHLY RECOMMENDED TO USE THE<br/></strong><strong>STANDARD 8 BUTTON X-INPUT CONTROLLER</strong><br/><strong>PAUSE THE GAME DURING GAME PLAY AND GO TO CONTROLS TO <br/></strong><strong>VIEW ALL THE LIST OF 4X4 MECHANICS FOR THIS GAME.</strong><br/></p>\n<br/><strong>\"WATCH THE YOUTUBE VIDEO FOR THE DEMONSTRATION\"<br/></strong>\n<p><strong>THE GAME IS STILL UNDER DEVELOPMENT STAGE SO EXPECT SOME MINOR BUGS MAY SHOW-UP DURING YOUR GAME PLAY AND YOU WILL ALSO EXPECT MORE CHANGES AND UPDATES FOR OUR NEXT VERSION BUILD DEMO.</strong></p>\n<p><strong>BY REPORTING THOSE BUGS ACCURATELY, AND SHARING YOUR CRITICAL FEEDBACK AND SUGGESTIONS, DON'T FORGET THAT YOU ARE ALSO HELPING US IN POLISHING AND FINISHING THE GAME.<br/><br/>WISHLIST NOW OUR STEAMPAGE<br/>WISHLIST NOW OUR STEAMPAGE<br/>WISHLIST NOW OUR STEAMPAGE<br/>WISHLIST NOW OUR STEAMPAGE<br/>WISHLIST NOW OUR STEAMPAGE<br/></strong><br/><strong>\" M A B U H A Y   A N G   M G A   P I N O Y   D E V S ! \"</strong><br/></p>", "metacritic": null, "released": "2023-02-01", "tba": false, "updated": "2023-02-03T11:55:37", "background_image": "https://media.rawg.io/media/screenshots/f64/f649f6d3fad242845718d8e0422350f0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ProjectJOEART"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}