{"id": 918675, "slug": "au-royaume-des-aveugles-on-ne-regarde-pas-les-dent", "name": "Au royaume des aveugles on ne regarde pas les dents", "name_original": "Au royaume des aveugles on ne regarde pas les dents", "description": "<p>Incarnez une brave petite gobeline cherchant à s'élever socialement, dans cette fiction interactive expérimentale au délicieux goût d'inachevé.</p>\n<p>Ce court jeu a été réalisé pour le concours de fiction interactive francophone 2023, autour des thèmes  trahison\" et \"archives\". Il a été développé sur un prototype de moteur de jeu lui aussi créé pendant la jam.</p>\n<p>Remerciements à la communauté Discord \"Fiction interactive\" pour son aide et sa passion du jeu textuel, et à Oyashirox pour ses tests.<br/>Image de couverture par sarty96 :<br/>https://www.deviantart.com/sarty96/art/Dina-the-Paladina-908831446<br/></p>\n<p>NB : Les sources (python3) seront mises à disposition prochainement.</p>\n\r\nSaisie des commandes\r\n<p>Elle est est expérimentale et fonctionne par mot-clef :</p>\n<p>Dans le cadre de ce jeu, ce n'est pas le verbe qu'il faut saisir en premier mais l'objet d'attention, et le mécanisme de suggestion se charge de lui proposer les actions qui lui sont applicables et les compléments éventuels.</p>\n<p>Un système de complétion automatique, à déclencher par appui de la touche <tab>, complète les commandes entamées et fait défiler les différentes suggestions de commande a valider.</tab></p>\r\nÉcoulement du temps et planification\r\n<p>Le temps s'écoule au fur et à mesure de vos actions dont la durée (estimée à droite de la commande correspondante.. en secondes pr le moment) peut être altérée par la fatigue de votre personnage.</p>\n<p>Etre trop lent peut vous rendre incapable de réaliser les tâches prévues avant une date butoir. </p>\r\nGestion des affrontements physiques\r\n<p>Les affrontements physiques ne sont pas régis par le hasard et vos adversaires choisissent leurs actions avant vous et sur la base de vos actions précédentes.</p>\n<p>Ne soyez pas prévisibles !</p>", "metacritic": null, "released": "2023-02-01", "tba": false, "updated": "2023-02-03T11:57:40", "background_image": "https://media.rawg.io/media/screenshots/17e/17e510d97798a52f0aa3288b0c822658.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Jeesay Ash"], "genres": [], "publishers": [], "esrb_rating": null}