{"id": 918779, "slug": "briefe-vom-herzen-tilly", "name": "Briefe vom Herzen: Tilly", "name_original": "Briefe vom Herzen: Tilly", "description": "<em>Ich erinnere mich an dein Lachen, als du mir erklärtest, was für einen Aufwand ich betrieben habe um mir dieses Essen vorzubereiten. Aber manchmal macht man wohl unüberlegte Dinge, wenn man müde ist.</em>\n<p>Dies ist ein persönliches Spiel, welches meine Erlebnisse in Form einer Geschichte verarbeitet, aber darauf verzichtet Geschehnisse so wie sie stattgefunden sind darzustellen. Es ist wholesome und warm und ich hoffe ihr habt eure Freude daran, wenn auch es vielleicht nicht die spannendste Geschichte der Welt ist, so war es mir doch wichtig diese verwirrte Melancholie eines müden Morgens nachdem man eine Nacht weg war und gearbeitet oder gefeiert hat einzufangen.</p>\n<p>Die Hintergrundbilder sind während des Inktobers 2019 von mir gezeichnet worden, daraufhin hab ich sie digitalisiert und basierend auf einem privaten noch kleinerem Prototyp zu einem kohärenten Haus verflochten. Dieses Projekt hat sich unberechtigt lang als Solo-Nebenprojekt gezogen und ich bin so froh endlich die letzten Hürden überwunden zu haben. Es ist offensichtlich nur ein Prototyp für eine größere Idee, gefüllt mit vielen Briefe. Und vielleicht werden es eines Tages mehr, aber vorerst gibt es nur diesen einen. <br/></p>\n<p>Für alle, die an dem Entwicklungsprozess interessiert sind, hab ich einen Devlog zusammengestellt:</p>\n\n\n<p>Ich wünsch euch ein schönes Spielerlebnis und einen wunderschönen Tag. &lt;3 </p>", "metacritic": null, "released": "2023-01-31", "tba": false, "updated": "2023-02-03T12:49:47", "background_image": "https://media.rawg.io/media/screenshots/5ae/5aec2941c81d5807d322c56aa2b853c1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["thebrokenbird"], "genres": [], "publishers": [], "esrb_rating": null}