{"id": 91888, "slug": "yum-yum-dating-show", "name": "Yum Yum! Dating Show", "name_original": "Yum Yum! Dating Show", "description": "<p>The Yum Yum! Dating Show, the greatest dating show in the land! </p><p>Featuring 6 potential partners, True Love awaits! But who will win your heart? <br/></p><p>As a contestant on the show, you must first ask the boys a question - then, depending on their answers, eliminate them one-by-one from the competition!</p><p> The boys are whittled down until there's only 1 remaining - who you can then enjoy  spending the rest of your life with! </p><p><em>(No refunds. Choose at your own risk. We will not be held responsible for any tragic events that occur from dating these boys. Please date responsibly.)</em> <br/></p><p><em>A send-up of dating shows and anime tropes, about 20 minutes per playthrough. Multiple choices - ooh! But only 1 true ending!</em> <br/></p><p><em>May contain a rude word or two, and a lot of innuendo. But apart from that it's innocent enough!<br/></em></p><p><em>Note: The game ends with an Oscar-winning performance by the self_voicing robot. Windows and Mac players should hear this automatically, but Linux players may need to install the 'espeak' command on their system before playing!</em><br/></p><p><em>Special thanks to Creative Commons resources: Godline for the original idea and script, Konett for 5 sprites, other sprites by: Anne, fuicchi, doot, MelodyL and Zylinder. A drumroll by heigh-hoo. Music by Josh Woodward and AlcaKnight. Made in Ren'Py </em></p><p><strong><em>Note for Let's Players/Streamers: </em></strong><em>Contains music by Josh Woodward which will probably flag Youtube's content_ID program</em><em>. Follow this link to see how to provide attribution: https://www.joshwoodward.com/sharing/    </em><em>Specific song titles used are in CREDITS.txt, provided in the game's folder</em>.</p><p><em><strong>One last thing: </strong>You can now play on Android, thanks to Godline! Link to Google Play:  https://play.google.com/store/apps/details?id=yyds.vn</em><br/></p>", "metacritic": null, "released": "2016-08-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7c8/7c8d19309eb9ff8265f882debb74ecf0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["qualifiedbadger"], "genres": [], "publishers": [], "esrb_rating": null}