{"id": 918861, "slug": "apoikia", "name": "Apoikia", "name_original": "Apoikia", "description": "L'histoire\r\n<p>Votre père, le roi de la cité de Corinthe a été assassiné par d'autres membres de votre famille. Comme vous êtes l'héritier.ère du trône, vous devez fuir la cité, au risque de vous faire éliminer.</p>\n<p>Heureusement, grâce à votre jugeote, de bonnes relations et l'intervention des dieux olympiens, vous pourrez partir en exil pour fonder une colonie dans des contrées lointaines.</p>\n<p>« Apoikia » signifie loin du foyer, c'est un jeu interactif dont l'histoire se déroule en Grèce archaïque. Une aventure qui vous plongera dans l'univers homérique, avec ses dieux et ses héros.<br/></p>\n\r\nSur le jeu\r\n<p>Le jeu se déroule en plusieurs chapitres :</p>\n<ul><li>Prologue et chapitre Alpha : la fuite de Corinthe et l'exil en mer (le côté aventure du jeu).</li><li>Chapitre Bêta : où vous devez gérer votre nouvelle colonie (la partie survie du jeu).</li></ul>\n<p>Un chapitre Gamma est en développement, il mettra l'accent sur le choix du joueur entre deux branches : partir à l'aventure ou gérer votre cité.</p>\n<p><strong>Aucune lassitude</strong> : un générateur d'événements et de noms fera que vous n'aurez ni les mêmes intrigues, ni les mêmes personnages en recommençant une partie. Le jeu prendra en compte vos choix, mais aussi votre destin selon votre tempérament. Vous pourrez ainsi tenter de débloquer des succès (ou achèvement) au nombre de 7.</p>\n<p>Compatible en version mobile.\r\n</p>\n<p>Le jeu peut comporter des scènes de violence pouvant heurter un jeune public (moins de 12 ans).</p>\n<p>Première parution pour le concours 2023 de fiction-interractive (thèmes : trahison et archives).</p>\n\r\nBugs ou autres\r\n<p>Le jeu peut comporter des bugs ou des fautes d'orthographe. Si vous en trouvez, merci de m'en informer sur Discord ou par mail : pasteours@proton.me.</p>", "metacritic": null, "released": "2023-01-31", "tba": false, "updated": "2023-02-03T13:26:38", "background_image": "https://media.rawg.io/media/screenshots/33c/33c8f70e611be12fdabca473ae044fc4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["PasteourS"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}