{"id": 91909, "slug": "blackberry-honey-itch", "name": "Blackberry Honey (itch)", "name_original": "Blackberry Honey (itch)", "description": "\n<p>Set in England during the mid-19th century, Blackberry Honey is a tale about maids, music, and unexpected romance.<br/><br/>The story begins when our heroine, Lorina Waugh, is fired from her previous position as a maid in the stately home of Hartwell. With a large family back in Liverpool to support and a string of unsavoury comments circulating about her rather sudden dismissal, Lorina’s search for a new place of employment leads her to Bly.<br/><br/>Forced to work for fourteen hours a day, with little chance to rest, Lorina is bullied by the senior maids and, most embarrassingly of all, by the twelve-year-old daughter of the Lennard family, Lady Constance.<br/><br/>One of the only maids who deigns to speak to Lorina is the mysterious Taohua – but Lorina wishes she wouldn’t. Despite her lowly status, Taohua has her own private bedroom, never goes to church with the rest of the servants, and rarely interacts with anybody. Her aloof, almost cat-like personality, coupled with her peculiar complexion, eyes, and name, have inspired more than a few rumours around the Shropshire countryside that she might be a witch.<br/><br/>Lorina knows she should keep her distance from Taohua, and she wants to most desperately… but maybe there’s a pinch of truth to all the rumours, because she soon finds herself under the older woman’s spell.<br/><br/></p>\n<ul><li>100k words of text</li><li>Around 7-10 hours of reading</li><li>A cute lesbian love story</li><li>A kinetic storyline with no choices/branches</li><li>Detailed backgrounds and CGs</li><li>1080p display</li><li>An original soundtrack with 18 unique pieces</li><li>Very long, frilly dresses</li><li>Victorian maids(!!!)</li><li>An option to download either the all ages or 18+ version through itch.io.</li></ul>\n\n<p>The adult patch can be downloaded for free here. If you want to patch the all ages version of the game, download this file, drop it into the 'game' folder inside Blackberry Honey, and rewrite the existing adult.rpa file with the new one. You'll know if the game has been patched correctly because the window title will change to Blackberry Honey (18+).</p>\n<p>Please note: if I update the Steam version of this game, it will remove the adult patch from your Steam folder, and you will need to download it again. I'm sorry if this causes any inconvenience ;A;</p>", "metacritic": null, "released": "2017-10-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a27/a27937508d5475a937e58755e2b86292.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 408, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["ebi-hime"], "genres": [], "publishers": [], "esrb_rating": null}