{"id": 919016, "slug": "epic-surfing", "name": "Epic Surfing", "name_original": "Epic Surfing", "description": "<p><strong>Surf giant breaking waves</strong> as fast as you can and <strong>try to reach 100km/h </strong>! But don't get caught by the whitewash or you'll be wiped out !\r\n</p>\n<p>Control of the speed boat using WASD or the arrow, use the mouse to orbit the camera and the wheel mouse to change view and zoom.\r\n</p>\n<p>Tips : The waves evolve as groups (or set), the more waves in the group the easier it is to ride them for long and the bigger the amplitude they can reach, so try to count them ! The amplitude of the groups circle back and forth with time, the waves move twice as fast as the group so they always disappear leaving another one behind.\r\n</p>\n<p>This is a demo built with Storm Breakers, an all-in-one upcoming Unity asset designed for epic deep water simulations, featuring <strong>an unprecedented wave model</strong> that allows to make such epic surfing mechanics with 10m high breaking waves, and way more !\r\n</p>\n<p>The demo is free, but any donation would greatly help me move further on !\r\n</p>\n<p>Play the 3 other demos at https://the-storm-rider.itch.io/storm-breakers-demos (include a ship sinking in a storm, and beautiful sailing)\r\n</p>\n<p>Join the community now ! https://discord.gg/MxQxGyskAG\r\n</p>\n<p>Note : the 3D model, skybox texture and engine audio clip won't be included in the Storm Breakers package, but links to download them will (most of these assets are free).\r\n</p>", "metacritic": null, "released": "2023-01-31", "tba": false, "updated": "2023-02-03T14:46:37", "background_image": "https://media.rawg.io/media/screenshots/3bf/3bff286449aa76d86dfeb1c1bb6e4b7f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Storm Rider"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}