{"id": 919101, "slug": "valo-a-sandbox-roguelike", "name": "Valo: A Sandbox Roguelike", "name_original": "Valo: A Sandbox Roguelike", "description": "Play, Mod, &amp; Make\r\n<p>Valo is a survival sandbox roguelike game built on top of a custom hackable engine. Survive the sandbox, hack it to make it your own, or throw out the content and build your own game instead!</p>\n<strong>Important:</strong> This game is in early development! Expect new content, features, <em>(and bugs + crashes 😢)</em> during the development process!\r\n\r\n\r\n\r\nPlay: A Survival Sandbox Roguelike\r\n\r\n<br/>\n<p><em>A base built from a town in the forest</em><br/></p>\n<p>Build, Farm, Craft, &amp; Explore to survive in the simulated world. <br/></p>\n<ul><li>Gather resources and to build your base and upgrade your gear</li><li>Explore infinite cave systems and sprawling forests</li><li>Farm a large variety of flora</li></ul>\n<p>While much of the content is still in development, here are some of the things you can do right now:<br/></p>\n\n<ul><li>Summon a bolt of lightning to smite a giant ant and accidentally start a forest fire</li>\n<li>Discover a clothing shop in a small village and put buckets on the mannequins heads</li>\n<li>Build a throne room for your castle with floors made of solid gold</li>\n<li>Discover a spider in your base and promptly burn the whole thing down</li>\n<li>Turn your farm into a mud pit by accidentally digging an irrigation canal that is too wide\r\n</li><li>Walk forever in the infinite map in an attempt to preoccupy yourself and escape your loneliness</li>\n<li>Throw a brick at a snake</li>\n<li>Blow apart a cliff-side using explosives and celebrate with fireworks</li>\n</ul>\r\nMod: <em>Customize Anything</em>\n\n<p><em>Custom laser rifle mod</em><br/></p>\n<ul><li>Create new items, creatures, tiles, world generators, animations, quests, and more!</li><li>Nearly all the content in the base game is built using external configuration files and Lua scripts</li><li>Built-in package system for keeping mods organized</li></ul>\r\nMake: <em>Build New Games</em>\n\n<p><em>A space exploration roguelike written using Valo (in development)</em><br/></p>\n<ul><li>Use Valo as a starting point for your new roguelike game</li><li>Write custom world generators, creature AIs, and items</li><li>Use custom tiles, fonts, and splash screens to make the game your own</li></ul>\r\nEngine features:\r\n\r\n\n<ul><li>Ever expanding Lua API and in-game terminal<br/>\n</li><li>Custom world generators, items, creatures, and tiles</li><li>Dynamic lighting and animation</li><li>Built in tools for sprite generation (image I/O and editing), reading/writing custom data to the world, publisher/subscriber signals, and much more</li></ul><p>Links:</p><ul><li>Discord: https://discord.gg/QRQAc7b7Tw</li><li>Follow development: https://mastodon.social/@npixia </li></ul>", "metacritic": null, "released": "2023-01-31", "tba": false, "updated": "2023-02-03T15:27:30", "background_image": "https://media.rawg.io/media/screenshots/f2d/f2d05d039685cd7afc45cba7ae8fe1e7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["npixia"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}