{"id": 91922, "slug": "mission-admission", "name": "Mission: Admission", "name_original": "Mission: Admission", "description": "<p>Like a game, the college application process is a system with rules. Mastering a game takes practice, but, for most people, the college application process is a game we only get to play once.</p><p>Mission: Admission is a persistent time management game about preparing for college. The game takes place over a week of real time, during which you need to plan, prioritize, and apply to colleges and scholarships. Players build up a character’s skills and level up curricular and extracurricular activities in order to meet application requirements and deadlines. </p><p>Make sure you consult the calendar early in the week so that you know what applications are coming up and when they will be due. Check back regularly to spend the energy you've earned, and don't forget to request letters of recommendation well in advance! If you want to help your student earn badges (which also lets you expand your school), you'll also have to fulfill their personal ambitions and college preparation tasks. It's going to take planning, strategy, and good time management to set yourself up for success after high school!</p><p>Mission: Admission strives to create playful ways to understand the systems essential to accessing higher education as well as provide a safe environment to learn and experiment with higher education strategies and choices before it really counts. Fun for everyone, high school to adult!<br/></p>", "metacritic": null, "released": "2018-04-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4c8/4c8db74954e643e5c7ab50c1dccdb094.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Sean Bouchard", "GameInnovationLab"], "genres": ["RPG", "Strategy", "Simulation", "Educational"], "publishers": [], "esrb_rating": null}