{"id": 91921, "slug": "us-lovely-corpses", "name": "Us Lovely Corpses", "name_original": "Us Lovely Corpses", "description": "<p><strong>Marisol Flores </strong><em>is a girl with a curse. A bizarre and incredibly powerful monster has taken a liking to her, and is now obsessed with kidnapping her. Every so often it appears, takes over the Flores household, and holds her hostage in the attic. To be frank, it's all gotten a little old.</em></p>\n<p><strong>Alejandra de Rosa</strong> <em>is the girl with a cure. At the very least, she's a neophyte witch who has the power and knowledge to fend off weird beasts and save pretty damsels.  She's served as assistant for years to her grandmother, a powerful witch who has walked these halls many times before, driving the monster back and saving Marisol. This time, however, Alex will be doing this on her own.</em></p>\n<p><em>It's a routine job... so why do things feel a little more dire than usual today?</em></p>\n<p><strong>US LOVELY CORPSES </strong>is a short surreal-horror-romance visual novel about helping a friend. Go through the house, cut the roses, and save the girl. Just remember: the monster knows you're here. There will be puzzles that you can only solve with hints from the roses, so try to keep an open ear while doing your job.</p>\n<p>But keep in mind you may not want to hear everything these flowers have to say.</p>\r\nCREDITS\r\n<ul><li>art and writing - d Marie Licea</li><li>music - LydianChord</li><li>GUI - BáiYù</li></ul>\n<p><strong>US LOVELY CORPSES contains sensitive, mature, and occasionally upsetting content. This game is not recommended for players under 16 or those of a nervous disposition. More detailed information can be found here.</strong></p>\n<p>US LOVELY CORPSES has one bad ending, another bad ending, one very bad \"ending\", and one True End.</p><p>US LOVELY CORPSES takes place in the same universe as HER FIRE.</p>", "metacritic": null, "released": "2018-03-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/220/220d5395b00af443b99a1f8516793149.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["d Marie"], "genres": [], "publishers": [], "esrb_rating": null}