{"id": 919344, "slug": "knight-and-fame-demo-101", "name": "Knight and fame demo 1.01", "name_original": "Knight and fame demo 1.01", "description": "<p><strong>** If the game on the web browser has problems Please download the game to play.<br/></strong></p>\n<p><strong>If you have any suggestions or comments You can recommend it. **</strong></p>\n<p><strong>Story</strong><br/></p>\n<p>               You are a young knight named Harold Hutchson who has entered the noble feudal lands of Grailicia in the absence of a king. </p>\n\n<p>Harold came to this land for some purpose. But in this demo, only part of it will be revealed.<br/></p>\n<p><strong>How to play</strong></p>\n<p>  - Use your mouse to click on people to talk. or get a quest</p>\n<p>  -  Use your mouse to click on the signs to go to the next area.</p>\n<p>  - Weapons, shields and skills can be set to use in battle. There are 3 types of skills.</p>\n<p>       1. Offensive is a physical attack with a weapon. add features such as double attack Attack and reduce defense, etc. Offensive is defeated by defensive.</p>\n<p>       2. defensive is a defensive skill. such as using a protective shield It will be affected by the shield while defending. Or a counter that uses a defensive weapon and counters, etc. Defensive is defeated by special .</p>\n<p>       3. special is a special attack that is the ultimate move of each person. It has a unique feature that is not deducted from defensive points like offensive skills, but special will be stopped if offensive skills are encountered.<br/></p>", "metacritic": null, "released": "2023-01-30", "tba": false, "updated": "2023-02-03T17:19:28", "background_image": "https://media.rawg.io/media/screenshots/f1f/f1fb809f296481713ad448a2f6ceb614.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["arkman012"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}