{"id": 91934, "slug": "palasiel-quest", "name": "Palasiel Quest", "name_original": "Palasiel Quest", "description": "<em><strong>1000 years ago</strong>, there was a <strong>great evil</strong> that brought upon terror on the world of Palasiel. This great evil was known as Azazel. In an effort to cease the chaos, a man was marked as <strong>The Chosen One</strong>. He, and 4 other adventurers dubbed the <strong>Five Warriors of Light</strong> went on a quest to defeat said evil. But they could not destroy Azazel, and could only ever hope to <strong>seal him away</strong>.</em>\n<p>Sound familiar? <em>Only sounds like the most <strong>clichéd</strong> setting to an RPG ever. </em></p>\n<p><em>Well...it's the base concept of Palasiel Quest.</em> </p>\n<p>This game was originally going to be an episodic parody RPG with lampshades on JRPG tropes and yada yada. Over the course of development, Palasiel Quest's tone and focus has shifted to something that takes itself a little more seriously. While the base concept still draws from the whole \"Chosen One\" trope, the story this game tells will be something different and more relatable. So here's the true story: </p>\n<p><em>In the world of Palasiel, dark forces are at play behind the scenes as empires fall, kingdoms topple, and civil unrest ever grows. The Creator decides to...\"borrow\" 5 young people from Earth into Palasiel to be this JRPG world's heroes. Daran, our appointed \"protaganist\" is given one instruction: \"Defeat the Evil Lord\". Only then, will Daran and the other be granted passage back to their own world. Join Daran as he journeys across Palasiel in search of the other people who were spirited away. Get caught up in kingdom politics, assassination attempts, crazy alter egos, prison breaks, throne usurping and more!</em></p>\r\nCharacters\r\n\n<p>One of the five who were spirited away to the world of Palasiel, Daran is the designated <strong>\"main protaganist\"</strong>. Not one to get himself involved with trouble, a strong sense of responsibility guides him on his journey. He is told one thing: <em>You are the \"chosen one\". There is an \"evil lord\" to defeat. Go.</em></p>\n<p>Daran's given class is the <strong>\"Warrior\"</strong>. He is typically balanced in both offence and defence. He can draw enemy attacks with his <strong>\"Taunt\"</strong> arte, and completely nullify damage for a turn with his <strong>\"Sentinel\"</strong> arte. He's also one of the very few people to deal elemental damage with his wide range of elemental artes before the player meets a dedicated mage.<br/></p>\n\n<p>One of the five who were spirited away to the world of Palasiel, Ariel is a spunky individual, proficient in the arts of healing magic and thievery. Having arrived in Palasiel 2 months before the start of the story, she has had time to venture around. She is a key member of the Palasiel Rogues, a resistance group looking to liberate their kingdom.</p>\n<p>Ariel is dubbed a <strong>\"Thiefmage\"</strong>. She is a hybrid of a white mage and a thief. She boast incredible speed and magic stats, but falls short in other areas. She has a versatile range of supportive magic at her disposal and is able to deal Holy magic damage with her <strong>\"Lum\"</strong> artes. She can also inflict status ailments with certain artes such as her <strong>\"Still of Night\"</strong> arte and then deal major damage against enemies with stacked ailments with her <strong>\"Assassinate\"</strong> arte. She can also steal items from enemies. Doing this against certain enemies may have other effects too.<br/></p>\n\n\n<p>One of the five who were spirited away to the world of Palasiel, Keon is a suave and cunning individual and fancies himself a hit with the ladies. Despite being in Palasiel for a considerable amount of time, he actually enjoys being there and hasn't thought about going back.</p>\n<p>Keon's role in battle is somewhere between a support character and a technical attacker. He's got the right tools for specific jobs, and can buff the party with many boons with his <strong>\"Bulletcraft\"</strong> artes. He's also able to use his hunting skills to deal major damage to certain enemy types with his <strong>\"Golden Bullet\"</strong> artes!<br/></p>\n\n<p>One of the five who were spirited away to the world of Palasiel, Sanya has a lot of experience in this world, having been there the longest. A charming individual, often calm and composed. She's spent a lot of time in the wild honing her survival skills and is currently in prison for murder.</p>\n<p>Sanya's playstyle revolves around heavy hitting \"Berserker-class\" artes as well as being able to learn enemy artes to use as her own!<br/></p>\n\n<p>One of the five who were spirited away to the world of Palasiel, Opal Beryl is a young girl blessed with the gift of magic and intelligence, even if she doesn't always act like it. She is a very upbeat and energetic girl who has proficiency in alchemy! Opal has travelled back in time from a future where everything went to chaos.</p>\n<p>Opal is an<strong> \"Alchemage\"</strong> which is a hybrid class of an<strong> \"Alchemist\"</strong> and a <strong>\"Black Mage\"</strong>. Her role is the dedicated magic DPS, and can access higher tiers of elemental magic by using her <strong>\"Augment\"</strong> arte. She can also user her alchemy skills to create supportive or offensive items user her <strong>\"Mix\"</strong> arte.<br/></p>\r\nFeatures\r\n<strong>Choice Divert &amp; Path Diverge</strong>\n<p>While Palasiel Quest features a linear story, it can be influenced quite a bit through choices in the game to the point where <em>ideally </em>playthroughs between different players will rarely be the same. This is influenced by two mechanics known as<strong> \"Choice Divert\" </strong>and <strong>\"Path Diverge\"</strong>. At certain points in the game, Daran will be presented with a choice. Whether the choice may seem big or small, the effect these choices may result in can be anything from a small alteration in a scene, to a less/more difficult dungeon to even a character death. In essence, Choice Diverts shape the future. A <strong><em>Path Diverge</em></strong> is a story segment that’s triggered by talking to certain NPCs at which point the party will diverge from the main story route and take a different path in the story, or take a detour. Path Diverges can lead to additional backstory information, bonus scenes and additional Choice Diverts.</p>\n<strong>Guest Party Members</strong>\n<p>Certain characters can join your party as a guest, not necessarily participating in battle in the conventional matter, but there are chances where they will intervene with an attack of their own to help out. So glad to have NPCs around who don't sit around and do nothing!</p>\n<strong>Skit Scenes</strong>\n<p>Inspired by the \"Tales of\" series, Palasiel Quest will feature little skits between party members. Viewing them is important as they themselves can contain important Choice Diverts and sometimes missing a skit scene can influence the story a little! Be sure to view as many as you can!</p>\n<strong>Arte Learning System</strong>\n<p>Artes are not learned in the traditional way via levelling up. In battle, characters (excluding guests) will earn AP (Arte Points) by defeating enemies, using artes and levelling up. These points can be used to learn new abilities in each characters Arte Tree.</p>\n<strong>Voice Acting</strong>\n<p>Palasiel Quest will be voice acted in battle and during important scenes only. The cast involves very impressive talent. Among the cast is Bryson Baugus (<em>Bell in DanMachi, Shoyo Hinata in Haikyuu!</em>), Amber Lee Connors (<em>Vernal in RWBY, Nozomi in Keijo!!!</em>) and Matt Shipman (<em>Kazuya Kujo in Gosick, Ant Black in New Game!</em>) who play Daran Logan, Ariel Nino and Tydas Lucidus respectively!</p>\n<p>Here are samples of the voice acting! 1 2 3</p>", "metacritic": null, "released": "2017-12-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b4a/b4a7c194b2bc6207004a99ce71231671.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 443, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jeremiah George"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}