{"id": 919496, "slug": "elas", "name": "ELAS", "name_original": "ELAS", "description": "<p>ELAS was a video game project by Rebunny Studio approved and financed in the UNIDAS: Women in the Creative Industries 2021 program, organized by two units of the Goethe-Institut, in Salvador and Chile, sponsored by the German Ministry of Foreign Affairs.<br/></p>\n<p>The UNIDAS: Women in the Creative Industries program was designed by women engaged in strengthening and supporting professionals working in the creative industries. Mentorships, public events and, at the end of the program, an exchange program between Brazilian and Chilean women with a trip to Santiago de Chile were planned.<br/></p>\n<p>------------------</p>\n<p><em>[Versão português do Brasil]</em></p>\r\nDescrição\r\n<p>Marielle e Daniela vão se casar e, durante o casamento, descobrem que a humanidade está sendo atacada por uma ameaça alienígena. Fica claro quando o juiz de paz responsável pelo casamento decide dificultar a união agindo de forma estranha. O juiz é parasitado e depois se transforma em uma forma horrenda, um monstro alienígena. Ele sequestra Daniela e a leva para um lugar desconhecido. A missão de Marielle, que é uma pessoa de energia muito positiva, é salvar seu amor e as pessoas que foram parasitadas pela onda alienígena!<br/></p>\r\nSobre o projeto\r\n<p>ELAS foi um projeto de video game da Rebunny Studio aprovado e financiado no programa UNIDAS: Mulheres nas Indústrias Criativas 2021, organizado por duas unidades do Goethe-Institut, em Salvador e no Chile, com patrocínio do Ministério Alemão das Relações Exteriores.\r\n</p>\n<p>A programação da UNIDAS: Mulheres nas Indústrias Criativas foi pensada por mulheres engajadas no fortalecimento e apoio das profissionais que atuam nas indústrias criativas. Foram planejados mentorias, eventos públicos e, no final do programa, um intercâmbio entre brasileiras e chilenas com viagem para Santiago do Chile.\r\n</p>\n\n<p><strong>TEAM</strong></p>\r\nManagementBeatriz Ramos; Flávia FigueredoGame DesignLilian MirandaStorytellingFlávia FigueredoLevel designWinston JohnProgrammingFred Adler; Clara CerqueiraDesignBeatriz RamosArt and Animation 2DRafael RochaSoundtrackRebeca GallinariSFXSteven MartinezConsultantHariel Abdala", "metacritic": null, "released": "2023-01-30", "tba": false, "updated": "2023-02-03T18:32:44", "background_image": "https://media.rawg.io/media/screenshots/1b1/1b1b2cff69f8f9b6fec2510b0e0c6239.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["beatrizuxui"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}