{"id": 919449, "slug": "paranormal-pastures", "name": "Paranormal Pastures", "name_original": "Paranormal Pastures", "description": "<p><strong>Paranormal Pastures</strong> is a new take on Play-To-Earn, where items are attainable ONLY through high-level play, creating <em>real scarcity. </em> Our opinion on the state of crypto gaming is that players are being offered just different skinned versions of the same mechanic; play a regular game with RNG loot, and spend crypto to unlock more and better loot as time goes on. Players have, on the whole, rejected this mechanic. So why is our take different? Exclusive content is gated behind difficult runs, (e.g. \"Unlock the Jester's Hat by making it to Day 50 using ONLY the Pea-Shooter\"). When we release content, it will <strong>all</strong> be embedded and unlock-able through difficult gameplay, giving high-skill players the opportunity to earn by retrieving the collectibles, levels, etc. and offering them back to the game's community through our marketplace.<br/></p>\n<p>We hope that this system of player-led content releases leads the charge of a new type of Play-To-Earn game; one not based on artificial scarcity, but on actual skill and dedication to the game's community. </p>\n<p>This game was made as part of the MetaFab 2D Shoot-out Jam, and is a 2.5D isometric shooter.  Learn more about MetaFab at https://www.trymetafab.com</p>\n<p><strong>*NOTE*</strong>: This prototype is running on the MUMBAI testnet. The client is unsecured and will not be released with main net transactions until a secured backend and player authentication system is in place. A player wallet will be created for you when you create an account in the game. Do not use this address for any transactions other than testing this game. </p>", "metacritic": null, "released": "2023-01-30", "tba": false, "updated": "2023-02-03T18:11:26", "background_image": "https://media.rawg.io/media/screenshots/4a6/4a69e569145a06c797e149967780cb32.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KennyRoy"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}