{"id": 919511, "slug": "get-up-mario", "name": "Get Up Mario!", "name_original": "Get Up Mario!", "description": "<p>Mario takes on a brand new adventure, but he appears to have trouble even standing up! Help Mario get through his treacherous new problem and reach and defeat Bowser!<br/><br/></p>\n<p>This project took me about a week to make, and originally started as a joke between friends. As a kid, I always experimented and loved soft-body and physics engines on my small Windows Vista computer. Now, I put that love into a game I call \"Get Up Mario!\", which most of you will be screaming as you play it. This game is in an EXTREME beta, so please leave any comments or concerns you come across.</p>\n<p><strong>Changelog 1.1</strong><br/></p>\n<p>New additions!\r\n</p>\n<ul><li>Changed 1-4 drastically<ul><li>Made the 5th star coin harder to get\r\n</li><li>Bowser has a funny animation when dying now!\r\n</li><li>Bowser is always seen dying\r\n</li><li>Added a segment between Bowser's room and the entrance that includes some nasty tricks &gt;:)\r\n</li><li>Slightly altered the decorations and added some new ones (obviously)\r\n</li><li>For some reason, I forgot to remove the playtesting power ups for 1-4. That isn't there anymore\r\n</li></ul>\n</li><li>The 1-1 \"cloud area\" incorporates 1-3's big cloud blocks\r\n</li><li>The current version number is now displayed in the top-left corner of the menu\r\n</li><li>1-3 is notoriously hard, so there are pipes that (if you are lucky enough) catch you if you fall, which take you to start of the level (better than dying!)\r\n</li></ul>\n<p>Bug fixes!\r\n</p>\n<ul><li>Bowser will now correctly throw hammers (Before this, there a was move where Bowser would do a mini jump)\r\n</li><li>Fixed a bug that restricted small Mario to enter the 1-4 castle without positioning himself in a strange way\r\n</li><li>Fixed a major bug that caused the death screen to not return the player to the level they were playing, making the game unplayable\r\n</li><li>Upon restarting a level, star coins will now correctly delete X amount of star coins collected (Before this, you could go over the star coin limit)\r\n</li><li>Fire embers no longer collide with anything. This also solves the \"Flight Glitch\"\r\n</li></ul>", "metacritic": null, "released": "2023-01-30", "tba": false, "updated": "2023-02-03T18:38:17", "background_image": "https://media.rawg.io/media/screenshots/b9b/b9ba9365aa0ae1e3f58b72a01ef100c2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Majimellow"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}