{"id": 919519, "slug": "quest-for-the-egg", "name": "Quest For The Egg", "name_original": "Quest For The Egg", "description": "<p><strong>Story</strong><br/>In a distant kingdom there lived a little knight who was tired of eating cabbages. Every day he went to the market and all there was was cabbages, cabbages and more cabbages. Until one day he learned through a conversation between some adventurers that a dragon that lived in a nearby cave guarded an egg. The knight ended up having the idea of going to that cave, stealing the dragon's egg to cock and eat it. And so this knight goes on his adventure to prepare his big meal.</p>\n\n\n\n<p><strong>Gameplay</strong><br/></p>\n<p>In this game you'll control the little knight through a series of platforming levels filed with enemies, coins and precious gems. At the end of each level you'll find the a cave with the sleeping dragon. When you snatch it's egg you have to run back to the start of the level.</p>\n\n\n<p><strong>Mechanics</strong></p>\n<p>You will run and jump through the levels, dodge enemies and collect godies until you can reach the egg and steal it. BUT BE CAREFUL! Once you steal the egg a time will start telling how long you have to return to the start of the level and leave before the dragon wakes up and.... well you don't to know. Also when you snatch the egg more enemies will show up to stop you in your tracks. Can you come back safely?<br/></p>\n<p>Dealing with Enemies<br/></p>\n<p>On your way out you grabbed a sword to protect yourself but you failed to realized that, well, you aren't very skilled with a sword. Luckily for you most enemies look pretty frail and squishy so a big stomp on top of them with your heavy armor should do the trick nicely.</p>\n\n\n<p><strong>Controls</strong><br/></p>\n<ul><li>Move- A &amp; D</li><li>Jump- Space Bar</li><li>Pause- P</li></ul>\n\n\n<p><strong>Credits</strong></p>\n<ul><li>Main Dev/ Coder/ Page designer- Rodrigo Siquenique</li><li>Support Dev/ Level designer- Lucas Fernandes</li><li>Artist/ Art director- Daniel Ricard</li><li> Forest - Low Poly Toon Battle Arena / Tower Defense Pack Asset creator-AurynSky</li></ul>", "metacritic": null, "released": "2023-01-30", "tba": false, "updated": "2023-02-03T18:41:38", "background_image": "https://media.rawg.io/media/screenshots/f10/f10945b7766e7db4e33811e25907da19.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rodrigo Siquenique"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}