{"id": 91961, "slug": "alien-makeout-simulator", "name": "Alien Makeout Simulator", "name_original": "Alien Makeout Simulator", "description": "<p>PLEASE SEE OUR NEW PAGE:</p><p>https://alienmakeout.itch.io/alien-makeout-simulat...<br/></p><p>This roomscale VR experience lets you make out with a 10-mouthed alien in an intergalactic tavern, plain and simple :)</p><p>Make out with as many glowing lips as you can before time runs out! Some require tenderness while others require rapid pecks. Will your passion be enough to impress?</p><p>Initially created in 48 hours for the Boston VR Jam using experimental VR hardware from Valve, which would eventually lead to the amazing HTC Vive. It was later presented at the Boston Festival of Indie Games in 2014, taking the award for Best Single Player Game. We're now releasing a port for modern VR headsets like the HTC Vive and Oculus Rift.</p><p>The latest version has improved music, fx, and a few new \"mechanics\". We're also bringing you the choice of two alien partners to appeal to your personal taste in, uh, aliens. No judgements if you sample both of them, in fact, we recommend it!</p>Requirements<br/><p>Any SteamVR compatible VR headset like the HTC Vive or Oculus Rift</p><p>Around 1.5m x 1.5m of standing space</p><p>Meet the minimum system requirements for your headset</p><p>A copy of Steam with SteamVR installed</p>Credits<p>Mike Mandel<br/>Devon Newsom<br/>Dawn Rivers<br/>Ben Taylor<br/>Shawn Witt</p>", "metacritic": null, "released": "2014-06-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9c5/9c54cbf135e9f330d21a8c61b53fb89b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Alien Makeout Simulator"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}