{"id": 919731, "slug": "variant-22", "name": "Variant 22", "name_original": "Variant 22", "description": "Variant 22 is a extraction based zombie survival shooter. <br/><br/><strong>Loot, Shoot, Extract, Base Build, Craft, Upgrade.</strong><br/><br/>A new variant of the virus has spread. All residence of the New American Republic are required to self report to designated quarantine camps. All lifeforms in non contained areas are considered infected and hostile. As the NAR continues it's suppression efforts with airborne chemical agents and ground patrols, safe areas are in short supply and survival is threatened.<h3>Loot Run</h3><ul><li>Enter a contaminated zone using the Eastern Railway. <br/></li><li>Search the area for useful gear and resources while navigating uncontained infected and NAR patrols. <br/></li><li>Find the exit ramp and use the highway to return to the safe zone, extracting the gathered loot. </li></ul><h3>Safe Zones</h3>Safe zones are free of airborne chemical agents and provide an area for base building. Without active suppression, the infected form reoccurring waves and must be defended against to sustain survival<br/><ul><li>Base Building<br/></li><li>Crafting<br/></li><li>Weapon Upgrades</li></ul><h3>Weapons</h3><ul><li>Shooting centered core<br/></li><li>Gun performance attributes<br/></li><li>Interchangeable attachments<br/></li><li>Detailed ammunition types<br/></li><li>Weapon maintenance</li></ul><h3>Contaminated Zones</h3>Each procedural generated run has its own level of contamination and a differing level of patrol presence.<br/><br/>Time in loot run areas are limited by contamination levels. Gas masks and blocker pills help extend exposure.<br/><br/>Armed Patrol Agents are equipped with varying levels of gear and have orders to shoot on sight.<br/><br/>Special points of interest are scattered around the map providing working crafting stations for different kind of upgrades.<h3>Survival Elements</h3><ul><li>Food &amp; Drink<br/></li><li>Health<br/></li><li>Contamination exposure<br/></li><li>Temperature</li></ul><h3>End Game</h3>Gear up for a final push westward out of NAR reach towards freedom.", "metacritic": null, "released": "2023-02-03", "tba": false, "updated": "2023-02-06T04:39:17", "background_image": "https://media.rawg.io/media/screenshots/ea3/ea3dc52540172d178c5cf86292143f8c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dimitri Andru"], "genres": ["Action", "Indie"], "publishers": ["Dimitri Andru"], "esrb_rating": null}