{"id": 91973, "slug": "try-hard-parking-demo", "name": "Try Hard Parking DEMO", "name_original": "Try Hard Parking DEMO", "description": "<p>Available now on STEAM : http://store.steampowered.com/app/575400/<br/></p>\n<p>\n</p>\n<p>\"Welcome to the Hardest Parking Game in The World\" <br/>- Muahaha, no seriously.<br/></p>\n<p>\r\n\tTempt fate &amp; physics as you navigate obstacle courses in pursuit of parking in Try Hard Parking!\r\n</p>\n<p>\r\n\tPut your driving skills to the test in this retro styled game as you jump,drop and carefully steer across levels full of obstacle to reach your holy parking lot. Easy to get stuck (hit Enter to Quick Retry). Do a good time and low number of tries. Good luck.</p>\n<p>\r\n\tThanks to all the YouTubers who made a video. It really helps me out to develop the game further using live feedback. Please view, sub and support them, they hold together the Indie Community.<br/>\n</p>\n<p>Review 1: http://www.futurebetagamer.com/try-hard-parking-al...<br/>Review 2: http://www.alphabetagamer.com/try-hard-parking-alp...<br/></p>\n<p>\n</p>\n<p>\n</p>\n<p>\n<br/>\r\n\tWhen the vehicle comes to rest after applying Brake, tap Brake again for Reverse. The latest version has Joystick Button B (xbox 360) as Handbrake.\r\n</p>\n<p>\n</p>\n<p>\r\n\t...........................................................<br/>\r\n\tDon't lose you zen, the more frustrated you are, the worst it gets,<br/>\r\n\tkeep your shit together maaaan.<br/>\r\n\t...........................................................<br/>\r\n\tBe this guy:<br/>\r\n\tDon't be this guy:<br/>\n</p>\n<p>\r\n\tRemember all your training (GTA 5, SA, Forza Horizon, Driver.... all of them leads here, try and you shall realize the truth)\r\n</p>\n<ul>\n<li>Hit ENTER to quick reset if your vehicle is stuck(which will be a lot of times). It resets the timer too , so use it.</li>\n<li>Use pulses of Acceleration: Don't Go full throttle , use short bursts of speed.</li>\n<li>Use Handbrake turns: Use brakes and handbrakes, rear wheel slides to get the car in to position.</li>\n<li>Keep wheels in contact : Try to be keep your wheels in contact for traction.</li>\n<li>Don't get stuck : The car gets stuck easily, so it requires a bit of precision to drive. Keyboard is adviced, atleast for me or experienced person with controller, Xbox 360 controller tested and pre-configured.</li>\n</ul>\n<p>\r\n\tGameplay Playlist:</p>\n\n<p>\r\n\tNote: There is no time limit or number of tries and the game won't tell you when the car is stuck, sometimes its not, rest is upto your decision [You can hit ENTER for quick retry] . Also some levels may need a few seconds to load depending on hardware. You can play all 4 levels independently from the LEVELS menu.\r\n</p>\n<p>\n</p>\n<p>\r\n\tThis game is all about being retro and using your controls to get your car to the parking spot but it may not be that easy as the levels are designed to throw you off.\r\n</p>\n<p>\r\n\tI asked a friend \"What is game development?\" He said, the line between frustration and fun. Well, with this game, I have achieved FRUSTRATION bit for sure.\r\n</p>\n<strong>Facebook Page : https://www.facebook.com/tryhardparking/<br/>\r\nFor this Alpha (0.4g): There are 4 levels of game with increased difficulty.</strong>\n<p>\r\n\tSoundtrack by <strong>Evan King</strong> Youtube<br/>\n<strong>https://evanking.bandcamp.com/</strong>\n</p>\n<p>\r\n\tTracks:\r\n</p>\n<ol>\n<li>Tundra.exe</li>\n<li>Thermal</li>\n<li>Cerulean</li>\n</ol>\n<ol>\n<li>--- For YouTubers , who may require the logo ---<br/>\n</li>\n</ol>\n<p>\n</p>\n<ul>\n<li>The full version will contain atleast 10 levels.</li>\n<li>Will be very cheap, may be a dollar or two.</li>\n<li>Puzzles to solve to get to the end in some levels using your car and precision work.</li>\n<li>Leaderboard - HighScore - Achievements.</li>\n<li>If the all goes well, may be even a few splitscreen level where two players fight to the final parking spot (much like in real life lol)</li>\n<li>More and better soundtracks.</li>\n</ul>\n<p>\n</p>\n<p>\r\n\tI have tested the game on my 7 year old Asus X83 - VBX2 which has a 9300m gs and Intel Centrino Duo on Linux Mint 17.1. The game runs OK at Fastest settings and 1024x768.\r\n</p>\n<p>\r\n\tLowest :<br/>\r\n\tGraphics card with 128bit Memory Interface.<br/>\r\n\t(Slightly above low end, such as Geforce GT220) and Dual Core Processor. 2 GB RAM . I have tested the game on Intel GMA x3100 and x3600, works fine.\r\n</p>\n<p>\r\n\tRecommended:<br/>\r\n\tCore i3 or equivalent and Any Midrange graphics card such as GTX 770/760 &amp; 4 GB RAM.\r\n</p>\n<p>\n</p>\n<p>\r\n\tThe best kind of helping out would be to provide helpful tips on improving the game. Suggest puzzles, levels , I will try to incorporate as much as I can.\r\n</p>", "metacritic": null, "released": "2016-11-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/025/025c94a5c990577c92be64275f4c1b4f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Sayem Chaklader"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}