{"id": 919745, "slug": "underbackrooms", "name": "UnderBackrooms", "name_original": "UnderBackrooms", "description": "UnderBackrooms is an independent horror game that plunges you into the mysterious backrooms, a parallel universe filled with empty rooms and endless corridors. In this unsettling world, you must join forces with your friends to confront terrifying creatures and solve the puzzles that will allow you to escape.<br/><br/>The game is playable in cooperation, which allows you to work as a team with your friends to overcome the challenges that await you. There are constant moments of suspense and tension, so it's imperative that you remain vigilant. You will have to explore the backrooms and discover their secrets to understand how to escape from this nightmare world. Prepare to face your deepest fears in UnderBackrooms.<h3>Levels</h3>There are currently 3 levels in the game, each with its own mechanics and increasing difficulty as you progress through the floors.<br/><br/><br/><h3>Multiplayer</h3><br/>- Players can choose to play alone or with up to 4 players.<br/>- Players can either host a game or join one.<br/>- At least one player must find the exit in order to progress to the next floor.<br/>- If a player dies, they will respawn after 60 seconds.<br/>- If all players die, the game must be restarted.<h3>Entities</h3>In this game, we have 5 entities which are not always faithful to the Backrooms creepypasta, but which have been designed to enhance the atmosphere of the game.<br/><br/><br/><h3>Procedural generation</h3>Our game has been designed to be as replayable as possible. The themes of the floors remain the same, but the mazes generated will never be the same. This ensures that each time you play, the experience will be unique and unpredictable.<h3>Items</h3><br/>- Lightstick: used to provide light and can also be placed on the ground to create landmarks.<br/>- Scanner: when pointed at an entity, it will emit a noise.<br/><br/>", "metacritic": null, "released": "2023-02-03", "tba": false, "updated": "2023-02-06T05:01:09", "background_image": "https://media.rawg.io/media/screenshots/fc7/fc75e2432c0e6b95645931a9eb55c690.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["okeyplaystudio"], "genres": ["Adventure", "Indie"], "publishers": ["okeyplaystudio"], "esrb_rating": null}