{"id": 919730, "slug": "project-utgardr", "name": "Project Utgardr", "name_original": "Project Utgardr", "description": "A young woman, Thyra, lives in a village near ancient mountains in the Scandinavia of the II century A.D. One day she will find a vertical crack on a facade of a mount never seen before. Curious about, she will slip into it and shortly after, behind her, the passage will collapse...<br/><br/>An ancient road, through rocks and uncontaminated nature, could lead to an exit from these impervious and harsh mountains... or even somewhere else?<br/><br/>Mystery, adventure and parkour will be just a taste, in addition to the numerous Norse altars, that hide an archaic secret concerning a tale that lies forgotten in the myth and legend of peoples.<br/><br/><br/><br/><strong>Features:</strong><h3>Adventure and exploration</h3>In search of an escape from the mountains, you will have to explore various types of zones in order to proceed. Overcoming rocks or other natural obstacles and paying attention to any particular marks left on the way.<h3>Parkour and platforming</h3>Thyra will use her parkour skills to avoid or overcome various obstacles such as lopsided rocks, fallen trees, pillars suspended in the void. She could move by crouching, walking and running, climbing, wall running, climbing and lateral climbing only on certain type of surfaces.<h3>Norse and Viking mythology</h3>Based completely on it, the Norse mythology will be applied in various aspects of the game. From the dialogues, to the runes engraved in stone, to the interaction with \"typical\" objects of this culture.<h3>Puzzles</h3>The puzzles will activate natural events that will allow an escape route or the continuation of the main path. The puzzles refer to elements of the Norse and Viking mythology, namely mainly altars and Menhirs.<h3>Mystery</h3>Mystery is a \"permeating\" part of the adventure and there will not be too much guidance. A lot of space will be left to the inventiveness of the human being, who will find his expressions.<br/><br/><br/>", "metacritic": null, "released": "2023-02-03", "tba": false, "updated": "2023-02-06T04:37:42", "background_image": "https://media.rawg.io/media/screenshots/d59/d59e9b99ea2773f3a365d398574d6ac9.jpg", "website": "https://bio.link/projectutgardr", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["TronusGames"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["TronusGames"], "esrb_rating": null}