{"id": 919895, "slug": "mushroom-maestro", "name": "Mushroom Maestro", "name_original": "Mushroom Maestro", "description": "<p><strong><em>Originally created for Global Game Jam 2023.</em></strong></p>\n<p><strong>How to play:</strong></p>\n<p>Use arrow keys.<br/>Up and Down: moves between mushroom selection (top), camera panning (middle), and soil location (bottom); pressing Down again while already along the bottom will pick fully grown mushroom(s) or will otherwise plant the currently highlighted mushroom into that empty soil space.<br/>Left and Right: cycles mushroom selection, pans the camera, and cycles soil location selection.<br/></p>\n<p><strong>Team Credits:</strong>\n</p>\n<p>Pixel Art by Olivia Toiber.<br/>Music by Corrin Coffey.<br/>SFX by Gray Samuelson.<br/>Programming by Roh (aka Pete Vellucci Jr).</p>\n<p><strong>Notes from the jam team:</strong><br/></p>\n<p>We intend on developing this game a bit further than we had time for during the window for Global Game Jam 2023. At the outset we brainstormed the idea of a mushroom management game where the mushrooms would communicate back to the player their own desires for where to next plant them -- which other mushroom type to next be planted near and which type to next avoid being near. You can see the beginnings of implementing this communication in the current build, however, the mechanic needs to be more finely tuned and also currently has no gameplay relevance. Ideally, upon further development, this game will feel quite a bit more arcade-like to play, as the player is meant to be consistently rotating around the garden, planting new mushrooms based on their respective desires, and picking fully grown mushrooms before they begin to decay (which is also not currently implemented). For now, you may consider this just a cute, casual experience for planting some adorable lil' mushroom pals!</p>", "metacritic": null, "released": "2023-02-06", "tba": false, "updated": "2023-02-06T06:27:21", "background_image": "https://media.rawg.io/media/screenshots/d90/d90ad237f0981a8293afcc0269ab7947.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Rohifi", "weezwuzhere", "Corrin Coffey", "GraySFX"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}