{"id": 919819, "slug": "chainsaw-beat", "name": "CHAINSAW BEAT", "name_original": "CHAINSAW BEAT", "description": "<p><strong>Chainsaw Beat</strong> is a rhythm game, the object of the game is to cut the roots in time with the music at the right time, the gameplay is played on two levels high and low.</p>\n<p>only playable with a controller </p>\n<p>control: Y for up and down-pad for down</p>\n\n<p>FR:</p>\n<p>Max, un homme connu pour son amour de la musique électro et son style de performance unique, était le seul à pouvoir sauver le monde des racines maléfiques. Des racines qui menaçaient de détruire tout ce qui entourait les arbres, en s'étendant sans fin et en aspirant toute la vie autour d'eux. Max a pris son courage à deux mains et a commencé à découper les racines maléfiques avec sa tronçonneuse. Il a travaillé sans relâche, en utilisant tout son style et sa technique pour venir à bout des racines les plus dures. Il a effectué chaque coup de tronçonneuse avec une précision et une agilité incroyables, en synchronisant parfaitement ses mouvements avec la musique électro qui résonnait dans ses oreilles. Peu à peu, les racines maléfiques ont commencé à reculer, et le monde a été libéré de leur emprise. Les gens ont célébré la victoire de Max, et il est rapidement devenu une légende parmi les habitants du monde de la forêt. Et depuis ce jour, il est connu sous le nom de Electro-Chop, le sauveur du monde de la forêt.</p>\n<p>US:</p>\n<p>Max, a man known for his love of electronic music and unique performance style, was the only one who could save the world from the malicious roots. Roots that threatened to destroy everything around the trees, extending endlessly and sucking all life around them.  Max took his courage in both hands and began cutting down the malicious roots with his chainsaw. He worked tirelessly, using all his style and technique to overcome the hardest roots. He performed each chainsaw stroke with incredible precision and agility, perfectly synchronizing his movements with the electronic music echoing in his ears.  Slowly, the malicious roots began to recede, and the world was freed from their grip. People celebrated Max's victory, and he quickly became a legend among the inhabitants of the forest world. And since that day, he is known as Electro-Chop, the savior of the forest world.</p>\n\n<p>Programing: Dorian Sanjivy</p>\n<p>Art: Abel Graux</p>\n<p>Music: Gaston Roger</p>", "metacritic": null, "released": "2023-02-06", "tba": false, "updated": "2023-02-06T05:53:23", "background_image": "https://media.rawg.io/media/screenshots/a99/a9932c5eb26e6b0e169b04c8212b7c87.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Les Gros Shlags", "DominosXpizza"], "genres": [], "publishers": [], "esrb_rating": null}