{"id": 920057, "slug": "conways-game-of-life-tomyo_", "name": "Conway's Game of life (Tomyo_)", "name_original": "Conway's Game of life (Tomyo_)", "description": "Le jeu de la vie de Jhon Conway est un jeu très simple se jouant sur un grille avec des \"cellules\" morte ou vivante qui sont représentées par des carrés noir (vivante) ou blanche (morte), et ne contenant que deux règles:\r\n- si une \"cellule\" morte est entourée de exactement trois cellule vivante alors elle devient vivante\r\n- si une \"cellule\" vivante est entourée de deux ou trois voisines vivantes alors elle reste en vie, dans le cas contraire elle meurt.\r\n\r\nLe but de ce jeu est de formé des structures afin de créer des \"planeurs\" ou des structures stagnantes. Vous pouvez vous référer au wiki pour vous aidez. Télécharger vous simulation en .gol et partagez les avec les gens intéresser.\r\n(pas beaucoup je pense mais bon)\r\nPlacer des \"cellules\" avec le clique gauche et supprimer les avec le clique droit.\r\nLorsque vous êtes sur pause, vous pouvez vous déplacez dans le temps de la simulations avec les flèches de gauche et de droite et ainsi voir l'évolution dans le temps de la simulation.\r\nCette application à été programmer en moins d'une journée afin de me challenger personnellement sur un concept simple, il n'est donc pas exclus qu'il y ait des buggs... Si vous en trouvez merci de le faire remontez ici afin que je les corriges.\r\n\r\nPour finir merci de vous être intéresser à cette page et d'avoir pris le temps de tout lire. J'espère que cette application vous plairas et que vous passerez de bon moment à créer de petite structure sympathique ! Si vous avez des choses à faire remontez ou des idées de choses à intégrer que ce soit au niveau visuel ou des fonctionnalité je suis ouvert à la discussion.\r\nCe jeu est très simple et gratuit mais vous pouvez toujours faire un don si l'envie vous prend. Cela m'aidera pour mes prochaines application vous pouvez en être certain.", "metacritic": null, "released": "2023-02-05", "tba": false, "updated": "2023-02-06T07:38:19", "background_image": "https://media.rawg.io/media/screenshots/9d1/9d1dc382e99aad65aae5a77003b9da2c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Tomyo_"], "genres": [], "publishers": [], "esrb_rating": null}