{"id": 9201, "slug": "mafia-iii-rivals", "name": "Mafia III: Rivals", "name_original": "Mafia III: Rivals", "description": "Steal, seize, and slaughter for control of New Bordeaux in Mafia III: Rivals, a brand new battle RPG set in the violent and gritty universe of Mafia III. Be the boss and assemble your crime family. Outfit your characters with brutal weapons, items, vehicles, and stake your claim over local businesses. As your power grows, so does your stake in the criminal underworld. Own the city.<br/> <br/>YOU ARE THE SCENE<br/>Scare up the New Bordeaux criminal underground and mobilize it for your own gain. Recruit and level up the skills of 40 crime bosses from the Mafia III universe and make a killing with the most dominant mob family in New Bordeaux.<br/><br/>DECLARE WAR<br/>Face off against waves of rival gangs in brutal RPG-style combat and collect loot in battles throughout New Bordeaux’s colorful Downtown District.<br/><br/>SUITED AND BOOTED<br/>Outfit your crew with guns, knives, body armor, brass knuckles, muscle cars, and more to boost their stats and prepare them for battle.<br/><br/>FIGHT REAL PLAYERS<br/>Battle other players around the world to improve your rep in strategic fights that'll prove who's got the better crime family.<br/><br/>CONTROL THE CITY’S FRONTS<br/>Seize local fronts to further upgrade your crew and get added rewards like earning more cash, more damage, and many other extras.<br/><br/>JOIN YOUR FRIENDS<br/>Add friends to compete for ranking in the online leaderboards and earn special perks.", "metacritic": null, "released": "2016-10-07", "tba": false, "updated": "2019-10-22T14:04:39", "background_image": "https://media.rawg.io/media/screenshots/df6/df6f30c60b97e85204843188b18e7c1a.jpg", "website": "http://www.mafiagame.com/rivals", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["2K"], "genres": ["RPG", "Strategy"], "publishers": ["2K Games"], "esrb_rating": null}