{"id": 92049, "slug": "survival-city", "name": "Survival City", "name_original": "Survival City", "description": "<p>Survival City is a <strong>roguelike strategy-RPG set in a zombie apocalypse</strong>. Players must lead their survivors to safety while managing their survival needs. Each character is unique with their own personality, traits and highly varied appearance. Will your group escape the city, or will they join the countless others who did not...</p>\n<p>Survival City is inspired by roguelike adventures such as Faster than Light, character-focused epics like Crusader Kings 2, and infused with modern board game elements to craft a unique story of survival each time.</p>\n<p><strong>SURVIVORS:</strong></p>\n<p>Survivors will also start off with 2 of <strong>75 different personality traits</strong>. These traits affect gameplay aspects such as weapon proficiency, skill in searching, personal fears and many more! Each survivor also will be assigned 1 of 9 personality types that clash or prefer others. In addition to these unique identities, survivors can also be created from hundreds of facial features and hair styles.</p>\n\n<p><strong>ITEMS:</strong></p>\n<p>Survival City features <strong>hundreds of possible items</strong> that can be either discovered or crafted. Some are essential supplies like, food, water and medicine, while others offer unique bonuses when carried. A wide assortment of melee weapons and firearms are also waiting to be found and put to use on the Afflicted. Each weapon comes in four qualities: Bad, Normal, Rare and Superb. These variations each have different combinations of stats such as increased accuracy, decreased damage, increased critical chance and many more!<br/></p>\n\n<p><strong>UPGRADES:</strong></p>\n<p>Survival City also features a collection of over 60 upgrades to aid the survivors in their journey. Upgrades can be researched over time and are divided between two distinct tech trees: Life and Death. Life upgrades allow safehouses to be improved upon or give the survivors more survivability, while the Death tree focuses on increasing zombie-slaying power!</p>\n\n<p><strong>REPLAYABILITY:</strong></p>\n<p>Each game of Survival City is meant to be a unique story. Not only will the survivors you encounter be one-of-a-kind, but each playthrough will randomly generate a new city map to play through. Random events will also appear which will allow shape the path towards escape or total death.</p>\n<p>Survival City is currently in an early access phase. There are new features that are being added and adjusted each week so by playing it, you can give your opinion on how you think to make the game better. All gameplay elements are currently finished, but for testing purposes the demo only contains the first tier of locations (there are 10 tiers in the full version of the game). Those that also by the game here on itch.io will also receive a Steam key for the game once it's released. So check it out now and see if you can escape <strong>Survival City!</strong></p>\n\n<p>Official Website: https://www.phirezstudios.com/</p>\n<p>Twitter: https://twitter.com/PhirezStudios</p>\n<p>Facebook: https://www.facebook.com/PhirezStudios/</p>\n<p>Discord: https://discord.gg/YeNxtFc</p>", "metacritic": null, "released": "2018-07-26", "tba": false, "updated": "2019-07-01T02:07:33", "background_image": "https://media.rawg.io/media/screenshots/31e/31ef1fede1e498a4480ab750e0e8e25f.jpg", "website": "http://www.facebook.com/SurvivalCityGame/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "iOS"], "developers": ["PlayStack", "PhirezStudios"], "genres": ["Action", "Strategy", "Simulation"], "publishers": ["PlayStack"], "esrb_rating": "Everyone 10+"}