{"id": 920505, "slug": "deertective-a-forest-for-the-trees-mahjong-solitai", "name": "Deertective: A Forest For The Trees (Mahjong Solitaire) (GGJ23)", "name_original": "Deertective: A Forest For The Trees (Mahjong Solitaire) (GGJ23)", "description": "<p>Deertective: A Forest for the Trees is a unique mahjong solitaire game that brings a fresh twist to the classic tile-matching genre. Immerse yourself in a lush forest setting as you match tiles to clear the board. Control the game with ease using just your mouse, and enjoy the soothing soundtrack or turn it off with a simple button press. This game is perfect for both casual players and mahjong solitaire enthusiasts. Join the Deertective on a journey through the forest and see if you have what it takes to solve the mystery.</p>\n<p>----- Human Note ------</p><p>We forced ourselves to make a completely AI-generated game. We started with Detective Deertective, and had a conversations with ChatGPT, and various image synthesis tools, to determine the theme, the style, the mood, mechanics, and more. <br/></p><p>Sometimes, it was pretty vague, and we had to make corrective decisions. Other times we had to do things like give images transparency. For this, we used tools like Photoshop's content-aware fill. Truly, wherever possible, we did no direct creative work. We used what we got, or made what it told us to make.<br/></p><p>The code was written by humans. We tried to have ChatGPT write some scripts, and also tried having it write shaders. At best, it failed completely, and at worst, it caused Unity to crash completely.<br/></p>\n<p>Every single \"thing\" in this game was AI generated. From the title, to all of art, every icon, every sound effect, all of the music, all of the dialogue, all of the voice acting, every single asset in the game was created with AI generation tools, such as Dall-E. A large number of different AI tools were used to create the game. In many cases output from one AI was used as input prompts for another. Of course, above description was also created with ChatGPT. <br/></p>\n<p>Made for Global Game Jam 2023.<br/></p>", "metacritic": null, "released": "2023-02-05", "tba": false, "updated": "2023-02-06T14:03:50", "background_image": "https://media.rawg.io/media/screenshots/efc/efce603649bde2a5d75873699b0b32d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Hunter Dyar"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}