{"id": 9210, "slug": "advenchewers", "name": "AdvenChewers", "name_original": "AdvenChewers", "description": "Harness the mighty power of bubble gum in a high-flying adventure from Warner Bros.!<br/><br/>When the world is faced with its darkest moment, there’s only one thing to do…CHEW.  Become an AdvenChewer and soar to your father’s rescue before he’s forced to serve an evil General.  Using special bubble gum and friendly birds, fly through treacherous landscapes of cascading ice caverns, boiling volcanoes, and more.<br/><br/>Float your way to the top of the leaderboards and crush your Facebook friends’ high scores as you pop the General’s plans and save your family.   <br/><br/>Game Features:<br/><br/>TAP TO TOWERING HEIGHTS<br/>Run, jump, and fly through 48 levels in 6 unique worlds.  <br/><br/>CHEW ON THIS<br/>Zap enemies with electric gum, catch a breeze by blowing windy bubbles, and chew on soap gum to clean up a goo-soaked world – there’s a different gum for every obstacle.<br/><br/>FIND FEATHERED FRIENDS<br/>Collect 3 birds in every level to boost your score then hop on a blazing Phoenix at furious speeds!<br/><br/>BURST THEIR BUBBLES<br/>Beat your Facebook friends’ highest scores and save the world before they do!<br/><br/>DON’T BLOW IT<br/>Visit the store and fashion your AdvenChewer with upgraded helmets, jackets, and a bird compass to locate your avian allies!", "metacritic": null, "released": "2013-10-10", "tba": false, "updated": "2019-10-22T14:30:20", "background_image": "https://media.rawg.io/media/screenshots/9dc/9dc37afef41e423fd665d50d2ad0a380.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Warner Bros. Interactive"], "genres": ["Action", "Adventure"], "publishers": ["Warner Bros. Interactive"], "esrb_rating": "Everyone 10+"}