{"id": 92110, "slug": "micro-hexagon", "name": "Micro Hexagon", "name_original": "Micro Hexagon", "description": "<p>\n<strong>MICRO HEXAGON</strong> is a minimal action game by Paul Koller, with music by Mikkel Hastrup. This Commodore 64 reinterpretation of the original SUPER HEXAGON was released on the 1st December 2013 as an entry in the RGCD C64 16KB Cartridge Game Competition (2013), in which it achieved 2nd place.\r\n</p><p>\r\n\tSUPER HEXAGON is an independent video game based on an earlier game by Terry Cavanagh, \r\n\tHEXAGON, which was created for a twelve hour game jam in early 2012. Originally released for iOS in September 2012, versions of SUPER HEXAGON for Windows and OS X were released 3 months later on Steam, an Android version was released in January 2013 and BlackBerry and Linux versions followed in February 2013.\r\n</p><p>\n<strong>Warning!<br/>\n<br/>\n</strong>This video game features extensive use of stroboscopic effects and should not be played by individuals who are sensitive to intense flashing lights. If you experience dizziness, blurred vision, eye or muscle twitches, loss of consciousness, disorientation, any involuntary movement or convulsion whilst playing <strong>MICRO HEXAGON</strong>, discontinue use IMMEDIATELY and consult your doctor.\r\n</p><p>\n<strong>Playing MICRO HEXAGON <strong>on a Commodore 64 or PC</strong></strong>\n</p><p>\r\n\tThe digital version available here is primarily for use with emulators, but can also be run on a real C64 via hardware such as the \r\n\t1541 Ultimate II. For emulator users, we recommend VICE, as it works on a variety of operating systems and is very user friendly. In fact, we've even included a pre-configured 32-Bit Windows copy with the download together with some simple user instructions (we're nice like that).\r\n</p><p>\n<strong>Did you know?</strong>\n</p><p>\r\n\tA run of 100 limited edition \r\n\t<strong>MICRO HEXAGON</strong> cartridges were made available as high level rewards in Sam Dyer's successful Commodore 64: A Visual Commpendium Kickstarter. Available in four different colours, with 50 being signed by Paul and Mikkel, these Kickstarter cartridges proved to be hugely popular and sold out in less than a week.</p><p>\r\nIf you missed out on the Kickstarter, copies of Sam's excellent book are available to buy here.</p><p>\n<strong>The digital download of MICRO HEXAGON is available for FREE</strong>, but if you can afford to support us by throwing us some digital loose change then we'll be incredibly grateful. &lt;3\r\n</p>", "metacritic": null, "released": "2015-04-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3c1/3c17d61e956e50d4c1d46527e0c3496d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RGCD.DEV"], "genres": ["Action"], "publishers": [], "esrb_rating": null}