{"id": 92132, "slug": "heavy-steel", "name": "Heavy Steel", "name_original": "Heavy Steel", "description": "<p>500 years after the Earth became a hostile, radioactive wasteland, one bastion of human hope still stands – Bethesda City. The Heavy Steel League was created as a way for people to earn their place in the city, or die trying.\r\n  </p>\n<p>\n</p>\n<p>\n</p>\r\nINTENSE MECH BATTLES\r\n<p>Heavy Steel puts you in control of some of the best mechs in the world. Enter the arena and engage in epic 16 mech team battles. Shoot, run and dodge your way to victory and win by any means necessary to gain your freedom!\r\n  </p>\n<p>\n</p>\n<p>Use the environment to your advantage and collect power ups to help assault your enemies and defeat the other mech warriors. Find health, weapon and shield power ups that boost your stats and help you gain an advantage in the battle arena.  \r\n  </p>\n<p>\n</p>\n<p>\n</p>\r\nMEET THE MECH WARRIORS\r\n<p>Choose from 6 powerful mechs to fight with in the combat arena. Each one has their own unique stats – play with them all to discover which mech suits your strategy and style. \r\n  </p>\n<p>\n</p>\n<p>• Black steel – A balanced combat mech, perfect for beginners\r\n  </p>\n<p>• TS3000 – Advanced engines give the TS3000 superior speed at the sacrifice of weapon damage\r\n  </p>\n<p>• Crimson Shark – Very fast movement and rapid attack speed, but low damage and vulnerable to damage\r\n  </p>\n<p>• Biskopen – High health yet slow moving, Biskopen’s guns fire fast but deal less damage \r\n  </p>\n<p>• Braum – Absorb damage with very high health, at the cost of damage and movement speed\r\n  </p>\n<p>• Lazarus – Widely considered one of the most lethal mechs available, Lazarus has high health and damage speed. Slow to attack and move, try and avoid the guns!  \r\n  </p>\n<p>\n</p>\r\nPVP AND OFFLINE BATTLES\r\n<p>Battle other mech warriors from around the world in intense PvP battles and become the most skilled combat mech in the world! No internet connection? No problem – you can play Heavy Steel offline and fight against advanced AI controlled mechs.\r\n  </p>\n<p>\n</p>\n<p>---------------------------------------------\r\n  </p>\r\nHEAVY STEEL – HIGHLIGHTS\r\n<p>---------------------------------------------\r\n  </p>\n<p>• Up to 16 mechs in each battle\r\n  </p>\n<p>• Team deathmatch – up to 4 mechs on each team\r\n  </p>\n<p>• Play as 6 powerful mech warriors each with their own unique stats and styles\r\n  </p>\n<p>• Two arenas to battle in – Barren Wasteland and the Abandoned Spaceship\r\n  </p>\n<p>• Set up your own games &amp; customize the win conditions\r\n  </p>\n<p>• Collect powerful boosters to gain a combat advantage\r\n  </p>\n<p>• Play PvP against other mechs around the world\r\n  </p>\n<p>• Fight against advanced AI controlled mechs offline\r\n  </p>\n<p>• Easy to understand combat mechanics \r\n  </p>\n<p>\n</p>\n<p>=====================================================================\r\n  </p>\r\nINTENSE MECH BATTLES IN EPIC ARENAS – DOWNLOAD HEAVY STEEL TODAY! \r\n<p>=====================================================================\r\n</p>", "metacritic": null, "released": "2017-05-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b6b/b6b382562f628acae2f1922064cad624.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Pixel Knights"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}