{"id": 921489, "slug": "gravity-reverse", "name": "Gravity Reverse", "name_original": "Gravity Reverse", "description": "<p>\"Reverse Gravity\" is a fast-paced, action-packed adventure game where you must navigate through challenging levels to collect flags and unlock doors to progress to the next stage. The twist in this game is your ability to reverse gravity, adding an extra layer of excitement and difficulty to the gameplay.\r\n  </p>\n<p>As you explore each level, you'll encounter a variety of obstacles and puzzles that will test your skills and reflexes. You'll need to use your wits and agility to dodge traps and collect the flag at  each stage.\r\n  </p>\n<p>But watch out, you might need to reverse gravity to reach certain flags and overcome obstacles. With this added feature, you'll need to be quick on your feet and think outside the box to collect the flags and reach the door to the next level.\r\n  </p>\n<p>With a range of challenging levels, a variety of obstacles and the ability to reverse gravity, \"Reverse Gravity\" is sure to provide minutes of excitement and entertainment for players of all skill levels. So get ready for an epic quest in a world where up is down and down is up!<br/></p><p>Credits: <br/></p><p>Medieval pixel art asset FREE by Blackspire</p><p> https://assetstore.unity.com/packages/2d/environments/medieval-pixel-art-asset-free-130131 <br/></p><p>Pixel Adventure 1 by Pixel Frog</p><p> https://assetstore.unity.com/packages/2d/characters/pixel-adventure-1-155360</p>", "metacritic": null, "released": "2023-02-05", "tba": false, "updated": "2023-02-06T23:02:33", "background_image": "https://media.rawg.io/media/screenshots/2ed/2ed834a342ee71cf9692f64ab74a0bbc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["najrei"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}