{"id": 92149, "slug": "c64anabalt", "name": "C64anabalt", "name_original": "C64anabalt", "description": "<p>\r\n\tThis morning was just like any other morning. Then, it happened. No one knows where they came from, or what they are. But we all know that nothing will ever be the same.\r\n</p>\n<p>\r\n\tNow, your only chance for survival is to outrun the destruction of your city... with just one button.\r\n</p>\n<p>\r\n\tCANABALT travels decades into the past to become <strong>C64ANABALT</strong> on your Commodore 64 computer system!\r\n</p>\n<p>\n<strong>C64ANABALT</strong> is an official conversion of Adam Atomic &amp; Danny B.'s award winning single-button 2009 indie game CANABALT developed by Paul Koller for the 8-Bit, 64KB RAM, 1Mhz Commodore 64 home computer. The game was originally designed to run from a 16KB cartridge (although there are also tape and disk versions packaged with the download as well).<br/>\n<br/>\r\n\tThe game was originally developed as an entry for the RGCD C64 16KB Cartridge Game Development Competition (2011), and the name <strong>C64ANABALT</strong> was suggested by Adam Atomic himself. The physics and procedural algorithms are based on those documented in the original game's open source code.\r\n</p>\n<p>\n<strong>Playing C64ANABALT on a Commodore 64 or PC</strong>\n</p>\n<p>\r\n\tThe \r\n\tdigital version available here includes the original cartridge ROM files as well as disk and tape versions. These are primarily for use with emulators, but can also be run on a real C64 via hardware such as the 1541 Ultimate II or Turbo Chameleon. <br/>\n</p>\n<p>For emulator users, we recommend VICE, as it works on a variety of operating systems and is very user friendly. In fact, we've even included a pre-configured Windows, Mac and Linux version of the emulator with the download as well as some simple user instructions (we're nice like that).</p>\n<p> <strong>Buy C64ANABALT on Cartridge for your Commodore 64 Computer!</strong></p>\n<p>Enjoyed playing <strong>C64ANABALT</strong><strong> </strong>via emulation? Have an old Commodore 64 stashed away in the loft? Well, you'd be a fool not to grab a mega-collectable physical copy! So head on over to our online store to order yours today :)<br/></p>\n\n\n<p>\n<strong>Did you know?</strong>\n</p>\n<p>Interestingly, there is also a \r\n\tsecond unofficial version of CANABALT available for the C64 that was developed by Andreas Varga (Mr. SID). The two versions were developed without the coders' knowledge that each other were porting the same game. Mr. SID's version featured the RUN track by Mikkel Hastrup (Encore) and this was then later reused for the official build with his kind permission. Check out his fantastic C64 Prince of Persia conversion if you get a chance! ;)\r\n</p>\n<p>\n<strong>The digital download of C64ANABALT is available for FREE</strong>, but if you can afford to support us by throwing us some digital loose change then we'll be incredibly grateful. &lt;3<br/>\n</p>", "metacritic": null, "released": "2015-01-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f37/f37beeab11ca686b64c9ed8b58512f58.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["RGCD.DEV"], "genres": ["Action"], "publishers": [], "esrb_rating": null}