{"id": 921593, "slug": "ggj2023-dinoroot", "name": "[GGJ2023] DINOROOT", "name_original": "[GGJ2023] DINOROOT", "description": "<p>I finally made it in time for a Game Jam haha.</p>\n<p>This is my entry for the Global Game Jam 2023</p>\n<p>However I should come clean about a few details. I did not <em>technically</em> start from scratch.</p>\n<p>Back in December,  I started work on a smaller Game Jam with the theme of dinosaurs. I started doing some sprite work for that right away but had to scrap the project because of... <strong><em>REASONS.</em></strong></p>\n<p>So, when the GGJ got announced a few days ago, I decided to take whatever I had from that scrapped dinosaur game, and make something from it, while somehow shoehorning in the theme of roots somewhere along the way.</p>\n<p>The result, after many compromises and changes of heart, is this: <strong>DINOROOT</strong>!</p>\n<p>As it stands now, it's just a very simple and <strong>VERY</strong> short platformer. I originally had the idea of including puzzle elements. Something along the lines of burning roots to carve your way though this cave that's under a giant tree.</p>\n<p>I ended up scrapping that burning roots idea because of time, and because I ended up wasting a lot of time just playing with shaders and particles and stuff.</p>\n<p>In all seriousness, most of my time was dedicated to making the dino feel good to control. I spend basically an entire day fine tuning that thing lol. It was worth it I think, it controls pretty smoothly.</p>\n<p>Still, I wish I had time to do more. Or at the very least do cutscenes that don't like like they were drawn by a 5 year old. You can probably tell just by looking at them that at that point, I was just trying to get it over with lmao.</p>\n<p>At any rate, I'm pretty happy with this. I ended up putting it together is something like 20-30 hours total.</p>\n<p>...I think, who's keeping time lmao</p>\n<p>Anyways, enjoy, my sh*tty, desperately-trying-to-tie-in-with-the-theme-of-the-jam, sorry excuse for a poem at the end credits. idk, it was 6 am when I wrote it.</p>\n<p><strong><em>Controls:</em></strong></p>\n<p>WASD</p>\n<p><strong><em>Credits: </em></strong></p>\n<p>Assets:</p>\n\n<ul><li>https://szadiart.itch.io/pixel-dark-forest</li><li>https://szadiart.itch.io/pixel-fantasy-caves</li><li>https://anokolisa.itch.io/high-forest-assets-pack</li></ul>\n<p>Shader:</p>\n\n<ul><li>https://godotshaders.com/shader/crt-shader/</li></ul>\n<p>SFX:</p>\n\n<ul><li>https://kronbits.itch.io/freesfx</li></ul>\n<p>Everything else:</p>\n<ul><li>Me</li></ul>\n<p>Thanks for playing.</p>\n<p>Made with Godot Engine, btw</p>", "metacritic": null, "released": "2023-02-05", "tba": false, "updated": "2023-02-06T23:50:17", "background_image": "https://media.rawg.io/media/screenshots/6b6/6b680acb57f37959cd93af467f85a1c5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["big_kwii"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}