{"id": 921661, "slug": "mafiafamcom-mafiafam", "name": "MafiaFam.com (mafiafam)", "name_original": "MafiaFam.com (mafiafam)", "description": "<p><strong>We present MafiaFam on Itch.io, a new MMO Indie Mafia game for Desktop, Facebook and Mobile.<br/></strong></p>\n<p>MafiaFam is a cross¬-platform MMO title that sees players attempt to rise to the top of the mafia underworld. The game is free¬to¬play.</p>\n<p> “MafiaFam will be a unique game in the MMO genre. It’s full of exciting, innovative features that incorporate the mafia way of life, while keeping it really fun at the same time.”\r\n</p>\n<p>In MafiaFam, the goal is simple: become the most powerful and respected mobster in the virtual game world.\r\n</p>\n<p>To achieve this objective, you are handed your own Mafia Empire. The Mafia Empire is essentially the hub of the game, where you have several establishments – including a mansion, meth lab and hospital – that can be upgraded. When it comes to upgrading, you are rewarded with in¬game benefits to further help you in your overall mission to reign supreme over competing mob bosses.\r\n</p>\n<p>An example of this includes upgrading your money press to a higher level, resulting in it producing more cash than before. Along with upgrading your Empire, there are many other activities to participate in. From gambling your riches playing one of five casino games to performing the perfect crime to improve your standing, there is a wide variety of things to do that will keep players immersed in the experience.\r\n</p>\n<p>“Participate in illegal activities to gain cash, get rid of the police, gamble your dirty money at the casino, and join your friends as you battle in wars against other families. And that’s just scratching the surface in terms of things to do in the game!”\r\n</p>\n<p>Thanks to its distinctive and polished visuals, along with smooth and satisfying gameplay, MafiaFam is positioned to become a permanent fixture among social gamers and their daily activities!\r\n</p>\n<p>Game Features: </p>\n<p>● Fully upgradable Mafia Empire: produce your own cash, ammunition and crystalmeth. <br/>● Five interactive casino games: Slot Machine, Wheel of fortune, Blackjack, Higher/Lower, and Roulette.\r\n<br/>\r\n● From the petty to the sophisticated, perform crimes to boost your standing – but watch out for the police!\r\n<br/>\r\n● Attack other players with the ammunition you have culminated from your Empire. Win the duel and steal all the available loot from the opposing player.\r\n<br/>\r\n● Gain Mafia Power by buying troops. Upgrade their stats and equip them with weapons to better help you during battles.\r\n<br/>\r\n● Start your own mafia family, or join one as you work together with other players to battle against rival families.</p>\n<p><strong>Cross¬Platform Function<br/></strong>In providing MafiaFam with the biggest target audience that is possible, the game will be released across three platforms:</p>\n<p>Desktop, Facebook and Mobile.\r\n</p>\n<p>Desktop: For Desktop, MafiaFam will be available to play in all of the world’s most popular browsers at: https://www.mafiafam.com\r\n</p>\n<p>Facebook: Facebook will be another platform that will be utilised, making sure that social media users have access to the game.\r\n</p>\n<p>Mobile: With the overcrowded nature of app stores, MafiaFam will instead be available for mobile and tablet devices as a web¬app. Mobile users simply visit the MafiaFam homepage and play the game as they would on a desktop ¬ all functionality included.\r\n</p>\n<p>For further information and details on MafiaFam, you can keep up¬to¬date with the latest news by connecting to our chat in the game.\r\n</p>\n<p>I hope to see you there!\r\n<br/>\r\n- Tony, founder of MafiaFam.com\r\n</p>", "metacritic": null, "released": "2023-02-05", "tba": false, "updated": "2023-02-07T00:25:37", "background_image": "https://media.rawg.io/media/screenshots/5d4/5d4e673606137e600254f530a096a573.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 281, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["mafiafam"], "genres": ["Action", "Strategy"], "publishers": [], "esrb_rating": null}