{"id": 921674, "slug": "maybe-a-witch-hunter", "name": "Maybe a Witch Hunter", "name_original": "Maybe a Witch Hunter", "description": "What is \"Maybe a Witch Hunter\"?\r\n\r\n<p>\"Maybe a Witch Hunter\" is a game made in Python by me, <strong>GlassFrog</strong>, for the 2023 Itch.io <em>My First Game Jam: Winter 2023</em>, which encouraged emerging game makers to create something new and simple in two weeks.</p>\n<p>Its theme was revealed to be <em><strong>growth</strong>.</em> therefore I thought to make a \"Princess Maker\"-inspired raising simulator as my first game. Considering I'm very bad at drawing and can't compose music, I settled on a simple text adventure. :)</p>\r\nThe Story\r\n<p>The game focuses on a 21-years-old girl (default name: <strong>Medea</strong>) who has just moved to the Big City in order to study physics. Or rather, this is what she tells everybody; in reality, she is escaping from her former life.</p>\n<p>A few years back, she came to terms with the fact that she has grown up in an abusive household, found herself with fewer and fewer friends, and overall started to feel everything she ever did was futile. Even though she wanted to make something out of her life, she was completely paralysed.</p>\n<p>Then one day everything changes. She meets a mysterious figure who introduces her to the unseen struggles of the Big City: every year a spellcaster mad with power, known as the <strong>Witch</strong>, must be stopped, lest they destroy the whole city. To this purpose, a group of spellcasters, known as the <strong>Witch Hunters</strong>, must deal with them. The climax is reached the first of July, when a volunteer subjects themselves to the <strong>Dreaming Spell</strong> and confronts the evil Witch, hopefully bringing them down.</p>\n<p>Once this hidden side of the Big City is disclosed to her, Medea finds the strength to make something out of her life. Will she focus on her studies and part-time job? Will she reconnect with her old friends? Or will she dedicate her life to magic?</p>\n<p>What will she end up as? <strong>Maybe a Witch Hunter</strong>?</p>\n<p>Full playthrough: ~45min/1h<br/>High replayability due to its multiple endings!</p>\r\nThe Game\r\n<p>The game is both a raising sim and a text adventure. You make choices through a textual interface, which is much like a command interpreter. You will have to use the <em>train</em> command to choose what Medea will focus on throughout the week. The choices include studying, working, hanging out with friends, relaxing, taking magic lessons, and the like. You choose one activity for each day on a weekly basis.</p>\n<p>Every training option raises and lowers some of Medea's stats. Choose carefully and shape Medea into the person you want her to become!</p>\n<p>Every month or so, there's an event that Medea has to deal with. Some of them require a binary choice, others just happen. The outcome is based on Medea's current stats. Generally, some stats either increase or decrease after an event, depending on the outcome.</p>\n<p>Every week, you get a memo reminding you of how stressed out Medea is. You also get to glance at the upcoming events. This makes sure you can prepare for whatever comes next.<br/></p>\n<p>The game includes a saving system! Use <em>save &lt;name&gt;</em> and <em>load &lt;name&gt;</em> often to create and use savefiles. Loading games will take you back to that day and with your former stats.<br/></p>\n<p>Once her journey is over, Medea will have found her true calling. The outcome is based on Medea's final stats. Be sure to have at least one stat that is relatively high, otherwise you'll end up as a good-for-nothing!<br/></p>\n<p>For more information, you can take a look at the file <em>Guide.txt</em>, which is included with every download. It goes into deeper detail, describing the stat increases that follow every training activity, the several game endings, and more! You can also check out the in-game command <em>howtoplay</em> for a shorter version of this summary.<br/></p>\r\nTrigger Warnings\r\n<p>\n</p>\n<p>The game is quite family friendly, but there are a couple of situations that might be unsuitable to some people. The following trigger warnings apply:</p>\n<ul><li>Family abuse</li><li>Implied mentions of death and/or suicide</li></ul>\r\nA Note from the Creator\r\n<p>Hello everybody, GlassFrog here! :)</p>\n<p>This is my first game, which I made in about one week for the Itch <em>MFGJ</em>. At first I wasn't sure if I should join, but I'm glad I did: I learned a lot about Python GUIs and game making! Among those, I thought the heaviest burden would be on coding, but writing the game story was actually <em>much</em> more mentally intensive and <em>much</em> more complex than expected.</p>\n<p>You might find the story a bit simple and naïve. I settled on a bottom-up approach since I didn't think I would have had enough time to completely think it through in every detail. Many things, including the Dreaming Spell, I improvised and made up as I went along, with no clear idea <em>a priori</em>. I hope it still makes sense to you!</p>\n<p>The game looks better on Linux; in fact, it was developed on a Linux machine. The blame is on the interaction between the <em>tkinter</em> Python library and Windows. I haven't found a solution for this yet.<br/></p>\n<p>The game might include spelling mistakes, as English is not my primary language. Please, feel free to make me aware in the comments!</p>\n<p>Likewise, if you find any bugs, do inform me!</p>\n<p>That is all. Now download the game and have fun!</p>", "metacritic": null, "released": "2023-02-05", "tba": false, "updated": "2023-02-07T00:31:11", "background_image": "https://media.rawg.io/media/screenshots/b78/b785f04d85ea19aa5db5990c4ab22ac2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["GlassFrog"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}