{"id": 92175, "slug": "antihero-first-access", "name": "Antihero First Access", "name_original": "Antihero First Access", "description": "<p><strong>FIRST ACCESS has ended and is no longer available! </strong></p>\n\n<p>Run a thieves' guild in a corrupt, gas-lit underworld. Antihero is fast-paced multiplayer strategy - with an (Oliver) Twist.</p>\n<ul><li>Play Antihero before anyone else</li><li>Get first access to new content</li><li>Automatic updates through the new itch.io client </li><li>Join the developer forums on itch.io</li><li>Get the Steam version when it launches</li><li>Help us shape the game</li></ul>\r\nWhat is Antihero?\r\n<p>A turn-based multiplayer strategy game about running a thieves' guild. Antihero is all about short play sessions with super-interesting decisions. Recruit street urchins, hire gangs, steal everything - and bribe, blackmail, and assassinate your way to victory. Hone your skills against the AI, play online with the Antihero community, or share a PC with a friend in the offline hotseat multiplayer mode.</p>\r\nWhy First Access? \r\n<p>Antihero is an original game design, and we're determined to get the game balance <em>just right</em>. As we close in on release, we need players of all skill levels to play the multiplayer and help us fine-tune the game. We'll be adding more content routinely, and players who join First Access will help us shape the experience as we close in on release. </p>\n<p>Antihero will ship with a story-driven singleplayer campaign, but we're focused on multiplayer for our initial First Access release. This early build contains a short tutorial, and we'll be fleshing out both the full singleplayer experience as well as new multiplayer content in the coming months.</p>\n<p>While the game is fairly stable, please be aware that we'll occasionally be taking the server down for maintenance (this won't affect offline play, of course), and we may rotate multiplayer maps in and out of the game to make sure everything gets tested.</p>\r\nWhat do I get now?\r\n<p>With first access, you'll get first access to all future content as it gets added, in addition to everything currently available:</p>\n<ul><li>3 multiplayer maps, with more on the way</li><li>Asynchronous online multiplayer</li><li>Local offline multiplayer </li><li>Singleplayer tutorial to help you learn the ropes</li></ul>\r\nWhen will the game be done?\r\n<p>We don't have a firm release date yet, but we're planning on launching sometime in early 2017. You can follow our development at our developer blog!</p>\r\nHow can I get more info? \r\n<p>Check out our developer blog, the Antihero Facebook page, and our Twitter feed. If you prefer email, sign up for the our newsletter at the Antihero homepage to get occasional development updates and be the first to know when we offer up more First Access keys.</p>\n<p>Thank you, and we hope you enjoy the game!<br/></p>", "metacritic": null, "released": "2016-11-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1f8/1f85df45c1757b1fd549f3f8cd1dee89.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Versus Evil", "timconkling"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}