{"id": 92192, "slug": "birdsketball-itch", "name": "Birdsketball (itch)", "name_original": "Birdsketball (itch)", "description": "<p><strong>Fly birds and shoot hoops.</strong><br/></p><p>Birdsketball is a local multiplayer sports game for 1 - 4 players.</p><p> </p><p>\n<strong><br/>Easy to pick up, hard to master</strong><br/>\n</p><p>\r\n\tThe controls are simple. But to fly around effectively takes skill and practice to master. Here are some tips for improving your game:\r\n</p><ul>\n<li>Take your finger off the flap button sometimes: You will rotate faster when idle, and it's often it's faster to drop down with gravity than to fly a full circle.</li>\n<li>Tackle your opponents by boosting into them.</li>\n<li>Boost into a wall and you will rebound in the opposite direction. Faster than turning around and it makes you look cool.</li>\n<li>Long distance shots on goal are impressive, but sometimes just flying the ball directly in is all you need to do. Just make sure you're back in time for the next ball spawn.</li>\n<li>Some players prefer to use the right trigger for flapping (not me!). If you hold it just right, you can almost hover on the spot.</li>\n</ul><p> <br/><strong><br/>You can make your own levels:</strong></p><p>Make your own levels with the new collaborative level editor. You'll find the option at the bottom of the VS screen level select.</p><p><strong>Campaign mode</strong></p><p>If the VS mode is the main course, then I guess the campaign mode is the entree. Nice way to practice your flappin' and shootin'. Play solo or cooperatively with a friend.</p>", "metacritic": null, "released": "2016-01-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b80/b8059d7d433b23d663e09e69cde29b71.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Waynetron"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}