{"id": 922068, "slug": "sweatshop-sunshine-a-totally-ordinary-game-about-p", "name": "Sweatshop Sunshine: A Totally Ordinary Game About Production", "name_original": "Sweatshop Sunshine: A Totally Ordinary Game About Production", "description": "<p>This is a game-jam project for \"My First Game Jam 2023\"</p>\n<p>Game is still in early stages of development, nothing is final, everything is terrible.</p>\r\nEnter Govnograd - the last standing city of Srakotania.\r\n<p>After the nuclear war, known as the Big Badabum, most territories of the continent transformed into the unliveable wasteland. </p>\n<p>Days before the bombs were sent, mages of the Govnograd shielded the city from the bombs with the force-field. In centuries after that, while the outside grew more and more hostile, Govnograd extended skyward, with its inhabitants building more and more layers of the city. </p>\n<p>Top levels of the metropolis are occupied by normal law-abiding citizens, who were lucky enough to be born into wealthy families, but two bottom layers - Slums and Slumy Slums, are inhabited by low-lifes, criminals and con-men. Just like yourself.</p>\n<p>You are a lucky native of Slumy Slums (as lucky as you can be, considering...) and an entrepreneur. You had just saved up enough money to get an illegal business license from the city's official mob boss, and to buy a promising estate to produce knock-offs of famous brands. The only thing is - you don't have enough left to hire any actual staff. </p>\n<p>That's when the idea hits you - cheap child labor! You take your trusty lasergun, hop into the sewers and make your way to the most crime-infested areas of the Slumy Slums, to rescue poor orphans from awful life on the streets. give them roof over their heads, and a purpose in life - bring You some sweet profit! And also to exterminate some dangerous individuals along the way.</p>", "metacritic": null, "released": "2023-02-04", "tba": false, "updated": "2023-02-07T03:31:07", "background_image": "https://media.rawg.io/media/screenshots/b89/b8954cb154f3bb43be82156c1e9269a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Huggetz"], "genres": ["Action"], "publishers": [], "esrb_rating": null}