{"id": 922115, "slug": "wateroot", "name": "Wateroot", "name_original": "Wateroot", "description": "<p>Introduction:</p>\n<p>Wateroot is a 3D maze game. By rotating the models which are pipes, players can flow a water drop in the pipes move with the influence of gravity. When the player finds the exit and lets the drop through the exit, a level is finished.<br/></p>\n<p>The source of inspiration is a hypothesis of cosmology – “Heat Death”. Since the beginning of the universe, and since the emergence of life, everything in the world has evolved in its own direction. And each of these paths of development becomes part of the complex roots of evolution. But based on the second law of thermodynamics, the increase of entropy principle will only let all the roots converge to a final end, and the world will return to heat death. </p>\n<p>The water in the game represents the root of life. It is also the trace of the existence of human beings and other creatures living on Earth in the universe. The backgrounds of the game represent that from the first sprout of life underwater to the vastness of the stars, the evolutionary roots of life are increasingly complex, which is expressed by more complex layers of pipes at each harder level. No matter what the path of the root is, it always leads to one. If the end of the world is a foregone conclusion, what are we going to do as life in this world? This is a question worth thinking about.</p>\n\n<p>Team:</p>\n<p>Game Designers: We are game designers!<br/>3D Artist: Jiage <br/>2D Artists: Yiqing Liu &amp; Zixin Yao<br/>Level Creator: Shuhuan Cai<br/>Programmer: Zhiteng Chen<br/>Effects: Kejia Cheng</p>", "metacritic": null, "released": "2023-02-04", "tba": false, "updated": "2023-02-07T03:51:44", "background_image": "https://media.rawg.io/media/screenshots/834/834025fbf049f33931822dc7a3be1311.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Carsten"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}