{"id": 922455, "slug": "luminous-logic-demo", "name": "Luminous Logic (Demo)", "name_original": "Luminous Logic (Demo)", "description": "<p>Embark on a journey through a post-apocalyptic world in Luminous Logic, a narrative-driven VR experience that combines puzzle-solving with a captivating story. In this demo stage, you will find yourself in an abandoned town filled with ancient futuristic technology, where your goal is to use your skills and wits to shine a laser at specific locations. Through your adventures, you'll encounter complex puzzles that challenge your ability to manipulate reflective blocks and reflect the laser to progress through the game. Experience the demo now and join the quest to unravel the secrets of this world.</p>\n\n<p><strong>Story:<br/></strong>In the not-too-distant future, a great cataclysm has reduced the world to a barren wasteland. The few survivors cling to life in isolated settlements, but one day, a strange signal is detected coming from an abandoned town on the outskirts of civilization.</p>\n<p>You are sent to investigate, and as you enter the town, you discover that it is infused with ancient futuristic technology, unlike anything you've ever seen before. As you delve deeper, you realize that the signal is coming from a powerful device known as the Luminous Logic, which holds the key to unlocking the secrets of this long-forgotten civilization.\r\n </p>\n<p>But you soon discover that the town is not as abandoned as it seems. The air is thick with danger and mystery, and you must use your wits and puzzle-solving skills to survive and unlock the secrets of the Luminous Logic. With each new challenge you overcome, you'll unravel more of the story and uncover the truth about what happened to this once-great civilization.\r\n </p>\n<p>So begins your journey through the post-apocalyptic world of Luminous Logic, a narrative-driven VR experience that combines challenging puzzles with a captivating story. Join the quest to unravel the secrets of this world, and discover the origin story of the Luminous Logic.\r\n</p>", "metacritic": null, "released": "2023-02-04", "tba": false, "updated": "2023-02-07T07:03:03", "background_image": "https://media.rawg.io/media/screenshots/984/98463f4f2ad4d161945a2390071e16fa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["uipa"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}