{"id": 922489, "slug": "loose-tooth", "name": "loose tooth.", "name_original": "loose tooth.", "description": "<p><strong>loose tooth.</strong> is a kinetic novel following former field detective Hal Macleod on her sixth annual return to the same small town her former field partner disappeared in now six years ago. It’s an exploration of love, loss, and holiday-tinged grief through a cloudy queer lens.</p>\n<p>This is only a demo version and contains only 1/3rd of what I have planned to add to this game and its story. <strong>loose to</strong><strong>oth. will see its full release in Spring 2023.</strong></p>\n<p><strong>Features</strong>:\r\n</p>\n<ul><li>Currently at 27k words, full play-through lasts 10-15 minutes\r\n</li><li>Kinetic novel\r\n</li><li>Hand-drawn sprites and backgrounds\r\n</li><li>Is gay &lt;3</li><li>Full release will have one (happy) ending\r\n</li><li>CW: Explicit language, verbal depictions of violence.\r\n</li></ul>\n<p>Author’s Note: <strong>loose tooth.</strong> was originally conceptualized and briefly worked on for Winter Jam 2022 before unexpected illness forced my hand to shelve it. It has been revived for FFS Jam 2023, if only for a demo. Very appreciative of the motivation this jam gave me to finish something towards the final project, and doubly excited to finally share the beginning of what’s been a passion project in my mind for far too long now.\r\n</p>\n<p>As this is a demo, it’s a little rough around the edges. I am aware of most of the issues I’m releasing this demo with, and am working hard to rectify them all for the full release! The only slightly disruptive issue you may encounter is the inability to save as I have not yet reprogrammed my UI. <strong>Thus, I strongly suggest playing this game in its entirety in one sitting.</strong></p>\n<p>Feel free to leave any other relevant feedback or commentary below. &lt;3</p>\n<p><strong>Credits</strong>: </p>\n<p>The copyright for the materials used in “<strong>loose tooth.</strong>” belongs to all artists/creators appropriately credited in the following list. I claim no rights to anything, including edited works, that isn’t specifically attributed to myself. If you see your work used here and wish for it to be removed, please don’t hesitate to reach out and I will comply with your request. &lt;3\r\n</p>\n<p><strong>Writing, Programming, Art</strong> - snixiy\r\n</p>\n<p><strong>Music, SFX</strong> - Various FreeSound Artists, as listed below:\r\n</p>\n<p>orangefreesounds, ftpalad, jaaesoc, MootMcnoodles, HeyHeyHHere, yzhamua (audio edited for length), duckduckpony (audio edited for length), jtnewlin13 (audio edited for length), xyzr_kx (audio edited for length), hannagreen, amholma, holizna, Flem0527, FreqMan (audio edited for length), klankbleed, craftcrest.\r\n</p>\n<p>+Much love to my beta tester Rin. &lt;3</p>", "metacritic": null, "released": "2023-02-03", "tba": false, "updated": "2023-02-07T07:19:48", "background_image": "https://media.rawg.io/media/screenshots/118/118a578b47404a860cff8815f7416e6d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["snixiy"], "genres": [], "publishers": [], "esrb_rating": null}