{"id": 922526, "slug": "l-prototype-2", "name": "L (Prototype)", "name_original": "L (Prototype)", "description": "Overview\r\n<p>L (Lindenmayer) Systems are systems which, using a set of production rules, create a set of symbols from an initial set of symbols. L-Systems can generate recursive, fractal geometry and have been used for many purposes including procedurally generating foliage and other fractal-like patterns. I have always been fascinated by L-Systems and wondered if they could be used as a game mechanic. The trickiest part of this prototype was designing a UI to easily create L-System grammars in a visual way. This is an idea I hope to come back to someday to fully flesh out into a mobile puzzle game.<br/></p>\n<p>This prototype is a toy more than anything. The jist of it is to place blocks on the playing board, and place blocks in the production rule grid to create production rules. Those rules then influence the next layer of the system as it steps from state to state. <br/><br/></p>\n<p>In the above example, The red grid represents the blocks that will be created from a red block, the green grid represents what will be generated from a green block, and so on. In the above example, a red block will produce a green block directly above it. And then the green block will produce 4 more green blocks around it, and those green blocks will produce more green blocks and so on and so forth.<br/></p>\n<p>The best way to understand how this production system works is to play around with it and experiment!<br/></p>\n<p>From the above set of production rules and the above starting state of the board. The next step in the system will look like below.<br/></p>\n\n<p>and so on and so forth...<br/><br/></p>\n\n\r\nHow to Play\r\n<p>The game starts in \"play\" mode. Where you can use the left mouse button to rotate the playing board. The Scroll Wheel will translate the camera up and down.</p>\n\n<p>Press the \"switch mode\" button to switch into \"build\" mode. <br/></p>\n\n<p>In Build Mode, we have the playing board, our set of production rules and the buttons that allow us to select the coloured block that we are placing. Use the left mouse button to select the colour blocks you want to place and click on the board to place the blocks. Click on the grids to create the production rules that will be used!.</p>\n\n<p>Switch back to play mode by clicking the \"Switch Mode\" Button and press \"Step System\" to see what is generated from your production rules!</p>\n<br/><br/>\r\nControls\r\nPlay Mode\r\n<p>Left Mouse Button - Rotate Grid<br/>Mouse Scroll Wheel - Pan the camera up and down<br/></p>\r\nFurther Reading\r\n<ul><li>https://en.wikipedia.org/wiki/L-system</li><li>http://paulbourke.net/fractals/lsys/</li><li>https://onlinemathtools.com/l-system-generator</li></ul>", "metacritic": null, "released": "2023-02-03", "tba": false, "updated": "2023-02-07T07:36:42", "background_image": "https://media.rawg.io/media/screenshots/8cf/8cfd4ddaac8813d445039cae4888e481.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Michael Wahba"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}