{"id": 922547, "slug": "sinister-squidward", "name": "Sinister Squidward", "name_original": "Sinister Squidward", "description": "<p>What would happen if Squidward finally went insane and decided to wreak havoc on the residents of Bikini Bottom? </p>\n<p>Take control of the mean cashier as he transforms into a menacing monster armed with an AK-47, then play as Sandy to save Spongebob and Patrick from this tentacle horror!</p>\n\n<br/>\n<p>Embark on the twisted journey of Squidward as he takes you through his descent into madness, caused by years of working as a Krusty Krab cashier. You play through the tormented eyes of Squidward as he commits his crimes upon the people of Bikini Bottom.</p>\n<p> But the fun doesn't stop there! Step into the air-tight suit of Sandy as she embarks on a daring mission to save Spongebob and Patrick from the clutches of Squidward's manic mind. Brace yourself for a tale filled with cinematic cutscenes and horror as you interact with fan-favourite characters including Patrick, Mr. Krabs, and the one and only Spongebob. Get ready for a thrilling experience unlike any other in the world of Bikini Bottom!</p>\r\n\r\n\r\nMoveW-A-S-D\r\n  \r\n  \r\n    Run\r\n    Shift + W-A-S-D\r\n  \r\n  \r\n    Interact\r\n    E\r\n  \r\n  \r\n    Use Flashlight\r\n    F\r\n  \r\n  \r\n    Shoot\r\n    Mouse L\r\n  \r\n  \r\n    Pause/Settings\r\n    Esc\r\n  \r\n\r\n\n\n<p>This work is a horror/comedy parody of the beloved Spongebob franchise, which is owned by Viacom International Inc. Note that I do not own any rights to the characters depicted in this game, so please don't sue me Viacom :)</p>\n<p>This game was crafted with love and the Unity game engine over the course of three months. It's all in good fun, so please don't take any of the themes depicted too seriously. If you are easily offended, maybe try playing a game where you can't see a starfish getting cut in half. I hope you enjoy playing it as much as I enjoyed creating it!</p>\n<p>Have fun!</p>", "metacritic": null, "released": "2023-02-03", "tba": false, "updated": "2023-02-07T07:46:55", "background_image": "https://media.rawg.io/media/screenshots/f12/f12addb882ed9568417af07b19bfc66c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 408, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Rinbash"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}