{"id": 922554, "slug": "lost-hero-itch-1212gaming", "name": "Lost Hero (itch) (1212Gaming)", "name_original": "Lost Hero (itch) (1212Gaming)", "description": "<p>Not all super powers are super, and not all heroes are heroic.  At least that’s what I tell myself.</p>\n<p>I find the lost, it’s what I do.  Things, people, animals, whatever might go missing. </p>\n<p>But missing things are not always lost and lost things, well, they aren’t always missed.</p>\n<p>People don’t understand that, and they positively don’t like it.</p>\n<p>I always ask if they really and truly want whatever it is found.  I think you’d be amazed by how many of them are surprised by my question. </p>\n<p>Of course they almost always say yes, but they’re usually sorry when I succeed.</p>\n<p>Sure, If it’s a hair clip, that’s easy.  Until the actual ramifications are realized.  You’d be shocked how much a life can change by finding a lost hair clip.  Or lives, because it’s usually lives.</p>\n<p>Never mind a person. Finding a lost person is more trouble than it’s worth. I know this but the customers never listen, they always want their person found.  Regardless of the consequences.</p>\n<p>Still, it’s a living I suppose, the unheroic finder and his less than super power.</p>\n<p>I’m not sure I’m supposed to find these lost things to be honest. I think some things should remain lost, forever.   It just too often feels wrong, and turns out wrong. </p>\n<p>But this job...this one’s weird.  Somebody lost a prototype robot. Didn’t give me much information other than it’s expensive.</p>\n<p>I think it doesn’t want to be found, because it seems to be very good at hiding. I don’t usually track things down that are trying to get away, but this one certainly seems to be doing that.</p>\n<p>I think there’s going to be trouble.</p>\n<p>Anyway...</p>\n<p>I’m worried, really, that what’s lost is me.  Who will find me?  What will happen then?</p>", "metacritic": null, "released": "2023-02-03", "tba": false, "updated": "2023-02-07T07:49:12", "background_image": "https://media.rawg.io/media/screenshots/aa4/aa42753dcd693ee44a03d7c13c822da6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["1212Gaming"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}