{"id": 922686, "slug": "8-bit-adventures-2-itch", "name": "8-Bit Adventures 2 (itch)", "name_original": "8-Bit Adventures 2 (itch)", "description": "<p><strong>A Turn-Based RPG That's More Than a Throwback!</strong></p>\n<p><strong>8-Bit Adventures 2</strong> is everything you love about NES, SNES and PS1-era JRPGs - with all of the charm, heart and soul, but none of the inconvenience. </p>\n<p>That means an earnest, engaging storyline; relatable, easy-to-love characters; strategic turn-based battles; deep party customisation; bizarre monsters; an unforgettable soundtrack; and a large, fantastical world, traversed by Airship, and filled with people full of personality – all brought to life by vibrant 8-Bit inspired visuals. </p>\n<p>While it is a sequel, anyone can jump into this brand new JRPG adventure! <br/>And you can play the Free Demo right now!<br/></p>\n\n<ul><li>Enjoy a feel-good adventure filled with love,  laughs, and drama, which deals with the dark stuff but always wants to  leave you feeling uplifted over its 30-40 hour playtime.\r\n</li><li>Experience  constant variety – everything from exploring ancient ruins to solving a  robot murder mystery – realised through charming pixel art which walks  the line between authenticity and aesthetic.\r\n</li><li>Explore an  expansive World Map filled with secrets and optional locations to  discover; both on-foot and via Airship! The world of 8-Bit Adventures 2  is full of the character-driven side-quests and challenging Super Boss  battles that any RPG fan expects.\r\n</li></ul>\n\n<ul><li>Engage in turn-based JRPG battles with depth and strategy, inspired by games like <em>Final Fantasy X</em>, <em>Chrono Trigger</em>, and <em>Mother 3</em>. \r\n</li><li>Freely  swap allies in combat, equip Augments to customise your characters, and  unleash 99 unique abilities, including Team Attacks and Omega Burst  finishing moves.\r\n</li><li>Meet a lovable cast of seven playable  characters who form relationships, make mistakes, and struggle with  their past, but still work to save the world and overcome their demons.\r\n</li></ul>\n\n<ul><li>Relax with a carefully crafted adventure which  never bogs the player down, but ensures you're always doing something  fun and meaningful. From beginning to end, 8-Bit Adventures 2 is focused  on telling an engaging story, not wasting your time - and that means no  random battles or mandatory grinding!\r\n</li><li>Become engrossed  in an earnest, heartfelt story about living a full life and protecting  the things that really matter - no cynicism, meta-narrative, or classic  game parody in sight. \r\n</li><li>Save the world from a vengeful  Glitch! A mistreated child with terrifying powers threatens to reshape  the world in his own chaotic image. A unique and persistent foe from  beginning to end, the Glitch changes and develops over the course of the  story like any other character, grappling with what he is…and what he  could be.\r\n</li></ul>\n\n\n<p><em>This game features bright screen flashes for certain special attacks and effects. If you are susceptible to these kinds of flashes and bright lights, or have an epileptic condition of any kind, please consult your physician before playing.</em><br/></p>", "metacritic": null, "released": "2023-02-03", "tba": false, "updated": "2023-02-07T08:56:33", "background_image": "https://media.rawg.io/media/screenshots/3f8/3f8f2e545766516cd84a3eb15428ef3d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CriticalGames"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}