{"id": 92275, "slug": "fuu-garden", "name": "Fuu Garden", "name_original": "Fuu Garden", "description": "<p>My name is oxopotion and I'm happy you stopped by!</p>\n<p>Fuu Garden was intended to be an open world adventure RPG where the player played as their own unique attendant at the Autumnhearth College for Magically Gifted Beings and explored the near by forest during a field trip. The game is no longer in production but what came out of it was this nice looking little explorable forest I thought would be nice to share with everyone!</p>\n\n<p>When you begin the game you will find yourself at a large greenhouse building. This is where all the students would have gathered after their long trek through the woods from the Autumnhearth college which can be seen off in the distance. The greenhouse is also where the magical creatures known as Fuu would be hatched and nurtured by the player.</p>\n<p>After learning about the Fuu and where to find them, the you would make your way from the greenhouse into the woods! Here you are free to explore but because this project was never seen through to completion, there are no characters to be found. Only a brisk walk through the mystical forest awaits you.</p>\n\n<p>Controls</p>\n<ul><li>W, A, S, and D: Movement</li><li>Mouse Movement: Rotate view</li><li>RMB: Zoom in</li><li>Space: Jump</li><li>Tab (Press): Toggle phone</li><li>Tab (Hold): Toggle phone closeup</li><li>Esc: Quits the game</li></ul>\n<p>Debug</p>\n<ul><li>Num Enter: Toggle Debug Mode</li><li>1 - 9 and 0: Teleport to location</li></ul>", "metacritic": null, "released": "2018-05-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/838/838e0a57e8757a545a7c3744cb527f62.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["oxo potion"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}