{"id": 92271, "slug": "dmcas-sky", "name": "DMCA's Sky", "name_original": "DMCA's Sky", "description": "<p><strong>Huh? </strong>No Mario's Sky has received a DMCA notice. DMCA's sky is our replacement.</p><p>Help Spaceman Finn search for Princess Mango in an infinite universe (that may contain no Mangoes). Made in 72 hours for Ludum Dare 36.<br/></p><p>Featuring crazy Moombas, An Infinite Universe, Muscle, Amazing Physics and a Radical Space Ship; DMCA's Sky is the hackneyed remake-gone-mashup you've been craving.</p><p>Sign up to our mailing list to get updates about the game!<br/></p><strong>CONTROLS <br/></strong><ul><li>Finn:<ul><li>Arrow keys - Move</li></ul><ul><li>Z - Jump</li><li>Hold X - Run</li><li>Tap X - Enter ship (once Muscle gives it to you)</li></ul></li><li>Ship:<ul><li>Arrow keys - Turn your ship</li></ul><ul><li>Z - Accelerate ship (hold for longer for boost)</li><li>X - Leave Ship</li></ul></li><li>M - Toggle music</li><li>Escape - Quit game</li><li>Collect Explore them all!</li></ul><p><strong>CONTROLLER</strong><br/></p><p>You can use a controller with the game. You may need to remap the jump and ship buttons though -- which you can do from the Input tab when the game starts. Use the second \"Fire1\" (Jump) and \"Fire2\" (Ship) entries to set the buttons you wish to use.</p><p><strong>FAQ</strong></p><p><strong>Can I use different controls? </strong>Yes! When the game starts, use the Input tab to set different keys. Use \"Fire1\" and \"Fire2\" to remap Z (jump) and X (ship). You can also use a controller.</p><p><strong>I want to visit World DMCA-DMCA again! </strong>Click \"Reset Progress\" on the title screen to start the game at World DMCA-DMCA again.</p><p><strong>The game runs too slow! </strong>Try setting the Graphics Quality to Low in the launcher.</p><p><strong>The game crashes on Linux! </strong>If you have an Nvidia GPU, make sure you are using the latest Nvidia binary drivers for Linux. They are much more reliable than the Mesa Nouveau drivers. Alternatively try running the game with the -force-opengl command-line parameter to force Unity to use its legacy back-end.</p><p><strong>The game won't run on macOS!</strong> If you get a message about the game coming from an unidentified developer and it won't run, press Control and click on the app and select \"open\". macOS will then allow you to run the game.</p><p>Music licensed under Creative Commons courtesy of:</p><p>http://freemusicarchive.org/genre/Chip_Music/</p><p>http://ericskiff.com/music/</p><p>visagermusic@gmail.com, @visagermusic<br/></p>", "metacritic": null, "released": "2016-09-04", "tba": false, "updated": "2019-08-28T23:26:03", "background_image": "https://media.rawg.io/media/screenshots/496/4968346fc9197ffcad5b185daf429155.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["ASMB Games"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}