{"id": 92278, "slug": "treelogy", "name": "Treelogy", "name_original": "Treelogy", "description": "<p>Be a tree!  A unique and challenging experience where you have to grow, survive and evolve to adapt to environmental conditions and disseminate all over the planet.<br/></p>\n<p>A calm and peaceful experience in a challenging and ruthless environment.<br/></p>\n<p><strong>[This game is in active development. Any help and feedback is welcome.]</strong></p>\r\nGrow\r\nGrow your <strong>roots</strong> to find water. Roots are more expensive to divide.<br/><br/>Grow your <strong>branches</strong> to get more energy. Branches are more expensive to extend\r\n<p>To expand you need sap, taken from the <strong>reserve</strong>. The circular indicator appearing when you extend something shows you how much it will take from the sap reserve.</p>\r\n Sap reserve\r\n\r\n<p>The arrow (red or green) on the sap reserve shows how much sap you earn or lose according to production/consumption balance.<br/></p>\n<p>The more you have roots the more you can stock in the reserve.</p>\r\nRespiration\r\n<strong>Production (combination of blue and yellow bars)</strong>:<br/> water + energy = sap (photosynthesis)\r\n<br/><br/><strong>Consumption (brown bar)</strong>:<br/>upkeep cost.  Divided in several segments representing consumption of roots, leaves, flowers and fruits.<br/> Some parts need more sap than others.<br/>  <br/><strong>Balance (red/green)</strong>:<br/>red when consume more than produce, you lose sap. green for the inverse.<br/>Sap reserve is updated according to balance.\r\n<p>The white graduations indicate sap units, you must have energy and water bars above one graduation to produce one new unit of sap.<br/></p>\r\nClimate\r\n<p>Keep an eye on the weather, learn how the climate evolves and use seasonnalities at your advantage. </p>\n<strong>Luminosity</strong>: impacts the amount of energy received by the leaves.<br/><br/><strong>Humidity</strong>: impacts the amount of water on the surface\r\nBloom\r\n<p>Start the bloom process by pushing the flower button. From the bud to the mature fruit you'll need lot of sap in stock.</p>\r\nTips\r\n<ul><li>In wet region, develop a network of roots near the surface.</li><li>There are random water tables, far in the ground.</li><li>You can remove the extremity of a branch or a root by clicking on it.</li></ul>\r\nNext\r\n<ul><li>Use seeds to evolve, customize and adapt to extreme conditions</li><li>Manage nutrients</li><li>Defend yourself against parasites</li><li>And so much more!</li></ul>\r\nCrowdfunding\r\n<p>You like the concept? You want more features and cool stuff? Me to!</p>\n<p>Consider support me by giving 1 or 2 dollars.</p>\n<p>You can also just share the game, it helps.</p>\n<p>Warm thanks!</p>", "metacritic": null, "released": "2017-06-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/df5/df5e6157173cc4e3a32e9afe47658975.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Tortue"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}