{"id": 922765, "slug": "in-maze-of-folly-demo", "name": "In Maze Of Folly - Demo", "name_original": "In Maze Of Folly - Demo", "description": "\"Are you fond of mazes? Would you describe yourself as a connoisseur of mazes and labyrinths? Perhaps you have an odd fascination with the long lore of mazes, of myths of decrepit Greek labyrinths filled with Minotaur, or the myriad maze patterns discovered across the world in archeological curiosities.  Do you laugh haughtily at the facile mazes sometimes printed on the back of newspapers, secretly hoping for more, more complexity, more <em>mystery</em>? If so, then you are like me, an appreciator of mazes, and someone of impeccable reason, refined taste, deep intellect, and more than likely are good-looking too. For to have recognized the secret lure of mazes and labyrinths you could be nothing less. You understand plainly that to solve a maze makes you <em>better</em>. Yes...better at solving hard things, better patience, better memory, just <em>better...</em> <br/><br/>And before you here, I have found a <em>better</em> maze too, one sure to test the mightiest of wills. It is wide! It is deep! It is also tall! It is confounding! It is BIG! It full of mystery too, cryptic messages, lost travelers, and <em>otherworldly</em> beings.  So, gird your loins, tighten your belt, keep your wits about you, and enter this maze which has devoured men and minds. Solve it no matter how long it takes or how much it pains you because remember that solving mazes makes you a <em>better</em> person<em>, </em>better than your friends, better than your family, better than all those around you!\"\r\n\n<p>Is what the final note of your professor stated before setting out on an archeological expedition to a supposed ancient labyrinth structure never to return. He went somewhere unreachable by roads and avoided by the local populous, and now the college has tasked you with tracking him down and finding the lost professor. However, finding some old coot may be the last of your worries as now you may be focused solely on getting out of the dizzying labyrinth alive!</p>\n\n<ul><li>Explore an enormous maze, which includes 3d sections, for all its secrets.</li><li>Find a way to escape inside the maze, the desert behind you is too vast to turn back.</li><li>Dodge dangerous obstacles.</li><li>Make notes in your handy journal to help map the maze.</li><li>Will you find out the fate of the professor?</li><li>Will you leave the maze empty handed?</li><li>More importantly, can you avoid a brutal death?</li></ul>\n\n<p><strong>Credits:</strong></p>\n<p>Designer/Developer/SFX/Artist:<br/>Bruugle</p>\n\n<p>Music:</p>\n<p>NextToBlue</p>\n<p>https://soundcloud.com/next-to-blue </p>\n\n<p>*<em>Disclaimer. Developer is not liable for any psychological damages which may result as a consequence of playing this game!</em></p>", "metacritic": null, "released": "2023-02-03", "tba": false, "updated": "2023-02-07T09:37:08", "background_image": "https://media.rawg.io/media/screenshots/e8d/e8d2164df5f8496258ffbe4557175321.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bruugle"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}