{"id": 922873, "slug": "shakedown-rally", "name": "Shakedown Rally", "name_original": "Shakedown Rally", "description": "<p>The new season is starting. Are you ready to shakedown the new car in the French Alps?<br/>\n<br/><br/></p>\n\n\n<p>Made in a custom engine written in C++.</p>\n<p>Note that this is a very very early state of the game, this is not even early access, everything will change in the future. I've hurried to release the game to coincide with Rallye Monte Carlo which is happening right now. I'm planning to add a new stage for each event as it happens in real life.</p>\n<p>Please send feedback as I have no idea how well the game works on other machines!</p>\n\n\n<p>A big chunk of the engine and the game has been written and modeled live on stream, which you can find on twitch. Follow me there as I will stream more in the coming days. You can also find old streams in this YouTube playlist. Aaaand, join my discord if you wish to discuss this game and other projects or just rant about C++.<br/><br/></p>\n\n<p>What it does have and doesn't right now:<br/></p>\n<ul><li>One car</li><li>One track</li><li>Not even any kind of a  menu. Exit on alt+F4</li><li>No gamepad or wheel support. Only keyboard control</li><li>No online high score sharing</li><li>No guarantee your friend you compete against won't mess with the car or track to cheat</li><li>No pacenotes/codriver</li><li>No spectators</li><li>1 chamois</li></ul>\n<p>..But I'm planning to add all of these features over the course of the year.</p>\n<p>SEE DOCUMENTATION ON GITHUB!<br/></p>\n<p>Known issues (apart from the missing features above):</p>\n<ul><li> Alt-tabbing in fullscreen crashes the game. Set fullscreen to 0 in config.ini if you with to alt-tab a lot FIXED!</li><li>Trees have no collisions</li><li>If the car is in neutral gear, sometimes there is a crash when car suddenly flies to infinity FIXED!</li><li>If the game stutters on laptops, make sure you play the game with your dedicated GPU as many times laptops will default to integrated GPU. You can set that in Windows \"Graphics Settings\"</li></ul>\n<p>Default controls:</p>\n<ul><li>W, S, A, D - throttle, brake and steer</li><li>Shift - clutch (not needed when changing gears)</li><li>Enter - toggle between auto and manual gear shifting</li><li>&lt;, &gt; - switch gears</li><li>F - unflips the car and adds 10 seconds</li><li>C - switch camera</li></ul>\n<p>You can set your own controls in config.ini \"bindings\" segment, but the keys map to numbers that you can find on this page.</p>\n<p>CHANGELOG<br/></p>", "metacritic": null, "released": "2023-01-22", "tba": false, "updated": "2023-02-07T10:22:49", "background_image": "https://media.rawg.io/media/screenshots/918/918d93c4b50227fee576881f0d93b7ac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["nothke"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}