{"id": 923086, "slug": "mystic-gate", "name": "Mystic Gate", "name_original": "Mystic Gate", "description": "This roguelike dungeon exploration bullet hell puts your reflexes to the test in random dungeons that keep you guessing!<br/><br/>Dodge, dart and defeat hordes of enemies through procedurally generated dungeons. Collect unique loot as you better your odds of surviving each playthrough with rare items to power-up your character for the next run!<br/><br/>Hordes and powerful bosses look to make your life a living (bullet) hell. Level up and loot where you can in order to make it to the end! Achieve greatness against all odds and grant that elusive final wish!<br/><br/><h3>■Story</h3>A mysterious gate has opened on earth. It is said that those willing to challenge themselves through the tests of the gate will be rewarded with a granted wish. <br/>A mere mortal and his robot companion discover this gate of the gods on their journey together. <br/><br/>This wanderer and his robot friend step up to the challenge, how will they fare against the trials of the gods?!<h3>■Procedurally Generated Dungeons</h3>With changing dungeon layouts, randomly positioned enemies and loot players get a unique &amp; intense experience that’s never the same twice!<h3>■Unique Weapons</h3>Randomized unique weapons that appear in different places through your run-through. Feeling lucky?<h3>■Skills to Strengthen Your Character</h3>Skills appear at random every time! Feeling lucky?<h3>■Permanent Enhancement Elements</h3>Find rare mythic items in-game to beef up your character permanently for your proceeding runs!<h3>■Supports local cooperative play</h3>Local co-op play is supported two players.<br/>Join forces and take on the trial with a friend!", "metacritic": null, "released": "2023-02-09", "tba": false, "updated": "2023-02-10T03:57:51", "background_image": "https://media.rawg.io/media/screenshots/ea6/ea6f8f58a0dc36297ee4c3c6e8fd85c2.jpg", "website": "https://game.zoo.jp/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 403, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zoo"], "genres": ["Action", "Indie"], "publishers": ["Zoo"], "esrb_rating": null}