{"id": 923060, "slug": "a-foreign-world", "name": "A Foreign World", "name_original": "A Foreign World", "description": "Life is hard as a <strong>retired legend</strong> who somehow stumbles over nine women with superpowers that are trying to escape a fucked up world. Relationship problems seem to matter very little when you're pulled back into your old life because some <strong>almighty space villain</strong> challenged you to a duel, and you only have 40 days to prepare.<br/>The wager? Well, he wants those nine women back, and if he feels like it, he might destroy your planet on his way out.<h3>The Cast</h3><br/>Not all of it. There are just too many people to fit into a single image. The MC on the right side is pretty important. Don't ask me for his name. I call him Jack, but you can call him whatever you want.<h3>The Action</h3><br/>Remember the people that didn't fit into the cast image? That's one of them. Her name is Sue, and she also wanted to make an appearance. I told her she could show you some of the lovely action scenes A Foreign World has to offer.<h3>The Action 2</h3><br/>Spoiler. She not only survives but, for some reason, shooting a gun at Aurora has the same effect as throwing a feather against a wall. Maybe it's because Aurora has one of the most disgustingly overpowered abilities there are. Not sure. In the world where those nine women come from, everybody has an ability. All more or less powerful. It's normal, so don't worry about it.<h3>The Legend</h3><br/><br/>\"And in case you are actually from a different universe, I'll need to make sure that you don't make this world your enemy.\" - MC<br/><br/>If an almighty space villain isn't enough to keep you busy, then here is another problem. Try to convince people that the refugees with awe-inspiring magical abilities that one day appeared out of nowhere come in peace and don't need to be annihilated on the spot.<br/><br/>Good luck. I'm rooting for you.<h3>Prologue</h3>https://store.steampowered.com/app/2229110<br/><strong>A Familiar World</strong> gives additional context, explaining what happened before those women came to our earth. The game is mainly a fun time killer where you can finish lewd jigsaw puzzles, but it also features a story element where you get to know more about the lives of these nine women before the events of A Foreign World.", "metacritic": null, "released": "2023-02-06", "tba": false, "updated": "2023-02-10T03:22:16", "background_image": "https://media.rawg.io/media/screenshots/272/27243790cd6ff41b979f0e219a7b355e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 430, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["HighbornTiger"], "genres": ["Indie"], "publishers": ["HighbornTiger"], "esrb_rating": null}