{"id": 923066, "slug": "the-utility-room", "name": "The Utility Room", "name_original": "The Utility Room", "description": "<h3>THE WORLD</h3><br/>You have been traveling for 3 million years across space to the edge of the Universe. In that time, you have become very strange. Your body is... different from how it once was but you are excited nonetheless. Your destination is the entrance to 'The Utility Room', a famous cosmic landmark many know of but never visit. Beyond the door, a supreme being known only as \"Bin man\" oversees the maintenance and heavy lifting required to keep existence stable and temporal. It is rumored that he was personally employed 13.8 billion years ago as the cosmic caretaker. <br/><br/>Whilst 'The Utility Room' includes gameplay elements, it can be best described as more of a Journey. One that takes you across a barren, rocky, and dangerous world. Many of the environments and beings found within the Utility Room are Megalithic. There is no doubt that you will feel very small, dwarfed by the scale of the world as you travel across it. <br/><br/><br/>Most entities that inhabit this world will pay little attention to you. Though It needs to be said that this world is a lot bigger than you are. You will not belong here and nothing will account for your safety.<br/><br/><strong>Those with megalophobia be warned that this game will make you feel very uncomfortable.</strong><h3>Gameplay and Controls</h3><br/>The game has two forms of navigation. Teleport and Jump. Most environments can be teleported through. Some gaps may require you to jump. Other environments may require more inventive solutions. (Smooth Locomotion is available per popular request but experimental. The Utility Room is built for the teleport movement mode.) <br/><br/><br/><br/><br/>If you choose to enter. Don't do anything foolish and don't get spotted. Your chances of leaving are slim. Good Luck!<br/><br/><br/><strong>The Utility Room Steam Game is a reimagining of a 360 Film from 2019 of the same name.</strong>", "metacritic": null, "released": "2023-02-06", "tba": false, "updated": "2023-02-10T03:30:46", "background_image": "https://media.rawg.io/media/screenshots/dc1/dc1f1ccd400139f01a4ce5b8c1d09198.jpg", "website": "https://www.kinglumps.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 321, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KingLumps"], "genres": ["Action", "Adventure"], "publishers": ["KingLumps"], "esrb_rating": null}