{"id": 923147, "slug": "earthworm-jim-collection", "name": "Earthworm Jim Collection", "name_original": "Earthworm Jim Collection", "description": "Earthworm Jim Collection includes:\n\n\n\nEarthworm Jim\n Earthworm Jim found out that Princess What's-Her-Name had been captured and set out to save her. Meanwhile, there's a bounty on Jimmy and plenty of people are in line to take Queen Slug-For-A-Butt up on her offer. Now Jim must make it to the princess and stay clear of Psy-Crow, the intergalactic bounty hunter, until the final battle with Queen Slug-For-A-Butt. To accomplish this, you'll have to use every weapon and ability at your disposal to wriggle your way through dozens of original and just plain weird levels.\n\n\n\n\nEarthworm Jim 2\n From Evil the Cat’s ’Circus of the Scars’ to the planet of Meat, join Jim on a madcap chase across the galaxy. Saving cows, thwarting lawyers and outsmarting Psy-Crow are all in a day’s work for Jim. Are you up to the challenge? Can you handle the awesome new weapons?\n\n\n\n\nEarthworm Jim 3D\n Earthworm Jim, spineless superhero, wriggles back into action as the Groovy Guardian of Goodness in an incredible journey of cheese-curdling proportions. Left unconscious by a massive cow-induced blow to the head and clad in his indestructible, high-tech super suit, Earthworm Jim continues the battle for truth, justice and well aerated soil. He sure is going to need your help to guide him through his 3D fun-house of a brain.\n<br/>\n<p>Languages, features and system requirements may vary between games - please check individual product pages for details.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2023-02-10T05:14:07", "background_image": "https://media.rawg.io/media/screenshots/d30/d3058b753896c128000520033a632af2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shiny Entertainment", "VIS Entertainment"], "genres": [], "publishers": ["Interplay Productions"], "esrb_rating": null}