{"id": 92336, "slug": "kingdoms-and-castles-itch", "name": "Kingdoms and Castles (itch)", "name_original": "Kingdoms and Castles (itch)", "description": "<p>Kingdoms and Castles is a game about growing a kingdom from a tiny hamlet to a sprawling city and imposing castle.<br/></p>\n<p>Your kingdom must survive a living and dangerous world. Do the viking raiders make off with your villagers? Or are they stopped, full of arrows, at the castle gates? Does a dragon torch your granary, your people dying of starvation in the winter, or are you able to turn the beast back? The success of your kingdom depends solely on your skill as a city and castle planner.<br/><br/><strong>CITY DESIGN</strong><br/>Strategically layout your town to improve your peasants' happiness and to attract new residents. Tax them just enough to fund your castle. Make sure your peasants are fed in the winter and healed of plagues. Build churches to keep them from despair and taverns to keep them happy. You can even throw festivals if you've built a town square! Send out wood cutters to collect wood, set up stone quarries to build your castles, and farm the land efficiently so your town can grow and thrive.<br/><br/><br/><br/><br/><strong>FORTIFY AND DEFEND<br/></strong>The new land you're settling is at risk of viking invasion. These raiders seek to kidnap and kill your peasants, steal your resources, and burn your town to the ground. Use a powerful castle building system where castles are constructed using blocks which can be placed anywhere. Towers and walls are dynamically created based on how you stack and arrange them. Archer towers and other weapon emplacements have longer range the higher their tower. Try different layouts to best protect your kingdom and express your glory as a king or queen.</p>\n<p><strong>LIVING WORLD</strong><br/>And it all takes place in a beautiful dynamic world with a stylized procedural cloud system and season cycle from summer to winter. A realistic tree growth algorithm simulates the forests. Depending on your needs, wood cutters can clear cut or responsibly manage your forests.<br/><br/><br/><br/><br/><br/><br/>Kingdoms and Castles is the first Fig funded game to be released. Its crowd funding campaign succeeded with 725% of its goal and was supported by 1,400 backers. Supporters of the game could both pledge and invest during the Fig campaign.</p>", "metacritic": null, "released": "2018-06-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4b0/4b0d33e6be818905d24c8a04ca0809f5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 297, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["LionShield"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}