{"id": 92362, "slug": "lunar-regalia", "name": "Lunar Regalia", "name_original": "Lunar Regalia", "description": "<p><em><strong>NOTE:</strong> The current demo is not indicative of the final product! It's a prototype. Numerous additions and changes will be made as the project continues forward.</em></p>\n<p><strong>OVERVIEW</strong><br/></p>\n<ul><li>Lunar Regalia is an RPG that follows the adventures of a young postal worker named Bit. Who's also a bunny. Originally content with his place in life, Bit is dragged into a whirlwind of events after a single delivery goes awry. As he befriends a colorful cast of characters and faces threats that begin to endanger everything around him, Bit must become the hero the world yearns for him to be. He may be half everyone else's size, but he's got more than enough heart to make up for it!</li></ul>\n<p><strong>WORLD AND CHARACTERS<br/></strong></p>\n<ul><li>Lunar Regalia takes place in a world filled to the brim with fantasy and high adventure. A world of floating islands and emerald-blue oceans, I plan on the game features a wide variety of various locations to explore and enjoy.</li><li>Characters in Lunar Regalia bounce all over the place. The major two however happen to be Kemonos and Anthropomorphic animals. Y'know, for variety's sake.</li><li>There's also plenty of various baddies to beat upside the head, ranging from cute and quirky critters to powerful and ancient creatures of old. Also there's monster girls. I'm pretty sure the kids these days dig that too, yeah?</li></ul>\n<p><strong>GAMEPLAY &amp; TECHNICAL STUFF</strong></p>\n<ul><li>The game is being made in RPG Maker MV, with custom scripts to modify the engine and gameplay.</li><li>Combat takes place in a turn-based sideview battle system ala Final Fantasy.</li><li>Lead a party of 4 unique characters, each with their own specialized skill lists!</li><li>Difficulty that comfortably ramps to a challenging level that tests your ability!<ul><li>Seriously. We're talking like Dragon Quest style leveling. Utilize gear upgrades!</li></ul></li><li>Synthesize items to help Bit in battle! Or out of battle. That works too.</li><li>Explore areas through the use of various items ala Zelda! Blow up walls.</li><li>Did I mention there's a fishing minigame? You can fish. Fish up a Shark Lady, even.<ul><li>Also bosses. Go all Ahab on these fishy fools. </li></ul></li><li>Secret areas, optional bosses, and dungeons built to test and reward your skill! Those are always fun.</li></ul>\n<p>Thank you very much for reading all this!</p>\n<p>If you'd like to help support the game's continued development, how about taking a look at my Patreon? Any pledge is greatly appreciated! Click here!</p>\n<p>If you'd like to keep up to date with more minor/regular updates, you can also follow the game's development on twitter here!</p>", "metacritic": null, "released": "2017-06-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2be/2bea8aaeadf9274cd85d3b8b9ee913a8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LunarRegalia"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}