{"id": 923783, "slug": "how-deep-is-the-dark-water", "name": "How Deep Is the Dark Water?", "name_original": "How Deep Is the Dark Water?", "description": "<p><strong><em>How Deep Is the Dark Water?</em></strong> is an experimental game that imagines a cross-strait war. The player, guided by a fleeing man, slowly wanders through memories and visions constructed by the context of the war and individual experiences. At the same time, the player finds another layer of meaning of war for individuals, cultures and nations by discovering the messages hidden in each scene.</p>\n<p>From historic dwellings to steam trains carrying displaced people, from bomb shelters filled with fear and violence to burned cultural traditions, from confrontations with the ghosts of refugees under the water to the emotional orgy of social media, what is always present in this game is the back of the fleeing man who represents a helpless individual and an object that cannot be possessed or perceived clearly. As a response to the tensions in the world, this work does not directly portray war, but tries to let the player feel the separation, fear, violence and trauma of war in the process of chasing the fleeing man. Water is an important imagery in the work and is almost everywhere. The black seawater carries not only the sound of shelling, but also individual nostalgia, love, hate, and confusion.</p>\n<p><em><strong>How Deep Is the Dark Water?</strong></em> creates an interactive scenario that allows the player to read text (or short poems) hidden in the game space, by using the right mouse button to zoom in on an object, look away, and in some cases, to see the text superimposed on the object. This technique stems from the artist’s long preoccupation and experimentation with reading texts in virtual space, and is in line with the special significance of reading in this work – the texts are the weak repercussions that lurk beneath the surface of historical events.</p>\n<p><em><strong>How Deep Is the Dark Water?</strong></em> is presented in black and white, except for certain things accentuated with color in an attempt to achieve simple yet heavy quality. Minimalist and lacking a clear-cut narrative, the work explores the ability of video games to mediate reading and affect, guiding the player with cinematic interactivity and connecting the act of “wandering” in video games with the individual feelings in the time of war.</p>\n\n<p><strong>Creation Date</strong></p>\n<ul><li>Game version &gt; 2023</li><li>Animation version &gt; 2022</li></ul>\n<p><strong>Credits</strong></p>\n<ul><li>Rhett Tsai (Yuxiao Cai) &gt; Director / 3D Artist / Programmer / Sound Artist</li><li>Yuri Kuzmin &gt; Proofreading</li><li>Mofan Zhai &gt; Title Font Design</li></ul>\n<p><strong>Special Thanks</strong></p>\n<ul><li>Chia-Lin Lee</li><li>Dongting Fu</li><li>Guangli Liu</li><li>Jiahui Wang</li><li>Lauren Moffatt</li><li>Lihao Shao</li><li>Wenjing Shen</li><li>Zhan Gao</li><li>Zhipeng Wang</li></ul>\n<p>Full sounds and assets credits inside the game.</p>\n\n<p><strong>Recommended System Requirements</strong>\n</p>\n<ul><li>OS: Windows 10 64-bit \r\n</li><li>Graphic Card: NVIDIA GeForce GTX 1080\r\n</li><li>CPU: Intel(R) Core(TM) i7-9700K CPU @ 3.60GHz\r\n</li><li>RAM: 16GB</li></ul>\n<p><strong>Matters Needing Attention </strong></p>\n<ul><li>Please make sure the game folder is placed under the <strong>Latin-letters-only</strong> path, otherwise some parts of the game content may be lost</li><li>Play in dark environments for best experience</li><li>Do not use this work for exhibition or commercial use without permission</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2023-02-10T10:03:40", "background_image": "https://media.rawg.io/media/screenshots/5d3/5d36bf00e50b0f29242a23a75e50a645.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rhett Tsai"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}