{"id": 923845, "slug": "neon-nights-delivery", "name": "Neon Nights Delivery", "name_original": "Neon Nights Delivery", "description": "Overview\r\n<p>The game is currently still in development...</p>\n<p>\"Neon Nights Delivery\" is a thrilling 2D platformer set in a cyberpunk world. As a delivery robot, you must deliver body parts while avoiding police detection and threat. With fast-paced gameplay, stunning pixel art visuals, and a pulse-pounding soundtrack, this game will challenge you to navigate the neon-lit streets and use your skills and strategy to succeed. Experience the main campaign and side missions, collectibles, upgrades, and more in this adrenaline-fueled adventure. Get ready to outrun the law in this high-stakes delivery run.</p>\n\r\nCore Mechanics\r\n<p>As the delivery robot in \"Neon Nights Delivery,\" you are equipped with agility and cutting-edge technology to carry out your missions and stay ahead of the law. Run, jump, dash, and activate your shields to dodge missiles and evade radar detection while delivering valuable body parts to buyers. Acquire hacked data as currency to upgrade your gadgets at mechanic shops and recharge your energy by clinging to neon signs scattered throughout the city. Can you outwit the police and make it to your next destination?</p>\n\n\n\r\nEnemies\r\n<p>The police are hot on your heels in \"Neon Nights Delivery.\" With advanced surveillance technology, they have deployed a variety of drones to track and eliminate you. Be wary of alert drones that scan the area for your presence, as they will attract the attention of attack drones and homing missiles. Stay sharp, as one misstep could mean the end of your delivery run.</p>\n\r\nExplore\r\n<p>In \"Neon Nights Delivery\" the city is yours to explore as you make deliveries. Each area presents new challenges and opportunities, requiring different sets of parkour skills to navigate with ease. From scaling towering buildings to traversing treacherous alleyways, every area offers unique rewards for your daring exploits. So gear up and get ready to take on the city in this pulse-pounding platformer.</p>", "metacritic": null, "released": "2023-02-08", "tba": false, "updated": "2023-02-10T10:30:39", "background_image": "https://media.rawg.io/media/screenshots/9f4/9f4ddb42457ecdabd1682c4ab5a4ef80.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["robertli_games"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}