{"id": 923892, "slug": "keys-itch-epic-gamor", "name": "Keys (itch) (epic gamor)", "name_original": "Keys (itch) (epic gamor)", "description": "<p>Keys</p>\n<p>The Game.</p>\n<p>Windows is weird and gives the unrecognized app thing, super annoying and I don't want to pay hundreds of dollars. I pinky promise I didn't install malware.</p>\n<p>Press more info, and press run anyway. It'll go away after that.</p>\n<p>A little challenge for myself but wouldn't mind if you played.</p>\n<p>Collect the Keys in the four corners of the map, afterwards, go inside of the portal in the middle. </p>\n<p><strong>A few tips, </strong></p>\n<p>Because the Keys are always in the <strong>corners</strong>, that means it's going to be at the very top right or very bottom left, etc. etc. (in other words, if the map is 1000 units, the four corners would be (1000, 0) (0, 0) (1000, 1000) and (0, 1000)). And the portal is in the middle. (With the same logic of 1000 units, the portal would be at (500, 500))</p>\n<p>To ride bears, you need to give them a friendship bracelet.</p>\n<p>When you hear chirping, there might be a package dropped. Look around for it and pick it up. Inside of it is a crafting recipe, that's how you unlock them.</p>\n<p>You can climb trees, get near them and hold space.</p>\n<p>You NEED a pickaxe for the caves.</p>\n<p>The ends of the cave have a higher chance of having crystals than other places.</p>\n<p>Crystal progress isn't saved if you close the game. But crystals aren't hard to get.</p>\n<p>The best way to get items is not to run as fast as you can, but walk, and look around. It's better to be in the Deforested biome, or the Flatlands, to see them better. The worst places you can be is in the bottom of a tight valley in the Mountains, running in a straight line as fast as you can.</p>\n\n<p>Have fun!<br/></p>", "metacritic": null, "released": "2023-02-08", "tba": false, "updated": "2023-02-10T10:51:23", "background_image": "https://media.rawg.io/media/screenshots/e64/e6403950249e24f5a76f21a75ec1083c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["epic gamor"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}