{"id": 923919, "slug": "lost-bad-cybermemories", "name": "Lost Bad Cybermemories", "name_original": "Lost Bad Cybermemories", "description": "<p>Lost Bad Cybermemories is a game about a cyborg who wants to delete his bad memories about wars and suffers that he passed them. For this purpose, he will find eletronic components in the laboratory. They are useful to capture the bad memories in his mind. There are a limited quantity of this items but the necessary for his objective. In this lab, there are traps protect them because the cyborg owner don't want his machine clean. He wants him to ready to other wars. The cyborg want to come back his good roots as a cyborg made in factory for the first time but saving his good memories in his mechanical heart.</p>\n<p>Lost Cybermemories é um jogo que trata sobre um ciborgue que deseja apagar suas memórias ruins sobre guerras e sofrimentos que ele passou. Para isso, ele encontrará componentes eletrônicos no laboratório. Eles são úteis para pegar essas memórias de sua mente. Há uma quantidade limitada destes itens, mas é o suficiente para o que ele deseja. No laboratório, há armadilhas protegendo-os porque o dono do ciborgue quer deixá-lo como está para estar pronto a outras guerras. O ciborgue deseja voltar as suas raízes boas como era quando estava em fábrica pela primeira vez, mas só com suas boas memórias em seu coração mecânico.</p>\n<p>Site: https://globalgamejam.org/2023/games/lost-bad-cybermemories-1<br/><br/></p>", "metacritic": null, "released": "2023-02-08", "tba": false, "updated": "2023-02-10T11:01:59", "background_image": "https://media.rawg.io/media/screenshots/bce/bcecfdd121a1850ba336af44862dc93e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fábrica de Jogos"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}