{"id": 923942, "slug": "jacks-world-adventure", "name": "Jack's World Adventure", "name_original": "Jack's World Adventure", "description": "<p>Once upon a time, there was a young adventurer named Jack. He had always dreamed of exploring the world and discovering hidden treasures. One day, he set out on a journey to fulfill his dream. During his journey, visiting many more places and met many more people. He faced many challenges and overcame many obstacles, but through it all, he never gave up on his dream. He had many adventures, but he always remembered the jungle, the lost city, the mountain and the village as the most exciting and rewarding experiences of his journey.</p>\n<p><strong>Mechanics</strong></p>\n<p>- Inventory: The player can view their inventory by typing “i/inventory”, they can further examine how much money they have through “x/examine gold.”</p>\n<p>- Currency: Gold is the currency in the game that can be used in the shop. The player has 50 Golds in the beginning of the game. The gold will be decreased after purchases.</p>\n<p>- Shop: The shop is located in the west of the Town. The player is able to buy weapons, armor, and health potion in the shop.</p>\n<p>- Player Status: Player status (eg. health) can be changed after being attacked by an enemy, or consume the health potion.</p>\n<p>The player inventory is being updated throughout the gameplay. Furthermore, the player status can be changed by wearing armor (reduce enemy attack damage), or using the long sword instead of the dagger (increase self attack damage).</p>", "metacritic": null, "released": "2023-02-07", "tba": false, "updated": "2023-02-10T11:12:04", "background_image": "https://media.rawg.io/media/screenshots/e48/e483f5db7d7f850d0f5bf64445bc319f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Gelzone Unsas"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}