{"id": 924009, "slug": "cave-escape-c64-by-josip-retro-bits", "name": "CAVE ESCAPE (C64) by Josip Retro Bits", "name_original": "CAVE ESCAPE (C64) by Josip Retro Bits", "description": "<p>CAVE ESCAPE</p>\n<p>=======</p>\n<p>Written by Josip Retro Bits for the BASIC 10Liner Contest 2023.</p>\n<p>Language: Commodore 64 Basic v2</p>\n<p>Category: PUR-80</p>\n\n<p>The story</p>\n<p>----</p>\n<p>Your ship is trapped inside a large cave on an unknown planet.</p>\n<p>You need to escape from the cave while the alien ship is blocking your way. </p>\n<p>There is not much time left until the bomb that you set up goes off!</p>\n\n<p>Controls and play</p>\n<p>--------</p>\n<p>Press any key to move your ship forward. Keep eye on the alien ship, he is making it harder to progress forward.</p>\n<p>If you pass him, he will follow you and move in front of you.</p>\n<p>Reach the end of the cave before you run out of time.</p>\n<p>p.s. The game has a cheat that can help you with the time limitation :)</p>\n\n<p>Line by line code overview</p>\n<p>----------------</p>\n<p>- Line 0:</p>\n<p> - Set the text colour to white and clear the screen </p>\n<p> - Initialisation of variables used in the game</p>\n<p>- Line 1:</p>\n<p> - Setting screen and border colours</p>\n<p> - Drawing the cave</p>\n<p>- Line 2:</p>\n<p> - Display a player on the screen</p>\n<p> - Initialise additional variables</p>\n<p> - Jumping to line 4</p>\n<p>- Line 3:</p>\n<p> - Move the enemy ship for two steps forward (2 columns)</p>\n<p> - Reduce the distance that enemy ship travels vertically every 4 columns</p>\n<p>- Line 4:</p>\n<p> - Recalculate the enemy's new position when vertical distance is reduced</p>\n<p> - Check if the enemy crosses the end of the screen (passes the last column), if so the game ends</p>\n<p>- Line 5:</p>\n<p> - Calculate the enemy's new vertical position</p>\n<p> - Display the enemy in the new position, clear the old position</p>\n<p> - Check if the enemy hit the player ship, if so jump to line 9</p>\n<p>- Line 6:</p>\n<p> - Switch enemy direction when it hits cave borders</p>\n<p> - Read the keyboard</p>\n<p> - If the key is not pressed jump to line 8</p>\n<p> - If the key is pressed then increment player position by 1. (move forward)</p>\n<p>- Line 7:</p>\n<p> - Display the player ship new position on the screen</p>\n<p> - Check if the player ship hit the enemy, if so jump to line 9</p>\n<p>- Line 8:</p>\n<p> - Check if the player ship reached the end of the screen (last column), if so jump to line 9</p>\n<p> - If the player ship new position is bigger than the enemy position, jump to line 3</p>\n<p> - Increment timer and display on the screen</p>\n<p> - If we did not reach the time limit jump to line 4</p>\n<p> - Else continue to line 9</p>\n<p>- Line 9:</p>\n<p> - Write the score on the screen (the number of steps the player managed to cross)</p>\n<p> - Write \"game over\"</p>\n<p> - If the player managed to reach the end of the cave, delete \"over\" and print \"end\"</p>\n<p>Cheat</p>\n<p>----------------</p>\n<p>While the cave is drawn on the screen, you can press any key an even number of times.</p>\n<p>This will fill the keyboard buffer and you will progress forward without hitting the enemy once the game begins.</p>\n<p>This can save you a lot of time in the game :)</p>", "metacritic": null, "released": "2023-02-07", "tba": false, "updated": "2023-02-10T11:40:00", "background_image": "https://media.rawg.io/media/screenshots/969/96971a3774129da41a30e0e54af9e5b1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BASIC 10Liner"], "genres": ["Action"], "publishers": [], "esrb_rating": null}