{"id": 924180, "slug": "qbots", "name": "QBots", "name_original": "QBots", "description": "<p>GDevelop GameJam#3<br/>Realtime combat dungeon crawler in a sci-fi setting. (Alpha version, not finished, barely playable, not winnable, treat it as a proof of concept,<br/> soon to be fixed and awesome, keep in touch!)<br/>here is Liluo.io link to play in browser<br/>https://liluo.io/games/7fad9212-baaf-4fe0-b8a1-4500872cf2c2<br/>w, s, a, d --&gt; move</p>\n<p>q,e --&gt; turn</p>\n<p>Up Arrow - Attack</p>\n<p>Down Arrow --&gt; alternative attack (not fully functional)<br/></p>\n<p>Tab --&gt; Map toggle<br/></p>\n<p>UpArrow+s --&gt; recharge/transfer energy to the Girl (not fully functional)</p>\n<p>Project Made using Free and Open Source no-code game engine</p>\n<p>Gdevelop, for 3rd GameJam organized by GDevelop Team. in 2023<br/>Ity took 9 days to make this version of the game, from concept to this.<br/>This is my first game. I think It's not that bad for a first attempt.<br/>I just didnt have enough time for my skills to manage to smooth all the seams and make everything work. Even If I cut down the scope, it was pretty big. And I chose to do my own music graphics and sounds/voice... That maybe was bad decision, I am not sure though<br/>Any constructive feedback is welcome. What do you think?<br/>Do you like the concept? would you like it to be perfected?<br/>Let me know.<br/><br/></p><p>I didn't make it in time to establish the story this is a synopsis:The Evil QBot wants Judy to become his woman. But Judy refuses, because she loves Jack (light blue color, main character)</p>\n<p>Angry Qbot crushes Judy into pieces scattered all over The Qube. You have to put Judy back together and use golden energy to connect her pieces. Qbot's Dark blue minions search for you and try to put you down in the name of the great Qbot, so you have to deal with them. But that is not over, because even if you will manage to put Judy together QBot still will stay in your way and will not allow your love to happen.</p>\n<p>Story will be included in next update! Please do not miss it :)</p><br/>\n<p>3D Models originally designed by Drazen on Sketchfab.<br/>Game designed, coded, animated and audio by LinuxRant in Gdevelop.<br/>Music done with free and open source LMMS<br/>Graphics with Blender and Krita,<br/><br/>Special Thanks to Rami(Tulenvaki) for help with Gdevelop.<br/>And to people on Discord who didn't treat me like an alien, although I think  I am one.<br/></p>", "metacritic": null, "released": "2023-02-05", "tba": false, "updated": "2023-02-10T13:02:00", "background_image": "https://media.rawg.io/media/screenshots/a5d/a5dd1a1a51366f1a0b169ceb7209f7fa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LinuxRant"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}