{"id": 9242, "slug": "turbolab-pursuit", "name": "Turbolab Pursuit", "name_original": "Turbolab Pursuit", "description": "Download the @FreeAppADay.com Store App and wish for more top rated apps like Turbolab Pursuit to featured on FAAD!<br/><br/>The most white-knuckle pursuit in the App Store<br/><br/>In a world that has only just discovered automobiles, a mad scientist has been busy atop his tower, putting the finishing touches to his all-new prototype vehicle. But the local mafia would love to get their hands on his revolutionary invention...<br/><br/>Turbolab Pursuit is a 2D game featuring a subtle cross between a runner and a shoot &amp;#39;em up. Use Professor West&amp;#39;s wacky invention to rocket down the hills and escape the clutches of the enemies hot on your heels.<br/><br/>Mod your vehicle with the most devastating and outlandish weapons, like kung fu sheep, melon cannons and tortoise-launchers, and head off on a crazy chase that will take you into the clouds.<br/><br/>Leave your pursuers for dust by pimping your ride with an increasingly insane range of parts, like an aircraft aileron, a tractor engine, a wrecking ball, and so much more.<br/><br/>Treat Professor West to a fun makeover with a selection of headgear, outfits and hairstyles that will keep you off the radar of any paparazzi with an overly close interest in your invention.<br/><br/>With its cartoon graphics and simple controls, Turbolab Pursuit will provide hours of gaming fun, while giving your reflexes a severe workout.<br/><br/>Fasten your seatbelts and get ready for a race that you won&amp;#39;t forget in a hurry!<br/><br/>Features :<br/><br/>- Over 4,000 customization combos<br/>- Mod your ride with crazy, devastating weapons<br/>- Upgrade your vehicle&amp;#39;s stats<br/>- Let your imagination run wild and customize your nutty professor<br/>- Collect countless power-ups along the way<br/>- Randomly-generated levels<br/>- Game Center achievements<br/>- Universal app<br/>- iPhone 5 Retina display<br/><br/>CURIOUS? More info on: <br/>bulkypix.com<br/>facebook.com/Bulkypix<br/>twitter.com/Bulkypix<br/>youtube.com/Bulkypix", "metacritic": null, "released": "2013-02-12", "tba": false, "updated": "2019-10-22T14:30:22", "background_image": "https://media.rawg.io/media/screenshots/43f/43fec68a3966b8c232db17e856e5c7fc.jpeg", "website": "http://www.bulkypix.com/game/turbolab-pursuit", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bulkypix"], "genres": ["Action", "Racing"], "publishers": [], "esrb_rating": "Everyone 10+"}