{"id": 924267, "slug": "steamfall-demo", "name": "SteamFall - Demo", "name_original": "SteamFall - Demo", "description": "<p>Step into the world of steampunk and fend off hordes of mechanical monsters in this thrilling survival game. Immerse yourself in a beautifully crafted steampunk environment as you battle your way through waves of enemies. This demo showcases a wealth of features, including the mystery box, buyable perks, and much more, reminiscent of popular games like Call of Duty Zombies. Keep in mind that this is still a work in progress and your feedback is crucial to its development. Help shape the future of this exciting game and enjoy the steampunk survival experience to the fullest! </p>\n<p>I have been working on a comic book series for some time and I am now excited to announce its transformation into a video game. With the goal of expanding the series into a full-fledged story mode, I am eager to see if there is enough interest to bring my vision to life. Join me on this journey as I bring the pages of my comic book to life.</p>\n<p>After being dormant for an extended period, I successfully revitalized the project from my portable hard drive. I have a comprehensive list of features to incorporate. Also, this project is fully compatible and works just fine on Steam and LAN networking to enjoy with your friends!</p>\n<p><strong><strong>NOTE: The game had a change of name due to licensing going forward it will be called SteamFall </strong></strong></p>\n\n\n\n\n<strong>\n<p><strong>\n</strong></p>\n</strong>", "metacritic": null, "released": "2023-02-07", "tba": false, "updated": "2023-02-10T13:41:09", "background_image": "https://media.rawg.io/media/screenshots/194/1942fb2076c3a6e8086f398d2707fd34.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["StormRendStudio"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}