{"id": 924368, "slug": "grapes-and-bacon", "name": "Grapes and Bacon", "name_original": "Grapes and Bacon", "description": "<p>Follow Lily Grapes and Gordon Bacon, special investigators, on an adventure to restore time to its proper order. Or, at least, try to.</p>\n<p><strong>Warning:</strong> It takes a while to load. Please, be patient.<br/></p>\n<p>This is my entry for the Narrative Driven Jam #11.  The theme this time was “Anachronism”. I also used the optional themes of “Besties” and “Deus Ex Machina”, somehow.</p>\n<p>To be honest, i was more excited for the “Beasties” theme because i had these two characters “in the pipeline” for almost three years, now, and i saw this as my chance to finally bring them to life.</p>\n<p>This time i tried to stay away from the line-art style of my previously two entries in the narrative-driven jam. I actually wanted to draw something using only plain-filled shapes, much like <em>Once Upon the Jester</em> does.</p>\n<p>Alas, i am not an artist and could not do anything that “pops” without outlines. And even with that is not very good.</p>\n<p>Like always, i had to rush things in order to reach the deadline, so the game has <strong>a lot less</strong> content than i initially planned, but at i think it is entertaining nonetheless.  Even if only for five minutes.<br/></p>\r\nControls\r\n<p>Everything is done with the mouse. This time i use different cursors to show you what you can do with all the items and characters on screen.</p>\r\nAssets\r\n<p>I will properly credit each music and sound effect i used here, once the jam voting is over; i do not want to miss the deadline, and also do not want people thinking i’ve uploaded a new version.<br/></p>\n<p>The music, as always, comes from Kevin MacLeod from https://incompetech.com/.<br/></p>", "metacritic": null, "released": "2023-02-07", "tba": false, "updated": "2023-02-10T14:25:28", "background_image": "https://media.rawg.io/media/screenshots/43c/43c4381da122b3774d38a976d574ff9e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Perita"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}