{"id": 924304, "slug": "excalibur-experiment-round-6-seed-and-egg", "name": "Excalibur Experiment Round 6- Seed and Egg", "name_original": "Excalibur Experiment Round 6- Seed and Egg", "description": "<p>It's no holds barred for round 6! Cerosse is now forced to climb the Excalibur Station itself to reach the final arena- but he's not the only one. He finds himself facing off against the wizard Valaric Gallard in a race to the top and a fight for their lives!<br/></p>\n<p>Like before, here's some general warning and instructions for the visual novel:\r\n</p>\n<p>-Scene Selection: If you exit the game and return to the title screen, you can hop back in from the start of any given scene.  Useful if you missed a panel and want to start over or are trying to skip to a specific point in the round.\r\n</p>\n<p>-The game might take a while to load on it's first run. If nothing is happening once you start the game and start clicking, just give it a minute or so to finish loading. This is especially pertinent in this round, as many of the scenes have a lot of panels to load in them! Press the left mouse button to progress the story and speed up text. Note that there is, due to the limitations of the program used to create this, NO back button, so be careful!  You can save and load the file, however.  Furthermore, you can press the space bar to hide the text box and see the art behind it properly. Press space again to bring it back. If the game is bigger than your screen dimensions, either zoom out your screen, or there is a \"full screen\" button to the bottom right. \r\n</p>\n<p>-This round has a plenty of swearing, violence, mild gore, and upsetting scenarios. Not for kids!\r\n</p>\n<p>-All characters that aren't mine are used with permission. \r\n</p>\n<p>Valaric Gallard is owned by Arkeis</p>\n<p>Chassi by NebulousHarmony\r\n</p>\n<p>Crosseyes by @UnstableReact0r</p>\n<p>-Thank you to Medina, and Papsi Cola for letting me throw spaghetti at the wall in their general direction when it came to script writing.</p>\n<p>-Total Number of Images: 406</p>\n<p>-Bonus Challenges included: Unwelcome Guest, Solidarity, Airborne Plague</p>", "metacritic": null, "released": "2023-02-07", "tba": false, "updated": "2023-02-10T13:58:16", "background_image": "https://media.rawg.io/media/screenshots/866/866149572dcfbcfd1e08b14478594293.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Fallingfeather"], "genres": [], "publishers": [], "esrb_rating": null}