{"id": 92430, "slug": "bob-picross-the-joy-of-painting-2", "name": "Bob PicRoss: The Joy of Painting 2", "name_original": "Bob PicRoss: The Joy of Painting 2", "description": "<p>Solve picross puzzles inspired by the show <em>The Joy of Painting with Bob Ross</em> with puzzle rules derived from <em>Hungry Cat</em>! Bob Ross's motivational speaking will help you complete the interesting art pieces waiting you.</p>\n<p>Created for Awful Summer Jam 2018.</p>\r\nHow to Play\r\n<p>Click on a canvas to open up one of the puzzles in the game. Then, click on one of the four quadrants of the puzzle to start painting!</p>\n<p>Your colors are located in the bottom left corner on the art palette. Switch between colors by clicking on a new one.</p>\n<p>There are numbers on the top and left side of the 5x5 grid. Each number represents how many of a color there is in that row or column. If the number has a circle behind it, that color is lined up together in the row or column. Otherwise, the color is broken up by other color(s)!</p>\n<p>Click to set a color to the grid. You can also hold down the mouse button and drag to color multiple squares.</p>\n<p>When you solve the small piece of the puzzle, click on the back arrow to go back to the full puzzle and select another quadrant to paint. Once you've completed all four quadrants, you'll have a beautiful, scenic pixel painting. Congratulations!</p>\r\nCredits\r\n<p>@goofanader - artist, programmer<br/>@klades - programmer<br/>\"GreenSalon\", \"Dayside\" - Yubatake from OpenGameArt.org</p>\r\nTroubleshooting\r\n<p>If you have any issues, please comment below or message goofanader on Twitter. Thanks so much!</p>", "metacritic": null, "released": "2018-07-31", "tba": false, "updated": "2019-08-28T23:26:02", "background_image": "https://media.rawg.io/media/screenshots/1ce/1ceaf60e9c5f6620d9248126143bb26e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["goofanader", "klades"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}