{"id": 924480, "slug": "the-ashwood-files-ohcool", "name": "The Ashwood Files (OhCool)", "name_original": "The Ashwood Files (OhCool)", "description": "<p><strong>The Ashwood Files</strong> ist ein Point and Click Adventure, in dem Spieler die Rolle des jungen Journalisten Greyson Ashwood einnehmen und sich, nachdem sich besorgniserregende Informationen bestätigen, auf die Reise begeben, um mehr über einen mysteriösen und gefährlichen Kult zu erfahren.</p>\n<p>Während Greyson Ashwood, ein junger Journalist aus London, seinem Tagwerk nachgeht, erhält er beunruhigende Informationen im Zusammenhang mit einer Entführung. Nach ein wenig Recherche wird ihm klar, dass er gerade auf einen sehr viel weitreichenderen Fall gestossen ist, in den ein scheinbar weltweit agierender Kult verwickelt ist. Noch besteht jedoch ganz klar die Möglichkeit, eine Entführte unversehrt wieder zu finden. Als Greyson die Sache mit seinem Redakteur bespricht, erkennt er, dass er sich dieser Sache selbst annehmen muss.</p>\n<p>Erlebe als Greyson Ashwood, wie sich ein zunächst scheinbar einfacher Fall schnell zu etwas sehr großem entwickelt. Erkunde die Schauplätze der Story und sammle Informationen. Rede mit den Leuten, die Greyson trifft, um noch mehr  herauszufinden. Recherchiere mit Hilfe des Laptops in Greysons Wohnung und kombiniere dein Wissen. So kommst du der Wahrheit näher und erfährst, wo es Greyson hin verschlägt...</p>\n<p><strong>Gameplay:</strong> </p>\n<br/>\n\n\n<p><strong>Good Soup Entertainment</strong><br/></p>\n<p><strong>[ Oliver Kühl </strong>(OhCool)<strong> ] </strong>Game Designer | Team Lead</p>\n<p><em>Game Design, Narrative Design, Level Design, Producing, UI Design, QA, PR, Dokumentation, Voiceacting NPC00, NPC03, NPC04, NPC07</em></p>\n<p><strong>[ Barbara Kovacs ]</strong> Game Designer</p>\n<p><em>Game Design, Design der Rätsel/Puzzle, Dokumentation, UI Design, Charakter Design, QA, Voiceacting NPC01</em></p>\n<p><strong>[ Lea Röchert ] </strong>Digital Artist</p>\n<p><em>Environment Art, Charakter Art, Charakter Animationen, </em><em>QA, </em><br/></p>\n<p><strong>[ Niklas Damovsky ] </strong>Digital Artist</p>\n<p><em>Environment Art, Items/Objekts Art, Voiceacting NPC02, NPC05</em></p>\n<p><strong>[ Keanu Carlo ]</strong> Game Programmer</p>\n<p>Development, Code, Versionskontrolle, Voiceacting Protagonist, SFX Design</p>\n<p><strong>[ Rafael Coskun ]</strong> Digital Artist</p>\n<p>Idee, Charakter Konzept Protagonist<br/></p>", "metacritic": null, "released": "2023-02-06", "tba": false, "updated": "2023-02-10T15:14:46", "background_image": "https://media.rawg.io/media/screenshots/2a9/2a9f0a028801e600d11368f4617abd24.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OhCool"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}