{"id": 924611, "slug": "roots-never-rot", "name": "Roots Never Rot", "name_original": "Roots Never Rot", "description": "<p><strong>N.B.:</strong> The browser version of the game is mobile-friendly (tested only with Chrome).</p>\n<p><strong>How to play:</strong> the goal of the game is to push your roots deeper in the soil by influencing their behavior thanks to the effects of the objects in your inventory. Drag and drop the items from the inventory to place them in the levels, but be careful because there are some elements already placed inside, and they can interfere with your strategy. Some items attract, while others repel the roots, it is up to you to discover how things work in this weird world. Oh, you can also destroy some obstacles with the pickaxe! Thank you for playing &lt;3<br/></p>\n<p>Is it possible to move on when you are linked to the soil by a dense tangle of roots? Sure, you can't always decide the path your roots will take, or where they’ll guide you, but one thing is certain: the trace they leave will never rot. Roots Never Rot is a poetic puzzle game about the life of an entity with their heart and mind rooted in a ground made of symbols. Players will influence the descending path of the roots by placing items in the ground and trying to reach ideas scattered around. Trying to see through the mess of knots, probabilities and coincidences.<br/></p>\n<p><strong>Made during Global Game Jam 2023 - Theme: Roots - GGJ Page<br/></strong></p>\n<p><strong>Credits:<br/></strong></p>\n<p><strong>Salvo Liotta (FeboGamedeveloper)</strong> - Code, Game Design, Unity Magician, Level Design [the mind]</p>\n<p><strong>Andreas Polyviou (sundaysunking)</strong> - Game Art, Design, Graphics, Drawings, Game Design [the corolla]</p>\n<p><strong>Francesco Frassineti (Bhik95)</strong> - Code, Game Design [the stem]</p>\n<p><strong>Gabriele Raimondi (illud)</strong> - Game Design, Narrative Design/Writing, Audio, Level Design, Communication [the leaves]</p>", "metacritic": null, "released": "2023-02-06", "tba": false, "updated": "2023-02-10T16:17:47", "background_image": "https://media.rawg.io/media/screenshots/003/003e7f662a7f659b2de2ded89c940693.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Android", "macOS", "PC"], "developers": ["Illud", "Bhik95", "FeboGamedeveloper"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}