{"id": 924605, "slug": "origenes", "name": "Orígenes", "name_original": "Orígenes", "description": "<p>This is a game we (GlimpG and pr00thmatic) did for the #GGJ2023 ( https://globalgamejam.org/2023/games/origenes-4 )</p>\n<p>From GlimpG's wild imagination:</p>\n<p>As an orphan, you set yourself to discover the identity of your father, an origin that is, by now, long forgotten... buried, even.</p>\n<p>Where better to start looking for the truth than in the City Library? During the '70s in South America, multiple military coups took place. During these regimes, thousands of everyday people, protesters, workers and university students, were killed. Some of them, specially the most notorious political dissidents, disappeared without a trace. In many countries, such as ours, Bolivia and Guatemala, still don't share the records of what occurred during those years, and as such, the fate of thousands of fathers, mothers, daughters and sons are unknown. </p>\n<p>They tried to root out our identities, but without intending it, those actions rooted our beliefs and shaped future leaves and lives.</p>\r\nWALKTHROUGH\r\n<p>\n</p>\n<p><strong>WARNING: Spoilers ahead</strong></p>\n<p>The building has 2 floors, 1 basement and a ground level.</p>\n<p>1- Go to the shelf with the index cards in the first floor and enter the initials of the protagonist name, inspect his id card to find out his name.</p>\n<p>2- Go to the library window located at the left side of the index cards shelf to redeem a book using the index card in your inventory (you need to be holding the index card while clicking at the inside of the library window)</p>\n<p>3- The book you redeemed dropped some kind of powder, check the floor. To grab it you'll need a piece of paper that you'll find in the 2nd floor</p>\n<p>4- Use the enveloped powder in the coffee machine at the end of the basement room (don't use it with the glass, use it with the coffee machine), and then, click the coffee machine so it expends a cup of coffee.</p>\n<p>5- Grab the cup of coffee and offer it at the altar (the table with the bowl of clay and candles at the ground level floor)</p>", "metacritic": null, "released": "2023-02-06", "tba": false, "updated": "2023-02-10T16:15:35", "background_image": "https://media.rawg.io/media/screenshots/e9e/e9ed16eb3799ae3272d945d25a156f97.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["pr00thmatic"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}