{"id": 924749, "slug": "when-the-wind-knocks-feng-qiao-men-shi-jian", "name": "When the Wind Knocks 风敲门事件", "name_original": "When the Wind Knocks 风敲门事件", "description": "<p>语言包含中英文。</p>\n<p>中文版有部分UI是英文。\r\n  </p>\n<p>Languages: Chinese/English\r\n  </p>\n<p> \r\n  </p>\n<p>       你是在H城生活的一个普通人。有一天你十年未见过面的高中同学突然约你在咖啡厅谈谈。她是个懦弱的人，外貌凄惨如同死者，当初在学校里备受欺凌。出于好奇你去和她见面了，她提起了当年毁掉学校名誉的一起自杀案。谨慎选择你要说的话，也许她会告诉你那起案件的真相。\r\n  </p>\n<p>       You are an ordinary girl living in City H. One day, an old high school classmate suddenly invites you to a café for a talk. It has been ten years since the last time you met. She was a weak person, as ugly as death, and was bullied a lot by that time. You go to meet her out of curiosity, and she mentions a suicide case which ruined the reputation of that high school. Carefully choose what you are going to say and maybe she will tell you the truth of that case.\r\n  </p>\n\n<p>游戏包括两个不同的结局和一个隐藏对话。游戏中的每个选项都会影响最终结局和能否解锁隐藏内容。</p>\n<p>The game includes two different endings and a hidden dialogue. Every choice you make will affect the ending and whether you can unlock the hidden dialogue.</p>\n<p> \r\n  </p>\n<p>注意事项：本作为恐怖游戏，部分剧情和描写可能引起不适。\r\n  </p>\n<p>                          16岁以上玩家可以游玩。\r\n  </p>\n<p>Warning: This is a horror game and some of the plot and description could cause discomfort.\r\n  </p>\n<p>                      16+ for certain parts of depiction of killing\r\n  </p>\n<p> \r\n  </p>\n<p>       文本量：2万字左右。\r\n  </p>\n<p>       Text Volume: about 20 thousand Chinese characters (meaning pretty short)\r\n  </p>\n<p> \r\n  </p>\n<p>       本游戏免费，如果喜欢请留下评论，这是对我最大的支持。\r\n  </p>\n<p>       This is a free game. If you like it, please leave a comment. That will be great support for me.\r\n  </p>\n<p> \r\n  </p>\n<p>       我对游戏开发了解得很少，如果在游玩中出现任何问题可以在评论区留言，我尽量解决。\r\n  </p>\n<p>       I am new in game development. If any problem occurs, please leave a comment and I will try my best to solve it. \r\n</p>", "metacritic": null, "released": "2023-02-06", "tba": false, "updated": "2023-02-10T17:20:35", "background_image": "https://media.rawg.io/media/screenshots/437/4370cbe19d4bd3b8475d88ed33ce2fe5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wicky_Yu"], "genres": [], "publishers": [], "esrb_rating": null}