{"id": 924830, "slug": "crawlitaire", "name": "Crawlitaire", "name_original": "Crawlitaire", "description": "<p>\n</p>\n<p>Crawlitaire is a “minimalist” dungeon crawler that requires merely one player and a standard deck of playing cards. You lead a party of four adventurers on a quest to retrieve four magical rings. Setup is easy, requiring no map, character, or monster creation. They are generated as you play the game.</p>\n<p>Crawlitaire v5.0</p>\n<p>(Inspired by Hezzop)</p>\n<p>“Minimalist”\r\n</p>\n<p>Standard Deck Playing Card\r\n</p>\n<p>Dungeon Crawl\r\n</p>\n<p>Dedicated to EARS\r\n</p>\n<p>Documentation v3.0\r\n</p>\n\n<p><strong>BACKSTORY</strong>\n</p>\n<p>Once upon a time, four magical rings were kept in a temple shared by two neighboring kingdoms, the Kingdom of the East and Kingdom of the West.\r\n</p>\n<p>Now the two kingdoms are at war.\r\n</p>\n<p>Each believes that the other has stolen the rings. However, unbeknownst to the kingdoms, the rings were taken by a shapeshifter from the Kingdom of the North. The shapeshifter seeks to divide and weaken the eastern and western kingdoms so that the northern kingdom can invade and conquer them.\r\n</p>\n<p>A band of four adventurers from the four corners of the land now seeks to retrieve the stolen rings from a dungeon. They were recruited secretly by a loving couple consisting of one princess from the east and another princess from the west.\r\n</p>\n<p>Legend has it that the most loving couple in the land can sense the location of the rings through visions. When they wear the rings, they can together provide powerful healing merely by touch. The princesses seek to reunite the kingdoms and restore order in the land by wearing the rings, healing the wounded, and revealing their love.\r\n</p>\n<p>Crawlitaire is a “minimalist” dungeon crawler that requires merely one player and a regular deck of cards. The player leads a party of four adventurers to retrieve four magical rings. If the party acquires the rings, the player wins the game.\r\n</p>\n<p><strong>SETUP</strong>\n</p>\n<ul><li>Be sure to have:\r\n<ul><li>One regular deck of cards.\r\n</li><li>Four coins to use as counters for the rings.\r\n</li></ul></li><li>Form two piles by separating\r\n<ul><li>the face cards (Jacks to Aces) from\r\n</li><li>the number cards (Twos to Tens).\r\n</li></ul></li><li>Shuffle both piles and place them face down.\r\n</li><li>Place one face card face-up beside the face card pile, and place one number card face-up beside the number card pile. These will be discard piles. When a face card or number card pile is depleted, shuffle then put the discard pile face-down in place of the respective pile to continue the game.\r\n</li><li>Draw six number cards and place them face-down in a single pile. This is the monsters’ number card pile.\r\n</li><li>Draw four face cards and place them face-up side by side. These face cards are the characters that form the initial party. Jacks are rogues, queens are clerics, kings are paladins, and aces are fighters.\r\n</li><li>Draw ten number cards. You can associate a number card with a face card (character) if they have the same suit. Associated number cards increase a character’s special abilities (more on this later) as well as their chances of success in battle (more on this later). If any associations are possible, place the number card below the associated face card. If an association is not possible, place the number card in the discard pile. Associated cards are also called ability cards.\r\n<ul><li>Aces (fighters) can have up to five ability cards.\r\n</li><li>Kings (paladins) can have up to four.\r\n</li><li>Queens (clerics) can have up to three.\r\n</li><li>Jacks (rogues) can have up to two.\r\n</li></ul></li></ul>\n<p><strong>PLAY</strong>\n</p>\n<ul><li>Take turns until you acquire the four rings (win) or lose all of your characters (loss).\r\n</li><li>Each turn has up to five steps.\r\n<ul><li>In the *first step*, draw a number card and place it in the monster number card pile (more on this later). This is the monster level-up. For an extremely challenging game, during this step, you can add two cards to the monster number card pile.\r\n</li><li>In the *second step*, draw two more number cards and place one of them face-up and the other face-down. These cards are rooms in the dungeon, one known (face-up) and the other unknown (face-down). The suit of the number card determines the type of the room:\r\n<ul><li>A spade is a trapped room\r\n</li><li>A club is an occupied room.\r\n</li><li>A diamond is a guarded treasure room.\r\n</li><li>A heart is a shrine room.\r\n</li></ul></li><li>In the *third step*, choose which room to enter, known or unknown, by tapping or turning over one of the number cards.\r\n</li><li>In the *fourth step*, you encounter the result of entering the chosen room.\r\n</li></ul></li></ul>\n\n<ul><li>Room: Spade\r\n<ul><li>If the chosen room card is a spade, then it is a trapped room.\r\n</li><li>You must choose one character to test the trap.\r\n</li><li>If the trap is not evaded, then you will lose this character.\r\n</li><li>This character does not need to be a rogue.\r\n</li><li>They test the trap whether or not there is a rogue to disarm it.\r\n</li><li>Draw a number card.\r\n</li><li>If this number card is higher than or equal to the original spade, then the trap is evaded. You safely pass through the room.\r\n</li><li>If there is one or more rogues in the party, then you receive three more tries for each rogue plus one for each number card associated with a rogue.\r\n</li><li>If the trap is not evaded, then you lose the character chosen to test the trap. The character and its ability cards go to the discard piles. Since it is a one-time trap, the remaining characters pass through the room.\r\n</li><li>The number cards for the tries go to the discard pile.\r\n</li></ul></li></ul>\n\n<ul><li>Room: Club\r\n<ul><li>If the chosen room card is a club, then it is an occupied room.\r\n</li><li>Draw one face card and place it face-up. This is the monster occupying the room.\r\n</li><li>Associate any number cards available from the monsters’ number card pile with the monster in the same way that you associate ability cards with characters. \r\n</li><li>The number of the room (club) card determines the maximum total number of cards for the monster including the face card. For example, a three of clubs can have two associated number cards along with the face card.\r\n</li><li>Go through the monster's number card pile one by one to see if they will associate with the monster without exceeding the maximum total number of cards. If you cannot associate cards with the monster, the cards remain in the monster number card pile.\r\n</li><li>The battle then begins.\r\n</li></ul></li></ul>\n\n<ul><li><strong>BATTLE</strong>\n<ul><li>Choose a character from your party to participate in the battle.\r\n</li><li>If your selected character is a fighter, cleric, or rogue, and you have a(nother) rogue with associated cards in the party, then the rogue can sneak attack during the battle. Due to their honor code, the paladin does not allow the rogue to sneak attack during their battles.  If your selected character is a paladin, and they have no associated cards, they automatically lose the battle. </li><li>If your selected character has no associated cards, and there is no rogue with associated cards in the party, then they automatically lose the battle.\r\n</li><li>Step 4: You engage in battle by drawing a number card and placing it face-up.\r\n</li><li>If the number of the card matches one of the ability cards of your character or the monster has no ability cards, then you win the battle. The monster and its ability cards are discarded. If you have a rogue with associated cards that is not directly in battle, then if the number card matches one of the ability cards on the rogue, you win the battle.\r\n</li><li>If the number of the card does not match, then you draw another number card and place it face-up over the previous card.\r\n</li><li>If the number of the card matches one of the ability cards of the monster, then the monster wins the battle. Your defeated character and its ability cards are discarded. Any remaining party members flee to the next room.\r\n</li><li>If there has been no match and the total number of cards drawn for the battle is less than twenty, then draw another number card and play goes to step 4 above.\r\n</li><li>If the total number of cards drawn for the battle reaches twenty, then the battle is a draw. The party flees to the next room. However, due to injury, the character that engaged in battle loses an ability card. Remove the highest ability card from your character and place it in the discard pile.\r\n</li><li>Win, lose, or draw, at the end of the battle, the monster and its associated ability card(s) go to the discard piles.\r\n</li></ul></li></ul>\n\n<ul><li>Room: Diamond\r\n<ul><li>If the chosen room card is a diamond, then it is a guarded treasure room.\r\n</li><li>You draw one face card and place it face-up. This is the monster guarding the treasure.\r\n</li><li>Associate any number cards available from the monsters’ number card pile with the monster in the same way that you associate ability cards with characters. \r\n</li><li>The number of the room (diamond) card determines the maximum total number of cards for the monster including the face card. For example, a three of diamonds allows two associated number cards along with the monster’s face card for a total of three cards.\r\n</li><li>Go through the monster's number card pile one by one to see if they will associate with the monster without exceeding the maximum total number of cards. If you cannot associate cards with the monster, the cards remain in the monster number card pile.\r\n</li><li>The battle begins (see the block titled “BATTLE” above).\r\n</li><li>If you win the battle . . .\r\n<ul><li>For the treasure, you draw another number card.\r\n</li><li>You can associate the number card with a character or place it in the discard pile.\r\n</li><li>If the number card is a black suit (clubs or spades), then you get a ring (coin).\r\n</li><li>When you acquire four rings (coins), you win the game.\r\n</li></ul></li></ul></li></ul>\n\n<ul><li>Room: Heart\r\n<ul><li>If the chosen room card is a heart, then it is a shrine room. While in a shrine room, you can do the following:\r\n<ul><li>TELEPORTATION: at the beginning of the shrine visit, you have one chance to teleport and recruit a character into the party by teleporting a current member out.\r\n</li><li>You have one chance to draw a face card and accept or reject the opportunity to teleport the character into the shrine room.\r\n</li><li>If you accept the opportunity, you must discard one character from the party along with its ability cards. Only then can you add the new character.\r\n</li><li>If you reject the opportunity, place the drawn face card in the discard pile.\r\n</li><li>For example, if the party has two queens and two kings, you can teleport out a king and teleport in a jack (rogue).\r\n</li></ul></li><li>LEVEL-UP: immediately after accepting or rejecting teleportation, draw six number cards and associate them with your characters, or place them in the discard pile. For a more challenging game, you can lower the number of cards for level-up to four (heroic), two (epic), or one (legendary).\r\n</li><li>After level-up, you can use the following special abilities in any order once per shrine room visit.\r\n<ul><li>TRAINING: if you have a paladin (king), then for each ability card associated with the king, you can try to draw and associate an additional number card with another character in the party. A king cannot use their training ability to associate additional number cards with themselves. The drawn cards must be associated with another character or placed in the discard pile. For example, if you have a king with four ability cards, and you have a jack and ace each with no ability cards, then you can draw four number cards and associate them if possible with the jack or ace, or you must place the number cards in the discard pile. You can use the training ability of only one paladin per shrine room visit.\r\n</li><li>SUMMONING: if you have a cleric (queen), then for each number card associated with the queen, you can summon and recruit a new character by drawing a face card (character) from the face card deck and adding it to the party. Unlike teleporting, summoning does not require swapping out characters. However, the maximum party size is four characters. For example, if there are already three characters in a party and there is a cleric in the party with three ability cards, then you can summon only one additional character.\r\n</li><li>Order matters. For example, if you have a cleric and a paladin in the party each with one ability card, you can use the cleric to summon an additional character, then you can use the paladin to train the new character. Alternatively, if you have a paladin with two ability cards and a cleric with no ability cards, you can train the cleric with the paladin by adding two ability cards to the cleric, then you can summon two more characters.\r\n</li></ul></li></ul></li></ul>\n<ul><li>In the *fifth step*, if you have one or more character(s) and less than four rings, place the room cards in the discard pile. Proceed with the next turn.\r\n</li><li>For a more challenging game, you can:\r\n<ul><li>Lower the number of cards for level-up during shrine visits.\r\n</li><li>Increase the number of cards added to the monster number card pile during the monster level-up.\r\n</li></ul></li></ul>\n<p>That is the game of Crawlitaire.\r\n</p>\n<p>Enjoy!\r\n</p>", "metacritic": null, "released": "2023-02-06", "tba": false, "updated": "2023-02-10T17:57:27", "background_image": "https://media.rawg.io/media/screenshots/7b4/7b4b3db4d708ce5d4a78226efdc07685.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["noteagod"], "genres": [], "publishers": [], "esrb_rating": null}