{"id": 924917, "slug": "rhythm-cafe", "name": "Rhythm Cafe", "name_original": "Rhythm Cafe", "description": "<p>Welcome to Rhythm Cafe!</p>\n\n<p>As it’s your first day as our brand-new chef, I should tell you a bit about our cozy little cafe in the woods.</p>\n<p>Weary travelers from all over come here to enjoy the best soups and broths in the land.</p>\n\n<p>How do they find us I hear you ask? Well, the same way you did of course! By following the smoke from our chimney here. </p>\n<p>Our smoke signals reach high above the canopy and can be seen for miles around.</p>\n\n<p>We cook things a little differently here at Rhythm Cafe. </p>\n<p>It’s all about the music of the meal and the tempo of the temperature.</p>\n\n<p><strong> Keep an eye on the orders as they come through and press Z on the keyboard to add an ingredient from the left into the pot.</strong></p>\n<p>Don’t worry too much if you put the wrong ingredients in the pot. Our customers aren’t fussy, but they will give you a lower score for their meals.</p>\n\n<p><strong>You’ll also need to take care of the oven on the right. Press C on the keyboard to add coal and keep that stove burning in the thermometer’s yellow zone.</strong></p>\n<p>Be careful not to put too much coal on the stove. We don’t want it overheating and causing a fire in our cafe built out of wood!</p>\n\n<p>Last thing! We can get quite busy here, so if there is more than one order on the board, you can choose which one to finish first.</p>\n\n<p>And that’s it! Time to start your first shift in the Rhythm Cafe Kitchen. Have fun and remember to always keep to the beat.</p>\n<p><strong>press R to restart current game.</strong></p>\n\n\n<p>Credits:</p>\n<p>Programmer: Flavedo</p>\n<p>Aritist: Sumers</p>\n<p>Composer &amp; Sound Designer: Nayboh, SidBarny</p>", "metacritic": null, "released": "2023-02-06", "tba": false, "updated": "2023-02-10T18:35:05", "background_image": "https://media.rawg.io/media/screenshots/62e/62e092c3e58eaa38af7e5e09507c3fb3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["flavedogame", "Sumers", "Nayboh_Music"], "genres": [], "publishers": [], "esrb_rating": null}