{"id": 92501, "slug": "tower-57-itch", "name": "Tower 57 (itch)", "name_original": "Tower 57 (itch)", "description": "PLEASE NOTE:\r\n<p>THIS IS THE <strong>AMIGA</strong> VERSION OF THE GAME! <br/></p>\n<p>If you would like to purchase the game on PC or Mac please refer to our <strong>STEAM PAGE.<br/></strong></p>\r\nQUICK UPDATE:\r\n<p>The game files have been updated with a fix for the flicker bug which could affect some screen-modes / monitor setups.</p>\n<p>If you have been experiencing this bug, please download the files again.</p>\n<p>Sorry for the inconvenience and thank you for your understanding!<br/></p>\r\nMINIMUM SYSTEM REQUIREMENTS:\r\n\n<p><strong>AOS4:</strong></p>\n<p>AmigaOS 4.1 FE Upd1, &gt;= 600 MHz, Gfx-card with Compositing support</p>\n<p><strong>MorphOS:</strong></p>\n<p>MorphOS &gt;= 3.9 + SDK &gt;= 3.10, &gt;= 600 MHz, Gfx-card with TinyGL support</p>\n<p><strong>AROS:</strong></p>\n<p>x86 (e.g. Icaros Desktop &gt;= 2.2), Gfx-card with Mesa3D support</p>\n<p><strong>IMPORTANT NOTE: If you wish to play with a joypad or in 2-player mode, you will need an OS supported dual-stick joypad.<br/></strong></p>\n\n<p><strong>TOWER 57 IN A NUTSHELL</strong></p>\n<p>In a dystopian, dieselpunk world, where Megatowers are the only enclaves of civilization, a group of extraordinary individuals is sent to infiltrate the reclusive Tower 57. <strong>Their skills, clips' capacity &amp; the ability to cooperate will decide on their fate.</strong></p>\n<p>Tower 57 is a <strong>TOP-DOWN TWIN STICK SHOOTER</strong> with 16-bit inspired pixel art, destructible environments and heavy <strong>focus on CO-OP</strong>. It is also a modern take on what made <strong>AMIGA</strong> games so great back in the days.</p>\n<p><strong>FEATURES:</strong></p>\n<p><em><strong>FAST-PACED ARCADE GAMEPLAY</strong></em></p>\n<p><em>There is no school like the old school. <strong>Shoot everything that moves and don’t get killed in the process</strong>. Tower 57 offers complex situations arising from simple systems interacting with each other - and it does it the hard way. Number of lives is scarce, respawns limited and difficulty skyrockets when you least expect it.<br/></em></p>\n<p><strong><em>TOOLS OF DESTRUCTION</em></strong></p>\n\n\n\n\n\n\n\n\n<em>\n<p> <em>Choose from a roster of <strong>six particular characters with different skillsets, number of upgradable weapons and gadgets</strong>. And if you happen to lose an arm or leg during your mission - you can always replace it with a new, better one! Master these combos and you will never get bored on your way to the top of the Tower 57.<br/></em></p>\n<p><strong><em>COOPERATION</em></strong></p>\n<em>\n<p><em>Mayhem tastes the best when it is shared. Tower 57's main campaign is designed for both <strong>single player &amp; local CO-OP</strong>. Flank your enemies, bait them into an ambush, leverage co-op specific weapons, or combine your regular weapons for increased firepower and new effects!<br/></em></p>\n<p><strong><em>DIESELPUNK WORLD</em></strong></p>\n<em>\n<p> <em>Find your way through a maze of floors connected by elevators, a central hub filled with shops and terminals, and a multitude of secret walls and uncharted passageways leading to forgotten parts of the tower. Times of randomly generated levels are gone - <strong>everything in Tower 57 is carefully designed and pixel-crafted with the highest attention to detail</strong>.<br/></em></p>\n<p><strong><em>DESTRUCTIBLE ENVIRONMENTS</em></strong></p>\n<em>\n<p> <em>Smash them, crash them and destroy everything. Reload. Repeat. Because <strong>everyone likes when things go BOOM</strong>. Everything - from debris and shell casings to bloody footprints - will mark your destructive trail through the Tower.</em></p>\n<p><strong><em><em><em><em>ADVERSARIES</em></em></em></em></strong><br/></p>\n<p><em><em> <em>Each enemy features its own distinct spawning mechanism, movement &amp; attack patterns, as well as some weaknesses. And you'd better <strong>learn those vulnerabilities if you don't want to end up dead very quick</strong>.<br/></em></em></em></p>\n</em></em></em></em>", "metacritic": null, "released": "2018-03-13", "tba": false, "updated": "2019-08-28T23:26:02", "background_image": "https://media.rawg.io/media/screenshots/af8/af8d6566ce57ca57685219525d2e3b9e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 409, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["benitosub"], "genres": ["Action"], "publishers": [], "esrb_rating": null}