{"id": 925097, "slug": "aconite", "name": "Aconite", "name_original": "Aconite", "description": "<strong>Story:</strong><br/><br/>Nowadays, it's very hard for people to earn  really big money by fair means. And if someone wants to have at least some kind of fortune, then one has to make it somehow. So Mireille found a way to make her fortune. At some point in her life, she decided that she could use her abilities and skills to make money. With exceptional skills as an agile fighter and stunningly rifle shooting , Mireille became a mercenary.  Her job became killing or protecting targets. Depending on the order, she destroys or saves a person.  In her hands is not just a weapon, but the life of a certain person.  In her hands is not just a weapon, but the life of a certain person. The company that provides the girl with such work is one of the largest corporations in this world. And Mireille, with the help of the corporation, has  been a ghost for a long time, unidentifiable or untraceable. Each mission determines where the girl will go, and each time she ends up in a new place, in a different part of the world, in a different country. With a new mission, she gets new weapons, equipment, and everything she needs to complete the mission. After that, she is also given a rest, which will fully satisfy her desires and needs.<br/><br/><strong>Gameplay:</strong><br/><br/><br/><br/>The game is a first-person sniper simulator. You enter a location where you need to destroy all enemies and score points.<br/><br/><strong>ChillRoom mode:</strong><br/><br/><br/><br/>Presents explicit scenes with the main character you can always discover new scenes passing new missions.<br/><br/><strong>Features:</strong><br/><br/><ul><li>Sniper System<br/></li><li>AI<br/></li><li>Animated CG art<br/></li><li>Sex Scenes<br/></li><li>Missions to different parts of the world</li></ul>", "metacritic": null, "released": "2023-02-10", "tba": false, "updated": "2023-02-13T03:51:56", "background_image": "https://media.rawg.io/media/screenshots/b97/b97cd656893988e172b7cc750e10bfc5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 386, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Diamond Cats Studio"], "genres": ["Action", "Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Diamond Cats Studio"], "esrb_rating": null}