{"id": 925023, "slug": "community-garden-itch-bkisby", "name": "Community Garden (itch) (bkisby)", "name_original": "Community Garden (itch) (bkisby)", "description": "<p>This is my entry for GGJ 23. I decided to try out a new networking SDK called coherence and this is my attempt at a persistent world game. Ended up becoming a wave defense game due to time. Basically defend the last flower from the tractors and try to get the highest wave as a community. It is an arcade style game so difficulty ramps up over time (every 5 waves) and eventually becomes impossible.<br/><br/>Controls:</p>\n<p>WASD to move</p>\n<p>Shift (either side) to sprint</p>\n<p>Space to jump (only needed for jumping over walls)</p>\n<p>Left click to use items (hold for building walls or towers)</p>\n<p>Use the one key (1) to change to shotgun (this needs ammo resources found on the map, but you start with 10)</p>\n<p>Use the two key (2) to change to shovel (place walls) (this needs wall resources found on map)</p>\n<p>Use the three key (3) to change to tool box (place towers) (this needs tower resources found on map)<br/><br/>Info About Game Mechanics:<br/><br/>The Last Flower - When enemies collide they deal damage to it and its health can be seen at the bottom of the screen<br/><br/>Shotgun - Damage is dealt in a spread and and is equal for everything hit<br/><br/>Walls - take damage from enemy tractors and deal damage back when there is a collision. Good for defending the flower from all angles and towers.<br/><br/>Towers - Rotate and shoot water that damages enemies (will deactivate for a short time after dealing damage. Will take damage and be destroyed by enemy tractors colliding)<br/></p>\n<p>Resources - Spawn across the map nearby the flower. There are 3 types. One is ammo for your shotgun, another is resources for a wall, and the last is resources for a tower.<br/></p>", "metacritic": null, "released": "2023-02-06", "tba": false, "updated": "2023-02-10T19:26:01", "background_image": "https://media.rawg.io/media/screenshots/a95/a951fa709c338391b752c29e17c7f104.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["bkisby"], "genres": [], "publishers": [], "esrb_rating": null}