{"id": 925076, "slug": "7-sins-lost-in-labyrinth", "name": "7 Sins: Lost in Labyrinth", "name_original": "7 Sins: Lost in Labyrinth", "description": "Characters depicted in this game are over 18 years of age.<br/><br/>To ye all naughty Sinners,<br/>Welcome to “7 Sins : Lost in Labyrinth”<br/>A Survival Horror Game, based on the Cutie Characters and World of 7 Sexy Sins Series.<br/><br/>You have but one goal: survive and escape the hellish mazes!<br/>Find the secrets and beware of the jump scares that will shake into your naughty heart!<br/><br/><br/><br/>After graduated from High School,<br/>The \"7 Sins\" Girls have all left on their separate paths.<br/><br/>During a summer holiday, they decide to have a bikini reunion party at the seaside.<br/>Chilling around the campfire, in the dead silence of night and with the cold wind blowing, each of them start telling a spooky story each.<br/>After going to sleep, something unexpected and horrifying happens.<h3>ADVANTAGES</h3><br/><ul><li>\"Procedurally generated Maze\" for Fresh Experiences on each Playthrough.</li></ul><ul><li>\"Use cool items\" and discover to play pranks on or support your friends.</li></ul><ul><li>\"Ghosts of 7 Sins\" will have their own otherworldly stage and unique gimmicks to threaten players, who will have to be very cunning and intuitive to evade their hunters.</li></ul><ul><li>“Third-person pov” We understand that 1st-person games populated by this sub-genre can lead to motion sickness, and therefore we designed the game to utilize a 3rd-Person for more comfort while experiencing the horror and excitement at the same time.</li></ul><ul><li>\"More than 8 types of Special Missions\" Which will grant unique experiences based on their Combination on each Playthrough.</li></ul><ul><li>\"Moe Cutie Girls\" in their Bikinis, with eye-catching Boob Jiggling Physics to entertain ye naughty players!</li></ul><h3>Gameplay</h3><ul><li>Co-op 2~4 players</li></ul><ul><li>PVP 2 players</li></ul><ul><li>Solo</li></ul><br/><br/><ul><li>Camera Mode</li></ul>Players can find hidden stuffs that are not visible via standard POV.<br/>Certain Horrors and Clues can only be seen via Camera's Lens.<br/>Players can utilize Photo Mode at any time they wish.<br/><ul><li>Unlock characters and dress them up in the sexy bikinis of your choice!</li></ul><ul><li>Take photos to temporarily stun the ghosts, or collect photos of the girls in various poses.<br/>And forever keep these photos in your naughty mind!</li></ul><br/>Warning<br/>This game contains flashing lights that may make it unsuitable for people with photosensitive epilepsy or other photosensitive conditions. Player discretion is advised.", "metacritic": null, "released": "2023-02-10", "tba": false, "updated": "2023-02-13T03:23:10", "background_image": "https://media.rawg.io/media/screenshots/f9f/f9f014232648312e2de123229600d3fa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 440, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zai Studio"], "genres": ["Indie"], "publishers": ["Zai Studio"], "esrb_rating": null}