{"id": 925099, "slug": "seroutte-2", "name": "Seroutte", "name_original": "Seroutte", "description": "Seroutte is a short atmospheric experimental horror dreamscape based on the developer's nightmares. It explores themes such as the loss of control, fear of the dark, and the paranoia found within the unknown.<br/><br/>After waking up in the middle of the night, your only desire is for a drink of water, and to go back to sleep. <br/><br/>The game heavily emphasises exploration, with the ability to interact with various objects in the world.<br/><br/>Originally released in 2019 on Itch, the Steam Edition of Seroutte is updated with a number of small fixes.<br/><br/>This game is *very* short. You aren't going to get hours of gameplay from this. It was created by a solo developer in a short amount of time, with the aim to learn as much as possible from developing and releasing the game.<h3>Key Features</h3><br/><ul><li> Explore a familiar yet distant environment.</li></ul>Even our own homes can feel foreign to us in the dead of night. Exploring the house may give you some clues on what to do.<br/><br/><ul><li> Immerse yourself in the universal sense of unease.</li></ul>You are alone, in the dark, in the middle of the night. You've finally built up the courage to get out of bed, and get the drink of water you so desperately need, but your entire body is screaming at you to stay where it's safe.<h3>Future Updates</h3><br/>Future plans include updated audio, achievements, translations, and various other features.<br/><br/>Currently the game works on the Steam Deck though with some minor bugs, these will be fixed in coming updates.<br/><br/>If you discover any bugs, or have any suggestions feel free to contact us at any of the included links.", "metacritic": null, "released": "2023-02-10", "tba": false, "updated": "2023-02-13T03:53:50", "background_image": "https://media.rawg.io/media/screenshots/0a0/0a004c269126404c47350f3c5e70ef87.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Studio Hex"], "genres": ["Adventure", "Indie"], "publishers": ["Studio Hex"], "esrb_rating": null}