{"id": 92505, "slug": "sync-since-you-never-came", "name": "SYNC: Since You Never Came", "name_original": "SYNC: Since You Never Came", "description": "<p>Winner of \"Excellence in Innovative Narrative\" at Gamefest 2016!</p><p>Winner of \"Best Student Digital Game\" at Meaningful Play Conference 2016 at Michigan State University!</p><p>Entrant in IGF choice awards for 2017.</p><p>You have lost the love of your life. Overwhelmed by grief, you sit by her tomb, flipping through the pages of the journal that chronicles your life together. So begins SYNC, an interactive visual novel designed in Unity using new facial recognition software from Affectiva.<br/></p><p>You assume the role of Alex, grieving the recent death of their lover, Ivy, in a car crash. Unable to move on, Alex can't help but futilely imagine what they might done differently to prevent the fateful accident. Players advance the narrative by syncing their facial expressions with those of Alex. As the story progresses, players can also change Alex's emotional state, impacting what happens next. Eventually, Alex (and the player) is faced with a choice: to accept the doomed relationship so they can begin to move on, or to reject the relationship and remain trapped in the past.</p><p>Robert D. Bishop || Sound/Audio Design</p><p>Luc Wong || Art/Animation</p><p>William Pheloung || Programming || http://willpheloung.tilda.ws/</p><p>Yihao Zhu || Design/Project Management</p><p>Eric Walsh || Writing<br/></p>", "metacritic": null, "released": "2016-05-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/fe0/fe0a4709a57b5eabebfea332cf728be1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["keyboardkommander"], "genres": [], "publishers": [], "esrb_rating": null}