{"id": 92510, "slug": "life-underground", "name": "Life Underground", "name_original": "Life Underground", "description": "<p>The Life Underground game is an interactive outreach experience for 7th and 8th grade classrooms. The goal is for students to visualize microscopic life at a range of terrestrial and extraterrestrial subsurface conditions. Students take the role of a young scientist investigating extreme subsurface environments for microbial life. They will navigate through extreme conditions, including those of temperature, pressure, acidity, and energy limitations, and they will begin to recognize what characterizes life in this context.</p>\n<p>Set in the near future, players explore the subsurface environment in an advanced vehicle, which doubles as a mobile laboratory, and are aided by a team of scientists. Players navigate the mine and connected caves, take samples, isolate organisms, and conduct experiments to learn more about the extremophiles they uncover. The players will manipulate various environmental factors to provoke different reactions from different microbes, depending on the organisms' intrinsic traits.</p>\n<p> As a scientific investigator, players will encounter and manipulate simulations of the tools of the research team. The game will introduce students to extremophiles in an interactive, immersive environment. By allowing them to create experiments with virtual microbial life, it will also reinforce their understanding of the scientific method. Ultimately, the Life Underground game's relatable characters, engaging exploration, and sense of adventure will inspire players to explore STEM-based careers.</p>", "metacritic": null, "released": "2016-12-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8fb/8fb9c243ac39f8eb82dff14026252636.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Sean Bouchard", "GameInnovationLab"], "genres": ["Adventure", "Educational"], "publishers": [], "esrb_rating": null}