{"id": 925100, "slug": "mistcaller", "name": "Mistcaller", "name_original": "Mistcaller", "description": "\n<br/>\n<br/>\r\nA young girl awakens alone, her mind void of the events that led to her solitude. All she knows is that her brother has been taken, and the answers to her plight lie somewhere within a strange mist encasing the world. <br/>\n<br/>\r\nUsing her newfound power to control the unsettling haze, Eve ventures deep into the unknown, hoping to unlock her memories and the truth of her past. Guided by a disembodied voice speaking from the shadows, Eve overcomes dangerous obstacles and solves challenging puzzles on a journey to find her brother and herself.<br/>\n<br/>\r\nAt the heart of the mystery sits two rival families, each with their own dark secrets. The more Eve uncovers of the feuding houses and the closer she gets to finding her brother, the more she’ll wish she remained amnesiac. <br/>\n<br/>\n<br/>\n<br/>\r\nMistcaller is a supernatural puzzle platformer inspired by games like Limbo. Fully hand-drawn, the uniquely artistic world encased within the mist is beautifully rendered.<br/>\n<br/>\r\nControl the Mist. Harness the power of the mist to navigate an eerie world and unravel its secrets.<br/>\n<br/>\r\nUse Your Mind. Help Eve solve a series of intricate puzzles and overcome dangerous obstacles.<br/>\n<br/>\r\nThe Story Beneath the Mist. Explore a deep and rich narrative centered around an ongoing conflict between rival families and uncover Eve's place in it all.<br/>\n<br/>\r\nAn Ode to the Classics. Mistcaller pays tribute to quintessential platformers and their remarkable art styles.", "metacritic": null, "released": "2023-02-12", "tba": false, "updated": "2023-02-13T03:55:03", "background_image": "https://media.rawg.io/media/screenshots/448/44805e094af8b0d52ed5e264478b4691.jpg", "website": "https://www.mistcaller.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 448, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Onyx Wings Studio"], "genres": ["Casual", "Indie"], "publishers": ["Onyx Wings Studio"], "esrb_rating": null}