{"id": 925117, "slug": "dreams-in-the-witch-house", "name": "Dreams in the Witch House", "name_original": "Dreams in the Witch House", "description": "Whether the dreams brought on the fever or the fever brought on the dreams Walter Gilman<br/>did not know. - H.P. Lovecraft, The Dreams in the Witch House<br/><br/><br/><br/><br/>Arkham, Massachusetts 1929. Walter Gilman, a promising math student, has just moved to the city and is starting his studies at Miskatonic University. The Dombrowski’s boarding house where he resides has a bad reputation, but Walter doesn’t mind the old rumors... Until the dreams start. A hideous scheme is underway, and if Walter is not careful, it could cost him more than his life. It could cost him his soul. <br/><br/><br/>Dreams in the Witch House is a unique mix of classic point and click adventure and open world RPG. The gameplay is nonlinear and many of the elements are generated randomly, making each playthrough different. <br/><br/>You have two months to prepare Walter for the dreaded May-Eve. How you spend the time is completely up to you: concentrate on studies, get friends and stay in good physical and mental state. Or explore the old rumours, read the forbidden books at Miskatonic University, and work on your occult thesis. Or just stay in bed, and hope that it all goes away!  <br/><br/>Based on the short story \"The Dreams in the Witch House\" by H.P. Lovecraft.<br/><br/><br/><ul><li>Open world sandbox meets point and click adventure game<br/></li><li>RPG elements: money, health, sanity, and many character stats<br/></li><li>Day / evening / night - cycles and changing weather<br/></li><li>Several endings depending on player’s actions <br/></li><li>10 - 20 hours of playtime<br/></li><li>Original soundtrack by genre favourite Troy Sterling Nies (The Call of Cthulhu, The Whisperer in the Darkness) <br/></li><li>Creeping tension: otherwordly threats intensify gradually <br/></li><li>320 x 180 pixel graphics <br/></li><li>Plenty of detailed animation and visual effects</li></ul><br/>", "metacritic": null, "released": "2023-02-15", "tba": false, "updated": "2023-05-12T21:15:07", "background_image": "https://media.rawg.io/media/screenshots/255/255396822f3f51a92ee43c74fcc6f974.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 6, "beaten": 1, "toplay": 5}, "playtime": 7, "achievements_count": 26, "ratings_count": 1, "suggestions_count": 363, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Atom Brain Games"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Bonus Stage Publishing"], "esrb_rating": null}