{"id": 9252, "slug": "plastiland-explore-the-worlds-of-plasticinia-plast", "name": "Plastiland - explore the worlds of Plasticinia, Plastipolia and Plastidonia!", "name_original": "Plastiland - explore the worlds of Plasticinia, Plastipolia and Plastidonia!", "description": "Welcome to the enchanting plasticine worlds!<br/><br/>Plastiland is a puzzle-platformer set in a unique hand-made plasticine world. Guide our lovely clay characters through 48 levels of three worlds. Save as many of plastiballs as you can, reach far corners of each level by transforming them into one of eight roles, like cruncher, crusher, builder, and others. <br/><br/>This is incredible fun for both adults and children and the most exciting logical gameplay ever! <br/>All you need is clay!<br/><br/>• Funny clay handmade characters<br/>• 3 handmade plasticine worlds<br/>• Lemmings-style mechanics<br/>• 48 most challenging and beautiful levels<br/>• 8 funniest roles to change plastiballs into<br/>• Different challenging environmental effects<br/>• Bonus levels with unexpected mechanics<br/>• The best music you’ve ever heard<br/><br/>Each level has its own goal to reach and different mechanics to use, like sleeping bombs, scattered additional roles, nullify zones, and portals. Build your way through each level avoiding its deadly zones like chasms, seas of lava or acid and dead ends. You&amp;#39;ll guide your clay characters through three clay worlds using a very comfortable and easy-to-use touch interface.<br/><br/>Each level is accompanied by pleasant sound effects and atmospheric music you will surely remember long after playing the game. So get the game and explore the worlds of Plasticinia, Plastipolia and Plastidonia!<br/><br/>DEAR PARENTS!<br/>This game does not and will not contain any internal purchases. You only buy it once and your kids can enjoy it endlessly! <br/><br/>Apart from the entertaining element, the game has an educational one as well – the gameplay, storyline and mechanics of Plastiland enhance your kid&amp;#39;s logical thinking and creativity.<br/><br/>We value your feedback and are always glad to hear from you: help@zillionwhales.com.", "metacritic": null, "released": "2015-03-04", "tba": false, "updated": "2019-10-22T14:30:22", "background_image": "https://media.rawg.io/media/screenshots/09a/09ae032d612632d98de33ddec0c20810.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zillion Whales"], "genres": ["Family", "Puzzle"], "publishers": ["Zillion Whales"], "esrb_rating": "Everyone 10+"}