{"id": 925375, "slug": "mayi-garden", "name": "MAYI Garden", "name_original": "MAYI Garden", "description": "Description\r\n<p>MAYI Garden is a charming and relaxing <strong>base-defense</strong> game set in the peaceful countryside. In this game, you are an ant tasked with protecting the roots of a precious plant from waves of insect invaders who want to eat the plant. \r\n</p>\n<p>You must defeat enemies emerging from all over the place. Planning your routes cautiously and placing your resources wisely is the key to defeating the invaders. As you progress, you can pick up <strong>nutrients </strong>(powerups) to help you defend the plant more effectively.\r\n</p>\n<p>MAYI Garden always has something for you, whether you're an experienced base-defense player or just looking for a casual game. It has engaging gameplay, charming music, and beautifully designed country-style drawings that immerse you in the fairytale world. It is the perfect choice for a break from the hustle and bustle of everyday life. So gather your strength, put on your game face, and prepare to defend your garden!\r\n</p>\r\nNotice Board\r\n\r\n<ul><li>Watch out for the falling resources! Collect them to obtain special abilities. \r\n</li><li>Break cracked rocks to unlock new areas!\r\n</li><li>Watch out for both your health and the plant’s health!\r\n</li><li>Clean off all the pests to pass the level. \r\n</li></ul>\r\nControl Panel\r\n\r\n<p><strong>WASD </strong>- movement\r\n</p>\n<p><strong>Space </strong>-  Attack\r\n</p>\n<p><strong>J </strong>-  Place Turret\r\n</p>\n<p><strong>K</strong> - Place Tunnel\r\n</p>", "metacritic": null, "released": "2023-02-12", "tba": false, "updated": "2023-02-13T06:10:36", "background_image": "https://media.rawg.io/media/screenshots/612/612e3e30eb397cf5b1208e877c6954c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["GeorgeLei", "JM833", "Mattttthew"], "genres": [], "publishers": [], "esrb_rating": null}