{"id": 925444, "slug": "kimtopia", "name": "Kimtopia", "name_original": "Kimtopia", "description": "<p>You are now the proud owner of your very own island.  What will you do with it?  Fill it with nature and buildings!  Depending on where you place things, you will get points.  Compete with your friends and see who can get the highest score!  Or just try to make the most aesthetically pleasing island possible.  The choice is yours!<br/><br/>--How to Play--<br/></p>\n<p>Left-click on one of the 5 buildings at the bottom of the screen.</p>\n<p>Left-click to place the building anywhere on your island!</p>\n<p>Repeat until you run out of space on your island.</p>\n<p>(Optional) Take a screenshot of your island to share with friends c: &lt;3<br/><br/>--Dev Notes--<br/></p>\n<p>This was made for a 1-day challenge in which the theme was Capitalism.  An additional challenge given to me was that the game was not allowed to have any money in it whatsoever.  So I came up with the idea of putting a bunch of things on an island for points, inspired by many others games that do the same.  Island, is it called?</p>\n<p>I programmed this game by myself in 2 days using the Unity Engine!  The second day was mainly just to polish the game and add settings after the challenge ended.  Everything was created by me except for the music.<br/></p>\n<p>Let me know what you think and please feel free to share screenshots of your islands ^-^ I'd love to see them &lt;3</p>", "metacritic": null, "released": "2023-02-12", "tba": false, "updated": "2023-02-13T06:38:28", "background_image": "https://media.rawg.io/media/screenshots/d46/d46ed8cd2e641d191543830094c48ec0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kimily"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}