{"id": 925569, "slug": "codventure-elvin04", "name": "Codventure (Elvin04)", "name_original": "Codventure (Elvin04)", "description": "<p><strong>Short description</strong><br/></p>\n<p>This project was done in a school setting in 2 weeks by our group, so there are still bugs, most are known</p>\n<p>Codventure is an educational single-player platform game, where the player has to think to progress.</p>\n<p>The goal is to create the right program for the main character to reach the end of the level the end of the level in order to move on to the next.<br/></p>\n<p>The expected result was a 2D single-player game allowing the development of the player's arithmetic logic of the player by making him use a simplified programming system for the character's actions.</p>\n<p><strong>Starting the game</strong></p>\n<p>At the start of the game, you must select level 1, once you have succeeded, you can move to level 2</p>\n<p><strong>How to play</strong><br/></p>\n\n\n\n<p>You will see the action buttons, at the bottom you can select the page by hovering over the categories, they allow you to select the actions you want to execute, you just have to drag and drop them on the first block of the program: the flag.</p>\n\n\n<p>As you can see, bubbles appear when the block is placed, they will allow you to select the number of times the action is performed.</p>\n<p>To modify them, you just have to place yourself above the instruction box, and use your wheel to increment or decrement the number</p>\n<p>You will notice three buttons on the right of the \"programming zone\"<br/></p>\n\n<p>The flag allows you to launch the program you have created</p>\n\n<p>The stop logo allows you to stop your program at any time, which resets the position of the player, objects, enemies, and puzzles if there are any in the current level.</p>\n<p>Note, if you run your program, and it doesn't solve the level, you have to press the stop button to be able to modify the program and run it again.</p>\n\n<p>The reset logo button has the same function as the stop button, but it resets the program to 0 at the same time</p>\n\n<p>It is possible to remove blocks from your instruction string, you have to left click on the last one to remove it</p>\n\n<p>With this, you have the basics to play our game, thanks to all who will do it, have fun</p>\n<p>made with : </p>\n<p>- https://itch.io/profile/tututgames</p>\n<p>- Andy</p>\n<p>- Théo</p>\n<p><strong>Thanks</strong> <strong>!</strong><br/></p>", "metacritic": null, "released": "2023-02-12", "tba": false, "updated": "2023-02-13T07:31:38", "background_image": "https://media.rawg.io/media/screenshots/524/524640f5329b6fad26ce8183baf33f25.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Elvin04"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}