{"id": 925587, "slug": "kingdom-grow", "name": "Kingdom Grow", "name_original": "Kingdom Grow", "description": "<p>Controls:</p>\n<ul><li>Left Mouse: Select</li><li>Right Mouse (held): Move Camera</li><li>WASD: Move Camera </li></ul>\n<p>There's no audio yet, your speakers aren't broken...</p>\n<p>Basic Gameplay Overview:</p>\n<ul><li>PROTOYPE: There is no way to lose in this version of the game. You can basically build forever and make a massive town if you want although I haven't test a really giant city. The game board is a 50x50 grid so technically you can place 2,500 tiles, but I have no idea what will happen at that point.</li><li>Purchase cards either individually or in packs with gold. Cards are automatically added to your card inventory (max 6 cards at once)</li><li>Place tiles by dragging cards from your inventory up onto the game board. Once on the board they can be moved around and then when in the desired location activated.<ul><li>Note: All buildings (structures) require an adjacent road to be activated. The exception being the farm. Farms can be an extra space away from a road as long as they are also adjacent to another farm that is next to a road.</li></ul></li><li>Ending the day causes your workers and structures to use their required resources. For the prototype there is no penalty for not having enough of a resource, you can go negative even.</li><li>Starting a new day causes your structures to generate resources that can be then used to purchase more cards.</li></ul>\n<p>There are three main panels in the game. An information ledger that shows your current daily costs and profits. Make sure you balance your books.</p>\n<p>A shop panel which is where cards and card packs are purchased. For this prototype all items are set to infinite quantity.</p>\n<p>And the card inventory panel which holds your current cards that can be used to spawn tiles. You can only have 6 cards max at any given time, but can save cards to use later. </p>\n\n<p><strong>This version of the game is a very early prototype. I plan to continue working on the game to add in features to make it an actual game.</strong></p>\n<p>Future plans:</p>\n<ul><li>Tutorial system to explain mechanics</li><li>Many more cards and tile types</li><li>SOUND and MUSIC!</li><li>Upgrading existing tiles</li><li>Quests that provide rewards (packs, cards, etc)</li><li>Penalties for not having enough resources at the end of day. (i.e. not being able to feed your workers)</li><li>Stages and progression based on the size of your town</li><li>FIX THE JANKY BUGS!</li></ul>\n<p>Assets used</p>\n<ul><li>https://merchant-shade.itch.io/16x16-mini-world-sprites (Shade)</li><li>https://cafedraw.itch.io/fantasy-card-assets (cafeDraw)</li><li>https://ladyluck.itch.io/farming-life (LadyLuck)</li><li>https://paperhatlizard.itch.io/cryos-mini-gui (cryo)</li><li>https://statoasty.itch.io/ui-assets-pack-2 (Sta.Toasty)</li><li>https://nyknck.itch.io/fx071 (nyknck)</li><li>https://somepx.itch.io/humble-fonts-free (somepx)</li></ul>", "metacritic": null, "released": "2023-02-12", "tba": false, "updated": "2023-02-13T07:37:54", "background_image": "https://media.rawg.io/media/screenshots/4d8/4d8544916897a30f6a9fd42cd52e5aaf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["SaitoInteractive"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}