{"id": 92557, "slug": "markiplier-rpg-adventure", "name": "Markiplier RPG Adventure", "name_original": "Markiplier RPG Adventure", "description": "<p>There is a total of 6 Chapters to complete. The first one is very short and consists of a single puzzle. The next four require more exploration and three of them have a Boss Battle awaiting. They can be completed in any order since all the enemies are at the same level as your team. Hence the lack of experience and levels. The difficulty of each will vary depending on what items and skills you have at your disposal and in what order you beat them. Once you have collected everything you need, you'll unlock the final Chapter and face your biggest challenge. On the way you will find lots of references to Markiplier's channel and other Youtubers.</p>\n<ul><li>There are no revival items. If you faint, you won't be able to heal until the battle is over. Any character that has fainted will be revived with 1HP automatically after battle.</li><li>There are a few randomly generated dungeons. You can't save in these areas. Enemies will come after you, but you may be able to outrun them if you don't want to fight them. You may find a weapon somewhere, so you should explore as much as possible.</li><li>It was made with Pokémon Essentials. However, it's not a Pokémon game, it only uses some features.</li><li>Default size: 640x480.</li></ul>\r\nKnown issues\r\n<p>Some battle animations are misplaced.</p>\r\nCREDITS\r\n<p>RPG Maker XP by:<br/>Enterbrain</p>\n<p>Pokémon Essentials by:<br/>Flameguru, Poccil (Peter O.) and Maruno<br/>and everyone else who helped create version 13</p>\n<p>Additional Scripts by:<br/>Stochastic<br/>KitsuneKouta<br/>p.claydon<br/>TheKrazyGamer</p>\n<p>Additional Graphics by:<br/>Celianna<br/>Sithjester<br/>aweryn<br/>painhurt<br/>RPG Maker VX<br/>Youtube Channel Logos belong to their respective owners</p>\n<p>Testers<br/>Vish (VEpicAGE)<br/>AlexClimax</p>\n<p>Music and SFX<br/>Kevin McLeod<br/>www.incompetech.com<br/>MiniMusicMan<br/>ShurkOfficial<br/>Club Sound<br/>pan14<br/>ecodios</p>\n<p>Most of the art and custom scripts by me.</p>\n<p>If you decide to play it I really hope you enjoy it!</p>", "metacritic": null, "released": "2017-01-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5e2/5e2134ef672f541432cf55c3cff4840c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Len Gaming Lab"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}