{"id": 925531, "slug": "dragonpeak-saga-demo", "name": "Dragonpeak Saga (DEMO)", "name_original": "Dragonpeak Saga (DEMO)", "description": "<p>A simple, yet tactically rich battle card game where you take control of the most fearsome beasts of Dragonpeak in an all-out war to seize control of the region! Poisition your dragons carefully to ensure advantageous matchups, conserve and utilize elemental energy with consciousness to fuel your dragons' onslaught, and exploit the relations between elements to lead your glorious beasts to ultimate victory and rule over Dragonpeak!</p>\n<p>CREDITS:</p>\n<p>Dragon art: @Imugiwyrm aka Seoul Moro, and @SpiritSwatch (https://www.tiktok.com/@spiritswatch)</p>\n<p>Music: Cooper Savage</p>\n<p>Board art: Cole K. Smith (https://opengameart.org/content/dragon-on-rock)</p>\n<p>Icons: Delapouite and Lorc (https://game-icons.net/)</p>\n<p>NOTE:</p>\n<p>This demo was made for My First Game Jam: Winter 2023! A good amount of content had to be cut out due to several difficulties, so I feel it's fitting to call it a demo, just a taste of what the full thing could be.</p>\n<p>The demo has a few known issues: sometimes messages in the combat log double up for no reason and, more importantly, NONE of the dragons' passive abilities work AT ALL (though the latter was intentional,  as there wasn't time to implement all of them, so I chose to disable them all).</p>\n<p>Some of the game's rules were simplified to fit the time limit, and the content is only a tiny fraction of what the full game would offer. Still, I feel like I've learned a lot and this is a fine little project, not to mention I've had a lot of fun working with other people to make this. Who knows, maybe I'll give continuity to it.</p>", "metacritic": null, "released": "2023-02-12", "tba": false, "updated": "2023-02-13T07:16:50", "background_image": "https://media.rawg.io/media/screenshots/643/64388f4f9690f704eaa5b49b2f47d698.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["underm1nd"], "genres": [], "publishers": [], "esrb_rating": null}