{"id": 925588, "slug": "hungry-beards", "name": "Hungry Beards", "name_original": "Hungry Beards", "description": "<p>THIS PROJECT IS NOT IN A PLAYABLE STATE YET, THERE AREN'T ANY LEVELS EITHER SO DON'T EXPECT TO DOWNLOAD A TRUE GAME<br/></p>\n<p>The original concept was to include this jam's theme (growth) with a game mechanic that allows your beard to grow when eating berries, hence the hungry beards name... But in the middle of the jam I hit my head while playing basketball and got a concussion lmao. It kinda threw off my whole game jam schedule so in the end I ended up making a simple Celeste clone.  I might keep updating it post-jam or make it the base of a completely fresh project, I will keep this description updated.</p>\n\n<p>This is my first actual game project, made in 14 days for My First Game Jam: Winter 2023</p>\n\n<p><strong>The story behind the game</strong></p>\n<p>I had already made a few simple web games in JavaScript (a hangman and a quizz), but this game jam pushed me towards something totally different. It was my first time working with an engine, I chose the Godot engine after struggling with unity for a while (thank you my old laptop). </p>\n<p>It was also my very first time making all the assets and songs for a game. I spent a bit too much time making the art though and could have added the growth mechanic if I hadn't done so. But for my personal growth, it was well worth it: seeing my drawings take life for the first time was soo cool and at least I know that I love doing art now.</p>\n\n<p><strong>Credits</strong></p>\n<p>Music by me using BeepBox</p>\n<p>Pixel art by me using Aseprite, following Saultoons' tutorials</p>\n<p>Game and level design by me, greatly inspired by the game Celeste</p>\n<p>Sound effects from Mixkit</p>\n<p>Parallax background assets from here: https://github.com/bitbrain/godot-tutorials/tree/main/parallax-scrolling</p>\n<p>Edit: Story by my sister (added post-jam)</p>\n\n<p><strong>How it was made</strong></p>\n<p>The code was made by squashing together a ton of tutorials.</p>\n<p>I started by following GDquest's 2D game tutorial series: </p>\n\n<p>I then added this dash: </p>\n\n<p>And I included some of these tips:</p>\n\n\n<p>I also used a ton of help from more specific videos and stack overflow posts.</p>\n\n<p>During development I think I made each mistake listed in this video: </p>\n\n<p>I tried to fix some of them but yeah, I think I've succeeded at failing to make a platformer.</p>\n\n<p>All the code was (re)typed and adapted by me, and I tried to understand all the stuff that I use. It's a terrible mess in there and I'm glad I chose a pixel art style because otherwise I'd probably have some performance issues.</p>\n\n<p><strong>Conclusion</strong></p>\n<p>In the end, I was able to code basic things such as the dust particles and the squash effect during the jump by myself. I had also learnt the principles of pixel art animation and level design and had made some decent goofy music. So I'd say overall this gameJam was a success for me : I learnt a lot and I want to make even more games now</p>\n\n<p>That's about it, thank you for reading. I'd love to hear what you have to say about the tiny bit of gameplay available. Have a great day!</p>", "metacritic": null, "released": "2023-02-12", "tba": false, "updated": "2023-02-13T07:38:11", "background_image": "https://media.rawg.io/media/screenshots/e05/e050d844312fb0ede5262bc874969b9f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kittatro"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}