{"id": 9257, "slug": "super-badminton", "name": "Super Badminton", "name_original": "Super Badminton", "description": "Over a million downloads! Get addicted to the Best Racquet Sports Game on the App Store!<br/> <br/>&amp;quot;I can say, without a doubt, that Super Badminton is the best badminton video game I&amp;#39;ve ever played.&amp;quot; - TUAW<br/>&amp;quot;Super Badminton is exciting. Graphics and animation are top-notch&amp;quot; - (4/5) - The Sunday Times, UK.<br/>&amp;quot;Break Out Your Racket For Super Badminton&amp;quot; - Cult Of Mac.<br/>&amp;quot;Fancy a game of badminton on your iPhone&amp;quot; - MobileCrunch<br/><br/>Experience the fastest racquet sport in the world at your fingertips with hyper-realistic physics, HD quality graphics, slick UI and real sound effects that will make you come back for more. So, grab your badminton racket, take a swing and hit that Smash!<br/><br/>  •  8 badminton players - each with unique strengths and weaknesses.<br/>  •  3 tournaments to challenge your skills: Choose your player and realize the dream to become a real badminton star.<br/>  •  4 stunning 3D badminton stadium courts to simulate the real badminton stadiums.<br/>  •  Wooden badminton court to give you an experience of playing badminton at your local court/gym.<br/>  •  Control direction of your shot by tilting your iPhone/iPod touch/iPad! - giving you an incredible immersive experience with complete command over your shots!<br/>  •  Show off your trophies in your shiny trophy cabinet as you get rewarded in tournaments and various difficulty modes.<br/>  •  Simple and effective controls: Intuitive controls for the casual gamers to enjoy but delivers everything that hard-core fans crave for.<br/>  •  One-Touch directional pad (D-PAD) and camera control: Change your D-PAD to a virtual joystick and your camera dynamically during gameplay on the go - just with a touch.<br/>  •  Super-real badminton shots animations: Overhead clear, Backhand clear, Backhand drop, Forehand drop, Smash among others.<br/><br/>Time to experience the most immersive 3D badminton gameplay with Super Badminton. Get wild smashing! <br/><br/>For support, write to us at support@rolocule.com <br/>Follow us on twitter at @rolocule.<br/><br/>MORE GAMES FROM ROLOCULE:<br/>+ Flick Tennis Online<br/>+ Dead Among Us<br/>+ Bowling Central<br/>+ Motion Tennis<br/>+ Dance Party", "metacritic": null, "released": "2010-07-03", "tba": false, "updated": "2019-10-22T14:30:22", "background_image": "https://media.rawg.io/media/screenshots/7fb/7fb9cf0ea590dad55dd1d4c58d1e85df.jpeg", "website": "http://rolocule.com/rolocules-games/super-badminton/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rolocule Games"], "genres": ["Sports", "Arcade"], "publishers": ["Rolocule Games Private"], "esrb_rating": "Everyone 10+"}