{"id": 925717, "slug": "twilight-elevator-drop", "name": "Twilight Elevator Drop", "name_original": "Twilight Elevator Drop", "description": "<p>Are you ready for the ultimate thrill? Introducing Twilight Elevator Drop - the game that will test your nerves and reflexes like never before. Get set to drop into an elevator shaft filled with dangerous obstacles and enemies, and see if you have what it takes to make it out alive. With fast-paced action and endless excitement, this is the most addictive game you'll ever play. Put your skills to the test and see if you have what it takes to be the champion!</p>\n\n<p>The gameplay:</p>\n<p>Install the fantastic elevator fall simulator game from the play store for free and get started without wasting a single moment. Hold your finger on the screen for brake and release to fall. Keep in mind; the obstacles are all over the way. Don't touch the blocks, help your elevator to reach the bottom of the skyscraper, rescue the people and finish all the levels. This crazy fall-down challenge requires your full focus and quick reaction in crucial situations. This fall block is your right choice if you like playing elevator games, falling games, or lift games.</p>\n<p>Are you ready for the ultimate ride of your life?</p>\n<p>This easy yet unexpected challenging elevator simulator or the lift game will keep your mind and fingers busy for hours. With this lift game, you can collect power-ups and unlock new levels as you progress. Push your limits and challenge yourself with this fun and exciting game.</p>\n<p>Experience an adrenaline rush with the lift simulator as you ride through different levels. Test your problem solving abilities along the way and prove that you have what it takes to beat the obstacles in the game.</p>\n<p>Play now and join in on the thrilling elevator ride! Elevate your gaming with Twilight Elevator Fall!</p>", "metacritic": null, "released": "2023-02-12", "tba": false, "updated": "2023-02-13T08:30:38", "background_image": "https://media.rawg.io/media/screenshots/888/888c1abf11f15de2126ef6868364b6b8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["MPreview"], "genres": ["Action", "Adventure", "Simulation"], "publishers": [], "esrb_rating": null}