{"id": 925815, "slug": "unsure", "name": "Unsure", "name_original": "Unsure", "description": "<p>During Evans childhood he made a friend named Cole,<br/>They loved playing outside without a care in the world until.. Cole had an accident, he was hit by a car while they were playing next to the road at Cole's House.<br/>Cole died that day and Evan became very lonely since Cole was his only friend who understood him.\r\n</p>\n<p>Not even his parents could help him solve his loneliness.\r\n</p>\n<p>Years later at the age of 17 Evan received a letter from an unknown company that call them selfs the PEA (Paranormal Extermination Agency).\r\n</p>\n<p>They asked for your help with an investigation but who would believe that from someone they dont know so naturally Evan ignores them.<br/>But at the end there was a single sentence that changed his mind.\r\n</p>\n<p>(We know about Cole's Accident).\r\n</p>\n<p>Signed PEA.\r\n</p>\n<p>#horror #rpg\r\n</p>\n<p>Gameplay:\r\n</p>\n<p>*Turnbased BattleSystem:\r\n</p>\n<p>The game wil have a simple rpg battle system where you go one vs one witht he enemies that you encounter during the game.\r\n</p>\n<p>They are random encounters and boss fights toughout the story of the game\r\n</p>\n<p>*Power Sword:\r\n</p>\n<p>The power sword provides energy by attacking the enemy so you can use your 4 abilties to have an advantage in battle.\r\n</p>\n<p>*Short Story:\r\n</p>\n<p>The story in this game is pretty short one about what your going to do in this house.<br/>You might finish the game within the hour but im working to it as a decent short experience. You will be able to save your progress at certain points incase something goes wrong or if you die, just make sure to get a fresh drink *Wink*.\r\n</p>\n<p>Ty for visiting my page :D.\r\n</p>\n<p>Controls WASD movement and navigation and E for interaction\r\n</p>", "metacritic": null, "released": "2023-02-11", "tba": false, "updated": "2023-02-13T09:13:14", "background_image": "https://media.rawg.io/media/screenshots/4cf/4cfcdadf1743237229fd7403a2739c3c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Maxximus18"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}