{"id": 92596, "slug": "breakup-squad", "name": "Breakup Squad", "name_original": "Breakup Squad", "description": "<p>Breakup Squad is a fast and asymmetrical team-based game for five players. Two people play as former lovers who spot each other at a party after their toxic breakup. Three players are the lovers' friends who suffer from collateral damage after each makeup and breakup session. Will the lovers be together again, or can the friends keep them apart until the party is over? Make distractions and obstacles to win the cutest breakup game ever!</p>\n<p>Requires five players. Accepts any type of gamepad including Xbox One, Xbox 360, PS3, PS4, and Logitech.</p>\n<p><strong>Early access</strong><br/></p>\n<p>By purchasing this game now, you are receiving early access. Two levels are complete so far. You will receive future updates and new features at no additional cost. Feel free to send us feedback if you find bugs!</p>\n<p><strong>Known issues</strong></p>\n<ul><li>16:9 is the only resolution in which the game looks ideal right now (it stretches to fit others)</li><li>Game looks funky when window is resized</li><li>Button icons don't change when using PlayStation controllers</li><li>Sometimes the character names don't show up on the Character Selection screen (fixed as of 3/2017!)</li><li>Sometimes the timer text doesn't show up (but the timer works) (fixed as of 3/2017!)</li></ul>\n<p><strong>Future additions</strong></p>\n<ul><li>Select durations other than 60 seconds</li><li>More levels (supermarket, school, office, dance club, etc.)</li><li>Play with less than 5 characters</li><li>More controller support</li><li>More platforms???</li><li>Better NPC AI</li></ul>\n<p><strong>Credits</strong></p>\n<ul><li>Catt Small: Game Design, Programming, UX Design</li><li>Chris Algoo: Sound Effects, Programming</li><li>Ethan Gooding: Music</li><li>Hillmon Ancrum: Game Art</li></ul>\n<p>Created by Catt Small for NYU Game Center's No Quarter 2016 exhibition, distributed by Brooklyn Gamery. View press kit</p>", "metacritic": null, "released": "2016-10-30", "tba": false, "updated": "2019-08-28T23:26:01", "background_image": "https://media.rawg.io/media/screenshots/b8a/b8ab2049bacb1a32966498f5a1a055e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Brooklyn Gamery", "Catt Small"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}