{"id": 926109, "slug": "bark-itch-foxabloom", "name": "Bark (itch) (Foxabloom)", "name_original": "Bark (itch) (Foxabloom)", "description": "<p>For my first game jam winter 2023</p>\n\n<p><strong>Disclaimer</strong>: <em>THIS IS A DEMO/PROTOTYPE, NOT A FULL GAME, and is UNFINISHED. This game will have bugs, I've tried flattening out most of them in this time frame. But can't get them all out, If you find any bugs please tell me so I can improve. I'm mostly experienced in 3D game Development so trying out a 2D game was really fun! but a bit weird XD. It's also the first Game that I've ever tried to publish:).</em></p>\n<p><strong>Description</strong>:</p>\n<p><em>Bark is a 2d Puzzle Platformer, You mostly live out your life as a cut-down tree stump. Your home is invaded by Invasious species that are tearing down plants and trees alike and need your help to regrow them back into bigger and better plants. Find the Required things that are needed to grow plants like Fertilizer, Enough water, and... Accelerant? Watch out for the bugs they don't like being disturbed that much, but go as you like! Either by moving around them or trying to defeat them. </em></p>\n<p><em>Navigate a large level to try and find the Required materials to grow your plant. It will grow as you collect them. Unless you're trying to water it of course. Once you complete growing the plant, Jump up and reach the goal!</em></p>\n\n<p><strong>Controls</strong>:</p>\n<p>Movement: </p>\n<p>-  A and D  (Or left and right numpad) to Move left and right.</p>\n<p>- W or up arrow to Jump.</p>\n<p>- Hold S to dig to extract water out of the ground.</p>\n<p>- E To use your ability (Top right of the screen).</p>\n<p>- \"[]\" to scroll through your abilities (top right)</p>\n<p>- Enter or Escape to Pause.</p>\n\n<p><em>Credits:</em></p>\n<p><em>Programming: Foxabloom </em></p>\n<p><em>Sounds: Foxabloom</em></p>\n<p><em>Art: Foxabloom<br/></em></p>\n<p><em>Music: Bobjt</em>, TinyWorlds, cynicmusic, Mopz</p>\n<p><strong><em>(All music is under CC0 (Creative Commons/ Public Domain), All credits are hyperlinked to their specific names)</em></strong></p>\n\n<p><em>Ideas &amp; stuff to improve on: \r\n</em></p>\n<p><em>This Idea mostly came from \"Growth\" in the Winter Jam 2023, My objective for myself was to make a game in a certain time frame, Mostly I used this to teach myself to stop adding onto my project and get overwhelmed. And to develop discipline and \"finish\" projects, I went out of my comfort zone on this and decided to learn about Puzzle Games, because I've always wanted to make good puzzles for my games that I've not released yet but, I'm pretty bad at them. so I've taken myself to learn about simple puzzles and try to innovate a bit from there, including trying to make the level design fit the gameplay. </em>\n</p>\n<p>\n</p>", "metacritic": null, "released": "2023-02-11", "tba": false, "updated": "2023-02-13T11:12:50", "background_image": "https://media.rawg.io/media/screenshots/1a8/1a849a3b0c0e93bc0d93b541f130b617.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Foxabloom"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}