{"id": 92614, "slug": "crest-an-indirect-god-game", "name": "Crest - an indirect god game", "name_original": "Crest - an indirect god game", "description": "<p>Welcome to Crest, an indirect god sim where you take care of humans as if they were your own children. But your only way to interact with them is by issuing commandments written in a pictographic language.<br/><br/>How these commandments are interpreted and remembered is not set in stone. What you communicate and what experiences your followers have with the environment is the basis for their religion. Over time, commandments can develop different associations and completely change their meaning. After all, your followers still have a free will and will sometimes do what they think is best for them, regardless of what you had in mind.<br/><br/>Consequences of your actions may not always be clear and you will need to be aware of the ever-changing environment and your people's disposition, amongst others their disposition towards you. Expressing yourself is the key of Crest; you will do so through your people and the world they shape.</p>\r\nKey Features\r\n<ul><li>Explore the high-concept of religion by building your own</li><li>Interact with the world by issuing commandments using a pictographic language</li><li>Progress by unlocking new words, adding more and more complexity to your commandments</li><li>Observe how your followers evolve as a result of your decisions</li><li>Micromanage a world where weather, vegetation, mineral deposits, drought and animal behavior will create surprises</li><li>Express yourself in a game without end-goal nor winning condition, allowing you to purely focus building your legacy in a world where you are the god of everyone</li></ul>\n<p>\n</p>\n<p>This game is made by Eat Create Sleep, reach us here:<br/></p>\n\n<p>eatcreatesleep.net<br/>@eatcreatesleep<br/>@CrestGame</p>", "metacritic": null, "released": "2015-07-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/980/9800df098320ae6861e96c7d276a5c59.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Eat Create Sleep"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}