{"id": 92629, "slug": "sagebrush-itch", "name": "Sagebrush (itch)", "name_original": "Sagebrush (itch)", "description": "<p>\n<em><strong>NOTE:</strong> This is a demo version of the game! The full release is still a work in progress.</em>\n</p>\r\n↪ UPDATES\r\n(You can snoop on my progress via my blog or my twitter!)\r\n<ul>\n<li><em>[1/12/2017]</em> After a long hiatus, I started picking back up on SB. Organized my outline for all my unwritten scenes.</li>\n<li><em>[1/30/2017]</em> Up to about 4k more to the script, nearly done with Dion's route.</li>\n<li><em>[3/9/2017]</em> +2k words, Romance scene for Dion complete</li>\n<li><em>[3/25/2017]</em> Dion's route is averaging more than 21k words! Woo! ^^</li><li><em>[5/22/2017]</em> Dion's route and Junya's routes are completely finished.</li><li>[5/30/2017] Current writing is being imported into the game script and will be starting to code. Screenshots of new content and progress will appear within this upcoming months on my twitter (@cooljalebis)</li><li>[4/3/2018] Still working on this! If you want to see screenshots and intimate WIPS of all the CGs and backgrounds that are getting done, support me on patreon! Also, the summary has been changed to sound a bit more specific and less vague. </li>\n</ul>\n<p>\n<br/>\n</p>\r\n\r\nTHE STORY SO FAR...\r\n<p>It's the end of\r\nhis sophomore year and Ezra has come to a conclusion: he must drop\r\nout of college by the end of the semester. As if an unfinished\r\ncollege degree isn't bad enough, having a few budding romances mixed\r\nin with his lingering existential crisis is the last kind of cocktail\r\nfrom hell Ezra needs in his life right now. As his days as a college\r\nstudent near to a close, he must come to terms with all of his\r\nresentments, fears, relationships, and most importantly—himself.</p>\n<p>\n<em>Created as an entry for \r\n\tYaoijam 2016. </em>💖\r\n</p>\n<p>\n<br/>\n</p>\n<p>\n</p>\n<p>\n<em>↪ View the lemmasoft thread for more information about the game!</em>\n</p>\n<p>\r\n\t➡ \r\n\t<em>And reblog the tumblr post to spread the word!</em>\n</p>\n<p>\n<br/>\n</p>\r\nGAME NOTES<br/>\n<p>\r\n\tThis is pretty much an alternate universe featuring the cast of a another VN I've been working on called Dakota Wanderers. Due to being busy with other projects, my progress for that visual novel hasn't gotten far in the script. Since the project started in 2013, I've been worried about keeping the interest I have for these characters, so I figured Yaoi Jam would be the perfect opportunity to let loose and write my characters freely. Happy to say that working on this game for the past two months has been a total blast! I'm very excited to release this demo, and hopefully the full release won't be too far off.\r\n</p>\n<p>\r\n\tThis demo is roughly 16k words and may take anywhere between 30 minutes to an hour of gameplay. I looked over the script as much as I could, but there's always the possibility of having errors. Feel free to contact me via \r\n\tlemmasoft or \r\n\ttwitter if you encounter any bugs or grammatical slip ups.\r\n</p>\n<p>\r\n\tAlso, any feedback on the demo would be much appreciated! The full release is still in the works, so any insight on how to improve the experience would be great. Thanks!\r\n</p>\n<p>\n<br/>\n</p>\r\nWARNINGS\r\n<p>\r\n\tAlcohol use + some foul language\r\n</p>\r\nCREDITS\r\n<p>\n<strong>Story and Art</strong> - Boniae\r\n</p>\n<p>\n<strong>Backgrounds</strong> - Morguefile, my personal photos, Sims 3(dorm placeholder)\r\n</p>\n<p>\n<strong>Music </strong>- Alan Ruckus, Sunsearcher, ZuikakuP, Greg Reiter, TAM music factory\r\n</p>\n<p>\n<strong>Extra </strong>- Kla's transition wipes\r\n</p>", "metacritic": null, "released": "2016-08-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/072/07223d32598d0ad17646b15127e1d05c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["boniae"], "genres": [], "publishers": [], "esrb_rating": null}