{"id": 92621, "slug": "the-investigation", "name": "The Investigation", "name_original": "The Investigation", "description": "<p>\r\n\t[ \r\n\t<em>A serial killer. Two detectives.</em> <em>An anonymous tip.</em> ]\r\n</p>\r\n\r\nSUMMARY<br/>\n<p>\r\n\tThe Investigation is a small third-person 3D point and click room escape adventure where you take the role of \r\n\t<strong>Rebecca Castle</strong>, a fearless yet impulsive police detective. You and your partner, <strong>Christian Sanders</strong>, are following a lead on the <strong>Kingsroad Killer</strong>, a heartless murderer that kills his victims after torturing them for days.\r\n</p>\r\n\r\nTECHNICAL DEMO\r\n<p>\n<strong>The Investigation</strong> project has been developed using exclusively the Game Creator tools for Unity as a demo of what can be achieved without programming a single line of code.<br/>\n</p>\n<p>If you are interested in creating similar games you can give it a try heading to http://u3d.as/PNq.</p>\r\n\r\nKEY FEATURES\r\n<ul>\n<li>Move the character across the scene and interact with different elements.</li>\n<li>Unravel the story behind the Killer as you and your partner investigate an abandoned hospital.</li>\n<li>Cutscene driven story with incredible photorealistic environments.</li>\n</ul>\r\n\r\nWHY IS THIS GAME FREE?\r\n<p>\r\n\tOur business is focused on creating tools for developing games. We needed to test if it was really possible to create a full featured one with the \r\n\t<strong>Game Creator</strong> tools we've been working on, so we decided to create a (small) one.\r\n</p>\r\n\r\nCAN I GIVE YOU FEEDBACK?\r\n<p>\r\n\tPlease! We'd love to hear from you. Even if we're not going to make a complete version of this game (as we're focused on making the dev tools) we'd love to receive some feedback. Just drop us a line in the comments or send us an email at \r\n\thello@catsoft-studios.com.\r\n</p>\n<p>\r\n\tFor more information on how to create games with Game Creator visit \r\n\thttp://gamecreator.io.\r\n</p>", "metacritic": null, "released": "2017-05-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2b0/2b0b5443dbc9be3736cfce7570f36275.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Catsoft Studios"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}