{"id": 92625, "slug": "rym-9000-itch", "name": "Rym 9000 (itch)", "name_original": "Rym 9000 (itch)", "description": "<p><strong><em>Rym 9000</em> is a hyperkinetic shooter inspired by Akira, Neon Genesis Evangelion, and Guxt.<br/></strong><strong>A treasure-hunting journey to the Moon developed by <strong><em>Sonoshee</em></strong> and composed by <strong><em>Roex</em></strong>.<br/>A unique high-octane experience conceived to stimulate your senses and make your eyes and ears bleed!</strong></p>\n<p>\n<br/>\n</p>\n<p>\n</p>\n<p><em>Rym 9000</em> is a vertical shmup in which you fight your way through 5 levels of concentrated action to reach the Moon and find the Rym 9000 treasure; a legendary relic left by an ancient civilization, buried in the Moon for a generation of pilots to find and \"turn the world upside down.\"</p>\n<p>\n</p>\n<p>With an emphasis on haywire motion and experimental visuals from <em>Sonoshee</em>, along with a cyber-stellar soundtrack from <em>Roex</em>, Rym 9000 will take you on a chaotic trip of challenging but fair hyperkinetic fun.</p>\n<p>\n</p>\n<p>Achievements are set in place for the player to unlock World Log entries and know more about the world they're venturing into, as well as understanding the history behind the treasure that the protagonist and millions of other pilots are setting out to find.</p>\n<p>\n</p>\n<p>Fight your way through relentless hordes of enemies, defeat each area's boss all the way up to the Moon's guardian \"Diesel\", and register your score upon beating the game on a leaderboard that records the top 10 players in the world.</p>\n<p>\n</p>\n<p>\r\n\tRym 9000 features a soundtrack from <strong>Roex</strong>.\r\n<br/>His albums can be found on Bandcamp and Soundcloud:\r\n<br/>\n<br/>\n</p>", "metacritic": null, "released": "2016-09-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/757/757e9bb7420abd335df3a332c7acfc44.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["Sonoshee"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}