{"id": 92628, "slug": "mediterranean-voidland", "name": "Mediterranean Voidland", "name_original": "Mediterranean Voidland", "description": "<p>\r\n\tMediterranean Voidland is a game about exploring a village in the Mediterranean and watching it from different points of view while listening to good music.</p><p>Mediterranean Voidland is a voidscape game. After reading this article about voidscapes, I have been fascinated by the whole concept of <em>virtual dioramas</em> and then decided to make one about villages in the Mediterranean (particularly on the coast of northwest Italy, where I was born).</p><p>At the same time I've started reading An Architectural Approach to Level Design by Chris Totten, and I have been fascinated by the description of the Acropolis in Athens, how everything is carefully placed to give the visitor the best perspective of the various monuments as they walk up to the hill. So I've figured my game would have been about views. About seeing a beautiful landscape from different perspectives.</p><p>Then I've decided to add music to this small diorama. I chose Palconudo, mainly because their music has its root deeply in the very same mediterranean culture. The idea is to combine the visuals and the music to try to evoke the very same emotions you feel when visiting these small fisherman villages.</p><p>I kinda wanted to give you a tiny piece of the Mediterranean, without the need to travel here to experience it (but that's certainly worthwile, so please, do come here if you liked this game).</p><p>That's it. I made it with love, so I hope you'll enjoy playing it as much as I've enjoyed making it.</p><p>Mediterranean Voidland has been featured at the 2017 Leftfield Collection, during EGX Rezzed in London.</p><p>You can download music by Palconudo on iTunes or Google Play. To know more about their art you can follow their Facebook page.</p><p>Are you from the press and want to write about Mediterranean Voidland? Cool! Just take a look at the official press release.</p>", "metacritic": null, "released": "2014-10-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a97/a97e4a73d59a9be527fe257caec6be99.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Fede Makes Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}