{"id": 926696, "slug": "mite-terror-in-the-forest", "name": "MITE - Terror in the forest", "name_original": "MITE - Terror in the forest", "description": "<strong>MITE</strong> is a third-person horror game, which makes use of Japanese folklore and a popular history of the regions... live the terror of being chased at night in the most haunted forest in the region, by a strange yokai who It haunts you when you stop looking at it.<br/><br/><br/><br/>A hiker who has lost his wife and son in one of the most enchanted forests in the region, a forest where one should not be at night, he must find his partner and son... while being chased by a strange creature that it gets closer little by little while you stop looking at it... more and more speed, don't fall while you walk... because if you stop looking at it... maybe when you get up you will find it face to face, run away from the forest with your family and try not to come back to the.<br/><br/><br/><br/><br/><br/><ul><li><strong>Fear:</strong> Experience the terror of walking in a forest with spirits and Japanese yokais.<br/></li><li><strong>Exploration:</strong> Wander through the forest, walking carefully and trying not to stop looking at the strange spirit for a long time... or it will approach you.<br/></li><li><strong>Orientation:</strong> In a forest and without a compass, the most difficult thing is to find your way around, make it on your own, your family is waiting for you.<br/></li><li><strong>No saving:</strong> This game is made to be passed in the same game, due to its simplicity, but it will not be an easy task.</li></ul><br/><br/><br/><br/><br/>Our studio specializes in scary games, and we often use Japanese folklore and mythology as a source of inspiration.<br/><br/>", "metacritic": null, "released": "2023-02-12", "tba": false, "updated": "2023-02-17T04:09:36", "background_image": "https://media.rawg.io/media/screenshots/214/21406501bf44a642bcbf38c0bbb06cce.jpg", "website": "https://www.kanashi.site/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 336, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kanashi Studio"], "genres": ["Action", "Indie"], "publishers": ["Carlos Julian Lopez Garcia"], "esrb_rating": null}