{"id": 92660, "slug": "the-psychopomp", "name": "The Psychopomp", "name_original": "The Psychopomp", "description": "<p>This is a short game with gamplay mechanics that are inspired  by classic metroidvanias, with hand-drawn artwork that takes inspiration from those old browser-based flash games and (hopefully) combines them into a more modern feel. <br/></p>\n<p>The story (though hardly implemented at this point) is based around spirit politics that take place in the underworld, leading up to the genocide of psychopomps, entities that guide souls to their destination in the underworld.  The gates to and from the underworld have been sealed, and the flow of resources used by spirits have been haulted. It's up to you, one of the last psychopomps, to find a way to reopen the gates and restore peace for those that nearly wiped your race from existence. <br/></p>\n<p>The art was made throughout June and the code was slapped together during July. It's far from perfect but it might still be kinda cool, maybe?<br/></p>\n<p><strong>Features</strong></p>\n<ul><li>Puzzle based level design, laced with story elements.</li><li>Hand-drawn levels (no tiles or heavily repeated props)</li><li>Classic frame-by-frame animation (no tweening or symbols)</li><li>Standard HD resolution (1920 x 1080)</li><li>Full controller support (recommended)</li></ul>\n<p><strong>Problems</strong></p>\n<ul><li>The dialogue cloud at the beginning is bugged out and annoying. It was the last thing I did and I won't have time to fix it by jam's end.</li><li>I forgot to include the interact button in the pause menu. It's C, Y or triangle. You'll need to know that, probably.</li><li>There's a weird pitch sound caused by charging on the first shot and only sometimes...</li><li>The starting cutscene was removed last minute, so there's obviously a missing transition into the game. :/</li><li>Controller vibration may get caught in a loop?</li></ul>\n<ul><li>There will likely be various graphical glitches and lack of direction at times, but hopefully it's still enjoyable.</li></ul>\n<p><strong>System requirements</strong></p>\n<ul><li>A dedicated graphics card (512mb)</li><li>2gb RAM</li><li>core2duo 2.66ghz +</li></ul>\n<p>If your controller is not working, make sure you have the latest directX drivers installed.</p>\n<p>Supports xboxone, xbox360, ps4 (the ones I've tested) and most generic controllers.<br/></p>", "metacritic": null, "released": "2018-07-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/661/66186595131f085709bcef4b3c8a6da8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VinnNo."], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}