{"id": 926786, "slug": "plan-b-terraform", "name": "Plan B: Terraform", "name_original": "Plan B: Terraform", "description": "Manage the resources of a newly discovered planet. Bring supplies to the cities and manage its terraformation. <br/><br/><ul><li><strong>Extract minerals, transform and transport them to the cities</strong>, so that they can expand and progress.<br/></li><li>Build <strong>terraforming devices</strong>, such as greenhouse gas factories, in order to progressively <strong>warm up the atmosphere</strong>, make the ice melt and make rain fall, until <strong>rivers and oceans form</strong>. Then, when the conditions are met, you will be able to plant trees and watch them grow into <strong>large forests</strong>.</li></ul><br/><br/><br/>Plan B: Terraform is a <strong>calm and contemplative</strong> science-fiction game based on a credible near future. It also offers an educational approach to <strong>greenhouse effects and water cycle mechanisms</strong>.<br/><br/>Earth has a very hard time limiting global warming and its catastrophic consequences. Humanity needs a plan B in order to ensure its survival. This is up to you!<br/><br/><h3>Innovations:</h3><ul><li>Huge planetary scale playground, composed of more than <strong>a million hexagons</strong>. <br/></li><li>The <strong>\"real\" terraformation of a planet</strong>, with a <strong>global and real-time simulation</strong> of temperature, vegetation, rain and water flowing to form dynamic rivers and oceans.<br/></li><li>Radical evolution of the population, <strong>from a few inhabitants to a million and more</strong>.</li></ul><br/>", "metacritic": null, "released": "2023-02-15", "tba": false, "updated": "2024-04-22T21:11:01", "background_image": "https://media.rawg.io/media/screenshots/b10/b10a0d18803e08e4d381c03d9a239e21.jpg", "website": "http://gaddygames.com", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 14, "toplay": 3, "dropped": 3, "playing": 2}, "playtime": 5, "achievements_count": 13, "ratings_count": 5, "suggestions_count": 320, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["Gaddy Games"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Gaddy Games"], "esrb_rating": null}