{"id": 92678, "slug": "mask-of-semblance", "name": "Mask Of Semblance", "name_original": "Mask Of Semblance", "description": "<p>Mask of Semblance Demo Version 4.0 Now Available!<br/></p>\n<p><strong>Mask of Semblance</strong> is a hand painted Action/Adventure RPG focusing on problem solving, stylish combat, and moral decision making. The world will be designed to be playable forwards and backwards.</p>\n\n<p>Basic Movement Controls</p>\n\n<p>Ability Controls (Acquired)</p>\n<p>You wake up in a cold, dark room. The dust and smoke surrounding you shades your surroundings with mystery. Your senses are stale from the timeless slumber you seem to have woken from. Pain is rushing through your body as you muster the power to stand up from your resting place. Your clothes, your name, your purpose...only a fragment of your memory persists.<br/></p>\n<p><em>A malformed light in the form of eyes, a mouth, and mysterious marking beckons you over. </em></p>\n<p>“Dear boy”, the Mask begins, “let’s make a deal...”, not only greeting you but offering to make a nameless bargain. “I will open the doors of this sanctum for you if you agree to take me to my master” are the terms. Upon acceptance, the boys journey begins.</p>\n<p><strong>In Mask of Semblance you will be choosing paths, choosing sides, exploring, fighting, solving puzzles, and discovering secrets along your journey. You might also uncover some interesting facts about yourself in the process!</strong></p>\n<p>The Demo includes basic combat, puzzles, and exploration.</p>\n<p>Mask of Semblance covers themes of the self and the mind, as well as the cyclical nature of life. It also incorporates themes of the duality of Nature vs. Technology.</p>\n<p>Check out our Facebook for updates on development!<br/>www.facebook.com/MaskOfSemblance</p>", "metacritic": null, "released": "2017-08-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a7b/a7bf1c5be5e352366b7c691a35734bbf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 324, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RedEssenceGames"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}