{"id": 926742, "slug": "clear-the-space", "name": "Clear the Space", "name_original": "Clear the Space", "description": "Your starship is on an important mission. Flying across an unnamed segment of the Universe, you are suddenly trapped inside invincible walls together with a semi-intelligent cloud of asteroids. These asteroids must be somehow connected with the walls. Fortunately, your starship carries special ultra-hard projectiles which don't explode on impact. Unfortunately, there are only 7 of them...<br/>Don't waste your time, clear the space® from those asteroids and continue your interrupted mission!<br/><br/>So, this is a fast-paced Arkanoid-like third-person shooter taking place among colorful planets, shimmering stars, peacefully moving rocks and even a couple of comets.<br/><br/><ul><li>Hit an asteroid more than one time to destroy it. Besides, the cloud gradually resurrects itself, so be quick.<br/></li><li>Some destroyed asteroids can throw a collectible bonus... or an antibonus. You chase bonuses, and antibonuses chase you &gt;:)<br/></li><li>Your starship can become bigger, can shoot a dozen projectiles at once, can cast epic meteor showers or shoot equally epic laser rays which slow the flow of time... Just catch the right bonus.<br/></li><li>But if you catch an antibonus... Deal with the consequences.<br/></li><li>Unique djenty soundtrack, composed... programmed by amazing Dennis Martensson, turns an ordinary shooter into a rhythm game! Please visit @DennisMartenssonOfficial on YouTube and see what can be achieved when music befriends programming :D<br/></li><li>You can switch between tracks in the main menu by setting the music volume to zero and then turning it up again. The word \"Music\" itself is clickable. But please note that the music is not playing while the menu is on screen.<br/></li><li>Cheats. This game has cheats. Discover them all, but don't tell anyone. And let's the fun begin!</li></ul><br/>Only two fingers are required to control the ship: left arrow key (or 'A') and right arrow key (or 'D'). Cheating requires additional fingers though.<br/>No keyboard no cheating, so pick up a controller if you want to set your record honestly:)<br/><br/>Turn the asteroids to dust and receive your much-deserved reward in the end!", "metacritic": null, "released": "2023-02-14", "tba": false, "updated": "2023-02-17T05:12:55", "background_image": "https://media.rawg.io/media/screenshots/583/583873429bd73661d385bdded2e268e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NotGameYet"], "genres": ["Action", "Casual", "Indie"], "publishers": ["NotGameYet"], "esrb_rating": null}