{"id": 926795, "slug": "the-dark-pictures-anthology-the-devil-in-me-friend", "name": "The Dark Pictures Anthology: The Devil In Me - Friend's Pass", "name_original": "The Dark Pictures Anthology: The Devil In Me - Friend's Pass", "description": "A series of stand-alone branching cinematic horror games from the studio behind Until Dawn. Easy to pick-up and play in short sessions, alone or with friends. The Devil in Me is the fourth game in the series and the Season One finale.    <br/>\n<br/>\r\nA group of documentary film makers receive a mysterious call inviting them to a modern-day replica of H.H. Holmes ‘Murder Castle’  America’s first serial killer. But on arrival they soon discover they’re being watched, and even manipulated, and suddenly there is much more at stake than just their ratings…<br/>\n<br/>\r\nDon’t play alone – invite a friend and double the scares during your time in The Devil In Me.  The Friend's Pass works on a single save game and allows you and a friend one full playthrough of The Devil In Me with only one of you needing to own the full version.<br/>\n<br/>\r\nA Friend’s Pass allows anyone who has purchased a copy of The Devil in Me to invite a friend to complete a playthrough of the Shared Story mode for free. Your Friend’s Pass is a one-time-use key, so be sure to invite a friend that you can count on in those life and death moments.", "metacritic": null, "released": "2023-02-15", "tba": false, "updated": "2024-02-12T11:31:21", "background_image": "https://media.rawg.io/media/screenshots/0e5/0e549fdcefe3fc734f8586b34ecaf28f.jpg", "website": "https://www.thedarkpictures.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 26, "beaten": 2, "toplay": 1}, "playtime": 7, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Supermassive Games"], "genres": ["Adventure"], "publishers": ["BANDAI NAMCO Entertainment Europe"], "esrb_rating": "Adults Only"}