{"id": 926746, "slug": "truxton-2023", "name": "Truxton (2023)", "name_original": "Truxton (2023)", "description": "<h3>\"POWER ON! ALL SYSTEMS GO! TAKE OFF!\"</h3><br/>Truxton (known in Japan as \"Tatsujin\") loops back in full glory with modern luxuries, including online leaderboards, arcade-accurate emulation, quick saves, and the brand-new beginner mode. It's an all-thrills arcade blast and a stellar showing of Toaplan's signature blend of action, speed, and excitement that's kept gamers on their toes for decades!<br/><br/>The ruthless Gidans are flying your way armed with tanks, guns, and explosives for an all-points takeover! Confront the invaders head-on in your Super Fighter, the mightiest assault ship in the universe, and blast them to kingdom come! <br/><br/><h3>ORIGINAL GAME FEATURES:</h3><ul><li>​​Take out all asteroid bases across massive stages in this vertically-scrolling shooter!<br/></li><li>Fight off alien hordes using several weapon styles, including the mighty Truxton Beam, Power Shot, and Thunder Laser. Each is capable of disintegrating any speeding onslaught!<br/></li><li>Wreak even more havoc by upgrading all weapon types over and over, multiplying their raw destructive powers!<br/></li><li>Get into an alien-zapping mood with Masahiro Yuge's original soundtrack.</li></ul><br/><h3>QUALITY OF LIFE IMPROVEMENTS:</h3><ul><li>Minimal Input Lag: Emulation, input processing, and rendering all complete on the same frame.<br/></li><li>Quick Save using F1-F10, Reload with Shift+ F1-F10<br/></li><li>Online leaderboards for Single Credit, No Assist, and Assisted plays.<br/></li><li>Instrument panels with extra gameplay information and artwork.<br/></li><li>Rewind the game between 10-18 minutes, depending on the action.<br/></li><li>Capture sharable replays to immortalize your alien-blasting memories (or funny moments).<br/></li><li>Assist Features such as auto-fire at multiple rates.<br/></li><li>Very Easy Mode: Lower the difficulty to breeze through the adventure.<br/></li><li>Pixel perfect or full-screen scaling in windowed or full-screen mode.<br/></li><li>Rotate the gameplay in 90-degree increments. <br/></li><li>Steam Achievements<br/></li><li>Choose between Raw Input on Windows or Steam Input.<br/></li><li>Hone your skills in the ultra customizable practice mode!</li></ul>", "metacritic": null, "released": "2023-02-14", "tba": false, "updated": "2023-02-17T05:18:35", "background_image": "https://media.rawg.io/media/screenshots/112/1124e7e6f8391846549b14ae8cbdbc7d.jpg", "website": "https://www.bitwavegames.com/games/truxton", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 323, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Toaplan", "Bitwave Games"], "genres": ["Action"], "publishers": ["Bitwave Games"], "esrb_rating": null}