{"id": 926768, "slug": "army-of-tentacles-not-a-cthulhu-dating-sim-2", "name": "Army of Tentacles: (Not) A Cthulhu Dating Sim 2", "name_original": "Army of Tentacles: (Not) A Cthulhu Dating Sim 2", "description": "<h3>Humanity was destined to fall.</h3><br/>Your people, the Great Old Ones, were legends among the humans. Tales were told about their might, and whispers rose of how they would one day claim the entire human planet as their own. Of how mankind would simply go insane at the very sight of their malevolent beauty. Finally, the day came for the armies of the unspeakable horrors to rise.<br/><br/>But this isn't that tale.<br/><br/>You are the <strong>B Squad</strong>, a band of misfit monsters deemed too unworthy to fight in the Battle of Innsmouth, the conflict that has been planned as the first stage of monster domination over the humans. But you'll show them. You'll show everyone! You are a tough band of monsters! Yeah, you're so scary!<br/><br/>Traverse the town of Innsmouth, the local college of Miskatonic University, the dark caves and corners of the planet where no mortal fears to go, all in the name of carving out your own legend! Er, legends, as there are a lot of other people in your squad, too.<br/><br/><ul><li> <strong>Critter Combat!:</strong> Utilize your fellow monsters to battle the humans in visceral (kind of) party-based combat! </li></ul><ul><li> <strong>Critter Combat!, PART TWO:</strong> Collect Critter Beast cards in order to increase your roster of available fighters! </li></ul><ul><li><strong>A party of millions except not!:</strong> Recruit a varied group of outcasts that will provide hilarious commentary to life and its various situations! As well as help you out in Critter Beast Battles! They all have different skills! Yay, teamwork!</li></ul><ul><li><strong>STATS!:</strong> People love those!</li></ul><ul><li> A sequel to <strong>Army of Tentacles: (Not) A Cthulhu Dating Sim</strong>!</li></ul><ul><li> RPG/Visual Novel hybrid action!</li></ul>", "metacritic": null, "released": "2023-02-14", "tba": false, "updated": "2023-02-17T05:54:13", "background_image": "https://media.rawg.io/media/screenshots/a5b/a5b5bd8a086ebb4c454fba09759c0dec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 367, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Stegalosaurus Game Development"], "genres": ["Adventure", "RPG", "Strategy", "Casual", "Indie"], "publishers": ["Stegalosaurus Game Development"], "esrb_rating": null}