{"id": 926762, "slug": "i-will-be-there-2", "name": "I WILL BE THERE", "name_original": "I WILL BE THERE", "description": "<h3> DO YOU HAVE WHAT IT TAKES? </h3><br/>I WILL BE THERE is the love story of a lonely man with an RV in a zombie-infested world. It is a unique '<strong>Survival-Adventure</strong>' game with visual novel aestethics and role-playing elements.<br/><br/>Tyler is a middle aged man who longs to reach his loved one in a zombie infested world. Good news: He has an RV... and bad news: He has to go more than two-thousand miles. To do this, Tyler has to take care of himself and the RV, meet strangers and uncover truths along the way.<br/><br/><h3> Features: </h3><br/><ul><li> Many events you will encounter in this game are random, so every game is a unique adventure! Collect mushrooms, hunt rabbits, loot stashes...<br/></li><li> Includes 16-color objects and backgrounds, inspired by pixelated retro games.<br/></li><li> Background images consist of hundreds of photos of real-life locations, taken by the developer himself. No trip is alike!<br/></li><li> A fully functional RV: You have to take care of all the maintenance of the RV where you eat, rest and get ready for the next day.<br/></li><li> The Day/Night cycle allows you to travel &amp; explore in daylight and spend the night in safety... or not. Your call.<br/></li><li> With classic role-playing elements, distribute points among skills on the character creation screen. Create your own special character.<br/></li><li> With the official soundtrack and sound effects to help you immerse yourself in the game, feel the loneliness deep inside.</li></ul><br/><h3> Roadmap: </h3><br/><ul><li> Bugfixes and balance tweaks will be delivered as needed in the months following the game's release. The community feedback is much appreciated!<br/></li><li> New events and story elements will be added in future as an update; NOT as a paid DLC.</li></ul>", "metacritic": null, "released": "2023-02-14", "tba": false, "updated": "2023-02-17T05:43:22", "background_image": "https://media.rawg.io/media/screenshots/586/5867d51eafc4ca191979c559c2e898c1.jpg", "website": "http://tayfuntuna.com.tr/games/i-will-be-there/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 294, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tayfun Tuna"], "genres": ["Adventure"], "publishers": ["Tayfun Tuna"], "esrb_rating": null}