{"id": 926710, "slug": "secret-camera", "name": "Secret Camera", "name_original": "Secret Camera", "description": "<p>Caution<br />\n⚠️Contains NTR Stories⚠️<br />\nBackground of the story<br />\nI inherited a property in the name of a distant relative who has no family and came to this old rental apartment building. When I open the room where the landlord is located deep in the top floor, I see a complete set of surveillance equipment, as well as a large number of data documents and handwritten notes. Looking through these records, I realized that my relatives had been doing spiritual research on hypnosis and brainwashing for decades, and had used the tenants as experimental subjects to observe and record the results of brainwashing and spiritual transformation. It was like a dream-like treasure trove, and the dark, dark side of the heart followed suit.<br />\nGame Features<br />\nNine tenants with different characteristics, there must be something you like<br />\nUp to 45 single-person CGs without differential vertical painting<br />\nAdditional multiplayer CGs waiting for players to discover<br />\nSome CGs are made in Live2D<br />\nMore than 120,000 words<br />\nFull recall function  Character stand-ups Character Q version stand-ups Character profiles Unlocked CGsSimple and easy to understand Qix gameplay<br />\nGameplay<br />\nUse keyboard [↑] [↓] [←] [→] to move along the edges<br />\ncombine with the blank key to draw a line and capture territory<br />\nto avoid detection by tenants<br />\nDodge anything that stops you<br />\nPick up items to briefly enhance your abilities<br />\nCapture tenants by completing a certain percentage of enclosures<br />\nTorture the captured tenants to unlock CGs<br />\nEnjoy the exciting CG<br />\nSpecial thanks<br />\n★Music: 魔王魂</p>", "metacritic": null, "released": "2023-02-13", "tba": false, "updated": "2023-03-02T19:14:17", "background_image": "https://media.rawg.io/media/games/36c/36c6b6cb0f9c36a5dd714f648e4ce633.jpg", "website": "https://www.instagram.com/secretcamera2209/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "dropped": 1}, "playtime": 1, "achievements_count": 27, "ratings_count": 1, "suggestions_count": 355, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Secret Camera"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Secret Camera"], "esrb_rating": null}