{"id": 926861, "slug": "polywar-3d-fps-online-shooter", "name": "POLYWAR: 3D FPS online shooter", "name_original": "POLYWAR: 3D FPS online shooter", "description": "Passionate about action PvP FPS games? Want to test your true shooter skills? Ready for the challenge?<br/> <br/>Well, you've come to the right place, buddy! Join POLYWAR — the international multiplayer first-person shooter without auto-shooting — enter the war zone and gain your first frag! In this breathtaking 3d shooter game with modern graphics you will find all that you need for the grand battle — various maps, plenty of characters, the possibility of weapon customization, different game modes, marketplace for players and many other cool features.<br/> <br/>POLYWAR is an exciting online shooting game that will put your reaction, accuracy, tactical and warfare skills on test. Grab the gun, rush to the battlefield, and fire, soldier! Your prime concern now is to face the enemies and survive in death ops. Be a team player or a loner - there are many ways to win the battle, and the choice is yours. <br/> <br/>Why POLYWAR will definitely impress you::<br/> <br/>Real action experience — Standard and tactical reloading, different magnifications of sights, recoil, smoke from the barrel and many pleasant little things helping you to immerse in real action.<br/> <br/> <br/>Powerful arsenal — All weapons in the game are available for free and unlocked depending on the player level. Become an accurate sniper, a daring shooter, or surprise your enemy with a shot from a grenade launcher.<br/> <br/>Various maps and game modes — Shooting range, Team mode, Gungame and even Duels: choose a mode to your taste.<br/> <br/>Weapon customization — The more you play with the gun, the more additional modules will be available to you! Use scopes, silencers, skins, trinkets and more to customize your weapons and make them suit your playstyle.<br/> <br/>Dynamic gameplay and user-friendly controls — Customize the controls to your preference.<br/> <br/>Marketplace — Build your collection of skins and trinkets, and trade them with other players in the marketplace.<br/> <br/>Light weight and high FPS — Thanks to good optimization, the game doesn't take up much space and shows high FPS even on weak mobile devices.<br/> <br/>Constant updates and active community<br/> <br/>Choose your character: brave soldier, fearless woman, well-aimed sniper or other skillful shooters. Pick your favorite gun from assault and sniper rifles, pistols, shotguns, machine guns, etc. Be sure you have a bullet for each enemy to stay alive in this war. Be on top and stay strong at critical moments during the war ops. Upgrade your hero and weapons, show the force of your counter strike in this modern PvP combat.<br/> <br/>Play online with millions of players all over the world or challenge yourself in thrilling private battles with your friends. <br/> <br/>Now your duty calls you to the fight! Hurry up, warrior! <br/> <br/> <br/>Warning: the application requires a stable Internet connection.", "metacritic": null, "released": "2023-01-25", "tba": false, "updated": "2023-02-17T08:00:33", "background_image": "https://media.rawg.io/media/screenshots/7d6/7d69573166f4dc7703705b057014ffb5_3OgfPHI.jpg", "website": "https://azurgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Azur Interactive Games"], "genres": ["Action", "Adventure"], "publishers": ["AZUR INTERACTIVE GAMES"], "esrb_rating": "Teen"}