{"id": 926864, "slug": "stickman-master-hero-fight", "name": "Stickman Master - Hero Fight", "name_original": "Stickman Master - Hero Fight", "description": "This is a multi-dimensional superhero and anime character combination fighting mobile game, with a real hitting feel and dynamic music, allowing you to experience the fun of fighting.<br/>During the game, you can unlock dozens of heroes to fight with you, allowing you to experience the cool fighting skills and explosive visual impact brought by different heroes on the way to explore the game.<br/>There is also a surprise gashapon machine that can help you improve the abilities of heroes and weapons to meet more and more powerful opponents. Air combat requires constant adjustment of one's position and faces the enemy at all times<br/>It is also beneficial to escape the enemy's skill attack, so as to make a Jedi counter-attack! ! ! Endless tower<br/><br/>How to play<br/>Story Mode: Hundreds of game levels are waiting for you to challenge, allowing you to experience the excitement of the storyline and the thrill of fighting and killing.<br/>Battle mode: classic 1V1, 2V2, allowing you to continuously improve your fighting skills and combat awareness, and use different heroes to participate in battles, which can improve your proficiency in each hero.<br/>Endless swiping towers: Fight until the last moment, challenge your extreme fighting ability, and break your own records again and again.<br/>Use the collected gold coins, crystals, and fragments to continuously improve your hero pool, enhance your hero's abilities, experience more fun and passionate fighting, and dominate the game.<br/>Combat Tips: Use the flashing button to avoid skills or adjust the position of the skill release to hit as many enemies as possible. Use a combination of normal attacks and skills to inflict maximum damage on the enemy<br/>At the same time, keep your blood volume healthy.<br/>Download the game now and join thousands of gamers. Here are your favorite heroes and anime characters.", "metacritic": null, "released": "2023-01-05", "tba": false, "updated": "2023-02-17T08:04:07", "background_image": "https://media.rawg.io/media/screenshots/3d9/3d9a821009f6ce87ccf6acd5c2629483_AzoeTwF.jpg", "website": "https://managamesgoglobal.blogspot.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MEGA META JSC"], "genres": ["Action", "Adventure"], "publishers": ["MEGA META JOINT STOCK COMPANY"], "esrb_rating": "Everyone 10+"}