{"id": 926868, "slug": "endurance-soul-cells-of-space", "name": "Endurance: soul cells of space", "name_original": "Endurance: soul cells of space", "description": "Endurance - is an action game with a story set on labyrinth spaceship in a far galaxy<br/>You’re a researcher on a starship \"Endurance\", and one day your team becomes insane and starts to act like zombies.<br/><br/>Goal<br/>So you will need to grab your pixel gun and survive in this starship. You will find out what happened to the team that gone crazy, and acts like stupid zombies. You also will need to rescue survived sane crew members and some of them will join you to complete your own team. You’ll be fighting with your former colleagues dead ahead in front of you, and defend your alias.<br/><br/>Game<br/>Endurance has a dead space ambience with whole bunch of labyrinth levels. It also has horror elements, which makes the story even more engaging. If you love action games or games where you shoot stupid zombies dead ahead and see all their dumb ways to die then download Endurance.<br/><br/>Playing options<br/>You can play using a gamepad as it’s one of those controller supported games. Endurance is a game you shouldn't miss if you live shooting games with thrilling gameplay and plot you won't get enough of.<br/><br/>In this pixel game, you’ll be surrounded by your space team liveable and talkative characters, which going to break a bit of this horror ambience to relax you and prepare for the hardcore battles with your foes and show them all dumb ways to die.<br/><br/>Weapons<br/>Explore this starship with a huge arsenal of pixel guns that you can use to defeat the whole army of your insance space team of stupid zombies, discover the whole story and find a lost light in this darkness.<br/><br/>This adventure shooter is full of references to many sci-fi movies as well!<br/><br/>And now just to sum up all the great gameplay features of this mystery<br/><br/>* Collect tons of weapon<br/>* Retro ambience<br/>* Hardcore gameplay<br/>* Explore mystery<br/>* Pixel art graphics<br/>* Atmospheric music<br/>* Dungeon like levels<br/>* One of the controller supported games<br/><br/>So If you’re a choice among thousands of shooting games and you're a fan of pixel games, retro games, indie games, controller supported games, labyrinth games with rpg elements, you need to stop doing whatever you’re doing, and download Endurance right now!", "metacritic": null, "released": "2020-06-12", "tba": false, "updated": "2023-02-17T08:09:35", "background_image": "https://media.rawg.io/media/screenshots/d51/d51ec42855d44b4254aa901acf3691d2_SP6GgRF.jpg", "website": "https://creauctopus.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ivan Panasenko"], "genres": ["Action", "Adventure"], "publishers": ["Ivan Panasenko"], "esrb_rating": "Teen"}