{"id": 926805, "slug": "starshifter", "name": "Starshifter", "name_original": "Starshifter", "description": "Starshifter is a game about shapeshifting, desert animals, and finding your place.<br/><br/><br/><br/>You play as Coyote, one of the Guardians tasked with maintaining balance on the earth.  Each Guardian has been gifted a power by the stars to help them protect the land from Darkness, but Coyote has no powers. One evening, a meteor shower causes the stars to fall from the sky, rendering the animals powerless to the spirits of the night who wish to reclaim the stars for themselves. Coyote, the only one used to being powerless, now takes up the Guardian role to return the stars. Coyote learns how to harness their new shapeshifting ability and uses it to explore farther than they ever could before.<br/><br/><br/><br/>There are four planned biomes, each populated with a variety of animals, like birds, deer, fox, bison, beavers, cougars, and more. You'll be able to talk to the other animals, learning more about them and helping them in their own quests, and even interact with them in cutscenes. As you collect more stars, your shapeshifting ability will grow, allowing you to reach higher places or fly for longer. Will you be able to retrieve all the stars and earn your right as a Guardian?<br/><br/><br/><br/>Explore the heights in the form of a crow, or narrow tunnels as a small weasel - there's no shortage of cliffs or caves to see, and many stars to collect in each biome. Stop Darkness from spreading by bringing back the light!", "metacritic": null, "released": "2023-02-15", "tba": false, "updated": "2023-07-21T07:03:57", "background_image": "https://media.rawg.io/media/screenshots/3f2/3f2c0a421e8683ffd267019a764e9470.jpg", "website": "https://coyotictrouble.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Coyotic Games"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["MediBang", "Coyotic Trouble"], "esrb_rating": null}