{"id": 926853, "slug": "block-craft-3dbuild-and-mine", "name": "Block Craft 3D:Build and Mine!", "name_original": "Block Craft 3D:Build and Mine!", "description": "Lets you skilled crafter to create your perfect dream island with unlimited sources and underground world. Hours of fun awaits you: make houses with amazing gardens, castles, forests and go mining, go swimming etc. It is FREE! This game has automatic saving, so you can always continue from where you left off.<br/><br/><br/>Improve your ability to imagination. Start placing objects and blocks in your quest to build your perfect world. There are no limitations to what you can accomplish, may it be magnificent garden or a sky scraper, and you can do whatever you desire. You are the god of your own universe; be a loving one, or destroyer its all up to you.<br/><br/>Explore the world, dig mines, collect resources, build and strengthen your house. You can produce wooden cabin, castles, and even cities easily by constructing and destructing blocks. You can start exploring through this world and discover new things and let your mind run free. In fact, the possibilities for creating different creations are endless.<br/><br/>Best graphics effect with HD textures. You can make things look amazing – just spend the proper time until you make them look exactly how you picture them to be. This game is suitable for all ages and it is both challenging and fun, so you can easily spend hours playing it.<br/><br/>You can send us an email for any questions that relate to the game or for any feedback, we will be happy to assist you as fast as we can. Give us 5 starts to improve the game for you and please leave comment. We appreciate the support. Thanks!<br/><br/>https://riccigame.com/block_craft_terms_and_conditions.html<br/>https://riccigame.com/block_craft_privacy_policy.html", "metacritic": null, "released": "2022-05-20", "tba": false, "updated": "2023-02-17T07:52:42", "background_image": "https://media.rawg.io/media/screenshots/460/460f2097f9ac2d56bf4d0a367842d96b_TL2Viro.jpg", "website": "https://bunbogames.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Group of Brothers Yazilim Sistemleri Anonim Sirketi"], "genres": ["Action", "Casual"], "publishers": ["Group of Brothers Yazilim Sistemleri Anonim Sirketi"], "esrb_rating": "Everyone 10+"}