{"id": 92681, "slug": "mystic-destinies-serendipity-of-aeons-shinji", "name": "Mystic Destinies: Serendipity of Aeons - Shinji", "name_original": "Mystic Destinies: Serendipity of Aeons - Shinji", "description": "<p>This will unlock the third released main story route AND epilogue of Mystic Destinies: Serendipity of Aeons, focusing on the character Shinji Hirayama.</p><p>\"It's fine, don't worry about it.\"</p><p>These are common words said by Shinji, who is well-known around Hagiwara's campus for being a helpful guy. But when people misread his reliable nature for something more, he withdraws into himself. It soon becomes clear that exploring the secrets of Shinji's past along with the mystical land of Avalon is the only way to break through the walls he's built around his heart.</p><p>Will you be able to reach Shinji's true nature, something even he himself lost long ago?</p>Features:<ul><li>Play through the Main Story AND Epilogue at a discounted price for itch!</li><li>Experience a different kind of love story with a balance between dark and light themes, and a strong emphasis on fantasy and action. </li><li>Characters have over a hundred expressions combined! </li><li>Three full-length canon endings per character - depending on your choices. </li><li>\"Bad\" endings mean your choices have more impact! </li><li>Read a completely different story with each route! </li><li>Learn about a world with deep lore and its own unique universe. </li><li>Gorgeous painted CG images. </li><li>Enjoy atmospheric high quality music, hand-picked for every scene. </li><li>Over five hours of content, with additional content on the way!</li></ul>", "metacritic": null, "released": "2016-10-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b69/b695556baf34ce5f34a90dadc0b12db4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Aeon Dream Studios"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}