{"id": 926858, "slug": "mechangelion-robot-fighting", "name": "Mechangelion - Robot Fighting", "name_original": "Mechangelion - Robot Fighting", "description": "Crazy about robot fighting games? Wanna fight robots on the mech arena? This robot battle game will not let you down. Your robot has to defeat real steel enemies in a mech arena. It’s hard to survive. Welcome to Mechangelion - Robot Fighting!<br/><br/>Upgrade your hero to defeat war robots. Unleash fighting attacks in one-on-one robot battle with simple gameplay. Use the control panel with specific moves, jabs, and punches like in real boxing games. Become a skilled robot builder. Improve your robot with the powerful weapon to kick the boss and complete the levels.<br/><br/>The robot battle game is sure to provide fun hours for players of all ages. Are you ready to enter a new era of fighting games? Use your battle skills and strategy to kill the villains. The mech world is watching you play!<br/><br/>MAIN HIGHLIGHTS<br/>- Engage in dinosaur battles. In the robot fighting game, you'll confront giant dinosaurs in addition to war robots. Defeat them and win in the dinosaur battle. This game is different from other dino games. So, you'll need to use your combat skills to take down the mech enemies.<br/><br/>- Create your own strategy. Be prepared for surprise attacks, tactical maneuvers, and the tricks of the enemies. Choose your plan wisely and prove your worth as a powerful war robot in the real steel world.<br/><br/>- Upgrade your robot. Unlock new weapons to use in combats and upgrade your robot's defense. To win the battle of the titans, your war robot must always be one step ahead of the enemy.<br/><br/>Download Mechangelion - Robot Fighting and get into a war robot. Defeat real steel robots and mech dinosaurs! Use your combat skills and various weapons. Are you ready to win the on the mech arena?", "metacritic": null, "released": "2023-02-02", "tba": false, "updated": "2023-02-17T07:57:28", "background_image": "https://media.rawg.io/media/screenshots/4d1/4d1762c7e2078874cbba0f962e62989e_PenNUO6.jpg", "website": "http://moonee.io", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MOONEE PUBLISHING"], "genres": ["Action", "Adventure"], "publishers": ["MOONEE PUBLISHING"], "esrb_rating": "Everyone 10+"}