{"id": 926865, "slug": "finding-hannah", "name": "Finding Hannah", "name_original": "Finding Hannah", "description": "Finding Hannah is a relaxing puzzle game about a woman navigating an early midlife crisis.<br/><br/>Hannah’s got it all: a well-paying job, a fancy coffee machine, and a comfortable life – so why isn’t she happy? Lead her on a journey of self-discovery as you explore beautiful scenes, find hidden objects, and merge items in this heartfelt family drama.<br/><br/><h3>🔍 A GAME OF OBSERVATION &amp; MEMORY</h3>Search each handcrafted scene to find all the hidden objects. Play at a laid-back pace, finding objects as you go, or master each location to improve your score.<h3>🔍 GENERATIONAL STORY</h3>Hannah is a woman searching for answers. She turns to her grandmother, Eva, and her mother, Sigrid, to find that each of them has her own unique story to tell.<br/><br/><br/><h3>🔍 CATCHY SOUNDTRACK</h3>Each level features an original, danceable music track that will make you want to move.<h3>🔍 CHARMING &amp; DIVERSE CAST</h3>Get to know a lively cast of characters across three time periods in Berlin.<h3>🔍 PUZZLING GAMEPLAY</h3>Each scene has multiple modes! Can you identify objects only using their silhouettes, or find all of the chess pieces as quickly as you can?<h3>🔍 MERGE &amp; UPGRADE</h3>Earn coffee, self-care goodies, and sweet treats by completing levels, then merge them to get better and better items! Unlock new scenes by fulfilling each order at your own pace.<br/><br/><br/>", "metacritic": null, "released": "2023-01-27", "tba": false, "updated": "2023-05-05T04:06:33", "background_image": "https://media.rawg.io/media/screenshots/974/97404fda451d8247d5684cc167576c3a_JsS9vlj.jpg", "website": "https://www.fein.games/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC", "iOS"], "developers": ["Fein Games"], "genres": ["Adventure", "Casual", "Indie", "Puzzle"], "publishers": ["Fein Games"], "esrb_rating": "Teen"}