{"id": 926838, "slug": "sacred-zodongga-defense", "name": "Sacred Zodongga Defense", "name_original": "Sacred Zodongga Defense", "description": "The island of Zodongga lay undisturbed for a thousand years, only the natives of the Hulla-Balla-Bazooki<br/>\r\ntribe inhabited the dense jungles and although fierce warriors they managed to live in peace and<br/>\r\nharmony with nature. Tales of a fabulous banana plantations located in the inhospitable mountains of<br/>\r\nZodongga inevitably reached the four corners of civilization and humanity’s greed (and taste for<br/>\r\nbananas) proved too strong to resist. <br/>\n<br/>\r\nShips full of soldiers and explorers set sail to find the legendary island. One morning the tribesmen saw the invasion force suddenly appear on the horizon. They quickly mobilized their warriors and prepared their defenses for the onslaught that was about to hit them.<br/>\r\nThe invaders come in waves and different nations send in their best troops. <br/>\n<br/>\r\nAs the chieftain (The Big Kahuna) of the Hulla-Balla-Bazooki tribe you have to organize the defenders and place your ambushes<br/>\r\nstrategically. “Alla Balla Hukka Gadai, Aka Cikala Ahana”.<br/>\n<br/>\r\nLiberally translated from local language: “When the monkey looks upon the mountain, he thinks of bananas...\"<br/>\n<br/>\r\nSacred Zodongga Defense is a 3D Tower Defense game with a fantasy theme.  The game features:<br/>\r\n- 100+ different levels<br/>\r\n- 3 difficulty settings (hard, intermediate and easy)<br/>\r\n- Unlock New Towers and encounter new enemies as you progress<br/>\r\n- Every level has a boss with special abilities to beat<br/>\r\n- A generous amount of bananas....", "metacritic": null, "released": "2023-02-16", "tba": false, "updated": "2023-02-17T07:32:10", "background_image": "https://media.rawg.io/media/screenshots/081/081903a82d9903ddf72666d1d61f61fc.jpg", "website": "http://www.crxentertainment.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CRX Entertainment"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["CRX Entertainment"], "esrb_rating": null}