{"id": 926866, "slug": "idle-guardians-never-die", "name": "Idle Guardians: Never Die", "name_original": "Idle Guardians: Never Die", "description": "■ New Contents Update - Hue Agency ■<br/><br/>The true ability behind the splendid transformation of the Guardians... is hidden in their costumes?!<br/>The Guardians' secret wardrobe is now revealed!<br/><br/>- New skins that will further upgrade your Guardian's abilities!<br/>- Create and synthesize the skin you want! Additional stats UP just by owning a skin!<br/>- Buff up when you complete the collection by collecting various skins in the closet!<br/><br/>↑↑↑Go check the Guardian Wardrobe right now ↑↑↑<br/><br/>---------------------------------------------------------<br/><br/>\"This is a real IDLE RPG!\"   <br/><br/>Guardians keep on going through the stages of the game, even when you're not playing!<br/>An auto-combat game with cute dot graphics and retro game nostalgia!<br/>Never die, Endless Rebirth IDLE Guardians! <br/><br/>-Game Features-<br/><br/>■ Legendary AFK RPG, Auto-Combat idle RPG <br/>AFK &amp; IDLE? It keeps on playing even when you're not! <br/>Everything is automatic, from the endless stages progression to auto-combat and auto-farming!  <br/><br/>■  Endless Growth and Rebirth System <br/>Every time you rebirth, become stronger faster. <br/>The Hero never dies! He just resurrects. <br/>Become stronger and conquer all stages and dungeons perfectly!<br/><br/>■ A RPG with unique Characters that are fun to collect !<br/>Unique game contents that bring back classic games such as  Whack-a-mole, Tetris, and Claw Machines! <br/>More than 160 characters with retro graphics and dot designs! <br/><br/>■  Never Stop Farming RPG <br/>24/7 fully operating Gold Mine Research Institute! <br/>Automatic farming of resources to strengthen the Guardians! <br/>Even offline, the Guardians are farming! <br/>That is the fun of automatic farming! <br/><br/>■  A special Enhancement System only for Children Guardians! <br/>Guardians powering up through level up and enhancement plus 'Promotion System'!<br/>When promoted, the Guardians' appearance changes and they get additional skills! <br/>Legend-class fun!<br/><br/>■ Endless Battles to enjoy with Endless Contents<br/>[Demon World] 'Demon' pet for the Guardians, Power up thanks to strong buffs!<br/>[Global PVP] World-class Global War that mobilizes all of union, balance and strategy<br/>[Pyramid] Endless rewards, Endless challenges, Endless dungeons and adventures<br/>[Dept Raid] Hunt the strongest Boss with your Guild members <br/>[Force Fight] 30 vs 30 XL Live Guild War <br/><br/>■ Shh, Full of secrets, Continue's secret lab! <br/>Another content for the Guardians, a secret island where wonderful research and inventions are hidden! <br/>Opening of a secret stage full of strong items, additional quests, diverse rewards!", "metacritic": null, "released": "2020-07-29", "tba": false, "updated": "2023-02-17T08:07:00", "background_image": "https://media.rawg.io/media/screenshots/e7a/e7a7c7091c971f94a169acb71153e7f9.jpg", "website": "http://www.superplanet.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 308, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SuperPlanet"], "genres": ["Adventure", "RPG"], "publishers": ["SuperPlanet"], "esrb_rating": "Everyone 10+"}