{"id": 926846, "slug": "pyroslam-vr-table-tennis", "name": "PyroSlam: VR Table Tennis", "name_original": "PyroSlam: VR Table Tennis", "description": "Power-Ups, Explosions, and Upgrades make PyroSlam the ultimate VR Table Tennis experience. Compete against players across the globe in ranked online multiplayer or battle a slew of unique AI bosses. Meticulously precise physics make every shot feel like the real deal.<h3>Spot-On Gameplay</h3><br/>Sure there's fire, ice, and super-bouncy-ball power-ups, but at it's core PyroSlam is a rock-solid Table Tennis simulator. You'll forget you're in VR... until the ball spontaneously combusts. Topspin, Backspin, Sidespin, Knucklespin... you get the picture. It's all there and you'll need to master it to climb the leaderboards.<h3>Power-Up &amp; Level-Up</h3><br/>Screw-Balls, InvisiBalls, Bouncy-Balls, Mini-Paddles, and Super-Bumpers are just a few of the wacky ways to out-play your opponent. Nothing beats watching your friend whiff a perfectly executed Freeze-Ball. Earn XP by winning matches and landing trick shots to level up and unlock new paddles, power-ups, avatars, and arenas.<h3>Global Matchmaking</h3><br/>Challenge your friends directly or climb the ranked matchmaking ladder. Whether you're crafty and consistent or a slam happy wildcard, all that matters is you bring home the win.<h3>Fun with Fire</h3><br/>Slam the ball hard enough and it'll burst into flames.  Land one of these pyro-shots for extra XP and bonuses.", "metacritic": null, "released": "2023-02-16", "tba": false, "updated": "2023-02-17T07:43:44", "background_image": "https://media.rawg.io/media/screenshots/69e/69ef51363009b7f66a0fc7f40f863406.jpg", "website": "http://www.pyroslam.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["kChamp Games"], "genres": ["Action", "Sports", "Indie"], "publishers": ["kChamp Games"], "esrb_rating": null}