{"id": 926933, "slug": "duet-cats", "name": "Duet Cats", "name_original": "Duet Cats", "description": "The cutie cat songs are out now hooman~ Let's control the hottest cat duet ever. Who will be the diva cat in this catcentric?<br/><br/>Duet Cats is the perfect mix between cute and fun, relaxing and challenging of the music rhythm, and the popular virtual cat game makes you can't stop, it really addictive!!!<br/><br/>CATS RULE:<br/>All you need to do is feel the rhythm of the cute cat songs and control your 2 hands so the cats are all fed. Fat cats all out fun meow<br/><br/>Cat food is falling continuously! Can you feed them all?<br/><br/>CAT FEATURES:<br/>- Duet with all cats<br/>Not one but a duet! Your 2 cats are singing their adorable meow meow together into a hilarious ensemble. You can fatten them up by feeding them all the falling food. Oops, may they become obese?<br/><br/>- Simple but addictive with 2 hand control <br/>Left, right, and...center, with 2 hands. Use your hand and your observation to move through hundreds of levels of music rhythm falling. It's not easy, but if you get through it all, clap hands kittens<br/><br/>- Various cute cats to collect <br/>If you're bored with the gray and white cat you started with, it's time to change its look! You can pick from many skins to change the cat breed: kitty charm, monty cat, maru cat, dubstep cat, Chorley cat. Or turn your kitty cat into something completely different: spider cat, Pikachu cat and more, collect them all! These cute fluffy mittens are yours. This list goes on!<br/><br/>- Remixes of the popular song with the cute cat sound <br/>More than 1000+ hit songs are waiting for you to unlock. Can you imagine what it would be like when combined with \"\"meow\"\" sound? I can't??? Hurry up and be the first to listen to it<br/><br/>Are you someone who is looking for animal games or adorable cat games with a wide variety of music genres? Those who are looking for relaxing games, idle games, or role-playing games? Are you looking for more addictive games in this genre? Duet Cats is the perfect gift for you <br/><br/>Lead your adorable furry cats into shining diva cats", "metacritic": null, "released": "2023-01-03", "tba": false, "updated": "2023-02-17T09:26:48", "background_image": "https://media.rawg.io/media/screenshots/850/850dfd39ac979733e0e49acfea2ea192.jpg", "website": "http://amanotes.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["AMANOTES PTE"], "genres": ["Casual"], "publishers": ["Amanotes Pte"], "esrb_rating": "Everyone 10+"}