{"id": 926961, "slug": "mare-pocket-edition", "name": "Mare: Pocket Edition", "name_original": "Mare: Pocket Edition", "description": "“A Breathless Beauty Of A VR Game” – UploadVR<br/><br/>“Mare is a class act from start to finish. It’s a macabre and mysterious adventure that offers a haunting experience” – 6DofReviews<br/><br/>“The barren environment coupled with the superb musical score ensures Mare has an ambience and soul few VR projects achieve.” - VR Focus<br/><br/>“It’s a strikingly beautiful yet solemn adventure that pushes you ever forward toward the unknown.” – The VR Grid<br/><br/>As you wake up, stirred from a dreamless sleep with an unknown purpose, you find yourself in the strange lands of Mare embodying a mysterious artificial bird. <br/><br/>Crossing paths with a helpless companion you venture deep into unknown territory on a puzzling adventure while unraveling a mysterious narrative and the secrets hidden within. All in order to ensure the arrival of the companion at her impending destiny.  <br/> <br/>Features:<br/><br/>• Explore the vast and strange landscapes by the means of an artificial bird.<br/>• Guide and protect a vulnerable AI companion on her unexpected adventure.<br/>• Let the curiosity of the companion inspire you to explore and discover the underlying narrative spanning over 8 chapters.<br/>• Immerse yourself in the ambient atmosphere and otherworldly music for a soothing experience.<br/>• Search for lost artifacts hidden throughout the world in order to unlock the final secret of Mare.", "metacritic": null, "released": "2022-12-09", "tba": false, "updated": "2023-02-17T09:57:04", "background_image": "https://media.rawg.io/media/screenshots/96a/96a47f2436febc89bad5c609d11bdbc8_8KmCqFf.jpg", "website": "https://visiontrick.com/mare", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 481, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Visiontrick Media"], "genres": ["Adventure", "Puzzle"], "publishers": ["Visiontrick Media"], "esrb_rating": "Everyone 10+"}