{"id": 926929, "slug": "nonstop-game-3d-rpg", "name": "Nonstop Game: 3D RPG", "name_original": "Nonstop Game: 3D RPG", "description": "A super cool cyber raid 3D idle RPG, fun for all with low commitment!<br/> <br/> [Worldview]<br/> Catastrophe befalls, the end of the world is impending, and mankind is on the brink of extinction?!?!<br/> Who is the mastermind behind the virus, Sacred Beasts, the humungous crystal building, and those fearsome mechanical monsters?<br/> The five pillars of power - Mech, Bio, Gene, Mystic, and Alien - have risen one after another. Where do they originate from?<br/> In the face of imminent doom, will it be the survival of the fittest, or will the five forces come together to reveal the mysteries and restore world peace?<br/> <br/> [Game Introduction]<br/> Collect resources while you’re AFK. Leveling up is a breeze even if you’re busy with work or school.<br/> Nonstop Game is a super cool 3D idle role playing game with casual gameplay.<br/> Explore the world map chapters with auto battle. Sit back and enjoy the rad 3D skill effects.<br/> <br/> [Game Features]<br/> ◆Hassle-free idle RPG. Fight fast, level up even faster!<br/> Double-speed automated battle allows you to complete battles in a blink and clear maps with ease.<br/> Automatically collect resources while you’re offline for fast leveling up.<br/> <br/> ◆Summon over and over again, satisfy your desire to collect!<br/> More than 200 Heroes from 5 different factions available, each meticulously designed.<br/> Wild, cool, adorable... pick your favorite style!<br/> <br/> ◆Plenty of combination elements to play with. Assemble a squad that is uniquely yours!<br/> Freely pick and match a myriad of Heroes to form a 5-member squad.<br/> Attribute resistance, Hero Bonds, and formation are vital to secure victory.<br/> <br/> ◆Many modes of play, with loads of rewards!<br/> Exciting content beyond clearing maps and collecting items.<br/> Designed with multiple modes of play, including Mysterious Maze, Trial Array, Mysterious Cavern, and more.<br/> Challenge the various modes to receive generous rewards and resources, enjoy the game even without spending a single cent!<br/> <br/> ◆Adventure awaits on the all new map!<br/> Wage war against other Guilds in a one of a kind league event.<br/> Build your base, expand territories, own titles, customize your squad...<br/> Join arms with fellow Guild members to earn Guild Points, and climb the leaderboard to earn awesome rewards.<br/> <br/> <br/> <br/> 【Player Community】<br/> Facebook: https://www.facebook.com/nonstopgamemobile<br/> YouTube:  https://www.youtube.com/c/NonstopGameOfficial<br/> Discord:  https://discord.gg/wEXm4ejGJa<br/> Reddit: https://www.reddit.com/r/nonstopgamemobile<br/> <br/> Website: http://www.7piratesgames.com<br/> Customer Service: https://aihelp.net/FAQ/#/NonstopGame/app/en/0058A64D132217D9<br/> Privacy Policy: http://www.7piratesgames.com/PrivacyPolicy.html<br/> Terms of Service: http://www.7piratesgames.com/ToS.html", "metacritic": null, "released": "2022-12-21", "tba": false, "updated": "2023-02-17T09:22:23", "background_image": "https://media.rawg.io/media/screenshots/27c/27c8274dea677d389944bae41372d273_74kbAOc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Kraken"], "genres": ["RPG", "Strategy"], "publishers": ["Big Kraken"], "esrb_rating": "Everyone 10+"}