{"id": 926915, "slug": "marble-run-race", "name": "Marble Run - Race", "name_original": "Marble Run - Race", "description": "Marble Run - Race with other Marbles in Marble run racing game, defeat your opponents by passing them and different obstacles, avoid enemies and don't fall off the edge. <br/>Physic's based game in a form of Marble Runner. <br/>Marble Run Race is free mobile game<br/>Knock enemies from the ground and become winner!<br/>Game is suitable for adults and kids or better said for all ages.<br/>Play the game and remember how it was to be a kid with marbles in your hands, it had to be a hobby.<br/>But don't play Marble game like Netflix show did for Squid Game :)<br/>Use your imagination and have some fun!<br/>Level designed Tracks are fun and engaging.<br/>Game can feel like playing 8 ball but also at some tracks you need to hit centre of the hole like it's a golf.<br/>If you are 8 ball or a golf fan this game might also be interesting to you as love for balls is mutual<br/>The tracks are designed to be fun and engaging but move out of place and you will lose the ground.<br/>There are several mechanics and obstacles that you will need to learn in order to become marble masters. <br/>There's a wheel that lifts the balls up in a circular motion. There's also a wooden lift that lifts balls up the stairs. Your inventions depend only on you and your imagination.<br/>Also make sure to increase VOLUME!<br/><br/><br/>- Complete 1000 challenges<br/>- Rank up by gathering XP<br/>- Collect 50 all the coins<br/>- Collect daily rewards<br/>- Unlock 15 tracks<br/>- Compare your high score with players worldwide on leaderboard", "metacritic": null, "released": "2021-11-04", "tba": false, "updated": "2023-02-17T09:06:24", "background_image": "https://media.rawg.io/media/screenshots/ee8/ee8d512042fde3441ef53d45266f0699.jpg", "website": "https://tummygames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tummy Games"], "genres": ["Action", "Racing"], "publishers": ["Tummy Games Doo Novi Sad"], "esrb_rating": "Everyone 10+"}