{"id": 926910, "slug": "mudness-2-offroad-car-games", "name": "Mudness 2 - Offroad Car Games", "name_original": "Mudness 2 - Offroad Car Games", "description": "Mudness 2 is the highly-anticipated sequel to the popular off-road racing game, Mudness. With improved graphics and even more challenging levels, this game takes the excitement of off-road racing to the next level. Here are just some of the features that make Mudness 2 an incredible gaming experience:<br/><br/>- Multiple unique levels: Players can explore a variety of terrains and tackle obstacles in different environments.<br/>- A wide range of cars: With multiple vehicles to choose from, each with its own unique handling and performance characteristics, players can find the perfect car for their racing style.<br/>- Deep customization: Players can customize their vehicles to their liking with a comprehensive customization system, including modifications to engine, suspension, and body parts.<br/>- Amazing car physics: The game's car physics are incredibly realistic, providing a satisfying and immersive gameplay experience.<br/>- Improved graphics: Mudness 2 features improved graphics compared to its predecessor, bringing the off-road racing experience to life like never before.<br/><br/>If you're a fan of off-road racing games, Mudness 2 is a must-play for you!<br/><br/>In Mudness 2, players are in for a treat with 50 unique levels to conquer! Each level presents its own unique set of challenges and obstacles, from steep hills to muddy swamps, and everything in between. These levels are designed to test players' driving skills and push their vehicles to the limit.<br/><br/>With 50 levels to choose from, players will have endless hours of gameplay at their fingertips. The levels vary in difficulty, ranging from easier courses that are great for getting started, to more challenging levels that will test even the most experienced racers. No matter what your skill level, there's a level in Mudness 2 that's perfect for you.<br/><br/>In addition, each level is set in a beautifully designed environment, with stunning graphics, detailed textures, and realistic lighting. The levels are also designed with different weather conditions in mind, including rain, snow, and mud, each affecting the handling and performance of your car.<br/><br/>So if you're ready to take on the challenge and conquer the off-road racing scene, Mudness 2 is the game for you! With 50 unique levels to play through, you'll never run out of things to do. Get ready to hit the dirt and race to the finish line!<br/><br/><br/>Terms and Conditions: https://midnight.games/terms/", "metacritic": null, "released": "2023-02-03", "tba": false, "updated": "2023-02-17T09:00:08", "background_image": "https://media.rawg.io/media/screenshots/c95/c95cd98b78bec83e4f4db27519cf999e.jpg", "website": "https://midnight.games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 358, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Midnight Games"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["Midnight Games"], "esrb_rating": "Everyone 10+"}