{"id": 92697, "slug": "reconquista", "name": "Reconquista", "name_original": "Reconquista", "description": "<p>In <em>Reconquista</em> you play as an Incan rebel coming to reclaim a sacred artifact from the conquistador-occupied island of Huaca, off the coast of South America.<br/></p>\n<p><em>Reconquista</em> is a short narrative first-person exploration game. It is the first 3D game I've made, and I have relied heavily on the Unity Asset Store to augment my lackluster 3D modelling skills. A list of all the assets I used is available in the game's pause menu.</p>\n<p>The title is actually a play on the existing name of a medieval period where the Spanish reclaimed land that was taken from them by invaders. This was long before they themselves set sail for South America as the well-known Conquistadors, so I liked the irony of the fact that in this game you have to steal something BACK from the conquistadors. Hence, literally, <em>RE-conquista</em>.<br/></p>\n<p>And Huaca is an Incan term for some kind of sacred object or monument, as well as the term for spirits in a state of being after death.<br/></p>\n<p><strong><strong>Changelog:</strong><br/></strong></p>\n<p><strong> v2.2</strong></p>\n<ul><li>Made the UI compatible with gamepads! Now you won't need a keyboard or mouse around to play the game.</li><li>Added soft shadows for dynamics lightsources (so no more jaggies).</li><li>Tweaks to mouse smoothing, lighting, color grading and other visual effects.</li><li>Many small performance improvements.</li></ul>\n<p><strong>v2.1</strong></p>\n<ul><li>Replaced the lame ending screens with something better for when you complete the game (or die), and greatly increased the time period before the game quits (or restarts) automatically once you get there</li><li>Lowered default mouse sensitivity</li><li>Added a mouse sensitivity slider to the pause menu</li><li>Added a windowed mode toggle to the pause menu in the Windows version (MacOS version already supports multitasking)</li><li>Reduced the amount of conquistador spawn points</li><li>Made the Fear effect less intrusive</li><li>Replaced the artefact's pedestal with a better model</li><li>Improved the motion blur quality</li><li>Enabled soft shadows on the highest quality level</li><li>Fixed a bug that prevented the Quality slider from actually adjusting some things correctly (mainly shadow and texture resolution)</li><li>Fixed a bug in the UI when interacting with the resolution dropdown</li><li>Fixed the normal map on the stone tiles texture</li></ul>\n<p><strong>v2.0</strong></p>\n<ul><li>Gamepad support.</li><li>Increased size of the player to feel better-proportioned to the island.</li><li>Completely overhauled foliage and rocks.</li><li>New buildings hidden across the island.</li><li>Added 'puzzle' to get access to pyramid.</li><li>Added extra detail to pyramid.</li><li>Replaced artefact with a better model.</li><li>Added rain to late game.</li><li>New enemy texture and animations.</li><li>Enemy now attacks at close range instead of insta-killing you.</li><li>Improved terrain rendering (normal maps, no more stretched textures).</li><li>New postprocessing effects (depth of field, motion blur, tonemapping, color grading, anti-aliasing).</li><li>Improved fire effect.</li><li>Added in-game resolution selection option.</li><li>Improved default mouse smoothing.</li><li>Improved UI look and layout.</li><li>Proper occlusion culling.</li><li>Performance tweaks and bug fixes.</li></ul>\n<p><strong>v1.1</strong></p>\n<ul><li>Added a checkbox in the pause menu to disable mouse smoothing.</li><li>Fixed the default graphics setting not matching with the in-game graphics quality setting. This might improve performance as the in-game setting toggles additional things like draw distance and foliage density.</li></ul>", "metacritic": null, "released": "2015-06-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/dd9/dd9b4fac9ce1cbab57379af933a33382.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["hedgefield"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}