{"id": 926926, "slug": "donut-inc", "name": "Donut Inc.", "name_original": "Donut Inc.", "description": "Got tired of coffee shop tycoon? <br/>Then why don’t you try our donut shop simulator game?<br/>Run the worlds’ most famous donut chain with this shop simulation game.<br/>------------------------------------------------------------------------------------------------------------------------<br/>You recently opened a donut chain. It's a store that you opened with all your money.<br/>You don't have a penny in your hand after buying a donut machine. But it's okay!<br/>From now on, you can make money by selling donuts! Now run a donut shop and expand it. <br/>Here are some TIPs for how to grow your business!<br/><br/>- Getting orders from customers.<br/>From ordering individual donuts to ordering donut packages! Take the doughnuts from the doughnut machine and sell them. You can make a donut package by installing a package assembly.<br/><br/>- Expand and grow your store!<br/>Set up tables for customers who want to eat at the store. Don’t forget to clean up the place where the customers ate!<br/>You may have started with only a doughnut machine and a stand at first, but if you increase the table one by one, you will see a huge store before you know it!<br/><br/>- Create HR Department!<br/>The store is getting bigger! But don’t you think it would be troublesome if there was only one worker? Manage your store efficiently by hiring staff to make donuts as well as cashiers! If you have slow employees, you can upgrade their ability!<br/><br/>- Open Drive-Thru<br/>You can attract more customers by opening up a drive-thru. Get more customers, get more money!<br/>You still didn’t download this game yet? Start your business right now!", "metacritic": null, "released": "2023-01-27", "tba": false, "updated": "2023-02-17T09:18:57", "background_image": "https://media.rawg.io/media/screenshots/f3c/f3c968474845a04646ae2fe7215ff57a_D95jNBr.jpg", "website": "https://supercent.io/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Supercent"], "genres": ["RPG", "Simulation"], "publishers": ["Supercent"], "esrb_rating": "Everyone 10+"}