{"id": 926944, "slug": "nba-all-world", "name": "NBA All-World", "name_original": "NBA All-World", "description": "NBA All-World unleashes the new era of Hoops. Get outside, step into the sneakers of today’s NBA superstars, and go 1v1 against the best players in the world. Explore your neighborhood while competing in mini-games to claim Ruler of the Court. Be on the lookout for sneaker &amp; gear drops to flex your style &amp; increase the performance of your squad. Represent where you’re from along with the best ballers in the world to prove. Are you ready to go All World?<br/><br/>_______________<br/><br/>With the player’s permission, Adventure Sync uses the Health app to enable the player to earn walking distance when the app is closed.<br/><br/>All World Notes:<br/>- This app is free-to-play and offers in-game purchases. It is optimized for smartphones; tablets are not supported.<br/>- It is recommended to play while connected to a network in order to obtain accurate location information.<br/>- Compatibility is not guaranteed for devices without GPS capabilities or devices that are connected only to Wi-Fi networks.<br/>- Compatibility information may be changed at any time.<br/>- Not compatible with 5th generation iPod Touch devices or iPhone 5c or earlier iPhone devices.<br/>- Compatibility is not guaranteed for all devices.<br/>- Continued use of GPS running in the background can dramatically reduce battery life.", "metacritic": null, "released": "2023-01-23", "tba": false, "updated": "2024-01-08T06:29:41", "background_image": "https://media.rawg.io/media/screenshots/34b/34b5a2c376e21e7a553eb847dafdc53f.jpg", "website": "http://nianticlabs.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS"], "developers": ["Niantic"], "genres": ["Adventure", "Sports"], "publishers": ["Niantic"], "esrb_rating": "Everyone 10+"}