{"id": 92732, "slug": "core-stratagem", "name": "Core Stratagem", "name_original": "Core Stratagem", "description": "<p>Core Stratagem is an old-school turn-based indie strategy game. Choose one of seven unique factions and conquer your enemies, using terrain to your advantage and capturing your opponents' cities. Steal and finish their incomplete units to turn their production against them. Make use of stealth to launch surprise attacks, and when all else fails, detonate a kamikaze unit in the midst of their armies. </p><p>Core Stratagem supports user-created units, armies, and maps. Use the included map editor to create your own custom scenarios. Choose from tons of options to customize your play experience, including bonuses and handicaps for each player to create just the challenge you want.</p><ul><li>Seven unique factions:<ul><li><strong>Modern Military</strong> - A flexible, well-rounded army with tanks, aircraft carriers, and nuke-drones!</li><li><strong>Savage Saurians</strong> - Stealthy and swift dinosaur-like creatures from a forgotten time!</li><li><strong>Interplanetary Invaders</strong> - Powerful alien technology dominates the skies, but their soldiers must resupply the gas they breathe!</li><li><strong>Feudal Fantasy</strong> - A land-focused set of knights, siege towers, and just a touch of magic!</li><li><strong>Alternate Army</strong> - From another place, or another world? A twist on a present-day army theme, with specialized units like sub-hunter choppers and anti-air cannon!</li><li><strong>Wily Wizards</strong> - Glass-cannon mages protected by hardy stone gargoyle minions!</li><li><strong>Deepwater Denizens</strong> - Terrors from the deep, their amphibious units can leave the seas for a limited time, and act differently depending on their environment!</li></ul></li></ul><p>Visit corestratagem.com to learn more or download the FREE demo!<br/></p>", "metacritic": null, "released": "2016-03-02", "tba": false, "updated": "2019-08-28T23:26:00", "background_image": "https://media.rawg.io/media/screenshots/995/995be6aeda45280f5c409db21ff17e0b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["urocyongames"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}