{"id": 927393, "slug": "dragons-curse-itch-madelinerogers", "name": "Dragon's Curse (itch) (madelinerogers)", "name_original": "Dragon's Curse (itch) (madelinerogers)", "description": "<p>The inspiration for this piece is derived directly from the very atmosphere of choice-based games. In every type of these games, the player can only make decisions based on the information they are given and this also mimics real life. Everyone has been in a situation where they can only do what they think is the best despite knowing if it is the best or “right” thing to do. The player starts out on the brink of death and needs to eat something. They eat the egg which turns them into a dragon because of a curse placed on them if they were to be destroyed. The idea is that the player goes through the game believing they did nothing wrong because in some sense, they didn’t- they were surviving. On their quest to break the curse, the player will make decisions that have effects on the environment unknown to them until later causing both good and harm to the parties involved. This piece is supposed to draw attention to the idea of how some players will go through a game of choices trying to be the hero but regardless of what they choose, will still be the villain. I envision the pacing of this game to be very slow to make it seem more like a human’s thought process when weighing decisions. It’s also more of my style to tell stories a little more slowly and build up to the action and suspense.</p>\n<p>CREDITS</p>\n<p>Writing and cover art done by me!</p>", "metacritic": null, "released": "2023-02-16", "tba": false, "updated": "2023-02-17T13:49:31", "background_image": "https://media.rawg.io/media/screenshots/dcf/dcf07e34a625b83b5e23b85a6c585a4b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["madelinerogers"], "genres": [], "publishers": [], "esrb_rating": null}