{"id": 927425, "slug": "shape-yao", "name": "SHAPE (Yao)", "name_original": "SHAPE (Yao)", "description": "<p>Then she knocked on my door<br/></p>\n<p>Seeking my aid with a fervent implore</p>\n\n<p>For a feeling that had taken hold\r\n</p>\n<p>Captivating her every breath so bold\r\n</p>\n\n<p>Of strange shapes appearing within her frame\r\n</p>\n\n<p>I opened the door, as I knew\r\n</p>\n<p>She was not just sick, but lost too\r\n</p>\n\n<p>\"Can you help me return to what's true?\"\r\n</p>\n<p>She asked, with a voice so meek and blue\r\n</p>\n\n<p>_________________________________________________</p>\n\r\nIntroduction\r\n<p>\"SHAPE\" is an engaging and immersive story game that challenges players with thought-provoking puzzles. As you delve into the tale of a <strong>triangle</strong> living in a square-filled world, you'll uncover the mysteries of the triangle's past and unravel the truth about its identity.<br/></p>\n\n<p>With each shape you uncover, you'll gain a deeper understanding of the triangle's life, and experience its feelings of confusion, uncertainty, and fear as it ventures away from the familiar. This is a journey filled with twists and turns, where you'll encounter unexpected challenges and unlock hidden truths.</p>\n\r\nConcept\r\n<p>I was inspired by the puzzle named Tangram, which included seven geometric dissections and separated from a square. The seemingly uneven shapes mirror people's different identities, and the answer can only be discovered by embracing ourselves (without cutting the shapes).</p>", "metacritic": null, "released": "2023-02-16", "tba": false, "updated": "2023-02-17T14:08:18", "background_image": "https://media.rawg.io/media/screenshots/2b9/2b9db7b8d21fdfe8e662e81a67ed84c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Yao"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}