{"id": 92759, "slug": "p0-snake", "name": "p0 snake", "name_original": "p0 snake", "description": "<p>\r\n\tWind your way through 30 levels of arcade-action insanity in this specially enhanced version of the game that took the trophy in RGCD's 2014 16KB gamedev competition. Featuring eight additional screens, an all-new intro sequence, improved samples, bug fixes and other minor tweaks, RGCD is proud to present this final version of Antonio Savona's <strong>P0 SNAKE</strong>!\r\n</p>\n<p>\n<strong>P0 SNAKE</strong> is a super simple game to play - it requires just one button!\r\n</p>\n<p>\r\n\tHolding down the fire button rotates the snake counter-clockwise, whereas releasing the button rotates the snake clockwise. Alternating these two basic movements allows the snake to be steered around the screen. As you eat the dots (by passing over them), your snake will grow in length - but be careful not to crash into your own tail!\r\n</p>\n<p>\r\n\tThere is also a wide variety of enemies, obstacles and movement-altering terrains to discover, avoid and master. Luckily, the head is the only vulnerable part of the snake - and you'll need to use this to your advantage!\r\n</p>\n<p>\n<strong>P0 SNAKE</strong> features:<br/>\n</p>\n<ul>\n<li>Amazing sampled speech (on both 8580 and 6581)!</li>\n<li>Innovative single-button gameplay!</li>\n<li>Password save system!</li>\n<li>NTSC/PAL support!</li>\n</ul>\n<p>\n<strong>Playing <strong><strong>P0 SNAKE</strong></strong> on a Commodore 64 or PC</strong>\n</p>\n<p>\r\n\tThe digital version available for FREE download is in 64KB cartridge format (*.CRT). This is primarily for use with emulators, but can also be run on a real C64 via hardware such as the 1541 Ultimate II. For emulator users, we recommend VICE, as it works on a variety of operating systems and is very user friendly. In fact, we've even included a pre-configured 32-Bit Windows copy with the download together with some simple user instructions (we're nice like that).\r\n</p>\n<p>\n<strong>Buy <strong><strong><strong>P0 SNAKE</strong></strong></strong> on Cartridge for your Commodore 64 Computer!</strong>\n</p>\n<p>\r\n\tEnjoyed <strong><strong><strong><strong><strong><strong>P0 SNAKE</strong></strong></strong></strong></strong></strong> on your modern-day PC? Have an old Commodore 64 stashed away in the loft? Well, you'd be a fool not to grab a physical copy of the C64 version - it comes boxed with a poster, codesheets, little vinyl stickers and everything, just like in the good old days!\r\n</p>\n<p>\r\n\t(This initial run is limited to 50 individually numbered copies. Further batches will only be produced if there is sufficient demand).<br/>\n</p>\n<p>\r\n\tHead on over to our online store to order your copy today :)\r\n</p>\n\n<p>\n<strong>The digital download of <strong><strong><strong><strong><strong>P0 SNAKE</strong></strong></strong></strong></strong> is available for FREE</strong>, but if you can afford to support us by throwing us some digital loose change then we'll be incredibly grateful. &lt;3<br/>\n</p>", "metacritic": null, "released": "2015-06-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8dd/8dd3736ac143759ab0d2441f4f3b5923.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RGCD.DEV"], "genres": ["Action"], "publishers": [], "esrb_rating": null}