{"id": 928030, "slug": "vegiball", "name": "VEGIBALL", "name_original": "VEGIBALL", "description": "<p>Do you have what it takes to challenge your coordination and strategy skills? Vegiball is an exciting one-touch game with a geometric aesthetic that will test your reflexes and cunning. Guide your ball through an endless series of vibrant, neon-colored stages, where you must collect points and power-ups while avoiding dangerous, deadly spikes. The soundtrack will keep you alert and in tune with the action, while the wide variety of balls with unique abilities allows you to customize your gaming experience. Keep your eye on the ball, keep moving, and try to level up on the infinite path to glory! Vegiball is the perfect hobby for any time and place. Are you ready to take on the challenge?<br/></p>\n<p>¿Tienes lo que hay que tener para desafiar tus habilidades de coordinación y estrategia? Vegiball es un emocionante juego de un solo toque con una estética geométrica que pondrá a prueba tus reflejos y tu astucia. Guía tu pelota a través de una serie interminable de etapas vibrantes y llenas de color neón, donde deberás recolectar puntos y power ups mientras evitas peligrosos pinchos mortales. La banda sonora te mantendrá alerta y en sintonía con la acción, mientras que la amplia variedad de pelotas con habilidades únicas te permite personalizar tu experiencia de juego. ¡Mantén tu ojo en la pelota, sigue moviéndote y trata de subir de nivel en el infinito camino hacia la gloria! Vegiball es el pasatiempo perfecto para cualquier momento y lugar. ¿Estás preparado/a para asumir el desafío?</p>", "metacritic": null, "released": "2023-02-14", "tba": false, "updated": "2023-02-17T19:31:59", "background_image": "https://media.rawg.io/media/screenshots/366/366e6c011d3f5787c23e41f75251a7b9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["ZoputaroGames"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}