{"id": 928192, "slug": "specimen-grahame-watt-neil", "name": "Specimen (Grahame Watt, Neil)", "name_original": "Specimen (Grahame Watt, Neil)", "description": "<p><em>Escape the haunted forest with your army of horrible creatures in this Diablo-inspired souls-like adventure! Wielding the mighty Leto Orb, control your specimens as they fight through the denizens of the haunted forest, feeding on their biomass to grow into horrible monstrosities... but are they horrible enough to carry you to freedom?</em></p>\n<p><strong>SPECIMEN is a game prototype developed by Grahame Watt, Zane Heer, and Neil Quillen.</strong></p>\n<p>~~~~~~~~~~~~<br/></p>\n<p><strong>Controls (Keyboard and mouse only):\r\n</strong></p>\n<p>W, A, S, D - Move </p>\n<p>Left-click - Rally specimens\r\n</p>\n<p>Right-click - Throw a lure\r\n</p>\n<p>I - Open Inventory\r\n</p>\n<p>Esc - Close any menu\r\n</p>\n<p>In inventory - left click on an essence or scrap and then right click on the specimen card to feed it to that specimen.</p>\n<p>~~~~~~~~~~~~<br/>\n</p>\n<p><strong>A short guide to essences:</strong>\n</p>\n<p>Each specimen can be mutated by up to three essences. Many alter their stats, but all of them change the behavior of the specimen in some way. Essences have a chance to be dropped by enemies, and can be applied from the inventory screen.</p>\n<ul><li><em>Blunt Essence:</em> Specimen grows ram-like horns and gains a powerful charge attack. When it sees an enemy, it moves quickly towards it, dealing extra damage on impact.\r\n</li><li><em>Vile Essence:</em> Specimen grows hideous odor sacs that spew a noxious cloud every so often, dealing poison damage to enemies within the cloud.\r\n</li><li><em>Alluring Essence:</em> Specimen grows a glowing lure like an angler fish. Attracts attention, increasing its threat value significantly while slowing nearby enemies.\r\n</li><li><em>Mountain Essence:</em> Specimen becomes large and stone-like. This decreases its movement speed, but makes it very durable. Its heavy footfalls slow enemies near it when it moves.\r\n</li><li><em>Fury Essence:</em> Specimen grows fearsome claws. Boosts attack and attack speed, but increases its threat value.\r\n</li><li><em>Symbiotic Essence:</em> Specimen becomes a host for small parasites. Loses some health, but gradually regains health over time.</li><li><em>Dark Essence:</em> Specimen is enveloped in shadow, making it ethereal and difficult to see. Its threat value is lowered, and occasionally it will fade into shadow and lower its threat further (even becoming untargetable) for a short period of time.</li></ul>\n<strong>A short guide to stats:</strong>\n<p>Each specimen has five stats. \r\n</p>\n<ul><li><em>HP (or hit points):</em> How much damage the specimen can withstand. When it reaches zero, the specimen dies.\r\n</li><li><em>Attack Damage:</em> How much damage a single attack does to an enemy.\r\n</li><li><em>Attack Speed:</em> How many seconds between each of the specimen’s attacks.\r\n</li><li><em>Move Speed:</em> How quickly the specimen moves around the map.\r\n</li><li><em>Threat:</em> How threatening the specimen appears to enemies. This will affect how likely the specimen is to be targeted by enemies. Distance from the enemy factors into this as well.\r\n</li></ul>\n<p>All of the above stats, with the exception of threat, can be increased at a Leto Well by spending biomass. Each stat increase to a specimen rises in cost on a per specimen basis.\r\n</p>", "metacritic": null, "released": "2023-02-14", "tba": false, "updated": "2023-02-17T21:00:08", "background_image": "https://media.rawg.io/media/screenshots/cb7/cb745bc4a56cfa769cd3c1a0e530eee4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Neil", "Grahame Watt"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}