{"id": 928104, "slug": "a-pig-quest", "name": "A Pig Quest", "name_original": "A Pig Quest", "description": "<p>A Commodore 64 Game<br/></p>\n<p>My name is Frank Further. Further... It’s kind of ironic, come to think of it, as I’ve never left my village. Neither had my dad and his dad before him. It’s the same for everyone in our land since our four statues of wellness were stolen one night moons ago. Everyone seems to be cursed with numbness, immobility and indifference. Adventure, curiosity, audacity and courage are words that have disappeared from our vocabulary. </p>\n<p> I was born in Porkville and, as sure as the gods made little green apples, I know I’m going to die in Porkville. Without ever leaving the valley. Oh, don’t get me wrong. It’s a nice and pleasant lowland with green pastures, fruit trees, wild mushrooms, flowers and a beautiful little pond. <br/>The only thing that disturbs the peace of this little haven are the mosquitoes and the fireflies. I hate these stupid insects and I sometimes chase them. I have to be thankful to them though as it is during one of my mundane bug hunts that I stumbled upon the entrance to a cave... Could this be my quest? A pig quest?<br/> Experience one of the most incredible stories ever told on the Commodore 64: 5 large worlds to explore, hundreds of enemies and 30+ epic SID tunes that appear dynamically in this action packed platformer with puzzle elements intelligently woven in as the story unfolds.<br/> <br/></p>\n<p><strong>Features:</strong>\n</p>\n<ul><li>Non-linear gameplay\r\n</li><li>Beautifully animated bitmap background and enemies\r\n</li><li>200 screens across 5 worlds\r\n</li><li>Dynamic environment &amp; weather\r\n</li><li>A dazzling 36 situational SID tunes\r\n</li><li>Cinematic cutscenes\r\n</li><li>Secret areas\r\n</li><li>Cartridge only (1MB)\r\n</li><li>Fully PAL/NTSC and GS compatible, with support for second fire button\r\n</li></ul>\n<p><strong>Credits:</strong><br/> </p>\n<p>A game by Piggy 18 Team<br/> Code: Antonio Savona<br/> Gfx and concept: Mauricet<br/> Music and sfx: Aldo Chiummo and Gaetano Chiummo<br/>Preorder your boxed version at Protovision store<br/><br/></p>\n<p><strong>The say about APQ:</strong><br/></p>\n<p><em><strong>ZZap64 Gold Medal award</strong>: \"A C64 masterclass in pixel art and animation\",  \"A landmark C64 title\",  \"A cast iron, nailed-on GOLD MEDAL\"</em>, \"It plays beautifully\".  <br/><em><strong>BastichB 64K: </strong></em><em>\"The graphics are absolutely stunning on so many levels\",  \"Mauricet has truly delivered perfection in C64 form\",  \"The sound is in a league of its own\"</em>, \"A Pig Quest is stunning\". </p>", "metacritic": null, "released": "2023-02-05", "tba": false, "updated": "2023-02-17T20:15:55", "background_image": "https://media.rawg.io/media/screenshots/73f/73f3b3a7bad83384b9763cf1baa95078.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Piggy 18 Team"], "genres": ["Action", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}