{"id": 928126, "slug": "yagoo-dream", "name": "Yagoo Dream", "name_original": "Yagoo Dream", "description": "&lt;GAME FANMADE YAGOO DREAM&gt;\r\n<p><strong>ENGLISH BELOW</strong></p>\n<p><strong>Nội dung game</strong>: Sự kiện xảy ra trong game là lúc Pekora đạt 2 triệu người đăng ký thì sẽ tranh chức chủ tịch với Yagoo (Phần này Pekora có nhắc trong stream), sau khi sử dụng chủ tịch của Yagoo, Pekora lúc này đã đưa Yagoo về không gian nơi các Nousagi sinh sống, tại đây người chơi sẽ điều khiển Yagoo về lại thế giới thật qua cảnh cổng ban đầu </p>\n<p>Nền tảng: Windows </p>\n<p>Trò chơi được tạo bởi Monma</p>\n<p>Art trong trò chơi được vẽ bởi MK và F-Luck Guy</p>\n<p>Nhạc trong trò chơi Shiny Smily Story ( Hiax Mix )  Hiax  </p>\n<p><strong>Tuyên bố miễn trừ trách nhiệm</strong>: Đây là một dự án độc lập và không liên hệ nào với <strong>Hololive</strong> hoặc <strong>Cover Corp</strong>. dưới bất kỳ hình thức nào. Trò chơi này hoàn toàn miễn phí và không phục vụ cho mục đích thương mại . Tất cả nội dung hình ảnh và âm nhạc đều được tạo riêng cho trò chơi này hoặc được cấp phép sử dụng phi thương mại..</p>\n<p><strong>Chú ý</strong>: game có thể sẽ còn nhiều bug, cũng như lỗi trong quá trình chơi. Mong các bạn thông cảm về vấn đề này. Nếu gặp lỗi hãy làm các bước sau : Esc -&gt; Menu -&gt; Play, game sẽ tự động lưu lại ở checkpoint gần nhất. </p>\r\nTải game tại: \r\n<p>(English version) Pekora has reached 2 million subscribers! And as she promised in a stream, she will now... take the CEO position from YAGOO!? After being deprived of his CEO title, YAGOO is then sent to the Nousagi realm. The player has to control YAGOO and help him go through a dimensional gate so he could return to the real world and confront Pekora, and to show her who the real boss is.</p>\n<p>Supported platform(s): Windows</p>\n<p>Game made by Monma</p>\n<p>Art made by MK and F-Luck Guy</p>\n<p>Music used in the game: Shiny Smily Story (Hiax Mix) by Hiax </p>\n\n<p><strong>Disclaimer</strong>: This is an independent project. We are not affiliated with <strong>Hololive</strong> or <strong>Cover Corp</strong>. in any way. This game is completely free, and there is no monetizations or microtransactions included. All visual and music assets are specifically made for this game, or are licensed to use non-commercially. </p>\r\nDownload here:", "metacritic": null, "released": "2023-02-14", "tba": false, "updated": "2023-02-17T20:28:57", "background_image": "https://media.rawg.io/media/screenshots/e39/e39b58ac75a7b34cff7b27e945155182.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DUYNE"], "genres": [], "publishers": [], "esrb_rating": null}