{"id": 92813, "slug": "the-guild-of-thieves-itch", "name": "The Guild of Thieves (itch)", "name_original": "The Guild of Thieves (itch)", "description": "<p><strong><em>The Guild of Thieves </em></strong>is an award winning classic text adventure game released by Magnetic Scrolls in 1987.<br/></p>\r\nRemastered by Strand Games for 2017\r\n<p>You are an aspiring member of the infamous Guild of Thieves whose legendary exploits and daring deeds pervade Kerovnian folklore. For the test assignment, you have been challenged to ransack a castle, the surrounding area and even the Bank of Kerovnia itself of all valuables. Are you up to it? Frankly we doubt it.<br/></p>\n<p>Magnetic Scrolls was a British video game developer active between 1984 and 1990. A pioneer of audio-visually elaborate text adventure games. It was one of the two largest and most acclaimed interactive fiction developers of the 1980s.</p>\n<p>The original game has been remastered and improved by Stand Games (with <br/>permission) and adapted for modern PCs and mobiles, with a vastly improved UI.<br/></p>\n<p>Features include:<br/></p>\n<ul><li>Touch-Text Commands<br/>Tap \"links\" in the text to perform commands without typing.</li></ul>\n<ul><li>Game specific word suggestion<br/>Tap suggested words from the <em>word bar </em>during input to save time.</li></ul>\n<ul><li>Sidebar Inventory<br/>All your things are conveniently listed in a sidebar. Drag and drop to use them or to apply them to things in the main text.</li></ul>\n<ul><li>Dynamic Map<br/>No need to draw out the map, we do it for you. As you explore the game, the map page will expand. Tap any previous room on the map to \"fast-goto\" that location.</li></ul>\n<ul><li>Quickly navigate with a handy compass gadget. It shows the available exits at all times, simply tap to move.</li></ul>\n<p>The new facilities make the original game fun and entertaining to play on modern devices. No more dead ends; the remaster has multi-level undo, save/load game and automatic undo from dying!</p>\n<p>There's also the original artwork, the animated artwork and new music from the original artist John Malloy (thanks John!).<br/><br/></p>\n<p>Find out more at http://strandgames.com</p>\n<p>See also:<br/>https://en.wikipedia.org/wiki/The_Guild_of_Thieves<br/>http://ifdb.tads.org/viewgame?id=bu2v2j5sqpf4usex<br/>http://msmemorial.if-legends.org/games.htm/guild.php</p>\n<p>System Requirements</p>\n<ul><li>Windows Vista or later.</li><li>Mac OSX 10.10 (Yosemite) or later.</li><li>Recent\r\n 64bit Linux desktop (Ubuntu 16.04+, Fedora 25+, Debian 8+, Suse Leap \r\n42.2+, CentOS7, MiNT 18.1+, ElementaryOS 0.41, Manjaro 17.1 and similiar)</li></ul>\r\nSupport the Remastering Project\r\n<p>After fees, we get only about £1 from each sale. We're working to \r\nrestore original game content, source code and documents and hopefully \r\nto develop and share new IF technologies. See our blog for details of our progress.</p>\n<p><em>Thanks for your support!</em><br/>The Strand Team</p>", "metacritic": null, "released": "2017-12-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/fc9/fc98dad1d29be1c804c4c5db2a2eac18.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["strandgames"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}