{"id": 92830, "slug": "modular-destruction-labs", "name": "Modular Destruction Labs", "name_original": "Modular Destruction Labs", "description": "<p>\r\n\t Modular Destruction Labs was made in 72hrs for the Ludum Dare game jam, and was originally released in August 2017. It's a physics-based robot building game, the idea is to build a robot from various modules, then try your best to make it through the various challenges on each level. <br/>\n</p>\n\n<p>\n</p>\n<p><strong>WHY WE MADE IT</strong><br/>\r\n\t The theme for this Ludum Dare was 'Running Out of Power'.  As usual our interpretation started off OK and got a bit fuzzy as the game developed.  The original idea was that world was running out of power, and a competition was being held to develop new energy-efficient robots.  We lost the competition element due to time, but just managed to keep the theme around with the draining robot power bar.  The main aim of this entry was to make something physics-based with the possibility for funny and chaotic outcomes.  We also wanted a seamless transition between building something and trying it, which worked fairly well.</p>\n\n<p>\n<strong>CONTROLS &amp; HELP</strong><br/>\r\n\tThe game takes place in 2 stage - firstly you have to build the robot, then try to pilot your creation to the end of the level.<br/>\n</p>\n<p>\r\n\tYou build the robot by dragging and dropping parts onto the  grid, where they will be attached to the main body with a power line.  There are various parts to add, you need at least 1 rocket and 1 thruster, other than that feel free to experiment.  You can test your robot at any time and see how it handles.  The game using a physics engine, so if you add a lot of weight you'll need more thrusters and rockets to lift the robot.  Putting the modules closer to the body also helps keep the robot under control.</p>\n<p>Once you have built something you're happy with, press the Begin button fly to the end of the level.  The arrow keys control movement, and Space, Ctrl &amp; Shift control the various modules.  Watch out for your power consumption, using the modules drains the power bar.</p>\n<p>Don't forget you can press P to pause and retry the level.</p>\n\n<strong>JAMES</strong>\n<strong>EDGE</strong>\n<strong>ADAM</strong>\r\n\t\r\n\t\r\n\t\r\n\r\n\r\n\t\r\n\t\r\n\t\r\n\t\tArt, Design\r\n\t\t<br/>\r\n\t\t &amp; Animation\r\n\t\r\n\t\r\n\t\tGameplay,\r\n\t\t<br/>\r\n\t\tSound &amp; Music\r\n\t\r\n\t\r\n\t\tArt, Design\r\n\t\t<br/>\r\n\t\t &amp; HUD", "metacritic": null, "released": "2017-08-13", "tba": false, "updated": "2019-08-28T23:26:00", "background_image": "https://media.rawg.io/media/screenshots/aff/aff6d97fb9f4daa2f2a3bc7b0ab249de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Second Dimension Games"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}