{"id": 928789, "slug": "gigantosaurus-dino-kart", "name": "Gigantosaurus: Dino Kart", "name_original": "Gigantosaurus: Dino Kart", "description": "Please note: Controller required for 2-4 player split screen mode. <br/><br/><br/><br/>Play as Bill, Mazu, Rocky, Tiny and more Gigantosaurus friends.<br/><br/><br/>Race around Cretacia in a prehistoric kart championship for up to 4 players of all ages, where you can play as your favorite dino friends and even bump into the mysterious Gigantosaurus himself! <br/><br/><br/><br/><br/>Up to 4 players can compete in split-screen play<br/><br/><br/><br/>This racing adventure is full of awesome obstacles and power-ups found only in the world of dinosaurs. Out-run dangers like hot lava eruptions from Mount Oblivion, or feel the power of the famous Gigantosaurus Roar. Charge through the pack by picking up special skills that give you a shortcut, or a jetpack-powered boost… or a way to knock out your rivals.<br/><br/><br/><br/>Race on 15 tracks in the Savannah, Jungle, and Mount Oblivion Cups<br/><br/><br/><br/>There’s a play style for every ability level, including auto-steering karts and on-screen text read aloud by Mazu, the ankylosaurus. With 15 tracks and 8 characters to choose from, there’s a whole world of dino racing to discover.<br/><br/><br/><br/><br/>Dinos of all ages can win with auto-steer and Mazu’s reading help<br/><br/><br/>So, get the whole family together for a fast and fun party that’s almost as big as Gigantosaurus’ appetite!", "metacritic": null, "released": "2023-02-17", "tba": false, "updated": "2023-03-23T11:42:38", "background_image": "https://media.rawg.io/media/screenshots/f1d/f1d3e1e7747fdbdae84642d278e91fda.jpg", "website": "https://outrightgames.com/games/gigantosaurus-dino-kart/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "beaten": 1}, "playtime": 1, "achievements_count": 46, "ratings_count": 1, "suggestions_count": 342, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["3DClouds"], "genres": ["Action", "Adventure", "Sports", "Racing"], "publishers": ["Outright Games"], "esrb_rating": null}