{"id": 928761, "slug": "horny-warp-hentai-fantasy", "name": "Horny Warp: Hentai Fantasy", "name_original": "Horny Warp: Hentai Fantasy", "description": "<h3> Don't forget to wishlist the game! </h3><br/><br/><br/><br/>You will have to take on the role of the Savior of Fuckville and help the villagers restore destroyed buildings. In this adventure, the player will be joined by six girls, who will be sure to help in your arduous task. <strong>Restore the village, collect the necessary resources, and get closer to the girls!</strong> Perhaps, you will even be able to find the way back home...<br/><br/><br/><br/>The game includes dating simulator and city-building elements. To collect the necessary resources, you will have to play six distinct minigames, each associated with a different girl. Every building upgrade will help progress relationships with girls. Dialogue choices will determine the ending you get.<br/><br/><br/><br/><ul><li><strong>Six girls from different worlds</strong> - meet up, interact, and become closer with six vastly different and intriguing girls who have also come to Fuckville.<br/></li><li><strong>18 animated adult scenes</strong> - enjoy high-quality art and animations in H-scenes.<br/></li><li><strong>Six simple and fun minigames</strong> - play the minigames to collect the resources necessary for upgrading buildings. <br/></li><li><strong>Engaging story, full of flirting and humor</strong> - forget about your problems and rest up in Fuckville in the company of hot girls! <br/></li><li><strong>Voiced 18+ scenes</strong> - every heroine has her own voice! Enjoy quality voice acting in bed scenes.<br/></li><li><strong>Multiple-choice dialogues and three different endings</strong> - choose replies in conversations with the girls and unlock different endings.</li></ul>", "metacritic": null, "released": "2023-02-17", "tba": false, "updated": "2023-04-13T12:14:59", "background_image": "https://media.rawg.io/media/screenshots/838/838f6485994fa3307f7b9552c5184a83.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 4, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 36, "ratings_count": 1, "suggestions_count": 408, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "macOS", "PC"], "developers": ["IlluminatiGames"], "genres": ["Adventure", "Casual"], "publishers": ["IlluminatiGames"], "esrb_rating": null}