{"id": 928797, "slug": "the-future-radio-and-the-artificial-pigeons", "name": "The Future Radio and the Artificial Pigeons", "name_original": "The Future Radio and the Artificial Pigeons", "description": "<h3>\"The Future Radio and the Artificial Pigeons\" is a Japanese-style visual novel produced by Laplacian, a Japanese developer of romance visual novels.</h3><br/><br/><br/><br/>                                               <br/><br/><strong>July 10, 2061, Sunday. City: Nariyama. Prefecture: Chiba.<br/><br/>Yamanashi Sora designed a new radio using spare parts.<br/><br/>\"Phew... Just in time.\"<br/><br/>That day marked the fifteenth year since the artificial pigeons started devouring all radio waves.<br/>On it, Sora began broadcasting using the transceiver left to him by his father.<br/><br/>The day after his first rocky radio program, the radio picked up a different mysterious broadcast.<br/><br/>This is a follow-up report on the fall of \"Blue Sky.\"<br/>The person caught up in the accident at the former site of Terminal 1 has been identified.<br/>The name of the deceased is Yamanashi Sora. Furthermore, many injuries are being reported at Nariyama Sky Academy.\"<br/><br/>It was a radio broadcast from the future.<br/><br/>\"I'll... die in three weeks?\"<br/><br/>After listening to the ominous broadcast, Sora stepped into the terminal for the first time in fifteen years.<br/>It was once the former gateway to Japan and the place where Sora lost his parents.<br/>The building was in ruins, a shadow of its former glory, little more than a nest to countless artificial pigeons.<br/>There, Sora met a silver-haired maiden. She looked straight at Sora, gently stroking an artificial pigeon with her finger.<br/><br/>\"...You won't die.\"<br/><br/>Sora was dumbfounded.<br/><br/>\"I won't let it happen.\"<br/>\"Because I want you to look up at the sky and smile.\"<br/><br/>This is how Yamanashi Sora and Hazuki Kaguya met.</strong><br/><br/><br/>                                               <br/><br/><strong>2061, Japan.<br/><br/>Mankind has lost the sky, and with it, its connections.<br/><br/>All of it was taken away by birds...<br/>...By countless artificial pigeons flying through the sky.<br/><br/>The artificial pigeons were initially created as a worldwide wireless network that covers the entire globe.<br/>But one day, they turned and began to eat the same airwaves they were meant to carry.<br/>They feast on radio waves, breeding uncontrollably until they're the only birds left in the sky.<br/><br/>The first thing humanity lost was its communication network.<br/><br/>This caused great turmoil in a digital world that had already transitioned away from analog technology.<br/>All information sent through radio waves was quickly blocked.<br/>Even airplane control systems stopped working, rendering them unable to safely land.<br/><br/>The day the pigeons turned, eight planes fell around the Nariyama International Airport.<br/>With all remaining planes grounded indefinitely, the airport was abandoned.<br/><br/>And so, mankind lost the sky.<br/><br/>But then, 15 years after that fateful day...<br/><br/>In an attempt to reclaim humanity's connection with the sky, a young tinkerer constructs a new kind of radio...<br/><br/>...A radio that mysteriously receives broadcasts from the future.</strong>", "metacritic": null, "released": "2023-02-17", "tba": false, "updated": "2023-02-20T04:41:08", "background_image": "https://media.rawg.io/media/screenshots/e88/e88779c13eec55881621792985a7572a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 14, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 505, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Laplacian"], "genres": ["Adventure"], "publishers": ["NekoNyan", "HIKARI FIELD"], "esrb_rating": null}