{"id": 928737, "slug": "tokyo-neural-groove-demo", "name": "Tokyo Neural Groove: Demo", "name_original": "Tokyo Neural Groove: Demo", "description": "A Pixel Art adventure game inspired by old school point 'n click games and classic interactive fiction.\r\n\n<p>Tokyo Neural Groove is a game inspired by a story that tells a story. It is the story about weird characters in 2116 Tokyo, their troubles and their crazy choices. In the cyberpunk world of TNG you will be a  cybertech genius, a smart girl trying to save own neck, a mafia  criminal, a secret intelligence agent, an unscrupulous young girl  mercenary, and… who knows who else?</p>\n\n<p>Tokyo Neural Groove is a pixel art style adventure game, inspired by old school point-and-click games and classic interactive fiction. You can interact with items and other characters by using arrow keys or mouse click to explore about the environment. You will solve increasingly complicated puzzles and retrieve more and more contraptions.</p>\n<p>Explore  every possible area, look for useful items and be smart with useless  ones, talk to odd guys and convince strangers to help you, tell a few  lies to get any benefits, and try to collect essential data to progress  in game. What is going to happen? Unlock <em>your blurry cyberpunk memory</em> and pay attention to details. The game will challenge you to listen  friends and enemies to get their point of view and what feelings move  them. <br/></p>\n\n<br/>\n<br/><br/>DEMO IS LIVE NOW!\r\nTRY OUT \"TOKYO NEURAL GROOVE\" AND SUPPORT US ON KICKSTARTER!\r\n\r\nCROWDFUNDING CAMPAIGN WILL START SOON!\r\nCLICK HERE!", "metacritic": null, "released": "2023-02-05", "tba": false, "updated": "2023-02-18T01:14:20", "background_image": "https://media.rawg.io/media/screenshots/b5a/b5aeed92a257b37d820456f6535b9f20.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PixelCharmLab"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}