{"id": 928783, "slug": "last-order", "name": "Last Order", "name_original": "Last Order", "description": "Last Order is a 2D action game with pixel art style.<br/>To recover the \"Last Order\" in devastated world, you'll use a variety of wire actions.<h3>Offensive wire action</h3>In Last Order, wire actions are not just about movement.<br/><br/><br/><ul><li><strong>Swing Wire</strong></li></ul>Swing wire is an action for movement and attack with wires strung across the ceiling.<br/>Wires can cut off the enemies by passing, so it will be the primary means of attack.<br/><br/><br/><br/><ul><li><strong>Dive Wire</strong></li></ul>Dive Wire is an action to move at high speed to scaffolds and to enemies by elastic wire.<br/>You can break away from danger or Dive into the enemy freely.<br/><br/><br/><br/><ul><li><strong>Shackle Wire</strong></li></ul>Shackle Wire is an action to entangle and throw enemies or shells.<br/>It can be used not only to shoot down enemies in the distance., but also as a defense to catch shells.<br/><br/><h3>Growth to match your style</h3>Grow yourself according to your play style.<br/><br/>Power if you prefer short term battles, or resilience if you are prepared for long term battles.<br/><br/><br/><h3>Customize ability to fit situation</h3>Equip the order chips you obtained to gain new abilities.<br/><br/>Use the order chip according to the situation and your style.<br/><br/><h3>Exploration</h3>Items are hidden in the stages where automatas are abounded.<br/><br/>Exploration will help you find a key to your journey.<br/><br/><h3>Tense boss battle</h3>Bosses with a wide variety of actions are powerful, but they are not overpowered difficulty.<br/><br/>Spot the pattern, bring down them with your skill and strategy.<br/><br/>", "metacritic": null, "released": "2023-02-16", "tba": false, "updated": "2023-02-20T04:19:56", "background_image": "https://media.rawg.io/media/screenshots/912/9120bee5d9a0f684c0531cbcfa3abc28.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 348, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KujiraDanceRoom"], "genres": ["Action", "Indie"], "publishers": ["KujiraDanceRoom"], "esrb_rating": null}