{"id": 92880, "slug": "eye-of-the-gods-c64", "name": "Eye Of The Gods (C64)", "name_original": "Eye Of The Gods (C64)", "description": "<p>Now available for the C64 - <strong>Eye of the Gods</strong>. Take part in a perilous journey through ancient ruins on a quest to find the near-mythical <strong>Eye of the Gods</strong>, an artifact so powerful it could solve the energy problems of a civilization on the brink of collapse! Use the special abilities given to you in your morphing power-suit to survive the hazards you encounter on your journey ... The survival of mankind is depending on you!<br/><br/> <br/><br/><strong>EYE OF THE GODS </strong>is also available from <strong>Psytronik Software</strong> in the following formats:-</p> <p><strong>C64 tape</strong> - presented in a clear cassette case with full-colour glossy inlay. </p><p><strong> Budget C64 disk</strong> - presented in a glossy disk sleeve with full colour label. </p><p><strong> </strong><strong> Premium+ C64 disk</strong> - presented in a clear case with full-colour double-sided inlay.</p><p><strong>** EYE OF THE GODS STORY **</strong> </p><p>In the distant future, Mankind has evolved technologically - but this development came at a price: The resources of the planet were gradually depleted to the point that civilization was left on the brink of collapse.</p><p>Ancient legends tell that in the origins of civilization, in those times where history is confused with myth, humanity possessed an artifact of great power known as the Eye of the Gods. Some believe it is a mystical object that connects with other dimensions; others believe it is an inexhaustible source of energy.</p><p>To calm the voices who plead for the artifact to be recovered, the Army sends one man, you, to infiltrate the ancient ruins of the Cradle of Civilization with one single purpose: Execute a desperate mission to find the Eye of the Gods, and to save humanity from it's own extinction.</p><p><strong>** EYE OF THE GODS FEATURES **</strong> </p><p>• Huge map to explore!</p><p>• Varies enemies to destroy or avoid!</p><p>• Morphing power-suit with different powers!</p><p>• Retro-style C64 visuals!</p><p> </p><p><strong>** EYE OF THE GODS CREDITS **</strong> </p><p><strong>David Rodriguez</strong> - Design / Programming / SFX<br/></p><p><strong>R</strong><strong>ichard Bayliss</strong> - Music</p><p><strong>Jason 'Kenz' Mackenzie</strong> - Game Packaging</p><p><strong>Trevor 'Smila' Storey</strong> - Inlay Artwork</p><p><strong>** SYSTEM REQUIREMENTS **</strong><br/></p><p><strong>Eye Of The Gods</strong> is a game for the Commodore 64. You can play the game in a C64 emulator (we recommend <strong>VICE</strong>) or you can port the game onto real C64 hardware if you have the resources to do so. The download file features the .d64 (disk version), .tap (tape version) and .prg (c64 program files).</p><p><strong>NOTE: </strong>The cost of this purchase does NOT include VAT. The VAT will be added on during the checkout process, the amount of VAT varies depending on the VAT rates that apply to the country you are ordering from.</p>", "metacritic": null, "released": "2016-08-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/501/501d0e1939712e2d374b3bc77557757d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Psytronik Software"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}