{"id": 928826, "slug": "axiums-box-2", "name": "Axium's Box", "name_original": "Axium's Box", "description": "Jack, a man of a mystery business, finds himself whisked away to a place that's simply out of this world - quite literally, as it's floating in a dazzling nebula. Confused and bewildered, he's left with no choice but to take things to new heights or forever be a Jack stuck in a box. As he climbs he obtains new abilities and meets some truly odd characters that change his life and his climbing game.<br/>\n<br/>\r\nChallenge is at the core of Axium's Box, drawing inspiration from titles such as \"Getting Over It\" and \"Jumper King\" in a fully 3D environment with stunning, cinematic graphics. If you relish in a good dose of pain, frustration, and mind-bending obstacles with a constant stream of paradigm shifts, then this game is tailor-made for you.\"<br/>\n<br/>\r\nThis game offers a unique and varied experience with the potential for anywhere from 4 to 40 hours of gameplay, depending on your level of skill. You'll experience a roller coaster of emotions, from triumphant cheers as you conquer difficult obstacles to despondent cries as you fall short and go tumbling down. It will be a true test of perseverance and determination.<br/>\r\nAs such it is also sure to create some of your fondest memories and provide both, butt-clenching entertainment, and, heart-felt belly laughter, to any watchers. <br/>\r\nAxium's Box will put your skills and willpower to the test, and I hope you have the time of your life playing it. Good luck, and have fun! - LordMaddog.", "metacritic": null, "released": "2023-02-19", "tba": false, "updated": "2023-02-20T05:20:29", "background_image": "https://media.rawg.io/media/screenshots/3ed/3edc696d324ff7f4a7bbda2d88f208d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 426, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LeonHeart Studios"], "genres": ["Action", "Adventure"], "publishers": ["LeonHeart Studios"], "esrb_rating": null}