{"id": 92889, "slug": "psychic-cat", "name": "Psychic Cat", "name_original": "Psychic Cat", "description": "A journey across a blasted psychosphere. A cat in trouble. FEATURES<ul><li>Neon Wasteland</li><li>The Strange Ones</li><li>Soul Prisons</li><li>Heart-Night Sky</li><li>Mindcubes</li><li>Full length ambient soundtrack</li></ul>Fantastic Arcade 2015 Official Selection<p>Follow on Twitter @georgeroyer</p><p>SOUNDTRACK by George Royer + Dr. Rockenstein now available for download!</p><p>Protip: Cubes can be thrown, and are your primary defense.</p>PRESS<p>\"Psychic Cat is a fascinating, neon-luminescent landscape you traverse as a cat, galloping and leaping through the suggestion of a place that shimmers brightly all around you. At first it feels like a dream, but gradually it starts to make a strange kind of sense: What if this is what the world looks like to a cat?\" - Offworld</p><p>\"The \"blasted psychosphere\" in <em>Psychic Cat</em> doesn't seem so far-fetched in consideration given that it throws you into a cat's perspective of the world. The cat you control clumsily collides face-first into the jagged rises and falls of the ground as it runs in otherwise elegant animation. And it has to run as there are no trees to climb, no boxes to curl up in; just a vast wasteland with shimmering black lakes and rugged terrain that seems to stretch on forever.\" - Kill Screen </p><p>\" So yeah, it's a load of nonsense. But it's strangely self-serious and coherent nonsense, and that makes it quite enjoyable to explore.\" - PC Gamer</p><p>\"...<em>Psychic Cat</em> also features disturbing green men. This time, they are trying to stomp on you because you are a cat. I'll be honest, after playing for about 40 minutes, I still don't know what Psychic Cat is all about.\" - Rock Paper Shotgun</p><p>\"A fantastical psychic feline adventure full of wondrous sights.\" - Free Game Planet</p>", "metacritic": null, "released": "2015-09-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d3f/d3f380dadc8ed58e637c38fdf8a1613d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["georgeroyer"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}