{"id": 92909, "slug": "xonotic-itch", "name": "Xonotic (itch)", "name_original": "Xonotic (itch)", "description": "<p><strong>NOT MY GAME, SEE XONOTIC.ORG</strong><br/></p>\n<p>Xonotic is an addictive, arena-style first person shooter with crisp movement and a wide array of weapons. It combines intuitive mechanics with in-your-face action to elevate your heart rate. Xonotic is and <em>will always be</em> free-to-play. It is available under the copyleft-style GPLv2 license.</p>\r\nDistinctive Weapons\r\n<p>Xonotic has 9 core weapons and 16 full weapons in its armory. Each has a primary fire and a UT-like secondary fire. They are each useful in particular situations, so weapon choice is critical. Frag away!</p>\n\n\r\nGame Modes Galore!\r\n<p>Through the support of our diverse community Xonotic has a huge variety of game modes for you to play. There's the normal game modes you'd expect from an arena shooter like Deathmatch (FFA), Capture The Flag, and Clan Arena, plus more whacky modes like Nexball and Freeze Tag. Multiplayer Race is also supported!</p>\r\nNew and Classic Maps\r\n<p>Xonotic ships ready to play with 25 official maps, with dozens of community-made ones just a click away. Classic Nexuiz maps are also supported, including those converted from Quake 3!</p>\n<p>Those interested in making maps of their own can use our map editor, which also ships with the game.</p>\n\n\r\nIntegrated Player Statistics\r\n<p>Track your progress with XonStat, the integrated player statistics application. See vital stats like your kill:death ratio, weapon damage and accuracy, and recent games. Tracking is completely opt-in, and no login is required!</p>\r\nCustomizable Heads-Up Display\r\n<p>Tailor the information on your screen to what you’re used to with our easy to use HUD editor. Stick with the defaults, add all the whiz-bang widgets, or go minimalist – it is completely up to you!</p>\n\n\r\nCasual and Competitive\r\n<p>Xonotic is easy to learn but hard to master! We strive to provide thrilling action for the casual player but also e-sport opportunities for those interested in friendly competition. Features such as simple items, fully customizable configs and servers, a functioning anticheat system, spectator mode, and the opportunity to watch and record games make Xonotic appealing to competitive players. </p>Controls<p>WASD to move, mouse to look around, left click for primary fire, right click for secondary fire, center click to zoom in, space to jump, left shift to squat, mousewheel and number keys switch weapons, Q switches back to previous weapon. The rest is gamemode- and mutator-specific.</p>More Info<p>For questions on playing and using the game, please refer to the Xonotic wiki or ask on the Xonotic IRC channel.</p><p>For bugs, I suggest that you comment about them on this page first so I can place them on Xonotic's GitLab if they really are bugs.</p><p>For questions about Xonotic's presence on Itch, also leave a comment.</p><p>For information about upcoming features, I will regularly update the devlog. If you're willing to sort through, you can also check Xonotic's GitLab group, where development is done.</p>", "metacritic": null, "released": "2017-12-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c94/c94d2bb25c97df7b381228c3186931b2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["open source reuploader"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}