{"id": 929111, "slug": "cipher-patrol-2-the-pure-sword-commodore-64", "name": "Cipher Patrol 2 - The Pure Sword [Commodore 64]", "name_original": "Cipher Patrol 2 - The Pure Sword [Commodore 64]", "description": "<p>Eleanor Burns and TND games is very proud to present Cipher Patrol 2 - The Pure Sword. This is a Strider inspired game that was originally made using the Shoot Em Up Construction Kit, but has been fully transformed into a proper platform action arcade action adventure with thanks to Eleanor's additional code.  The game also features a brand new front end, new score panel and atmospheric music by TND games.<br/></p>\n<p><strong>How to play</strong><br/></p>\n<p>In an alternate nineteenth century, the East India Company has allied with the demonic Rakshasas and has its sights on global domination. Agent Cipher of the Indian resistance forces is sent on a last-ditch mission to assassinate their officers and the demons empowering them, armed with the legendary Pure Sword of Vishnu.</p>\n<p>Traverse screens from right to left, dealing with the enemy forces along the way, either by agility (you can jump, and climb certain walls), with your sword, or with \"smart\" grenades (limited collectables, activated with \"S\", but useless against bosses). Other power-ups, carried by flying drones, will increase your sword range and lives. Finishing the game will reveal a password for the epilogue.</p>\n<p><strong>Controls<br/></strong><br/>Use joystick in port 2 (or number pad keys and Z if playing web version)<br/>Up / (Numpad 8) - Jump/Climb up <br/>Down / (Numpad 2) - Climb down<br/>Left / Right (Numpad 4 / 6) - Run left/right<br/>Fire - Use sword<br/>S - Activate grenade<br/>Run Stop (Escape) - Pause game<br/>Q (While paused) - Abort game<br/><br/><br/><strong>Credits</strong><br/>Game design, graphics, in game enhancements by <strong>Eleanor Burns<br/></strong>Front end code, logo rendering, panel sprites and music by <strong>Richard Bayliss</strong><br/>Tape loader source by <strong>Martin Piper</strong></p>\n<p>(C)2023 Eleanor Burns for TND Games as Public Domain software.<br/><br/></p>", "metacritic": null, "released": "2023-02-19", "tba": false, "updated": "2023-02-20T07:35:01", "background_image": "https://media.rawg.io/media/screenshots/139/13942c2d334d9560b08daf9334bc00f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Richard of TND"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}