{"id": 929209, "slug": "bewitched-mysteries", "name": "Bewitched Mysteries", "name_original": "Bewitched Mysteries", "description": "<p><strong>+++ Intro +++</strong></p>\n<p>This is our game for The Enigma Game Jam 2023.</p>\n<p>The theme is Supernatural, so we made a detective game based on gathering clues to solve a mystery.</p>\n<p>Music and Sfx under CC0.</p>\n<p><strong>+++ Commands +++</strong></p>\n<p>Everything can be made with the mouse interactions.</p>\n<p>There is a note pad so you can write down clues you get from talking with people.</p>\n<p>Use Arrow Keys and/or WASD to navigate the map as well.</p>\n<p><strong>+++ Guide +++</strong></p>\n<p>You are a supernatural detective with spells that can help you solve any case.</p>\n<p>Those spells are:</p>\n<p>Read Minds - allow you to search for usefull thoughts inside a person's head;</p>\n<p>Summon Ancestor - use your powers to summon an ancestor to tell you something about the case</p>\n<p>Invoke Familiar - bring from another plane of existence a creature that will search a person's personal belongings after clues</p>\n<p>Detect Magic - this spell enhances your senses allowing you to see magical auras</p>\n<p>All those spells can be cast once per chapter and only after questioning a person once.</p>\n<p>You can leave a conversation without using a spell and come back later to use it.</p>\n<p>You can only use one spell per person, even if your spells available are not spent yet.</p>\n<p>At any time you can solve the mystery by accessing a button called \"Solve Case\" in your Note's Book.</p>\n<p><strong>+++ Language Option +++</strong></p>\n<p>Since we are a brasilian team, we made a version on Portuguese(BR) as a separate game file.</p>", "metacritic": null, "released": "2023-02-19", "tba": false, "updated": "2023-02-20T08:18:51", "background_image": "https://media.rawg.io/media/screenshots/df7/df7c4ce96097bb731dfc6a03d4bd1927.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Armis"], "genres": [], "publishers": [], "esrb_rating": null}