{"id": 929462, "slug": "i-found-him-in-the-garden", "name": "I Found Him In The Garden", "name_original": "I Found Him In The Garden", "description": "The Story\r\n<p>Our story begins with a family of cats who had to unfortunately abandon their dying kitten. Our hero, a soul reaper from an unknown land, finds the young kitty and decides to help him. The soul reaper comes to realize he needs to find some humans to put an end to, harvest their souls and save the dying kitten so he can live once more.</p>\r\nConcept &amp; Goal\r\n<p>\"I Found Him In This Garden\" is a top-down 2d game in which you play a soul reaper who's looking to harvest human souls so they can be used to revive the dying cat in the garden. As the player your goal is to find 4 humans, harvest their souls and retrieve them back to the cat before the human spirits get you. If the human spirits get you, the soul you have in that moment will go back to the human and you'll have to try again. Be careful though because when you take a human's soul, he turns, and when he turns he will come get you too.</p>\r\nControls\r\n<p>You can play this game using keyboard or a game pad.</p>\n<p><strong>Walk - </strong>ARROW KEYS<br/></p>\n<p><strong>Dash </strong>- SHIFT</p>\n<p><strong>Harvest </strong>- SPACE  (Held down)</p>\n<p><strong>Deposit Soul</strong> - E</p>\n<p>*When harvesting make sure to stay in range of the human, otherwise your skill will be interrupted</p>\r\nCredits\r\n<p>This game has been made as part of Brackey's Game Jam 2023.1 with the best team I could have asked for and all the credit goes to them.</p>\n<p>Art &amp; Characters - Ilay Zemach &amp; Talya Broude</p>\n<p>Animations - Daniel Bentovim</p>\n<p>Unity Development - Oz Hershco</p>", "metacritic": null, "released": "2023-02-19", "tba": false, "updated": "2023-02-20T10:21:14", "background_image": "https://media.rawg.io/media/screenshots/f88/f8890be61476756192877107a50c42e4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["shuffle8"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}