{"id": 929472, "slug": "immortals-dnf", "name": "Immortals (DNF)", "name_original": "Immortals (DNF)", "description": "<p>Immortals is (was supposed to be) a game about a cursed party of adventures who could not die.  They were inhabited by souls of the dead, and each death resulted in a soul bursting out of them and another taking it's place shortly after. Resurrecting the character with new stats and abilities each time.<br/><br/>Each time a character died in game they would be brought back to life a few turns later. When this happened they would be assigned a new class which served as a template for the new stats and abilities. The character's stats  would be re-rolled randomly weighted by level, class, and skill tree improvements. Actions available to them would also be randomly generated based on the class assigned and level.<br/><br/>Essentially each death gave the player a new character with new strengths and weaknesses. I wanted death not feel like a punishment, but like a new opportunity. At the same time if the player was randomly rolled an exceptional character there would be incentive to keep the character alive, which I planned to make difficult.<br/><br/>Since death and rebirth with new abilities was the core mechanic of this short game, I wanted characters to die frequently (since they would be reborn right away anyway)  and find fun ways to interact with the mechanic.<br/><br/>A also planned on an overworld exploration mechanic, a short storyline and dialogue, and much more.</p>\n<p>Unfortunately, nearly none of this made into the game. This was my first Game Jam, and a big learning experience. I planned on implementing all of the gameplay systems, story/dialogue, and make all of the assets myself. I've made great projects from scratch in the past, but never really on a short deadline, and I very much underestimated the length of time it would take me to implement things.<br/><br/>I spent nearly all my time on the game systems. I built a Breadth First Search pathfinding algorithm from scratch. Since I wanted strict tile-based movement in 3D, and I had built 2D pathfinding algorithms in the past. I also built the turn based combat system and several other things related to the rebirth system. By the time I was done and worked out all the bugs with everything I was left with very little time to build any of the rest of the game.</p><p>I finally had to scramble to get something playable together to submit, opting to have a single scene of continuous combat until one side is completely obliterated. It's a hollow shell of what I had planned, but at least I have something to show.</p><p>The only gameplay that made it in:</p><p>- Very basic tactics combat system</p><p>- Characters \"Resurrect\"  the round after they die as a new class</p><p>- More and more enemies join the fight each round</p><p>So I present to you more of a demo than a game. This will not be my last Game Jam, but this one has taught me lessons about controlling the scope of a project for future jams.<br/><br/>Thanks for playing! I plan on releasing a video about the making of this. A dev log of sorts, about the game, and my experience creating it. You'll be able to find it here when it's posted: https://www.youtube.com/@demidragon485<br/></p>", "metacritic": null, "released": "2023-02-19", "tba": false, "updated": "2023-02-20T10:25:45", "background_image": "https://media.rawg.io/media/screenshots/3b6/3b63471c6dc1d13cde7143314a179b42.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Demidragon"], "genres": ["Adventure", "Strategy"], "publishers": [], "esrb_rating": null}