{"id": 929553, "slug": "three-lane-bounty", "name": "Three lane bounty", "name_original": "Three lane bounty", "description": "<p>\"Three Lane Bounty\" is a deck building rogue-like card game where you play using three different hands that you can play from various lanes. You can also combo play cards to deal extra damage. In the game, you will encounter a diverse range of enemies, including regular enemies, mini-bosses, and bosses. With over 14 cards and 7 types of enemies currently in the game and more to come, there's plenty to keep you entertained.\r\n</p>\n\n\n<p>The objective of \"Three Lane Bounty\" is to defeat enemies, progress through levels, and acquire new cards and relics to build and customize your deck. Each new card or relic will allow you to fine-tune your gameplay and try out new strategies. You can also upgrade your abilities and customize your deck to become even more powerful.\r\n</p>\n\n\n<p>In addition to the diverse range of enemies, you'll also encounter Relics throughout the game. These powerful items will modify your gameplay, offering various benefits and challenges. With each new Relic, you'll have to decide whether to take advantage of its benefits or face its challenges to continue progressing through the game. Please note that Relics are not yet available in the game, but they will be added soon.\r\n</p>\n\n\n<p>As you progress through the game, you'll have the opportunity to acquire new cards and relics, build your deck, and upgrade your abilities. With each new addition, you'll be better equipped to take on the increasingly challenging enemies and obstacles that lie ahead. As you customize your deck, you'll be able to experiment with different strategies, fine-tune your gameplay, and ultimately emerge victorious. Note that upgrades and customization will be added soon and are not yet available in the game.\r\n</p>\n\n\n<p>If you want to help with the development of the game, please consider making a donation. All donations go towards the development of the game and are greatly appreciated.\r\n</p>\n\n\n<p>Get ready to embark on a thrilling adventure filled with tactical gameplay and exciting challenges. Play your cards right, combo your moves, and defeat your enemies to become the ultimate bounty hunter in Three Lane Bounty. With its unique combination of deck building and rogue-like gameplay, this game is sure to keep you on the edge of your seat and coming back for more.\r\n</p>\n\n<p>We hope you enjoy playing \"Three Lane Bounty\" and look forward to your feedback as we continue to develop and improve the game.\r\n</p>", "metacritic": null, "released": "2023-02-19", "tba": false, "updated": "2023-02-20T11:02:20", "background_image": "https://media.rawg.io/media/screenshots/df7/df7bbc10dba222c828ac89c880e0b635.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Oiral"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}