{"id": 92960, "slug": "yorg", "name": "Yorg", "name_original": "Yorg", "description": "<p><strong>Yorg</strong> is a <em>free open source</em> racing game for <em>Windows</em>, <em>OSX</em> and <em>Linux</em>. <br/> <br/>The main elements of the game are: <br/> </p>\n<ul><li><em>third person</em> visual perspective; </li><li><em>arcade</em>-style;</li><li>8 different <em>drivers</em> to choose from;</li><li>8 different <em>cars</em> (at the moment, but much more to come!);</li><li>6 different <em>tracks</em> (as above, this is just the current state of art, our designers are already working on more of them);</li><li><em>AI</em>;</li><li><em>power-ups</em> (who said cheating is for losers?);</li><li><em>weapons</em> (oh yes, you will fire your enemies up!);</li><li><em>championships</em> (so you can show you it wasn't just a one time luck!);</li><li><em>experimental multiplayer</em> (because is funnier to rule over friends, than over machines!);</li><li>improved multiplayer (planned for release 0.10);</li><li>local multiplayer (planned for release 0.11);</li><li>joypad support, particle effects and several performance improvements will be published as soon as <em>Panda3D 1.10</em> will be released.</li></ul>\n<p>The current stable release is <strong>0.9</strong> but, of course, a lot is still to be developed: some of the next releases are already planned, as you can see, but <em>much more is on development</em>. <br/></p>\n<p>More informations and news on Yorg's status can be found at our blog.</p><p>\"<em>Yorg is a very fun racing game in the style of MicroMachines, and we recommend all of you to try without further delay.</em>\" (Jugando En Linux)<br/></p>\n<p><em>\"I think they've got a great start here and it could really turn into something awesome if they keep on developing it.\"</em> (GamingOnLinux)</p>\n<p><em>\"Yorg is already giving a lot of fun right now. The tracks are quite substantial, varied and challenging.\"</em> (LinuxCommunity)<br/></p><em>“It all looks very well made; anyone looking for some arcady action racing should give this a try!”</em> (Free Game News)\r\n<p><em>“The whole reminds a bit the recently released Micro Machines World Series.”</em> (Holarse)</p>\n<p>NB Disable shaders and reduce cars' number in order to play on <br/>slower machines.</p><p>NB Look at Yorg's page on our site for more info for playing multiplayer races.<br/></p>\n<p>PS Please, consider supporting us! ;) Thank you!<br/></p>", "metacritic": null, "released": "2017-04-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/46d/46d0cde16b58403b38192e810d89d9c9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux"], "developers": ["Ya2"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}