{"id": 9297, "slug": "slingshot-crystal-blaster", "name": "Slingshot Crystal Blaster", "name_original": "Slingshot Crystal Blaster", "description": "Use your sky-blaster slingshot to aim at the target and shoot at them before it’s too late. This is what “Slingshot Crystal Blaster” is all about. You just need to point at the floating objects in the sky and shoot at them at the right time to take them down. Note that, you need to be fast and precise, as you just have one life and you’ll lose as soon as you miss One target. <br/><br/>This slingshot shooting game comes with a clean and neat design and the 3D graphic is just gorgeous. There are different eye-catching backgrounds and environments and since they come randomly, you never know whether you are going to aim and shoot at the targets in a mountain, sea, dessert or any other surprising places.<br/><br/>The gameplay is literally endless and as long as you be able to shoot as the targets with your slingshot, the game continues. There are 2 different challenges for you: Improve your own record or try to get the highest score among your friends in the leaderboard. <br/><br/>To control the slingshot and shoot with it, you just need to press and hold your finger on the slingshot to equip it, and then move your finger to the right and left to aim at the target, move it forward or backward to specify the power and release your finger to shoot. It just needs a few tries to completely get used to controlling the slingshot and after that you just need to focus on the objects coming from different directions and try to take them down before they go away.<br/><br/>Slingshot Crystal Blaster Main Features at a Glance:<br/><br/>- Easy to learn<br/>- Wonderful design with realistic music and sound effects<br/>- Eye-catching backgrounds and environments<br/>- Leaderboard feature to challenge friends<br/>- Fun for all ages<br/>- Free with no in-app-purchase items<br/><br/>Well, Slingshot Crystal Blaster is completely free to play and if you like playing such aim &amp;amp; shoot games with a slingshot, then you should definitely try it. <br/><br/>Let’s see how far you can go and how many floating fruits can you blast and take down. Remember, you just have one life, so you have to decide carefully when the shoot and where to shoot.<br/><br/>Stay in touch and let us know about any bugs, feature requests or any other suggestions.", "metacritic": null, "released": "2017-02-12", "tba": false, "updated": "2019-10-22T14:30:24", "background_image": "https://media.rawg.io/media/screenshots/785/785a95e2311be2c64c91ab85c183e5a3.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lu Quoc Man"], "genres": ["Sports", "Arcade"], "publishers": ["Lu Quoc Man"], "esrb_rating": "Everyone 10+"}