{"id": 929849, "slug": "the-witches-and-the-devil", "name": "The Witches And The Devil", "name_original": "The Witches And The Devil", "description": "<p>Made in Godot 4 for Godot Wild Jam #54 - Curses. See Theme Elements below.<br/></p>\n<p>The Witches blast you with curse words to destroy your soul. They are the Devil's minions. The Devil has dragged your soul down to this strange place to exact payment for a deal made so long ago that you have mostly forgotten about. You are now the Devil's plaything. If you can pass the test, you might just get out of this alive...<br/></p>\n<p>Type the counter curses to defend yourself. Each witch only has a certain amount of curse power and expires when it is used up. However, the curses will chase you forever if you don't destroy them. Also, the only thing the curses hit is you, so running away is no good as they will cross the void and go through walls.<br/></p>\n<p>You will meet the Devil in the creepy Ye Olde Devilish Shoppe. In this shop, the only currency that the devil cares about is Soul Power. Sell pieces of your soul to the Devil for perks, power ups and potions.</p>\n<p>There's no going back. Everything behind you disintigrates into a bleak blank void. Forward and through is the only option. And whatever you do, don't fall into the void...<br/></p>\r\nControls:\r\n<ul><li>A to Z - type the counter-curse words to destroy letters in the witch curses before the curses hit you</li><li>Use the number keys along the top of the keyboard (NOT the numeric keypad) to use potions from your inventory</li><li>Use middle-mouse drag to move the camera view, or just use the movement keys below</li><li>Movement:<ul><li>Arrow keys (forward, back, left, right) with PgUp to pan camera left or PgDn to pan camera right (OK for most laptop keyboards)</li></ul><ul><li>and/or</li></ul><ul><li>Use the numeric keypad: 8 = fwd, 5 = back, 4 = left, 6 = right, 7 = pan left, 9 = pan right</li><li>Jump: Space bar. Not much use at present, but could be used in a later version to get over obstacles between rooms.</li></ul></li></ul>\n<p>\n</p>\r\nTheme Elements:\r\n<ul><li>Curses: Well, the witches throw curses at you and you have to type the corresponding counter-curse. The curses chase you until they are destroyed with the counter-curse or you are hit and lose Soul Power.</li><li>Crumbling Location: The world disintegrates behind you as you move forward, leaving a bleak void. Hence, when you move to a new room or corridor, the corridor or room you just left will disappear. (Would be better with something more crumbly, but I don't think there's time before the deadline.)</li><li>Faustian Bargain: Trade Soul Power for goodies in the Devil's Shoppe. Also, you are in this pickle because of a bargain with the Devil in your past. </li><li>Do It For Me (procedural generation):<ul><li>After completing Level 1 (very easy), each level starts in the Devil's Shoppe.</li><li>If you die, you go back to the Shoppe and the level is regenerated. You automatically lose 4 points of Max Soul Power. If you run out of Soul Power altogether (or fall into The Void), game over...</li></ul><ul><li>Levels: Randomly generated from pre-set rooms and corridors (created with GridMaps). The number of rooms is level dependent.</li></ul><ul><li>Witches are randomly distributed in the rooms. Curse Power is level dependent.</li><li>Every third level has a Boss Witch in the last room .</li></ul></li></ul>\r\nAcknowledgements and Credits:\r\n<ul><li>Font: Almendra from Google Fonts</li><li>Witch and Devil characters and some other items: First time using them since purchasing them from Polygon (via a Humble Bundle) a while back. Long term objective is to replace them with custom characters made in Blender - just not enough time to do that for this jam.</li><li>Witch and Devil animations: Mixamo</li><li>Audio: All open source and no requirements for attribution. Mostly from Pixabay plus a little bit of Kenney. Will be listed in in-game credits (time permitting).</li><li>Other 3D elements: Made for this game by Cymbalis, with Blender.</li></ul>\r\nMinimum Recommended System:\r\n<ul><li>64-bit OS</li><li>8GB RAM</li><li>Screen Resolution: 1920 x 1080</li><li>Standard QWERTY keyboard, preferably with a dedicated numeric keypad</li><li>Vulkan compatibile graphics hardware (Windows will tell you when Vulkan is not supported, no idea about MacOS and Linux)</li></ul>\n<p>Please note that this is not tested on MacOS or Linux. The MacOS build may be blocked by the Gatekeeper (ad-hoc code signing etc.). </p>\r\nBugs etc.\r\n<p>Seems mostly OK. The worst issue is that shadows show a lot of banding. This seems to be an engine issue but nevertheless bears investigation when time permits.</p>\n<p>If you find something that you think is a bug (that is not listed in the To Do section below), please leave a comment.<br/></p>\r\nStill To Do in no particular order:\r\n<ul><li>Purchasing perks and power-ups in the Devilish Shoppe. Currently you can only purchase potions.</li><li>More Witches with even more and varied Curse Words.</li><li>Add more rooms for greater variation.</li><li>Add a bit more to the soundscape. For example, muttering witches, witch death cry etc.</li><li>Settings for audio levels and game difficulty.</li><li>Long Counter Curses (where the counter curse is longer than the Curse Word, so you have to type more characters to start demolishing letters in the Curse Word).</li><li>Refactor how Curse Word letters are destroyed. Due to timing issues, somtimes you can remove letters from more than one Curse Word. Not likely to get this done before the Jam deadline.</li><li>Full test to the end. Because a) there is a need to verify that the procedural generation keeps working to the end without problems, and b) not sure yet if it is actually possible to win the game or if it gets too hard at high levels.</li><li>Make the environment generally richer. This will have to come after the Wild Jam is finished.</li></ul>\n<p>This list will be worked on after Godot Wild Jam #54 is completely finished.</p>", "metacritic": null, "released": "2023-02-19", "tba": false, "updated": "2023-02-20T13:22:41", "background_image": "https://media.rawg.io/media/screenshots/831/8315ca80bc618493180bdd4aa8b68709.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Cymbalis"], "genres": ["Action"], "publishers": [], "esrb_rating": null}