{"id": 929867, "slug": "the-experiment-itch-cortez", "name": "The Experiment (itch) (Cortez)", "name_original": "The Experiment (itch) (Cortez)", "description": "The ExperimentYou incarnate a shapeshifting mutant, sent in rooms to solve puzzles.\r\nDeath is not a problem to you as long as you have your egg, and biomass to respawn.\r\nWho created you? What's your goal? That's a whole other story.\r\nControls\r\nW/A/S/D - Move<br/>R - Restart<br/>ESC - Main menu<br/>Q - Lay egg<br/>Space - Spit (Worm)\r\n\r\nCredits\r\n<p>Made for the Brackeys Game Jam 2023.1 </p>\n<p>It is my very first game, I tried to make it as bugless as possible. All kind of feedback are welcomed!</p>\n<p>Tileset by Aske4 (\"Free space tileset\" edited for my needs)<br/>Music by LodoLoon Studio (\"Save/Pause Menu\" &amp; \"Puzzled Mind\")<br/>SFX by Kronbits (\"200 Free SFX\")</p>\n<strong>Known issues</strong>\n<p>- Music isn't looping, fixed and waiting for the jam vote period to end. You can find the level music there to listen while playing.<br/>- Sometimes when you hit a bullet, it kills you but the respawn isn't triggered.</p>\n<strong>Devlog</strong>\n<p>Day 1: Brainstorm with people on figma, takes me a couple of hour to find a very clear idea of what I'm gonna do: a puzzle game where you play a mutant that can respawn from its \"egg\" when it dies and choose between different forms, used to solve the puzzles</p>\n<p>Day 2: Spent half the day on choosing assets, learning libresprite and learning the auto tile system from Godot.</p>\n<p>Spent more the other half trying to make a grid move system by myself, then try it with a tutorial that I couldn't understand, tried again alone, and called it a day.</p>\n<p>Day 3: In a couple of hours I finally understood the tutorial, and realize it's very archaic and not flexible. Find another tutorial and decides to give it a go the next day.</p>\n<p>Day 4: Starting the new tutorial using ray cast, and it seems to be exactly what I need. Now I can move forward. Implemented crates, plates, movement animations. Created some UI, main menu and level selector templates. It's ugly, but it'll be functionnal. Made some more tiles to cover all the cases.</p>\n<p>Day 5: Reworked a bit my sprites. Made some more UI. Implemented ressource system &amp; death. Took me much more time than expected, but now it's done. Got myself entangled in ray cast, collision and signals, but I understand it all better now! I'm trying to make the respawn before going to bed.</p>\n<p>Day 6: Got collisions to work early in the morning. Made turrets shoot bullets that can kill the player properly. Tweaked it again the next day.</p>\n<p>Day 7: Mostly bug fixes &amp; level design. Finished the assets. Added some music &amp; sfx. Submitted the game.</p>\n<p>Day 8: Fix bug (see Patch 1), added banner &amp; setup the itch page.</p>", "metacritic": null, "released": "2023-02-19", "tba": false, "updated": "2023-02-20T13:30:43", "background_image": "https://media.rawg.io/media/screenshots/3b8/3b8c521b476145ca9402578dc1431312.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Cortez"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}