{"id": 929915, "slug": "ragnarok-survivors-valhalla-demo", "name": "Ragnarok Survivors: Valhalla - DEMO", "name_original": "Ragnarok Survivors: Valhalla - DEMO", "description": "Are you worthy to enter Valhalla?\r\n<p><strong>PLEASE NOTE THAT THIS IS AN EARLY DEMO VERSION POSTED HERE TO GARNER FEEDBACK! WANT TO JOIN THE BETA PROGRAM? SEND ME A MESSAGE AT @KODINGNIGHTS / TWITTER</strong></p><p>WISHLIST THE GAME ON STEAM: https://store.steampowered.com/app/2295410/Ragnarok_Survivors_Valhalla/</p>\n<p>Prove to Odin that you deserve a place at the table in the afterlife and survive Ragnarok.Navigate and fight hordes of enemies that are all out to feed you to the ravens.<br/>Fight well to receive gifts from bored gods, but choose wisely - your life depends on it!<br/><br/><strong>Ragnarok Survivors: Valhalla</strong> is a time survival game with <strong>minimalistic gameplay</strong> and <strong>roguelite elements</strong>.</p>\n<p>Killing enemies leaves treasures you can offer to the <strong>GODS</strong> to receive <strong>GIFTS</strong> that will help you survive a few more moments.<br/></p>\n<p>The enemies will get stronger as you progress, so you need to build your character to <strong>survive</strong>.<br/><br/><strong>Build your character</strong> using a little bit of luck and a lot of strategic choices to survive an ever increasing onslaught of undead, demons, zombie warriors and other nightmarish creatures. Can you survive for 30 minutes and claim your place at the table in Valhalla? Probably not.<br/><br/>But <strong>when </strong>your die, you die with the knowledge that your sacrifice and inheritance will aid the next Viking trying to <strong>survive Ragnarok</strong>.</p>\n<p>Perfect your character with combinations of weapons and abilities to turn the tide and make your enemies cower before you!</p>\n<p>Survive the onslaught to finally claim your seat at the table with Odin the All-Father!<br/><br/>Then do it all again with a <strong>different build</strong>!</p>\n<ul><li>Kill enemies and collect soul crystals that can be traded for gifts like new weapons, items and abiliies<br/>\n</li><li>Kill minibosses and bosses to find treasure chests with an abundance of loot!<br/>\n</li><li>You will <strong>die a lot</strong>, but you can use your collected <strong>treasure </strong>to <strong>buy new abilities</strong> to improve the next warriors chance for survival<br/>\n</li><li>Unlock new levels, weapons and abilities as you play<br/>\n</li><li>Lots of weapons and abilities to build your character<br/>\n</li><li>Lots of different characters to choose from, each with their own starting weapons and abilities<br/>\n</li><li>Lots of different enemies! They may have different strength and weaknesses, but they are all out to <strong>kill you</strong><br/>\n</li><li>Tons of secrets and easter eggs to uncover... or are there?<br/>\n</li><li>Controller support. Big screen mode.<br/>\n</li><li>Glorious retro pixel art.\r\n</li></ul>", "metacritic": null, "released": "2023-02-18", "tba": false, "updated": "2023-02-20T13:53:31", "background_image": "https://media.rawg.io/media/screenshots/48f/48f559002f6be021634565a64852c73a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KodingNights"], "genres": ["Action"], "publishers": [], "esrb_rating": null}