{"id": 929987, "slug": "the-thornfield-disappearances-demo", "name": "The Thornfield Disappearances Demo", "name_original": "The Thornfield Disappearances Demo", "description": "<p>In the quiet English village of Thornfield, 3 people have gone missing in the past 3 months, and it's starting to look like a pattern. The local police are doing nothing about it, so it's up to you to save the day. Will you be able to solve the mystery before it's too late?<br/></p>\n<p>This is my entry for the Enigma Game Jam, where the theme was 'Supernatural'.</p>\n<p>I've chosen to interpret that to create a fun text-based detective adventure where you have to collect clues that will allow you to solve the mystery of the Thornfield Disappearances. Make choices and follow branching story options to gather the necessary.</p><p>This demo version is a standalone contained story that will hopefully give you a taste of what to expect from a full version.</p>\n<p>I'm hoping to keep working on the game and release a full version somewhere down the line. If you're interested in following me in the meantime, here's my website! And if you wanted to donate anything (you really don't have to), you can do so here :)</p>\n<p><strong>Important note: </strong>You will need to download ALL files (including the music and images) in order to play this game. You should do this before clicking on the html link.<br/></p>\n<p>Also, you may want to lower your volume before playing, as the music is a bit loud!</p><p><strong>Credits:</strong><br/></p><p>All writing and coding done by me (Melika Jeddi)</p><p>Logo designed by Alex Scowen</p><p>Pictures sourced from Pixabay and Discovering Egypt</p><p>Music by Dark Fantasy Studio (Used with a licence)</p>", "metacritic": null, "released": "2023-02-18", "tba": false, "updated": "2023-02-20T14:29:30", "background_image": "https://media.rawg.io/media/screenshots/35c/35c7c3159634356055dd04576953dd43.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Melika Jeddi"], "genres": [], "publishers": [], "esrb_rating": null}