{"id": 930168, "slug": "haliens-season-1-kidnapped", "name": "HALIENS, Season 1, Kidnapped", "name_original": "HALIENS, Season 1, Kidnapped", "description": "<p>Game Story:</p>\n<p>a game where humanity travelled to space in year the 3000 and lived there until the year 4000, then a space crash happened and only one person survived (the player)... And he was in a spacesuit, obviously. his mind was connected to the suit, so when the suit lost power, it basically shut him down. Aliens found him and trapped him in a room (a system, in other words) that contains infinite different levels that can't be escaped unless the player finds certain exploits and bugs in the system so he can escape, and after he loses hope, he escapes</p>\n\n<p>Explanation:</p>\n<p>after the space crash, he was basically shut down, then aliens found him. and to aliens, <em><strong>humans</strong></em> are aliens, so they took him with them, they thought he was a non-intelligent creature, just like us with animals, so they did some experiments on him and altered his body to a robot-like shape, then they trapped him in the room/system! so he is able to move now (he is not shut down), but he still needed fuel for his suit, so now he tries to solve the infinite puzzle, and then, he realizes that its not possible to do it in a simple way, then he figures it out, and escapes, and the story will be open-ended waiting for the sequel</p>\n\n<p>Genre: sci-fi action RPG, Graphics: Vector Art, 3D with some 2D mechanics, we have made quite a lot actually, we made the player model, animations, animation controllers, a fully-fledged inventory system, interaction system, Character Customization, and we are now working on the block coding system</p>", "metacritic": null, "released": "2023-02-18", "tba": false, "updated": "2023-02-20T15:58:08", "background_image": "https://media.rawg.io/media/screenshots/1bf/1bf40bd17752db10f5b187e53542fcd6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Proman4713"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}