{"id": 930236, "slug": "tds-dorobo", "name": "TDS (Dorobo)", "name_original": "TDS (Dorobo)", "description": "<p>The world is overrun with oversized bugs, few survivors are left. It's up to you to clear out the swarm and survive.  Fight 3 enemy types and 2 different bosses, use 4 different weapons, and 3 unique boosts to help you in battle.</p>\n<p>Play through 5 levels and ~30 minutes of gameplay in this top-down shooter style game, earning rewards, leveling up, and unlocking new equipment  such as weapons and boosts.  As short and basic as it is, I hope you get some enjoyment out of it!</p>\r\n\r\nDevelopment Status\r\n<p>I made this game as a way to improve my game dev skills, I have no plans to update this game unless I have spare time or it needs an important bug fix. If you guys really like it or more than just a few people play this then I will consider adding more content, otherwise I'll be working on my next project which will be a bit more of a serious one.</p>\r\n\r\nRecommended Specs\r\n<p>Potato, literally a 90 MB game</p>\r\n\r\nCredits\r\n<p>All music tracks in this game were produced by Grahf. A New Beginning, Road to Nowhere, Home That Became Hell. These tracks are licensed under a CC BY-SA 4.0 International License.<br/> All non music audio tracks in this game are distributed under a CC0 license from  Freesound, dedicated to the public domain.<br/> Roboto: © 2011, Christian Robertson. Apache License.  <br/>All assets other than the ones listed above were created by Dorobo.</p>\r\n\r\nNote\r\n<p>This game was not tested on Mac or Linux, these download files should work and you should be able to launch the game (on Mac it may be tricky), but I can't guarantee it. If you do play on one of those platforms, feel free to let me know how it works so I can update this page.</p>\r\n\r\nContact and Socials\r\n<p>Dorobo.dev@outlook.com<br/>\r\nTwitter\r\n</p>", "metacritic": null, "released": "2023-02-18", "tba": false, "updated": "2023-02-20T16:31:52", "background_image": "https://media.rawg.io/media/screenshots/687/68779bafe6c2bc5c02ce15ce6a507aab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Dorobo"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}