{"id": 93023, "slug": "keen-itch", "name": "Keen (itch)", "name_original": "Keen (itch)", "description": "<p><strong>Keen is a sliding puzzle game with turn-by-turn tactical combat and a hint of adventure!</strong>\n</p>\n<p>\n</p>\n<p>\n<br/>\n</p>\n<p>\n</p>\n<p>\n<em><strong>\"Keen is not a bad idea.\"</strong></em><br/>\r\n\t-- Steven Hansen, \r\n\tDestructoid\r\n</p>\n<p>\n</p>\n<p>\n<em><strong>\"Managed to catch my attention and awaken an addictive interest.\"</strong></em><br/>\r\n\t-- Bruna Penilhas, \r\n\tIGN Brasil\r\n</p>\n<p>\n</p>\n<p>\n<em><strong>\"It might just be the hidden gem that you didn't know you were looking for!\"</strong></em><br/>\r\n\t-- Amy Graves, \r\n\tSquare Enix\r\n</p>\n<p>\n</p>\n<p>\n<em><strong>\"Quite interesting. I like it very much!\"</strong><br/>\n</em>-- Piotr Iwanicki, SUPERHOT</p>\n\n<p>\r\n\tGuide Kim, a grumpy little girl raised by her grandmother to save the world on her journey to stop an evil corporation from destroying her village.\r\n</p>\n<p>\n</p>\n<p>\r\n\tInnovative controls and fluid gameplay allow players to choose their own pace, whether fast as a hack'n'slash or methodic as chess.\r\n</p>\n<p>\r\n\tIt's fresh gameplay to a classic genre - moving and attacking are the same thing!\r\n</p>\n<p>\n</p>\n<p>\n</p>\n<p>\r\n\tIn a remote village where everyone is given a specific role, Kim was chosen as their guardian. Peace reigned for centuries, and the warrior role was a mere tradition tracing back to ancient times of conflict.\r\n</p>\n<p>\r\n\tSoon after Kim turned twelve, a distress call was sensed by her trainer - her own, adorable grandmother - who ordered her to protect the village against an impending attack\r\n\t.\r\n</p>\n<p>\n</p>\n<p>\r\n\tKim was sent to fight without even knowing what violence was. Following a trail of brainwashed minions and high-tech robot soldiers, she would soon find herself in the middle of a world-domination plot carried on by an evil corporation.\r\n</p>\n<p>\n</p>\n<p>\n</p>\n<p>\n</p>\n<p>\n</p>\n<p>\n</p>\n<p>\n</p>\n<p>\n</p>\n<p>\n</p>\n<p>\r\n\tKeen's main innovation lies in its turn-based movement and attack mechanics. Slide our tiny hero vertically and horizontally to move her around puzzly rooms, or to slash through enemies with her mighty blade. Combat relies on precision-planning of enemy placement - a fresh take on the tactics genre.\r\n</p>\n<ul>\n<li>6+hours of NON-FILLER content (Full-version)</li>\n<li>Unveil Kim's story as she tries to save the day!</li>\n<li>Discover secret items, unlock new gadgets and get special powers!</li>\n<li>Slash your way through more than 20 unique enemies! Also...boss battles!</li>\n<li>BIG, maze-like dungeons, spanning from mysterious forests, dark catacombs, top-secret underwater labs, orbital military outposts, and pretty much anywhere fiction can lead us!</li>\n<li>Special collectibles that can be combined into perks and powerups such as telekinesis, teleport, deploying traps and many others.</li>\n</ul>\n<p>\n</p>\n<p>\r\n\tKeen art is all about immersion. Hand-drawn, detail-rich worlds with occasional visual gags aim at telling a story without using words. We're crafting our assets to be as \r\n\t<strong>tasty </strong>as possible!\r\n</p>\n<p>\n</p>\n<p>\n</p>\n<p>\n</p>\n<p>\n</p>\n<p>\n</p>\n<p>\r\n\tDownload and play the current pre-alpha demo with 15 to 30 minutes of gameplay (depending on the player's skills). We are asking for your support to make it a full game as described by the key features above.\r\n</p>\n<p>\r\n\tAll the resources you provide – after due taxes – will go entirely to the development of the game: cool art and animation, amazing levels, polished programming and epic music.\r\n</p>", "metacritic": null, "released": "2016-12-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/df0/df0ef86d705f8f4e704ecc6e2d51f3ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Cat Nigiri"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}