{"id": 93033, "slug": "battlefleet-engineer-demo", "name": "Battlefleet Engineer DEMO", "name_original": "Battlefleet Engineer DEMO", "description": "<p>This is a free demo for spaceship building and fleet combat game Battlefleet Engineer. In this demo you can play randomly generated individual battles with premade ship designs and random fleet composition. Buy the full game from Steam!</p>\r\nCore features\r\n<ul><li><strong>RTS-style battles with up to dozens of ships per side. </strong>Fixed fleets, doesn't include building of units or resource management mechanics.</li><li><strong>Ships are made of and entirely defined by their modules.</strong> The modules such as generators, thrusters, weapons, armor etc. form the structure and define the behavior of the ship. Ships can have anywhere between 5 to over 1000 modules.</li><li><strong>No-cheating Newtonian physics.</strong> All movement is driven by forces from thrusters and other actuators, and there is no friction or dampening. Ships and other objects are simulated as rigid bodies with accurate collision geometries and inertia.</li><li><strong>Per-module damage model</strong> - ships can get partially disabled and split in two. Damage model also includes armor penetration and ricochet calculations.</li><li><strong>Ship resource system.</strong> Most modules have a single function such as power generation or heat dissipation. The resource system gathers, stores and distributes resources such as electricity, heat and fuel between modules on every frame.</li></ul>\r\nGameplay\r\n<p>Gameplay in this demo consists of commanding your fleet in real-time battle against computer controlled enemy fleet. The game is single-player only. Both fleets and level parameters such as battle area size, deployment zones, and asteroids are randomized for each battle. The demo comes with over 40 ship designs from the developer to ensure variety.</p>\n<p>To defeat your enemy, you will need to keep on top of the situation and select targets for your ships based on weapon ranges, maneuverability and defences of both your own and the enemy ships. Positioning and timing of engagements is important because different weapons have very different effective ranges and ships usually only have heavy armor at the front. Keeping your fleet close together maximizes our concentrated damage output, but risks getting surrounded by the enemy. Using specialized ships such as \"tanks\" and \"snipers\" effectively can often decide the outcome of the battle.</p>\n<p>This demo also allows different styles of play. You can micro-manage movement and targeting of all your ships by pausing to give orders, or just tell them to attack all enemies, sit back and watch the beautiful destruction unfold. You can also take control and fly any of your ships manually, with optional control over target selection and weapons as well.</p>", "metacritic": null, "released": "2017-05-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c3a/c3a0902a294cfe016e394b863154685d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 284, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Metalfusion"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}