{"id": 93047, "slug": "spinster-a-cat-lady-game-demo", "name": "Spinster: A Cat Lady Game DEMO", "name_original": "Spinster: A Cat Lady Game DEMO", "description": "<p>This is a Demo of our <strong>Spinster - A Cat Lady Game</strong>, featuring one suburban block, thirty cats and 3 tins of Sourpuss Scraps cat food.</p><p>We hope you enjoy the demo, and please vote for us on Steam Greenlight.<br/></p><p><strong>If you're a Games Journalist or have a YouTube Let's Play channel, big or small, send us a message on YouTube(main trailer below) and we'll hook you up with an early access key for the full game.</strong><br/></p><p>( direct Steam Link )<br/></p><p>Main Trailer</p><p>Feature Trailer - Balls! What are they good for?</p><p>Early Access Full Version available HERE.<br/></p><p>Spinster - A Cat Lady Game is a new indie game based on the mechanics of the original Snake/Nibbles games.<br/></p><p>Explore the town of Downton Tabby and find all one hundred and one cats, dodging furniture, dogs, young people, farm animals, zombies, traffic and aliens in your quest to become the ultimate Spinster! </p><p>Your collection of cats becomes its own growing obstacle, scaling the difficulty to make your goal of one hundred and one felines a serious challenge! </p><p>Spinster features: <br/></p><ul><li>Fast reflex gameplay with three speed/difficulty settings! </li><li>The town of Downton Tabby to explore, with seven large blocks each with a distinct theme(Shopping Mall, Pet Cemetary, etc.)! </li><li>One hundred and one uniquely named and procedurally placed cats to find! </li><li>Hip replacements and mobility tools keep you moving when other heroes would retire! </li><li>Unlockable extra challenges by completing quests and mini-games. Face zombies, aliens and the Night! </li><li>Obstacles galore, from outdoor pizzeria furniture to trampling horses! </li><li>Working light switches and garage doors to activate to enable extra paths! </li><li>Downton Tabby's taxi service gets you quickly back into the action! </li><li>Sourpuss Scraps cat food to collect to feed your army of felines! </li><li>A Cat Detector Van to help you pick up the stragglers!</li></ul>", "metacritic": null, "released": "2016-01-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/677/6777593dbe329817ff35ca5303f5a96b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Emberseed"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}