{"id": 930537, "slug": "fall-in-love-reditive-games", "name": "Fall In Love (Reditive Games)", "name_original": "Fall In Love (Reditive Games)", "description": "<p><strong>Mon Idée:</strong></p><p>Mon idée initiale était d’exploiter le thème de la Jam par un concept drôle. Après qu’une fille a insulté une chemise de “ ringard ” , elle a été enlevée par une meute de fanatiques, voulant venger leur emblème! Notre héros devra affronter ces ennemies redoutables s’il veut sauver sa bien-aimée kidnappée.</p><p><strong>Ce qui s’est bien passé pendant le Challenge:</strong><br/></p>\n<ul><li>J’ai réussi grâce à cette Jam à créer mon 1er jeu du début à la fin! j’avais presque aucune notion de code ni de développement et je suis content du résultat ! </li><li>J’ai suivi la formation (<strong><em>Unreal Banana 01</em></strong>) et quelques tutos durant le développement. </li><li>J’ai réussi à bien comprendre la logique dans les tuto et à la modifier selon mon besoin.</li></ul><p><strong>Ce qui s’est mal passé pendant le Challenge:</strong></p>\n<ul><li>J’ai perdu beaucoup de temps en essayant de coder une logique compliquée pour Spawn l’IA.</li><li>J’ai pas su comment garder le 0 affiché du count-down quand il est au-dessous de 10, ex: 09,08...</li><li> J’ai pas su comment maintenir le déplacement de mon héro que sur l’axe Y quand il rentre en collision avec d’autres meshes. (la collision le fait déplacer dans l’axe X)</li><li>J’ai pas su comment l’IA arrête d’attaquer quand le héros meurt. </li><li>J’ai pas eu le temps de faire le combat de boss à la fin.</li></ul><p><strong>Ce que j’ai appris durant ce Challenge:</strong><br/></p>\n<p>J’ai appris énormément de choses parmi elles:</p><ul><li>J’ai appris comment importer des personnages + animations de Mixamo et les configurer sur UE4</li><li>J’ai appris à créer une IA simple </li><li>J’ai compris ( basiquement) l’utilisation des blueprints, animations blueprints, blueprint interface, blendspace 1D. </li><li>J’ai  appris l’utilisation de variables de type Array.</li><li>J’ai appris à créer et afficher les Widgets.</li><li>J’ai appris comment on Drop un item.</li></ul>", "metacritic": null, "released": "2023-02-17", "tba": false, "updated": "2023-02-20T18:51:15", "background_image": "https://media.rawg.io/media/screenshots/00f/00f0a519369ac6b3cae0e586a8ab497f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Reditive Games"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}