{"id": 93075, "slug": "soundless-a-modern-salem-in-remote-area", "name": "soundless - A MODERN SALEM IN REMOTE AREA", "name_original": "soundless - A MODERN SALEM IN REMOTE AREA", "description": "<p><em>If you are sensitive to descriptions &amp; images of extreme bullying and abuse, please hit the back button now.</em><br/></p>\n<p><em>—Despite all the singing around her, her world was soundless.</em></p>\n<p>A small village cut off from the rest of the world, Phada, spends its days slowly, idling away time by speaking with one another, eating with one another, and dedicating all their attention to studying scripture. With a population of only 145, the governing body of the town is the Group, the name of the miniscule clergy that inhabits the church at the top of the hill. They worship a protective God comprised of two halves: the \"Barrier\" defensive energy and the \"Expulsive\" offensive energy.</p>\n<p>In a town where all you can do is socialize, young Mercy is denied this. Since birth, she has seen the unseen, and was taken in by the Group after losing her parents. Upon turning 10 her vision seemingly became corrupt, causing panic among the villagers. It was decided by the Head Priest and the Holy Woman that the only way to deal with this curse is to aggressively apply the \"antibiotics.\"</p>\n<p>In other words, isolate Mercy until she stops seeing things.</p>\n<p>Now an empty shell of who she once was, 15 year old Mercy attends school and is constantly bullied by her classmates, some truly afraid of her, but most seeing her as an easy target. The sudden death of the 25th Holy Woman startles the village, causing many to believe Mercy's curse is spreading and for her abuse to become more aggressive. Then, one day, the Head Priest reveals God has given them two young Holy Women rather than one.</p>\n<p>When classes end the next day, one calls out to Mercy.</p>\n<p><em><strong>\"I can see it, too.\"</strong></em></p>\n<p>\n</p>\n<p>\r\nFor more information, please check the official website.</p>", "metacritic": null, "released": "2017-04-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/79d/79d9256cd29cdb886f547e5471f07e95.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["milk+"], "genres": [], "publishers": [], "esrb_rating": null}