{"id": 930730, "slug": "cursed-treasure-calamador", "name": "Cursed Treasure (Calamador)", "name_original": "Cursed Treasure (Calamador)", "description": "<p>Controls:</p>\n<p>Fire your soul ball by clicking anywhere in the play area.  Your goal is to pay back your 100 gold debt.  Be careful each shot you take will cost 1 soul from your soul count on the left of the screen.  Every second a phantom guide ball will fire from the reticle to show you where your shot will land.</p>\n<p>Press the Up and Down arrow keys while a ball is loaded to scroll over the level.  You can read all the curses for treasure you have accumulated.</p>\n<p>You can always add more treasure to the stage by getting it from the shop!  But beware each piece of treasure comes with a curse.  If you don't complete the curse's condition by the time your ball hits the fire you will lose another soul for each curse you haven't completed!!!</p>\n<p>The shop will offer up to 3 pieces of cursed treasure at a time, hover over the treasure to see what it has to offer.  The description will tell you how much total gold the treasure will give you if you clear it all and also warn you of the curse the treasure holds.  </p>\n<p>Once you have selected the free treasure you want from the shop you can reset the offerings to see what else they have in store.  Be warned though each additional refresh will cost more and more gold.  You can also buy additional soul from the shop though this also will increase in price the more you buy.</p>\n<p>Try and get 100 gold and repay your debts!</p>", "metacritic": null, "released": "2023-02-16", "tba": false, "updated": "2023-02-20T20:24:54", "background_image": "https://media.rawg.io/media/screenshots/13a/13a7a59d0ad6b51ce3292e89f8f11f3e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Calamador"], "genres": [], "publishers": [], "esrb_rating": null}