{"id": 93076, "slug": "xix-boy-band-simulator", "name": "XIX: Boy Band Simulator", "name_original": "XIX: Boy Band Simulator", "description": "<p>Get swept up in a whirlwind adventure of stardom in <em>XIX: Boy Band Simulator</em>. Step into the shoes of Aigburth, a wide-eyed fresh graduate from Boy Band Academy about to make his debut in the three-piece group XIX alongside bandmates J-Pe, a fame-hungry former child actor; and Lee, a self-proclaimed misunderstood artist.</p>\n<p><em>XIX: Boy Band Simulator</em> is a raising sim meets visual novel meets rhythm game, where you help Aigburth prepare for his group's debut, handling his rehearsal schedule as well as his relationships with his bandmates. Your choices decide how he and XIX make their first marks on the entertainment industry. Will Aigburth become the breakout star of the group? Or will he coast by on the goodwill and talent of his bandmates?</p>\n<ul><li><strong>Control Aigburth’s life:</strong> Plan out Aigburth’s life, week by week. You decide when he sings, when he promotes himself, when he dances, when he rests.</li><li><strong>Customise Aigburth’s skills and guide his career:</strong> Do you want him to be a energetic dancer? Maybe a soulful singer? It’s all in your hands!\n</li><li><strong>Challenge your own rhythmic skills: </strong>Aigburth’s performance in his practices and concerts depend on your skills in the rhythm mini-games. Don’t let him down!\r\n</li><li><strong>Manage Aigburth’s relationships: </strong>What Aigburth says to his bandmates will matter! Make sure it doesn't make things <em>too</em> awkward at practice...\r\n</li></ul>\n<br/>\n\n<p>The player character Aigburth, or Aiggy, is the youngest member of XIX, at 18 years old. Cheerful and a little sheltered, Aigburth starts the game out with no clear defined persona. It's the player's job to make sure he has a place to shine in the boy band. Will he be a breakout sensation, or will he resign himself to the fate of  being \"that third one\"?<br/></p>\n\n<p>J-Pe is the current darling of XIX's management company, PYRO. At 19 years old, he's just old enough to rub his seniority in Aigburth's face. A former child actor with an established fan following, J-Pe makes it clear from day one that he's here for fame, fortune, and to be a <em>massive</em> sell-out. You really can't fault him for being honest.</p>\n\n<p>At 23, Lee is the oldest member of XIX. Largely forgotten about by their management, he has spent the past 7 years floundering in Boy Band Academy with little to no guidance. As such, he's accumulated a large amount of tuition debt, and XIX is his last chance to make it before he's deemed too old for the industry. Lee likes to think of himself as a tortured artist, but really... he's just kind of weird.<br/></p>\n<br/>\n<p>Kit Kwan<br/><em>Lead Visual Designer, Artist, Gameplay/Narrative Designer, Writer<br/></em><br/>Andrew Petersell<br/><em>Lead Programmer, Animator, Gameplay/Narrative Designer, Writer</em><br/><br/>With Original Music by Feyer and Jack Laboz</p>\n<p>Made at the NYU Game Center<br/>Special thanks to faculty advisors Frank Lantz, Matt Boch, and Bennett Foddy<br/></p>\n\n<p>This game is played with a mouse and keyboard.<br/>Use the <strong>mouse</strong> for the <strong>visual novel</strong> and <strong>scheduling screen</strong>,<br/>and the <strong>arrow keys</strong> for the <strong>mini games</strong>!<br/></p>", "metacritic": null, "released": "2018-06-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/dcc/dccdad8d6d7731396425a80117d400ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["XIX: Boy Band Simulator", "Andrew Petersell"], "genres": [], "publishers": [], "esrb_rating": null}