{"id": 930776, "slug": "space-wasters-in-mugged", "name": "Space Wasters in: MUGGED", "name_original": "Space Wasters in: MUGGED", "description": "COOPER HAS BEEN MUGGED!\r\n<p>In the dead of night upon in the depths of space, the worst has happened: Cooper's most prized possession, her #2 Captain mug, has gone missing! Now, on her one day off this year, she must scour The Blazing Glory for any clues its whereabouts.</p>\n<p>Talk with crewmates, investigate objects, and uncover the mystery keeping Cooper from getting that sweet, sweet bean juice!</p>\n<p>Made in 2 weeks for My First Game Jam Winter 2023.</p>\r\nCONTROLS:\r\n  \r\n<ul><li>Use the mouse to investigate objects, advance dialogue, and do just about everything!</li><li>Press the Space Bar advance dialogue, or hold to auto-advance.</li><li>That's it! Pretty simple, no?</li></ul>\r\nWHAT IS SPACE WASTERS?\r\n<p>Space Wasters is a sci-fi/comedy adventure webcomic written by Quippersnapper and drawn by Pixie Press. Although no knowledge of the comic is needed to enjoy this game, it sure does help to understand some of the references we've snuck in there!</p>\n<p>You can find more information on the comic by viewing our Carrd, which has info on where to read it and how to support us (if you'd like): https://space-wasters.carrd.co/<br/></p>\n<p>Hope you enjoy! :)</p>\r\nCHANGELOG\r\n<p><strong>v0.8 Beta (2/12/2023):</strong></p>\n<ul><li>Game has been released and submitted to My First Game Jam Winter 2023! :D</li></ul>\n<p><strong>v0.9.1 Beta (2/18/2023):</strong></p>\n<ul><li>Added music and sounds to the game for your ears to hear.</li><li>Added option to auto-advance dialogue with the Space Bar to help mitigate carpal tunnel for speedrunners.</li><li>Fixed bug where resetting the game did not actually reset the game.</li><li>Minor dialogue/cutscene tweaks.</li></ul>", "metacritic": null, "released": "2023-02-12", "tba": false, "updated": "2023-02-20T20:43:35", "background_image": "https://media.rawg.io/media/screenshots/105/105a1ae024921e9888f05bfe7c7c8903.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Quippersnapper"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}