{"id": 930858, "slug": "en-suo-mu-zhan-shi", "name": "恩索姆战士", "name_original": "恩索姆战士", "description": "Story introduction: The story takes place on the mainland of Ensom. The evil emperor occupied the country of the main character [Zale]. His only purpose at present is to escape from this place and live in other places on the mainland<br/><br/>Game features:<br/><br/>☆ Game type: This is a horizontal adventure game<br/><br/>☆ Hand-painted pixel-style art: character, animation and environment design are all completed by individual hand-painted<br/><br/>☆ Fragmented narrative style: enemies in the game or information scattered in the world will better improve the whole world view. There will be various travelers and fallen soldier records in the game. They will convey to the players what happened to them and the dangers on this continent.<br/><br/>☆ Dangerous map: The dangerous terrain and the enemy together constitute a dangerous world in the game. Players need to attack and jump to deal with the enemy's attack, and pass through the level full of mechanisms in the game through precise jumping and direction control.<br/><br/>☆ Simple operation and playing method: The game is simple and can be completed with only four keys. Players need to operate the game characters to move, attack and jump to deal with all situations in the game. It is very friendly to players who are not good at playing action games.<br/><br/>Story background: Ensom is a land full of magic. There are many countries on this land, some strong and some weak. Unfortunately, the boy Zale lives in a weak country. On this day, in order to realize his ambition, the evil imperial emperor sent troops to attack this small country, trying to annex it, so as to strengthen the empire. Facing the big army, the emperor of this country fled in a hurry, And Zale, a child, can only leave this small and weak country and find a new home", "metacritic": null, "released": "2023-02-20", "tba": false, "updated": "2023-02-24T03:15:51", "background_image": "https://media.rawg.io/media/screenshots/201/2017f0fabb6d2caa116b298a8ec3e5e0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["游戏工艺"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["游戏工艺"], "esrb_rating": null}