{"id": 930855, "slug": "operation-eronta", "name": "Operation: ERONTA", "name_original": "Operation: ERONTA", "description": "As an agent assigned by CIA, we are going to finish a mafia  organization earning billions of dollar thanks to the drug and weapon merchandise. This organization hadn't been investigated deeply for many years and consequently not only has it remained the number one organization of the dark commerse, but it has also effected the course of many countries' economy by its policy. Our main purpose is to collapse this organization totally by making use of the information from a place which is understood that it is connected to this organization. There are 5 levels in the game which means 5 different operations. The monotony of the game has been reduced by different gameplay mechanics at each level. There are 6 different weapons in total and these weapons will give the player feeling of progress as the levels go further. These are:<br/>\r\n-AK47<br/>\r\n-MAGNUM<br/>\r\n-SNIPER<br/>\r\n-SHOTGUN<br/>\r\n-RPG-7<br/>\r\n-MARK23<br/>\r\nNot only can you use your different weapons, you can also use your bombs in the game. As a matter of fact you can terminate enemies by giving an order the assistant agent who will accompany you in one level. Thanks to the game design is connected with the scenario, it helps the player to understand how important that level is in the scenario while the player plays on the other hand. As a CIA agent you will be learning that this organization gets into like what dark businesses and finishing it off gradually.", "metacritic": null, "released": "2023-02-19", "tba": false, "updated": "2023-02-24T03:10:37", "background_image": "https://media.rawg.io/media/screenshots/d30/d306d69d5c2e1f494b2ebb692892f479.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 280, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ihsan Bilgisayar Yazilim Ltd. Sti"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Ihsan Bilgisayar Yazilim Ltd. Sti"], "esrb_rating": null}