{"id": 930850, "slug": "dawn-of-hell", "name": "Dawn Of Hell", "name_original": "Dawn Of Hell", "description": "<strong>Dawn Of Hell is an indie first-person survival horror game, which tells the story of a tragic past in an abandoned village, where you will experience a dark night. During the journey, he must face challenges and solve puzzles to advance and discover the truth behind that place. You'll have a few options during the game that could end up leading you to different possible endings. Tension and fear are present at every step, and you must always be alert to the danger that can arise at any moment, find a way to escape this terrible nightmare.</strong><br/><br/>Your name is Laura, a young woman who is taking a trip to her family, when she needs to fill up the vehicle to continue the journey, however, you hear a supposed story of a shortcut where strange things happened in the region, but you are advised to follow by the normal path, however, there would be something wrong with this route, causing their plans to change completely.<h3>Main Game Features</h3><br/><ul><li>Puzzles: The player must solve some puzzles along the journey, using your deduction skills to advance and uncover the village's secret.</li></ul><br/><ul><li>Setting: The game takes place in a cursed village, with dark and frightening scenarios that increase the tension and fear of the player.</li></ul><br/><ul><li>Story: The game's story is intriguing and mysterious, keeping the player hooked and eager to find out what happened to the cursed village and how to get out of there.</li></ul><br/><ul><li>Alternative endings: During the game, you can go through three different endings, good or bad.</li></ul><h3>Tips for a better gaming experience</h3><br/><strong>Play alone with headphones in a dark environment</strong><br/><strong>When using a lock, make slow clicks with a 2 second wait</strong><br/><strong>If the player freezes, try toggling window mode between [Windowed, Fullscreen Windowed, Fullscreen] while moving.</strong>", "metacritic": null, "released": "2023-02-20", "tba": false, "updated": "2023-02-24T03:02:02", "background_image": "https://media.rawg.io/media/screenshots/f04/f043105e50a75ae5d6c67adb2cdd16fa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Samuka Gomes"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["Samuka Gomes"], "esrb_rating": null}