{"id": 930917, "slug": "spellarium-9-match-3-puzzle", "name": "Spellarium 9 Match 3 Puzzle", "name_original": "Spellarium 9 Match 3 Puzzle", "description": "The Dark Elements are an essential part of our world. It's not possible to do without them. But they're restless and should be under control.<br/>\r\nThis time they've rebelled and a huge black hole is about to swallow everything. Eric must unite all the other Elements and take control of the rebellious dark spirits.<br/>\r\n- 110 breathtaking Match 3 levels.  Our Match 3 game is unique! Levels are like puzzles with a lot of different obstacles and you have to find a way to collect all coins and colored tiles to overcome them. If you're stuck, there's an interactive hint that allows you to see your next step. <br/>\n<br/>\r\nAll levels ( Match 3, Jigsaw, Hidden Objects, Spot the Difference ) are re-playable through the side menu.<br/>\r\nThere's also a help book that explain all game features.<br/>\n<br/>\r\nSo, you will get:<br/>\r\n-110 unique Match 3 Puzzle levels. Each level is designed with love, like a piece of art, in order to keep the game interesting, not just mindlessly moving tiles.<br/>\r\n- a beautiful town to build<br/>\r\n- a set of skippable bonus games: Spot the Difference, Hidden Objects, Jigsaw puzzles, Mahjong, Solitaire.<br/>\n<br/>\r\nTry it! Recommend it to your friends if you like it! We put more effort into making our games interesting for players rather than promoting them! Share your thoughts, ask questions on our FB page, we make games for you and love to read your feedback!", "metacritic": null, "released": "2023-02-21", "tba": false, "updated": "2023-02-24T04:36:47", "background_image": "https://media.rawg.io/media/screenshots/169/169ae855eeb9909ffeeaee393454e752.jpg", "website": "https://www.facebook.com/lgtsia", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 449, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LGT SIA", "https://www.facebook.com/lgtsia"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["LGT SIA"], "esrb_rating": null}