{"id": 930976, "slug": "bilkins-folly", "name": "Bilkins' Folly", "name_original": "Bilkins' Folly", "description": "<p>Percival “Percy” Bilkins is a treasure hunter on a mission to find his missing mother and grandfather, who mysteriously disappeared many years ago. The only problem? His ship got wrecked in a storm, and he needs to find a new way forward. Together with his family’s beloved dog Drayton, Percy must find a new ship, reunite with his crew, and discover family secrets that will change his life forever. Oh, and dig for hidden treasure of course.<br />\nBilkins’ Folly is a narrative adventure game about a boy and his dog. Team up with your canine best friend to uncover every nook and cranny of this region. With the help of Percy’s expert cartography skills, you can customize your map to help you solve puzzles and unlock other secrets. But be warned: some puzzles in this world are harder than others, and you might need to return to them later in your journey.<br />\nYour friendship with Drayton will be your biggest asset when navigating through the world of Bilkins’ Folly. By spending quality time together, you can level up your bond and earn points to spend on new skills that can be used to clear obstacles. This will aid you in your search for family and riches and take you to places previously unseen.FeaturesExplore a series of unusual and lively islands riddled with history, mystery, and (most importantly) treasure.<br />\nAs your bond with Drayton grows, he&#39;ll learn new skills that will help you solve puzzles and uncover secrets.<br />\nExpand your ship’s crew by recruiting aspiring sailors to join your ranks.<br />\nSocialize with the many quirky inhabitants of the islands—but keep in mind they’ll remember how you treat them.<br />\nX marks the spot! Customize your map to work for you by drawing lines and placing icons on your map to aid you in your treasure hunting escapades.<br />\nFish for interesting sea creatures and record your findings in your journal.<br />\nEnter treasure hunting competitions to earn trophies and bragging rights.<br />\nPick locks, herd sheep, and more in charming minigames.<br />\nYes, you can pet the dog.</p>", "metacritic": null, "released": "2023-10-02", "tba": false, "updated": "2024-01-01T21:28:41", "background_image": "https://media.rawg.io/media/screenshots/2e8/2e82eac0e9782007193da25a524b4528.jpeg", "website": "https://armorgamesstudios.com/games/bilkins-folly", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 3}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "PlayStation 5"], "developers": ["Webbysoft"], "genres": ["Adventure"], "publishers": ["Armor Games Studios"], "esrb_rating": null}