{"id": 930909, "slug": "zombie-survivors-1", "name": "Zombie Survivors 1", "name_original": "Zombie Survivors 1", "description": "<h3>Introduce</h3>Come and experience the joy of bullet screen games! <br/>Become a zombie hunter! <br/>This is an action pigeon type bullet screen shooting game. In a cartoonish forest, players face waves of zombies and try to survive by defeating them with their weapons.<h3>Game Features</h3>Faced with a variety of zombies, players can shoot zombies with guns, blast them with grenades and oil barrels, and place walls to block zombies and bullets.<br/>In wave after wave of dead tide, trying to survive, win the game.<br/><br/>Players can sprint to avoid zombies and bullets.<br/><br/>The picture of the game cartoon fresh, sound effect beautiful, all kinds of zombie charmingly naive.<br/>The constant presence of zombie bosses adds to the playability.<br/>Defeat the final BOSS and finish the game!<h3>Multielement Weapon</h3>The player starts with a normal single-shot rifle, but automatically changes weapons when picking up other weapons.<br/>There are machine guns, shotguns, fireball guns, laser guns, and the corresponding super machine guns, Super shotguns, super Fireball guns, super laser guns, and so on.<br/><br/>There are hidden weapons waiting to be discovered.<h3>Level Up</h3>Upgrade weapons with a variety of options, including bullet damage, shooting frequency, player movement speed, etc.<br/><br/>When one reaches its full level, a normal weapon evolves into a super weapon.", "metacritic": null, "released": "2023-02-21", "tba": false, "updated": "2023-02-24T04:26:22", "background_image": "https://media.rawg.io/media/screenshots/aba/abafb466b76111b4336ebc9f70efd9b6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["avatar"], "genres": ["Action", "RPG", "Indie"], "publishers": ["avatar"], "esrb_rating": null}