{"id": 93128, "slug": "secret-satiation", "name": "Secret Satiation", "name_original": "Secret Satiation", "description": "A vampire + a new office job = OL Vampire!\r\n<p> *OL for Office Lady</p>\n<p><strong>In a city where a society of vampires secretly live amongst humans, Ada tries her best to keep her vampire identity hidden. Starting at a new job means starting with a clean slate and Ada is determined to keep this job for once. She tries her best to fit in and stay under the radar. That is, until she slowly begins to fall for her human co-worker. With the duty of keeping her vampire identity a secret, will she be able to confess despite the taboo of a vampire being together with a human? Can Ada even be in a relationship hiding such a big secret from a lover?! Read through this kinetic novel made for the 2017 Yuri Game Jam to see if Ada will end up baring her fangs feelings and secrets, or keep them sealed like a nailed shut coffin!</strong></p>\n<p>Team ANPIM is back at it again with your dosage of generic yuri goodness! <br/><br/>This time, half of the team was MIA, but our artist just HAD to take part in this jam because we couldn’t make it for the 2016 Yuri Game Jam :( We started at the beginning of the jam, but ended up giving up half way LOL….. and then decided to pick it back up a week and a half before the deadline, so we made an VN in around a week…… again…... Time seemed to be even tighter this time, but we hope the quality isn't that much of a downfall this time!!<br/></p>\n<p>But most importantly, we hope you enjoy another one of our games and be sure to check out our other ones if you haven't already! :)<br/></p>", "metacritic": null, "released": "2017-11-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6d9/6d9884e7e17fec48bd1de483155dd693.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["TeamANPIM"], "genres": [], "publishers": [], "esrb_rating": null}