{"id": 93142, "slug": "a-date-in-the-park-itch", "name": "A Date in the Park (itch)", "name_original": "A Date in the Park (itch)", "description": "<p><strong><em>A Date in the Park is a short and weird free point and click adventure game, inspired by things like David Lynch and the feeling of oddness in an everyday situation.</em></strong></p><p>It has featured on Rock Paper Shotgun, and won the 2014 AGS Award for Best Short Game.</p><p>A DATE IN THE PARK IS ON STEAM GREENLIGHT - PLEASE VOTE :) http://steamcommunity.com/sharedfiles/filedetails/?id=646036057<br/></p><p><strong>Story:</strong><br/>You are Lou. You've recently moved to Lisbon, in Portugal, to take up a new job and start a new life. Within days of arriving, you meet an enchanting woman, Catarina, at a bar on a night out. After a few hours of connecting, you agree to meet her the next day in her favourite park.</p><p>You arrive at the stunning park on a beautiful sunny day, with high hopes. Lou soon realises the atmosphere is a little off... it's not going to be an average date.</p><p><strong>Features:</strong><br/>- A cast of several characters<br/>- Language confusion - Lou does not speak Portuguese.<br/>- 20+ screens to explore<br/>- A short, narrative experience, with puzzles as well. I think it will take between 30 minutes and an hour to complete. Maybe a bit more, maybe a bit less, depending on the player<br/>- Twists and turns - shocking moments! (there's a horror element to the game)<br/>- 90s style digitised graphics and animated sprites<br/>- 640 x 400 resolution<br/>- Real world location to explore- Tapada das Necessidades in Lisbon, Portugal<br/>- 2 click interface, with inventory etc</p>", "metacritic": null, "released": "2015-03-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1a3/1a32fac094abed32121069626e8a6421.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cloak and Dagger Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}