{"id": 93146, "slug": "school-years", "name": "School Years", "name_original": "School Years", "description": "Controls\r\n<p>Move around, navigate menus</p>\n<ul><li>W/A/S/D</li><li>Directional Pad</li></ul>\n<p>Confirm, Do stuff</p>\n<ul><li>L</li><li>A on Xbox</li><li>X on PS</li><li>B on Nintendo</li></ul>\n<p>Instant Quit</p>\n<ul><li>Escape</li><li>Start</li></ul>\n<p>That's right, no pausing until you finish the game!  </p>\n<p>Also, you're stuck with 1080p, 16:9 aspect ratio.  Don't match that spec?  You'll get letterboxed.  Tough.  Just like school was.<br/></p>\r\nOverview\r\n<p>How did it feel for me to \"grow up\"?</p>\n<p>In my grade school years, life was very much dominated by academia. Get these grades, focus on school, prep for college! Those are the priorities, everything else is secondary! To me, growing up felt like a slew of snap decisions, reflex-reacting to various scenarios, and otherwise not being in full control of my life. To me, it felt like a <em>WarioWare</em> title. Which brings me to <em>School Years</em>!</p>\n<p><em>School Years</em> is a quick-paced, pixelated entry into the first CFN Game Jam, for which the theme was \"growing up\". In it, you can experience a not-exhaustive-at-all synopsis of my grade school years, with gameplay heavily inspired by the <em>WarioWare</em> series. At the end you'll have a tally of wins and losses, the latter of which includes those decisions you let life make for you (namely, when your timer ran out). <br/><br/>Try to take control of school life and make those decisions!</p>\r\nWhy I Made This\r\n<p>My main objective in making this game was to finally complete a project using the Godot game engine. I've been meaning to make a game using the Godot engine ever since hearing/learning about it, with the CFN Game Jam seeming to be a perfect opportunity. It was an absolute treat working with the engine, and 3.0 release definitely deserves the hype. On my blog you'll find a postmortem detailing the process behind <em>School Years'</em> development; click right here to take a look!</p>\r\nHow I Made This\r\n<ul><li><em>School Years</em> was built with Godot engine.</li><li>Player/background sprites, objects, and button frames were provided by the Old School Modern Asset Pack by finalbossblues.</li><li>Kenney's extensive Game Assets packs provided minigame icons, the KenPixel Nova font used throughout, and music loops used during minigames.</li><li>Aseprite was used to edit or otherwise modify the above assets as needed. Any other visual assets were made by me in Aseprite.</li><li>All other sound not provided by the above assets was composed by me, using the CompiFONT sample library in LMMS.</li></ul>\r\nChangelog\r\n<p><strong>v1.0.1</strong></p>\n<ul><li>Changed the second \"dialogue\" minigame in each school to have different music than the \"school choice\" minigames, as intended</li></ul>\n<p><strong>v1.0.0</strong></p>\n<ul><li>Initial release</li></ul>", "metacritic": null, "released": "2017-09-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d3e/d3ea5da8e7c5eaa719751e7238a6762b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["EnMod Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}