{"id": 931424, "slug": "rpg-builder-and-invector-tpc-integration", "name": "RPG Builder and Invector TPC Integration", "name_original": "RPG Builder and Invector TPC Integration", "description": "<p>Required Paid Assets:</p>\n<p>RPG Builder - https://assetstore.unity.com/packages/tools/game-toolkits/rpg-builder-177657</p>\n<p>Invector TPC - https://assetstore.unity.com/packages/tools/game-toolkits/invector-third-person-...</p>\n<p>The integration of Unity RPG Builder and Invector Third Person Controller offers game developers an unparalleled level of customization and control over their RPG game mechanics. By combining the powerful, modular tools of Unity's RPG Builder with the immersive, dynamic animations of Invector's Third Person Controller, developers can create truly unique RPG experiences. With RPG Builder's flexible quest and dialogue systems, developers can create intricate branching narratives that adapt to player choices, while Invector's animation controller allows for smooth, responsive player movement and combat.<br/></p>\n<p>This integration also makes it easy for developers to fine-tune their game's balance and mechanics. With RPG Builder's easy-to-use editor and Invector's intuitive animator, developers can easily adjust character stats, skill trees, and animations to create a game that feels just right. Additionally, the integration allows for easy integration with other Unity assets, making it easy to add custom sound effects, particle effects, and other visual elements to bring the game to life. With the Unity RPG Builder and Invector Third Person Controller integration, game developers can build the RPG game they've always dreamed of with ease and precision.\r\n</p>", "metacritic": null, "released": "2023-02-22", "tba": false, "updated": "2023-02-24T09:29:25", "background_image": "https://media.rawg.io/media/screenshots/e30/e305d9173bdf7b802f98c6e41ac0fbce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["hobbycoder"], "genres": [], "publishers": [], "esrb_rating": null}