{"id": 93151, "slug": "even-the-ocean-itch", "name": "Even the Ocean (itch)", "name_original": "Even the Ocean (itch)", "description": "<p>Join our company's mailing list at https://analgesic.productions/ for news on our new game!</p>\n<p>Even the Ocean is a narrative action platformer about balancing the Light and Dark energies that hold the world together.<br/></p>\n<p>From the creators of Anodyne comes a grand story about Aliph, a lowly power plant technician for Whiteforge City, who finds her world turned upside-down after a routine maintenance trip goes awry. Now, working directly with Whiteforge's Mayor Biggs to face an unknown menace, Aliph must navigate her newfound power and influence to save the city.</p>\n<p>Aliph's journey, environmental issues and the world's fate all hang in the balance of Light and Dark energies.</p>\n<ul><li>Balance your energy bar with Light and Dark energies to overcome diverse obstacles and stabilize the city. </li><li>Meet and talk with new friends, powerful allies, and enigmatic travellers </li><li>Explore the beautiful and strange geography in the overworld, towns, and environments surrounding Whiteforge City </li><li>Super customizable difficulties and play styles: choose between Complete, Story-only, or Gameplay-only options to make your experience your own</li></ul>\n<p>Created by Analgesic Productions LLC - Sean Han Tani and Joni Kittaka.</p>\n<p>Join the Analgesic Productions newsletter and more at https://analgesic.productions/ ! <br/></p>\n<p><strong>Book Report Edition: </strong></p>\n<p>We're proud of the story we're telling through Even the Ocean, and would love to encourage discussion about it and to hear what people think! So for a limited time, we're offering the Itch.io exclusive <strong>Book Report Edition</strong> of Even the Ocean! Simply purchase the game on Itch.io, then email eventheocean@gmail.com from your Itch.io-linked email address with your \"book report\" to receive a FREE bonus Itch.IO key for Even the Ocean. </p>\n<p>A \"book report\" could be any sort of discussion of the plot, themes, characters, or atmosphere of Even the Ocean. Are there lines of dialogue that stuck with you? A musical track that really <em>made</em> a moment? Are there parts of the game that you didn't like or that sent mixed messages? Why? Email us a short message with some thoughts (or email us a link to a blog post where you talk about Even the Ocean), and we'll send back a Steam key so that you can share the experience with a friend!</p>\n<p><strong>OST details:</strong></p>\n<ul><li>For other file formats, purchase at Bandcamp - the OST here is only available in MP3 V0 format. OST is about 520 MB in size.</li></ul>\n<p><strong>Technical Requirements:</strong></p>\n<ul><li>Budget about 500 MB for the game files.</li><li>Even the Ocean will run at a locked 60 FPS on most computers with a GPU. For comparison, development was done with a GeForce 610M . Multiple resolution sizes and a 30 FPS mode are available for lower-performance computers.</li><li>Some Macs have trouble running at high scaling resolutions. In this case, the problem is usually fixed by playing at a lower resolution or in 30 FPS.</li><li>For unknown reasons, livestreaming at certain resolutions at 60 FPS causes lag in the game. I recommend 30 FPS or lowering the resolution of the game.</li><li>For unknown reasons the sound may drop out on Macs at times. This will often fix itself after a few seconds.</li></ul>\n<p><strong>Version History</strong></p>\n<p>- 1.018 for Windows/Mac (11/26/17) - Adds Simplified Chinese, Russian, German.</p>\n<p>- 1.014 for Windows/Mac (1/15/17)</p>\n<p>- 1.013 for Windows (12/22/16)</p>", "metacritic": null, "released": "2016-05-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/506/5067f51858f5d4f085180ae8d2200de8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 372, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Sean Han Tani", "Marina Kittaka"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}