{"id": 931698, "slug": "the-little-cultist", "name": "The Little Cultist", "name_original": "The Little Cultist", "description": "<p><strong>Description:</strong></p>\n<p>You play as a new member of a cult. Your task is to impress the cult by completing what they ask of you, as well as making it out alive. You do not know where the road takes you but you do know that you have a long journey ahead, or should you say... down.</p>\n<p><strong>Controls:</strong></p>\n<p><strong>WASD </strong>to move</p>\n<p><strong>Space </strong>to interact</p>\n<p><strong>Hold Space</strong> to hide</p>\n\n<p><strong>Statement of self-evaluation on the game’s merit:</strong></p>\n<p>I am acutely aware of my lack of skill in both art and programming and so I wanted to be able to complete something within the scope of time I was given. I thought it would be reasonable to have a sort of horror aspect placed upon the original narrative clone through a narrative standpoint of adding both a ghost that follows you and will kill you if it gets close to you, as well as sound and visual design. I changed the characters to  be cult-looking, but having the player have some features that make them different. The idea was to d something within my range, so adding a sort of artifact that the player needed to retrieve made sense within the narrative and also was in the base game. I added that the ghost only spawned when the player took the ring as a sort of narrative idea, and then when players get to the shrine they return the ring, the ghost goes away since it is no longer angry. I think the game is good for what I know I am capable of and for how much time I had.<br/></p>", "metacritic": null, "released": "2023-02-22", "tba": false, "updated": "2023-02-24T11:28:50", "background_image": "https://media.rawg.io/media/screenshots/77d/77d3e1ab805d9d81e559b2f0d703b2e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Rawrku"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}