{"id": 931616, "slug": "the-food-chain-karto", "name": "The Food Chain (Karto)", "name_original": "The Food Chain (Karto)", "description": "<p>A game where you turn into the creature that eats you!</p>\n<p>There are multiple possible endings for each creature, good luck discovering all of them!</p>\n<p>The deadline almost crushed me! Some things are unpolished but hopefully it all works in the final build! This was my first ever game jam, and working alone has been a really big challenge!</p>\n<p>The art was completely done by me!</p>\n\n\n\n\r\nDONT READ FURTHER IF YOU WANT TO AVOID SPOILERS! \r\nList of endings:\r\nFly\r\n<p>Traitor - He was your friend! (Kill the fly under the rock by gnawing)</p>\n<p>Frog Exterminator - Kill all the frogs </p>\n<p>Bully - Poor frog. He was stuck. Shameless. </p>\n<p>Compassionate - You have a kind heart! Wait you have a heart? (rescue the frog at the end)</p>\n<p>Bye! - I guess you dont want to play (go left from fly spawn)</p>\n<p>Fall of death - You’re literally a fly HOW </p>\r\nFrog\r\n<p>Got your back - Leave no one behind! (jump down into the ditch at the end to give the trapped from company!)</p>\n<p>Disease Cleanser - No more pesky flies gnawing away at everything!</p>\n<p>Death by Splatter - Its just suicide, really. (squish yourself at the rock by pulling the small rock with tongue)</p>\n<p>Bye! - I guess you dont want to play (go left from fly spawn)</p>\r\nHound\r\n<p>Ecosystem collapse - Nothing lives - <strong>(This has not been implemented) but is still possible, a fun challenge if you're up to it!</strong></p>\n<p>Self imposed exile - Seriously? Like this? Apex predator who? YOU!? - Leave the ecosystem (go left from fly spawn)</p>\n<p>Royally stupid death - Seriously? Like this? Apex predator who? YOU!? (fall to death right of spawn) </p>\n\n<p>Made for the brackeys 2023.1 GameJam</p>", "metacritic": null, "released": "2023-02-19", "tba": false, "updated": "2023-02-24T10:52:51", "background_image": "https://media.rawg.io/media/screenshots/bb9/bb982d65bc4c0908ad944322ce818843.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Karto"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}