{"id": 93163, "slug": "slam-city-oracles", "name": "Slam City Oracles", "name_original": "Slam City Oracles", "description": "Riot Grrrl Gameplay<br/><p>\r\n\tSlam City Oracles is a rambunctious, riot grrrl, Katamari-meets-Grand Theft Auto physics game, in which you and a friend slam onto the world around you to cause as much chaos as possible in two minutes.\r\n</p><p>\r\n\tWith a rollicking riot grrrl-inspired mechanic designed and programmed by Jane Friedhoff, bright and adorable art by Jenny Jiao Hsia, and an upbeat soundtrack by Brooklyn-based, women-fronted rock band Scully, Slam City Oracles is a gleeful, delightful slam-em-up.\r\n</p><p>\r\n\tSlam City Oracles was commissioned for New York University's 2014 No Quarter.\r\n</p><br/>\r\nPress<ul>\n<li> \"Remember how playing Katamari Damacy felt? [...] One new game shown in New York City last week is sort of like that PS2 classic but with one big difference: you're slamming yourself into the world as hard as you can, over and over.\"- Evan Narcisse, Kotaku</li>\n<li> \"[F]eeling like a bad ass is the side dish and fucking shit up is the main course.\"- Kaira Zenine Villanueva, The Mary Sue</li><li>\"[It] makes you feel like you're part of a girl squad rocking up to clear out all the plaid-shirt beardos[.]\"- Leigh Alexander, Offworld</li>\n<li> \"SCO's sense of play and impact feels like exactly what the teen girl experience in games needed.\"- Jess Joho, Kill Screen</li><li>\"Super Smash Sisters. [...] When you want to smash all the patriarchy and feel thwarted, play this game. You will feel better when your two minutes are up.\"- Ali, Autostraddle</li>\n<li> \"[A]dorable and gleefully fun[.]\"- Michael Rougeau, Animal New York</li>\n</ul>Check out our presskit!<br/>\r\nFeatures<ul>\n<li> Huge world packed full of bright, cute, mischievous art</li>\n<li> Designed exclusively for collaborative local multiplayer play</li>\n<li> Dizzying and delightful physics, chaos, and explosions</li>\n<li> 50 achievements to unlock for extra challenge</li>\n</ul><p>\n<br/>\n</p>Team SCO<p>\r\n\tDesign + Programming by Jane Friedhoff\r\n</p><p>\r\n\tArt by Jenny Jiao Hsia\r\n</p><p>\r\n\tMusic by Scully\r\n</p>", "metacritic": null, "released": "2015-08-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/295/2952bbf6414c91b9f5698398f96955ee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["jane friedhoff"], "genres": ["Action"], "publishers": [], "esrb_rating": null}