{"id": 931854, "slug": "a-dance-for-the-dreaming-dead", "name": "A Dance for the Dreaming Dead", "name_original": "A Dance for the Dreaming Dead", "description": "<p>Survive as long as possible from an onslaught of hundreds hiding in the \r\ndark in this roguelite survival game. Choose to either cast your \r\navailable spells to fight off the hordes or use them to augment your \r\ncurrent spells to builds waves of destruction. From flaming vortexes to \r\ndetonating fairies, use what your have to create unique builds for \r\nsurvival.</p>\n\r\nBeta Release\r\n<p>This beta release represents approximately the amount of content that a player would experience on their first run and the official release is targeted to have meta progression with about four to five times the number of characters and upgrades and two to three times the enemy variety.<br/></p>\r\nFor those Interested\r\n<p>If you enjoyed (or hated) your time playing and want to give criticism, suggestions, or bug reports, then please join the discussion down below. <br/>Your feedback is very helpful and important for DDD to progress. And if you want to see this project improve then please share this demo. <br/>The more people willing to give their feedback down below the more I can build it to be the best it can be. <br/>This is a one man project and can be difficult to balance this and a full time job.  As such, Progress is slower than I would like, but I'm determined to see my little game to released.<br/><br/></p>", "metacritic": null, "released": "2023-02-21", "tba": false, "updated": "2023-02-24T12:36:49", "background_image": "https://media.rawg.io/media/screenshots/e63/e63d18703abc64a395c30853ca7526e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "macOS", "PC"], "developers": ["Robin Tea"], "genres": ["Action"], "publishers": [], "esrb_rating": null}