{"id": 93195, "slug": "the-zipper", "name": "The Zipper", "name_original": "The Zipper", "description": "The Zipper is a difficult, fast-paced puzzle game with a low-res sci-fi theme, made for #LOWREZJAM 2017.\r\n<p>You zip around the inside of a strange technologic world, trying to reach the end as fast as you can. There is no limit on how fast you can go: the speed of your fingers is the only limitation.<br/></p>\n<p>The amount of time and moves you take to get to the end is recorded - your goal is to minimize both.</p>\n<p>There are 25 levels in the game, which were designed to be able to be finished <em>fast</em>, if you've mastered them. But before that, you'll have to stop and look around carefully where to go next. Randomly pressing buttons is punished by death!</p>\r\n\r\nControls\r\n<p>The game supports the keyboard and the gamepad, but you can also click on things or scroll through lists with the mouse if you want.  (Only keyboard controls are displayed in-game, though)</p>\r\nKeyboard\r\nButtonActionArrow keys<br/>ZipEscapePause/BackEnter/SpaceAcceptF11Toggle Fullscreen<br/>\r\nGamepad\r\nButtonActionD-PadZipSTARTPause<br/>AAcceptBBack\r\n\r\nInstall Instructions\r\n<p><strong>Simply extract the zip file and run the executable. </strong>It should work out of the box - the game isn't very graphically demanding, even your laptop can run it.<br/></p>\n<p>On Linux, you might have to mark the file as executable by running <br/></p>\r\n\r\nchmod +x TheZipper\r\n\r\n\r\nKnown bugs\r\n<ul><li>Don't put the zip file in the same folder as the exe or the game will refuse to start (this seems to be a limitation of Godot)</li><li>On Linux, resizing the window shows graphical glitches outside the game's borders. I'd recommend you keep the window size as it is.</li></ul>\r\n\r\nSoundtrack\r\n<p>The game's soundtrack has been released under my musical pseudonym Kenophos. Get it here:</p>\n<p><strong>Made with Godot Engine.</strong></p>", "metacritic": null, "released": "2017-08-16", "tba": false, "updated": "2019-08-28T23:25:57", "background_image": "https://media.rawg.io/media/screenshots/0f7/0f70ebdff4d2ade9509200a1d2fc0345.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["bauxite"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}