{"id": 931944, "slug": "cheb-base-002", "name": "Cheb Base 002", "name_original": "Cheb Base 002", "description": "<p><strong>**Please do not look for loopholes within my rules. If you disagree with them please do not purchase*</strong><strong>*</strong>\n</p>\n<p>By buying this base you've agreed to the following rules:\r\n</p>\n<ul><li>Please let me know if you've bought this base! A simple comment is all I ask, I wouldn't mind keeping track of who has bought it. \r\n</li><li>Under no circumstances are you allowed to post the base by itself unedited and available to the public including .sai, .csp, .psd, etc. What ever reason it is, you may NOT post such files that contain access to the base. \r\n</li><li>You may not distibute, sell or trace this base. - You may not use this base for commissions. \r\n</li><li>Customs, personal, and adoptables are all acceptable uses of the base!\r\n</li><li>You can alter the base as you see fit, but you still can't sell it for yourself no matter how many changes you make.\r\n</li><li> Credit me no matter what! WITH A LINK!\r\n</li><li>Yes you can use this for adoptables/ personal use off site, just remember to credit me still.\r\n</li><li>There will be NO refunds, once bought you have access to the files and it's not fair to request one when you can't 'give them back'. Please respect that.\r\n</li></ul>\n<p>Official Site || Social Media || Ask me anything! || Donate || Discord\r\n</p>", "metacritic": null, "released": "2023-02-21", "tba": false, "updated": "2023-02-24T13:20:38", "background_image": "https://media.rawg.io/media/screenshots/2f2/2f2408b6ba167aac8fefbe8c41741b65.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ShirouKami"], "genres": [], "publishers": [], "esrb_rating": null}