{"id": 932052, "slug": "rhythm-storm-alpha-demo", "name": "Rhythm Storm-Alpha Demo", "name_original": "Rhythm Storm-Alpha Demo", "description": "<p>Rhythm Storm is a roguelike bullet heaven with stunning vector graphics, rhythmic action, and overwhelming swarms of enemies. Your vehicle aims and fires automatically while everything else dances and moves to the beat in this spectacular audio-visual experience.</p>\n\n<p><strong>--GAME OVERVIEW--</strong><br/>Rhythm Storm is a roguelike bullet heaven/horde survivor with heavy rhythmic elements. Your vehicle automatically aims and fires while you control movement and two special abilities. You select a vehicle, set it's initial configuration and abilities, then proceed into the action. As you progress, enemies will drop Upgrade powerups which give two choices at a time to enhance your vehicle. Everything in the world (except you) moves to the beat, and your goal is to survive to the end of the song.</p>\n<p><strong>--VECTOR GRAPHICS, NO TEXTURES--</strong><br/>Rhythm Storm uses only untextured lines and polygons in rendering. There are no textures used in the visuals aside from post-processing effects, which only use captures of the screen as textures. The result is a game that looks unusually crisp and clear, and the more resolution you give it the better it looks, in a way few other games do. For the best experience, it is HIGHLY RECOMMENDED that you play the game on a 1440p (or higher) monitor with a refresh rate of 120hz or higher. [Playing the game at 1080p/60hz is still enjoyable, just less than ideal.]</p>\n\n<p><strong><em>Vector-based rendering means the visuals remain crisp no matter the resolution. Bloom and brightness settings can be adjusted independently.</em><br/></strong></p>\n<p><strong>--RHYTHMIC GAMEPLAY--</strong><br/>Rhythm Storm is a musical game, but it's not a traditional rhythm game. Nothing your vehicle does is synced to the music, but everything else in the world IS synced. So the wave changes happen every 8 bars of music (in most cases), powerups and the world pulse to the beat, the world creates dynamic line, ring, and stepper obstacles to the beat, the UI is jamming to the beat, and--most importantly--all the enemies move and fire projectiles to the beat. They also frequently die to the beat. You can choose to activate your powers and abilities to the beat, and it feels awesome to do that, but it's not required, and no musical talent or beat-synced pressing is required to succeed at the game.<br/><br/><strong>--BULLET HEAVEN/SWARM SURVIVAL--</strong><br/>At its core, Rhythm Storm is similar to other Bullet Heaven/Swarm Survivor/Horde Survivor games in structure. I don't really have a strong opinion on what the genre name should be, though I think Bullet Heaven is most appropriate in Rhythm Storm's case. While the game does follow some of the conventions of this relatively new genre, it also ignores others in favor of features and behavior that fit the game better. XP is granted automatically from destroyed enemies, but they drop Energy instead, which is used for spawning Drones and consumed when you use Powers. Upgrading isn't automatic, but instead requires you to pick up the Upgrade powerup. This makes the interruption in music less jarring, and feels satisfying to do.<br/><br/>Speaking of musical interruptions, one significant feature (briefly shown at the end of the gameplay trailer) is recording and using Encore Upgrades. After a run is over, whether you finished the demo or your vehicle was destroyed, you can save the entire list of Upgrades you chose on that run as an Encore, and use that list automatically in a future run. During the Encore, you won't see the Upgrade screen, but will instead be upgraded automatically (you'll see which upgrades are added). Additionally, you'll see upcoming Encore upgrades on the pause menu. You can also end the Encore at any time from that menu. From that point on (or if you run out of Encore selections), you'll revert to Upgrading manually. While you don't need to use this feature to enjoy the game, using Encore Upgrades is a good way to enhance the performance aspect of the game.<br/><br/><strong>--ALPHA DEMO vs. FULL GAME--</strong><br/>The Alpha Demo for Rhythm Storm is an early (but polished) build of the game intended to build and gauge interest. It contains a solid amount of content, but the full game will have significantly more. The demo includes 1 world and four vehicles, while the full game will include 3+ worlds (played in order, keeping your vehicle/upgrades as you progress) and over a dozen vehicles. The number of abilities, powers, weapons, enemy types, upgrades, and more will all be far greater in the full release than what is seen in the demo. There will also be special boss enemy waves at the end of each world, and the balance of power/difficulty will be slightly different in the full game.<br/><br/>The full game is currently expected to launch in late 2023.</p>", "metacritic": null, "released": "2023-02-21", "tba": false, "updated": "2023-02-24T14:16:48", "background_image": "https://media.rawg.io/media/screenshots/6fd/6fdc639747e92e3d5d4aa4046f25a70f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Radiangames"], "genres": ["Action"], "publishers": [], "esrb_rating": null}