{"id": 93200, "slug": "my-burden-to-keep", "name": "My Burden to Keep", "name_original": "My Burden to Keep", "description": "<p><strong>It is May 3rd, 1941.</strong><br/>Just as the sun peeks over the horizon on that cold spring morning, a harrowing report comes in to the sheriff's department. The mayor has been murdered in his home.</p>\n<p><strong><em>Solve the murder/Clear your father's name. </em></strong>Two wills struggle on separate paths towards the same goal, to find out what really happened. Who killed mayor James Scott?</p>\n<p>Play as detective Francis Dale and as the murder suspect's son Gabriel Heinrich in this short point and click adventure game.  Featuring rich, detailed pixel artwork and animation and an old-school inspired soundtrack, with a few modern design conveniences. (No incessant saving-dying-loading!)</p>\n<p><strong>Features:</strong></p>\n<ul><li>An interactive short story. A bite-sized adventure that you can finish in about 40-60 minutes.</li><li>Rich and detailed pixel artwork and animations.</li><li>Old-school inspired soundtrack.</li><li>A story that follows two perspectives.<ul><li>Interrogate and search for clues and evidence as Francis.</li><li>Find a way to prove your father's innocence as Gabriel.</li></ul></li><li>Simple point-and-click controls.<ul><li>Left mouse button to execute action/choose dialogue option.</li><li>Right mouse button to cycle between verbs (i.e. Walk To, Examine, Interact, Talk to.)</li></ul></li><li>Includes full soundtrack - 12 Tracks, available in WAV, OGG and FLAC formats.</li></ul>\n<p><strong><em>Please note that you must read through and agree to the terms of the EULA, located among the downloads below, before you download and play the game.</em></strong></p>\n<p><strong>For any support inquiries, questions about the game or key requests, email:</strong> marcus@perdiv.com<br/><em>If you're emailing to request a copy of the game for your channel or stream, please tag the subject line with \"Key Request for MBTK.\" Also provide links to the channels where you intend to show the game.</em></p>\n\n<p><strong>Minimum System Requirements</strong></p>\r\nOSWindows 7 or higherProcessor1 GHz or fasterMemory128 MB or moreGraphicsDirectX 9 Compatible, 32-bit colourScreen Resolution640x400 resolution minimumStorage100 MB or moreSound CardDirectSound compatibleControlKeyboard &amp; Mouse required\r\n<p><strong>Content warnings:</strong> Depicts mild violence/blood, single bright flash in one scene.</p>", "metacritic": null, "released": "2018-05-31", "tba": false, "updated": "2019-08-28T23:25:57", "background_image": "https://media.rawg.io/media/screenshots/9b3/9b38660ec6b6a7493e14f8adf9648ae4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Perpetual Diversion"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}