{"id": 932189, "slug": "vaudeville", "name": "Vaudeville", "name_original": "Vaudeville", "description": "<h3>The answer is hidden in plain sight, you just need to ask the right questions.</h3><br/><br/><strong>JOIN THE EARLY ACCESS DISCORD CHANNEL AND HELP IMPROVING VAUDEVILLE</strong> https://discord.gg/2scPgBMkaq<br/><br/>Vaudeville is a groundbreaking, narrative-driven detective game that immerses you in the heart of Europe, in a bustling city renowned for its captivating charm. As the famed private investigator, Detective Martini, use your wit and intuition to uncover the intricate secrets lurking within this city's vibrant streets and shadowy corners.<br/>In Vaudeville, you're thrown into a complex web of murder, deceit, and intrigue. And the innovation doesn't stop there.<br/><br/>Vaudeville uses advanced AI technology to create dialogues in real-time. You can interact with the city's intriguing inhabitants using natural language, either by typing or talking into the microphone. Every conversation, every interaction, is unique to your game, offering an unrivalled level of immersion.<br/><br/>Investigate the brutal murders of three individuals, each with their own harrowing story. As you explore, you'll encounter a diverse cast of characters, each with their own secrets to hide. From the enigmatic lion tamer, Monsieur Saxabar, the beguiling burlesque dancer, Marina H, the secretive widow, Mrs Potter, to the arrogant nobleman, Count Gravesen - everyone is a suspect.<br/><br/>Explore exquisite locales, from the enchanting Cabane Violette, the chaotic Circus Saxabar, the eerily beautiful Gravesen Manor, to the mysterious wilderness of the Blackwoods. Collect clues and engage in gripping dialogues to unveil the truth.<br/><br/>Step into Vaudeville, a world where art and music conceal a tale of murder and deceit.<br/>The truth is just a conversation away. Can you solve the mystery before it's too late?<br/><br/><strong>::: THIS GAME REQUIRES AN INTERNET CONNECTION TO PLAY :::</strong>", "metacritic": null, "released": "2023-02-20", "tba": false, "updated": "2023-07-03T02:55:36", "background_image": "https://media.rawg.io/media/screenshots/2b3/2b33750df060c86bb2224fa15c383d97.jpg", "website": "http://www.bumblebee-studios.se/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bumblebee Studios"], "genres": ["Adventure", "Simulation", "Indie", "Puzzle"], "publishers": ["BBS Games"], "esrb_rating": null}