{"id": 932327, "slug": "the-girl-who-wasnt-there", "name": "The Girl Who Wasn't There", "name_original": "The Girl Who Wasn't There", "description": "<p><em><strong>The Girl Who Wasn't There</strong></em> is a visual novel and the second volume of <em><strong>The Mysteries of Ranko Togawa</strong></em> series.</p>\n<p>It's been a while since Ranko and Astrid solved their first case aboard the Marine Express submarine train and their life seemed to have returned to normal, but things don't always turn out the way one expects. After the arrival of a mysterious new student to her class at the prestigious St. Joachim's Academy, Ranko is faced with a new conundrum when she finds an injured girl in the hallways in the middle of the night. However, once she returns with help, the girl has disappeared. What could have happened to her?</p>\n<p>The two friends begin an investigation to unravel the mystery but, as is often the case, things soon become complicated. Testimonies and rumors will lead them into St. Joachim's darkest secrets, some of which could put their lives in real danger if they are not careful about the decisions they make. Help Ranko follow the right clues and expose the twisted reality that lies beneath the apparent normality of the academy. </p>\n<p><em>Note: The current demo is only a preview in novelized format to show the prologue of the story and is only offered for promotional purposes. Like the first volume, the final version of this game will have an ADV format with the following features:</em></p>\n<p>\n</p>\r\nFEATURES\r\n<p>► A mystery visual novel with decision making that will affect the development of the story - choose where the investigation is headed! <br/>► Six possible routes leading to 20 different endings, some of them good and some... not so much.\r\n<br/>\r\n► Updated retro-style graphics reminiscent of the old Japanese text adventures.\r\n<br/>\r\n► New cast of charismatic characters with humorous dialogues.<br/>\r\n► Texts in English, Spanish, French and Japanese.</p>\n<p><strong>Follow us for development updates and more below!</strong>\n</p>\n<p>Twitter: https://twitter.com/1564Studio/\r\nInstagram: https://www.instagram.com/1564studio/\r\nFacebook: https://www.facebook.com/hitogoroshistudio/\r\n</p>", "metacritic": null, "released": "2023-02-20", "tba": false, "updated": "2023-02-24T16:25:07", "background_image": "https://media.rawg.io/media/screenshots/778/7786d6982440be5aa1caad1760994412.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["1564 Studio"], "genres": [], "publishers": [], "esrb_rating": null}