{"id": 932499, "slug": "stranded-gardens", "name": "Stranded Gardens", "name_original": "Stranded Gardens", "description": "<p>A game about gardening and time manipulation made in Godot 4 for web or desktop. Stranded Garden's incorporates 3D cell shaded stylized art with an isometric view. This game most fits the strategy genre and was made for the MiniJam#126 competition. <br/><br/>Controls:<br/>WASD - Pan Camera<br/>Scroll - Zoom Camera<br/>Left Click - Select seeds and plant seeds<br/>ESC - Pause<br/><br/>Gameplay:<br/>At the beginning of every year you must choose 3 types of seeds. You will be given a random amount of each seed. Some seeds cannot be grown during certain seasons. Time goes by fairly quickly make sure you grow enough food to stay alive, if your food supply hits 0 you die. In the top left side you will see how many parts you need to repair your spacecraft, below that is a button to skip forward to the next season.<br/><br/>Story:<br/>You crash landed on a strange planet and discovered some plants that conveniently grow the parts you need to fix your rocket. Make sure you grow enough food to survive long enough to get off the planet. Thanks to your handy time machine, you have the ability to fast forward time to the next season. However, sometimes the drastic changes in weather cause your time machine malfunction! <br/><br/>Creators:<br/>Levi Leuthold - leutholdlevi@gmail.com<br/>Codey Winslow - codeywinslow@gmail.com<br/>Colin Smith - smithcol253@gmail.com<br/><br/>Additional potato sprite by Michael Remley<br/></p>", "metacritic": null, "released": "2023-02-20", "tba": false, "updated": "2023-02-24T17:46:36", "background_image": "https://media.rawg.io/media/screenshots/153/153e85aefade2358de356eb8a940b033.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["LeviathanLaw"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}