{"id": 93253, "slug": "destiny-fails-us-a-new-life-for-android", "name": "Destiny Fails Us: A New Life for Android", "name_original": "Destiny Fails Us: A New Life for Android", "description": "<p><em>\"Maybe it's time to start a new life...\"</em><br/><br/>The story of Destiny Fails Us takes place in the Pacific Northwest, in the fictional town of Moirai. It follows the life of Idril Ar'Feinel, a girl who spends most of her time playing video games instead of doing her homework.<br/><br/>Idril's grades are slipping, her mom is upset with her, her friends are struggling with their own problems, and she just had her first kiss. On top of that, there's a school dance coming up for Valentine's Day.<br/><br/>Can Idril improve her grades? Will she get a date to the dance? Or will she hang out with her friends instead?<br/></p>\n<p><strong>~ FEATURES ~</strong><br/>200 choice menus<br/>6 Romances &amp; 3 Friendships<br/>Message Idril's friends with her phone<br/>7 Different Endings<br/>Dyslexia Friendly Font Option<br/>CG Gallery with 50+ Event CGs<br/>Music Room with Original Soundtrack<br/>2 Interface Options (\"Pink\" and \"Black &amp; White\")</p>\n\n<p><em><strong>RATING:</strong> This visual novel contains some mild physical violence, mild swearing (with an option to censor those swears), and a brief optional scene where another character smokes marijuana in the vicinity of the main character.</em><br/></p>\n<p>This listing is for the android version of Destiny Fails Us:  A New Life. If you are looking for the PC version, go here.</p>", "metacritic": null, "released": "2018-02-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/884/8844782c41ea1b1a946d20c24cc2a000.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Strawberry Dagger Studio"], "genres": [], "publishers": [], "esrb_rating": null}