{"id": 932552, "slug": "bubbly-tims-time-bubble-trouble", "name": "Bubbly Tim's Time Bubble Trouble", "name_original": "Bubbly Tim's Time Bubble Trouble", "description": "<p>Bubbly Tim's Time Bubble Trouble is a thrilling puzzle platformer game created by cousins Faisal Kubba and Hamza Kubba in 3 days for Mini-Jam 126. In this game, you play as Bubbly Tim, who has gotten himself into trouble by freezing time. Help him escape through 20+ fun puzzles!</p>\n<p>In this game, you will navigate through various levels filled with obstacles and challenges. You must use Bubbly Tim's time bubble to solve puzzles and overcome obstacles. The time bubble can be shot in any direction and can be redirected once, even backwards!) to help you get past tricky obstacles. But be careful, the time bubble can also activate hazards near you, use it wisely!</p>\n<p>Will you be able to help Bubbly Tim escape from his time bubble trouble? Play now and find out!</p>\n<p><strong>Game Instructions and Controls</strong></p>\n<p>Use the A and D keys to move Bubbly Tim left and right. The W key makes Bubbly Tim jump.</p>\n<p>Use the arrow keys to shoot the time bubble in any direction.</p>\n<p>The time bubble can be redirected once by using the arrow keys again. A third use brings the bubble back to Bubbly Tim.</p>\n<p>Use the time bubble to move time and solve puzzles or overcome obstacles.</p>\n<p>Press R to reset the current level, or N to skip the current level and go to the next one.<br/><br/>Use your skills and strategy to help Bubbly Tim escape from his time bubble trouble!</p>", "metacritic": null, "released": "2023-02-20", "tba": false, "updated": "2023-02-24T18:11:49", "background_image": "https://media.rawg.io/media/screenshots/44b/44bb50b07acd423ba4a1c8f48a108ba5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["fdkubba", "perplexgg"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}