{"id": 93251, "slug": "swingstar-vr-itch", "name": "SwingStar VR (itch)", "name_original": "SwingStar VR (itch)", "description": "Swing from anything in VR. Play on HTC Vive.<p>SwingStar is a wacky third-person virtual reality physics puzzler set in a colorful universe. Your goal is to find and swing on a mysterious bell using a giant sticky hand attached to your head.</p>NOTE: This is a demo for the full game. You can download the full game on Steam, Oculus, &amp; Gear VR.<p><strong>A disaster has mutated physics,</strong> you must save your home multiverse by ringing the mysterious bell. A magic helmet allows the player to swing through all of the affected dimensions, and set things right by ringing all the resonator bells. A colossus robot stand between you and the final bell. Explore a colorful cartoon world by swinging through enchanted deserts, bright forests, steep canyons, and many more bizarre and beautiful worlds!</p><p>\r\n\tSwingStar's intuitive controls use only a button and your line of site to soar, flip, swing, fly, and explore in ways you have never experienced in any other video game.\r\n</p><p>\r\n\tFind out what lies beyond the bell\r\n</p>Features:\r\n<ul>\n<li>Explore all 30 levels</li>\n<li>Epic Boss Battle </li>\n<li>Unlock mysterious doors that unlock secret levels</li>\n<li>Wacky power up items change the gameplay. Turbo Yo-yos swing you around, Air Cannons blast you high in the air, and The Grappling Jelly will suck you to it's gooey surface. </li>\n<li>Innovative gameplay let's you swing on any object in the world by looking at it, or by pointing you touch controller at it.</li>\n<li>Dreamy soundtrack by electronic musician Marchthirtyseventh</li>\n<li>Master each level to receive a perfect 3 Star rank!</li>\n<li>Get all 84 stars to unlock the mysterious inter-dimensional zone!</li></ul>", "metacritic": null, "released": "2017-01-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ed8/ed801719640b5f6b31b0db183695d916.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ComputerLunch"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}