{"id": 932647, "slug": "hai-lun-de-shen-ji", "name": "海伦的神迹", "name_original": "海伦的神迹", "description": "Bereaved by the war, the heroine had been into sleep in the ruins of gods for three hundred years. After awakening, she lost her memory in order to save the life of the man who had awakened her from the miracle. But the new life seems not so soomth as expected...<br/>You want to live a warm and busy life with your new friends, or to pursue the truth that made your lose everything three hundred years？<br/>There are variety of characters: loyal guardian, mystery magician, faded gentility, enemy seemed has met before...<br/>As the heroine, you will meet a bunch of people, and some of them are warm, others are cold. Each of them had an untold story. Go to unlock the secrets and tear them down.<br/>If these handsome men cannot satisfy your desire, then you can also choose to be the queen of vengeance. In a word, the fate of the heroine is in your hand...<br/><br/><br/>1.The game focuses on the plot, mixed with the tasks entrusted by the guild and the battle system, with a huge world view and profound intention. Players will play the heroine Elise, can attracted four roles and reach 17 endings. In Helen’s world, you can feel the characters’ tortuous fate and unyielding soul.<br/>2.The author’s writing is delicate and the plot of this game is sincere and moving. Besides that, the characters are vivid and full.<br/>3.The pictures are exquisite, with customized animation for characters and background which is a magnificient visual feast.<br/>4.Players choose different branch can reach different ending, there is a beautiful fairy tale, romantic and warmth stories, and profound moving emotion. The direction of the story is decided by the player. What’s more, each branch is worth to savor.", "metacritic": null, "released": "2023-02-23", "tba": false, "updated": "2023-02-27T03:16:43", "background_image": "https://media.rawg.io/media/screenshots/bc5/bc57debe53d40350203b196966ed7603.jpg", "website": "http://www.66rpg.com/index", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["橙光游戏"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["橙光游戏"], "esrb_rating": null}