{"id": 932643, "slug": "hazard-horizon", "name": "Hazard Horizon", "name_original": "Hazard Horizon", "description": "<strong>Hazard Horizon</strong> is a game in which you have to survive on the space station along with other people. You will be able to play as a human or as their enemy. Gather resources, repair the station, enjoy communication and teamwork with other people. But do not trust everyone, your life is a priority.<h3>GAMEMODES</h3><br/><strong>DEFAULT</strong> - classic mode, fully consistent with the description of the game.<br/><br/><strong>SANDBOX</strong> - mode where you can deal with game mechanics, test everything available in the game, and just hang out with your friends. No goals or limits.<h3>CHARACTERS</h3><br/><strong>HUMAN</strong> - just a person who can walk, run, jump, tackle, and use various items for self-defense. The main task is to repair the station and escape using the shuttle.<br/><br/><strong>UNKNOWN CREATURE</strong> - the main enemy of people. It has 2 types of attacks and has the ability to crawl on any surface. Very durable but not immortal. The main weakness is fire. The main task is to kill all people.<br/><br/><strong>DRONE</strong> - after death, a person leaves a mark on the death site and appears in a special room in the form of a drone. Can fly, use a flashlight and break open doors of any access level. The main task is to fly to the point of death of any person. When touching this point, the drone will turn into a human.<br/><br/><br/>More detailed information about the rules and the purpose of items can be found in the tutorial in the game itself.", "metacritic": null, "released": "2023-02-24", "tba": false, "updated": "2023-02-27T03:13:07", "background_image": "https://media.rawg.io/media/screenshots/2c9/2c9e44cf14bb0359ed44171ba4a8e14a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mykytas Anton"], "genres": ["Action"], "publishers": ["Mykytas Anton"], "esrb_rating": null}