{"id": 932688, "slug": "sex-love-girls", "name": "SEX, LOVE & GIRLS❤️💦", "name_original": "SEX, LOVE & GIRLS❤️💦", "description": "\"SEX, LOVE &amp; GIRLS❤️💦\" is a titillating and seductive adult-only visual novel that delves into the thrilling and erotic world of romantic relationships. You play as the protagonist, who is on a quest to find true love after a wild and crazy night of drinking and swiping on a dating app. With your libido in overdrive, you eagerly accept date offers from a variety of sexy and alluring girls, each with their own unique personalities and desires.<br/><br/><br/><br/>As you navigate through the steamy and passionate world of dating, you must make choices that will determine the course of your relationships. Will you be the charming and suave lover that sweeps your dates off their feet, or will you be the passionate and intense lover that ignites their deepest desires?<br/><br/><h3>Features:</h3><ul><li>A variety of steamy and erotic dating scenarios to explore with multiple endings.<br/></li><li>A diverse cast of seductive and alluring characters with unique personalities and desires.<br/></li><li>Choices and decisions that will impact the course of your relationships and lead you down different paths.<br/></li><li>Stunning graphics and immersive sound effects that will make you feel like you're really there.<br/></li><li>Exciting and erotic mini-games to keep things interesting and engaging.<br/></li><li>Unlockable bonus content and achievements for completionists and those who want to explore every possible outcome.</li></ul>", "metacritic": null, "released": "2023-02-25", "tba": false, "updated": "2024-01-06T10:30:27", "background_image": "https://media.rawg.io/media/screenshots/462/4626761e327c677831f5e707c206a87e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "beaten": 1, "toplay": 1}, "playtime": 1, "achievements_count": 11, "ratings_count": 1, "suggestions_count": 440, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Taboo Tales 💘"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Taboo Tales 💘"], "esrb_rating": null}