{"id": 932648, "slug": "december-1914", "name": "December 1914", "name_original": "December 1914", "description": "A comic-style narrative-oriented game based on the Christmas Eve Truce during World War I.<br/>Players will experience December 1914, playing the role of a soldier who has left his family to fight on the battlefield.<br/>The game is approximately 30 minutes long. 80% of the proceeds will be donated to countries affected by war.<br/><br/><h3>Four interactive mini-games</h3>Experience the life of soldiers on the battlefield through simple games with objectives, including:<br/><ul><li>Killing enemy soldiers</li></ul><ul><li>Delivering supplies past enemy lines </li></ul><ul><li>Firing your weapon to deter the enemy and guard positions</li></ul><ul><li>Executing stubborn captives</li></ul><h3>At night</h3>Soldiers will have the opportunity to rest briefly at night. This is also when they will receive updates on the war, communicate with friends, enjoy simple military rations, smoke, and look at photos of their loved ones.<h3>Sanity value</h3>There is a sanity meter in the game, which will change based on the soldier's actions. For example, killing someone will lower the sanity value. The sanity value may also decrease after completing a mission. When the sanity value is too low, the player's perspective will change, colors will fade, and vision will become distorted. Supplies and thoughts of loved ones at night can restore the soldier's sanity.<h3>Christmas Eve</h3>The Pope proposed a ceasefire for Christmas, but the proposal was rejected by the officials of the warring countries. However, on Christmas Eve, a miracle occurred, starting with a few brave soldiers...<h3>Game Size</h3><ul><li>One ending</li></ul><ul><li>52 illustrations</li></ul>", "metacritic": null, "released": "2023-02-23", "tba": false, "updated": "2023-02-27T03:17:59", "background_image": "https://media.rawg.io/media/screenshots/b07/b075b54a44a1734224a09aa76f07285e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 343, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["莉莉恩工作室"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["莉莉恩工作室"], "esrb_rating": null}