{"id": 932682, "slug": "sun-down", "name": "Sun Down", "name_original": "Sun Down", "description": "<strong>Farm crops, collect pets, catch fish, mine ores and craft turrets to build a thriving farm and survive waves of monsters through four changing seasons! </strong><br/><br/>Play as Darius, recently crowned Demon King of Withergate, or Lucia, Archmage of Sun Haven. Defend your home against hordes of quirky yet dangerous monsters by utilizing an arsenal of ridiculous weapons:<br/><ul><li>Swords, bows, snowball launchers<br/></li><li>Fireballs, magical auras, lightning blasts<br/></li><li>Puppies, dragons, handsome lizard archers<br/></li><li>Stinky egg cannons and piercing carrot ballistas! </li></ul><br/>Upgrade your weapons, pets and farm by gaining skill cards, drawn every time you level up. Grow in strength, make your perfect build and send those monsters packing.<br/><br/>You’ll face lighter waves of enemies during the day, but don’t think that night will offer any peace of mind - because once Sun Down comes, the fighting gets even tougher! Use your daytime hours wisely, or your farm may end up overrun.<br/><br/>Discover a new world set in an alternate timeline of Sun Haven, one where a hero never arrived. Without a hero to save the day, Dynus, the Moon Dragon, has conquered the lands and now it’s up to you to wage a heroic last stand. Complete ridiculous objectives to gain more power, meet and befriend your neighbors and even fall in love and get married! Every little bit helps in the battle against the setting sun.<h3>Features:</h3><br/><ul><li>Play as two characters, Darius or Lucia, fighting to reclaim their lost cities against the might of the Moon Dragon.<br/><br/></li><li>Multiple kinds of weapons and pets, each with their own unique mechanics. Create your own build!<br/></li><li>Utilize the power of puppies and dragons to win your fights.<br/></li><li>200+ different upgrades for your character, pets and weapons. Gather them as you level up!<br/></li><li>Meet, befriend and marry one of two oddly familiar farmer neighbors.<br/></li><li>Collect resources and complete mini-quests to increase your power. <br/></li><li>Customize and upgrade your house and farm defenses.<br/></li><li>Grow and sell crops to earn gold and purchase additional upgrades.</li></ul>", "metacritic": null, "released": "2023-02-24", "tba": false, "updated": "2023-02-27T04:01:42", "background_image": "https://media.rawg.io/media/screenshots/818/818fbf2b32591ab0097961af31804f53.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 260, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pixel Sprout Studios"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Casual", "Indie"], "publishers": ["Pixel Sprout Studios"], "esrb_rating": null}