{"id": 932691, "slug": "limbus-company", "name": "Limbus Company", "name_original": "Limbus Company", "description": "<p>▶ A Combination of Turn-based RPG and Realtime Brawl<br />\nEach turn results in a display of exhilarating action.<br />\nIn the combat phase, units on both sides will act simultaneously.<br />\nDuring the scramble, characters targeting each other may Clash.<br />\nThe outcome of a Clash depends on the strength of their opposing skills and a sprinkle of luck; the winner can shut down the loser&#39;s skill.<br />\nEnsure you use the right skills to win Clashes.<br />\n▶ Single-handed Skirmishing<br />\nConnect skill icons across the grid, and your units will take action according to your commands.<br />\nChaining skills of the same color allows you to deal greater damage.<br />\nUsing simple and practical controls, watch as the Sinners dance to your tempo.<br />\n▶ Create Diverse Strategies with Identities and E.G.O<br />\nForm teams of Identities and equip them with an arsenal of E.G.O that will create powerful synergies.<br />\nYour foes come armed with a variety of Affinity-based attacks and tricky effects.<br />\nIn particular, Abnormalities are formidable foes that may prove to be considerable challenges.<br />\nLearn their behavior and weaknesses, and compose the right team to eventually conquer them.<br />\n▶ Immerse Yourself in the World of Project Moon<br />\nFrom the creators of 《Lobotomy Corporation》 and 《Library of Ruina》,  another tale set in the same, unique world unfolds.<br />\nIn this massive dystopian metropolis, you will embark on a journey to find Golden Boughs with a cast of 12 Sinners.<br />\nEnjoy a gripping story and the series of events that await.<br />\nAll dialogue in the main story comes fully voiced in Korean.<br />\nBest of luck, Dear Manager.</p>", "metacritic": null, "released": "2023-02-26", "tba": false, "updated": "2024-01-07T09:16:48", "background_image": "https://media.rawg.io/media/screenshots/e7d/e7dfda8360574293c8b4dd81d2971f8c.jpg", "website": "https://limbuscompany.kr/", "rating": 3.12, "rating_top": 3, "added_by_status": {"yet": 9, "owned": 140, "beaten": 1, "dropped": 11, "playing": 5}, "playtime": 4, "achievements_count": 0, "ratings_count": 8, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 8, "platforms": ["Android", "iOS", "PC"], "developers": ["ProjectMoon"], "genres": ["Action", "RPG", "Strategy"], "publishers": ["ProjectMoon"], "esrb_rating": "Adults Only"}