{"id": 932644, "slug": "towards-the-unknown", "name": "Towards the Unknown", "name_original": "Towards the Unknown", "description": "In Towards The Unknown, dive into the Rift and discover the various mysteries it holds. But beware, something strange emanates from the depths. From mystical creatures to legendary artefacts, you'll need to be brave and strategic on this expedition. Die, pass the torch to another explorer and head into the unknown.<br/><br/>Enter the Absolute Zero to collect as many resources as possible and discover unique flora and fauna.  <br/><br/><strong>Tactical turn-based combat:</strong> Your strategy is your best weapon to defeat those who await you as you descend into the depths of the Rift. Your character has many artifacts, and it is up to you to use them wisely to overcome adversity and discover as much as possible.<br/><br/><strong>Tetris Inventory:</strong> After each battle, you will earn artifacts that must be stored in your inventory. Be careful and smart to optimize your inventory and gain power.<br/><br/><strong>Choose your path:</strong> Ranged, hand-to-hand or support. Anything goes, so be creative and build your character with the artifacts that best represent you.<br/><br/><strong>Rogue Lite:</strong> Dying is an integral part of the game, so you'll need to learn every move, every enemy attack, but also get familiar with your artefacts in order to always explore deeper and deeper and find out what's down there.", "metacritic": null, "released": "2023-02-23", "tba": false, "updated": "2023-02-27T03:14:03", "background_image": "https://media.rawg.io/media/screenshots/9ef/9ef16a7c9cf2adbe8b3d8ca7cf557840.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TTU Games"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["TTU Games"], "esrb_rating": null}