{"id": 932999, "slug": "boups", "name": "Boups", "name_original": "Boups", "description": "<p>[ But du jeu ]</p>\n<p>Si vous êtes parvenu jusqu'ici, c'est que vous avez été sélectionné pour une importante mission : Se débarrasser de notre plus grand ennemi, Macreye. Il s'agit d'un individu extrêmement puissant qui nous impose sa vision des choses depuis des décennies. Il nous garde sous contrôle grâce à ses énormes mains et son œil quasi omniprésent. Récemment, un de nos espions a réussi à se connecter à son système mais n’est pas parvenu à le détruire. Votre tâche est de vous infiltrer dans le système et de détruire tous les fichiers du système de Macreye sans que celui-ci ne le sache.<br/></p>\n<p>[ Comment jouer ]</p>\n<p>Il y a 3 types de fichiers à cliquer :</p>\n<p>- Dossier: Lorsque vous cliquez dessus, un bouton apparaît. Ce bouton permet de désinstaller le contenu du dossier Cela prend du temps, il faudra parfois arrêter l’exécution pour ne pas se faire remarquer Attention : si vous fermez la fenêtre, le téléchargement sera tout de même en cours</p>\n<p>- Fichier classique : Fonctionne de la même façon que le dossier</p>\n<p>- Terminal : On vous envoi un code secret qu’il faudra saisir</p>\n\n<p>[ Note ]<br/></p>\n<p>Il est possible de lancer plusieurs fichiers à la fois Bon courage soldat</p>", "metacritic": null, "released": "2023-02-26", "tba": false, "updated": "2023-02-27T06:31:09", "background_image": "https://media.rawg.io/media/screenshots/c97/c97bc15c431fbe7ca3cede69037244c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Mylloon"], "genres": [], "publishers": [], "esrb_rating": null}