{"id": 932951, "slug": "them-solo", "name": "Them Solo", "name_original": "Them Solo", "description": "<p><strong>[SYNOPSIS]</strong></p>\n<p>\"Dans un autre coin de l'univers, des contrées par delà le cosmos, une planète verdoyante à la faune et à la flore exceptionnelles prospérait paisiblement. Elle fut nommée Aethernas par ses contemporains, une race humanoïde intelligente, peut-être bien trop pour son hôte, qui comme tout être doué de conscience se laissa emporter par des espérances futiles et une avarice se renforçant de génération en génération. Un astre en apparence idyllique mais entraîné vers un inexorable déclin par son satellite étrange, semblant doué de sa propre volonté et cherchant à fuir son champs gravitationnel, même si cela devait sous-entendre l'annihilation de son attraction, résultant de la folie destructrice qui avait transformé ce havre de paix en désert chaotique.</p>\n<p>Malgré ce présent misérable, les \"humains\" s'accrochent à la vie, se réfugiant dans les profondeurs d'Aethernas, à l'abri de la lumière devenue synonyme de danger, rêvant d'un avenir radieux pour éviter de succomber à la démence.</p>\n<p>Chacun était concerné par ce désastre, mais qu'en est-il de ceux dont les souvenirs ne font plus échos ? Ceux dont l'ambition ne semble jamais avoir été évoquée ? Des coquilles vides, des âmes errantes ne cherchant même plus à comprendre, ni savoir, pouvant prendre toutes formes, même celle d'une pauvre fillette égarée.</p>\n<p>Qui suis-je ? Où suis-je ? Que dois-je faire ? Quel est mon destin ? Tout ça n'est qu'une illusion manichéenne...</p>\n<p>Vous, les vagabonds, vous n'avait qu'une seule règle à suivre. Vous n'avez pas le temps de vous attarder sur vos conflits intérieurs, personne ne vous le permettra.</p>\n<p>Fuyez.</p>\n<p>Combattez.</p>\n<p>Sauvez.</p>\n<p>Tuez.</p>\n<p>Le destin semble n'être qu'un piètre défouloir comparé à l'éternité qui se dresse face à vous.\"</p>\n\n<p><strong>[GAMEPLAY]</strong></p>\n<p>Them Solo\" se présente comme un \"shooter bullet hell\" se basant sur un système de boss rush. L'histoire que vous suivrez dépendra de vos choix durant vos combats. Fuir, mettre K.O. votre ennemi ou l'achever, le destin de votre héroïne se tracera selon vos actions. <br/></p>\n<p>Les boss possèdent différents paternes et différentes statistiques probables. Chaque partie vous offrira un nouveau défi, une nouvelle appréhension, favorisant la rejouabilité afin de vous inciter à explorer les différents scénarios proposés par le jeu.</p>\n<p>Votre héroïne, Mira, peu user d'un arsenal complet mais pourtant peu recommandé entre les mains d'une jeune fille perpétuellement perdue moralement et émotionnellement. Différentes armes à feu, une grande et fidèle tronçonneuse, ainsi que deux pièces porte-bonheurs, le seul vestige qui semble la rattacher à ce qu'elle fut par le passé. Combiner votre équipement avec les mouvements de Mira pour la guider vers l'avenir que vous souhaitez lui offrir.</p>\n<p>Them Solo\" est programmé en Lua à l'aide de l'éditeur ZeroBrane Studio et de l'interpréteur LÖVE 2D.</p>\n\n<p>Téléchargement : [ThemSolo_AlphaPrelude 0.1] (Une version du jeu qui a pour but de vous faire essayer les contrôles, et de tester la stabilité du programme ).</p>", "metacritic": null, "released": "2023-02-26", "tba": false, "updated": "2023-02-27T06:10:48", "background_image": "https://media.rawg.io/media/screenshots/bc6/bc667c0556025e4911c96c5edb12c539.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lee Von Enfield"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}