{"id": 9329, "slug": "the-mansion-a-puzzle-of-rooms", "name": "The Mansion: A Puzzle of Rooms", "name_original": "The Mansion: A Puzzle of Rooms", "description": "After receiving top honors at Indiecade and IGF, the legendary Nintendo DS game is back for mobile and better than ever!<br/><br/>Puzzle your way through each room and lead the curious Anne to find the secret at the center of a toymaker&amp;#39;s beautiful but mysterious mansion! Magic is around every corner, and she can&amp;#39;t escape without your help!<br/><br/>* This game is free to play, but you can choose to pay real money for extra items.<br/><br/>* You can play The Mansion in English, German, French, 日本語, 中文简体, or 中文繁體.<br/><br/>* Compatible with: iPhone 4, iPhone 4S, iPhone 5, iPod Touch (5th Gen), iPad 2, Retina iPad, New iPad, iPad Mini <br/>(iOS 4.3 or higher required) <br/><br/>* This game is singleplayer only. If you wish to delete or reinstall, you can use the Com2us Hub data backup/restoration services in Options to save your data.<br/><br/>FEATURES<br/><br/>Follow Anne on her adventure to find the truth… and escape!<br/><br/>- Unearth the secret hidden at the center of the mansion and escape by solving each unsolvable puzzle!<br/><br/>- Every room is a new puzzle and a new story!<br/><br/>Uncover the many secrets of the Toymaker&amp;#39;s mansion!<br/><br/>- Explore rooms like a storybook and lose yourself in the magic and mystery!<br/><br/>- From the beautiful art and music to the Toymaker&amp;#39;s secrets, every detail of Rooms was painstakingly created to be a thrilling tale from start to finish!<br/><br/>Play with Friends!<br/><br/>- Think you can solve the puzzles faster? Compete with friends for the top score on each puzzle!<br/><br/>- Items and tricks can increase your scores!<br/><br/>Connect with Com2uS! <br/><br/>Follow us on Twitter <br/>twitter.com/Com2uS <br/><br/>Like us on Facebook! <br/>facebook.com/Com2uS <br/><br/>For information on new games and special events, check out http://www.withhive.com!<br/><br/>For questions or customer support, please contact our Customer Support by visiting http://www.withhive.com/help/inquire", "metacritic": null, "released": "2013-10-10", "tba": false, "updated": "2019-10-22T13:59:38", "background_image": "https://media.rawg.io/media/screenshots/add/add17be7e16fa2c553ee731c0c73450a.jpeg", "website": "http://www.withhive.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 249, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Com2uS USA"], "genres": ["Puzzle"], "publishers": ["Com2uS USA"], "esrb_rating": "Everyone 10+"}