{"id": 93305, "slug": "spook-house", "name": "Spook House", "name_original": "Spook House", "description": "<strong>Full game now available!! Check it out below!</strong><p>\n<strong>Follow us on Twitter!</strong>\n</p><p>\n<strong>Check out our website!</strong>\n</p><p>\n<strong><strong>Like us on Facebook!</strong><br/>\n</strong>\n</p><p>\n<strong>Follow our dev blog on Tumblr!</strong>\n</p><p>\n<strong>In Spook House, you play as a reanimated skeleton harvesting the fear of mortals to survive. Place monsters in a haunted house to balance the entertainment and terror of your guests. Earn resources and build your own spooky empire.</strong>\n</p><p>\n</p><ul>\n<li>Play as a spooky skeleton entrepreneur on a quest to regain power!</li>\n<li>Manage your haunted house and spook guests with monsters!</li>\n<li>Build the spookhouse of your dreams (or nightmares) with customizing features!</li>\n<li>Spooky, fun art </li>\n<li>A full original spine-tingling soundtrack</li>\n</ul><p>\r\n\t\r\n\tUnlike the typical tower defense game, your goal isn't to kill everything in sight. You must combine the roles of vindictive spirit and small business owner to provide an entertainingly spooky experience for your guests without going overboard. If you DO accidentally scare your guests too much, they will die of fright, causing your haunted house's reputation to suffer and your flow of mortals to eventually run dry. After all, murdering your customers just isn't a profitable business model.\r\n</p><p>\n<br/>\n</p><p>\r\nBuild your haunted house one room at a time and make it your own. You decide the paths that your guests take; create a small and homey haunted house or a sprawling maze where your guests must spend hours trying to find an escape. The longer your guests are in the house, the more entertained they will be and the higher the tip you will receive.\r\n</p><p>\n</p><p>\r\n\t\r\n\tThroughout the game you will be presented with many opportunities in the form of infernal contracts. Satisfy the conditions of each contract to unlock bigger and more frightening attractions with which to scare your guests. Remember though, not all contract givers are your friends; failing to meet the requirements of a contract within the allotted time can have drastic consequences.\r\n\t\r\n\t<br/>\n</p><p>\r\n\t\r\n\tSpook House already has its main gameplay mechanics implemented (building your house, placing attractions, scaring guests, and so on). Currently, we're working on making new levels, contracts, and attractions to add to your house, as well as a UI overhaul. Also, we're trying to make sure our code withstands intense user punishment. We plan on releasing Spook House in Spring 2017.\r\n</p><p>\n<br/>\r\nCheck these pages out for some mouth-watering development updates:\r\nTwitter: \r\n\thttps://twitter.com/SpookhouseGame <br/>\r\n\tTumblr DevBlog: \r\n\thttps://hiddenpizzagames.tumblr.com/ <br/>\r\n\tYoutube: \r\n\thttps://www.youtube.com/channel/UC8KyqK71H3BwJaO2B...<br/>\r\n\tStudio Website: http://www.hiddenpizzagames.com/\r\n</p><p>\n</p><p>\n<strong>Feedback:</strong><br/>\n</p><p>For comments/questions/bug reports, please send an email to \r\n\t<strong>hiddenpizzadev@gmail.com!</strong>\n</p>", "metacritic": null, "released": "2016-09-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e45/e45ec766a851f9f520404347ffc4b285.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["hiddenpizza"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}