{"id": 933064, "slug": "prototype_sisabus", "name": "Prototype_SISABUS", "name_original": "Prototype_SISABUS", "description": "<p><strong>Prototype_Sisabus</strong> is an exciting new game that showcases the latest advances in machine learning technology. Developed using <strong>Unity </strong>and <strong>ML Agents</strong>, with assets provided by Synty Studios and some input from ChatGPT, this game is a working demonstration of what the future of gaming could look like.</p>\n<p>Once you have selected one of the three current characters, the game will run itself. But don't worry - you can still take control of the vehicle with manual controls. </p>\n<p>Using the arrow keys and space bar, you can steer, brake, and accelerate the vehicle as you explore the game's singular stunning environment. If you ever need to change character or exit the game, simply press Esc or the menu button in the top right corner.\r\n</p>\n\n<p><strong>CONTROLS:</strong></p>\n<ul><li>Arrow keys: steer the vehicle left or right\r\n</li><li>Space bar: accelerate the vehicle\r\n</li><li>Shift: brake or reverse\r\n</li><li>Esc: pause the game and access the menu\r\n</li><li>Mouse: click on the menu buttons to change character or exit the game\r\n</li></ul>\n\n<p>As an unwinnable game, Prototype_Sisabus challenges you to push the limits of your own abilities (<em>mostly how long you can play after going \"hey, neat!\"</em>). But this is just the beginning - stay tuned for future updates, new game modes, and additional agents to be added to the game. With its groundbreaking use of machine learning technology, Prototype_Sisabus is sure to be a game that will keep you coming back for more.\r\n</p>", "metacritic": null, "released": "2023-02-26", "tba": false, "updated": "2023-02-27T06:59:58", "background_image": "https://media.rawg.io/media/screenshots/341/3416476a0a4296e59e0e1d8708fac63f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Boxhead"], "genres": [], "publishers": [], "esrb_rating": null}