{"id": 93317, "slug": "the-deadline-visual-novel-demo", "name": "The Deadline - Visual Novel (Demo)", "name_original": "The Deadline - Visual Novel (Demo)", "description": "<p><strong>NDE\r\nVisual presents the Free Demo of “The Deadline”: a wacky Visual\r\nNovel where the writer... is you!</strong></p>\n<p>\n</p>\n<p>Picture it: you're a\r\nyoung writer who has just finished writing his first novel. Now it's\r\ntime to party, right? Not so fast! You just found out you have to\r\ncompletely rewrite it, and you only have 8 days to do so! Impossible?\r\nNot if you have your own characters by your side - but will you be\r\nable to satisfy their weird demands?</p>\n<p><strong>In “The Deadline,”\r\na Visual Novel developed by NDE Visual, a team of Italian writers,\r\npublishers, and artists</strong>, you will take on\r\nthe role of Ramfis, a wannabe writer in his twenties with a mess of a\r\nlife, and <strong>you'll have the chance (and duty)\r\nto rewrite his novel according to your choices</strong>.\r\nBut to do so, you’ll have to face the judgement... of your\r\nown characters! Are you ready to endure Scott's\r\nannoying blabbering, Dee Dee's terrifying threats, Barry's disgusting\r\njokes, and Elizabeth's witty banter? And in the end, will you be able\r\nto write a novel that pleases everyone?</p>\n<p>\n</p>\n<p><strong>If you ever, at\r\nleast once in your life, thought about writing a novel, \"The\r\nDeadline\" will let you realize your dreams!</strong>\r\nAs Ramfis, you will live through the joys and sorrows, hopes and\r\nfrustrations of a young writer in the grip of his own characters,\r\nsubjected to their tribulations and ambitions.\r\nAnd if you don't\r\ncare much about writing, fear not: with the colorful cast and absurd\r\nsituations into which the poor writer will be dragged, laughter will\r\nnot be scarce!</p>\n<p>\n</p>\n<p><strong>The full version will be available before the end of 2018! In the meantime, you can download the Free Demo</strong> (which\r\nincludes the intro and Day One)</p>", "metacritic": null, "released": "2017-12-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6f1/6f1a4ef72c9313afa12412f0c9c2b171.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 284, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["NDE Visual"], "genres": [], "publishers": [], "esrb_rating": null}