{"id": 933177, "slug": "reinvention-of-the-goddess-nocturne", "name": "Reinvention of the Goddess: Nocturne", "name_original": "Reinvention of the Goddess: Nocturne", "description": "<p>I played <em>Shin Megami Tensei 3: Nocturne</em> for the first time recently. I found the premise interesting, but found myself continually frustrated with how little agency the player was given.</p>\n<p>I made this fangame to explore the paths and choices I would have liked the game to have offered me. It is deliberately small in scale; there is no battle system, and I have no plans to continue the story beyond the first area. However, I hope there is still a lot for players to enjoy.</p>\n<p>This game adapts the very beginning of <em>Nocturne</em>, so I encourage even players unfamiliar with the <em>Shin Megami Tensei</em> series to give it a try.<br/></p>\n<p>The game is still in development. Currently, only the first half of the planned content is complete. Please offer comments and suggestions for what you would like to see in the second half. (Unlike in the original game, you will encounter the main characters in the medical center, so there will be plenty of opportunity for more content.) And if you can, please say what options you picked and why; this is very helpful for understanding what I should focus on!</p>\n\n<p>Credits for third-party assets:</p>\n<p>Title font is Night Traveler by Iconian Fonts<br/>Chancery Cursive by Digital Graphics Labs<br/></p>\n<p><em>This is a non-profit fanwork. Shin Megami Tensei is the property of Atlus. Music is from the SMT3 OST. Images are screenshots of the Shin Megami Tensei III HD Remaster, taken by me.</em><br/></p>", "metacritic": null, "released": "2023-02-26", "tba": false, "updated": "2023-02-27T07:48:46", "background_image": "https://media.rawg.io/media/screenshots/6fe/6fec7c8faea1981223998831fe650549.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["A Friendly Irin"], "genres": [], "publishers": [], "esrb_rating": null}