{"id": 93327, "slug": "condor", "name": "CONDOR (Connor Sherlock)", "name_original": "CONDOR (Connor Sherlock)", "description": "<p>Condor, you are tasked with hacking data nodes throughout NeoQusqo. Just get close enough and our team will do the rest remotely. Proceed to the top of The Spire to complete your assignment. This is important. Other teams are running diversionary acts of cyber-terrorism, so you should not encounter any resistance.<br />\nYou are a valued employee,<br />\nPraying Mantis</p>\n<hr />\n<p>CONTROLS:<br />\n-WSAD to move<br />\n-SPACEBAR to JETPACK.<br />\n-Advanced Controls: WSAD still move you in the air, so point your nose where you want to go. If you look down you will accelerate downwards. If you look upwards and hold down &#39;W&#39; though, you&#39;ll jump twice as high!</p>\n<hr />\n<p>OBJECTIVES:<br />\n-Yellow light-beacons are checkpoints<br />\n-Get to the very top of The Spire to trasmit your signal, and win the game.</p>\n<hr />\n<p>FIELD EQUIPMENT:<br />\n-Stealth Field: you are equiped with a prototype harness that will mask your presence to security fields and sensors as long as you stay above a certain altitude. All electromagnetic radiation is turned into visible-spectrum light.<br />\n-Jetpack: you are equiped with a small, compressed gas jetpack that will allow for greater vertical movement. Care was taken to keep the jetpack&#39;s emissions within the stealth field&#39;s limits, as jetpacks are illegal and would be registered by security sensors. We apologize for the lack of horizontal movement, but we have faith in your abilities.<br />\n-Rocket Boots: Your boots have been fitted with low-powered jets to aid in mid-air flight. You will move in the direction you are looking while in the air as long as you keep moving forward. Be mindful that you can counteract the vertical thrust of your jetpack by looking down while moving. Inversely, you can double your vertical thrust by &quot;running&quot; up while using the jetpack in tandem with the boots. Produces a mild amount of thrust.<br />\n-Bionic Legs: Your bones have been replaced by composite alloy bionics. You cannot be injured by long falls, and you can keep up a running pace indefinately.</p>\n<hr />\n<p>A settlement of 14,000,000 credits will be deposited into your account upon completion. You are a valued employee.</p>", "metacritic": null, "released": "2014-03-12", "tba": false, "updated": "2021-06-30T18:31:42", "background_image": "https://media.rawg.io/media/screenshots/948/94825003e4abd9edaf7bbf766a4486f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Connor Sherlock"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}