{"id": 933552, "slug": "jigsaw-galaxy-cats-edition", "name": "Jigsaw Galaxy: Cats Edition", "name_original": "Jigsaw Galaxy: Cats Edition", "description": "<p>Jigsaw Galaxy: Cats Edition is an addictive, free jigsaw puzzle game for adults on the Google Play Store. With beautiful hand-drawn cats, complete challenging puzzles to improve your brain power and sharpen your logical thinking and memory. Relax and enjoy the calming atmosphere while you play jigsaw puzzles and pass the time. Perfect for all ages, Jigsaw Galaxy: Cats Edition is the perfect way to take a break and improve your mind.\r\n</p>\n<p>Jigsaw Galaxy: Cats Edition is the perfect jigsaw puzzle game for adults who like to challenge themselves. With the ability to choose the difficulty of the puzzle by selecting the number of pieces, you can choose the right fit for your skill level. From photo puzzles to art pictures, our game offers different categories to select from. So, grab your device and dive into the world of Jigsaw Galaxy: Cats Edition!</p>\n<p>Key Features:</p>\n<p>•    With no missing pieces, you can complete every jigsaw HD puzzle without frustration.</p>\n<p>•    Browse through 10 carefully curated categories of cats puzzles and find the perfect one for you.</p>\n<p>•    Choose your own difficulty level with the option to choose how many pieces you want in each puzzle.</p>\n<p>•    Level up as a pro jigsaw puzzler with experience points earned by completing puzzles.</p>\n<p>•    Classic shapes combined with HD graphics make the perfect jigsaw experience.</p>\n<p>•    And best of all, free to play</p>\n<p>Get the best puzzle game by downloading Jigsaw Galaxy: Cats Edition. Purr-fect fun! Challenge yourself and enjoy hours of entertainment.</p>", "metacritic": null, "released": "2023-02-25", "tba": false, "updated": "2023-02-27T10:41:34", "background_image": "https://media.rawg.io/media/screenshots/5a0/5a0b797244d8724ee75cbc34b2e0b07e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["MPreview"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}