{"id": 933614, "slug": "repairing-the-world-factory", "name": "Repairing the World — Factory", "name_original": "Repairing the World — Factory", "description": "<p>Repairing the World consists of two games: Factory and Logistics. The games take place in a post-apocalyptic world, in which basic items must be produced by small manufacturers, playing the Factory game. The materials for these items doesn't appear out of nowhere, though. Players must buy them from suppliers, and the orders are then offered to Logistics players for delivery.</p>\n<p><strong>NOTE: I recommend reading the how-to, as there is no built-in tutorial</strong><br/></p>\n<p><strong>How to play — Factory:<br/></strong></p>\n<p>Use the buttons in the top left to open the Inventory and Deliveries sidebars. To get started, get some scrap. Scrap is unwanted junk that suppliers gladly pay delivery drivers to take away, and so it's a great opportunity for a beginner. Once delivered, accept it from the Deliveries sidebar. Now you can place a scrap box by clicking the scrap icon in the Inventory and placing it. Only one box of each type can be placed at a time. Then process your materials further by building production lines.</p>\n<p>Use the left mouse button to place and right mouse button remove tiles. Keyboard buttons:</p>\n<ul><li>1: Conveyor belt, moves items in the arrow direction</li><li>2: Splitter, splits items evenly in the directions indicated by the arrows that can accept items</li><li>3: Heater, heats ore into metal</li><li>4: Export box, collects up to 100 items of a kind, can be removed to move them to the inventory.</li><li>5: Sieve, filters out ore and plastic from scrap. This should be your first processing machine.</li><li>6: Reshaper, spaghettifies metal into wire</li><li>7: Applicator, takes an item from the side and applies it to the item going through. Recipes include: Apply wire to plastic -&gt; PCB, apply plastic to PCB -&gt; device, apply metal to device -&gt; power tool</li><li>R: Rotate the current tile, rotates counter-clockwise while holding left shift</li></ul>\n<p><strong>The automatically saves when you close it.</strong></p>\n<p>Entry to LÖVE jam 2023 with the theme \"connection\". I was already going to make a multiplayer game so the theme made me have to go for something cooler lol.<br/></p>\n<p>Post-development thoughts: Due to the decision to make two games, time constraints and the overall inability to focus on one game resulted in a lack of polish for both games. I did achieve what I wanted to do, though, which is seamless, asynchronous and asymmetric multiplayer. I also decided to learn procedural generation, mesh creation and sprite batch usage while I was at it, so in theory both games are quite scalable. Everything in both games, excluding UI, the rendering of some tiles in Factory, and all entities in Logistics, is a mesh or sprite batch that is only updated if/when necessary.</p>\n<p>This game got more löve, but I still would've wanted to add a short tutorial and a bit more UI, along with a bridge part. Without that last one, some things can't really be optimized.<br/></p>", "metacritic": null, "released": "2023-02-25", "tba": false, "updated": "2023-02-27T11:11:35", "background_image": "https://media.rawg.io/media/screenshots/fe5/fe5d18b82f83d4759f8e1946da6ee187.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Zakru"], "genres": [], "publishers": [], "esrb_rating": null}