{"id": 933615, "slug": "repairing-the-world-logistics", "name": "Repairing the World — Logistics", "name_original": "Repairing the World — Logistics", "description": "<p>Repairing the World consists of two games: Factory and Logistics. The  games take place in a post-apocalyptic world, in which basic items must  be produced by small manufacturers, playing the Factory game. The  materials for these items doesn't appear out of nowhere, though. Players  must buy them from suppliers, and the orders are then offered to  Logistics players for delivery.</p>\n<p><strong>How to play — Logistics:</strong>\n</p>\n<p>Navigate the menu to select jobs. Jobs have a time limit and a  difficulty that scales with their reward. Upgrade your vehicle and  weapon to keep up with the difficulty.\r\n    </p>\n<p><strong>The automatically saves when you close it.</strong>\n</p>\n<p>Entry to LÖVE jam 2023 with the theme \"connection\". I was already  going to make a multiplayer game so the theme made me have to go for  something cooler lol.\r\n    </p>\n<p>Post-development thoughts: Due to the decision to make two games,  time constraints and the overall inability to focus on one game resulted  in a lack of polish for both games. I did achieve what I wanted to do,  though, which is seamless, asynchronous and asymmetric multiplayer. I  also decided to learn procedural generation, mesh creation and sprite  batch usage while I was at it, so in theory both games are quite  scalable. Everything in both games, excluding UI, the rendering of some  tiles in Factory, and all entities in Logistics, is a mesh or sprite  batch that is only updated if/when necessary. <br/></p>\n<p>This game in particular was less mechanically demanding, so I left it with less attention, which is very noticeable.<br/></p>", "metacritic": null, "released": "2023-02-25", "tba": false, "updated": "2023-02-27T11:11:59", "background_image": "https://media.rawg.io/media/screenshots/eb9/eb99e9d8873d82d7c668fb04549d4b67.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Zakru"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}