{"id": 933612, "slug": "heater-kicker", "name": "Heater Kicker", "name_original": "Heater Kicker", "description": "<p><strong>Click! Upgrade! Fight!</strong> You have a big responsibility, and that is the very large <strong>threat of radiators</strong>, which have recently started <strong>rising up</strong>. Start out in a room with <strong>nothing</strong> but a <strong>Heater</strong> in it, and <strong>kick your way</strong> to the <strong>end game boss!</strong> The fate of the world is in <strong>your hands.</strong></p>\n\n\n<ul><li> Clicker Room</li><li>Upgrade Shop with many useful and fun items</li><li>Boss Room with progress bar</li><li>Final Boss</li><li>Unique Tower-Defense-like Boss Fight</li><li>Winning and Losing</li><li>Achievements</li><li>Easter Eggs</li><li>Full Guide in every tab</li></ul>\n\n\n<p>The <strong>main goa</strong>l is to <strong>Kick the Heater</strong>, which gives you <strong>points.</strong> You can spend these points in <strong>Raidy's Shop</strong> to buy <strong>Upgrades</strong> which can help a LOT when <strong>clicking</strong>. Once you've gained enough points, you can stop by<strong> Major's Base</strong> and summon <strong>Heatlord</strong> - the game's <strong>Final Boss</strong>. You can also unlock <strong>Achievements</strong> throughout the game, which are very fun and mysterious to unlock, as you <strong>aren't told how to unlock them before you actually acomplish them.</strong></p>\n\n\n\n<p>Once you gain enough <strong>points</strong>, you can buy <strong>Upgrades in Raidy's Shop</strong>. These include <strong>Multipliers</strong> and an<strong> AutoClicker</strong>. Multipliers multiply the <strong>amount</strong> of <strong>points</strong> you get with <strong>one click</strong>. These help a lot with<strong> gaining points </strong>and speed up the process of gaining them <strong>quite significantly</strong>. You can also spend <strong>points</strong> on <strong>Cosmetic Items</strong>, which can<strong> spice up</strong> the look of your game and<strong> refresh your experience.</strong></p>\n\n\n\n<p>Upon reaching a <strong>sufficient amount of points</strong>, you can visit<strong> Major's Base </strong>and summon <strong>Heatlord</strong> - the end game <strong>boss</strong> and fight him in a unique <strong>Tower-Defense-like Boss Fight</strong>. You'll need to<strong> strategise</strong> wheter to spend <strong>money</strong> to attack him, or spend money to build new <strong>Upgrade Buildings</strong> or to simply <strong>repair your Defenses</strong>. There's multiple <strong>playstyles</strong> you can take to beat <strong>Heatlord</strong>, but I recommend to<strong> buy all the upgrades for an Ultimate Experience.</strong></p>\n\n<p>I won't spoil what the rest of the<strong> Fight </strong>or <strong>Heatlord</strong> looks like, it's up to <strong>you</strong> to find out yourself. Well? What are you waiting for? Jump right into it!</p>\n\n<p>* This was a short project that I've worked on over the course of three weeks. I'd love to keep adding new content and updates, so if you find yourself enjoying this, please leave some feedback and share this game with your friends. I highly appreciate it. If you find any bugs, balancing issues or anything else, be sure to let me know!<br/></p><p>Disclaimer! Progress saving has yet to be implemented, be sure to finish the game in one sitting. Quitting the game will result in loss of progression. Saving will be added in the next patch, which will come out soon.</p>", "metacritic": null, "released": "2023-02-25", "tba": false, "updated": "2023-02-27T11:10:42", "background_image": "https://media.rawg.io/media/screenshots/72e/72e5ec2fa7b880dffaf6095703fea301.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["ChorcheKork"], "genres": [], "publishers": [], "esrb_rating": null}