{"id": 93375, "slug": "sol705-itch", "name": "Sol705 (itch)", "name_original": "Sol705 (itch)", "description": "Please support Sol705 on Kickstarter only 3 days left https://kck.st/2LHsQ5e!\r\n\n<p>TheKICKSTARTER campaign is almost over ! We have reached almost a 90% and <strong>there´s only 3 days left now to get that precious 100%  </strong>Please support us to keep this game rocking!! Thank you so much!!</p>\n\n<p>Join this hilarious point and click graphic adventure lead by a group of bizarre friends seeking to avoid their school failures by spending their free time at their own secret research club: Sol705<br/></p>\r\nHistory\r\n<p>This winter’s holiday is an unique opportunity to solve a new mystery on Tucana Lake, a vicious decadent town where everything can happen! Be part of doubtful investigations based upon abandoned records on paranormal phenomena but more important, help the boys to face the toughest and exciting challenge of them all: making contact with those fabled creatures…classmate members of the opposite sex!</p>\r\nFeatures\r\n<ul><li>2D graphics with animations of great quality with the pixel-toon style. </li><li>Exquisite hand-drawn backgrounds and dozen of ultra weird characters.</li><li>Fully dubbed to English with subtitles in french, spanish, russian and german! </li><li>An original soundtrack that goes from punk to the most awkward symphonic rock from the 70’s.</li><li>Super funny puzzles and amazing stuff to collect and use: old vhs, narcoleptic yoyos, stuffed moles, time continuum chocolate candy and much more!.</li></ul>\n<p>For more info please visit our page at  www.sol705.com <br/></p>", "metacritic": null, "released": "2017-10-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d75/d75ccb5fbac2729024e7841bc7c8bac2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 281, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Patoland"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}