{"id": 93413, "slug": "midnight-ultra-itch", "name": "MIDNIGHT ULTRA (itch)", "name_original": "MIDNIGHT ULTRA (itch)", "description": "<p>In the American Southwest, a lone witch hunter travels across the desert, seeking to wipe out cultists of all sorts. Fight a variety of goons and ghouls, through small towns to dimension-spanning motels. Inspired by DOOM, Quake, and action games of yore, blast your way through a neon-dripped, pixelated nightmare in this high-speed, high-thrills FPS.<br/></p>\n<ul><li><strong>No recharging shields:</strong> you'll need to play smart or find healthpacks to stay alive. You're not invincible, after all.\r\n</li><li><strong>Wild Weird West:</strong> features an acidic western soundtrack, composed just for Midnight Ultra!\r\n</li><li><strong>Choose a melee weapon and a ranged weapon of your choice:</strong> mix and match, choose between chopping and blasting your enemies down to size.\r\n</li><li><strong>Change how the game looks to fit your taste:</strong> unlockable color palettes change how Midnight Ultra looks entirely. BONUS: Halloween color palette unlocked at start\r\n</li><li><strong>Double jump and dodge your enemies:</strong> your fast and nimble feet will let you leap across levels, over enemies heads, and between platforms.\r\n</li><li><strong>Moody and surreal story:</strong> not everything is at it seems, and the physical trappings of reality aren't always guaranteed...\r\n</li><li><strong>Short and sweet:</strong> 2-3 hours of gameplay content, for busy players looking for quick fun.</li></ul>\r\nCOMING APRIL 25TH: The Devil's Path Update\r\n<p>Journey to the Catskill mountains, home to a meteor impact crater and the Devil's Path. After the events of Midnight Ultra's main story, you've biked your way across the country to unravel the last secrets guarded here...<br/><br/>This FREE update adds several sorely needed improvements, and a helping of new content!\r\n</p>\n<ul><li>2 new weapons\r\n</li><li>6 new enemies\r\n</li><li>3 new maps\r\n</li><li>A brand-new, two-part boss battle\r\n</li><li>6 new songs\r\n</li><li>10+ new themes\r\n</li><li>Reworked audio for all weapons\r\n</li><li>Reworked melee attacks\r\n</li><li>Mac and Linux support\r\n</li><li>Mouse inversion, sensitivity, and audio options</li></ul>", "metacritic": null, "released": "2017-11-02", "tba": false, "updated": "2019-08-28T23:25:56", "background_image": "https://media.rawg.io/media/screenshots/c33/c3331cd075163d8b6fe19d85057a1d43.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Forward Instinct"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}