{"id": 934233, "slug": "the-relation-ship", "name": "The Relation-'Ship'", "name_original": "The Relation-'Ship'", "description": "<p><strong>In this cooperative game you each do kind things for the other player so this game is best played with two people otherwise its really hard to play by yourself!</strong><br/></p>\n<p>Your kindness is rewarded by lowering the water levels of <br/>the ocean (which is also good for the environment!). Unfortunately, as your relationship gets more deep and meaningful, the commitment also increases, and it becomes harder and harder to stay afloat. See how long you can last by working together.</p>\n<p>Test the buoyancy of your relationship!</p>\n<p>You are given tasks at random. When the prompt comes up, press the interact button (space bar / right shift)  to initiate a task. For clarification on how to do a task, hit escape to view the instructions in the pause menu. If you pick up something by accident you can put it in the finished box to get rid of it.<br/></p>\n<p>Once a task is fully completed, it will be reset. After this you will be given a new random task</p>\n<p>Leaks can appear at random throughout your hull. You must retrieve wood planks from the top level of the ship to</p>\n<p>Fix these holes, otherwise the ship will start sinking even faster. Once the water reaches the top deck, you may or may not be completely screwed :) Try and see how long you can survive for and post your time in the comments.<br/></p>\n<p>We hope you enjoy our game.</p>\n<p><strong>- Ashton &amp; Ethan</strong></p>", "metacritic": null, "released": "2023-02-24", "tba": false, "updated": "2023-02-27T16:06:10", "background_image": "https://media.rawg.io/media/screenshots/2fe/2fe81ff9e988aa69332672a242b7e39e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ashton video game", "Ethan D"], "genres": [], "publishers": [], "esrb_rating": null}