{"id": 93424, "slug": "brane", "name": "Brane", "name_original": "Brane", "description": "Don't have the Unity Web Player? Don't worry! Scroll down to download the standalone version (Win/Mac/Linux).\r\n<p>\n<em>Are you completely clueless about what is going on? (Even after the tutorial?)  Watch this great explanation by Marc ten Bosch about playing in 4D.</em><br/>\n</p><p>\n<strong>Brane</strong> is a mobile/web/pc puzzle game set in a four dimensional world. The player can switch one of the usual dimensions with the fourth dimension to navigate a 4D puzzle.\r\n</p><p>\r\n\tIt was inspired by the beautiful, long-awaited \r\n\tMiegakure by Marc ten Bosch, and can in fact be thought as a free alternative or at least an homage to this game.\r\n</p>Videos<p>\r\n\tjumpsplat120's let's play\r\n</p>Gameplay<p>\r\n\tBrane is set in a real 4D environment. You only see and move in 3 of them at a time; however, you have the power to swap one of the dimensions you can see with the hidden fourth dimension. Once the new dimension is visible, you can just walk along it normally.\r\n</p><p>\r\n\tAs the fourth dimension is rotated into view, objects seem to distort, disappear, rotate. Really, it's just your perspective that's changing. The 4D world and the 4D objects in it are pretty much static, but the hyperplane in which you live rotates around your position and slices the objects in different and new ways. The 3D sections of objects are what you end up seeing.<br/>\n</p>Development<br/>\n<p>\r\n\tThe game is currently in early development. Please report any bugs \r\n\tin this subreddit.\r\n</p><p>\n<strong>Alpha 0.6 - Current Features:</strong>\n</p><ul>\n<li>12 levels</li>\n<li>Walk in a minimalistic 4-dimensional world, with hypercubes and hyperspheres</li>\n<li>Push blocks in the four dimensions.</li>\n<li>4D LASERS.</li>\n<li>Kill yourself with a comfortable one-button motion</li>\n<li>Find shiny things</li>\n</ul><p>\n<strong>Future Features:</strong>\n</p><ul>\n<li>A standard 100 levels set</li>\n<li>More puzzle elements</li>\n<li>A \"par\" system where you can try to solve a level in the least possible number of switches</li>\n<li>Level editor and transparent level format</li>\n<li>Open source (maybe, depending on feedback)</li>\n</ul><p>\r\n\tThe game in the browser and pc standalone  \r\n\t<strong>will always be free</strong>, or pay-what-you-want. (But donations will always be accepted). Your donations keep the project moving forward and my spirit high, so a pan-dimensional thank you to those who donated. There might be some surprises for you in the future.\r\n</p><p>\r\n\tThe android version is paid, just 1$ for now since we're in development. It's not yet on the app store, you can buy the .apk here for now.\r\n\t<br/>\n</p><p>\r\n\tI am now officially developing this game. \r\n\t<strong>If you want to receive updates, please join</strong> /r/Brane. I'll take it as a hint you're interested.\r\n</p>", "metacritic": null, "released": "2015-08-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/dfb/dfbdda895a1b56dc6b1060292a1953f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["rantonels"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}