{"id": 93422, "slug": "the-free-ones-demo", "name": "The Free Ones (Demo)", "name_original": "The Free Ones (Demo)", "description": "<p><strong>Beta Demo of \"The Free Ones\"<br/></strong></p>\n<p><strong>Steam page<br/></strong><br/><br/></p>\n<p>Follow Theo's dizzying adventure in first-person platformer \"The Free Ones\". Soar through the air with your grapple, blaze a trail through the canyons and take part in an extraordinary story.<br/></p>\r\nA story with a twist\r\n<p>Play the role of prisoner Theo as one day he manages to escape from the slave mines using a grapple system, before meeting Lana and a group of refugees, who let you in on their plan to leave the island. You accept, but nothing could prepare you for what you will encounter along the way.<br/></p>\r\nA unique grapple system\r\n<p>The unique grapple system featured in \"The Free Ones\" allows you to take to the skies as you make your way through the levels. Use your momentum to swing through the air and cover considerable distances at dizzying heights. Wooden surfaces are your best ally. Learn how to turn your surroundings to your advantage and use your wits to progress further in the game.<br/></p>\r\nA man-made island\r\n<p>The mines represent an original and varied playground. Scale the wooden structures. Use the moving crates and carts to make your way through the levels. Climb onto the roof of the hurtling trains. Swing across waterfalls and clamber onto anything that floats as you head down the rivers.</p>", "metacritic": null, "released": "2018-05-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/db5/db5a371e88a469d577bc10dfb77ce717.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Farsky Interactive"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}