{"id": 93423, "slug": "charlatans", "name": "Charlatans", "name_original": "Charlatans", "description": "<p>\tAfter the death of her father, Karon is now one of the richest women in the country. But she can't handle the grief of losing her beloved one. She spends her days going to plebeian shows trying to dissipate her mind and to avoid the several marriage proposals of hungry of money men. One of the shows happens to be run by Sabine, a man that says he can speak with the dead. Karon decides to take part of the show when she is asked to, but quickly gets fed up with it. On her way down the stage, she meets Priam, Sabine's twin sister. As Priam demonstrates to be way more competent than her brother, she takes advantage of Karon's curiosity of what lies beyond the death by secretly making her the test subject of each experiment she performs.</p>\n<p><strong>Charlatans</strong> is a short kinetic novel done for NaNoRenO 2015.</p>\n<p> <strong><strong>♦</strong>CHARACTERS<strong>♦</strong> </strong>\n</p>\n<p><strong>Our protagonist.</strong> She got a very sharp tongue and it's on the verge of hating men(Although there is just one man she won't hate)<br/></p>\n<p>Offers to help Priam on her experiments.<br/></p>\n<p>A kinda quirky woman that wears men clothing just because she likes to call attention(But it seems it does otherwise...)<br/></p>\n<p>Is stuck with her good for nothing twin brother Sabine; she doesn't think twice to debunk his show. She is fixated with the thoughts of what lies beyond the death.<br/></p>\n\n<p>Priam's twin brother.<br/></p>\n<p>He is said to speak with the dead, but we all know this game is called Charlatans.<br/></p>\n<p>The show's janitor. Is in love with Priam, but she won't look at him like that because he is poor.<br/></p>\n<p><strong> ♦ TRANSLATIONS♦ </strong><br/></p>\n<p><strong> Russian  </strong>(Thanks to Pamplemousse  )</p>\n<p><strong><strong>♦</strong>EXTRAS<strong>♦</strong> </strong></p>\n<p>LSF thread</p>\n<p>Dev. blog for Charlatans(Contains spoilers)<br/></p>\n<p>VNDB page </p>\n<p>Favorite character poll</p>\n<p>Fanworks and extra artwork(Contains spoilers)</p>\n<p>Store</p>\n<p>Please, tag anything related to the game as \"Charlatans(evn)\"</p>\n<p>Thank you :D</p>\n<p><strong><strong>♦</strong>NEWS<strong>♦</strong></strong></p><p><strong>07/11/2017&gt;</strong> I made a tiny Halloween themed game about my incorrigiblecharlatans <strong>here.</strong></p>\n<p><strong>Development of the extra chapters on hold until Infurubia is done! I estimate(If nothing unfortunate happens) Will resume it next year(2018)</strong></p>", "metacritic": null, "released": "2015-04-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/064/064c9305d430a9b0484ab1d64583aca3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Chegovia"], "genres": [], "publishers": [], "esrb_rating": null}