{"id": 934371, "slug": "orphan-tome-rush-to-release", "name": "Orphan Tome: Rush to Release", "name_original": "Orphan Tome: Rush to Release", "description": "<p>Orphan Tome: Rush to Release is a large scale indie game made by a team of 4 core developers and a ton of external artists and contributors, most of us being college students looking for a job in the industry.<br/></p>\n<p>Play as a ghost hunter as you discover, explore and get trapped in a haunted abandoned orphanage. Follow the clues and written notes scattered around to solve puzzles and decipher locks. Keep track of all your discoveries in a journal as you uncover the past of this establishment. As the spiritual presence grows with every moment, you may find yourself face to face with a friendly spirit... or the demon that led this place to ruin.</p>\n<p>With every attempt to escape the purgatory, you may gain abilities to help your progress, shortening the time you can take. Finding the shortest route to freedom will be your top priority with every unlocked door and new discovery.</p>\n<p>This game is a long, immersive and progressive experience. The more you play, the more will be revealed to you, but it may take some time.</p>\n<p>Please make sure to let us know if you discover any unintentional bugs, errors, mistakes or oversights. We would be glad to make the game as polished as possible!</p>\n<p>CONTROLS<br/>WASD - Move<br/>Mouse - Camera<br/>Left Click - Interact<br/>Right Click - Toggle Flashlight<br/>Scroll - Flashlight Intensity<br/>Shift - Sprint<br/>Control or C - Crouch<br/>E - Quick Journal<br/>TAB - Journal Menu<br/>Escape - Pause</p>\n<p>Estimated Play Time - 3:30 Hours</p>\n<p>Some performance issues may occur, make sure to adjust the settings accordingly.</p>\n<p>Made with Unreal Engine 5.0.3</p>", "metacritic": null, "released": "2023-02-19", "tba": false, "updated": "2023-02-27T17:10:54", "background_image": "https://media.rawg.io/media/screenshots/053/053f7c7fde73371d2f3151a9c6e424af.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 353, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Time Moth Games", "Gaetano96"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}