{"id": 934358, "slug": "sandbox-2-2", "name": "Sandbox 2", "name_original": "Sandbox 2", "description": "<p>Please report any bugs in discussion or on my discord server Or message me directly<br/>https://discord.gg/u3dPtYwdG8<br/><br/>Sandbox 2 Is the newest Sandbox Game by Mefi, Taking on what slime box was and improving on it drastically with better code and improved game feel.<br/></p>\n<p>Whats different? I'm going to be able do a LOT more content updates for this game, the first game was my VERY FIRST game I've ever made thus the code base is incredibly sloppy and I've done everything for this game from the ground up with some help on conceptualizing and ideas from some very close friends of mine that I thankfully still talk with and love hearing from (You know who you are, Banjo, Lance, And Pancake, Thank you guys for sticking around and being there for me)<br/></p>\n<p>I plan to release this game on steam at some point so every donation helps, I've never got one before but if it does tell me who donates to me or If you have by the time this game comes to steam I'm more then happy to toss a key over, I'll leave old builds of this game up for free still but once it goes to steam I'll be updating it there. So only old builds of the game will be up for you to get access to for free or donate if you really feel like it, That's father into the future though because as I write this I only have a very early but GREAT start (Or at least to me, Once again this is a much better build of the first game and for once, a game I'VE made by myself, didn't ever think i would get here but now I'm a real game dev, yay!)<br/></p>", "metacritic": null, "released": "2023-02-22", "tba": false, "updated": "2023-02-27T17:04:58", "background_image": "https://media.rawg.io/media/screenshots/e9a/e9a065d93a56d95be10835954fdd1944.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mefi"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}