{"id": 934490, "slug": "vincents-horror-story", "name": "Vincent's Horror Story", "name_original": "Vincent's Horror Story", "description": "In <strong>VINCENT'S HORROR STORY</strong>, players are placed in a haunting and surreal environment filled with terrifying creatures and puzzles. The player must navigate through each level, using their wits and problem-solving skills to find the way out and overcome obstacles. <br/><br/>The graphics are realistically dark and eerie, helping to create a truly immersive experience. <br/><br/>The game is a linear horror experience, with each level offering unique challenges and obstacles to overcome. Players must face their fears and confront the monsters that lurk in the shadows in order to reach the end of Vincent's journey and uncover the truth about his subconscious.<br/><br/>In this game, the player must rely on their instincts, quick thinking, and resourcefulness to survive. With each level offering different challenges, the player will be constantly on edge, never knowing what horrors may be waiting around the next corner. <br/>The game is designed to create a tense and frightening atmosphere, making it a must-play for fans of horror games. Whether it's solving puzzles, avoiding traps, or escaping from monsters, <strong>Vincent's Horror Story</strong> will test the player's courage and determination. <br/><br/><br/><br/><strong>So, if you're looking for an adrenaline-fueled and truly frightening gaming experience, give Vincent's Horror Story a try.</strong><br/><br/>", "metacritic": null, "released": "2023-02-27", "tba": false, "updated": "2023-03-03T03:52:53", "background_image": "https://media.rawg.io/media/screenshots/d52/d529f809ed23190fbef6cb1bd52b23e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vladislav Borovic"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Vladislav Borovic"], "esrb_rating": null}