{"id": 934501, "slug": "voltaire-the-vegan-vampire", "name": "Voltaire: The Vegan Vampire", "name_original": "Voltaire: The Vegan Vampire", "description": "Voltaire: The Vegan Vampire is an action-farming-roguelite set in Transylvania, the homeland of Dracula and his rebellious lastborn son, Voltaire. An epiphany results in a change of heart for the young vampire: abandoning blood in favor of a plant-based diet out of spite to prove to his father that neck-biting is not the only way for vampires to thrive.<br/><br/>The Elder Vampire doesn't take kindly to such ideas, but with the help of uncle(s) Frank and Stein, Voltaire slips away from his father’s gaze. Once on his own, he embarks on a creepy, cute odyssey full of veggie recipes, a plant-based lifestyle, and hand-drawn art celebrating the gloriously macabre!<br/><br/><br/><br/><ul><li> Farm during the day with magical seeds to cultivate crops and provide Voltaire with sweet nourishment in his quest to become the world's first vegan vampire!<br/></li><li> Expand the farm and territory and conquer numerous biomes on Voltaire’s path to chlorophyll-based power.<br/></li><li> Be wary once night begins to fall. Dracula will send his minions to ruin Voltaire’s crops and make him return to a “proper,” red-blooded diet.</li></ul><br/><br/><br/><ul><li> Defend the crops against Dracula’s army of ghoulish minions, hell-bent on denying Voltaire his hard-earned oatmeal shake.<br/></li><li> Embrace vampiric dark powers to defeat the bosses sent by Dracula when his lesser minions fail.<br/></li><li> Overcome Dracula’s power and inherit his reign through much greener means.</li></ul><br/><br/><ul><li> Evolve Voltaire into higher vampiric forms thanks to his dietary plan filled with many new abilities.<br/></li><li> Complete bounties for uncle(s) Frank and Stein, while defeating Transylvania's mythical creatures and reap the rewards to continue sowing.<br/></li><li> Prevail over every metaphorical pickle Voltaire may find himself in or risk the temptation of his bloodlust munching on a neck or two.</li><li> Don't sweat it. There is always a chance to try dieting again, this time with new knowledge and abilities!</li></ul>", "metacritic": null, "released": "2023-02-26", "tba": false, "updated": "2023-05-06T22:12:44", "background_image": "https://media.rawg.io/media/screenshots/b60/b606e5e879da7de5fbed40b33f6a0c87.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "toplay": 7, "dropped": 1}, "playtime": 1, "achievements_count": 29, "ratings_count": 2, "suggestions_count": 378, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Digitality Games"], "genres": ["Action", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["Freedom Games"], "esrb_rating": null}