{"id": 934542, "slug": "cockroach-simulator-household-survivor", "name": "Cockroach Simulator household survivor", "name_original": "Cockroach Simulator household survivor", "description": "This is not the adventure to the wonderland.<br/>Neither not the role playing as the superhero or protagonist on the viral television programs.<br/>If you are looking something new, such as role playing as a creature even you are scary of, we are proudly introducing you a Cockroach Simulator!<br/>The simulator game that letting you survive in the dirty house of huntsman as a cockroach.<br/>Enjoy your cockroach life with a lovely fatty uncle in Cockroach Simulator household survivor today!!<br/><br/><strong>unique features</strong><br/>- Simulating life as a tiny creature<br/>- Enjoy finding food whether it's from your uncle's scraps. Or the food that is usually delivered to the door every minute.<br/>- Haunting music atmosphere<br/>- survival from the creatures within<br/>- Difficulties become more difficult as time passes.<br/><br/><strong>Some of the content or props may contain explicit images, sounds and objects that may suggest drugs, sex and violence. therefore may not be suitable for players of all ages[/b<br/>Share your ideas for what you want to see or experience in this Cockroach Simulator.<br/>As the developer we would like to incorporate players opinions and suggestions to make our game even more entraining. <br/>So share your voice to improve this game with us!</strong>", "metacritic": null, "released": "2023-02-28", "tba": false, "updated": "2023-03-03T05:03:23", "background_image": "https://media.rawg.io/media/screenshots/4a9/4a9af359e914bd568a45f90405830ba9.jpg", "website": "https://web.facebook.com/wizwin.dev", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TMAS", "WIZWIN"], "genres": ["Action", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["WIZWIN"], "esrb_rating": null}