{"id": 934646, "slug": "that-endless-night-1931", "name": "That Endless Night - 1931", "name_original": "That Endless Night - 1931", "description": "The city is in complete chaos: robots full of sparks and trouble causing panic, bad-tempered gangsters who won’t stop hounding you, a veritable extraterrestrial invasion devouring people in the middle of the street, and, if that wasn’t enough, monstrous creatures destroying your beautiful and beloved city!<br/>\n<br/>\nThis scene would surely scare even the bravest of people, but not Liz and Tim! Take charge in this fast-paced comic book-style adventure and start serving up knuckle sandwiches all over the city. Face the threat on your own or call for back-up from your favorite player 2!<br/>\n<br/>\nWe have prepared 29 wild and exciting levels for you. It’s an adrenaline-filled adventure where you can ride a bike, a flying saucer, or free fall through this endless night. It’s going to be a wild ride! While you explore the levels and face the most bizarre challenges and dangers, you’ll be able to use many objects, boosters, and skills to make the Liz and Tim duo into a winning team. Interact with the surroundings, with the second player, or turn everything on its head with the combos. It’s complete madness!\n<br/><br/>\n<ul>\n<li>Choose between our two brave heroes to free the city: Elizabeth, tough as a rock and smart as a whip. Or play as Tim, a guy who’s tough as a rock and smart as... a rock? :P</li>\n<li>Explore each of the 29 levels to discover all the secrets. Power-ups, collectables, and NPCs are waiting for you to make sure you get to the end of this adventure in one piece.</li>\n<li>Combine items, actions, and combos in fights to get some really explosive results! You were warned that if you use that tiny alien blaster, you can say goodbye to the neighborhood, right?</li>\n<li>Everyone ran away and left their stuff on the streets. Any object can be fun and also lethal in Liz and Tim’s expert hands.</li>\n<li>You’re thinking of walking across the island? Not a chance! Borrow a bike, make off with a UFO, or take the gangster-mobile. But don’t walk alone!</li>\n<li>Send help, please! Become a real troublemaker with help from your favorite player 2, or let our AI take control and get you out of a tight spot. But you won’t want to miss this party for anything in the world.</li>\n</ul>\n<br/>\nSave the city! Rescue your friends! And all in one night: the longest, weirdest, and most exciting night of your entire life!<br/>", "metacritic": null, "released": null, "tba": false, "updated": "2023-03-03T07:25:18", "background_image": "https://media.rawg.io/media/screenshots/fda/fdafc1eeebbd5b838e69e54dddb97ac6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 378, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WildSphere"], "genres": [], "publishers": ["WildSphere"], "esrb_rating": null}