{"id": 934645, "slug": "troublemaker", "name": "Troublemaker", "name_original": "Troublemaker", "description": "Go to school, make new friends, beat old enemies up, solve world-class problems (like grades and girlfriends), and don’t let your mom down by getting arrested or worse - flunking out!<br/><br/><br/><br/>Troublemaker is an action-adventure-beat-'em-up game about the most important and terrifying part of everyone's life: High school. As Budi, the new transfer to one of Indonesia's finest high schools, literally fight your way to the top of the social food chain through the school's annual student fighting tournament, aptly named Raise Your Gang.<br/><br/><br/><br/><ul><li>Inspired by beat-'em-up classics, Troublemaker is all about smooth and over-the-top combat in Indonesia's greatest adolescent combat arena. Punch, kick, break, smash, or gently swing Budi’s way up to the top with more than 30 iconic moves.<br/></li><li>Square up with your best friends and mortal enemies, there can only be one winner!</li></ul><br/><br/><br/><br/><br/><br/><ul><li>Budi won't be fighting across the school alone. Parakacuk, his gang, will be there to help him out.<br/></li><li>Rani the class boss will lend her smarts, Zaenal his might, and Boby...well, Boby's just Boby.<br/></li><li>Together, they'll face the crushing mortal challenges of high school (or, you know, die trying).\t<br/></li><li>Spend time with Budi’s girlfriend, increase his popularity at school, do homework with his friends, and learn what an over the top life could be like in a 21st century Indonesian high school.</li></ul><br/><br/><br/><br/><br/><ul><li>Beating up your peers is all fun and games, but patience is necessary.<br/></li><li>Kickflip into the fray and create personal combos by mixing up Light, Heavy, Advanced, and Sick move styles<br/></li><li>Take things slow, let bruises heal, and take a stroll across the school to see the sights while gathering 20 different collectables.</li></ul><br/>", "metacritic": null, "released": "2023-03-31", "tba": false, "updated": "2023-04-13T05:23:13", "background_image": "https://media.rawg.io/media/screenshots/222/222f84ede83b3001f0ae635dff37abf5.jpg", "website": "https://gamecomteam.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 10, "toplay": 4, "dropped": 1}, "playtime": 1, "achievements_count": 25, "ratings_count": 1, "suggestions_count": 287, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Gamecom Team"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Freedom Games"], "esrb_rating": null}