{"id": 934845, "slug": "thornbacks-unfinished-horror-vn", "name": "ThornBacks (Unfinished Horror VN)", "name_original": "ThornBacks (Unfinished Horror VN)", "description": "<p><strong>A short <em>(and unfinished, lol)</em> Horror, Visual Novel, set in 2001 in the remote  Welsh countryside, \"Cryptid Chaser\" Jody is invited to a crumbling old, academy  where the headmistress is having hell trying to dispose of the academy's pride and joy... an ancient rose....</strong></p>\n<p>An unfinished visual novel that I made in summer 2020, in around a week or so, while I had big plans to finish this, as a project I let it grow beyond what I was actually capable of. It was first attempt at even using renpy, and I knew nothing about coding or making music haha.</p>\n<p>I also made the mistake of not finishing writing the story, or even preparing a bare bones structure of the coding, both lessons I've learnt very well XD</p>\n<p>This was definitely made in a fevered haze, and one of the reasons I stopped working on it... is that I'm actually not too keen on writing horror stories 😂 (Despite horror being one of my favourite movie genres!)</p>\n<p>Maybe there is a chance that I finish this one day, as I'm still proud of the assets and premise, but for now that is very unlikely.</p>\n<p>If you do download it I'd love feedback or a comment! It would mean a lot to me!<br/>This is also absolutely free to download too, but if you would like to donate something it would totally help me out, and would also go towards funding other projects that are currently in the works! Hopefully, projects that will actually get finished haha 💜</p>\n<p>Again feedback would be amazing, as this is my first project like this, and my first time posting a game! So if you encounter any problems let me know! I'll do my best to help/fix them!</p>\n<p><strong>Important for Mac Users: If you encounter the message \"game could not be opened because it's not from an identified developer\" You'll have to go into system settings and go to privacy and security. There there'll be the option to open the file anyway</strong> c:</p>", "metacritic": null, "released": "2023-03-02", "tba": false, "updated": "2023-03-03T08:56:09", "background_image": "https://media.rawg.io/media/screenshots/209/209b51f4e71e6cadc9c6dfd637fa3bb8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["3llix"], "genres": [], "publishers": [], "esrb_rating": null}