{"id": 934932, "slug": "retro-survival-shooter", "name": "Retro Survival Shooter", "name_original": "Retro Survival Shooter", "description": "<p><strong>Introduction:</strong></p>\n<p>Welcome to my newest game project, of which I do not have an actual name for, so for now the working title is: Retro Survival Shooter! This game takes inspiration from video games such as Quake, Hunt: Showdown and Project Zomboid. This is currently an in-development project for my University Final Major Project, and I'll be uploading builds (mostly whenever I remember to lol), so stay tuned for updates.</p><p><strong>Controls:</strong></p>\n<p>Movement - WASD Keys, Looking/Rotation - Mouse</p>\n<p>Stances - L-Shift (Run), L-Control (Crouch)\r\n</p>\n<p>Inventory - Number Keys (1 to 0), and the - and + keys, for a total of 12 slots.\r\n</p>\n<p>Interaction - 'E' Key\r\n</p>\n<p>Shoot/Consume - Left Mouse, Aim/Block - Right Mouse, Melee - 'V' Key</p>\n\n<p><strong>Description:</strong></p>\n<p><em>\"The game takes place in an analogue of our own world, specifically in an analogue of Soviet Eastern Europe and the Eastern Bloc states. After this world’s WW2, the Cold War began and with tensions rising, a decade later the Cold War became Hot; the world’s nations launching nuclear strikes against one another, annihilating civilization in the process.</em></p>\n<p><em>It’s barely a year after the world was destroyed, civilization is lost to the atomic winds. With nuclear winter ravaging the world, those who find themselves in this wasteland must explore the ruins of their predecessors, scavenge for limited resources, and fight to keep themselves alive…\"</em></p>\n\n<p><strong>Objective:</strong></p>\n<p>The Main Objective? Survive in this procedural post-apocalyptic wasteland by scavenging for food, water and other resources, whilst fighting mutated creatures, savage raiders and pre-war automatons. </p>\n\n<p><strong>Mechanics:</strong></p>\n<p>Slow and Brutal Gunplay - Inspired by Hunt: Showdown, guns are slow firing, but brutal in their damage output and effectiveness in taking down foes.</p>\n<p>Immersive Survival Experience - Inspired by Project Zomboid, with hunger, thirst and temperature to manage whilst trekking through the wasteland.</p>\n<p>Random World Generation - Each player save is a uniquely generated world, split into “chunks” with a random biome, environmental features, structures and loot placed within to explore and scavenge.</p>\n\n<p><strong>Gameplay:</strong></p>\n<p>You can explore the environment, coming across environmental features, as well as buildings/structures that you can go into. You can scavenge throughout the world to find food, water and other resources/equipment to survive.</p>\n<p>You can encounter wild creatures and animals, as well as other survivors, who may or may not be friendly/cooperative. You can fight these creatures, animals and survivors with a variety of melee and ranged weapons.</p>\n\n<p><strong>Style:</strong></p>\n<p>Low-res, retro graphics, taking inspiration from retro and retro-inspired video games such as Dread Templar, Quake and Paratopic. Soviet &amp; Brutalist architecture, with a cold &amp; dreary palette consisting of blues &amp; whites of snow and frost, browns &amp; greys of buildings/industry, with the occasional splash of colour to accentuate certain structures.</p>", "metacritic": null, "released": "2023-03-02", "tba": false, "updated": "2023-03-03T09:37:04", "background_image": "https://media.rawg.io/media/screenshots/544/5440ae388190607327073e48197e5499.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Limphus"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}