{"id": 93499, "slug": "moon-cheeser", "name": "Moon Cheeser", "name_original": "Moon Cheeser", "description": "The Game\r\n<p>Moon Cheeser is an infinite runner where the player plays as a mouse gathering cheese pieces and avoiding craters and other astronomical objects, such as comets and planets, on a moon made of cheese. <br/><br/>The main objective is to score as much as you can by gathering those cheeses, but there are side objectives which expand the experience,  you can unlock some special cosmetics by achieving some objectives in the game.<br/></p>\r\nStory\r\n<p><strong>Astromouse </strong>was sleeping, dreaming about a <em>moon made of cheese</em> and he was gathering all the cheese the moon was kindly offering to him.<br/><br/>But the outer space is a cruel place to be, cruel indeed. The dream starts to get more intense when comets try to take him out his <strong>beloved moon</strong>, blackholes try to pull him into their orbit taking Astromouse away. <br/><br/>But the <strong>shooting stars</strong> are there to help him, \"Come on Astro\" they kindly invite him for a ride and help him feed.</p>\r\nThe Developer's bundle\r\n<p>This pack includes the editable files for the assets of the game and also include its source code and the assets used to develop it. This pack includes:</p>\n<ul><li>The source code with the gdscript (Godot Engine's scripting language) and assets.</li><li>The .svg files for the UI, Background, Achievements thumbnails and Entities of the game. This can be opened with Inkscape for instance.</li><li>The .mmpz files for the sound effects. This can be opened with LMMS.</li><li>The .blend files used for animating the Mouse, the Comets and the Stars. This can be opened with Blender.</li><li>The .aup project used for the background music. This can be opened with Audacity.</li><li>The .mscz file, which is a MuseScore 2 arrange of Take Five, a public domain music composed by Paul Desmond</li></ul>\n\r\nDeveloper's Bundle Thumbnail", "metacritic": null, "released": "2016-06-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/123/1232a17e0205200c2db0234ece1606a0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Android"], "developers": ["Pigdev Studio", "Henrique Campos"], "genres": ["Action"], "publishers": [], "esrb_rating": null}