{"id": 935044, "slug": "mega-monster-metropolis", "name": "Mega Monster Metropolis", "name_original": "Mega Monster Metropolis", "description": "<p>Get ready for a monster mash like never before with this exciting new demo, Mega Monster Metropolis! This competitive collectable card game is packed with endless possibilities for players to create their ultimate team of monstrous creatures. With the ability to level up your creatures, equip them with powerful spells and items, and strategize your way to victory, Mega Monster Metropolis offers a gaming experience like no other.\r\n</p>\n<p>But don't be intimidated by its depth – this game is also incredibly user-friendly, making it a breeze to pick up and play. And the best part? You won't find any pesky microtransactions or pay-to-win features here. So get ready to dive into the thrilling world of Mega Monster Metropolis and battle your way to the top!\r\n</p>\n\n\n<p>***</p>\n<p>This is a prototype/demo, let us know what you think and if we should make this into a full game!</p>\n<p>***</p>\n\n<p>CONTROLS</p>\n<p>Click and drag cards to the different zones to play them.</p>\n<p>Right click to inspect cards.</p>\n\n<p>HOW TO PLAY</p>\n<p>TURN ORDER</p>\n<p>1a. If one of your monsters was defeated during your opponents turn, replace it before you draw. This does not use the monsters action for the turn.</p>\n<p>1b. Draw a card.</p>\n<p>At any point during your turn, you can play action cards. You can play as many as you want during a turn. If you don't play an action card during your turn, you draw a card when your turn ends.</p>\n<p>2. Choose a monster and increase its level.</p>\n<p>2. Teach a monster a spell by placing a spell card from your hand underneath a monster. You can only play 1 spell card per turn.</p>\n<p>3. Give a monster an item. You can only play 1 item card per turn.</p>\n<p>4. Each monster has one action per turn. They can either use one of the spells they have learned, or they can swap with a monster from your bench. The monster swapped into the cannot use an action during the same turn. If a monster is defeated, the player that defeated the monster can level up one of their monsters and draw a card.</p>\n<p>OTHER MECHANICS AND INFO</p>\n<p>Shielding: When a monster is shielded, they receive an additional health bar up to a maximum of 100.</p>\n<p>Whenever a monster is in play, it's passive effects are active. Don't forget to keep track of them!</p>\n<p>Monsters are healed at the end of their turn while on the bench.</p>\n<p>DECK BUILDING</p>\n<p>6 monsters + 45 card deck. Deck can have a maximum of 4 of each cards.</p>\n\n<p>***</p>\n\n\n<p>To learn more and leave feedback, join the discord: https://discord.gg/6dUJmbtNpB</p>", "metacritic": null, "released": "2023-03-01", "tba": false, "updated": "2023-03-03T10:27:35", "background_image": "https://media.rawg.io/media/screenshots/6c4/6c4b99ac8992585bc549b958c7eb192d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["two_five_one"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}