{"id": 93510, "slug": "cyberpunk-casanova", "name": "Cyberpunk Casanova", "name_original": "Cyberpunk Casanova", "description": "<p>Cyberpunk Casanova is a dystopian visual novel. It's our goal to create a visual novel with a western approach. To achieve this and maintain balance with what fans like about the genre, we decided to contrast the \"grimdark\" setting with bright and vibrant artwork. We also made a decision to raise the danger level. Choices you make in game will not only influence how a person feels about you, but can also shape future “life or death” scenarios and major events for both you and the NPCs.<br/><br/><strong>Story</strong></p>\n<p>In an effort to teach Enzo a lesson, his parents strip him of his corporate resources and credit accounts. It is their intention for Enzo to suffer until they return from a business trip in 30 days. In their minds this should be more than enough time for their foolish son to have come to his senses and make the decision to join the company (Tritus Technologies) or be removed from family records.</p>\n<p>In those 30 days you will meet colorful characters. With each of these characters you have the option to see how far down the rabbit hole goes or simply move along. It’s important to not let Enzo’s boredom and happy go lucky attitude get the best of him.  Because saying the wrong things to the wrong people or making certain decisions can put himself and others in danger.</p>", "metacritic": null, "released": "2017-06-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0cc/0cc5aaf8e6d9ccffbfad6fc61d157ac2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Jetstreame & Patchwork Villain"], "genres": [], "publishers": [], "esrb_rating": null}