{"id": 935177, "slug": "dog-star-final", "name": "Dog Star (Final)", "name_original": "Dog Star (Final)", "description": "<p>Welcome to the expanded edition of Dog Star! It still has its problems, but I'm pretty pleased with how far it's come.</p>\n<p><strong>Premise: </strong></p>\n<p>You play as Sirius, the Dog Star himself, having fallen to earth after an unknown incident. You must collect enough star power to return to the skies. Along the way, you'll run into some earthlings, fellow fallen stars, and a few dangers. In the end, will you be able to get back home? And for that matter... do you even want to?<br/></p>\n<p><strong>Controls:</strong></p>\n<p>Press a and d to move to either side. Space bar is jump. Press e to interact with NPCs, items, signs and other things that look interesting. When dialogue is running, use the mouse to click the continue and dialogue option buttons that appear. Unfortunately, b does nothing. (The sound clips I could find for barks just didn't sound great.)</p>\n<p>Try as I did with YarnSpinner, I couldn't find a way to make accessing YarnSpinner variables in outside C# functions work. Though they would update in the context of Yarn conversations, they didn't seem to update in a way accessible through variable storage, unless it's been updated in some way and I was using the wrong language. Unfortunately, I had wanted to make completing dialogue a condition for moving from certain levels to the next, so I had to install a little cheat for those levels. <strong>If you press the left ctrl button, you'll automatically be taken to the start of the next level.</strong> This works in any level whether or not it's a dialogue-based one, so if you're frustrated with platforming and want to skip to the next dialogue level, feel free to use it that way too. </p>\n<p><strong>You'll have to use this \"cheat\" to end the first, third, and fifth levels. <br/></strong></p>\n<p>Another quirk of the game is that I had no idea how to freeze motion controls while dialogue is running, and ran out of time to implement that bit of polish. So, for the best experience, I respectfully ask you to not move around while you're talking to an NPC. It's only polite. (But if you do move around while a conversation is going on, the effect can be a little funny, so I don't blame you if you do.)</p>\n<p><strong>Notes to self on game development<br/></strong></p>\n<p>The pitch ended up being overly ambitious for both my skill level and my time constraints. I'm still thinking about doing that level that's entirely in the dark because I think it would be very frustrating and cool, but the power-up feature ended up feeling way less inspiring to me anyway. Still. I guess that's one base lesson of game development, or the creation of art in general - your ambitions will often be far grander than what you're able to achieve in the moment. I think of this little game as an achievement nonetheless, and definitely a stepping stone toward fulfilling grander ambitions.<br/></p>\n<p>Hope you enjoy playing!<br/></p>", "metacritic": null, "released": "2023-03-01", "tba": false, "updated": "2023-03-03T11:35:43", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["stellarine"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}