{"id": 935156, "slug": "cryptic-the-hacker-game", "name": "Cryptic - The Hacker Game", "name_original": "Cryptic - The Hacker Game", "description": "Spielkonzept\r\n<p>Das Spiel Cryptic ist eine fesselnde 2D MMO Hacking-Simulation, die Echtzeit-Strategie-Elemente beinhaltet. Es bietet den Spielern die Möglichkeit, in die Welt des virtuellen hackens einzutauchen und ihre Fähigkeiten als Hacker zu verbessern, jedoch im spielerischen Kontext. Durch das Benutzen von spezifischen Programmen und Befehlen können die Spieler die Systeme anderer Spieler, sowie die globale Infrastruktur infiltrieren. Dabei können Hardware und Software verbessert werden, indem eigene Computer gebaut und eigene Malware im Entwicklungszentrum produziert wird. Eine weitere interessante Komponente des Spiels ist, die Möglichkeit mit anderen Spielern zu kommunizieren, um Angriffe zu planen und auszuführen. Das Spiel soll zahlreiche Möglichkeiten, sowie Herausforderungen bieten und soll ein einzigartiges Erlebnis für jeden sein, der sich für das spielerische hacken und Computer-Sicherheit interessiert.</p>\n\n<p>\n</p>\r\nWir entwickeln ein Hackergame\r\nEntstehungsgeschichte\r\n<p>Die Spielidee wurde einst als Community-Projekt vom deutschen YouTuber The Morpheus ins Leben gerufen. Das Projekt wurde initial am 15. Oktober 2017 in einem Video angekündigt. Die Idee war, das Spiel gemeinsam in einer Community eigenständig und ohne Gameengine für das Web zu entwickeln. In den folgenden Jahren wurde ein Multiplayer-Web-Prototyp des Spiels entwickelt und der Anklang und das Feedback der Community war riesig.  Durch das gewonnen Feedback hat man sich entschieden das Spiel vollständig zu überarbeiten. Daraufhin wurde ein neues Gamedesign-Konzept und ein neues UI-Design entwickelt. Nach fast 5 Jahren Laufzeit geriet das Projekt leider ins Stocken und seit Mitte 2022 wurde nicht mehr daran gearbeitet. </p>\r\nWeiterer Verlauf\r\n<p>Mit frischer Motivation gingen zwei Köpfe des Teams ans Werk und beschlossen das Spiel in Unity umzusetzen. Diese Entscheidung sollte dazu beitragen das Projekt wieder in Schwung zu bringen. Mit der Umstellung auf Unity konnten auch direkt schnellere Fortschritte erzielt werden und nach etwa 7 Monaten Entwicklung wurde eine erste Alpha-Version am 01. März 2023 veröffentlicht.</p>\n\r\nGeplante Features\r\nSpielmechaniken\r\n<ul><li>Wallet</li><li>Miner</li><li>Terminal</li><li>Dateimanager</li><li>Taskmanager</li><li>Shop</li><li>Computer-Konfigurator</li><li>Computer-Prozesse</li><li>Hackerattacken</li><li>Netzwerk</li></ul>\r\nWeiteres\r\n<ul><li>Startseite (z.b. Dashboard)</li><li>Spiel-Einstellungen</li><li>Mehrsprach-Modus</li><li>Musik und Soundeffekte</li><li>Animationen</li><li>Cryptic UI 1.0</li></ul>", "metacritic": null, "released": "2023-03-01", "tba": false, "updated": "2023-03-03T11:25:39", "background_image": "https://media.rawg.io/media/screenshots/af6/af617ffa678bf74860d875f2928dde9a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["MP Studio"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}