{"id": 935250, "slug": "secret-agent-brad-nga", "name": "Secret Agent B.R.A.D- NGA", "name_original": "Secret Agent B.R.A.D- NGA", "description": "Game design Document\r\n<strong>Elevator Pitch</strong>\n<p>Secret Agent B.R.A.D is an Isometric, 3D environment, stealth, mission-based game, where you play as an ex-maintenance robot that is programmed to spy on the soviets. You will be infiltrating the Soviet bases to extract the intel.\r\n </p>\r\nName\r\n<p>Secret Agent B.R.A.D\r\n </p>\r\nTargeted Platforms\r\n<p>Secret Agent B.R.A.D is a Windows PC game.\r\n </p>\r\nPlayer Count\r\n<p>This is a single-player game.</p>\r\nStory\r\nSetting\r\n<p>The game is set during the Cold War. You are an American Spy trying to infiltrate Russian bases and steal valuable information. All bases are situated underground during that period and have a futuristic element to them - robots!\r\n </p>\r\nBackground of protagonist\r\n<p>BRAD was a maintenance robot, during a routine maintenance visit, the CIA reprogrammed BRAD to grab information packets (intel) from Russian bases. His objective is to steal all information packets.\r\n </p>\r\n🎮 Gameplay\r\nMovement and Navigation\r\n<p>By holding down W, A, S, D you can move upwards, downwards, to the left, and the right respectively.\r\n </p>\r\nCamera\r\n<p>The camera is centered on Brad giving the player a high view of everything in the character’s close vicinity. It has a static distance away from the map that does not change throughout the levels.\r\n </p>\r\nControls\r\nMenus\r\nMain Menu\r\n<p>The main menu will present the game’s title and 5 other buttons.\r\n </p>\n<ul> <li>“Play” button - forwards the player to the first level.\r\n </li><li>“Settings” button - forwards to another menu where all control buttons, used for navigating the game, are listed as well as their description/use. They will not be editable and will include all controls listed in this document. The settings menu also includes a Graphics dropdown that allows changing graphics.\r\n </li><li>“Level Select” button - forwards the player to a screen where they can select which level they want to play. All levels will be sorted in rows starting with level 1 and ending with the last level.\r\n </li><li>“Quit” button - this button will allow the user to exit the application.\r\n </li></ul>\r\nIn-game Menu\r\n<p>The ingame-menu can be accessed mid-game by tapping the “Esc” key on the keyboard. It does not pause the game and allows the user to visit the Settings and Main menus as well as to restart the level or resume their game.\r\n </p>\n<ul> <li>The restart level button is used in case of a soft lock, glitch, or if the player decides to restart the level when there are no enemies nearby.\r\n </li></ul>\r\nUpon Finishing the level\r\n<p>A menu which comes up after you have finished a level, it allows you to go to the Next Level, Main Menu, visit the Level Select and Restarting the level.\r\n </p>\r\nGadgets\r\nDisguise\r\n<p>This allows Brad to take off his hat to disguise himself as the enemy, but only while standing still. If Brad moves in disguise mode, he will lose the disguise. You will have a limited amount of disguises depending on the level.\r\n </p>\n<strong>Levels:</strong>\n<ul> <li> <p>Start and finish.\r\n </p><ul> <li>BRAD’s goal is to extract all information spread throughout the level, and escape the level successfully. Being detected usually leads to you losing the game, unless you successfully escape the chase.\r\n </li></ul> </li><li> <p>Enemies.\r\n </p><ul> <li>Different enemies will pose various challenges for the player, because of that, they will be introduced throughout levels and impact game difficulty.\r\n </li></ul> </li><li> <p>Level layout\r\n </p><p>All the elements listed under this point add to the variety of levels we are looking to create.\r\n </p><ul> <li> <p>Levels will strive to guide the player through the level while allowing them to explore and create their own adventure.\r\n  </p></li><li> <p>Levels can have one or more exits.\r\n  </p></li><li> <p>Levels can have rooms where hiding and staying safe is possible\r\n  </p></li><li> <p>Levels have collectables - keys and types of intel.\r\n  </p></li><li> <p>Levels can be composite - they can have many floors or sections which are gradually revealed as the level progresses or quickly revealed by climbing through a vent.\r\n </p></li></ul> </li></ul>\r\nPlayable character\r\nBrad\r\nDetection system\r\n<ul> <li>If detected by an enemy, all guards will be aware of Brad’s detected location. They will try to reach the last location where he has entered/exited a view cone of an enemy. If you manage to stay outside of detection for 5 seconds, all enemies will return to their position, and continue their search routines if they have any.\r\n </li></ul>\r\nLose conditions\r\n<ul> <li>Only when caught by enemies have you lost the game.\r\n </li></ul>\n<strong>Enemies:</strong>\n<p>The enemies’ main objective is to capture the player. There are 3 types of units that you can encounter throughout your playthrough. By having a few, they can work together at capturing the player in various of ways.\r\n </p>\r\nSpeedy\r\n<p>Rangle and angle of alertness view: Very Short\r\n </p>\n<p>Speed: Extremely fast\r\n </p>\n<p>Appearance: This unit has the appearance of a dog and thus its quick speed.\r\n </p>\n<p>Behaviour: Unit can follow waypoints. It is very difficult to be spotted by it, in general. If that was to happen, it will lead to a guaranteed loss. It is a strong enemy when other robots spot Brad, however, it is easily to avoid by itself due to its low range.</p>\r\nSoviet Guard\r\n<p>Rangle and angle of alertness view: Normal\r\n </p>\n<p>Speed: Normal\r\n </p>\n<p>Appearance: This unit has treads connected to a big boxy body. For a head it has a screen and he has two arms which ca be used as pistons (for punching).\r\n </p>\n<p>Behaviour: This enemy’s speed is close to Brad’s and together with its viewing range, and angle, posses a threat to BRAD. It is especially effective in spread groups, as a few of them, can easily surround and capture him.\r\n </p>\n\r\nMaintenance Robot\r\n<p>Rangle and angle of alertness view: Large\r\n </p>\n<p>Speed: Slow\r\n </p>\n<p>Apperance: Resembles Brad as they are both maintenance robots.\r\n </p>\n<p>Behaviour: A slow enemy which's main goal is to introduce the player to the game and teach him how the spotting mechanics work, however, it can later be used in combination with the other enemies to create different scenarios that the user has to navigate.\r\n </p>\r\nMonitoring Camera (obstacle)\r\n<p>Rangle and angle of alertness view: Large\r\n </p>\n<p>Speed: N/A\r\n </p>\n<p>Apperance: A boxy camera with a stand that is connected to the wall/ceiling.\r\n </p>\n<p>Behaviour: A stationary enemy which cannot capture the user. It is used to alert the other enemies of Brad’s location upon being spotted. It is an effective obstacle.\r\n </p>\r\nTechnical details**:**\r\n<ul> <li>Camera settings (default) <ul> <li>The camera is facing down 30 degrees and are orthographic in order to create the isometric view of the game.\r\n </li><li>The size of the camera as of now is 10, however, this will be further tested as it can impact gameplay and fun.</li></ul></li></ul>\n\n<ul> <li>Characters’ speed (default) <ul> <li>Brad’s walking speed is 6.\r\n </li></ul> </li><li>Interaction between enemies and characters. <ul> <li>Once alerted <ul> <li>Enemies will have a yellow exclamation mark over their heads, and their Field of view-cones turn yellow.\r\n </li><li>The enemies that is currently seeing BRAD will have a red field of view.\r\n </li></ul> </li><li>While not alerted <ul> <li>FOV is white.\r\n </li></ul> </li></ul> </li><li>White = Enemies are not alerted nor see BRAD.\r\n </li><li>Yellow = the robots are alerted about Brad's last whereabouts.\r\n </li><li>Red = This enemy can currently see BRAD.</li></ul>\n\n<ul> <li>Interaction when extracting information <ul> <li>X-second “Extract information…” time</li></ul></li></ul>\r\nObjects inside of the game:\r\n<p>There are two different types of furniture that will impact gameplay - non-traversable and see-through, and non-traversable and opaque. Decorative objects are eye candy. They do not influence gameplay directly but can be used to guide the player in the level.\r\n </p>\n<ul> <li>Non-traversable and opaque <ul> <li>Doors, Large Cabinets, the dresser, Walls, Large Cupboards\r\n </li></ul> </li><li>Non-traversable and see-through <ul> <li>Desks, Short Cupboards and Cabinets, Windows, Tables, Chairs\r\n </li></ul> </li><li>Eye Candy <ul> <li>Carpets, Computers\r\n </li></ul> </li><li>Interactable Objects <ul> <li>Keys - they instantly remove all doors with the same color\r\n </li><li>Intel Folders - a collectable. It is an objective for completing levels\r\n </li><li>Intel-Computers - BRAD has to extract the information which takes time.\r\n </li><li>Vents - BRAD is able to climb through these to get to different parts of the levels.\r\n </li></ul> </li></ul>\n\n\n<ul> <li>The player will respawn on the level they have died.\r\n </li><li>Some levels have checkpoints that are invisible but save the game progress.\r\n </li></ul>\n\n<p>The Team</p>\r\nAustin\r\nTeam Lead, Game Designer\r\nTobias\r\nGame Designer\r\nTor-Arne\r\nProgrammer, Repository maintainer, Webmaster\r\nKamen\r\nArtist, Substitute TL\r\n\r\n<p>The link to the original product </p>", "metacritic": null, "released": "2023-03-01", "tba": false, "updated": "2023-03-03T12:17:16", "background_image": "https://media.rawg.io/media/screenshots/763/7633d8e1edccadd87919b09181b54cef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Bakkeboi"], "genres": ["Action", "Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}