{"id": 935302, "slug": "nemea", "name": "Nemea", "name_original": "Nemea", "description": "<p><em>Her three children disappeared. She started to find them following clue,  and finally found the demon which was trying to sacrifice the souls of her children to gain the power of darkness. She tried to save her children, but she failed. Demon was dead, yet her children did not wake up. She decided to sacrifice her own llife to save them. At last, the souls of her three children woven together to form a soul, and reborn in her arms. In the wind of tears, light of happiness, with the dissipation of her soul, she disappeared in the moonlight. And the miracle child, carrying the blessed name from her mother, Nemea, begin her journey.</em><br/></p>\n<p>\n</p>\n\n<p><strong>NEMEA</strong> is a hand drawn platformer inspired by many games like Castlevania, Hollow Knight, Zelda, Kirby and so on. It's also inspired by some animation.</p>\n<p>This game is still being worked on and is in an early stage, some things might change. Please, leave your feedback in the comments. Let's play videos are also appreciated! If you encounter any bugs, feel free to also leave a comment or to PM me on Twitter. There is a plan for this game, for now, I will focus on realizing intersting idea and making this game more fun. </p>\n<p>Art, programming by me. I started to learn painting and animation a year ago through  Hollow Knight, so the art style has the feeling of a hollow knight. I'm still finding my art style and implement it in my game during the development!</p>\n<p>Support the project on Patreon to help me make the game. In Patreon you can find more information for this game! Follow me on Twitter for updates!<br/></p>\n<p>Here on itch for some devlogs! Click 'Follow ' in the top right.<br/></p>\n<p>My English isn’t very good, if you find any mistakes about language, I would be glad if you reported them to me!</p>", "metacritic": null, "released": "2023-03-01", "tba": false, "updated": "2023-03-03T12:55:14", "background_image": "https://media.rawg.io/media/screenshots/5f8/5f8ef3dc73ec9fa67171d2f23242cfe3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Softme"], "genres": ["Action", "Adventure", "RPG", "Platformer"], "publishers": [], "esrb_rating": null}