{"id": 935334, "slug": "jamstation-devs-odyssey", "name": "Jam.Station Dev's Odyssey", "name_original": "Jam.Station Dev's Odyssey", "description": "<p><em><strong>Happy holidays and 2023 COOLRYAN! Hope you like it!!!</strong></em></p>\n<p><strong>Premise</strong></p>\n<p>COOLRYAN and fellow devs are <em>en route</em> to an alien planet to deliver the game they're developing. But there are two problems! First, the space is filled with evil civilizations who want nothing more than to destroy the JamStation:Dev ship; and second, the game is under a tight deadline to be finished!</p>\n<p>Help COOLRYAN and their team finish the game by completing the tasks in order, while also defending their station spacecraft from the evils of the deep!</p>\n<p><strong>Features</strong></p>\n<ul><li>Mix of a real-time strategy game and a task management game!</li><li>Assign the devs to complete all the game development tasks needed to finish their game.</li><li>Harvest asteroids to acquire material!</li><li>Use your material to build, upgrade and repair your units and place them strategically to defend the starcraft from hordes of alien ships eager to destroy it!</li><li>Beautiful pixel art</li><li>Play a practice level or enjoy a randomly generated universe!</li></ul>\n<p><strong>How to Play</strong></p>\n<p>Use ESC or P to pause, everything else is handled by the mouse. Click to select and click again to open the panels, right click to move selected unit/dev to a new place. Mouse wheel to zoom in/out. Select the station and zoom in (or select nothing and zoom in) to see the station's interior.</p>\n<p><em>Learn to play by completing the tutorial!</em></p>\n<p><strong>Credits</strong></p>\n<ul><li>Ideas taken from COOLRYAN's Secret Santa letter!</li><li>Game design, programming, testing by me. Made in Gamemaker.</li><li>Art by the super talented Baldur (https://twitter.com/the__baldur) and distributed by Foozle (www.foozle.io). Also some art by Kenney (https://kenney.nl/)</li><li>Sound effects from freesound.org</li><li>Fonts from dafont.com</li><li>Music composed in BeepBox by my son, Andrés (Nobiluga654)</li></ul>", "metacritic": null, "released": "2023-03-01", "tba": false, "updated": "2023-03-03T13:13:14", "background_image": "https://media.rawg.io/media/screenshots/616/61627b62e3583d85e54c6c99f1396de9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 313, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["manta ray"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}