{"id": 93535, "slug": "ultraworld-exodus-itch", "name": "ULTRAWORLD EXODUS (itch)", "name_original": "ULTRAWORLD EXODUS (itch)", "description": "<p><em>\"Incites you to reconsider the difference between the real and virtual.\" </em><br/>Kill Screen Daily <br/> <br/><em>\"ULTRAWORLD boasts vibrant, fantastical environments that are sometimes difficult not to marvel at.\" </em><br/>Game Skinny <br/> <br/><em>\"Ultraworld is a surreal and beautiful first-person exploration adventure\"</em> PCGamer<br/></p><p>The doors to ULTRAWORLD are open and beckon you visit. Come see what's new in <strong>ULTRAWORLD EXODUS</strong>, the newly free, wildly abstract first-person exploration adventure you've heard so much (or little) about. The sole work of James Beech, a former Crytek/Sony AAA game developer, ULTRAWORLD EXODUS is a visual novel/Art toy/who-knows-what.<br/> <br/><strong>FEATURING</strong> <br/> <br/><strong>IMPERFECT</strong>: A highly revised redux of the original ULTRAWORLD story. Ponder Exoplanets and Artificial Intelligence while trying to assist a self-aware NPC in the midst of an existential crisis. Some people loved it. Some people hated it. Feel free to decide for yourself. <br/> <br/><strong>EXODUS</strong>: A new continuation of the unusual sci-fi meta-narrative that could only be told in the medium of video games. A year has passed and ULTRAWORLD has changed. Your old pal is dismayed by your inaction, but this gives way to a new friend with an impossible plan. Embrace the hivemind! <br/> <br/><strong>VACATION MODE</strong>: A greatly expanded free-roaming mode where you're the Artist. Change the colors, filters, particles, and rendering modes for infinite visual variety (and I do mean infinite). Then soar above the landscape, camera in hand, looking for the perfect picture. Every shot is a unique abstract painting, created by you, and fit to hang on your walls. <br/> <br/><strong>THE SOUNDTRACK</strong>: There are now double the songs to the highly praised original soundtrack. <br/> <br/><strong>VR SUPPORT</strong>: Vacation Mode can be setup to use VR devices (although you'll need a steel stomach. Not meant for humans)</p><p><strong>FREE:</strong> ULTRAWORLD EXODUS is now 100% free. The story, the vacation, the weird art experience: yours to enjoy! If you dig it, grab the soundtrack or something to show some support.<br/></p><p><strong>IMPORTANT NOTE:<br/>This game uses the CRYENGINE which has high minimum requirements to run. You'll need a 64bit Windows Operating system, 4GB of RAM, and a DirectX 11 graphics card.</strong><br/></p>", "metacritic": null, "released": "2015-05-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/840/84038d0fc8272fd2f16d38795558a49e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["James Beech"], "genres": [], "publishers": [], "esrb_rating": null}