{"id": 93542, "slug": "the-tragic-tale-of-bark-scruffalo", "name": "The Tragic Tale of Bark Scruffalo", "name_original": "The Tragic Tale of Bark Scruffalo", "description": "<p>Guard your dog! His name is Bark Scruffalo and he is a <em>good dog</em>. This is an exciting <em>bite</em>-sized, retro action game that's all about defending your puppy from the creepy creatures spawning from... who know's where?! </p>\n<p><strong>How to play:</strong></p>\n<ul><li>You can attack the Enemies and Enemy Spawn Monoliths with your Bat, and collect the Core Crystals they drop. </li><li>You can lay down Mines if you have 3 or more Core Crystals. The Mines will blow up automatically if an Enemy walks into them and damage any enemies and spawn points nearby.</li><li>You can sprint for short distances to escape enemy attacks or to get to where ya' need to go a little bit quicker...Cool!</li><li>Enemies will spawn from the 4 corners of the yard, so plan the locations of your Mines wisely!</li><li>You can attack the Enemy Spawn Monoliths for additional points and Core Crystals as well as temporarily halt the Enemies from spawning at that location.</li><li>See how long you can last... <strong>Will you be able to protect Bark Scruffalo??!</strong></li></ul>\n<p>This is my first game! I had an absolute blast making it and learning the ropes of Game Maker Language and pixel art. It may be somewhat of a simple game, but I hope you give it a chance and find some enjoyment from it! Please feel free to share any thoughts and feedback in the comments.<br/></p>\n<p><strong>NOTE:</strong> I had to take the Mac version down for now, until I can get it working properly. I apologize for the inconvenience, and to anyone that tried downloading it on Mac and wasn't able to run it!<br/></p>", "metacritic": null, "released": "2018-04-16", "tba": false, "updated": "2019-08-28T23:25:55", "background_image": "https://media.rawg.io/media/screenshots/4aa/4aaf65997fdb7306e46d8de27961f7e1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Polynaut"], "genres": ["Action"], "publishers": [], "esrb_rating": null}