{"id": 935521, "slug": "puli-runner", "name": "Puli Runner", "name_original": "Puli Runner", "description": "<p><em>Ready to wear your Puli Runner NFT and run, dodge, jump, duck and collect Puli Tokens? Ready to win prizes in BUSD, Puli Tokens, or perhaps from your favorite BNBChain project?</em></p>\n<p><strong>Play Puli Runner!</strong></p>\n<p><strong>Features:</strong></p>\n<ol><li>NFT Integration<ol><li>Players can mint an NFT from the Puli Runner NFT Collection and wear their NFT on the Puli Avatar!</li><li>NFTs provide unique bonuses within the game from extra power up durations, extra lives, prize multipliers, and more!</li><li>NFTs provide an ad-free experience!</li><li>Simply create an account from the app and associate your wallet. NFTs are then displayed within the game and any special boosts they may offer.</li></ol></li><li>Leaderboard Contests<ol><li>Think you can run the farthest or collect the most coins? Go up against your friends and see who the best is!</li><li>Win prizes in BUSD, Puli Tokens, or from a host project! Yes, any project can sponsor a game, have their project advertised within the in-game billboards, and provide prizes in their token on the BNBChain!</li></ol></li><li>Seasonal Maps<ol><li>Whether it is the winter holidays or a spooky Halloween Map, the map keeps changing along with the type of challenges one collects! </li><li>Check out the Winter Holiday Edition of Puli Runner!</li></ol></li><li>Anyone can Play<ol><li>There is a freemium edition for everyone to try out the game and see if they want to get more involved.</li><li>Not ready to get into cryptocurrencies but still want to have fun? You can buy a skin and share in the experience!</li><li>But there is more! You can combine a skin (the fungible world) with your NFT (the non-fungible property you own!).</li></ol></li></ol>\n<p><strong>Settings:</strong></p>\n<ol><li>Sound Effects: On or Off</li><li>Music: On or Off</li><li>Haptic: On or Off</li><li>Low Power Mode: On or Off</li><li>Pin Booster Panel: On or Off</li></ol>\n<p><strong>Controls:</strong></p>\n<p>Playing Puli Runner is super easy:</p>\n<ol><li>Swipe Up: Jump</li><li>Swipe Down: Duck</li><li>Swipe Left: Slide Left</li><li>Swipe Right: Slide Right</li><li>Pause: Tap Pause in the Top Left Corner</li></ol>\n<p>That's it!</p>\n<p><strong>Puli Coins:</strong></p>\n<ol><li>Collect Puli Coins during your runs and redeem them for boosters to enhance your game experience.</li><li>Each booster can be used 1 time per play session.</li><li>However, there are more boosters that appear randomly on the track so make sure to grab them!</li></ol>\n\n<p><strong>Puli Points:</strong></p>\n<ol><li>Find the fortune cookie and win Puli Points!</li><li>Puli Points can be redeemed at the player dashboard for prizes such as BUSD, Puli Tokens, or from any project hosting an event in the game (<em>Must be 18 or older to participate in the Play-to-Earn experience</em>).</li></ol>\n\n<p><strong>Puli Boosters:</strong></p>\n<p>Want to power up and be indestructible? Then you need a Bullish Booster!</p>\n<p>Want to jump over big objects? Put those Power Boots on!</p>\n<p>Want to collect more Puli Coins? Take a Coin Magnet with you!</p>\n<p><strong>Puli Community</strong></p>\n<p>Come play with others, share screenshots to brag about your scores, and see who can win the leaderboard contests or special events:</p>\n<ol><li>Telegram</li><li>Discord</li></ol>\n<p>Have fun!</p>", "metacritic": null, "released": "2023-02-28", "tba": false, "updated": "2023-03-03T15:20:40", "background_image": "https://media.rawg.io/media/screenshots/70b/70bcb57a5128b8e65e42b8d7b74c9f23.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MrLightspeed"], "genres": ["Action"], "publishers": [], "esrb_rating": null}