{"id": 935604, "slug": "mandria-card-adventure", "name": "Mandria: Card Adventure", "name_original": "Mandria: Card Adventure", "description": "<p>Mandria: Card Adventure is a relaxing fantasy game where you travel around beautiful world, collect herbal plants and defeat monsters.</p>\n<p>In this card fantasy game you complete levels by collecting herbal plants. You can move your hero on one of three next cards, choosing the way by your own. Just be aware of dangerous monsters and sharp spikes - they are going to deal a damage to your hero!\r\n<br/></p>\n<p>Some fantasy items can help you to complete levels. For example, health potion adds you one heart, while sword defeats all the monsters on your way. You can use fantasy boosters which will help you to complete levels faster.\r\n<br/></p>\n<p>Unlock all the heroes and test their skills in the fantasy game of Mandria! By the way, how many monsters can you defeat in the survival mode?\r\n<br/></p>\n<p>FEATURES</p>\n<ul><li>More than 100 levels</li><li> Survival mode to challenge yourself</li><li> Different card types such as monsters, plants and items</li><li>4 fantasy boosters that help you to complete levels faster</li><li> 6 heroes with unique skills</li><li> 1-3 minutes per level</li></ul>\n<p>CARD TYPES</p>\n<ul><li>Herbal Plant - the most important card. You need to collect certain plants to complete the level</li><li>Monster - dangerous fantasy creature. Attacks you if you stand close to them</li><li>Sharp Spikes - don't stand on them!</li><li>Health Potion - this card restores one of your hearts</li><li>Shield - this card prevents you from taking damage</li><li>Sword - the powerful card, that removes all the monsters on your way</li><li>Coin - a valuable card! Collect coins and buy fantasy boosters</li></ul>\n<p>Find us on Twitter: https://twitter.com/MatsurGames</p><p>This app uses free fantasy game music from chosic.com\r\n</p>\n<p>Haven of the Faeries by Darren Curtis https://www.darrencurtismusic.com/</p>\n<p>Now We Ride, Forest Walk and Adventure by Alexander Nakarada https://www.serpentsoundstudios.com</p>", "metacritic": null, "released": "2023-02-28", "tba": false, "updated": "2023-03-03T16:05:16", "background_image": "https://media.rawg.io/media/screenshots/28d/28d882cddbc29239a26026f90b165c19.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["MATSUR"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}