{"id": 93565, "slug": "cvrl-serenade-of-chaos", "name": "CvRL: Serenade of Chaos", "name_original": "CvRL: Serenade of Chaos", "description": "<p>The struggle between the Belmont and Dracula comes from distant times, the legacy of the vampire killers, armed with mystic weapons to protect mankind from the Dark Count, Dracula. Some years ago, it was the turn of Christopher Belmont, to take his place on the history of his family, and fight his fate on the castle of chaos. He emerged victorious, and the land was saved.<br/></p>\n<p>However, not much time after his victory over Castlevania, when his son, Solieyu, was ready to accept his fate as the new vampire killer, the forces of darkness struck again, and his son was abducted. Christopher had to fight through castles of different nature, and finally found his child transformed into a vicious demon. Again, he had to fight Dracula, whom still without his full power, died to the sacred whip.</p>\n<p>He came back with his son on his hands. The townspeople had his wounds attended, but there are wounds human medicine cannot cure... three days after returning safe and regaining his human shape, Solieyu fled to the mountains and forests, and never again came back.</p>\n<p>Not much happened for the next years, until one night, the moon turned blood, and the castle raised from the ashes, much before the time it was fated to; one by one the towns of the region fell to the wrath of the dark armies, as no one seemed to assume the responsibility of facing the count on his own castle. Christopher Belmont, which had become a renouned trainer, was feeling the weight of the years coming over him; still, he joined the most brave and skilled warriors he could and headed to Castlevania, the dwelling of chaos.</p>\n<p>One by one, his companions fell to the atrocities of the castle, their sacrifice being the only way to aid their master unto the only chance at sight to save mankind, finally, wounded and tired, he was for the third time in the same place he had been fifteen years ago; the vampire killer whip, which should have been in the hands of his son, gave him the last strengths to face Dracula again, and so, the final face-off began.</p>\n<p>The events that followed marked the start of a new age... Darkness swept the world, as all hopes seemed to be lost, and long forgotten Belmont bloodlines had to rise again and take their paths again to the cursed castle, the time has come for the future of mankind to be decided; the threads of fate are in your sword and in your heart.</p>\n<p><strong>Credits</strong><br/></p>\n<ul><li>Christopher Barrett: Project artist, graphic design, tiles</li><li>Jorge D. Fuentes, Nicholas, RPGFan, Tom Kim, JiLost: Castlevania Midis</li><li> Björn Bergström: Recursive Shadowcasting LOS algorithm</li></ul>", "metacritic": null, "released": "2018-02-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d2f/d2fff2ab3c815ee3d24b8ae54a60a038.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Slashie"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}