{"id": 93584, "slug": "my-life-c64", "name": "My Life (C64)", "name_original": "My Life (C64)", "description": "<p>\n</p>\n<p>\n<strong>** A NEW ARCADE GAME FOR THE COMMODORE 64 **</strong>\n</p>\n<p>\r\n\tFrom the team that brought you the smash Commodore 64 hit \r\n\t<strong>DARKNESS</strong> comes <strong>MY LIFE!</strong> Take control of Eugene, a hapless chappie, who has to work his way through a stressful week in order to earn a well-earned sleep-in at the weekend. Avoid all manner of meanies including vicious vacuum cleaners, rampaging roadsweepers, terrible toddlers, scary security guards and more as you stomp your way through each screen.\r\n</p>\n<p>\n</p>\n<p><strong>** MY LIFE STORY **</strong><br/></p>\n<p>\r\n\tEugene was a popular teenager, the girls loved him and the boys wanted to be like him. Over the years however, life has taken its toll on poor Eugene. His hair has done a runner and his waistline has expanded. Add to that his whole week revolves around a job he can't stand with a boss who hates him. Every weekday he has to wake up early and make his way to the office hoping he can find his keys, that his car will start and that he doesn't get a ticket from the evil security guards. Can you help Eugene stomp his way through the week so  he can finally get that friday feeling and have some nice late sleepins?\r\n</p>\n<p>\n</p>\n<p><strong>** MY LIFE FEATURES **</strong>\n</p>\n<p>• 20 screens to stomp your way through!\r\n</p>\n<p>\r\n\t• Tons of catchy tunes and arcade jingles!\r\n\t<br/>\n<br/>\r\n\t• Fantastic colourful cartoon graphics and detailed characters!\r\n\t<br/>\n<br/>\r\n\t• End scene - if you can reach it!\r\n\t<br/>\n</p>\n<p>• SD2IEC compatible!</p>\n<p>• NTSC version now available!<br/></p>\n<p>\n<br/>\n<br/>\n<br/>\n<strong>** MY LIFE CREDITS **</strong> </p>\n<p>GFX and Design by \r\n\t<strong>Trevor Storey</strong><br/></p>\n<p>\r\n\tCode by \r\n\t<strong>Achim Volkers</strong>\n</p>\n<p>\r\n\tMusic &amp; SFX by \r\n\t<strong>Saul Cross</strong>\n</p>\n<p>\r\n\tCover art and packaging designed by \r\n\t<strong>T</strong><strong>revor Storey</strong>\n</p>\n<p>\n</p>\n<p>\n<strong>** SYSTEM REQUIREMENTS **</strong>\n</p>\n<p>\n<strong>My Life</strong> is a game for the Commodore 64.  You can play the game in a C64 emulator (we recommend <strong>VICE</strong>) or you can port the game onto real C64 hardware if you have the resources to do so.  The download file features the .d64 (disk version), .tap (tape version) and .prg (c64 program files).\r\n</p>\n<p><strong>Note:</strong> If you are running the game in the VICE emulator you will need to enable TRUE DRIVE EMULATION on the options menu in order for the disk version to load and run correctly.<br/></p>\n<p><strong>Also Note: </strong>The cost of this purchase does NOT include VAT. The VAT will be added on during the checkout process, the amount of VAT varies depending on the VAT rates that apply to the country you are ordering from.<br/></p>", "metacritic": null, "released": "2016-08-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9ce/9ceaf17686537946cc635173bef11e25.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Psytronik Software"], "genres": ["Action"], "publishers": [], "esrb_rating": null}