{"id": 93588, "slug": "bullet-soul-hacker", "name": "Bullet Soul Hacker", "name_original": "Bullet Soul Hacker", "description": "<p><em>In the near future where corporate espionage has replaced rivalry between nations, corporate secrets are a popular target for many hackers. Among these, a new breed of AI melded into human consciousness has enabled these hackers to make a quick escape -- embedding their soul into their bullets, they can hack into the body of anyone they shoot. They are </em><em><strong>Bullet Soul Hackers.</strong></em></p><p><em><strong>\"</strong>Oozes with audiovisual style.....has a neat blend of mechanics\" --</em>IndieGames.com</p><p><strong>Core Mechanic:</strong></p><p>Shoot and kill enemies to speed your movement and to quickly transport into their bodies, taking control of their own weapons, strengths, weaknesses <strong><em>and memories</em></strong> as you race to the next checkpoint.</p><p><strong>Concept:</strong></p><p>Part shooter and a part checkpoint racer, <em>Bullet Soul Hacker </em>puts you in the shoes of an escaping hacker jumping from the vibrant skyline of a futuristic world that's decaying from within. An attempt to combine two diverse genres with a central mechanic which generates the rush of adrenaline common to both.</p><p>It is also part of my continuing attempts of <em><strong>humanizing enemies</strong></em> by whatever means possible <em>through </em>the mechanics. In <em>Bullet Soul Hacker</em>, the player is directly affected by whose body they take over by having to use their weapon, survive in their body (with their own strengths and weaknesses) and to battle the enemy's personal memories from distracting them.</p><p>It is also partly an attempt to convey a story combining cyberpunk's part <strong>pulp</strong> <strong>fiction</strong> and part <strong>philosophical nature</strong> and narrating it in a non-linear manner that complements its checkpoint structure and fits its themes.</p><p><strong>Features:</strong></p><ul><li>Fast paced shooting with focus on constant movement</li><li>Transporting <em>into </em>enemies' mind and body prevents the player from ever developing a comfort zone</li><li>Checkpoint racer with variety of dynamic challenges including racing rival hackers to next data point, escaping from authorities.</li><li>A heavy 80s inspired retro aesthetic with a stylized scanline look</li><li>Synthwave soundtrack injecting a moody energy into the game</li></ul><p><strong>Gameplay Instructions:</strong></p><p>Shoot the enemies to hack into their bodies. You will take over their weapons, but will also inherit their strengths and weaknesses. You will also have to contend with the enemy's own soul as it tries to distract you with its <strong>memories.</strong></p><p>Shooting enemies increases your ADRENALINE speeding up your overall movement and reflexes.</p><p>Gather data nodes at end of each horizontal run to piece in more puzzles of the story. Be quick though as there are rival hackers who want to get there before you.</p><p><strong>This features only the Arcade Mode for now. \"Story\" and \"Experimental\" Mode coming soon!</strong></p><p><strong>Music:</strong></p><p><strong>Clip Clip Clip (Main Battle Theme) by Sumanth</strong></p><p>https://soundcloud.com/templar165/clip-clip-clip</p><p><strong>Another Day in the Void (Intro Theme) by Ansh</strong></p><p>https://soundcloud.com/lightwarrior179/another-day...</p><p><strong>Credits:</strong></p><p>Developed by:</p><p>Ansh ( @lightnarcissus)</p><p><strong>Music by:</strong></p><p>Sumanth ( @templar165)</p><p>Ansh</p>", "metacritic": null, "released": "2014-03-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9e9/9e92ac24bf858108ea90a46e79152628.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ansh"], "genres": ["Shooter", "Platformer"], "publishers": [], "esrb_rating": null}