{"id": 935866, "slug": "stranded-on-a-deserted-island", "name": "Stranded on a Deserted Island", "name_original": "Stranded on a Deserted Island", "description": "<p><strong>Story:</strong></p>\n<p>You are stranded on a deserted island and you gotta find a way to escape it.</p>\n<p>Do it by dragging cards into other cards to find new resources and puzzle your way out!</p>\n<p><strong>Controls / Gameplay:</strong> <br/></p>\n<p>Click or touch and drag cards into other cards. Once a card is selected and has valid other cards inside it, you can press the button in the popup to do an interaction and get new cards.</p>\n<p>Get off the island to win the game.<br/></p>\n<p><strong>Dev notes:</strong><br/></p>\n<p>A few weeks ago I decided to spend a weekend making a simple game on my own so that I can finally upload something here and get my indie game making adventure started.<br/></p>\n<p>So I made a minimum viable product game on the weekend and spent the next few weeks polishing and adding content until it was all neatly playable from beginning to end.</p>\n<p>It has been fun and is getting me hyped to make some more simple games like this :D</p>\n<p>Game was made in Godot 3.5, all the art was made in Krita (except for base background images I got off Google, then edited) and the sound effects come from an old GameDev Market RPG Humble Bundle.<br/></p>\n<p>Feel free to leave any feedback in case you run into issues or have suggestions for future improvements. I may make some more card like games with similar mechanics in the future.</p>", "metacritic": null, "released": "2023-02-27", "tba": false, "updated": "2023-03-03T18:12:29", "background_image": "https://media.rawg.io/media/screenshots/acc/acce39a2208c36b5367c6c9e8527312f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["PowerOfSin"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}