{"id": 936277, "slug": "jinxed-tones", "name": "Jinxed Tones", "name_original": "Jinxed Tones", "description": "<p>Apprentice! Apprentice! It's a calamity! A horde of tone monsters have escaped from this tiny, magical, bricky artifact full of buttons. I would go after them, but my back is aching from my last Pilates session.</p>\n<p>To imprison each tone monster back into this bricky thing, you must use its buttons to play their favorite tune. Don't worry, I'll teach you all the songs you need to tame these ill behaved critters. But do it before they jump at your throat, these creatures are vicious!</p>\n<p>Use the <strong>NUMBER </strong>keys to enter the correct tune, and then the <strong>ENTER</strong> key to cast the tune spell. Easy enough, isn't it? Here are the monsters you will find in our magical laboratory:</p>\n<ul><li><strong>Goblins</strong>: these creatures don't care much for complex and tedious songs, they usually listen to Carioca Funk. Two tone keys should put them to rest.</li><li> <strong>Imps</strong>: argh, they are the worst! They don't stop drinking the alcoholic potions I have in the basement. No, they are not spirits, they are imps! Oh, you mean the potions? Well, anyway, three tones should calm these evil critters.</li><li><strong> Golems</strong>: don't even think about using the magical pokó balls to catch them, they won't work. Use the bricky artifact instead. Play a four tone spell to bring them back.</li><li> <strong>Gazers</strong>: these are the most powerful of the magical brick monsters. Their eye lasers can disintegrate you in seconds. A five tone spell is the only thing that can defeat it.</li></ul>", "metacritic": null, "released": "2023-02-27", "tba": false, "updated": "2023-03-03T21:16:30", "background_image": "https://media.rawg.io/media/screenshots/1ca/1caba80d29d3ade7a6741e20591315a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Rafaiska"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}