{"id": 93635, "slug": "you-are-worthless-a-video-game-where-nothing-happe", "name": "You Are Worthless: A Video Game Where Nothing Happens", "name_original": "You Are Worthless: A Video Game Where Nothing Happens", "description": "<p>*NEW MORE COLOURFUL \"#SLOWGAME JAM EDITION\" ADDED*</p><p>*PLAY WITH LARGE HEADPHONES FOR THE BEST EXPERIENCE*</p><p><strong>Summary:</strong></p><p>Many games put the player at the heart of the design, whether to serve them or to test them.</p><p>This is not that kind of game.</p><p>Forge your own path, utterly lost and crushingly alone through the stark and unfeeling void. Experience a glacial two hour long audiovisual journey inspired by the minimalist opera compositions of Philip Glass, featuring NASA's Public Domain Voyager 1 Planet Songs.</p><p>In other words, prepare to be hypnotised.</p><p><strong>Controls:</strong></p><ul><li>To Look<em>: </em>Mouse or Thumbstick(s)</li><li>To Walk: Either Mouse Click, Either Gamepad Shoulder Button or Trigger</li><li>To Quit: Esc, Ctrl, Alt or Delete</li></ul><p><strong>Rules:</strong></p><ul><li>Keep walking until you see the credits</li><li>Do not leave the game idle for more than twenty seconds, or else the screen will blink, fade to black and your avatar will be teleported back to the beginning of the game</li><li>In the \"#SlowGame Jam Edition\" of the game, this feature is not present; click to walk in a chosen direction without limits and your avatar will keep moving for a further 10 minutes.</li></ul><p><strong>IMPORTANT:</strong></p><ul><li>Holding down any of the walking buttons DOES NOT keep the teleport timer at bay despite the screen not fading to black.</li><li>Clicking both mouse buttons at once makes your avatar walk at twice the normal speed.</li></ul><p><strong>Credits:</strong></p><ul><li>Additional 3D Modelling: Krishna Dudhee of <em>Creative Kid</em></li><li>Additional Sound Design: William McKie of <em>Wicker Games</em></li></ul><p>READ MY RECENT POST-MORTEM ON THE GAME HERE: http://georgecheal.wixsite.com/bonsaitreehouse/wor...<br/></p>", "metacritic": null, "released": "2016-05-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3c7/3c77fdfe314e4d7d0cf52f48a3e870c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Bonsai Treehouse"], "genres": [], "publishers": [], "esrb_rating": null}