{"id": 936419, "slug": "muscle-milf", "name": "Muscle MILF", "name_original": "Muscle MILF", "description": "<p>When you&#39;re looking for a job, the #1 criteria is always: your boss must be smokin&#39; hot. That&#39;s how this guy ended up working at a construction site, lured in by the amazing body of the woman in charge. She may be a loud-mouth muscle-head, but the screenshots speak for themselves. This chick is stacked! making the 9-to-5 grind bearable. A glimpse of her perfect peach booty as she moves some heavy gear around, the way her huge rack obscenely jiggles at the slightest movement her well toned body makes, and let’s not forget her toned tummy; I&#39;m talking about the absolute artistry involved of whoever chiseled those abs on baby!<br />\nThe monotony of manual labor is finally broken one night as you&#39;re about to leave. Kirika needs your help for one last thing before you head home. Reluctantly you help her move some equipment into the storage shed for the night but in a &#39;lucky pervert&#39; moment, the likes of which here-to-fore unheard of, you both stumble over some loose cables among the mess and somehow Kirika finds herself in her underwear with you on top of her with your cock out! After she gets a taste of the power tool you&#39;re packing, Kirika is begging you to put in A LOT more overtime.<br />\nIt’s still manual labor technically, but how can you say no when it is your buff busty boss begging you to breed her!<br />\nTranslated version of the original Japanese Visual Novel<br />\nKirika is fully voiced with original Japanese dialogue!<br />\nOriginal artwork HD upscaled with 16:9 and 4:3 variants<br />\nHours of story content<br />\nAudio including music and special effects<br />\nEnhanced with character sprite animations<br />\nGallery and Scene selections<br />\n11 scenes of registered overtime work performing baby-making sex!<br />\nMuscle MILF Is the English localization of a Visual Novel originally created by prolific Japanese developer Miel. We at Cherry Kiss aim to provide an authentic Japanese Visual Novel experience to gamers outside of Japan.<br />\n<strong>PLEASE NOTE</strong><br />\nAll characters described and visually represented in this game are over 18 years of age, and no actual, nor identifiable minor was used in the production of this game.</p>", "metacritic": null, "released": "2023-03-03", "tba": false, "updated": "2023-03-06T12:23:00", "background_image": "https://media.rawg.io/media/games/a38/a38321c3c6994fac9aabdac167b4e32d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 419, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["miel"], "genres": ["Casual"], "publishers": ["Cherry Kiss Games"], "esrb_rating": null}