{"id": 93646, "slug": "card-witch-first-draw", "name": "CARD WITCH: First Draw!", "name_original": "CARD WITCH: First Draw!", "description": "<p><em><strong>Ms.Julia Morgan,</strong></em></p>\n<p><em>If I may be blunt with you for a moment – you are easily the least capable Morgan I have ever had the pleasure of serving. Your ability to grasp the mere concept of magic leaves much to be desired, and there is simply not enough time to teach them to you.</em></p>\n<p><em>But I don't need you to recite formula or facts. I require only two things: your impressive commitment to notes and your almost worrying thirst for violence.</em></p>\n<p><em>To get to the heart of the matter, it's time for you to learn how to fight. I've created a Pocket Dimension specifically for teaching you how to. As that show that you're oh-so-fond of may say, I am \"Sending my baby to Bootcamp.\"</em></p>\n<p><em>There are a number of tasks ahead of you. Before I bestow upon you the Morgan ceremonial weapon, <strong>The First Of Morgan Outstretches Her Palm And Within It She Draws The Breath Of Creation</strong>, I need to know that you understand how to use it.</em></p>\n<p><em>You will face a number of strange and aggressive enemies, such as...</em></p>\n<em>The wretched <strong>Imp</strong>, the captured spirit of construction made flesh...</em>\n<em>The <strong>Knightmare</strong>, a centaur demon who roams battlefields to feed on the bloodlust left behind...</em>\n<em>The <strong>Gunslave</strong>, a fusion of magic and technology, the answer to \"What if a wizard had a gun?\"...</em>\n<em>And the interloper, The <strong>Gehenhound</strong>, a familar of magma sent to bring you to justice.</em>\n<p><em>To aid you in this course, I have provided a number of challenges:</em></p>\n<ul>\n<li><strong>Trial by combat</strong>, where I will throw you into a random assortment of enemies to defeat.</li>\n<li><strong>My personal challenges</strong>, dedicated to teaching you how to harness your spell cards and use them efficently.</li>\n<li>And <strong>the gauntlet</strong>, a traditional endless run where you will fight until you cannot stand.</li>\n</ul>\n<p><em>Prove to me you have what it takes to challenge your kin, the Head of the House of Morgan. Show me what you're made of, Julia.<br/></em></p>\n<p><em>Sincerely,</em></p>\n<p><em><strong>By Which Morgan's Kin May Seize The Future So Tightly, Even The End Of Days May Loosen Their Grip <br/></strong></em></p>\n<p><em>Now, for a moment, I will speak to those whom are viewing us from outside our dimension. Pay them no mind.<br/></em></p>\n<p>Hello. This is <strong><em>Card Witch: First Draw!</em></strong>, a pre-alpha combat simulator inspired by <em>Mega Man Battle Network</em>. This is an unfinished demonstration build, meant to show off the core combat that will be seen in the full game. \r\n<br/>\n</p><p><strong><em>Please note that we currently do not have any sort of tentative release date for Card Witch. Additionally, we do not guarantee an update schedule for this prototype, as we are currently focused on building the full game.</em></strong></p>\n<br/>Regardless of the level of completion of the project, we hope you have a wonderful time with it.\r\n<p>If the above was too dense to read, I'll break down what you get with this very quickly:</p>\n<ul>\n<li><strong>Simple controls:</strong> Movement is done with the arrow keys. Z fires First Draw, and X uses the card in your hand. Press ENTER to open up the card menu and draw a hand.</li><li><strong>Vibrant and large pixel art style: </strong>Designed at a 720p native resolution, every sprite is naturally high resolution, hand-crafted, and popping with details and colors mixed with expressive character animations. A blend of low poly 3D aesthetic lends a certain \"nostalgia\" with the modernized pixel art.</li><li><strong>Combat Simulator:</strong> You control Julia Morgan in a real time card battle rpg and face a multitude of enemy sets. Build your deck and have fun experimenting with all the mechanics we have in store for you</li>\n<li><strong>Deck Builder:</strong> Your deck is your main weapon, so it should reflect how you wish to play. Create a collection of cards up to 30 cards such as Vice Whip and Flame Blade and kill you some monsters.</li>\n<li><strong>Challenge Mode:</strong> Included is a challenge mode that's equal parts tutorial and equal parts built to push you to the limit. Not only that, your performance is scored! Try to shoot for the top!</li>\n</ul>\n<p>This demo is completely free -- you only have to offer a donation if you wish to support the project! Every contribution helps us bring the full <strong><em>Card Witch</em></strong> RPG experience and development process going. <br/></p>\n<p>Additionally, feel free to subscribe to our patreon, and twitch where we do live art and dev work of the game and bring it to life before your eyes.</p>\n<p>Thank you so much for coming to check this out, and we can't wait to show you even more as we move ever forward.<br/><br/><br/><br/>Written and designed by <strong>Robert Moore</strong> -- @bloodyhoney_<br/></p><p>Artwork, character designs, and animation by <strong>natasha dawn charlene excelsia</strong> -- @CHARLENEMAXIMUM<br/></p><p>Programming by <strong>Jesse B</strong> -- @SuperBlizzard</p><p>Music by <strong>Iris Merril</strong> -- @ghoulpowder<br/></p>", "metacritic": null, "released": "2017-12-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b7e/b7e2400a4242141b159446ff064ccc2d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["alpha six productions", "natasha dawn thomas"], "genres": ["Action"], "publishers": [], "esrb_rating": null}