{"id": 936449, "slug": "tune-in-to-the-show", "name": "Tune in to the show", "name_original": "Tune in to the show", "description": "<p>Congratulations! You&#39;ve been accepted as a participant in a new TV show! You&#39;ll be living with 7 strangers for a month and romance is strongly encouraged!<br />\nTune in to the show is an adult visual novel that focuses on the characters, story, romance, and sex. At the same time, it doesn&#39;t take itself too seriously. Apart from the very first one, all of the sex scenes in the game can be avoided with specific dialogue options, so you can choose if you want to romance all of the love interests, just one of them, or any combination at all. HINT: The game won&#39;t punish you for pursuing all of the ladies ;)<br />\nWhen the game is released in Early Access, it&#39;ll feature:<br />\napproximately 6 hours of playtime<br />\nover 2,000 renders<br />\naround 20 animations<br />\n28 Steam achievements<br />\naround 50 music tracks.<br />\nThe size of the game will keep on growing with each new update. The goal is to release a new big update every 3 months.<br />\nThe setting of a TV show makes it easier for you to get to know all of the lovely participants as you&#39;ll get paired up with them for various missions throughout the month. Sounds almost too good to be true? Well, thinking about it, some things about this show are pretty suspicious, aren&#39;t they? You might want to look into that.</p>", "metacritic": null, "released": "2023-03-03", "tba": false, "updated": "2023-03-06T12:19:53", "background_image": "https://media.rawg.io/media/games/fd2/fd21ab5ccb31599badd3b71e7dcabfa8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 452, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["RobertDeadth Games"], "genres": ["Indie"], "publishers": ["RobertDeadth Games"], "esrb_rating": null}