{"id": 93649, "slug": "vapormaze", "name": "ｖａｐｏｒｍａｚｅ", "name_original": "ｖａｐｏｒｍａｚｅ", "description": "<p><strong>CONCEPT: </strong></p>\n<p>    ｖａｐｏｒｍａｚｅ is a critic to the vanity of certain aspects of modern life, represented using a maze. A 3D illustration about frustration, sadness and nostalgy induced by our consumerism culture. </p>\n<p>    The game takes you through mazes filled with robots to kill and itens you can buy and sell. You will feel lost and frustated while looking for your way out. In each maze level, Helios will share his knowledge in the form of lyrics from famous songs that have similar ideas. Maybe you can reflect about them and find a meaning while wandering the corridors. Or maybe not. <br/>    </p>\n<p><strong>EARLY ACCESS: </strong>\n</p>\n<p>    The game is currently on early access for bug detection and balance/gameplay improvements.  Let me know if you have any issues or suggestions.</p>\n<p><strong>GAMEPLAY: </strong></p>\n<p>    ｖａｐｏｒｍａｚｅ is a roguelike shooter in a vaporwavey maze. To escape, you have to manage your ammo, your health and itens, with your Vapetron, while shooting and blowing up bad robots.</p>\n<p><strong>FEATURES: </strong></p>\n<p><strong>Seven Procedurally Generated Mazes:</strong> As you get deeper and deeper on the Vapormaze, the mazes get bigger and more complex. New mazes are generated every playthrough.</p>\n<p><strong>Eletric Pistol:</strong> You have to manage your ammo (batteries) while shooting. As the energy is depleted, the projectiles will shoot at slower speeds and eventually stop.<br/><br/><br/><strong>Hook Gun:</strong> Your own personal HookGun™ that hooks on almost everything and allows you to throw stuff out of the way. Hold it to charge, then release to grab.<br/><br/><br/><strong>Bad Robots:</strong> Face robotic enemies that will try to kill you. Different robot types behave differently and try to kill you in different ways.<br/><br/><br/><strong>Vapetron:</strong> He will follow you around, and is the only way to carry items. You must manually place them onto your Vapetron with the Hook Gun. <br/><br/><br/><strong>Shops and Banks:</strong> Death is permanent. But the money on your bank and acquired ability upgrades will persist. Sell the items you find around for money. Buy batteries, health kits and upgrades to help on your journey. <br/><br/><br/><strong>Meaningful Decisions:</strong> There is a limited amount of resources. If you misjudge which items will be useful for your playthrough, things are gonna get complicated.</p>\n<p><strong>Awesome Soundtrack:</strong> Some of the finest beats crafted by Home and Windows96.<br/></p>\n<p><strong>Helios Himself:</strong> Not really, it is just a statue. He says interesting things though.</p>", "metacritic": null, "released": "2017-09-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a4a/a4a148b6caf9079e99a2d5a73d9b373e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Akuno"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}