{"id": 936410, "slug": "dragonheir-silent-gods", "name": "Dragonheir: Silent Gods", "name_original": "Dragonheir: Silent Gods", "description": "Before the world can end its crusade against the evil Dragon God, arrogance has brought immense loss and taken away this warrior, whose soul is now forever trapped in chaos... <br/><br/>How did he wind up stranded in the black mist? The Chaos Universum brims with confusion and uncertainty...<br/><br/>Situated at the limits of the Palace Entropica, it is the only passage from Chaos Universum to the Main Material Plane. Its existence is little known, and only a select few can see the hidden gate of the Palace Entropica at certain hours of the day.<br/><br/>If you see the gate, please remember this - <br/>Face the Palace head-on, devote yourself to the truth, and you will gain the power to travel across planes.<br/><br/><br/><br/><br/><br/>Dragonheir: Silent Gods is a game that lets you explore a world of magic and dragons at your own pace. You can travel across different biomes, from frozen lands to volcanic regions, and discover hidden secrets, ancient ruins, and mysterious artifacts. You can also encounter various puzzles, enemies, and allies that will challenge your skills and creativity. You can use dice to influence your actions, such as stealing, trading, fighting, or persuading. The game features a branching story that adapts to your choices and actions, making every exploration unique and cinematic. Whether you want to save the world from the evil dragon queen Tiamat, or just enjoy the freedom of exploration, Dragonheir: Silent Gods offers you a rich and immersive experience.<br/><br/><br/><br/><br/><br/>Dragonheir: Silent Gods is an epic adventure that you can shape as you wish. The game features a dynamic story that changes based on your decisions and actions. You can influence the fate of the world and its inhabitants, and create your own legend.  The game features dice-based gameplay that adds randomness and excitement to every situation. The dice will also affect the story and the consequences of your choices. Sometimes you may get lucky and roll a critical success; other times you may face a critical failure and have to deal with the aftermath. The dice add an element of randomness and excitement to the game, making every playthrough different and unpredictable.<br/><br/><br/><br/><br/><br/>You can collect over 200 different heroes with over one million options for how to build them. You can find heroes from various races and classes, such as Iskallan Dwarves, Death Knights, Orcs, Plain Humans, Dark Elves, Sorcerers, Knights, Undead, and many more. You can also join forces with legendary heroes from different planes. You can customize your heroes with equipment, runes, and divine artifacts. You can also upgrade your heroes with ascension materials that you can obtain from defeating powerful dragons. Dragonheir: Silent Gods is an epic adventure that you can enjoy with your own team of heroes.<br/><br/><br/><br/><br/><br/>Dragonheir: Silent Gods features an innovative semi-real-time combat system that combines elements of strategy, grid placement, and dice checking. You can customize your team of heroes with different skills, equipment, runes, and divine artifacts. You can also position your heroes on a grid to take advantage of their strengths and weaknesses. Before the battle starts, you can also check the elements of your heroes and enemies, and choose the best combination to deal more damage or resist more attacks. During the battle, you can choose when to attack or defend, push forward or retreat. You will also have to roll dice to determine the success or failure of your actions, as well as the damage and effects you deal or receive. The battle mode will challenge your skills and creativity.", "metacritic": null, "released": null, "tba": true, "updated": "2024-02-16T15:41:07", "background_image": "https://media.rawg.io/media/screenshots/048/0489b9aa59bc10252bb9411cdf3e2d57.jpg", "website": "https://dragonheir.nvsgames.com/?utm_source=Steam", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 7, "owned": 65, "dropped": 1, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 503, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "PC"], "developers": ["SGRA Studio", "Nuverse Games"], "genres": ["Adventure", "RPG", "Strategy", "Massively Multiplayer"], "publishers": ["Nuverse"], "esrb_rating": "Teen"}