{"id": 93642, "slug": "stoneback-prehistory-itch", "name": "StoneBack | Prehistory (itch)", "name_original": "StoneBack | Prehistory (itch)", "description": "<p>Immerse yourself in prehistoric world of adventures and dangers! </p>\n<p>Survive in this world is not so easy, you need follow these points:<br/>◄ World of StoneBack ► <br/>The world in StoneBack fully randomly generated, and endless in all directions. You can walk wherever you want, no any borders.</p>\n<p>◄ Food ► <br/>First of all, take care of the food. In this world working Only one rule - \"You or kill, or die\". Be always ready to next hunting. </p>\n<p>◄ Dinosaurs ► <br/>In this world, you are not alone, so be careful. Some dinosaurs are not aggressive, and they will not touching you, some becomes aggressive just when you will be close to their nests, on some you will be able to ride. Anyway you must be careful.</p>\n<p>◄ Night ► <br/>Nights in this world are very dark, so don't forget about torch, to stay alive in your first night. But night is not such terrible time as it seems. At Night you need try to steal so much eggs how it possible, while all dinosaurs sleeping. Good Luck with that ;)</p>\n<p>◄ Object creations► <br/>In the prehistoric world all tools and weapons was handmade. You, like a little part of prehistoric world, must create all by your hands. You should collect objects to create a lot of different weapons and tools. <br/>But do not forget, every tool and weapon have durability, don't forget about it.</p>\n<p>◄ Quests ► <br/>In this huge world, you can meet wanderers who will be able to give you Quests, but to doing that or not, that's your choice. But if you successfully completed the quest, you will get a good reward!</p>", "metacritic": null, "released": "2017-08-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0ac/0ac68e36a748daebc82952d4dbbbd471.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BUG-Studio"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}