{"id": 936557, "slug": "abuelas-space-bistro", "name": "Abuela's Space Bistro", "name_original": "Abuela's Space Bistro", "description": "⚠️ Please  close the error's box by pressing the Close button that is under the Credits. Other than that, the game works fine.<br/><br/><br/><br/>As life in Cuba became tough, Iaia would look up at the night sky and dream of flying away to somewhere safe where she could spend time with her family. Although she never made it to interstellar space, she found safety and community when she moved to Spain and opened a restaurant. Because the restaurant became her escape, she named it “Abuela’s Space Bistro.”<br/><br/>Iaia gave everything she could to the restaurant to support her family and community. She always made sure that her friends and customers were well-fed and taken care of. She would often share her secret recipes with her assistant Juan and even with her colleagues, despite the increased competition. Iaia would also bring homemade meals for her grandchildren and spend time teaching them how to cook. Generations of Iaia’s family worked at the restaurant, keeping her dream of a peaceful escape alive.<br/>\n\n<p>Your objective in the game is to serve the ordered food as fast as possible, and in the right order, so the customers won't have to wait too long.<br/></p>\n<ul><li>WASD (or ZQSD for French Keyboards)  to move</li><li>Move close to the customers to see what they are ordering.</li><li>Go to the kitchen (order here sign), then select a dish for you customer :)</li></ul>\n\n\r\nGonzako | Code and Game DesignHarrison Davis | Sound, MusicNielisson | Art and Game Design", "metacritic": null, "released": "2023-03-05", "tba": false, "updated": "2023-03-06T06:06:34", "background_image": "https://media.rawg.io/media/screenshots/910/9109df38657bff9f4a0ae90f71b2dca1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["nielisson", "Gonzako", "Hdavis"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}