{"id": 936562, "slug": "wriggle", "name": "Wriggle", "name_original": "Wriggle", "description": "<p>In this 2D platformer game, players take on the role of a small, wriggling worm traversing through a desolate and mysterious world. With a heavy emphasis on movement-based gameplay, players must use their platforming skills to explore the game's interconnected environments, slowly unlocking new abilities that allow them to access previously inaccessible areas. The game's aesthetic is moody and atmospheric, with dark and foreboding visuals and haunting ambient music. Throughout their journey, players will encounter a variety of strange locations. Along the way, players can interact with various NPCs who provide hints and clues to the game's underlying lore and story. With a challenging boss fight and a vast, interconnected world to explore, players will find themselves completely immersed in this haunting and unforgettable adventure.<br/></p>\n\n<p>How To Play:</p>\n<p>A and D - Movement</p>\n<p>Space - Jump</p>\n<p>Space x2 - Double Jump <strong>(After unlock)</strong></p>\n<p>WASD + LMB - Dash <strong>(After unlock)</strong></p>\n<p>Shift + WASD + LMB - Phase through walls (*IMPORTANT* - Only RED walls - not said in game) <strong>(After unlock)</strong></p>\n<p>Shift - Grab onto wall (W and S to climb up and slide down while grabbing)</p><p>ESC - Pause</p>\n\n<p>Created by: Andrew Yu, Raghav Iyer, Anish Jupudy, Siddharth Germila, Cecilia Romero</p>", "metacritic": null, "released": "2023-03-05", "tba": false, "updated": "2023-03-06T06:08:46", "background_image": "https://media.rawg.io/media/screenshots/2d9/2d956463b2ee447d36a178161ec529dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SirQuackyy"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}