{"id": 936893, "slug": "last-card", "name": "Last Card", "name_original": "Last Card", "description": "Pitch\r\n<p><strong>Last Card</strong> est avant tout un jeu de <strong>Deck Building </strong>à <strong>2 joueurs en local</strong>, chaque joueur pourra choisir une carte <strong>chacun leur tour</strong>, parmi plusieurs, disposées dans un <strong>carrousel</strong> où, pressé par un <strong>minuteur</strong> qui ne fera que diminuer pendant leur réflexion, ils devront construire leur deck pour un <strong>dernier combat</strong> où les esprit s'affronteront en<strong> duel</strong> jusqu'à qu'un des <strong>2 deck se vide</strong>, faisant<strong> gagner l’adversaire</strong>.</p>\r\nPlus en Détails\r\nPhase de Pick\r\n<p>Lors de votre tour, vous devrez construire votre deck en choisissant l'une des cartes du carrousel devant vous. Cependant, seules les cartes présentes dans le halo lumineux seront sélectionnables, il vous faudra donc choisir entre prendre une carte disponible ou attendre qu'une carte qui vous intéresse passe dans ce halo. Malheureusement pour vous, votre temps est limité, vous n'avez en effet qu'un total d'une minute pour compléter votre deck.</p>\r\nPhase de Combat\r\n<p>Apres la Phase de Pick, les decks nouvellement formés se mélangent et commencent une bataille automatique entre vos cartes et celle de votre adversaire.</p>\n<p>Chaque carte possède une valeur de puissance et un élément. Ainsi une puissance de 10 gagne contre une puissance de 4 et 4 gagne contre 2. Peu importe les valeurs, la valeur de puissance du gagnant est soustraite par la valeur de puissance du perdant. ainsi 10 baisse à 6 et le 4 à 2. Afin d'ajouter un aspect stratégique, un triptyque d'élément est mise en place : Feu, Eau, Plante. Par conséquent, si l'élément de votre carte bat celle de votre adversaire (Feu &gt; Plante, Eau &gt; Feu et Plante &gt; Eau) votre puissance pour se combat est multiplié par 1.5. </p>\n<p>/!\\ Attention /!\\ Le bonus à la puissance conféré par les éléments n'affecte que l'attaque de cette carte, et non sa vie restante. (Un exemple illustrant cela est présent dans la prochaine partie</p>\n<em>Exemples</em>\n<p><em>10F vs 5P :<br/></em><em>F a un l'avantage contre P. La puissance de la carte passe à 15.<br/>Le combat équivaut donc à 15F vs 5P.<br/></em><em>5P perd.<br/>10F est soustrait par la valeur de 5P, elle passe donc à 5F. (Ici, le bonus de puissance de 10F n'intervient pas dans le calcul)</em></p>\n<p>10F vs 6E :<br/><em>E a l'avantage contre F. La puissance de la carte passe à 9.<br/></em><em>Le combat équivaut donc à 10F vs 9E<br/></em><em>9E perd.<br/>10F est soustrait par  la valeur de 9E, elle passe donc à 1F. (Ici, le bonus de puissance de 9E intervient dans le calcul étant donné que c'est un calcul d'attaque)</em></p>\n<p>Une fois qu'une carte sort victorieuse d'un combat, elle retourne en bas du deck et ne retourne au combat que lorsque son tour vient à nouveau. Ce schéma se répète jusqu'à ce que le deck de l'un des deux joueurs soit vide. Le joueur restant gagne donc la partie.</p>\r\n/!\\ Disclaimer /!\\\r\n<p>En raison de sa réalisation lors d'une Game Jam et de choix de production aucun équilibrage n'a été fait, les valeurs des cartes ont été choisies arbitrairement.</p>\n\n<p>Présentation:<br/><br/>https://docs.google.com/presentation/d/1AF_-zI4VzQuGfs8fQqd00kEdDjvU8i-zdPcCnu4C...</p>", "metacritic": null, "released": "2023-03-05", "tba": false, "updated": "2023-03-06T08:31:47", "background_image": "https://media.rawg.io/media/screenshots/4e8/4e83f1df187be015f45a4032be823631.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Clawisse", "stromineur", "Samozar", "Grorian", "Jean Fontaine"], "genres": [], "publishers": [], "esrb_rating": null}