{"id": 936965, "slug": "particle-system-buildbox-3", "name": "Particle System Buildbox 3", "name_original": "Particle System Buildbox 3", "description": "Thanks. I really hope bb3 gets a particle emitter soon.\r\n<p>I've seen this way too much in the past years so... without further ado... The particle System node for Buildbox 3 is here.</p>\n<p>This node allows you to make <strong>2D</strong> and some <strong>3D</strong>, particle systems using the well-known attributes list of BB2 with some improvements</p>\n\r\nWhat do you get?\r\n<p>A new BBnode with a lot of options will allow you to create different types of particle effects. This is limited by your imagination :)</p>\n\r\nHow does it work?\r\n<p>The system makes objects with animation node inside that's controlled dynamically based on the player's setup.</p>\n\r\nAttributes what does each attribute do?\r\n\r\n--- Transform ---\r\nPosition\r\n<p>\n</p>\n<p>The position of the initial Transofm (aka particle system). The right side values are variance values that will apply + &amp; - to the set value (values on the left)</p>\r\nRotation\r\n<p>\n</p>\n<p>The rotation of the initial Transofm (aka particle system). </p>\r\nEmitter Visible\r\n<p>\n</p>\n<p>Flag that marks if the initial Transofm (aka particle system) is visible or not.</p>\r\nScale\r\n<p>\n</p>\n<p>The scale of the initial Transofm (aka particle system). This can be used to set or modify the initial scale of the particles that are spawned</p>\n\r\n--- Particle ---\r\nParticle\r\n<p>\n</p>\n<p>Empty Asset that has or does not have a Animation node inside that's used as \"host\" to move the particle</p>\r\nOverride Texture\r\n<p>\n</p>\n<p>Flag that's used to override the actual texture of the asset. This us useful to spawn explosions or other sequenced particles</p>\r\nTexture\r\n\n<p>\n</p>\n<p>Animation image/sequence of images that are used on every single particle that the particle system spawns.</p>\r\nFace Camera\r\n<p>\n</p>\n<p>Flag that's used to make the particle to always face the camera.</p>\r\nLoop\r\n<p>\n</p>\n<p>Flag that's used to loop the animation sequence on every cycle, this works in combination with the Override Texture flag.</p>\n\r\n--- Properties ---\r\n\r\nParticle Position\r\n\r\n<p>\n</p>\n<p>The position of the particle that will be spawned for x y &amp; z. Note that the leftmost inputs are variance inputs and they are used to spawn in +/- 10 spawn range.</p>\r\nTotal Particles\r\n\r\n<p>\n</p>\n<p>The total amount of particles that the particle system will spawn. </p>\n<p><strong>Note: </strong>Depending on the spawn rate aka Particles / frame this number will be spawned at once or over time.<br/></p>\r\nParticles / Frame\r\n\r\n<p>\n</p>\n<p>The number of particles that will be spawned per frame / every second.</p>\n<p><strong>Note: </strong>For radial spawns like nova-like effects or blood this has to be greater than <strong>Total Particle</strong> attribute.</p>\r\nStart Size\r\n\r\n<p>\n</p>\n<p>The start size of each particle that's spawned. The right side value is the variance that will apply + &amp; - to the set value (value on the left)\r\n</p>\n<p><strong>Note: </strong>In the above example the particles can have between 15 and 45 sizes and they are random on each spawning cycle.</p>\r\nEnd Size\r\n\r\n<p>\n</p>\n<p>The end size of each particle that's spawned. The right side value is the variance that will apply + &amp; - to the set value (value on the left)</p>\n<p><strong>Note: </strong> Based on Start size, the particle will go from Start Size -&gt; End Size over it's Life cycle (Life attribute) this is a linear transition that happens each Spawning cycle.\r\n</p>\r\nStart Spin\r\n\r\n<p>\n</p>\n<p>The initial angle that the particle has on spawn. The right side value is the variance that will apply + &amp; - to the set value (value on the left)\r\n</p>\r\nEnd Spin\r\n\r\n<p>\n</p>\n<p>The end angle that the particle has on the end of the spawn cycle. The right side value is the variance that will apply + &amp; - to the set value (value on the left)</p>\n<p><strong>Note: </strong>Same as Size attributes the end spin attributes help the particles to spin a specific amount of angles over the life span (Life Attribute)</p>\r\nGravity\r\n\r\n<p>\n</p>\n<p>The gravity attribute is used to apply gravity on each particle over time. This can go up (if the value is greater than 0) or down (if is less than zero).</p>\r\nRadial Acceleration\r\n\r\n<p>\n</p>\n<p><strong>Radial acceleration</strong> is how much acceleration away from the point of emission is given to the particle.\r\n</p>\r\nSpeed\r\n\r\n<p>\n</p>\n<p>The initial speed that the particle has on spawn. The right side value is the variance that will apply + &amp; - to the set value (value on the left)</p>\r\nAngle\r\n\r\n<p>\n</p>\n<p>The initial angle arch/direction of travel that the particles will be spawned and move at. The right side value is the variance that will apply + &amp; - to the set value (value on the left)</p>\n<p><strong>Note: </strong>Setting its variance to 460 means that the particles can be spawned and move in 360 degrees angles.</p>\r\nLife\r\n<p>\n</p>\n<p>Life is the life span of the particle before the end of the cycle. Cycle = a sequence of effects applied to the particle before it resets to its initial spawned position. The right side value is the variance that will apply + &amp; - to the set value (value on the left)</p>\r\nStart Color\r\n<p>\n</p>\n<p>The color that the particle has on spawn.</p>\r\nEnd Color\r\n<p>\n</p>\n<p>The end color that the particle has before it resets. As mentioned before the script will transition between Start &amp; End colors over the particle's lifetime. </p>\r\nPosition Type\r\n<p>\n</p>\n<p>Position type of the particles that can be:<br/></p>\n<ul><li><strong>Grouped:</strong> - Particles move with the initial transform in a group (good for portal effects or rain/snowfall)</li><li><strong>Relative</strong> - Particles move independently based on the transform's position (good for rocket thruster, or movement dust particles on a platformer game)</li></ul>\r\nRandom Color\r\n<p>\n</p>\n<p>Random Color that's applied in a different type of cases:</p>\n<ul><li>None: No random color will be applied</li><li>On Start: A random color will be applied at the start of each particle cycle</li><li>On End: A random color will be applied at the end of each particle cycle</li><li>Start &amp; End: A random color will be applied on the start and end of each particle cycle</li></ul>\n<p><strong>Note:</strong> This will override the Start Color / End Color attributes but not the alpha, so if you want to have transparent colors you can set the alpha to 50% and apply random colors having a blend effect on your particle system</p>\r\nDemo / preview?", "metacritic": null, "released": "2023-03-05", "tba": false, "updated": "2023-03-06T09:10:28", "background_image": "https://media.rawg.io/media/screenshots/5b0/5b097d13517803e4d1da40ccee81c35a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vlad NY"], "genres": [], "publishers": [], "esrb_rating": null}