{"id": 93692, "slug": "you-were-made-for-loneliness", "name": "You Were Made for Loneliness", "name_original": "You Were Made for Loneliness", "description": "<p>It's the future. The remnants of humanity, in the aftermath of a \r\ncataclysmic event known only as The Fall, have fled a dying homeworld to\r\n seek refuge among the colonies of the solar system.</p><p>Twenty years later in a small pawnshop on Callisto, an android is \r\nwaking up from a deep slumber. Within her, long faded memories shine to \r\nlife once more.</p><p><em>You Were Made for Loneliness</em> is a love story created by Tsukareta, a small team of writers and artists.</p><p><strong>Trigger Warning: suicide, depression, and psychological abuse are themes explored in <em>YWMFL</em>.</strong></p><p>Tsukareta is:</p><p><strong>Rollin Bishop</strong> <strong>(writer)</strong> is a doodler of words living in Austin, TX. He currently serves as Contributing Editor at Laughing Squid, and often posts inane ramblings on Twitter.</p><p><strong>Lillian Cohen-Moore (writer)</strong> is a tiny spooky wizard who writes, plays, reviews, and breaks games. She is also a writer, editor and journalist. Website: www.lilliancohenmoore.com</p><p><strong>Cameron Cook</strong> <strong>(writer)</strong> is a writer, \r\nfilmmaker, and teacher from South Carolina. He releases a new short film\r\n every other month, along with a new short story in the months between. \r\n You can find him on Twitter.</p><p><strong>Bryant Francis (writer)</strong> is a writer and madman who \r\nwas once ordered to gaze into the eye of the internet and behold its \r\nmajesty. He's never been quite the same since. Obsessed with giant \r\nrobots, he has a tendency to cackle to himself while he works and was \r\nhonestly a little shocked to find himself helping to write a game about \r\nlove. You can read and watch more of his work here, and you can chat with him on Twitter as well.</p><p><strong>Sidney Fussell</strong> <strong>(writer)</strong> is a writer, warlock and recovering misanthropist exploring race and identity in games. He mostly tweets about food. Mostly.</p><p><strong>Richard Goodness (coder/writer)</strong> is a Brooklyn-based \r\nwriter and musician. In addition to writing the Twines “Sam And Leo Go \r\nTo The Bodega\", “The Richard Goodness Trilogy\", and “TWEEZER\", he \r\ncurated the 2014 Fear of Twine Exhibition. His current project, Zest, is\r\n a management simulator. (@richardgoodness, richardgoodness.wordpress.com)</p><p><strong>Javy Gwaltney (designer/editor/writer)</strong> devotes his \r\ntime to writing about these video game things when he isn't teaching or \r\ncobbling together a novel. You can follow the trail of pizza crumbs to \r\nhis Twitter.</p><p><strong>Jon Hamlin (writer)</strong> is a writer of words, former \r\nstudent of history, politics, and language, and compulsive player of \r\nvideo games. He writes poetry, play sketches, short fiction, and video \r\ngame and cultural criticism regularly. He lives in the San Francisco Bay\r\n Area with his partner. @WordsmithJon</p><p><strong>Kitty Horrorshow (writer)</strong> is a genderfluid birdwitch whose passions are writing, horror, curses, bones, houses, and nonphysical spaces.  http://kittyhorrorshow.wordpress.com / @kittyhorrorshow / http://kittyhorrorshow.tumblr.com</p><p><strong>Patrick Lindsey</strong> <strong>(editor)</strong> is a \r\nBoston-based game critic and occasional developer-type person. He \r\nco-hosts the Indie MEGAcast podcast and won't shut up about DOOM or Far \r\nCry 2. He reluctantly claims responsibility for what you'll find on \r\nTwitter @HanFreakinSolo.</p><p><strong>Tony Perriello (writer) </strong>Tony makes games sometimes and blogs never, you can find him at http://tonyperriello.com.</p><p><strong>Marc Price</strong> <strong>(writer)</strong> is glad the NBA playoffs are over so he can sleep again. He writes about basketball videogames for Goodgamebro.com. You can find his tweets about food and games here.</p><p><strong>Elizabeth Simins</strong><strong> (illustrator)</strong> is an artist &amp; illustrator living in New York. She makes comics primarily about games, but also sometimes about other things. Her work appears regularly on Kotaku, irregularly elsewhere, and unceasingly on her twitter.</p><p><strong>Zoya Street (writer)</strong> is a game design historian and \r\ncritic. He runs ezine Memory Insufficient, co-organised Critical \r\nProximity conference, and is the author of Dreamcast Worlds.</p><p><strong>Kaitlin Tremblay (writer)</strong> is an editor, a writer, \r\nand a fledgling game-maker. Kaitlin makes horror games focused on \r\nfeminism and mental health. She has a Master's in English and Film, \r\nSpecialization in Gender and Genre, and can be found on Twitter ranting \r\nabout Godzilla.</p><p><strong>Stephen Wilds (writer) </strong>can be found somewhere in the\r\n shade down in the dirty South, writing about video games, comics, \r\nwrestling, and he even finds time for some fiction in between tacos. His\r\n work is located at www.CultureMass.com, www.BlankManInc.com, and hidden on one hundred and one different USB drives cleverly scattered across the state of Georgia.</p><p><strong>Nina White (writing as Ashton Raze)</strong> is a co-founder \r\nof Owl Cave Games, creators of Richard &amp; Alice and Sepulchre. She \r\nused to work as a journalist for The Telegraph, GameSpot and others. Now\r\n she can be found writing various adventure games for Owl Cave, as well \r\nas the hugely successful universe sandbox game, Starbound. Nina is also a\r\n novelist, with 2012′s Bright Lights &amp; Glass Houses being her first \r\nrelease. New books are in the works! Which is good.</p>", "metacritic": null, "released": "2014-06-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/67d/67d03b104cd5c9b93bf64e2934031bf9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Javy Gwaltney"], "genres": [], "publishers": [], "esrb_rating": null}