{"id": 93708, "slug": "scrap-riders", "name": "Scrap Riders", "name_original": "Scrap Riders", "description": "<p>KEYBOARD CONTROLS<br />\nUse WASD as arrow keys and K-&gt; Submit // The rest of the controls will be explained in the game<br />\nScrap Riders is a pixelart adventure game suited in a cyberpunk future.<br />\nExperience the life of RAST, a member of the Scrap Riders Motorcycle Club. Meet the people who live in the big cities controlled by the corporations and act as a smuggler to survive in the wastelands.<br />\nThe world of the future is a cruel place where only the powerful have privileges. To be free you have to live in the wastelands, and there, there are no resources.<br />\nMeet the members of your gang, talk to the inhabitants of the cities and get rid of the rival gangs and the corrupt police to carry out the missions that will make you important in your gang.<br />\nDrive your motorcycle and fight on the road for the survival of your gang. Discover and uncover the conspiracy that is behind the cargo thefts, but above all, BE A TOUGH GUY.<br />\n-’Old-school’ adventure.<br />\n-Wild humor.<br />\n-’Beat-em-up’ style action, between investigation and adventure.<br />\n-Deep story, with a profound lore to get lost in.<br />\n-Original soundtrack composed especially for Scrap Riders.<br />\n-Challenging puzzles.<br />\n-Evolution and progress of your character.<br />\nThis game is still in development, and we will be workign hard on it in order to upload new versions of this &#39;playable demo&#39; as soon as we can.<br />\nKEYBOARD CONTROLS<br />\nUse WASD as arrow keys and K-&gt; Submit // The rest of the controls will be explained in the game</p>", "metacritic": null, "released": "2022-09-21", "tba": false, "updated": "2023-01-13T03:39:24", "background_image": "https://media.rawg.io/media/screenshots/cfd/cfd95635f116fa70b2830f6d273569b0.jpg", "website": "http://www.gamesfortutti.com/scrap-riders", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Nintendo Switch"], "developers": ["Games For Tutti", "GamesForTutti"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Microids"], "esrb_rating": null}