{"id": 93706, "slug": "a-road-to-awe", "name": "A Road to Awe", "name_original": "A Road to Awe", "description": "<p>Maybe I am growing old. Maybe the world I knew is on the verge of collapse. Maybe I need some artistic routine and discipline to pretend it will be alright.<br/></p>\n<p><em>A Road to Awe</em> is a kind of intimate year-long game jam, with a focus on level design and ambient music. The game itself offers a contemplative first-person experience. You simply walk the road, one day at a time, wondering what comes next.<br/></p>\n<p>In 2017, every day, a new section has been added to the road for you to explore. The game has been updated through Itch's early access system, so anyone following the project could get new content automatically if they used the Itch app.</p><p>The road is now complete, and includes 365 levels.</p>\n<ul><li>Details on the game concept can be found here.</li><li>Daily pictures can be seen on the game's blog.</li><li>The Twitter hashtag is #aRoadToAwe.</li><li>The author is of course on Twitter.</li><li>Also on Tumblr and Pinterest.</li></ul>\n<p>Mouse controls</p>\n<ul><li>Left click to move automatically where the pointer is.</li><li>Keep the left mouse button down to move continuously in the direction you're looking at.</li><li>Keep the right mouse button down to look around.</li><li>Keep both buttons down to move and turn at the same time.</li></ul>\n<p>Keyboard controls</p>\n<ul><li>WASD or Arrow keys to move.</li><li>Escape to pause/resume the game or quit.</li></ul>\n<p>Gamepad control (Xbox controller)</p>\n<ul><li>Left pad to move.</li><li>Right pad to look around.</li><li>Trigger buttons to strafe.</li></ul>\n<p>The road has come to an end, but the journey continues. Feel free to come along. You are invited.<br/></p>\n<p>If you like <em>A Road to Awe</em>, I'd recommend trying The Egg for a similar atmosphere, and RPG in a Box, the game engine I'm using.</p>", "metacritic": null, "released": "2016-12-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/62e/62e4dc38d11ec8407ff7f58c1a6854f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["lectronice"], "genres": [], "publishers": [], "esrb_rating": null}