{"id": 93712, "slug": "the-loss-levels", "name": "The Loss Levels", "name_original": "The Loss Levels", "description": "<p><em>The Loss Levels</em> is a series of fifteen narrative microgames, exploring aspects of my experience during the 2017 terrorist attack, in which I lost my brother Martyn. The games are designed to explore some of the elements of the experience, without naming any specifics of place or time or name. The games are intentionally simple, designed to mimic old-school 8bit games, and in many ways are a mirror of my earlier game c ya laterrrr, but depicted in a much more focused and stylised manner.</p>\n<p>Each game is no more than ten seconds or so in length, with a total gameplay time of around 3-4 minutes. </p>\n<p>This project has been commissioned for the 2018 <em>Now Play This</em> experimental games event as part of London Games Festival , and is displayed in a custom-built arcade cabinet deployed at the event at Somerset House in London, and will hopefully be touring to other games events. This version is identical and hosted online, to allow players to try it out without making it to the event. </p><p>The source code for this game is also public, check it out here.</p>\n<p>Although these games are abstracted and simplistic, it goes without saying that they still do explore some challenging themes, and if you're unsure about this content then proceed with caution. </p>\n\n\n\n<p>Additional thanks: </p>\n<p>- James Medd and the Barclay's Eagle Lab (MediaCityUK) for the amazing cab build</p>\n<p>- @PixelArtM and @DidiGameBoy for artwork assistance</p>\n<p>- Sophie and Holly at Now Play This for letting me do this weird project at their amazing festival! </p>", "metacritic": null, "released": "2018-04-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ed0/ed03b5259bf48e38df45fad4547ded81.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["danhett"], "genres": [], "publishers": [], "esrb_rating": null}