{"id": 93718, "slug": "eons-lost-arrival", "name": "Eons Lost: Arrival", "name_original": "Eons Lost: Arrival", "description": "<p><em>Engineering student Lysia wakes up to find herself behind bars in a military prison. Within her confines, she meets three others like her: tradesman Randal, journalist Yanmei, and fellow classmate Skye. Lost and confused, the four escape their imprisonment, only to discover that they unknowingly traveled five hundred years into the past, all in an instant. At a loss for how these events came to pass, the four band together to find their way back home.</em></p>\n<p>Eons Lost is a strategic turn-based fantasy RPG created specifically for Android and iOS. A demo of one of the game's early quests is fully playable in Eons Lost: Arrival, now available for Android and iOS.</p>\n<p>\n<br/>\n</p>\n\n<p>\n</p>\n<p>\n</p>\n\n\n<p>No virtual D-Pads! Simply touch where you want to go and the player will move in that direction. You can also touch and hold for the player to continuously follow your finger. When you walk by an interactable object or entity, a highlighter will appear. Simply tap to talk.</p>\n\n<p>The meat of the game lies in its turn-based combat system. Each character has their own unique paradigms when it comes to battling, and each battle is built with the intent of being strategic, with puzzle-like solutions leading to victory.</p>\n\n<p>\n</p>\n<p>\n</p>\n<p>\n</p>\n<p>\n</p>\n\n\n<p><strong>Odessa</strong> is a sea-based country with the most impressive navy and army of all. In antiquity it was composed of 52 city-states, collectively known as the Lowlands, until the legendary hero Odysseus united them under one flag. Odessans today enjoy fertile lands typically void of beasts and monsters, but the seas remain dangerous to navigate.</p>\n\n<p><strong>Unica</strong> is a country composed largely of desert and dunes. The Proto-Unican/Gavolish cultures developed magical rods capable of irrigating the desert and terraforming the land. With this inherited technology, Unicans today thrive in an otherwise desolate and uninhabitable land.</p>\n\n<p><strong>Elif</strong> is an ancient land of dragons and ice. The first settlement of humanity, the People of the River erected stone walls to defend themselves against vicious monster attacks. Full of ageless beasts and powerful dragons, Elifites today pride themselves on their hardened survival skills whilst enjoying a shared hunting culture.</p>\n\n\n<p>Eons Lost is a special project that we've worked hard on since starting 3 Halves Games. It would mean the world to us if you could spread the word and let your friends know about our game! Please follow development of the project on our social:</p>\n<ul>\n<li>Eons Lost Twitter</li>\n<li>3 Halves Games Twitter</li>\n<li>3 Halves Games Facebook</li>\n</ul>\n<p>Feel free to comment below and let us know your thoughts about our demo, what you liked, and what we can improve upon. Let’s build a fantastic and fun game—together!</p>", "metacritic": null, "released": "2017-06-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1ce/1ce1d8efdbbd9108b231a3d1ab949580.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["3 Halves Games"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}