{"id": 937223, "slug": "light-devours-early-build", "name": "Light Devours - Early Build", "name_original": "Light Devours - Early Build", "description": "<p>\"Light Devours\" is a Monochrome Black-And-White Game where you dodge Saws, Bullets and Lasers for 10 Minutes. This can be done in 4 Different Difficulty Modes! <br/>There is also an Endless Mode with gradually increasing Difficulty if you wanna see how far you can get. <br/><br/>Every Mode in this Game can be completed in Local Multiplayer so you can always play with a Friend! [Or if you're a Whacko you can just control both Player 1 and Player 2 at once by yourself].<br/><br/>If you Complete the Game in a Difficulty you get a little Star at the Bottom Left of the Main Menu. 4 of the 5 Stars are obtainable by beating Easy, Normal, Hard and Extreme Respectively. The 5th Star will be Obtainable in a later Version when Challenges are Accessible.<br/>Early Buildv0.1 only includes the Bare Minimum Necessities so Freeplay, Challenges and Options all don't exist yet. More Attack Patterns will be added too as there are only 3 at this Point.<br/><br/>Controls for P1 are limited to the Mouse for now, I do plan on Allowing Different Control Schemes in the Future though. These are the Controls for Early Buildv0.1:</p>\n<p><strong>Player 1<br/></strong>- Moving Mouse: Move around Player 1 <br/>- Left-Click: Select Menu Option<br/>- Right Click: Toggle Pausing in Battle Mode [Cursor needs to be on your Player Character when Unpausing] + Going Back to Main Menu when in Menu Mode.<br/>- Middle-Click: Give One of your Hearts to Player 2 if Local Multiplayer is enabled.</p>\n<p><strong>Player 2<br/></strong>- W, A, S, D or Arrow Keys: Moving around Player 2<br/>- Space: Give One of your Hearts to Player 1.<br/><br/>To Enable Local Multiplayer Mode you just have to Left-Click on the little Friend Symbol in the Bottom Right of the Main Menu or Press M [Only works while in Main Menu].<br/></p>", "metacritic": null, "released": "2023-03-04", "tba": false, "updated": "2023-03-06T11:34:38", "background_image": "https://media.rawg.io/media/screenshots/8c9/8c927953257afeaa3b12f2570d1bf4e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "macOS", "PC"], "developers": ["Vortoxium"], "genres": [], "publishers": [], "esrb_rating": null}