{"id": 937240, "slug": "decimation-itch", "name": "Decimation (itch)", "name_original": "Decimation (itch)", "description": "<p>The team at Loose Toast! Productions is excited to announce the Pre-Alpha playable demo of our first game...<strong><em>Decimation</em></strong>, a fast-paced, 2D, pixel-art, space shooter that pits the player(s) in a frenzied, all-out space battle against the armada of an invading alien empire.</p>\n<p>Decimation supports up to 4 players in split-screen co-op mode, so grab your friends and your X-Box compatible controllers for quadruple the fun! We're big fans of pixel-art games over here at Loose Toast!, so the art-style was a no-brainer!<br/><br/><strong>Story Summary</strong><br/></p>\n<p>Our solar system has been targeted for annihilation by an alien race. Systematically destroying each defense outpost orbiting the planets in our system, they are slowly making their way to Earth, colonizing each planet along the way.\r\nOnly a handful of fighter pilots have survived the first attack and you are all that remains of a once powerful space fleet.\r\nThe fate of Earth is now in your hands...<br/><br/><strong>Our Inspiration</strong><br/></p>\n<p>Decimation takes inspiration from several classic arcade games: <em>Bosconian</em>, <em>Sinistar</em>, <em>R-Type</em>, and Synapse Software's <em>Survivor</em> for the C64 and Atari 800.\r\nWe really like <em>Sinistar's</em> frenetic gameplay, it's crystal mining feature, and the sense of urgency you feel rushing against the clock to be ready to battle the <em>Sinistar</em>. In Decimation, you must also mine crystals from the nearby asteroids to create bombs, the only weapon powerful enough to bring down the shields of the heavy alien ships. But crystals are also the fuel that powers your ship's defense shields, so they are doubly important in our game!\r\n<br/><br/><em>Survivor</em> and <em>Bosconian's</em> premise of destroying big enemy stations while being harassed by fighters was fun and made for some interesting gameplay, but we changed the static battle stations to moving cruisers, carriers and dreadnoughts, and with their heavy armaments targeting the player's fighter, the frenetic gameplay is brought to an even greater intensity.\r\n</p>\n<p>We wanted to incorporate <em>R-Type's</em> power-up system and expand on it, so the player has the opportunity to upgrade their fighter with better weapons, add-ons, and defensive measures, all harvested from the floating debris from your recently destroyed defense outpost. Of course, as you move closer to Earth, defending planet after planet, the invading alien ships become more powerful and more heavily armed, so naturally, upgrading your ship's capabilities is a must!\r\n</p>", "metacritic": null, "released": "2023-03-04", "tba": false, "updated": "2023-03-06T12:00:34", "background_image": "https://media.rawg.io/media/screenshots/156/156f6b5016dffb97ed5a08989dfa42cb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MadHackerLT"], "genres": ["Action"], "publishers": [], "esrb_rating": null}