{"id": 937442, "slug": "garden-dodge-boss-battle-edition", "name": "Garden Dodge: Boss Battle Edition", "name_original": "Garden Dodge: Boss Battle Edition", "description": "This version of Garden Dodge is a boss battle version of the game. If you haven't played the original, a link to it can be found here.\r\nHow to Play\r\nMovement\r\n Hold LMB to aim in a direction and magnitude. Release LMB to jump. Stay on the flowers.\r\nEnemies\r\n<p>Avoid hitting raindrops and beetles. Jumping on top of beetles will send you over the next flower and give you temporary invulnerability.</p>\r\nHow To Win\r\n<p>The aim of the game is to survive and reach the end of the garden.</p>\n<strong>If you are having trouble fighting the boss click here for help</strong>\n<p>The boss is invulnerable right off the bat, but after 8-12 seconds, a big rain drop with fall and stun the boss. At which point jumping on the boss will result in them taking damage. After being hurt, the boss will initiate an attack once you land.</p><p>The boss has 2 attacks: </p><p>- Fly up and to either side of the map and charge across </p><p>- Summon a swarm of beetles </p><p> The boss's charge attack can only be dodged by jumping up over them. The red arrow indicates the direction the boss is charging from as well as how high you have to jump to avoid them. The arrow will blink 5 times before the boss charges. </p><p>The boss's summon beetles attack spawns 3-8 beetles on the opposite side of the map from you. They will act like the regular beetles and only move in one direction and die if jumped on or hit any other object that isn't the boss. A good way to avoid this attack is by jumping off the top of the boss. Not only will you gain invulnerability until you land, but it'll also land you directly in the middle of the 1st flower on the opposing side of the map.</p>", "metacritic": null, "released": "2023-03-03", "tba": false, "updated": "2023-03-06T16:43:00", "background_image": "https://media.rawg.io/media/screenshots/47e/47e6fab063bc3db6f141f11330d7a863.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Ryan Brooks"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}