{"id": 937695, "slug": "2200-space-conquest", "name": "2200 Space Conquest", "name_original": "2200 Space Conquest", "description": "<p>A NovelAI interactive storybook. Inspired by DougDoug's NovelAI game idea featured in his video \"Twitch Chat and I invaded Space with Artificial Intelligence\"!\r\n</p>\r\nRules\r\n<p>The year is 2200, humanity has finally invented space travel and now they adventure into the solar system to claim the planets as their own. But, Earth's people have fractured into two groups: <strong>The Empire of X</strong> and <strong>The Empire of Y</strong>. Today, we learn which one leads their people to glory with the <strong>NovelAI program</strong> which uses advanced artificial intelligence to accurately describe the story and outcomes for each empire's decisions.\r\n</p>\n<p>Both empires begin with one base on planet Earth, each will take turns trying to expand their empire with the AI deciding all the outcomes. Each new planetary base you make earns +1 point, each special resource earns +1 point and the first empire to 10 points officially wins the solar system.\r\n</p>\n<p>Now let the games begin...\r\n</p>\r\nActions &amp; Rolls\r\n<p>On your turn, you must perform an action. These actions must take place within any celestial body that is adjacent to or on one of your bases. If the action does not require a location, then <strong>The Empire</strong> in question may leave it out, making it a general empire action.\r\n</p>\n<p>Each <strong>Empire Action</strong> must be written as a short paragraph that describes the attempted action, something that narratively makes sense with the previous context. You may include previously stated actions within your prompt.\r\n</p>\n<p>e.g.\r\n</p>\r\n\r\nNow that humans have invented space travel, the Empire of X begins their conquest of the solar system by attempting to train a genetically-enhanced human soldier called Master Chief. He would be strong, have an AI companion nammed Cortana, and is equipped with shield regeneration technology and a warthog. Suddenly, the attempt to build Master Chief begins. \r\n\r\n<p>or\r\n</p>\r\n\r\nNow that humans have invented space travel, the Empire of Y begins their invasion of the solar system by sending their star fleet to Mercury. They hope to build a base and establish a close connection to the sun. So the scientists send out the fleet. \r\n\r\n<p><strong>Resources</strong> may be used anywhere, each is a case-by-case of what that resource may do, so use basic logical reasoning.\r\n</p>\n<ul><li>You must continue 5 times.<ul><li>If scenario is obviously unfinished (middle of action), then continue until end.\r\n</li><li>If last new sentence did not end, erase excess until last period.\r\n</li></ul>\n</li><li>You may reroll 1 time.\r\n</li><li>You may redirect 1 time.\r\n</li></ul>\n<p>After each <strong>Empire Action</strong>, the map and resources must be updated, if changes have occurred.\r\n</p>\r\nResources\r\n<p>To create a resource, you must first research it before you may attempt to build it.\r\n</p>\n<p>Resources may also be acquired by \"luck\" if the AI bestows you one.\r\n</p>\r\nThe Map / Universe\r\n<p>The map is stored within an SVG file, Solar System.svg, where you can easily update the map with whatever craziness is necessary. You will also find two small boxes on the bottom right where you may enter each empire's resource, whether complete or researched.\r\n</p>\n<p>It is suggested to make a copy of the original and save each game as a separate SVG file. And remember, the map must be updated after each turn!\r\n<br/></p>\r\nImporting &amp; Setup\r\nAutomated\r\n<p>If you have a Linux or Windows system, then you are in luck! You can quickly go through the setup process with the setup.sh script on Linux or the setup.bat script on Windows. Simply run the script and follow the instructions.\r\n</p>\n<p>The script will create a sub-directory games/{empire_one}-vs-{empire_two}/ where you'll find setup 2200-space-conquest.story and solar-system.svg files.\r\n</p>\r\nManual\r\n<p>With the data folder, import the 2200-space-conquest.story file within NovelAI and modify all occurrences of {empire_one} and {empire_two} with two empire names the players have chosen. Occurrences can be found within the <strong>story title</strong>, the <strong>initial prompt</strong>, the <strong>Memory</strong> and finally the <strong>Loorbook</strong>, where you must also change the entry name, add the entry text (which is a small paragraph that defines your empire), and finally update the activation tags. You must also update the empire names in the solar-system.svg map.\r\n<br/></p>\r\nNumber of Players &amp; Game Length\r\n<p>Every game I played was with only two empires, which is what the .story file is optimized for. That said, I have played 4 players, splitting the group into two empires; two teams of two players. And it's just as fun to make choices as a team as it is alone! The more empires there are, the more confused the AI seems to get... With two empires, the AI gets a pretty good understanding of the overall situation. This is especially true since this game runs in a single NovelAI story that keeps track of most of the content written and expands upon it.\r\n</p>\n<p>My games tend to last about 3 hours, all things considered.\r\n</p>\r\nTips &amp; Tricks\r\n<ul><li>Play some nice ambient space music while you play!\r\n</li><li>AI does something unexpected? Make it cannon!<ul><li>Whatever the AI says is truth, work with it!\r\n</li></ul>\n</li><li>Dedicate a single typer for the game, whomever is the fastest typer in the group.<ul><li>This can shorten game length.\r\n</li></ul>\n</li><li>Want to play with more than two players? Why not split the group into two teams!\r\n</li><li>Have a competent voice actor in your group? Make them your official narrator!<br/>\n</li></ul>", "metacritic": null, "released": "2023-03-03", "tba": false, "updated": "2023-03-06T18:49:56", "background_image": "https://media.rawg.io/media/screenshots/64e/64e317ac3d5bf13c604abc0128c1c004.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Elatronion"], "genres": [], "publishers": [], "esrb_rating": null}