{"id": 93775, "slug": "blacksword-chronicles-igmc-2015", "name": "Blacksword Chronicles IGMC 2015", "name_original": "Blacksword Chronicles IGMC 2015", "description": "<p>\r\n\tWithin the ruins of a\r\n\t fallen empire, in a room long forgotten by the world, a swordsman awakens remembering only the words:\r\n</p><p>\n<em>\"Jurdin Kylor must die.\"</em>\n</p><p>\r\n\tThus begins the tale of a swordmaster's pursuit of a shadowy nemesis across a dark continent ravaged by wars and evil. This is the first chapter of an epic set in a massive world of aurablades and mages, of elves and demons, of secret societies and ancient cults.\r\n</p><p>\r\n\tVIDEO TRAILER\r\n</p><p>\n<strong>FEATURES</strong>\n</p><p>\r\n\t*** 2.5 hours of intense, action-packed story in a dark and vivid world of sword and sorcery.\r\n</p><p>\r\n\t*** Featuring the Duel Combat System: a battle system of thrilling sword fights inspired by martial arts and fantasy movies.\r\n</p><p>\r\n\t*** Exotic and beautiful locations from city ruins to underground jungles to the Hanging Gardens of Myth Laurelin.\r\n\t<br/>\n</p><p>\r\n\t*** Haunting and heartbreaking music by Darren Curtis, Quigon, Scythuz, Jin Rokudo, and Tam Music Factory.\r\n</p><p>\r\n\t*** Made with RPG Maker VX Ace.</p><p>\n<strong>QUOTES FROM PLAYERS SO FAR</strong><br/>\r\n\t\"I normally don't play a lot of RPG maker type games but you may have just changed that…Yep, you've made a new RPG Maker junkie out of me.\"\r\n</p><p>\r\n\t\"I would buy a Blacksword Chronicles [sequel] on Steam.\"\r\n</p><p>\r\n\t\"[The game] has a STRONG CORE, in this case the engaging active combat. That alone did a good job carrying the game.\"\r\n</p><p>\r\n\t\"I wanted to give out major credit for doing something relatively unique in terms of combat, it isn't often I see something that initially surprises me like that in a rpg.\"\r\n</p><p>\r\n\t\"i mean its RARE that i want more of something.\"</p>", "metacritic": null, "released": "2015-08-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/27f/27fe4b11d86a6bdeead4281a0287b75c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Watermark RPG"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}