{"id": 937886, "slug": "warcycle", "name": "Warcycle", "name_original": "Warcycle", "description": "<p>Warcycle revolutionizes the gameplay of tactical RPGs.</p>\n<p>By combining the traits of the standard tactical RPG with those of a roguelike deckbuilder, the game adds speed, replayability, and variety while still maintaining and even improving upon the strategic complexity and lore the genre became known for. Players will build a customized deck of cards containing both spells and units. The units they choose can then be summoned to the battlefield and aided by the casting of spells will move in traditional turn based combat against the enemy armies. With three playable characters, over 180 unique cards, and 16 enemy commanders to fight against, no two runs will feel the same, and players will always have to keep on their toes and use quick thinking to avoid losing. Each run will be short, taking 1-2 hours to complete. During that time players will be able to tailor their deck by adding, removing and upgrading cards, as well as picking up powerful pieces of equipment as they progress. Every player’s experience of the game will be personal, as they explore the vast number of synergies between the cards and equipment that they acquire and learn how to pilot their personalized deck against each new enemy they encounter.</p>\n<p>Kickstarter: https://www.kickstarter.com/projects/bearbonesstudio/warcycle-a-tactical-rogueli...</p>\n<p>Twitter: @BearBonesStudio</p>\n<p>Discord: https://discord.gg/Zt7Bn4Kh<br/></p>", "metacritic": null, "released": "2023-02-11", "tba": false, "updated": "2023-03-06T20:07:29", "background_image": "https://media.rawg.io/media/screenshots/7d1/7d1d01472f958cdd14463b0d7e1ee1cc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ColdPolarBear"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}