{"id": 937825, "slug": "silver-moon-001", "name": "Silver Moon 0.0.1", "name_original": "Silver Moon 0.0.1", "description": "<p>The year is 3258 and the organization Galaxy Void has just completed the first Time Machine prototype and were getting ready to test it out when an invasion of an unknown humanoid species on Earth started.  Security attempts to take them down, but they are using technology more advanced than ours.  You decide to go back before the invasion starts and warn the Head Admiral, but as you start up the machine you realize that you don’t know how to work it. The machine takes you to the year 1192, and breaks.  In order to save everyone you must first find a way to repair the Time Machine, and at the same time, prevent change in the timeline.  Once you fix the time machine you will have to jump through time gathering materials, fighting enemies, and try to stay alive.<br/></p>\n<p>Silver Moon is under heavy Development and if you would like to contribute to the game or check up on update you can join the Discord Server. There is no set release date yet.  Silver Moon is a RPG/Survival game, currently being built by a team of six individuals.</p>\n<p>Server Members of the discord server have access to beta testing, bug reporting, live podcast, partnerships, change log, updates, and can suggest their ideas.   Anyone who wants to contribute is more then welcome.  The game is being developed from the ground up in Java. Some available jobs include: Documentation Staff, Support Team, Pixel Artist, Music Composers, Java Developers, Story Writers.</p>\n<p>Join the discord here: https://discord.gg/wW4rGt7tMS</p><p>Get all of our podcasts and previous trailers here: https://www.youtube.com/@silvermoon-game/featured</p>", "metacritic": null, "released": "2023-02-15", "tba": false, "updated": "2023-03-06T19:41:19", "background_image": "https://media.rawg.io/media/screenshots/59e/59ea365b5178b219e117d224bbdfbd2b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Dhogan06"], "genres": ["Action", "Adventure", "RPG"], "publishers": [], "esrb_rating": null}