{"id": 93797, "slug": "the-ice-bound-concordance", "name": "The Ice-Bound Concordance", "name_original": "The Ice-Bound Concordance", "description": "<p>\n</p>\n<p>\r\n\tA writer, dying alone...\r\n</p>\n<p>\r\n\tA base at the end of the world, sinking deep into ice...\r\n</p>\n<p>\r\n\tA digital ghost lost in a labyrinth of shifting stories...\r\n</p>\n<p>\n<em>The Ice-Bound Concordance</em> is an award-winning interactive narrative game where story pieces are as fluid as building blocks, and where endings are discovered with the help of a physical printed art book, <em>The Ice-Bound Compendium.</em>\n</p>\n<p>\nShape stories. Find secrets. Descend.\r\n</p>\n<p>\n<strong>NOTE: The first two chapters of the game are available for free. You can continue past that point with the help of the special printed book, available at www.ice-bound.com.</strong>\n</p>\n<p><strong><em>\"One of the most ambitious projects I've ever seen\"</em> -- Rock Paper Shotgun<br/></strong></p>\n<p><strong><strong><strong><em>\"An unmissable narrative game... brilliant... fascinating.\"</em></strong> — EuroGamer</strong></strong></p>\n<p><strong><em>\"Extraordinary\"</em> -- KillScreen</strong></p>\n<p><strong><em>\"[A] masterfully layered [and] magisterial game… the book leaves a glitchy, pixelated impression on one's mind long after one is done playing/reading.\"</em></strong><strong><em> </em>-- Gamasutra</strong><br/></p>\n\n<p>\n</p>\n<p>\r\n\tKristopher Holmquist died an unknown, struggling to write stories in an unheated New York apartment. But years later, his work was discovered, gradually becoming incredibly popular. With millions of fans wondering how his final, unfinished novel would have ended, a clever publisher commissions an artificial intelligence \"simulacrum\" of Holmquist, called KRIS, to find out.\r\n</p>\n<p>\r\n\tHolmquist's unfinished book, a novel called <em>Ice-Bound</em>, centers around a remote polar research base, eternally sinking into ice. With successive owners over years and decades building fresh new layers on top, the station became a vertical labyrinth of forgotten histories. Each level (and each chapter) moves farther back in time, deeper into the ice.\r\n</p>\n<p>\r\n\tWho were the people who lived here? What stories lie buried beneath them? And what's at the bottom, the deepest level down: the enigmatic foundations of Carina Station?\r\n</p>\n<p>\n<strong>Find out more about the companion book here!</strong>\n</p>\n<p><strong>\"[I]nteractive fiction's gone some daring places in the last few years... [this] is one of the most ambitious projects I've seen.\"</strong> — Rock Paper Shotgun<br/></p>\n<p>\n</p>\n<p>\r\n\tDescend through seven levels of remote, mysterious Carina Station, each with its own story of people at the edges of civilization: psychopathic maintenance crews, haunted soldiers and time-shifted explorers. Rearrange pieces of procedurally assembled stories to find the version you like best. Your choices affect which pieces you'll see in the next story.\r\n</p>\n<p>\r\n\tWhile you play, chat with your virtual collaborator, the \"digital ghost\" of the book's original author. These stories mean something to him. Will you respect his intuitions, or follow your own instincts? Will you tread carefully, or make him face his demons?\r\n</p>\n<ul>\n<li>Over 100,000 words of potential story and conversation content</li>\n<li>Co-created by the author of Blue Lacuna, named one of the Top 10 Interactive Fictions ever written</li>\n<li>60+ minute soundtrack by N.J. Apostol (Ether One)</li>\n<li>Thousands of explorable variations for each story</li>\n<li>An experimental new genre of interactive storytelling (based on cutting-edge academic research!)</li>\n<li>Story pieces become customized to your preferred themes</li>\n<li>3-8 hours of gameplay per playthrough; play again to discover new story fragments</li>\n<li>First two stories are free; unlock the others with purchase of the printed <em>Ice-Bound Compendium</em></li>\n</ul>\n<p><em><strong>\"...pushes the limit of what's interactive in interactive fiction.\"</strong> — PocketGamer<br/></em></p>\n<p>\n<strong>Requires a Windows PC* and a webcam. </strong></p>\n<p><em>* Note: We have received reports that the game does not function on Windows-based tablets, such as the Surface Book. Apologies!</em></p>", "metacritic": null, "released": "2016-01-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/152/15295efa7aaa31f21cbe55e184406d82.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Down to the Wire", "Logodaedalus"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}