{"id": 938085, "slug": "unprompted", "name": "Unprompted", "name_original": "Unprompted", "description": "Come explore more than 1,500 artworks made by A.I. across 7 carefully curated galleries. Type to guess the prompts used to generate each artwork, while slowly uncovering A.I.'s reflections on its own work.<br/><br/><br/><br/>MoTU welcomes all to join in the journey of machine learning.<br/>MoTU engages all visitors through a gamified art experience.<br/>MoTU builds inclusive spaces for all humans to encounter the machine mind.<br/><br/>The experience of MoTU is guided by four core principles:<br/><br/><br/>Gazing carefully at each artwork, you begin to notice familiar elements. Take a bold guess and type the words into the text box. Press enter to check for correct matches and earn points for each correct word. Don’t worry, you have six tries to completely guess the prompts before moving on.<br/><br/> <br/>If unsure what you’re seeing, spend 10 points to reveal one word of the prompt.<br/><br/> <br/>The progress you’ve made completing prompts will allow you to access certain gifts from the gift shop, where A.I. artworks are brought to life across a wide range of products. Don’t miss out!<br/><br/> <br/>Completing the prompt for certain artworks will trigger A.I.-generated text descriptions of that artwork, allowing you the opportunity for an extra level down the rabbit-hole of machine-learning associations. More broad A.I.-generated statements on the future role of A.I. in art and society will also be found at the start of each gallery visit, slowly building a background narrative, subtly reframing what you are seeing as you progress.<br/><br/><br/><br/>Unprompted is created by Matt Eshleman, an architect based in China for the last 10 years. The idea of Unprompted was born during the Shanghai COVID lockdown of spring 2022, when he was confined to his apartment for two months, making experimental games. During this time, Matt learned to both deeply fear and fully embrace the coming A.I.<br/><br/>Unprompted is neither wholly human-made, nor wholly A.I.-generated. As such, the designer takes sole responsibility for the content of this game.<br/><br/>Images were generated with Craiyon.<br/><br/>Texts were generated in part with ChatGPT and GPT-3, OpenAI’s large-scale language generation models. Generated draft language was subsequently reviewed and edited to the developer’s liking.", "metacritic": null, "released": "2023-03-07", "tba": false, "updated": "2023-03-10T06:08:17", "background_image": "https://media.rawg.io/media/screenshots/7aa/7aa30d645849b802fd6476d82a34c2bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Matt Eshleman"], "genres": ["Adventure", "Casual"], "publishers": ["Matt Eshleman"], "esrb_rating": null}