{"id": 938067, "slug": "freakninja-wars", "name": "Freak☆Ninja Wars", "name_original": "Freak☆Ninja Wars", "description": "<h3> Freak☆Ninja Wars</h3>English Support<br/><strong>A single player deck builder game in which you control and defeat yokai.<br/>Based on a roguelike and card game system, use your special moves with yokai powers to conquer dungeons. </strong><br/><br/>.<h3>Features,About This</h3>Controlling Specters: Players can join specters, ninjas, gods, etc. as they progress through the scenario.<br/><br/><br/><br/>Once a yokai joins a group, it can be sent out into the dungeon to fight.<br/>Each yokai that joins a group has its own characteristics and special moves, and its fighting style will change dramatically.<br/><br/>.<br/><br/>During the dungeon, you can buy items at the store or sell cards.<br/><br/>Deck Construction and Dungeons: Players can build their decks by attacking dungeons.<br/>When winning, in addition to cards, items, money, and equipment will appear.<br/>Aim to defeat dungeon bosses with a powerful deck configuration.<br/><br/>Standby Phase: As you progress through the scenario, the blacksmith shop or dojo will open.<br/>In the dojo and blacksmith shop, you can purchase equipment, items, and cards that you can initially own when you challenge the dungeon.<h3>Challenge Mode</h3>.After clearing the scenario, the Challenge mode will be released.<br/>In Challenge Mode, you can challenge the strongest dungeon configurations.<br/>Also, in Challenge mode, the treasure chest gacha(item random get event) is released, allowing you to obtain items to take with you to the dungeon <br/>Furthermore, the gacha screen allows the release of adult costumes, and a system can be purchased that allows you to strip your yokai of their costumes during battle.<h3>Sexual and violent expressions</h3>.This game contains anime-style blood splatter, drinking, nipple drawing, and manipulated female genitalia<h3>Implementation Details</h3>.More than 300 cards<br/>More than 200 equipment<br/>More than 20 control yokai<br/>More than 50 hostile specters<br/>More than 20 special events<h3>Adult contents</h3> (more than 60 standing picture contents)<br/>More than 60 standing picture contents (different standing picture for each yokai)<br/>Adult events for each yokai<br/>Adult event upon defeat", "metacritic": null, "released": "2023-03-09", "tba": false, "updated": "2023-03-10T05:44:56", "background_image": "https://media.rawg.io/media/screenshots/1b0/1b0c65c93489321f3f6badaf43a12179.jpg", "website": "https://foxmuffler.jeez.jp/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 376, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fox .Inc"], "genres": ["Action"], "publishers": ["Fox .Inc"], "esrb_rating": null}