{"id": 938056, "slug": "final-profit-a-shop-rpg", "name": "Final Profit: A Shop RPG", "name_original": "Final Profit: A Shop RPG", "description": "Final Profit is a <strong>merchant life-sim RPG</strong> that presents a critique of capitalism.<br/><br/>You are Queen Mab, exiled from the lands of the Fae because of your radical plan to save the realm from financial predators. The Fae Council thinks attempting to defeat the Bureau of Business at their own game is an insane ploy with no hope of success.<br/><br/><strong>Prove them wrong.</strong><br/><br/>Starting with nothing, you assume the alias of Madama Biz. Accumulate wealth and influence to climb the ranks until you become a Lord of Business!<br/><br/>But you'll need more than just money. Seek out allies to help overcome the danger, traps, and colossal debt the Bureau has in store for you.<br/><br/><ul><li>Will you manage to save your people? <br/></li><li>How much are you willing to compromise?<br/></li><li>Or will you lose sight of your goal entirely and become a ruthless agent of capitalism?</li></ul><br/>Run your shop, make investments, and explore a story filled world as you work to earn enough coin to take down the corrupt Bureau of Business!<br/><br/><h3>AN RPG WITHOUT COMBAT:</h3> Earn XP by making money! Your main source of income will be your shop, but there's plenty of side hustles to uncover if you go looking for opportunities!<br/><br/><br/><h3>SHOP GAMEPLAY:</h3> Find customers and unlock products to sell in your shop. Managing it all can get a bit hectic but there's plenty of ways to streamline, upgrade, and strategise to become more efficient!<br/><br/><br/><h3>UPGRADES:</h3> Automate your products going on display, unlock better and quicker ways to get stock, change the way customers behave, collect cosmetics to change the way your shop looks, and many more! There's a lot of options to build your own play style!<br/><br/><br/><br/><h3>KEEP WELL STOCKED:</h3> Some products you can buy, some you'll need to craft, or grow, or trade Mana for.<br/><br/><br/><br/><br/><h3>SIDE HUSTLES:</h3> There's more ways than just the shop to get ahead, buy stocks and property for some bonus passive income. <br/><br/>And if you're a troublemaker you can look for hidden ways to exploit the economy.<br/><br/><br/><h3>DEBT:</h3> The Bureau will try to keep you down, prove yourself by building a fortune in spite of them!<br/><br/><br/><h3>EXPLORATION:</h3> The world is filled with things to do, minigames, side quests, collectables, unlockables, and secrets. Some are very well hidden indeed.<br/><br/><br/><br/><br/><h3>CHOICES:</h3> Make decisions that have an impact on the way your shop and the story evolve!<br/><br/><br/><h3>STORY:</h3> You're doing all this for a reason. The people of Faeona exiled you, their former Queen. But you've vowed to save them anyway. The Bureau of Business will regret the day they crossed you. Rise up! And become a Lord of Business!<br/><br/><br/>", "metacritic": null, "released": "2023-03-06", "tba": false, "updated": "2023-03-10T05:28:28", "background_image": "https://media.rawg.io/media/screenshots/5ea/5ea3a00594e6cd093152b2cdaf91fafd.jpg", "website": "https://www.finalprofit.com.au/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 11, "toplay": 1, "dropped": 1}, "playtime": 5, "achievements_count": 72, "ratings_count": 0, "suggestions_count": 359, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Brent Arnold"], "genres": ["Adventure", "RPG", "Strategy", "Simulation", "Indie"], "publishers": ["Brent Arnold"], "esrb_rating": null}