{"id": 938084, "slug": "someday-youll-return-directors-cut", "name": "Someday You'll Return: Director's Cut", "name_original": "Someday You'll Return: Director's Cut", "description": "What would you do if your daughter went missing? How far would you go to track her down?<br/>Venture into the old Moravian woods to find Stella, and unveil the shroud of your sanity in the process.<br/>Someday is a critically acclaimed game of psychological horror that has been polished, expanded, and rereleased in this new <strong>Director’s Cut</strong>.<br/><br/><br/><br/>Find out what happened by visiting the place where tragedy first struck. Use your wits, map, and tourist tracks to navigate the mysterious landscape. The forest is full of old memories, abandoned camps, murky swamps, and collapsed bunkers. Discover local stories to solve otherworldly puzzles and maneuver through locations you once knew so well. And don’t forget to keep your head down. Something out there might be watching.<br/><br/><br/><br/>The workbench allows you to inspect the items you collect along your journey. Modify them, take them apart, and craft new items to help you succeed. You can also master the ancient craft of alchemy and brew potions that can heal the soul or corrupt the heart. Use the workbench and these wondrous compounds to help you solve problems and reveal the truth.<br/><br/><br/><br/><strong>The Director’s Cut offers a polished experience with enhanced features:</strong><br/><br/>- Better story pacing and new optional areas<br/>- New achievements and collectibles<br/>- New puzzles and story content<br/>- Enhanced navigation tools<br/>- New Photo Mode<br/>- Improved lighting and character models<br/>- Over 30 minutes of new music<br/>- Full controller support<br/>- DLSS support<br/><br/><strong>Don’t question what’s real or not. Just follow the tracks and find Stela!</strong>", "metacritic": null, "released": "2023-03-07", "tba": false, "updated": "2023-08-29T03:47:56", "background_image": "https://media.rawg.io/media/screenshots/c66/c660ba0151fc4edfe4298813ec40ae2f.jpg", "website": "http://somedaygame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "toplay": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 515, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["CBE Software"], "genres": ["Adventure", "Indie"], "publishers": ["Bohemia Interactive"], "esrb_rating": "Mature"}