{"id": 93816, "slug": "salaryman-suzuki-san", "name": "Salaryman Suzuki-san", "name_original": "Salaryman Suzuki-san", "description": "<p><strong>SALARYMAN SUZUKI-SAN - THE JAPANESE ENDLESS RUNNER</strong></p>\n<p><em>\"It's Suzuki-san's first day as a budding Salaryman! Help him reach his new office by jumping over obstacles, crashing through Japanese stores and restaurants all whilst trying not to get too distracted by the beautiful Japanese scenery all around.</em><em>\" </em></p><p><strong>頑張ってすずきさん！</strong></p>\n<p>Match Suzuki-san's briefcase color to the color of the incoming obstacles and then time your jump to perfection! See how far you can go through the seasons of Spring and Summer, enjoying some Japanese festivities and culture along the way. Try to get the highest score possible and show off to all your other salaryman friends!</p>\n<p><strong>GAMES BY LIAM</strong></p>\n<p>Hi, I am Liam Edwards. </p>\n<p>I make small games about Japan and my life here. I have lived here for 3 years and during this time this country has provided an unlimited amount of inspiration. One of which was the idea of a new salaryman stressing about getting to work on time. <br/><br/>Salaryman Suzuki-san is the first game I started to work on as a solo developer. I learned a lot about GameMaker and how to program through working on this game and there was no end to the prototypes, iterations and the like before what you see now. Although this game isn't quite finished, this demo/release was scheduled to be shown at the Kyoto BitSummit festival. Unfortunately I am unable to show it there this year, so to tie in with the festival happening, I wanted to release what I have so far for all of you to enjoy and play anyway. <br/><br/>I am not sure if I will actually continue with development of Salaryman Suzuki-san (hence the title featuring a \"DEMO?\" addendum) as it's taken far too long and I have brand new ideas to explore. But, I didn't want to let this waste away hidden on my laptop, so it's here and as polished as possible for you all to enjoy!</p>\n<p>I really hope you enjoy your time with Salaryman Suzuki-san and he provides you with as much joy as he provided me upon creating him. </p>\n<p><strong>ISSUES OR FEEDBACK</strong><br/></p>\n<p>You can contact me on Twitter - <strong>@LiamBME</strong><br/>Or Email - <strong>finalgamespodcast@gmail.com</strong></p><p><strong>SUPPORT</strong><br/></p><p>If you are enjoying Salaryman Suzuki-san or enjoy my work from games or podcasting, please consider supporting via Itch.io. You can download this game for free or a price of your choosing, even $1 goes a long way to help pay for all those Starbucks Coffees I purchased whilst working on this. (seriously, I literally spent $30 on a celebratory pizza as I typed this... I need help)</p><p><strong>Thank you so much &lt;3</strong></p>", "metacritic": null, "released": "2018-05-09", "tba": false, "updated": "2019-08-28T23:25:54", "background_image": "https://media.rawg.io/media/screenshots/041/041d9e8f275abd92df6a6a6d7cd9ee61.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LiamEdwards"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}