{"id": 938142, "slug": "endless-railway", "name": "Endless Railway", "name_original": "Endless Railway", "description": "If you're looking for a fun, simple yet challenging game, then Endless Railway is definitely a game worth trying. This game combines relaxing music, simple controls, and exciting gameplay to turn a boring train ride into a thrilling adventure.<br/><br/>The game is set in the Wild West, with alternating periods of dusk and mist creating an atmosphere of a post-apocalyptic world. As a guard, your role is to escort a train carrying supplies back and forth between shelters through the hordes of zombies and mist.<br/><br/>You must use your machine gun and pre-apocalyptic technology to constantly upgrade the train's ability and your weapon's capacity to eliminate the zombies blocking the train. The closer the zombies are to the disaster zone, the stronger they become, making your adventure challenging and fun.<br/><br/>In Endless Railway, you need to allocate your skills wisely to survive in the zombie and misty world. You must keep the train running smoothly and enable the shelters to exchange resources with each other.<br/><br/>So, if you want a simple shooting game or want to challenge yourself against increasingly difficult zombies, then come and try Endless Railway! Don't let the zombies stop the train from moving forward, venture deeper into the disaster zone and bring the necessary resources to each shelter. Purchase this game and experience a thrilling and challenging adventure!<br/><br/><br/>", "metacritic": null, "released": "2023-03-09", "tba": false, "updated": "2023-03-10T07:27:23", "background_image": "https://media.rawg.io/media/screenshots/7d2/7d27454ef8123d727336482a4b43c226.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["sam751021"], "genres": ["Casual", "Indie"], "publishers": ["sam751021"], "esrb_rating": null}