{"id": 938126, "slug": "fatal-frame-project-zero-mask-of-the-lunar-eclipse", "name": "FATAL FRAME: Mask of the Lunar Eclipse Digital Deluxe Edition", "name_original": "FATAL FRAME: Mask of the Lunar Eclipse Digital Deluxe Edition", "description": "■About the GameA group of children mysteriously disappeared during a festival on Rogetsu Isle. Although they were found, they had lost their memories. Now they have returned to the island as teenagers. The girls rely on the Camera Obscura, a camera with the power to capture and seal away unthinkable horrors, and the faint beam of their flashlight while exploring various locations and fending off the ghosts that attack them as they attempt to discover the truth of their haunting past.<br />\n-Camera Obscura<br />\nThis is an old camera with the ability to repel vengeful ghosts and seal away their power by photographing them. As such, it is an indispensable item throughout the game. The Camera Obscura can be used as a weapon against ghosts by spotting them through the viewfinder and taking photos of them to inflict damage. It also plays a major role in the girls&#39; investigation, as its special power allows them to see the keys that allow them to find their way through new areas.<br />\n-Exploring Rogetsu Isle<br />\nExplore the dimly lit Western-style mansions and abandoned hospitals on the island by relying on the moonlight and the faint beam of your flashlight. Progress the story by interacting with items and places that spark your interest. From past newspaper articles and notes, you uncover the vile secrets of the past, unravel the lost memories of the protagonist, and discover the truth.<br />\n■Features-Improved Graphics<br />\nIn-game movies and character models have been improved to make the story and characters more appealing. In addition, the graphics have been improved for each platform. The rendering of shadows and the beam of the flashlight has been refined so players can experience more realistic horror.<br />\n-New Snap Mode<br />\nPose characters and ghosts freely to create haunting memories in the new snap mode. Perhaps you may even take unexpected spirit photos by accident...<br />\n-New Costumes<br />\nThe original costume lineup has been altered slightly, and new costumes have been added. Change the characters&#39; costumes to experience the investigation in different ways.<br />\nNote: “FATAL FRAME / PROJECT ZERO: Mask of the Lunar Eclipse Digital Deluxe Edition,” which includes the full game, is also available for purchase. Please be careful to avoid making a redundant purchase.</p>", "metacritic": null, "released": "2023-03-08", "tba": false, "updated": "2024-04-04T12:20:59", "background_image": "https://media.rawg.io/media/games/30f/30f3d0074d441d04ffed0229f07d02e9.jpg", "website": "https://www.koeitecmoamerica.com/fatalframe/mask/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 8, "beaten": 2, "toplay": 2}, "playtime": 12, "achievements_count": 41, "ratings_count": 1, "suggestions_count": 520, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 5", "PlayStation 4", "PC", "Nintendo Switch", "Xbox Series S/X", "Xbox One"], "developers": ["KOEI TECMO GAMES CO"], "genres": ["Adventure"], "publishers": ["Koei Tecmo Games"], "esrb_rating": null}