{"id": 938111, "slug": "muffins-on-stream", "name": "Muffins on Stream", "name_original": "Muffins on Stream", "description": "\"Muffins on Stream\" is an engagement game based on a video game in development called\"Muffin Tour Legacy\" that brings the fantasy world of Flourden to life on Twitch. As a streamer, you will use assets from \"Muffin Tour Legacy\" to create an interactive experience for your viewers, allowing them to join in on the fun and compete against each other in real-time.<br/>\n<br/>\r\nThe game is designed to be a fun, in-between game that can be played during live streams or as a giveaway for your viewers. Players will need to navigate the world of Flourden, uncovering clues and secrets about the \"baker dust\" and its potential to unleash great power and evil. With fast-paced gameplay, an engaging story<br/>\n<br/>\r\nBy purchasing \"Muffins on Stream\" on Steam, players will not only be able to enjoy the game but also support the development of the full game \"Muffin Tour Legacy\". The funds generated from the sales of \"Muffins on Stream\" will be used to further develop the game, improve its graphics and gameplay, and add new features and content. Additionally, the success of \"Muffins on Stream\" on Steam will help demonstrate the potential popularity of \"Muffin Tour Legacy\" and attract additional funding to bring the full game to fruition.<br/>\n<br/>\r\nMore about the game we want to make: In Muffin Tour Legacy, players take on the role of Molly, a skilled baker who owns the popular \"Muffin Legacy\" shop in the fantasy world of Flourden. Known for her exceptional muffin-making skills, Molly's world is turned upside down when a mysterious old man appears in her shop and offers her a rare ingredient called \"bake dust\" that can make her baking taste out of this world, but with the wrong usage, it can cause great evil.<br/>\n<br/>\r\nAs Molly embarks on a quest to save the universe from the Evil Bearclaw King and his pastry army, players will have to navigate the dangerous world of Flourden, uncovering clues and secrets about the \"baker dust\" and its potential to unleash great power and evil. Along the way, players will encounter various colorful characters and challenging obstacles as they strive to become the ultimate muffin-making hero. With fast-paced gameplay, an engaging story, and a unique fantasy setting, Muffin Tour Legacy offers players an unforgettable gaming experience.", "metacritic": null, "released": "2023-03-08", "tba": false, "updated": "2023-03-10T06:47:03", "background_image": "https://media.rawg.io/media/screenshots/584/584cb4ce77697874b3fcb8b7af834a24.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BatteryCake"], "genres": ["Casual"], "publishers": ["BatteryCake"], "esrb_rating": null}