{"id": 938173, "slug": "the-witch-of-fern-island", "name": "The Witch of Fern Island", "name_original": "The Witch of Fern Island", "description": "Welcome to the mysterious Fern Island! A lush temperate isle home to three great magical cultures - Boran, Apatut, and Kuqkwa - including one bright-eyed newcomer, Abrill. After crashing onto the island during her travels to a magical academy, the young witch makes the most of the situation, still eager to become a full-fledged Witch. Instead of waiting idly for her arrival, the Academy of Witches also decided to use this as an opportunity for young Abrill to demonstrate her mastery of magic… And unveil the secrets of the mysterious island.<br/><br/>But know this: Becoming the Witch of Fern Island isn't just about passing exams! It's about finding your place in the world, making friends, and most importantly, finding joy within every passing moment.<br/><br/><br/><br/><br/><br/><ul><li>Graduation means meeting the expectations of the Academy's Guardian Witch, and not by sitting through boring lectures. A witch learns on the job!<br/></li><li>Grow herbs and (magical) plants, raise animals of unusual nature, and experiment with enchantments of plants and animals.<br/></li><li>Develop Abrill’s own witch brand customizing her witch’s cottage as she sees fit through style and practicality.<br/></li><li>Of course, a witch is not merely a farmer! Brew magical potions at the cottage, craft arcane amulets, summon cute and surprisingly helpful familiars, and eventually, perform complex rituals to channel raw magic to command the weather.<br/></li><li>Did we mention that you’ll have the power to control your cat familiar? </li></ul><br/><br/><br/><br/><br/><ul><li>Explore the island at any pace between crystal ball calls from the Academy.<br/></li><li>Learn generations of magical arts here, and the witches’ stories accompanying them.<br/></li><li>Traverse the Island on foot, from the saddle of an elegant Tzoru, or dart across it aboard a flying broom - once the Guardian is satisfied with Abrill’s progress, of course.<br/></li><li>There's more than just history to find! Fern Island has been immersed in magic for centuries.<br/></li><li>Learn more not just about the island’s past, but also its myriad of magical plants, animals, insects,  and beautiful vistas.</li></ul><br/><br/><br/><br/><br/><ul><li>A witch is not just a mistress of magic and an expert in all things arcane. She's also a part of the community!<br/></li><li>Become immersed in the culture and society of the Boran, Apatut, and Kuqkwa to learn their traditions and beliefs, participate in festivals, and ultimately find true friends among dozens of people.<br/></li><li>Uncover each new friend’s stories and secrets as Abrill solidifies herself as a part of the community<br/></li><li>Extend out a caring hand with a witch's touch to assist the locals in their share of problems and leave a lasting impression on every individual to earn the title: The Witch of Fern Island!</li></ul><br/><br/><br/>", "metacritic": null, "released": "2023-05-01", "tba": false, "updated": "2023-05-05T03:07:27", "background_image": "https://media.rawg.io/media/screenshots/22f/22fc9725b086d6e6894fb424c9a892b9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 3, "toplay": 1}, "playtime": 9, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 480, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Enjoy Studio"], "genres": ["Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["Freedom Games"], "esrb_rating": null}