{"id": 938114, "slug": "oni-road-to-be-the-mightiest-oni-2", "name": "ONI: Road to be the Mightiest Oni", "name_original": "ONI: Road to be the Mightiest Oni", "description": "<h3>＜About This Game＞</h3><strong>■One-of-a-kind, unique action!</strong><br/>The protagonist, Kuuta, attacks the enemy using his club. Kazemaru sucks the enemy's spirit out of its body, and by destroying that spirit, Kuuta can then claim victory. Enjoy an all-new, unique co-op experience by playing both Kuuta and Kazemaru at the same time!<br/><br/><br/><strong>■A different way to level up!</strong><br/>Kisejima, where the game takes place, is divided into three areas with a variety of challenges ranging from fighting enemies to escort missions. The player can also level up by running away from pursuing monsters, like a game of tag, and collecting mushrooms that grow in clusters to purchase upgraded clubs.<br/><br/><br/><h3>＜What is ONI : Road to be the Mightiest Oni?＞</h3><strong>■Setting: Kisejima Island</strong><br/>The story takes place on Kisejima, a small island in the middle of the ocean. Here, it is said that the power that lies dormant within the local demon spirits can be drawn out by challenging them to trials, where ancient demons who were once defeated by Momotaro are summoned to battle. However, few have ever returned from Kisejima alive.<br/><br/><br/><br/><strong>■Characters: Kuuta, a demon warrior, and his spirit partner, Kazemaru</strong><br/>Kuuta, the protagonist, is the only survivor of the Demon King's army that faced Momotaro in battle. He and Kazemaru, a mysterious spirit that lives on Kisejima, team up to take on challenges of all shapes and sizes!<br/><br/><br/><br/><strong>■Artwork by KENEI DESIGN</strong><br/>Kisejima may not be large, but the colorful artwork by KENEI DESIGN, with its dazzling green meadows, looming forests, and plains of floating megaliths, offers a unique emotional impact unlike any other action game. Its solo creator has invented a mini-world in which each and every location is marked by its own memorable appeal. ONI is an invitation for players to enjoy a small-world experience, for a change!<br/>", "metacritic": null, "released": "2023-03-08", "tba": false, "updated": "2023-03-10T06:50:44", "background_image": "https://media.rawg.io/media/screenshots/f12/f1295094fdc1614175a2e42a17a366ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 428, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KENEI DESIGN", "SHUEISHA GAMES"], "genres": ["Action"], "publishers": ["Clouded Leopard Entertainment"], "esrb_rating": null}