{"id": 938165, "slug": "geko-entering-the-pipe-2", "name": "Geko: Entering The Pipe", "name_original": "Geko: Entering The Pipe", "description": "<strong>Geko: Entering The Pipe</strong> is a casual, fast-paced game where you play Geko, an unlucky lizard who ends up in two plumbing pipes while trying to catch a fly. Help Geko dodge all enemies and obstacles. Cockroaches, rats, scorpions and jets of steam are just some of the difficulties that Geko will encounter along the way. So slide and jump until you finally manage to escape the pipes, so that Geko can finally get back to his hunt (and if he's lucky, he won't fall into another pipe).<br/><br/><br/><br/>In this game, your only objective is to jump from one side to the other, dodging everything and everyone. It also requires you to slide faster along walls when necessary.<br/><br/><br/><br/><strong>Features:</strong><br/><br/><ul><li>Precise Gameplay: Responsive controls to bounce back and forth on walls and slide faster;<br/></li><li><strong>Fast</strong> and <strong>frantic levels</strong>: you'll never stand still. You'll always have to test your reflexes dodging enemies;<br/></li><li>A cute game with beautiful retro art, yet challenging;<br/></li><li>An adaptable adventure to play on keyboard and gamepad;<br/></li><li>Short gameplay: There are only 26 levels, but that will also depend on you, can you finish the game before losing all your lives?<br/></li><li>Challenge for speedrunners: Complete the game as quickly as possible and with as many points as you can;<br/></li><li>Challenging achievements;</li></ul><br/><br/><br/>Although this game has easy-to-learn controls, you'll need to learn from your mistakes until you've mastered each level. Are you ready for this reflex challenge?<br/>", "metacritic": null, "released": "2023-03-09", "tba": false, "updated": "2023-03-10T08:01:31", "background_image": "https://media.rawg.io/media/screenshots/e5f/e5f16e939f1d36f357b9770329eea9cd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mid-up Games"], "genres": ["Casual", "Indie"], "publishers": ["Mid-up Games"], "esrb_rating": null}