{"id": 938170, "slug": "guardians-frontline", "name": "Guardians Frontline", "name_original": "Guardians Frontline", "description": "Guardians Frontline is a Sci-Fi VR shooter where you wield powerful weapons and command robot armies that help you fight off enemies in single-player, co-op, and PvP game modes. Complete with a campaign, an in-game level editor and hundreds of community created maps, Guardians is a love letter to legendary games such as Starcraft and Halo.<h3>A UNIQUE SCI-FI SHOOTER</h3>Guardians Frontline blends the action-packed gameplay of FPS shooters with elements from  real-time strategy games, allowing players to shoot a wide variety of weapons but also spawn structures &amp; units. Kill an enemy with your machine gun while you simultaneously drop a 5 Ton Mech straight to the battlefield!<br/><br/><br/><h3>A RANGE OF WEAPONS &amp; VEHICLES</h3>Brought in to protect the federation, as a Guardian you have access to a huge range of weaponry and tools. Shoot the Gravity Gun to smash your enemies against the cliffs, and maneuver both mechs and spaceships to wreak havoc from the ground as well as the sky!<br/><br/><br/><h3>GUARDIAN FRIENDS… AND FOES</h3>The single player experience lets you protect the federation while they extract a new and mysterious energy source. In addition, the Guardians Frontline campaign and its missions can be played with up to 4 players in co-operative mode while up to 8 players can battle it out in tense and strategic PvP fights.<br/><br/><br/><h3>A FLOOD OF USER GENERATED CONTENT</h3>Guardians Frontline has a comprehensive but easy-to-use in-game level editor that allows anyone to build their own maps and make them public for the community to enjoy, leading to almost infinite replay value.<br/><br/><br/>", "metacritic": null, "released": "2023-03-09", "tba": false, "updated": "2023-12-16T00:12:59", "background_image": "https://media.rawg.io/media/screenshots/92b/92b325a3bcc7b81b71b6f8be0884e435.jpg", "website": "http://virtualage.io/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["virtualage"], "genres": ["Action", "Strategy"], "publishers": ["Fast Travel Games"], "esrb_rating": null}