{"id": 938317, "slug": "night-of-the-crescent-moon-jam-game", "name": "Night of the Crescent Moon (Jam Game)", "name_original": "Night of the Crescent Moon (Jam Game)", "description": "<p>GAME CONTAINS SOME FLASHING IMAGES AND DISTURBING CONTENT.\r\n</p>\n<p><strong>Note: </strong>This jam game was originally made in 2 weeks for #AdvJam2019 over on Game Jolt. I'm reposting it here.\r\n</p>\n<p>Night of the Crescent Moon is a text adventure game with some horror and puzzle elements. Traverse the moonlit wilderness in search of the spectral voice that calls out your name across the ether. Make use of items and learn key terminology to uncover the truth about the land after dark.\r\n</p>\n<p>Controls:\r\n</p>\n<ul><li>Use up, down, left, right keys to move around.\r\n</li><li>Use the 'enter' key to search an area or perform an action,  such as advancing a conversation\r\n</li><li>If text has a letter in braces, such as [t]his, use the key in brackets to perform that action.\r\n</li><li>Learnable key terms are in [braces]: learn these words during conversations with the 'l' key\r\n</li><li>Press 's' during a conversation to bring up a list of topics to choose from\r\n</li></ul>\n<p>Tips:\r\n</p>\n<ul><li>Search everywhere! There are secrets in many places uncovered from searching areas. When you obtain items, use them to find new paths to explore.\r\n</li><li>Talk to all the npc's: you never know what clues they will drop. Key terms are topics to ask each npc for info gathering; you can learn them from characters. Key terms are in [braces] when npc's mention them.\r\n</li></ul>", "metacritic": null, "released": "2023-03-09", "tba": false, "updated": "2023-03-10T09:31:32", "background_image": "https://media.rawg.io/media/screenshots/052/052ef1da19194109be9279c07c8995ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ROC Studios"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}