{"id": 938452, "slug": "smash-dungeon-chapter-1", "name": "Smash Dungeon - Chapter 1", "name_original": "Smash Dungeon - Chapter 1", "description": "Chapter 1\r\n<p>The first chapter of Smash Dungeon, a single player or two player couch co-op dungeon crawler.</p>\n<p>Get the full game on Steam here: Smash Dungeon</p>\r\nProcedural Dungeons\r\n<p>Smash Dungeon is a new game from indie developer Plastic Cow Games taking inspiration from arcade classics to bring you procedurally generated dungeon mayhem creating dungeons with traps, secret areas, shops and special rooms.<br/></p>\r\nHordes of Enemies\r\n<p>There are many enemies to defeat in the dungeons beneath, from shambling skeletons, spiders, exploding mutants and more - and that's before you reach the bosses.<br/></p>\r\nRelics\r\n<p>To help aid you in your quest for riches there are many Relics scattered throughout the dungeon such as a Dragons Tooth granting a chance to ignite an enemy, Orbs of protection, and many different types of Armour to help bolster your feeble stats and many more. Who knows you may even find some Legendary Relics.<br/></p>\r\nPower ups\r\n<p>To further help in your quest some enemies drop single use items such as bombs that can kill enemies or uncover secret areas, phoenix flames to incinerate your foe, extra health and more. Not to mention Weapon Boosts which can provide chain lightning, projectile slash effects and repel giving you that little extra to clear a room. <br/></p>\r\nHelp is at hand\r\n<p>But if it all seems a bit too much to handle don't worry, play with a friend in couch co-op. Fight through the hordes of enemies, dispatching them in a variety of ways such as Melee, bombs, Phoenix flames, chain lightning, towers and more.<br/>Scattered throughout the dungeon are a number of items to help bolster your chances of defeating some of the larger enemies and bosses, and coming away with the riches from beneath.</p>Streaming / Youtube<p>If you stream Smash Dungeon and have a link, I'd love to see. Leave a comment with a link to the video. Thanks.<br/></p>", "metacritic": null, "released": "2023-03-09", "tba": false, "updated": "2023-03-10T10:34:49", "background_image": "https://media.rawg.io/media/screenshots/41e/41eef5c0d5c7f9a45e262e01ec0927bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["plasticcowgames"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}