{"id": 938729, "slug": "a05-generator", "name": "A05-Generator", "name_original": "A05-Generator", "description": "<p><strong>Instructions: </strong>Use sliders to control the pattern seen on screen, use button to restart your scene.<br/></p>\n<p>This week in MS2 we were tasked with doing a 5-in-5, so I decided this was the perfect opportunity to integrate my generative design to my topic of 5-in-5. I'm exploring the physicality and virtuality of fashion with an emphasis on the four elements: fire, water, air and earth. For this specific assignment I decided to focus on Earth, and specifically plants. A while ago, I read Ian Stewart's book \"Beauty of Numbers in Nature\", and was fascinated about the generative patterns in leaves-- a phenomenon called Phyllotaxis. In Stewart's book, there's a formula for such phenomenon which I used in my script for this assignment. I started off by creating the pattern with preFabs (a sphere), as seen in the picture below. Once that was done, I decided it would be cool to add a trail in order to render the pattern a single (I did this by creating a texture on Procreate, and uploading the texture as a material for the trail), gradient line rather than a bunch of individual spheres. Lastly, I added sliders to control the input of the pattern. Below, you'll find some cool patterns I made in the process, Stewart's formula</p>\n\n\n\n\n\n<p><strong>Cool Degrees to test:</strong></p>\n<p>- The classic Phyllotaxis degree is 137.5</p>\n<p>- Cool hexagon-ish shape: 51 degrees, Step: 1</p>", "metacritic": null, "released": "2023-03-08", "tba": false, "updated": "2023-03-10T12:48:58", "background_image": "https://media.rawg.io/media/screenshots/082/08249fcff687348002f5646cacae89ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["mjgomsa"], "genres": [], "publishers": [], "esrb_rating": null}