{"id": 93886, "slug": "spearmint-mountain", "name": "Spearmint Mountain", "name_original": "Spearmint Mountain", "description": "<p><em>It was a cold and dark night at Spearmint Mountain.<br/></em></p>\n<p><em>A most powerful storm was raging. The worst storm of the century.</em></p>\n<p><em>Suddenly, a lightning bolt struck the sacred mint at the summit.</em></p>\n<p><strong>Find out what happens next, in Spearmint Mountain!</strong></p>\n\n<p>Spearmint Mountain is a short but sweet action platformer, where you take control of a sentient piece of mint that's fallen off the big, sacred Mint. Pick up spear plants, and poke them at enemies or they'll crush you! Throw the spears at walls to create platforms, and bounce off of them to reach new heights!</p>\n<p>There are also collectible mint coins hidden in difficult-to-reach locations. How many can you find?</p>\n\n<p><strong>Originally created in 48 hours for the 25th gm(48) gamejam</strong></p>\n<p>Game by Baku - @Bakufreak</p>\n<p>Music by Rohbert - @AlexRohbert</p>\n\n<p><strong>Changelog:</strong></p>\n\n<p>1.1.1:</p><ul><li>Increased default window size which was accidentally left very small in 1.1.0.</li></ul><p>1.1.0:</p><ul><li>Various changes to the game world, including new hidden areas and coins.</li><li>Bats now follow player character's head instead of feet.</li><li>Fixed a bug where spear platforms would become invisible and have collision enabled in incorrect rooms.</li><li>Added new ending.</li><li>Updated spike sprite.</li><li>Added new icons that are shown when aiming a spear at a moving platform, or at something outside the camera's view.</li><li>Added new spear breaking effect when throwing a spear at enemies or moving platforms.</li><li>Added new sound effects.</li><li>Added colliders around the moving platform at the end, and made the ending camera state properly reset in cases where it should reset.</li><li>Tweaked ground pound. It's now activated by pressing [Z] on keyboard or (LB) or (RB) on gamepad anytime while in mid-air.</li><li>Added typewriter effect to intro text, and made it not proceed automatically.</li><li>Added support for Qwertz, Azerty and Dvorak, in addition to Qwerty, keyboards. Pick your layout on the starting splash screen.</li><li>Other minor fixes.</li></ul>\n<p>Please note that the Ubuntu version of 1.1.1 was tested on a vm that doesn't support sound output. Please contact me if it doesn't work.</p>", "metacritic": null, "released": "2018-01-21", "tba": false, "updated": "2019-08-28T23:25:53", "background_image": "https://media.rawg.io/media/screenshots/7a4/7a4e5d0a8af225f5d23c0360230b238c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Baku"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}