{"id": 93904, "slug": "great-personality-guardians", "name": "Great Personality: Guardians", "name_original": "Great Personality: Guardians", "description": "<p><em>You are a new resident in a city with ambiance-filled spaces and exceptional people. As your life in this new space unfolds, you find that your actions shape your reality and your relationships...</em></p><p>The Great Personality Games are designed to be a different kind of dating sim, where you can get to know the characters and find out a little bit more about why you're attracted to them. The game was built with the idea that attraction is deeper than good looks and a sense of humor. There are 32 diverse characters in the Great Personality game that inhabit the world -- where you can play as any gender, date any person, and explore what it's like to get to know (and fall in love) with people with a wide array of backgrounds, abilities, and personalities. </p><p>Guardians is the first of four games in the series, featuring characters based on a segment of the Myers Briggs personality types that make up 40 - 45% of society. They're the hardworking, diligent individuals that make up the majority of the world we inhabit (inside and out of the game).</p><p>The project was created by Light Grey Art Lab, a collaborative arts space in Minneapolis, Minnesota -- with the help of 50 international artists - creating backgrounds, characters, and the behind the scenes easter eggs. For more information on the next three games and what we do at Light Grey Art Lab, visit our website: www.lightgreyartlab.com</p><p>The next game, Great Personality: Idealists is due out summer of 2014!</p><p>Keep an eye out for it and meet 8 new characters and explore the city, get involved with crazy new relationships, and much more.</p><p>Or send us a note!</p><p>hello@lightgreyartlab.com</p><p>Thanks for playing!</p>", "metacritic": null, "released": "2014-02-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a07/a076907c7a94b248d32e94f965aaa2c6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Light Grey Art Lab"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}