{"id": 939016, "slug": "operation-octagon", "name": "Operation Octagon", "name_original": "Operation Octagon", "description": "<p>Two superpowers fight over the region, building up infrastructure to be able to take down their opponent.</p>\n\n<p><strong>HOW TO PLAY</strong></p>\n<p>You win once you have wiped your opponent's octagons from the board.</p>\n<p>Each turn, you choose to either attack or build. During an attack action, you may take over octagons adjacent to ones you already own. During a build action, you may build one of the following buildings:</p>\n<ul><li>Barrack - Gives you 1 additional expand during your attack action.</li><li>Factory - Allows you to build 1 additional building during your build action.</li><li>Bunker - The opponent must spend an additional expand to clear or take over the octagons surrounding this building.</li><li>Mortar - Gives you the ability to, during your build action, clear a 3x3 area of enemy octagons that are not adjacent to a building they own.</li><li>Armory - Gives you the ability to, during your attack action, destroy a building you have an octagon adjacent to.</li></ul>\n<p>You must have a building space surrounded by four of your octagons to build there. Buildings are owned by whoever has the most octagons adjacent to them.</p>\n<p>Both players start with emergency bunkers. These can be placed during an attack or build action, assuming you have at least one octagon adjacent to the building space.</p>\n<p>Villages just block building spaces. Bridges allow you to expand through that building space. They can both be removed using an Armory.</p>\n<p>Cities allows you to build in the building spaces adjacent to their octagon without fulling surrounding the building space.</p>\n<p>Mountains cannot be taken over.</p>\n<p>Lakes give back 1 expand when you expand into them.</p>\n\n<p><strong>CREDITS</strong></p>\n<p>Andrew Hunter - Design, UI and UI Art, Programming</p>\n<p>Hugh Williams - Programming, Art</p>\n<p>Daniel Speal - Sound Effects</p>\n<p>Matthew Poczatek - Music</p>\n<p>Michael Fulmer - Concept Art</p>\n<p>William Baker - Lead Playtester</p>\n<p>Cale Johnson - Playtester</p>\n<p>Caleb Skelton - Playtester</p>\n<p>Jim Hunter - Playtester</p>\n<p>Peden Jones - Playtester</p>", "metacritic": null, "released": "2023-03-07", "tba": false, "updated": "2023-03-10T15:12:32", "background_image": "https://media.rawg.io/media/screenshots/3a2/3a2abb5bd9774bda0b97698c8c5a5b1f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["thedarkloon"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}