{"id": 939077, "slug": "global-eden", "name": "Global Eden", "name_original": "Global Eden", "description": "<p><strong>[! Downloads have been patched, please ensure you downloaded the version that is 91Mo!]</strong><br/></p><p>Global Eden started off as a writing project. A collection of disjointed texts about the idea of the world being a global, idyllic garden that we try to inhabit as well as we can, among the heaviness of pain, the heaviness of history, the disempowerment of loneliness, but also the strength of love.<br/></p>\n<p>These snippets of text slowly grew to become videos, and a game—as a playable <em>experience</em>—became the evident medium for sharing that atmosphere. Reading and gaming both happen in a space of relative intimacy and closeness.<br/></p>\n<p>As for now, it features its first scene, <em>Spirit</em>, where you get to pilot a B2 Spirit bomber while reading a poem about love.</p>\n<p>The project is currently under active development and will feature a sequence of short playable experiences. Check new releases regularly to get the new experiences!<br/><br/>I hope you enjoy playing this experience!</p>\n<p>------------------------------------------------------------<br/></p>\n\n<p><strong>Current play time</strong>7-8 minutes</p>\n\n<p><strong>Playing recommendations<br/></strong>Play alone, ideally in the dark or dim light, with good a good sound system or headset, not too loud.<br/></p>\n<p><strong>Gamepad Support: </strong>Yes<br/>(Left Stick: movement — Right Stick: camera — RT: trigger — A: confirm)<strong><br/>Keyboard Support: </strong>Yes(WASD: movement — Mouse pointer: camera — Click: trigger / confirm)</p>\n<p><strong>Trigger warnings<br/></strong>Non-explicit mentions of generally distressing topics such as war and loss, general atmosphere of grief. Viewer discretion advised.<br/></p>\n<p><strong>Recommended settings</strong><br/>i7 CPU<br/>16Go RAM<br/>Nvidia GeForce GTX 1060<br/><br/><strong>Okay settings</strong><br/>i5 CPU or equivalent<br/>8Go RAM<br/>Nvidia GeForce GTX 760</p>", "metacritic": null, "released": "2023-02-25", "tba": false, "updated": "2023-03-10T15:40:18", "background_image": "https://media.rawg.io/media/screenshots/8e6/8e61b4955e61ef8e3dc683e9f2b5bb3b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["juliekerndonck"], "genres": [], "publishers": [], "esrb_rating": null}