{"id": 9390, "slug": "retro-winter-sports-1986", "name": "Retro Winter Sports 1986", "name_original": "Retro Winter Sports 1986", "description": "\"Retro Winter Sports 1986 is a surprisingly enjoyable title that not only brings six classic winter sports in the retro graphics, but, what is essential, brings really enjoyable gameplay which urge you to tap on the game icon more often. Overcoming your own record and trying to find ways to achieve a better time will keep you entertained for a long time. The price which the developers ask for this game, is just a symbolic price compared to how much fun you have with the game.” 8.5/10 - sector.sk <br/><br/>Do you remember the good old home computer sports games? Relive your youth in this beautiful pixelated remake of the evergreens.<br/><br/>Participate in the 1986 winter sports tournament and compete against other world-class athletes for international recognition. <br/><br/>Six different, action-packed events await you in a beautiful retro-style winter setting. Choose the country you want to represent from 12 different nations. <br/><br/>Practice to master your skills in training mode and demonstrate your abilities against the computer in the tournament mode or compete against your friends in hot seat mode for up to eight players. Will you be the one who takes the gold in the end?<br/><br/>Let’s compete like it’s 1980something!<br/><br/>Features<br/>- Six winter sport events: Ski Jump, Biathlon, Bobsled, Speed Skating, Curling, Slalom<br/>- Compete against friends (up to eight players hot seat mode) or the computer<br/>- Unique controls perfectly fitted to mobile devices <br/>- Choose between 12 different nations <br/>- Leaderboards and achievements<br/>- Handcrafted code by The Bitfather, the retro minds behind Pixel Heroes: Byte &amp; Magic!", "metacritic": null, "released": "2016-12-07", "tba": false, "updated": "2019-07-30T07:24:59", "background_image": "https://media.rawg.io/media/screenshots/e56/e5639be35a56ae9f839d15d3404c0bce.jpg", "website": "http://www.headupgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Headup Games"], "genres": ["Sports", "Arcade", "Casual"], "publishers": ["Headup Games"], "esrb_rating": "Everyone 10+"}