{"id": 93905, "slug": "switch-hook", "name": "Switch Hook", "name_original": "Switch Hook", "description": "<p>\n<em><strong>This game is created for 7DRL-2016 challenge.</strong></em>\n</p>\n<p>\r\n\tThis is a pretty abstract game, but if you need a story, here it is:\r\n</p>\n<p>\n<em>Deep in the Dungeons of Doom lies an ultimate magical artefact known as Amulet of Yendor guarded by hordes of monsters. In spite of the aforementioned hordes adventurers keep trying to retrieve the artefact and sometimes one of them succeeds. But the Amulet is still there... because IT'S MAGIC! Anyway, the time has come for you to try your luck! And you don't need a sword or a spellbook, because you have your trusty <strong>Switch Hook</strong>!</em><br/>\n</p>\n<p>In the game you control a hero equipped with a switch hook (http://zeldawiki.org/Switch_Hook). This fancy device lets you switch places with monsters dealing them some damage on the way. When there are few monsters on a level and they are weak and slow, you can use the hook like a ranged weapon without much thought, but later in the game you'll need to choose a right target each turn and use walls, columns and passages to avoid enemies' attacks. There are 20 tiny levels and 8 types of monsters in the game. All monsters except basic \"undead warriors\" have some uniques features, for example some of them can't be damaged by the hook and others explode when they die.</p>\n<p>\r\n\tThe game is very simple, still there are some not very obvious moments. I should have made a help screen or something, but it's 7DRL, there is always not enough time... While I'm implementing that help screen, here are some tips for you:\r\n</p>\n<ul>\n<li>1 point of heath is restored after completing a level, no matter how you performed on it</li>\n<li>1 additional point of health is restored after completing a level <strong>without killing any monsters</strong> (2 in total)</li>\n<li>If you've <strong>killed all monsters</strong> on a level, a health shard (that red thing) is spawned on the next level. Health shard restores 1 point of health and if your health is full, it increases your maximum health</li>\n<li>You don't need to destroy \"passive monsters\" (i.e. <strong>Heads</strong> and <strong>Bombs</strong>) to get the health shard bonus</li>\n<li>\"Explosive monsters\" (i.e. <strong>Bombs</strong> and <strong>Toads</strong>) instantly kill all surrounding monsters when explode, but do just 1 point of damage to you</li>\n<li><strong>Cupids</strong> can shoot you only when they are within a certain range from you, 3-4 hexes to be exact. So you need to get either closer or further than that to be safe from their arrows</li>\n<li><em>Shift-click</em> a monster to see tiles it can attack from its current position (especially useful with <strong>Cupids</strong>).</li>\n</ul>\n<p><em>Made with Haxe + OpenFL</em></p>", "metacritic": null, "released": "2016-03-13", "tba": false, "updated": "2019-08-28T23:25:53", "background_image": "https://media.rawg.io/media/screenshots/ca9/ca9f63d53fe0d9c2008315afd16625f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Android", "Web"], "developers": ["watabou"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}