{"id": 939029, "slug": "cyber-sentinel-itch-piyushpise", "name": "Cyber Sentinel (itch) (PiyushPise)", "name_original": "Cyber Sentinel (itch) (PiyushPise)", "description": "<p><strong>Motivation :</strong> The game is motivated by the theme of ‘Glitch’, Set inside the motherboard of a computer, the PC is under attack by a malware infestation. Sensitive unbacked documents are at stake, the PC has deployed its SPD(Software Protection Department) units to fight against this attack. You are one of these front-line units.</p>\n<p>Moving across the motherboard, clean it’s components of the infestation and eliminate the threat.\r\n</p>\n<p><strong>Gameplay </strong>: It is a platform based, third person shooter. There are three levels, each level involving cleaning a specific component attached to the motherboard, i.e, GPU, CPU, RAM. \r\n</p>\n<p>The SPD units use QVEs(QuickKill Virus Eliminators) to shoot down the viruses. \r\n</p>\n<p>You have to keep track of your unit’s health bar and your QVE’s ammo count to make sure you don’t run out of any of the two. \r\n</p>\n<p>The viruses appear as bouncing enemies who reduce health points upon coming in contact with the SPD unit. Keep distance from them.`\t\r\n</p>\n\n<p><strong>Graphics :</strong>  To help capture the theme of ‘Glitch’, the game's graphics are designed to create a cyberpunk-themed environment with neon lights. The game's sound design also aims to achieve a cyberpunk like feel with the electronic sound effects.\r\n</p>\n<p>The platform obstacles are modelled with capacitors, transistors, IC chips and other components you find on a motherboard, to make the environment simulate the feel of the battles taking place inside computer hardware.\r\n</p>", "metacritic": null, "released": "2023-03-07", "tba": false, "updated": "2023-03-10T15:17:35", "background_image": "https://media.rawg.io/media/screenshots/13c/13ca08120f80ce249fb0019b7a2680e0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PiyushPise"], "genres": ["Action"], "publishers": [], "esrb_rating": null}