{"id": 939148, "slug": "moonfever", "name": "Moonfever", "name_original": "Moonfever", "description": "<p><strong>Moonfever is a game in development.</strong> Designed by  yours truly (Yanick Bourbeau) using the Godot engine. It's a top-down 2D  game that takes place in space, where you take control of a spaceship  to fight the enemy factions. The game can be played online or alone  (against robots), or a mix of both (online AND with robots). The game  runs well with up to 32 players. I'm working on increasing the limit  even though it's already very good.\r\n  </p>\n<p>The goal is very clear, you choose a faction and you have to destroy  the starbase of the opposing factions before they destroy your starbase.   To do this you can build the ship of your dreams, the game comes with a  built-in editor that allows you to do whatever you want (mostly).\r\n  </p>\n<p>Each ship is made of blocks, these blocks offer different  functionalities (Armor, energy generation, shield, reactor, etc.) And  some blocks of higher quality are only available if your starbase has  done the necessary research.\r\n  </p>\n<p>The economy of the game revolves around mass. You collect mass by  mining asteroids or collecting the remains of charred ships. This mass  can be used to repair your ship, improve it or make another one. If you  feel like a team player you can upgrade your starbase to make it more  efficient.\r\n  </p>\n<p>At the moment the game is only a prototype and not a finished product  even if it is already fully functional. As the project progresses I  will be posting playable versions as well as more details about the  internal workings.\r\n  </p>\n<p>I wish you a lot of fun playing Moonfever.\r\n</p>\n<p>You can learn more by visiting https://moonfever.org<br/></p>", "metacritic": null, "released": "2023-03-07", "tba": false, "updated": "2023-03-10T16:15:58", "background_image": "https://media.rawg.io/media/screenshots/072/0721b653bc9262f584a040925d521f67.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Shadebob Games"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}