{"id": 93923, "slug": "a-matter-of-murder-itch", "name": "A Matter of Murder (itch)", "name_original": "A Matter of Murder (itch)", "description": "\"A Matter of Murder deftly weaves in rouge-like elements via a series of challenging logic puzzles. Add to this some beautifully stylized artwork and you'll find yourself wondering where the last few hours of your life went.\" <br/>— The Care and Feeding of Nerds<br/><br/>\"It's like every murder mystery dinner you ever attended, except way deadlier and way more fun. Trust us.\"<br/>— FemHype<br/><br/>\"There is also a more free-form mode outside of campaign that generates a fresh mystery for the player. It's a big promise, but one on which I'm hopeful A Matter of Murder will deliver.\"<br/>—Push to SmartABOUT THE GAME<p>Zounds! One of the guests at an English house party has fallen victim to cold-blooded murder. Your weekend in the country is ruined! What choice have you but to ask your fellow guests probing questions, search the house, draw astonishingly insightful conclusions and solve the crime?</p><p>A Matter of Murder is a point-and-click puzzle game with rogue-like elements. The details of each murder are procedurally generated, so each case is different every time you play with progressively more challenging logic puzzles. A Matter of Murder can also randomly combine logic puzzles together to create a dynamically generated case file for high replayability. </p><p>To check out some gameplay in action, visit The Jessa Channel on YouTube.</p>FEATURES<p>• Procedurally generated content offers a different experience for each play-through.<br/>• Interact with colorful suspects and carefully investigate your surroundings for clues.<br/>• Hand-drawn character art brings the Victorian setting to life in all its murderous glory.<br/>• Campaign mode provides a wide-range of increasingly difficult logic puzzles.<br/>• Dynamically generates unique case files by randomly combining logic puzzles together.<br/>• In-game notebook automatically keeps track of the clues you collect.<br/>• Customize the experience and add your friends as suspects!<br/>• Original soundtrack with responsive musical underscoring.<br/>• Immersive and haunting soundscape places you at the center of the storytelling experience.<br/>• Randomly implemented plot-altering elements can change the course of the story.</p><p>Follow us on Twitter: @amatterofmurder<br/>Find us on Facebook: A Matter of Murder<br/>Or visit us online: www.worthingandmoncrieff.com</p>", "metacritic": null, "released": "2016-07-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7f9/7f91deffa5f938bb3d430124f376d8c1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Worthing & Moncrieff"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}