{"id": 939218, "slug": "manifest-itch-xeph-mialere-pendulumstalker-funchil", "name": "Manifest (itch) (Xeph, Mialere, pendulumstalker, funchili, StaticClassOG, Michaelissa, Team Manifest)", "name_original": "Manifest (itch) (Xeph, Mialere, pendulumstalker, funchili, StaticClassOG, Michaelissa, Team Manifest)", "description": "<p><strong>This demo is an alpha, and is still in active development. Some features may not be fully implemented yet. A list of intended/future features can be found near the bottom of this page. Follow our page or add this game to a collection to be notified when we update and full-release!</strong><br/><br/>Manifest melds tower-defense and first person shooter gameplay to create a unique and dense experience. Complete missions and destroy a new insect threat that has been infesting various planets. Upgrade your arsenal as you progress and personalize your load-out. Fend off hordes of insects, but don't be surprised when new mutations pop up. Will you rid the system of this menace?</p><p>(30-60 minutes.)</p><p>NOT FINAL RELEASE. MANY ASSETS ARE PLACEHOLDER/TEMPORARY.</p>\r\n\r\n\r\nKey Features<p>Seeking to innovate on the admittedly limited TD/FPS genre, Manifest brings several features that fundamentally challenge the way both genres have traditionally been approached.</p>\n<ul>\n<li>A new take on Tower Defense - Freely place turrets and walls, no grid required. But be careful where you place them; if they're within an enemy's reach, they might get hit! Though maybe that's just what your strategy needs.</li>\n<li>First Person Support - Your turrets can't always handle it themselves! Your gun can be used for both damage AND support, so make sure to put it to good use!</li>\n<li>Progression - Various permanent upgrades can be unlocked through planet-unique shops or your Research Tree, and can be equipped through your load-out.</li><li>Customization -  Mix-and-match gun mods to your heart's content! Want your piercing bullets to stun instead of dealing damage? Want a grenade launcher that buffs turrets? Play how you want! Despite our limited turret selection, their permanent upgrade options will provide ample room for strategy and optimization.</li>\n<li>Hours of content, probably! - We're a small team, and we're on a deadline. We aren't gonna promise you the world. But we're passionate about delivering a tight gameplay loop with depth for those who look. And hopefully, that's what we're going to do!</li></ul>\r\n\r\n\r\nPlanned additions:\r\n<ul>\n<li>4 maps, minimum of 4 missions each (easy, normal, and 2 challenge missions)</li><li>3 basic enemy types, minimum of 4 different mix-and-match mutations (such as stealth or regeneration).</li><li>Minimum of 8 extra turret mods (2 per turret type, likely one support and one damage)</li><li>Minimum of 9 extra gun mods (3 each for damage, support, and utility)</li><li>A skill tree system (\"Research Tree\") for buying mods and flat upgrades (like damage or fire rate increases)</li><li>Loadout system for equipping your desired mods; 3 gun mods at once, and one mod for each turret. (Might add the ability to mix-and-match turret mods too, MAYBE.)</li></ul>\n<p>Projected Full Release Date: June 2023, both on itch.io and Steam</p>", "metacritic": null, "released": "2023-03-07", "tba": false, "updated": "2023-03-10T16:49:01", "background_image": "https://media.rawg.io/media/screenshots/bd6/bd61a155b4bba467f19f90feafe26a1e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Mialere", "StaticClassOG", "Xeph", "pendulumstalker", "funchili", "Michaelissa", "Team Manifest"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}