{"id": 939374, "slug": "4-checkers", "name": "4 checkers", "name_original": "4 checkers", "description": "<p>Checkers is a classic board game that has been enjoyed for generations. It is played on a 64-square board with 12 pieces for each player, typically red and black in color. The objective of the game is to capture all of your opponent's pieces or to block them in such a way that they cannot make any more moves.</p>\n<p>In the modern version of the game, players can enjoy a built-in 4-player mode, allowing for a more exciting and challenging experience. The players are divided into two teams, with each team controlling six pieces of the same color. Each team takes turns moving their pieces around the board, attempting to capture the other team's pieces and block their movements. The game ends when one team has captured all of the opposing team's pieces or when one team is unable to make any more moves.</p>\n<p>Another exciting feature of the game is the ability to play against a robot. This feature allows players to hone their skills and practice their strategies against an opponent that is programmed to be challenging and unpredictable. The robot can be set to different levels of difficulty, making it suitable for players of all skill levels.</p>\n<p>Finally, the game also allows players to change the color of the board, adding a new level of customization and personalization. Players can choose from a variety of different board colors, ranging from classic wood finishes to bold and vibrant hues. This feature allows players to create a unique and personalized gaming experience that is tailored to their individual tastes and preferences.</p>", "metacritic": null, "released": "2023-03-06", "tba": false, "updated": "2023-03-10T18:05:16", "background_image": "https://media.rawg.io/media/screenshots/537/5379b29cc7ce49d6154d2215b3e38867.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Android", "Linux", "macOS", "PC"], "developers": ["carrot"], "genres": [], "publishers": [], "esrb_rating": null}