{"id": 9395, "slug": "microbots", "name": "Microbots", "name_original": "Microbots", "description": "Danger, a Microbot infestation is imminent!  Test your skill, strategy and speed in this great arcade puzzle game that will keep you addicted for hours.<br/><br/>Watch a video of Microbots:<br/>http://bit.ly/sd-hm<br/><br/>You are Digital Pest Control, and it&amp;#39;s up to you to eradicate the Microbot plague.  They might look cute, but left alone they will infest the level.  It&amp;#39;s your job to guide the little vermin to the targets, where they will be blasted by your Exterminator-bot.<br/><br/>Draw paths in any direction and the Microbots will blindly follow.  Get them to the correct target to score.  But watch out, they may need to make their way around each other, past obstacles or even have their colour converted.  <br/><br/>Each level requires a new strategy to score big.  Work fast and smart and you will keep scoring more, don&amp;#39;t forget to look out for the bonuses!  <br/><br/>Rack up the points to gain stars, these will unlock more levels and hand you Game Center achievements and points.  There are 16 unique levels, each with a Game Center leaderboard, so you can pit your wits against players across the world. <br/><br/>With retro styling, great audio and addictive gameplay, Microbots will keep you coming back for more.  <br/><br/>Game Features<br/>* Addictive gameplay<br/>* Fun combination of skill, strategy and speed<br/>* 4 zones<br/>* 16 unique, endlessly repayable levels<br/>* Cool retro graphics<br/>* Fab audio<br/>* Game Center leaderboard for all levels, plus zones and overall<br/>* Game Center Achievements<br/>* Games saved for later", "metacritic": null, "released": "2013-04-19", "tba": false, "updated": "2019-10-22T14:30:27", "background_image": "https://media.rawg.io/media/screenshots/7c3/7c3d8484a5c369cc605311b17a6b2af1.jpeg", "website": "http://www.saucedigital.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sauce Digital"], "genres": ["Strategy", "Arcade"], "publishers": ["Sauce Digital"], "esrb_rating": "Everyone 10+"}