{"id": 9396, "slug": "the-football-playbook-tactical-puzzles", "name": "The Football Playbook: Tactical Puzzles", "name_original": "The Football Playbook: Tactical Puzzles", "description": "The Sun Newspaper - &amp;quot;...A brilliant test of your footballing vision, this app is infuriatingly addictive...Who would have thought you could make a puzzler title based on football? Genius.&amp;quot;<br/><br/>The Football Front - &amp;quot;For me, the most satisfying point is when you create space and exploit the opposition movement in the game. It’s a bit like when you score a [delightful] pass and move goal on FIFA, you think fondly of yourself thinking, ‘I created that.’&amp;quot; <br/><br/>Innovative - Fantastic concept and excellently done! (5/5 stars)<br/><br/>Must Have! - Never really seen a game about soccer quite this addicting Really easy and fun to play Even if you&amp;#39;re not a soccer fan, it will be easy to pick up (5/5 stars)<br/><br/>The best - Best puzzle football game in the world (5/5 stars)<br/><br/>Great! - Great game! Different possibilities to solve the same puzzle! Brings diversity and fun! Recommend it! (5/5 stars)<br/><br/>Great game! - Love this game! Smooth transitions, doesn&amp;#39;t lag at all. Gameplay is nice. Would recommend it. (5/5 stars)<br/><br/>Brilliantly addictive - Love this so far. Can tell its going to be incredibly addictive. It&amp;#39;s the Football version of that Candyland game. (5/5 stars)<br/><br/>.... its Brilliant! Highly recommended 5/5 stars<br/><br/>Warning: very [addictive]! - Great concept, simple but beautiful design, and seriously [addictive]! (5/5 stars)<br/><br/>-------------------------------------------------<br/><br/>The Football Playbook is a simple yet addictive tactical football game made by independent game developer, Super Rock Games. <br/><br/>The Football Playbook is a collection of tactical puzzles. In each puzzle you are presented with a snapshot of a football match. To successfully complete the puzzle you must score a goal. Use a combination of timing, movement and key passes to get your players into a scoring position. <br/><br/>Features<br/>- Over 200 unique puzzles.<br/>- Innovative control mechanism and game mechanic.<br/>- Challenging and Addictive Game-play.<br/>- Top down god-like view of entire pitch.<br/>- Complete control of all your players movements.<br/>- Ability to create and exploit space anywhere on the pitch. <br/>- Battle against different formations and defensive strategies.<br/>- Complete seasons and earn badges.<br/>- Action takes place on a full pitch, 11 v 10.", "metacritic": null, "released": "2013-05-01", "tba": false, "updated": "2019-10-22T14:30:27", "background_image": "https://media.rawg.io/media/screenshots/628/628af54268b6b79ceb74d5fb428d794f.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SUPER ROCK GAMES"], "genres": ["Strategy", "Sports"], "publishers": ["Super Rock Games"], "esrb_rating": "Everyone 10+"}