{"id": 939649, "slug": "ploko", "name": "Ploko", "name_original": "Ploko", "description": "EN\r\n<p>Ploko is a cozy VR game that lets you build worlds that will come to life. Pick up a box containing pieces and start laying them on your model. It's a relaxing experience, with progressive music (the more advanced your world is, the richer the music will be). Don't hesitate to look for the cats, they are numerous in the game ;)</p>\n<p>We are a team of 3 people (developer, 3D artist and sound designer) from France. Feel free to follow the game on Twitter (https://twitter.com/PlokoVr) or Mastodon (https://mastodon.gamedev.place/@PlokoVR)</p>\n<p>The game is available for a small fee at the moment, to support the development team. But if you want to playtest and give us feedback on the game don't hesitate to ask, we will send you a key ;)<br/></p>\n<p>_____________________________________________________________________________</p>\r\nFR\r\n<p>Ploko est un jeu cosy en VR qui vous permet de construire des mondes qui vont prendre vie. Prenez un bac contenant des pièces et commencez à les poser sur votre maquette. C'est une expérience détente, avec une musique progressive (plus votre monde est avancé, plus la musique sera riche). N'hésitez pas à chercher les chats, ils sont nombreux dans le jeu ;)</p>\n<p>Nous sommes une équipe de 3 personne (développeur, artiste 3D et sound designer) venant de France. N'hésitez pas à suivre le jeu sur Twitter (https://twitter.com/PlokoVr) ou Mastodon (https://mastodon.gamedev.place/@PlokoVR)</p>\n<p>Le jeu est mis à disposition contre paiement pour l'instant, pour supporter l'équipe de développement. Mais si vous souhaitez playtest et nous faire des retours sur le jeu n'hésitez pas à demander, nous vous enverrons une clé ;)<br/></p>", "metacritic": null, "released": "2023-03-02", "tba": false, "updated": "2023-03-10T20:18:42", "background_image": "https://media.rawg.io/media/screenshots/2cb/2cb90cbf0c646026a588fa5b86ed2b68.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lamamour", "W3dge"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}