{"id": 939794, "slug": "project-nightlight", "name": "Project: Nightlight", "name_original": "Project: Nightlight", "description": "<h3>WELCOME TO THE DEPARTMENT</h3><strong>“What was that?”</strong><br/>It’s quiet. Too quiet. But the night watch always is. The Department is empty, and your only company is the voice on the walkie-talkie. After collecting your gear, your shift begins, but tonight will be unlike any other.<br/><br/><strong>Project: Nightlight</strong> is an atmospheric VR horror game where, as a security guard, it is your job to protect the facility.<br/>It would appear there has been a breach in security when it becomes apparent that something has been tampered with.<br/>At the mercy of the walkie-talkie’s instruction, you are urged deeper into the building to ensure the safety of The Artifact.<h3>Key Features</h3><br/><h3>An Unsettling Narrative</h3>The further you go, the more you’ll learn. But secrets are kept hidden for a reason. Someone is hiding something, and as the night progresses, you’ll uncover the dark truths locked behind closed doors.<br/><br/><h3>VR Interactivity</h3><strong>Project: Nightlight</strong> immerses you in its world by allowing you to interact with the environment around you. You can:<br/><ul><li> Break chains with your bolt cutters <br/></li><li> Melt locks with a blowtorch<br/></li><li> Physically interact with doors, shutters, environmental clutter</li></ul>And do more of what you’ve come to expect with Virtual Reality.<br/><br/><h3>Unseen Threats</h3><strong>“Someone there?”</strong><br/>Isolation can make your mind wander; see things, even. Are you being watched? Or is it all in your head? Use the weapon developed by the facility to reveal the horrors that might be dwelling in the dark.", "metacritic": null, "released": "2023-03-10", "tba": false, "updated": "2023-03-13T03:28:17", "background_image": "https://media.rawg.io/media/screenshots/f85/f85f3b249a887d811094d1303474c4aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fringe Realities"], "genres": ["Action", "Adventure"], "publishers": ["Fringe Realities"], "esrb_rating": null}