{"id": 939765, "slug": "chronicles-of-forgotten-tears", "name": "Chronicles of Forgotten Tears", "name_original": "Chronicles of Forgotten Tears", "description": "Chronicles of Forgotten Tears, narrates the events that unfold in a fantasy world populated by humans, elves, dwarves, orcs and many other magical creatures, where wizards from their towers plot to overthrow kingdoms and arch-clerics march to flush out evil in every corner of the lands of Vaegoth.<br/>You are a young peasant. You live in a remote region of a vast kingdom on an ancient farm run by your mother.<br/><br/><br/><br/>Everything goes on as usual when your life is turned upside down by a terrible event. You decide to set out on a long journey in search of your origins.<br/>Your father, in fact, was the powerful wizard Welling, who was murdered under mysterious circumstances.<br/><br/>Chronicles of Forgotten Tears is an adventure that takes place in different places and times, Main Chracter will get to know dozens of characters, all with their own history and backgrounds.<br/><br/><br/>You will have to make important decisions in order to achieve your goals. Nothing is already written; every choice will change the story significantly.<br/><br/>You will have to fight, and you will be able to do so thanks to a sophisticated card game.<br/><br/>But most of all, you will have to interact with the many girls you will meet in your adventures, woo them and, if you are up to their standards (or if they are up to yours), you will be able to live a story with them.<br/><br/>The game consists <br/>6000 images <br/>100 Videos<br/>100 000 Words<br/>15 Girls unlockable through encounters<br/>20 Card battles<br/><br/>During the game you will be able to have encounters with beautiful and exotic women of many fantasy races, in these encounters your choices will be determined by the success of the encounter, you can see how your date went from the conquests screen.<br/><br/>The protagonist will be involved in various encounters with swordsmen, warriors, monsters, barbarians, tavern drunkards, wizards, pirates and many others will be called upon to choose his \"best cards\" by means of the deck builder and will be able to conquer new cards with each encounter.", "metacritic": null, "released": "2023-03-10", "tba": false, "updated": "2023-11-30T08:01:42", "background_image": "https://media.rawg.io/media/screenshots/d3b/d3b5f880a9b01c2980e9a9ee3df4bb44.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 511, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Old Owl Game"], "genres": ["Action", "Adventure"], "publishers": ["Old Owl Game"], "esrb_rating": null}