{"id": 939771, "slug": "san-guo-xun-jiang-chuan", "name": "三国：寻将传", "name_original": "三国：寻将传", "description": "The Three Kingdoms: The Story of Seeking the General is an innovative strategy game of the Three Kingdoms War that does not draw cards.<h3> The real name will be unique </h3><br/>There are nearly a thousand real celebrities here, and each of them is the only one in the whole service. Every famous general is subdued by arrest. There is no brainless card here. All famous generals are unique.<h3> Combat instant strategy </h3><br/>The battle here is directed, and it is a test of technology. The use of restraint relations between arms and the real-time operation of mobile commands will change the outcome of the war.<h3> Real time strategy </h3><br/>Here, not only courage but also intelligence are needed. Real-time tactics can also change the outcome of the war. Immediate command and strategic confrontation. A rich knack system, a combination of multiple tricks.<h3> Map of more than 1000 famous cities </h3><br/>There is a huge real city system here, with thousands of historical real-name cities, which are composed of five levels: county, county, state, king and imperial city, for the monarch to conquer and occupy and implement the decree.<h3> True restoration respects history </h3><br/>The image design and architectural style design of all generals are strictly based on the drawing of documents. Hard-core realism, the armor, clothing, accessories and other features of the leaders really restore the historical and cultural values of the late Han Dynasty.", "metacritic": null, "released": "2023-03-09", "tba": false, "updated": "2023-03-13T02:59:49", "background_image": "https://media.rawg.io/media/screenshots/e0d/e0d25f2f4a4046f2c058df3c380ad3fb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 460, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["名将唯一不抽卡 武将招降全靠抓"], "genres": ["RPG", "Strategy", "Simulation", "Massively Multiplayer"], "publishers": ["即时战斗真谋略 排兵布阵扭乾坤"], "esrb_rating": null}