{"id": 939774, "slug": "aa-soldiers", "name": "AA Soldiers", "name_original": "AA Soldiers", "description": "Read about the mission on the menu screen and select the level to start the game.<br/>Player becomes an anti-aircraft soldier, lock on the enemy aircraft and shoot missiles. <br/>At the level of the anti-aircraft, the player can not move.<br/>The enemy aircrafts are mainly old propeller aircrafts, with multiple appearances.<br/>The allies include multiple multi-role jet fighters, self-propelled anti-aircraft guns, and the missile destroyer.<br/>Each mission has its own set of conditions for completing levels.<br/>There is also a level to operate the aircraft.<br/>At that level, you operate aircraft and destroy enemies with guided rockets.<br/><br/>Common Matters<br/>Press the ESC key on the menu screen to display the options screen.<br/>The commander tells the player in a radio conversation dialog which target to destroy.<br/>The difficulty level of this game is lower. It may feel unsatisfying to avid game players.<br/>The game's progress is automatically saved.<br/>In order to play the next level, you must complete the previous level.<br/><br/>How to operate an anti-aircraft soldier<br/>Mouse: moving viewpoint<br/>ESC: Pause screen<br/>Lock-on when you focus on the enemy.<br/>Lunch a missile with a left mouse click.<br/><br/>How to operate an aircraft<br/>Mouse up: Aircraft descends<br/>Mouse down: Aircraft ascends<br/>Move mouse sideways: Aircraft rolls<br/><strong>Lateral movement: A and D keys on the keyboard (important)</strong><br/>Lunch the guided rockets with a left mouse click.<br/>ESC: Pause screen<br/>These operations can not be changed from options.", "metacritic": null, "released": "2023-03-09", "tba": false, "updated": "2023-03-13T03:03:57", "background_image": "https://media.rawg.io/media/screenshots/429/429f3c0e084e29530beb1b56877fa444.jpg", "website": "https://emerose.biz/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 360, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["sonic-alpha"], "genres": ["Action", "Indie"], "publishers": ["NS"], "esrb_rating": null}