{"id": 93982, "slug": "the-wolfs-bite-itch", "name": "The Wolf's Bite (itch)", "name_original": "The Wolf's Bite (itch)", "description": "<p>The Wolf’s Bite is a one-versus-one choose-your-own-adventure game with an entrepreneur fairy tale twist. Inspired by stories such as “The Three Little Pigs” and “The Stinky Cheeseman and Other Fairly Stupid Tales”, the game revolves around thwarting the other player while advancing your agenda. Be a professional restaurateur or a vengeful saboteur, the competition is on!</p>\n<p>After failing to thrive in the highly competitive residential demolition industry, mostly due to difficulties dealing with brick construction, The Big Bad Wolf decided it was time for a career change. Unable to resist the lure of entrepreneurship, he decided to enter the restaurant business.<br/><br/>The Three Little Pigs, dissatisfied with their free sample demolitions, are conspiring against The Big Bad Wolf and his new restaurant, The Wolf’s Bite. The grand opening is next week. Will The Big Bad Wolf finally launch a successful enterprise or will the Three Little Pigs throw up a metaphorical brick wall and stop him?<br/><br/><strong>Features</strong></p>\n<p>A competitive choose-your-own-adventure game for one or two players.</p>\n<ul><li>Over 375 unique paths through the game for each player, almost every playthrough can be completely different.</li><li>Over twenty unique endings, all of which are decided by the decisions you and your opponent make...or don’t make.</li><li>Beautiful hand-drawn illustrations by Karen “bitmOO” Teixeira.</li><li>Playful soundtrack and sound design by Fat Bard.</li><li>Set in a unique fairy tale world, inspired by many of the classics.</li></ul>", "metacritic": null, "released": "2017-08-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/81a/81a3ce0328b5a570fff8947883feaa23.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Eric Bernier"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}