{"id": 9398, "slug": "frontline-commando-d-day", "name": "Frontline Commando: D-Day", "name_original": "Frontline Commando: D-Day", "description": "Lead the charge on D-Day as the tip of the spear in the largest Allied invasion of WW2!  Defeat the occupation forces and take back France; storm the beaches, clear the trenches and liberate towns as you battle through the countryside of Normandy.<br/><br/>SEE AND FEEL THE ACTION!<br/>Experience the ultimate 3rd person shooter with stunning console quality visuals, precise controls, advanced physics, destructible environments and full voiceovers.  Jump into the heat of battle and push your device to the limit!<br/><br/>HUGE SINGLE-PLAYER CAMPAIGN!<br/>Experience 5 separate campaigns with 145 separate missions based on the actual beach landings; Juno, Sword, Utah, Gold and Omaha.  Destroy powerful tanks and cannons to allow allied forces to advance.  Grab a stationary gun and unload against fortified positions.  Man the Ack-Ack anti-aircraft guns to take down bombers and their escorts before they can release their payloads.<br/><br/>RUN THROUGH THE WARZONE!<br/>Battle your way into the heart of enemy territory! Run through the battlefield dodging mines and leaping barriers as you move to the next cover point to avoid enemy fire.  Emerge from destructible cover points to engage waves of enemies!<br/><br/>COMMAND AN ARSENAL OF DEADLY WEAPONS!<br/>Take to the frontline with an array of classic weapons from World War 2.  Grab a historic rifle to take down enemies accurately or, if you prefer, a machine-gun to unleash a hail of bullets.  Call in Artillery strikes against entrenched enemy soldiers or shoulder a bazooka to reduce a tank to rubble.    <br/><br/>PLEASE NOTE:<br/>- This game is free to play, but you can choose to pay real money for some extra items, which will charge your iTunes account. You can disable in-app purchasing by adjusting your device settings.<br/>- This game is not intended for children.<br/>- Please buy carefully.<br/>- Advertising appears in this game.<br/>- This game may permit users to interact with one another (e.g., chat rooms, player to player chat, messaging) depending on the availability of these features. Linking to social networking sites are not intended for persons in violation of the applicable rules of such social networking sites.<br/>- A network connection is required to play.<br/>- For information about how Glu collects and uses your data, please read our privacy policy at: www.Glu.com/privacy<br/>- If you have a problem with this game, please use the game’s “Help” feature.", "metacritic": null, "released": "2013-03-27", "tba": false, "updated": "2019-07-29T07:58:35", "background_image": "https://media.rawg.io/media/screenshots/5d9/5d909acfa6fce414b398418bc44d65e4.jpg", "website": "http://www.glu.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 307, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["Glu", "Glu Games"], "genres": ["Action", "Adventure"], "publishers": ["Glu Games"], "esrb_rating": "Mature"}