{"id": 9399, "slug": "block-story-premium", "name": "Block Story Premium", "name_original": "Block Story Premium", "description": "Build a world of vast landscapes where you have ultimate control. You decide where to go and what to build. Fly on dragons and other creatures as you embark on an epic quest to save the world.<br/><br/><br/>Block Story® combines popular 3D block building, sandbox exploration gameplay with exciting and addictive role playing game elements.  Complete quests to conquer diverse biomes and become the greatest warrior in the realm.  Build strongholds, encounter a wide variety of creatures, battle boss monsters, and mine valuable resources to upgrade weaponry, access better equipment and create artifacts to summon monsters of all sorts -- including dragons!   The first chapter of your story begins...<br/><br/><br/><br/>Key Features<br/>•\tDiscover several new exciting quests<br/>•\tLearn from a wise Wizard on how to discover the many wonders of Block Story<br/>•\tRide on dragons and 29 other creatures<br/>•\tBuild anything you want in the premium creative mode<br/>•\tInfinite hours of RPG exploration game play<br/>•\tExplore numerous biomes from desert wastelands to arctic mountain ranges but look out for the ice dragon<br/>•\tEncounter numerous supporting characters that will assist you on your quests.<br/>•\tLevel up your hero with customized stats and attributes<br/>•\tUse the crafting system to forge a slew of magical items – from lighting swords, mystical staves and rare artifacts that summon dragons and other creatures that will aid you in battle<br/><br/>http://www.blockstory.net/forum", "metacritic": null, "released": "2012-10-10", "tba": false, "updated": "2024-01-30T13:06:13", "background_image": "https://media.rawg.io/media/screenshots/8c8/8c846b5e80757d5d41b50bbc4ef5bbb7.jpg", "website": "http://www.youtube.com/watch?v=AWfLWKa2j4A", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 251, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "Android"], "developers": ["Mind Blocks", "Mindblocks"], "genres": ["Action", "RPG"], "publishers": ["Paul Pacheco"], "esrb_rating": null}