{"id": 940069, "slug": "arkham-detective", "name": "Arkham Detective", "name_original": "Arkham Detective", "description": "Disclaimer<p>This is just a demo of the game. It is still in early development.</p><p>This game contains blood and strong language.</p>The Story<p>Arkham Detective is a psychological horror game set in the fictional universe created by H.P. Lovecraft.</p><p>The story takes place in 1919 in the City of Arkham, Massachusetts. You play as Joe Adams, a private detective, trying to solve a string of mysterious killings.</p><p>In our playable demo, you get to play out one of the levels in the game that takes place quite early in the story.</p>Comments from the development team:\r\n\r\n<p>This is an early build and we awknowledge that there are bugs present. Here is a list of the most notable ones and potential workarounds/fixes:\r\n</p>\n<ul><li>There is no indicator of the keybind to leave the \"interacting with object\". To cancel this, press E\r\n</li><li>There is also no control scheme for the Clueboard in the start. It can also be cancelled by pressing E \r\n</li><li>ALT-tabbing out of the game can result in breaking the functionality of the Clueboard minigame\r\n</li><li>If you go to settings-&gt;back to pause-&gt;resume from the main menu, you break the game and it will require a restart to work\r\n</li><li>Interacting with the manhole cover is supposed to send you back to the office, but this is currently bugged and may not always be the case<ul><li>If this does not work, you can return to the office by pressing \"Esc --&gt; Settings --&gt; Back to Menu --&gt; Play\"to reset the game. This will spawn you back in the office\r\n</li></ul>\n</li></ul>\n<p>We hope you enjoy our little demo!\r\n</p><p>     - Skelly Boy Studios</p>", "metacritic": null, "released": "2023-03-12", "tba": false, "updated": "2023-03-13T06:10:29", "background_image": "https://media.rawg.io/media/screenshots/b8d/b8da5172703387719d28d5bfc1b311c0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SkellyBoyStudios"], "genres": [], "publishers": [], "esrb_rating": null}