{"id": 940066, "slug": "ascension-of-the-baguette-king", "name": "Ascension Of The Baguette King", "name_original": "Ascension Of The Baguette King", "description": "<p>As <strong>King Baguette</strong>, you want to reject your humanity and ascend to Godhood through your Scat Intent!</p>\n<p><em>A rhythm game made in 3 hours for the <strong>Trijam#210</strong> (theme : </em><em><strong>Distractions</strong></em><em>)<br/></em></p>\n<p><strong>GOAL</strong>: You're playing <strong>King Baguette</strong>, who wants to ascend thanks to his <strong>Scat powers</strong>!<br/></p>\n<p>But <strong>Lord Croissant</strong>, your old friend, rival, previous step father and master of the \"<em>Crème fouettée no jutsu</em>\" is still after your crown and sent his son, PainAuChocolat (newly auto proclaimed <em>drummer</em>) to <strong>distract </strong>you !</p>\n<p>Will you be able to stay focused and ascend ?</p>\n\n<p><strong>CONTROLS </strong>: After the first measure of the music, you can move around using <strong>WASD</strong> (<strong>ZQSD </strong>for fellow French players). <br/>You can also pause the game with <strong>ESCAPE</strong>.<br/></p>\n<p>Try to get <strong>30 Green Meditation Orbs</strong> in as <em>less beats as possible</em>. <br/>Be careful though, if you get hit by <strong>Red Orbs </strong>and reach a score of <strong>-10</strong>, it's your loss and, well you'll still remain <strong>King, </strong>but deep down you'll know you have <strong>failed</strong>...<br/></p>\n<p><strong>NOTE </strong>:  If you like hardship, there's a x2 speed mode you can try!  <br/></p><p><strong>PROJECT MANAGEMENT</strong> : <br/></p><p>With only 3 hours to go, I tried my best to prepare beforehand and wrote all my ideas and planning on paper.<br/>What took me the longest was without a doubt trying to imagine wich <em>FSM </em>I would be using while also being as exhaustive as possible.<br/>Learning from past experience, I cut my project in multiple parts to have the bare minimum gameplay written down, and next to that list all the others features I thought would be nice to add if I was quick enough (spoiler, I wasn't x) ).<br/><br/>After preparing my \"documents\" (more like paper filled with short words, small drawings and arrows crossing the page from one side to the other to link 2 items), I decided to start developping.</p><p>My plan was to do start with 1 hour pure Unity development , cut in half at 30 minutes to take a step back and see my progress.<br/><br/><strong>HOUR 1</strong> : I finished the player movements, OrbSpawner and the scoring system through orbs collisons. <br/>At that point I \"only\" had to handle music and SFX, and then implement my UI menus.<br/><br/>Judging my pace \"ok tier\", I allowed myself 1 hour of music and \"SFX\" creation and implementation. </p><p><strong>HOUR 2 </strong>: It took me a little more than 50 minutes to create the music, register myself for the SFXs and import everything in Unity. </p><p>I was quite proud with this and thought including some of the \"non-mandatory\" features was totally doable since \"UI won't take me too much time\"....</p><p><strong>HOUR 3 </strong>: <em>UI did took me much time... </em><br/>After using both <em>PlayMaker FSM</em>s and <em>Koreographer </em>to handle the music and SFX, I started implementing UI. Besides the score, I had to create the start, pause, win and lose menus. <br/>I don't know if it's because it's been so long I created UI, or just my confidence making me work slowly, but the result was that I finished a stable state for the game (clearly not a proper one considering how I handled <em>FSM</em>s' transitions and naming in the end...) with only 8 minutes left that I wanted to keep to correct the bugs I would find while testing. </p><p>After in fact finding some bugs, all I could do as bonus addition with the remaining time was put a \"Speed x2\" button, quickly handled with one event changing the pitch of my Music Source.<br/><br/>At least the game is playable and not (too ?) buggy, even if it's not as good as I wanted it to be.<br/><br/><strong>UPCOMING FEATURE</strong>S :</p><p>Here are my ideas I couldn't use/ develop because of the time limit.<br/>I'll continue the development to include all of them soon.</p><p>- Change of <strong>character model</strong> to the King character, from <em>Polygon Fantasy Kingdom - Synty Studios</em> asset.</p><p>- Setting around 6/8 animations of posing from <em>Mixamo </em>and play one randomly each time the player would move, while also having the camera getting really close to the character so we could spectate the agility and beauty of <strong>King Baguette </strong>posing. (not sure if it would work with Speed 2 though).</p><p>- Add a blue orb spawning every measure (so every 4 beats), and when taken, that would stop <strong>PainAuChocolat </strong>from playing drums for 2 measures. <br/></p><p>- Speaking of <strong>PainAuChocolat</strong>, I also wanted to put him and his drum as a \"floating around\" game object. Like, seeing (and hearing) him come from the left side of the screen and going upward while rotating on himself, until he disappeared from the top of the screen. And after some seconds, seeing him reappear from the right side while still floating around from one side to the other...</p><p>- Add <strong>particles </strong>when there's a  collision between the <strong>Player</strong> and an <strong>Orb</strong>.<br/></p><p>  <br/></p><p><strong>ASSETS LIST</strong> : <br/>Here are the <strong> assets </strong>I used (or thought of using) for this little project :</p><p><em>- Koreaographer - Sonic Bloom<br/>- FSM PlayMaker - Hutong Games<br/>- Fresh Bread - Megan Alcock<br/>- Polygon Fantasy Kingdom - Synty Studios<br/>- Skybox Series Free</em></p><p><strong>Thank you</strong> for reading/ playing, please don't hesitate to <em>share your thoughts/ any advice</em> you would have in the comments down below so I can <strong>improve myself</strong> !<br/></p>", "metacritic": null, "released": "2023-03-12", "tba": false, "updated": "2023-03-13T06:09:00", "background_image": "https://media.rawg.io/media/screenshots/f88/f88afe2713af3cd674e4393b93c99225.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Haoro"], "genres": [], "publishers": [], "esrb_rating": null}