{"id": 94029, "slug": "automata-empire-itch", "name": "Automata Empire (itch)", "name_original": "Automata Empire (itch)", "description": "<p>Seize power and build an empire of fuzzy cellular automata monsters!</p><p>Inspired by Conway's Game of Life, Automata Empire challenges you to herd hundreds of mindless automata subjects to smash your rivals' castles and steal their territory. While your loyal subjects lack individual intelligence, you can sacrifice them to build chains of taverns and roads to impose order on chaos. Ready to invade? Build some high-velocity catapults to launch your minions directly into battle.</p>Five Gameplay Modes<ul><li>Siegecraft - lay siege to foreign strongholds while surrounding your own castle with a maze of defenses </li><li>Migration - battle for the last habitable land as you flee from an unstoppable horde of undead </li><li>Capture the Banner - sneak troops into the enemy base to steal their flag… but herding it back to your base is harder than it looks </li><li>King of the Plateau - secure your sovereign right to territory by flooding it with as many of your subjects as possible </li><li>WAAAAAR!! - wage plain old deathmatch warfare</li></ul>Singleplayer and Online MultiplayerBattle 3 friends in all 5 game modes and practice your foreign diplomacy: forge alliances and then conveniently forget them at the most inconvenient times &gt;_&gt;Short, Satisfying MatchesThe average match is designed to last about 15 minutes. Or turn on Lightning Mode and play the game at 2x speed.AutoplayYou'd prefer to watch? Let the AIs battle each other!", "metacritic": null, "released": "2016-04-08", "tba": false, "updated": "2019-08-23T12:12:58", "background_image": "https://media.rawg.io/media/screenshots/60e/60e6e0ec4b28d213739bf7cd61a58d35.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Nonadecimal"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}