{"id": 94038, "slug": "infurubia", "name": "Infurubia", "name_original": "Infurubia", "description": "<p>Infurubia tells the story of Gamba and her twin brother, Chacal who is unfortunate enough to be the vessel of <em>the God who walks among mortals</em>, Lundúraga. Because of this, he endures every day the struggles of the God trying to leave his body, breaking his bones and ripping his flesh. This dishearting sight lead Gamba to always look for a better future for her brother, and one day she decides to take him to a small trip outside the town. This very little action will take them both to a bittersweet journey. <br/></p>\n<p><strong> Infurubia</strong> or J<em>ourney of the vessels of God</em> is a short visual novel currently in development for NaNoRenO 2016.</p>\n<p><strong><strong>♦</strong>CHARACTERS<strong>♦</strong></strong></p>\n\n\n<p><strong>Age:???/Height:1.61cm/Race:Gamos</strong><br/>The protagonist and Chacal's twin sister. Tries to be cheerful around others but she is easily baffled when things get bad.<br/>Excellent fighter even if she contains part of Lundúraga's soul, which makes her dizzy from time to time. Hopes for a better future for her brother and is always around to protect him <br/></p>\n\n<p><strong>Age:???/Height:1.74cm/Race:Gamos</strong><br/>Gamba's twin brother and Lundúraga's vessel. A total negative and intolerant man, which is understandable by his situation but it rubs strangers the wrong way. Seems strict and heartless when he scolds her sister. Even so, cares a lot for her.</p>\n\n<p><strong>Age:24/Height:1.85cm/Race:Human</strong><br/>A man that travels around the world along with Cellia. Looks taciturn but he is very passionate when it comes to traveling. Happens to be the last human and, as expected, carries a turbulent past <br/></p>\n\n<p><strong>Age:340/Height:1.57cm/Race:Kuurin</strong><br/>Small, feisty woman that travels along with Haern. Always carry a smile and looks like she is having a lot of fun, also tease master.<br/>Is like a sister to Haern, a really <strong>old</strong> sister. <br/></p>\n\n<p><strong>Age:82/Height:1.72cm/Race:Kaufur</strong><br/>Southern Queen of Marla, queendom of the Kaufur people. Was betrayed by the royal counselor together with the Northen Queen and decreed<br/>dead. Is currently looking a way to pay back and ascend to the throne with merits. Travel along with Alink. <br/></p>\n\n<p><strong>Age:64/Height:1.88cm/Race:Hybrid(Gamos-Kaufur)</strong><br/>A prisoner inside the cells of Marla. Incredible violent man, and a complete inept to everything else. Lost half of his tongue, so he avoids to speak, and if he tries he just able to mutter gibberish. Travels along with Eidell as her (forced)servant. <br/></p>\n<p><strong><strong>♦DETAILS Demo</strong><strong>♦</strong></strong></p>\n<p><strong>(Infurubia or Journey of the vessels of God)</strong><br/>♦Fantasy/Romance/Drama<br/>♦ For ages +17(Contains some nudity, violence and sexual themes which won't be any explicit!)<br/>♦Now with music!</p>\n<p>♦Encyclopedia is WIP, but you can check it if you don't remember a term explained during the game.</p>\n<p><strong><strong>♦Credits</strong><strong>♦</strong></strong></p>\n<p><strong>Arcane Divine Piano</strong><strong>&gt; </strong>Composer</p>\n<p><strong>Human bolt diary </strong>&gt; Encyclopaedia / Bestiary framework</p>\n<p><strong>DejiNyucu</strong> &gt; <strong>Renpy sprite animations</strong></p>\n<p><strong>Carrogath</strong> &gt; Proofread(Chapter 1-2)</p>\n<p><strong>Weenily </strong>&gt; Encyclopedia proofread/Testing</p>\n<p><strong>Kain Oborin</strong>&gt;Proofread (Chapter 3-4)</p>\n<p><strong><strong>♦</strong>EXTRAS<strong>♦</strong></strong></p>\n<p>LSF WIP thread</p>\n<p>VNDB page</p>\n<p>Favorite character poll</p>\n<p>Dev. blog for Infurubia(Contains spoilers)</p>\n<p>Soundcloud</p>\n<p>Fanworks and extra artwork(Contains spoilers)</p>\n<p>Store</p>\n<p><em><strong><strong>♦</strong>NEWS<strong>♦</strong></strong></em><br/></p>\n<p><strong><em>11/03/2018</em>&gt;</strong>The new demo is here! Also I added a discussion board for a more organized comment section. Enjoy!</p><p><strong>20/05/2018&gt;</strong>An updated version of the game is here. Various spell mistakes and grammatical errors are fixed now. Big thanks to Kuroneko and Vasaluv for this!<br/></p>\n\n<p>Please, tag anything related to the game as \"Infurubia(evn)\"</p>\n<p>Thank you :D</p>", "metacritic": null, "released": "2016-03-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4ba/4ba0f1fb76cbbe8226db84b91b38d102.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Chegovia"], "genres": [], "publishers": [], "esrb_rating": null}