{"id": 94049, "slug": "the-daring-entrepreneur", "name": "The Daring Entrepreneur", "name_original": "The Daring Entrepreneur", "description": "The Daring Entrepreneur<p>\n<br/>\n</p><p>\r\n\tDo you have what it takes to grow your own business from the ground up? \r\n\t<br/>\r\n\tDo you have what it takes to become the biggest, most Daring Entrepreneur there ever was?\r\n</p><p>\n<br/>\n<br/>\r\n\tThe Daring Entrepreneur is an incremental game made in less than 48 hours from start to finish for Ludum Dare 34. Go check out it's \r\n\tLudum Dare page!<br/>\r\n\tThis game was made with an experimental version of \r\n\tOpenJGL: the Open JavaScript Game Library!<br/>\n<br/>\r\n\tThe Daring Entrepreneur also works on mobile, but I'll probably port it in the next week or so to make everything look a bit better/bigger on mobile. But it should still be completely playable as it is now!\r\n</p><p>\n<br/>\n</p>Changelog:<p>\n<strong>v.1.2 (2015-12-17)</strong>\n</p><ul>\n<li> Rebalance a lot of the upgrades to make the game last a little longer.</li>\n<li> The sign text should now always be rendered in the center.</li>\n<li> Add default browser confirmation dialog boxes to both the \"Sell Shop\" and \"Clear Data\" buttons. </li>\n<li> Rebalance the calculations for the number of new loyal customers so they can no longer be higher than the number of normal customers. </li>\n<li> Fix some flavour texts.</li>\n<li> Fix the game's shop selling suggestion suggesting you to sell everything as soon as you had 1 loyal customer. Also made it's algorithm a bit smarter. </li>\n<li> Remove a lot of the debugging console output.</li>\n</ul><p>\n<strong>v.1.1 (2015-12-15)</strong>\n</p><ul>\n<li> Fix game saving and loading.</li>\n<li> Move the backround image a bit to the right because sometimes the text about the number of customers would go beyond the border. </li>\n<li> Change the calculations for speedup so that the gained speedup would be a bit higher in the beginning and gradually slow down. </li>\n<li> Make the save interval a bit shorter (3s instead of 5s). </li>\n<li> The game now suggests when you could best sell your current shop/chain. </li>\n</ul><p>\n<strong>v.1.0 - Ludum Dare Version (2015-12-14)</strong>\n</p><ul>\n<li> Initial Release.</li>\n</ul>", "metacritic": null, "released": "2015-12-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d28/d289e71a71649940383d32fd65aa7075.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Robin Arys"], "genres": [], "publishers": [], "esrb_rating": null}