{"id": 940548, "slug": "chengdu-style", "name": "Chengdu Style", "name_original": "Chengdu Style", "description": "<p>Our game is designed to let the player that is not living in Chengdu to experience life in this city. The game mainly comprises four settings: the hotpot store, the Majiang parlor, the Sichuan Academy of Fine Arts, and the Panda Breeding Center. </p>\n<p>In Majiang Parlor, players can experience online Mahjong with other players, earning the game credits \"RMB\" to spend in this game world. \r\n</p>\n<p>In the Sichuan Academy of Fine Arts, players can draw out their creative artwork and put them in an open gallery. Players can give points to others' artwork individually. The points can transfer to RMB to spend in the world. \r\n</p>\n<p>In a hotpot store, players can utilize RMB to purchase ingredients and equipment. They can, for example, improve the pace of service, the strength of the stove, and the length of the chopsticks. Longer chopsticks will allow them to serve more dishes while avoiding getting burned by the occasional soup spill. \r\n</p>\n<p>After successfully completing the hot pot restaurant job, players will be able to visit the Panda Breeding Center and observe the pandas. Players can spend money on shaving and dyeing equipment to customize the pandas' appearance. If the panda receives a five-star rating, his or her style images will be shared on the game network for other players to view. And players can adopt a panda as a pet. The rest of the money buys furniture to decorate the panda's home and panda food to feed the panda.\r\n</p>", "metacritic": null, "released": "2023-03-12", "tba": false, "updated": "2023-03-13T10:04:40", "background_image": "https://media.rawg.io/media/screenshots/d0a/d0a8300181caa4292885b9d703673609.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["genius072"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}