{"id": 940647, "slug": "aiq-dynamics", "name": "AiQ Dynamics", "name_original": "AiQ Dynamics", "description": "<p>Wel umm... Hi this is my first attempt on participating at game jam.</p>\n<p>I always wanted to make a Unity project where I'd try to replicate some of puzzles presented in other games. And when I saw that 7DRL Challenge 2023 is a week long jam where you need to make a rouglike game I thought to myself \"Why not both?\"</p>\n<p>And that is exactly what I've done. I've created a simple puzzle game, which is paired to few roguelike mechanics (getting scored for solving puzzles and unlocking new ones).</p><p>As for the aesthetic I am fan of the Portal 2 co-op narative so you will become a robot, which performs simple logical test and collects data based on his performace in closed testing facility.<br/>The game starts of pretty slowly (for the first 5 minutes you might think that you are just running and pushing buttons) but trust me, it gets better... there are more buttons to push ;)</p><p>If you are wondering if there is some end goal.. yes. The end goal of this game is unlocking the \"Marathon Mode\", which can be unlocked after buying all upgrades and tracks you highscore (most puzzles solved...)  in the mentioned Marathon Mode.</p><p>I'd like to thanks to all people which will give this game a try and sure I hope it will entertain you for a bit :)</p><p><em>*all third party Assets and stuff I didn't make myself are hopefully mentioned in the credits tab</em><br/></p>", "metacritic": null, "released": "2023-03-11", "tba": false, "updated": "2023-03-13T10:58:00", "background_image": "https://media.rawg.io/media/screenshots/067/067671c30c14aac7377a783299abb730.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Lukaras"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}