{"id": 9406, "slug": "heist-the-score", "name": "HEIST: The Score", "name_original": "HEIST: The Score", "description": "SHOOT FIRST. ASK QUESTIONS LATER...<br/><br/>A simple bank job, yeah right. “Get in, get the combination, get to the vault and get out” so they said. When put like that it sounds easy. What actually happened is a whole different story ...<br/><br/>Version 1.1<br/>--------------------------------------<br/>Brand new Survival mode<br/>All new Game Center leaderboards<br/>Visually improved user interface<br/>--------------------------------------<br/>FEATURES<br/>• Fast-paced rail shooter action<br/>• Action packed gun fights<br/>• Many weapons to gut the bank<br/>• Destructible environments<br/>• Compelling motion capture cut scenes tell the tale of HEIST in full force.<br/>• Professional voice actors<br/>• Experience high resolution graphics with dynamic music and sounds effects<br/><br/>Heist tells the thrilling story of a daring bank robbery set in the prohibition era of 1920’s America. A carefully comprised plan with as little mess as possible turns horribly wrong, leaving you to fight your way out of an impossible situation. What are you willing to do to come out on top?<br/><br/>You begin the story as a low level enforcer for the mafia working under the enigmatic Salvatore Da Luca, a veteran from the recently ended Great War. Once he inspired acts of valour in the trenches, now he uses those same qualities for greed and corruption by liberating banks of their excess holdings. <br/><br/>Sal doesn’t work alone, his trusted associate Giuseppe Gallo always teams up for the score. He’s known as the loose cannon who can wind up being more trouble than he’s worth. Shoot first; ask question later is how he operates. He has a grudge with the world, and he’s not too fond of you either. You better make sure not to put a foot wrong.<br/><br/>The bank just opened and the score&amp;#39;s all set, are you in?<br/><br/>What the fans are saying:<br/><br/>***** by Leggam13<br/>Awesome action shooter - This is a lot of fun.<br/><br/>&amp;quot;The game&amp;#39;s whole feelings is nice. The picture is great. You need to try this game.&amp;quot; -- best10apps.com", "metacritic": null, "released": "2012-03-02", "tba": false, "updated": "2019-10-22T14:08:23", "background_image": "https://media.rawg.io/media/screenshots/d6a/d6ae381655e5738a45507441e8f814ef.jpg", "website": "http://www.heistthescore.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 300, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["N3V Games"], "genres": ["Action", "Arcade"], "publishers": ["N3V Games"], "esrb_rating": "Mature"}