{"id": 940712, "slug": "cosmic-artifacts-a-space-rogues-quest", "name": "Cosmic Artifacts: A Space Rogue's Quest", "name_original": "Cosmic Artifacts: A Space Rogue's Quest", "description": "<p>This game is a 7DRL game jam, roguelike game .   Is a try at a \"The Guardian Legend\" like game.</p><p>Game is incomplete.  At this stage it is a Rogue Lite action adventure. </p><p>Good News  there is another game jam coming  up for just this issue.  I will be using this  as base for that jam. (https://gd.games/solvemanke/cosmic-artifacts--a-space-rogu)  So updates and fixes by the end of  month.</p>\n<p>In the not-too-distant future, Earth has become uninhabitable due to environmental disasters and wars. Humanity was forced to leave the planet and start anew in space. In this new era, a group of space rogues, known as the Relic Hunters, emerged, searching the galaxy for valuable artifacts from Earth.\r\n</p>\n<p>You play as a member of the Relic Hunters, tasked with the mission to find and recover the most valuable relics from Earth. These relics are highly sought after by various factions in the galaxy, each with their own motives and agendas.\r\n</p>\n<p>As you travel through the galaxy, you'll encounter different planets, space stations, and other spacecrafts, each with their own challenges and dangers. You'll need to use your skills and cunning to navigate through various obstacles, defeat enemies, and collect clues that will lead you to the next relic.\r\n</p>\n<p>As you progress through the game, you'll uncover a larger plot involving the relics, and the fate of Earth itself. Will you be able to complete your mission and save humanity from an impending threat? It's up to you to find out.\r\n</p>", "metacritic": null, "released": "2023-03-11", "tba": false, "updated": "2023-03-13T11:26:47", "background_image": "https://media.rawg.io/media/screenshots/6d0/6d088140e45edcedcfff33f2d064ae12.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Solvemanke Entertainment"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}