{"id": 9408, "slug": "striker-arena", "name": "Striker Arena", "name_original": "Striker Arena", "description": "Join Vikings, Gladiators and Samurai to play the Soccer of the Gods! Striker Arena is a 3D tactical-action fantasy soccer game with warriors fighting in arenas. No rules! Even allows 2 people to play side-by-side on one device at the same time!<br/><br/>= KEY POINTS =<br/>- Viking team and its Snowy Cathedral Arena<br/>- Gladiator team and its Colosseum<br/>- Samurai team and its Dojo<br/>- Each arena has its own traps and surprises<br/>- Quick Match mode: 2 players on the same device<br/>- Story mode with 48 challenges!<br/>- 3 AI difficulty levels<br/>- 8 special abilities<br/>- Awesome chiptune music<br/>- Game Center Achievements and Ranking<br/>- No In-App Purchases<br/>- Share your match replays!<br/><br/>= DESCRIPTION =<br/>You control a Striker team from one of the old tribes. Your objective is to get the ball, pass it, and shoot it into the arena vortex. As you try to score, you will be able to move your players, intercept opponent passes, and swipe the screen to make passes and shots. Pick up special abilities on the field to tackle, punch and blast whoever gets in your way! Score as much goals as you can and the Emperor will send you to death or Striker’s heaven. There are no fouls in the Soccer of the Gods, so unleash hell on the field!<br/><br/>= STORY =<br/>On a distant planet, ancient tribes have settled their wars through an old brutal discipline, Soccer of the Gods. Once every ten years, tribes gather in the Striker Arena tournament to battle each other under the authority of their Emperor. Each tribe enlists the bravest and fiercest of their kin to fight for glory. These few are known as the Strikers. Their spilt blood and sweat in the arena feeds the Emperor’s ever growing lust for true transcendance.<br/><br/>Game optimized for iPhone 6, iPhone 6 Plus and iPad.", "metacritic": null, "released": "2015-02-24", "tba": false, "updated": "2019-10-22T14:30:28", "background_image": "https://media.rawg.io/media/screenshots/c0e/c0e1a9cd30e6b5f19a61ce4e8e320767.jpeg", "website": "http://www.wizcorp.jp", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Wizcorp"], "genres": ["Action", "Strategy", "Sports"], "publishers": ["Wizcorp"], "esrb_rating": "Teen"}