{"id": 940833, "slug": "duality-itch-luca-giacometti", "name": "Duality (itch) (Luca Giacometti)", "name_original": "Duality (itch) (Luca Giacometti)", "description": "<p>Brave hero, this little town is in need of your services! A bunch of evil creatures settled in the mines and now no one can enter without risking his life.</p>\n<p>This is a print and play \"abstract roguelike\" that you can easly bring with you to tickle your hack and slash needs, even when you don't have a PC nearby ... or when your phone battery is low 8)</p>\n<p>To play you just need two of the six cards (if you memorized all the rules) and eight 6 sided dices. The other four cards contain the rules of the game.</p>\n<p>It's been some months since I started thinking about an essential roguelike playable without an electronic device. I recently found JEKYLL/HIDE in the 2020 1 Card game design contest and the roguelike version just clicked in my mind! The 7drl challenge seemed the right time to finalize my thoughts and publish something!</p>\n<p>This isn't by any means a traditional roguelike by the Berlin Interpretation and for this reason <strong>I don't want it to be taken in consideration during the 7drl judgement process</strong>. I think there will be way many games way more \"rogueliky\" than this so i don't want to wasts any judges time.</p>\n\n<p>That said, I think this game has SOME roguelike elements:</p>\n<ul><li>randomness for the outcome of your actions</li><li>randomness for the content you're facing, it's just way more abstract</li><li>strategic decisions which can be pushed for a lucky or disastrous outcome</li><li>turn based actions with a strong focus on resurce management</li><li>permadeath, but you can easly cheat death if you wish</li></ul>\n<p>What you will not find from a standard roguelike?</p>\n<ul><li>a map, you just have two locations</li><li>a detailed combat system or a character sheet, you basically have two stats (Health and Anger) and a food counter (for starvation)</li><li>there are no \"real\" monsters to fight</li></ul>\n<p>Credits for all the images goes to game-icons.net, thanks for the great icons repository!</p>", "metacritic": null, "released": "2023-03-11", "tba": false, "updated": "2023-03-13T12:19:51", "background_image": "https://media.rawg.io/media/screenshots/379/37986ef345cd9fb616e821cdc250ba7f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Luca Giacometti"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}