{"id": 94097, "slug": "kobo-redux", "name": "Kobo Redux", "name_original": "Kobo Redux", "description": "<p><strong>Kobo Redux is a frantic 80's style 2D shooter, inspired by the look and feel of 90's arcade cabinets. The gameplay is fast and unforgiving, although with less of the frustrating quirkiness of the actual games of the 80's. A true challenge in the spirit of the arcade era!</strong><br/></p>\n<p>\r\n\tFirst, inspired by Bosconian, there was XKobo, a multi-directional scrolling arcade shooter, where the primary objective was to destroy maze-like hostile space bases, while they were hurling bullets, missiles, and ships in your general direction.\r\n</p>\n<p>\r\n\tKobo Deluxe brought this addictive little game to basically everything with a CPU, and has had incredible numbers of downloads on various platforms. It is also included in many Linux distros. However, the project was never quite finished, and the game mostly served as a test bed for other little projects, such as glSDL, and the unnamed sound engine - a precursor of Audiality 2.\r\n</p>\n<p>\n<strong> Now, with smoother controls, improved gameplay, a bit of physics, new pixel art, and a proper soundtrack, Kobo Redux aims to be the XKobo update that Kobo Deluxe never quite became.</strong>\n</p>\r\n\r\nWhat you get when you buy Kobo Redux\r\n<ul>\n<li>Access to the full Redux sound and graphics themes</li>\n<li>Access to binaries for the supported platforms</li>\n<li>Free updates of the above, for as long as the project is maintained</li>\n<li>Improved chances of updates and more games actually happening!</li><li><strong><strong>Kobo Redux</strong> has been Greenlit, so you'll also get a Steam key eventually.</strong></li>\n</ul>\r\nWhat is available to everyone, under various FOSS licenses\r\n<ul>\n<li>Full game source code</li>\n<li>Full source code of the Audiality 2 audio engine</li>\n<li>Graphics and sound themes included with the game source code</li>\n</ul>\n<p>\r\n\tIn other words, while the Kobo Redux media is proprietary, the full game source code is available under the \r\n\tGNU GPL (some files are under the GNU LGPL), and relies only on portable Free/Open Source technologies, such as SDL and Audiality 2. The game is fully playable with the included non-proprietary media.\r\n</p>\n<p>\r\n\tThat is, it is entirely legal to fork the game code and the included free themes in order to develop different versions, or new games, as long as the original licencing terms are not violated.\r\n\t\r\n</p>\r\n\r\nIf you own Kobo II...\r\n<p>\n<strong><em>If you've previously purchased Kobo II, you get Kobo Redux for free! </em></strong><strong><em>You should have received an email with a download key.</em></strong>\n</p>", "metacritic": null, "released": "2017-01-17", "tba": false, "updated": "2019-08-28T23:25:52", "background_image": "https://media.rawg.io/media/screenshots/e12/e1256122aaf8342ff6fdfa4614617641.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["olofson"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}