{"id": 941168, "slug": "germinate", "name": "Germinate", "name_original": "Germinate", "description": "<p>In Germinate you are thrown into one of the most remote locations in the world, where you will explore and attempt to find the last hope of humanity, stored in an ancient vault made to withstand the harshest elements of the planet.<br/></p>\n<p>Germinate is an exploration-horror game that will have you questioning whether or not you can believe the things experienced by the protagonist as you attempt to solve the obstacles blocking your path.\r\n </p>\n<p>Rely on your own sanity as you attempt to restore power to the ancient construct and reach the inner vault.\r\n</p>\n<p>.</p>\n<p>.</p>\n<p>.</p>\n<p>.</p>\n<p>Designer's note:</p>\n<p>With the product still under development, we have decided to launch our current vertical slice as a playable teaser, to showcase what we are working on and receive as much feedback from our audience as possible. We hope you enjoy and leave constructive criticism! </p>\n\n<p>The game is made to challenge ourselves as we strive to learn Unreal Engine 5 and to see what the engine is capable of. This means we heavily use real-time lighting, so some machines with lesser graphical capabilities might struggle. We apologize. </p>\n\n<p>During your playtime, you might encounter doors. We have put a lot of effort, sweat, tears and dare I say even blood into creating these doors, and more importantly, the interaction with them. We are very proud of our doors... However, should you struggle to interact with these doors, then the way of handling them is: to hold down the left mouse button and move your mouse left / right. This will open the doors. (At least the ones you're meant to open.)</p>\n\n<p>OBS: A brightness slider is always available from the pause menu. </p>", "metacritic": null, "released": "2023-03-10", "tba": false, "updated": "2023-03-13T14:50:59", "background_image": "https://media.rawg.io/media/screenshots/a33/a33984b260fed508ca90dea660273162.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lasse", "theotherlars"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}