{"id": 94111, "slug": "anime-world-warriors-x", "name": "Anime World Warriors X", "name_original": "Anime World Warriors X", "description": "<p>Hey guys whats up! So I been board lately and I decided to put together this <strong>Mugen</strong>! If you dont know what a Mugen is, just imagine if Garry's Mod was a <strong>2D Fighting Game</strong>, but was free, and didn't have as many addons/mods. I know what your thinking, \" Mugens are just crappy unblanced 2D fighting games\" which you are right in a way. I put this Mugen together to make it balanced... but I only somewhat succeeded. To make it \"balanced\" I just disabled some characters from being chosen as an <strong>Ai</strong>. Ok, back to the main game specifics, It has <strong>142 characters </strong>with <strong>bonus boss battles and mini-games</strong> also there are <strong>24 stages</strong>. You can use a <strong>Controller</strong> if so desire and even <strong>Play With Your Against Your Friend</strong> with <strong>local-co-op</strong>. Almost all these characters are from<strong> popular anime</strong> such as Naruto, Dragon Ball Z, Bleach, Inuyasha, One Piece, One Punch Man, and more! Sorry about the <strong>game size</strong> guys its about <strong>3GB</strong>, lol some of the characters are very in dept and freaking awesome. Feel free to <strong>add or remove characters and or stages to your liking</strong>. Down the road I <strong>might add a stage pack or something</strong>, we will see. <strong>Credits</strong> can be found on the bottom of the Main Menu.</p><p>I Hope You Guys Enjoy My Mugen Collection! :D</p><p>Btw sorry for the crappy DBZ portraits had to change them because of Ui issues. <br/></p>", "metacritic": null, "released": "2016-06-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/dd3/dd3b4c6fbfb8c3ddef98ab3414d24131.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 394, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LegendaryXP"], "genres": ["Action"], "publishers": [], "esrb_rating": null}