{"id": 941153, "slug": "1bitslime", "name": "1bitslime", "name_original": "1bitslime", "description": "<p>[CAT]</p>\n<p>Nou joc en desenvolupament, aquest cop he decidit basar el joc en una paleta de colors de 1bit (blanc i negre)</p>\n<p>Objectius: a cada fase apareixerà una onada d'slimes que s'han de destruir, un cop destruits passa a la següent fase, els slimes i la velocitat en que apareixen augmenta. La dificultat no esta regulada, deixeu els vostres comentaris.</p>\n<p>Mou'te amb les fletxes i dispara amb la Z. <strong>Prem S en el menú per canviar l'idioma</strong>.</p>\n<p>Amb les telces D i F canvies els colors, E canvia entre paletes predefinides.</p>\n<p>[ENG]</p>\n<p>New game in development, this time I think that was grate to make a game with a 1bit color palette (black n white)</p>\n<p>Mission: each level is a wave of slimes and you need to destroy theme all, after destroy all the wave you will start the next level with more slimes and a fastest spawning. The difficult isn't tested, please leave your comments about that.</p>\n<p>Us <strong>arrows</strong> to move the character and <strong>Z</strong> to shoot. <strong>Press S on to start menu to change.</strong> lenguage.</p>\n<p>With <strong>D</strong> and <strong>F</strong> you can change the colors, with <strong>E</strong> you swap between predefined palletes.</p>\n<p>[ESP]</p>\n<p>Nuevo juego en desarrollo, esta vez he decidido qu estaria bien hacer un juego con paleta de color de 1bit (blanco y negro)</p>\n<p>Objetivo: en cada nivel recibirás una oleada de slimes y tienes que destruirlos todos, una vez hecho esto pasarás al siguiente nivel, con más slimes y apareceran mas rápido. La dificultad no esta ajustada, así que agradeceré los comentarios al respecto.</p>\n<p>Usa las <strong>flechas</strong> para moverte y la <strong>Z</strong> para disparar. <strong>Presiona S en el menú para cambiar</strong>. el idioma.</p>\n<p>con <strong>D</strong> y <strong>F</strong> puedes cambiar los colores, con <strong>E</strong> intercambias entre las paletas de color predefinidas.</p>", "metacritic": null, "released": "2023-03-10", "tba": false, "updated": "2023-03-13T14:43:32", "background_image": "https://media.rawg.io/media/screenshots/e7d/e7d2d7f7b8b0fca16966a9df01bcf973.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Kamencesc"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}