{"id": 941309, "slug": "crypt-shuffle", "name": "Crypt Shuffle", "name_original": "Crypt Shuffle", "description": "<p> Crypt Shuffle is a 3D roguelike. The player follows a wizard exploring a randomly generated dungeon and can find different spells. Death is permanent, so look out for ways to survive the onslaught of undead monsters in turn-based combat. </p>\n<p>This game was created for 7DRL 2023, a one week game jam. The 3D assets are part of a licensed third party package. The game was tested on Windows 11. Feel free to comment in case you have any trouble running the game or come across a bug, I'll do my best to fix any issue.</p>\n<p>Most important - enjoy and thanks for playing! </p>\n\n<ul><li><strong>How to play: </strong></li></ul>\n<p>The game is played by left-clicking to move and interact. Whenever it is your turn to move, blue tiles on the ground will indicate the location you can move to. Click a tile to move there. You can move only once per turn, be sure to give it some thought to avoid getting yourself into trouble.</p>\n<p>Moving, interacting with objects and casting spells uses action points. Your action points are represented by blue diamonds in the lower right corner of the game. Once you have spent all your action points, your turn ends.</p>\n<p>You can decide to skip a turn if you have remaining action points but don't want to use them. Simply click on skip turn in the bottom right corner. </p>\n<p>To survive in combat, you will need to use spells. Your active spell is highlighted in the bottom of the screen. If you find more spells, they will replace your active spell. Try hovering over an enemy or yourself when it is your turn and you have remaining action points. A highlight will indicate that you can cast a spell. Click to cast the spell.</p>\n<p>You will come across some objects that you can interact with. To interact, you need to stand on an adjacent square. If it is your turn and you have remaining action points, a highlight will be shown on the objects that you can interact with. Click to interact. </p>\n<p>You might find healing potions on your journey through the crypt. They are shown next to your health bar in the bottom left. If it is your turn and you have remaining action points, click the potion icon to refill some of your health.</p>\n<p>The game ends when you are running out of health points. You can restart the game with a new wizard. </p>", "metacritic": null, "released": "2023-03-10", "tba": false, "updated": "2023-03-13T15:52:48", "background_image": "https://media.rawg.io/media/screenshots/c74/c748d4f86dd8bf4e1f5f02b01e319a3b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MGaudi"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}