{"id": 941370, "slug": "sporty-grandma-vs-realistic-zombie-cops-just-follo", "name": "Sporty Grandma vs. Realistic Zombie Cops (Just Follow the Breif Edition)", "name_original": "Sporty Grandma vs. Realistic Zombie Cops (Just Follow the Breif Edition)", "description": "<p>THIS IS VERY MUCH A WORK IN PROGRESS, I MADE THIS PAGE FOR AN ASSIGNMENT, THE GAME ITSELF IS FAR FROM COMPLETE<br/></p><p>Welcome to Abstractland! Where<br/>nothing makes sense and styles<br/>clash more than your grandson’s<br/>suit color and tie! You are Sporty<br/>Grandma and you need to make it to the end<br/>of each stage while<br/>fighting off a horde of<br/>Realistic Zombie Cops!<br/><strong>Gameplay</strong><br/>Sporty Grandma Vs. Realistic Zombie Cops is a third person action game starring “Sporty Grandma” while<br/>she fights off a horde of Realistic Zombie Police in various stages armed with a sword, a few grenades,<br/>and a gun. Limited ammunition is given each stage and players are graded on stage completion time, and<br/>the number of kills they got in the stage. Bonus points will be given out if several enemies are dispatched<br/>in quick succession. The stages are set in Abstractland, where nothing makes sense and everything is<br/>strange, especially the clashing of styles between the character models, thus the player never knows<br/>what to expect in the next stage! Before each stage, the player has the option to change out swords, guns<br/>and grenades to help them do better in the stage depending on what they have unlocked.<br/>Story and Visuals<br/>The story is simple, you are sporty grandma, and suddenly you were transported to Abstractland! There’s<br/>a bunch of Realistic Zombie Cops and grandma conveniently is well trained in sword and gunplay!<br/>The game is set is a place called Abstractland. The visuals will be heavily<br/>inspired by the kind of art that people tend to make with raytracing software<br/>such as Bryce 3D it will be bright, colorful and<br/>strange. Some levels may be themed in ways com-<br/>pletely dissonant from others, this is something<br/>heavily inspired by the indie game “Puss!”. Levels<br/>may have a unique mechanic and the visual lan-<br/>guage will complement that. This decision is made<br/>because the character models chosen for the game are so dissonant and differ-<br/>ent that it would only make sense in this context.</p>", "metacritic": null, "released": "2023-03-10", "tba": false, "updated": "2023-03-13T16:23:34", "background_image": "https://media.rawg.io/media/screenshots/13a/13a686d0bf5a6a5c9803b3f0cef102dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Moon.k1000"], "genres": ["Action"], "publishers": [], "esrb_rating": null}