{"id": 941477, "slug": "armored-us", "name": "Armored Us", "name_original": "Armored Us", "description": "Armored Us is an epic adventure that will immerse you into a stunning sci-fi world. As a young technician, you will face dangerous obstacles and fight against insect-like creatures made of ore and rocks in your quest to survive on this unknown planet. But don't worry, you won't be alone in your journey. You'll have a trusty robot companion by your side to help you navigate through the complex and overcome the challenges that lie ahead.<br/><br/>As you explore the planet and uncover the secrets of the abandoned civilization, you will have to use all your wits and ingenuity to build complex mechanisms from various materials that you find in chests scattered throughout the game. From simple bridges and platforms to advanced machines that will help you defeat enemies and reach inaccessible areas, the possibilities are endless.<br/><br/>But it's not just about building and fighting. Armored Us also features mind-boggling puzzles that will test your logical thinking and problem-solving skills. From decoding cryptic messages to navigating through intricate mazes, you'll have to be on your toes to outsmart the challenges ahead.<br/><br/>With its stunning graphics and immersive gameplay, Armored Us is a must-play game for all sci-fi enthusiasts and puzzle lovers out there. So gear up, grab your tools, and get ready to embark on an unforgettable adventure in the depths of an unknown planet!<br/><br/>Features:<br/><ul><li>Unique sci-fi world: Players will immerse themselves in an engaging and captivating world where they will explore an unknown planet inhabited by dangerous insect-like creatures made of ore and rocks.<br/></li><li>Various mechanisms and tools: Players will have access to different materials and tools that they can use to create various mechanisms. From simple structures to complex devices, players can create and adapt their mechanisms to solve various tasks and challenges.<br/></li><li>Diverse missions and puzzles: Players will face a variety of missions and puzzles that will test their logical thinking and ability to make quick decisions.<br/></li><li>Original soundtrack and sound effects: Armored Us is accompanied by an original soundtrack and sound effects that create a unique atmosphere and add to the gaming experience.<br/></li><li>An adventure for every taste: The combination of action, adventure, and puzzles makes Armored Us the perfect game for players of all ages and preferences. Whether you love building mechanisms, exploring the world, or solving puzzles, you will surely find something in the game that suits your taste.</li></ul>", "metacritic": null, "released": "2023-03-13", "tba": false, "updated": "2023-03-17T05:49:48", "background_image": "https://media.rawg.io/media/screenshots/f36/f36a93bec7eb3b2318f3cbdfde1643e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["galesoozka"], "genres": ["Adventure", "Indie"], "publishers": ["galesoozka"], "esrb_rating": null}