{"id": 941480, "slug": "captain-the-looper", "name": "Captain The Looper", "name_original": "Captain The Looper", "description": "Captain the Looper is a wave action-shooter game where you take control of Captain The Looper and defend planet Earth from invading aliens. With the help of the entire planet, you must successfully protect humanity. However, various alien ships will try to hinder your progress by attacking you and setting up traps in the form of shields. To aid you in your mission, you can upgrade your ship using bonuses. Your objective is to protect planet Earth at all costs.<br/><br/>Features:<br/><ul><li>Intense wave-based gameplay: Players must face off against multiple waves of alien enemies, each one more challenging than the last. As the game progresses, players will encounter new types of enemies and must adapt their strategies to overcome them.<br/></li><li>Upgradable ship: To aid in their mission, players can collect power-ups and bonuses to upgrade their ship. These upgrades can increase the ship's firepower, speed, and durability, allowing players to take on tougher enemies.<br/></li><li>Dynamic environments: The game takes place in a variety of locations, each with its own unique hazards and challenges. From the depths of space to the Earth's atmosphere, players must navigate dynamic environments while fighting off waves of enemies.<br/></li><li>Unique enemy types: The game features a wide range of alien enemies, each with its own unique abilities and attack patterns. Some enemies will fire projectiles at the player, while others will attempt to ram the player's ship.<br/></li><li>Collaborative gameplay: In addition to upgrading their ship, players can also work with the planet's defenses to protect Earth. This collaborative gameplay adds an extra layer of strategy to the game, as players must balance protecting their ship with defending the planet.</li></ul>", "metacritic": null, "released": "2023-03-13", "tba": false, "updated": "2023-03-17T05:53:01", "background_image": "https://media.rawg.io/media/screenshots/17c/17c194cfedfb7cff6a89a464ba4edd9e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["galesoozka"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["galesoozka"], "esrb_rating": null}