{"id": 941462, "slug": "noworse", "name": "No:Worse", "name_original": "No:Worse", "description": "Natsu Kashigaru learned at a young age that justice is often elusive. <br/><br/>He is about to graduate from Tokyo University of the Arts, but he has no job prospects or solid plans for his future.  Natsu has no idea what to do now, but despite that, he longs to pursue his passion for art, but his insufficient funds prevent him from doing so.<br/><br/>Fortunately, he has four wonderful girls who support him in his endeavors. But also, Natsu can't let them live in poverty. Suddenly, life offers him an opportunity to turn his situation around. His alma mater, Tokyo University of Arts, is hosting two alumni art competitions, which could be the chance he needs to make a name for himself.<br/><br/>\"No:Worse\" is a beautiful love story unfolding between two vulnerable individuals with kind but fragile hearts. Throughout it, you will encounter moments of despair, heartbreak, and deceit. And conquering these flaws lies entirely in your hands.<br/><br/>The game takes around four to five hours to complete with over six endings. The characters are brought to life with animated sprites and CGs, featuring lip-sync, breathing, chest physics, and a vast range of emotions.<br/><br/><br/><br/>https://store.steampowered.com/app/2245100/Without_You/<br/><br/>https://store.steampowered.com/app/1916450/Summer_With_You/<br/><br/>https://store.steampowered.com/app/1870580/Winter_With_You/", "metacritic": null, "released": "2023-03-16", "tba": false, "updated": "2023-03-17T05:32:25", "background_image": "https://media.rawg.io/media/screenshots/7ba/7ba45e142f67bdc53afcf3d1574199a8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 255, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Aleksey Izimov"], "genres": ["Casual", "Indie"], "publishers": ["Aleksey Izimov"], "esrb_rating": null}