{"id": 941483, "slug": "alice-in-dreamland", "name": "Alice in dreamland", "name_original": "Alice in dreamland", "description": "*All characters in this game are 18 or older.<br/>\r\nA humiliation-type RPG about a girl who stumbles into a parallel universe.<br/>\n<br/>\r\n~Prologue~<br/>\r\n\"Alice Minase\" went to school and got a job like everyone else.<br/>\r\nAfter years of the same thing over and over again, she wanted to get away from it all.<br/>\r\nOne evening when she came home from work...<br/>\r\nA book about a \"Wonderland\" falls off from the shelf.<br/>\r\n\"I wish I could live in a place like this...\"<br/>\r\nThen, her wishes came true as she stumbled into the \"Wonderland\".<br/>\n<br/>\r\n~Humiliation scene~<br/>\r\nHumiliation scenes occur during events and when you lose to bosses in various areas.<br/>\r\nIncomplete humiliation scenes can be unlocked after you beat the game. (Recollection room available)<br/>\n<br/>\r\n~Game features~<br/>\r\nMost basic objects can be inspected.<br/>\r\nYou can find clues about the character's emotions and back story.<br/>\r\nSome items will yield different results after inspecting it numerous times.<br/>\r\n*In some cases, you can get a bigger picture of things.<br/>\n<br/>\r\n~Achievements~<br/>\r\nThere are multiple achievements in the game based on progress and events.<br/>\r\nThese achievements are \"shared between all saved data\" and is \"auto-saved\".<br/>\r\nSo even if you can't go back to a certain scene, you can \"use the old data and complete the achievement\".<br/>\r\n*Achievements do not include things like; Collecting items, buying/selling items, taking out specific enemies a certain amount of time.<br/>\n<br/>\r\n~System~<br/>\r\n- Simple turn-based battle system.<br/>\r\n- Messages can be skipped.<br/>\r\n- Save anywhere.", "metacritic": null, "released": "2023-03-13", "tba": false, "updated": "2023-03-17T05:56:54", "background_image": "https://media.rawg.io/media/screenshots/554/554a2de90f9b6dbada449889a72fed43.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 306, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["circle J"], "genres": ["RPG"], "publishers": ["WASABI entertainment"], "esrb_rating": null}