{"id": 941580, "slug": "daydream-forgotten-sorrow-demo", "name": "Daydream: Forgotten Sorrow Demo", "name_original": "Daydream: Forgotten Sorrow Demo", "description": "The full version of Daydream: Forgotten Sorrow is coming soon! You can wishlist it here\n<br/><br/>\nDaydream: Forgotten Sorrow is an atmospheric puzzle platformer game starring Griffin, a little boy who struggles to face his fears. Thankfully, his teddy bear companion Birly is always by his side.\n<br/>\n<br/>\nThe duo's journey will not be easy. Traversing the expanse of light and darkness will force the pair to confront traumatic memories and make amends with the monsters of the past.\n<br/>\n<br/>\n<br/>\n<br/>\nBirly's help is invaluable. Send him anywhere Griffin can't reach. Toss the teddy bear over a high beam to press a button or command him to crawl into a tiny hole. Together, the duo can move heavy objects, overcome traps and succeed at whatever new challenges await them.\n<br/>\n<br/>\n\n  \n\n\nDiscover a touching story\nHave you ever woken up in a surreal universe with a living teddy bear companion by your side? We didn’t think so. Step into Griffin’s shoes as he attempts to shed light on the mystery of this strange new world. Embark on a sweeping adventure and unravel a heartwarming story of two friends achieving the impossible in the face of doubt.\n<br/>\n<br/>\n  \n\nOvercome tough challenges\nEnlist Birly's help to solve intricate puzzles and explore a new world. You control Griffin directly, but can also pick up, throw and issue commands to your teddy bear companion to aid your progress.\n<br/>\n<br/>\n  \n\nExplore mysterious world\nGriffin finds himself in a dark place haunted by visions of the past, yet there is more to this world than doom and gloom. Once you have mustered the strength to press forward, you’ll find a fascinating and multifaceted world filled with floating castles, rugged caves, fairytale forests and sunny plains.\n<br/>\n<br/>\n<br/>\n<br/>\nJOIN OUR DISCORD\n<br/>", "metacritic": null, "released": "2023-03-15", "tba": false, "updated": "2023-03-17T08:14:10", "background_image": "https://media.rawg.io/media/screenshots/6ac/6ac6ae4f9ac5c8e440ebb24365885765.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 482, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Frozen Line"], "genres": [], "publishers": ["Ravenage Games"], "esrb_rating": null}