{"id": 941576, "slug": "the-legend-of-heroes-trails-to-azure-launch-week-b", "name": "The Legend of Heroes: Trails to Azure – Launch Week Bundle", "name_original": "The Legend of Heroes: Trails to Azure – Launch Week Bundle", "description": "\n<br/>\n\nGet the complete Trails to Azure experience with the Launch Week Bundle which includes the game, official soundtrack and digital art book!<br/>\n<br/>\nFollowing the events of Trails from Zero, the Special Support Section find themselves with new members and new duties. However, rising tensions in Crossbell along with pressure from two neighboring political powers threaten both the safety of their home, as well as the integrity of their team.<br/>\n<br/>\nThe story of aspiring hero Lloyd Bannings continues in Trails to Azure !<br/>\n<br/>\nSet just a few months after the events of Trails from Zero , a temporary peace has settled over Crossbell and the Special Support Section find themselves with newfound fame and status, thanks to their heroic actions.<br/>\n<br/>\nHowever, the peace is soon broken with the rise of multiple organizations with ulterior motives. Framing these growing tensions is the increasing pressure from the Erebonian Empire and the Republic of Calvard, with Crossbell caught between them. With the safety of their home and the foundations of their team now on the line, Lloyd and his allies must gear themselves for the threats that loom ahead. Little do they know that Crossbell will soon become the stage for a climactic conflict that will determine its future...\nKey Features:\n\n<ul>\n<li>The Fate of the City-State: Play through the finale of the Crossbell arc, a key thread within the Trails universe. What lies ahead for Lloyd Bannings and his ragtag squad of allies?</li>\n<li>Crossbell’s Finest Forces: Experience new combat features introduced by Trails to Azure, including Burst, Back Attack, and even your own customizable car. Also, meet a few familiar faces from the Trails of Cold Steel series!</li>\n<li>Power from the Past: Import save data from Trails from Zero for a different story experience, including additional event scenes and entirely new scenes! Also, use your save data from Trails to Azure for bonuses in the upcoming release of Trails into Reverie!</li>\n</ul>\n\n“Azure Archives” Art Book:\n<br/>\nEnjoy the “Azure Archives” art book and experience the beautiful art that brings Crossbell to life!\n“Anthems of Crossbell Part II” Official Soundtrack:\n<br/>\nFeaturing 10 tracks, this official soundtrack showcases the sounds of Crossbell!<br/>", "metacritic": null, "released": "2023-03-13", "tba": false, "updated": "2023-03-17T08:05:46", "background_image": "https://media.rawg.io/media/screenshots/53c/53cdfaa27f0c535a1994d8a3f197dc16.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 554, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nihon Falcom", "PH3"], "genres": [], "publishers": ["NIS America"], "esrb_rating": null}