{"id": 941512, "slug": "terminal-velocity-boosted-edition", "name": "Terminal Velocity: Boosted Edition", "name_original": "Terminal Velocity: Boosted Edition", "description": "Terminal Velocity™: Boosted Edition runs the original Terminal Velocity natively on modern systems with the Infernal Engine, rendering the original graphics with an improved HUD for widescreen displays!<br/><br/>Climb back into the cockpit! Terminal Velocity™: Boosted Edition is a 360-degree combat flight simulator, featuring a variety of different planets to battle across and a high-powered weapon arsenal to aid you in all of the fast-paced action. In the far future, armadas from surrounding systems have suddenly waged war on Earth. You are a pilot from the Ares Squadron, flying the fastest, most dangerous aircraft ever made. You’re outgunned, outmanned, and strapped inside a flying coffin. Are you ready?<br/><br/>Terminal Velocity™: Boosted Edition is more than your routine flight simulator, with combat as the main objective, and a straightforward control layout to thrust you right into the action! Explore nine unique planets, each with three levels, dozens of tunnels, and miles upon miles of terrain to fly over. To support you in battle, you’ll have access to seven destructive spectacular air-to-air and air-to-ground combat scenarios.<br/><br/><br/>Features<br/><ul><li>Greatly extended draw distance lets you target enemies from further away while enjoying the sprawling view of the game's landscape <br/></li><li>Improved sky rendering code reduces polygon jitter<br/></li><li>Sound channels are now re-engineered to give you the full 360 effect intended by the original code with output on a modern audio system<br/></li><li>Achievements/Trophies are being implemented into the game for the first time! These challenges will truly test the mettle of all pilots.<br/></li><li>Fast-paced flight simulator with combat and a straightforward control layout.<br/></li><li>Nine (9) unique planets, with three (3) levels per planet, dozens of tunnels, and over 400,000 sq. miles of terrain.<br/></li><li>Seven (7) destructive weapons, multiple power-ups, and spectacular air-to-air and air-to-ground combat.<br/></li><li>Enemy ships cast translucent shadows.<br/></li><li>Bank, roll, loop, and thrust bow-first into battles.</li></ul>", "metacritic": null, "released": "2023-03-14", "tba": false, "updated": "2023-03-17T06:35:33", "background_image": "https://media.rawg.io/media/screenshots/47e/47e267864dab1789f8b31c04b6a71558.jpg", "website": "https://www.ziggurat.games/game/terminal-velocity-boosted-edition", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 47, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 298, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Terminal Reality"], "genres": ["Action", "Adventure", "Simulation"], "publishers": ["Ziggurat"], "esrb_rating": null}