{"id": 941527, "slug": "deck-of-the-dead-2", "name": "Deck of the Dead", "name_original": "Deck of the Dead", "description": "<strong>Deck of the Dead\" is a thrilling roguelike deck builder game set in a dark and eerie world of vampires.</strong><br/>Players will embark on an epic journey as a powerful vampire seeking to conquer the land and claim ultimate power. The game is set in a randomly generated world filled with dangerous enemies, mysterious secrets, and powerful treasures. Players will use their deckbuilding skills to create the ultimate deck of vampire abilities and weapons, allowing them to defeat their enemies and progress deeper into the world.<br/><ul><li>Customizable Decks: Build your own custom deck of cards by selecting from a range of powerful abilities, equipment, and allies, and tailor it to your preferred playstyle.<br/></li><li>Unique Enemies: Battle against a variety of enemies that pose different threats, including undead creatures, hunters, and other supernatural beings.<br/></li><li>Evolving Gameplay: Over time, new cards and abilities become available, making the gameplay richer and more complex as you progress through the game.<br/></li><li>Beautiful Artwork: Enjoy stunning artwork that captures the dark and brooding atmosphere of the vampire world, from haunting landscapes to terrifying creatures.<br/></li><li>Easy to Learn, Hard to Master: The game is easy to learn, but hard to master, making it accessible to players of all skill levels, while still providing a satisfying challenge for experienced players.</li></ul>", "metacritic": null, "released": "2023-03-14", "tba": false, "updated": "2023-03-17T06:55:21", "background_image": "https://media.rawg.io/media/screenshots/28a/28ae100cf6015ebef39df568f6af4343.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BirthdayGirl"], "genres": ["RPG", "Casual", "Indie"], "publishers": ["Hopscotch Games"], "esrb_rating": null}