{"id": 941598, "slug": "bad-2-bad-apocalypse", "name": "Bad 2 Bad: Apocalypse", "name_original": "Bad 2 Bad: Apocalypse", "description": "◆ Attention<br/>No responsibility is taken for data lost by device changes or uninstalling the game. Please take particular care of your data when changing devices or reinstalling.<br/><br/>◆ Features<br/>+ Vast Open World RPG! An expanded world to explore!<br/>+ Exploration, Gathering, Fishing and Crafting for survival!<br/>+ 3 times as many items and weapons than the previous game<br/>+ More detailed character customization and appearances<br/>+ Over 60 maps and regions to explore!<br/>+ \"World Missions\" that take place across the globe<br/>+ Create and upgrade your own special forces team<br/>+ Artillery Support, Air Support, and Powerful Drones!<br/>+ Embark on \"Battle Armor\" and engage in combat<br/>+ Advanced graphics and upgraded systems<br/><br/>■ About “Bad 2 Bad: Apocalypse”<br/>'Bad 2 Bad: Apocalypse' is the sequel to 'Bad 2 Bad: Delta' and 'Extinction', armed with a vaster world and richer content. Apocalypse follows the story of the Delta Team, led by Major Pan, saving and reconstructing the world ravaged by a virus from the Human Forces. Join the Delta Team on their journey from survival to rebuilding the world.<br/><br/>■ Survival and Rebuilding<br/>With the core contents of Exploration, Gathering, Fishing, and Crafting for survival, upgrade your Base Camp and craft equipment to defeat powerful enemy forces and virus-infected Wilders to rebuild the world.<br/><br/>■ Upgraded Customization<br/>From weapon remodeling to character appearances, much more detailed customization is possible. Night Vision and many accessories have been added to increase the depth of customization compared to previous games.<br/><br/>■ Your Own Special Forces<br/>With a more powerful customization and squad system, in addition to being able to flexibly change tactics to fit the situation, the importance of each squad member and tactical changes are more important than ever in Apocalypse.<br/><br/>■ Powerful Support Weapons<br/>Artillery support from self-propelled artilleries, air support from attack helicopters, and combat drones can be part of the squad, in addition to the powerful tactical weapon \"Battle Armor\", which you can embark on and ride into battle.", "metacritic": null, "released": "2023-02-22", "tba": false, "updated": "2023-12-20T10:00:23", "background_image": "https://media.rawg.io/media/screenshots/1c8/1c8708b0a9e905b1d3e73dcb23ab4a29_vhadSgA.jpg", "website": "https://dawinstone-games.web.app/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 417, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS"], "developers": ["ChangHun Choo"], "genres": ["Action", "RPG"], "publishers": ["ChangHun Choo"], "esrb_rating": "Teen"}