{"id": 941583, "slug": "new-classic-solitaire-klondike", "name": "New Classic Solitaire Klondike", "name_original": "New Classic Solitaire Klondike", "description": "Play the best classic Microsoft Solitaire card games. <br/><br/>Remember playing the amazing classic solitaire on your old Windows computer? Now you can play your favourite essential classic solitaire on your mobile too. Play the free classic Solitare on our app. Play our classic Solitaire with daily challenge to train your brain. Solitaire is a great way to relax the wires of your brain during short breaks and after a long day at work. Original Solitaire levels will help you recharge your batteries. Sharpen your mind and have fun with this addictive solitaire card game. Our iOS version of the game contains all the classical elements combined with new features like customizing the deck of cards and changing the background. Play our iOS version of Klondike Solitaire free for iPad and iPhone.<br/>This version of the game is called Klondike Solitaire or The Patience Game. Free card game Klondike Solitaire's main rule is that all cards, which are initially arranged in four piles in a random sequence, must finally be arranged in ascending order, starting with the Ace and finishing with the highest card, the King. Each pile can only include cards of a specific suit. The player will score more points the quicker they play the game. It becomes increasingly more difficult to complete the assignment when you play Solitaire all at once in the sophisticated variant known as Klondike.<br/>SOLITAIRE HIGHLIGHTS: <br/>•\t Classic Solitaire gameplay: <br/>•\t Klondike Solitaire uses a standard 52 card deck of playing cards without Jokers. The objective of the game is to expose all cards and move them into the foundation piles. There are 4 foundation piles (one for each suit) which are represented on the screen by an “A” written on it. These piles are built upward in suit from Aces to Kings. <br/>•\t In Klondike Solitaire there are 7 Tableau columns which are built downward (in decreasing rank from Kings to Aces) in alternating colours (red and black). The aim of the game is to clear all the rows into the suitable Foundation piles.<br/>•\t Addictive and challenging levels: Practice your logic skills, memory, and patience with the all-new Solitaire Daily Challenges. Play these free Klondike Solitaire card games anytime on your mobile device and become a real Solitaire master! Keep your mind super active with original Solitaire Klondike levels.<br/>•\t Play a match against others in real time: Race against the world when you play Klondike Solitaire with others in multiplayer. Brag about your scores and show off to your friends with the leader-boards that are included in this game!<br/><br/><br/>FEATURES:<br/>•\tClassic Solitaire gameplay<br/>•\tPlay right-handed and left-handed<br/>•\tDraw 1 card or 3 cards at a time<br/>•\tNew puzzles with unique ways to train your brain with the classic game Klondike Solitaire!<br/>•\tDaily Challenge! Win a gift simply for showing up!<br/>•\tCustomizable Backgrounds and Card Decks.<br/>•\tMultiple Hints and Undos to help you in the card game.<br/>•\tPlay games online or go offline with random deals. No WIFI required to play anywhere for free!<br/><br/><br/>Progress tracker: <br/>•\tRecord all your wins <br/>•\tSee your improvement in real time<br/><br/><br/>Basic Klondike Solitaire rules:<br/>Klondike Solitaire card game is easy with simple rules:<br/>•\tTap or drag to move cards arranging them in descending order with alternating colors.<br/>•\tMultiple cards can be moved together, as long as the cards in the sequence being moved are in descending order and are in alternating colors (red/black, etc).<br/>•\tMove cards up to the Foundation to sort all of the suits from Ace to King.<br/>•\tOnly a King or a pile starting with a King can be placed in an empty space on the Solitaire Tableau<br/>Klondike Solitaire is a great opportunity to train your brain, improve your problem-solving skills! Train your brain with our great puzzles and solve each Daily Challenge to receive a crown for that day. Earn trophies each month by winning more crowns! Play our Daily Challenges and Solitaire FREE!", "metacritic": null, "released": "2022-06-24", "tba": false, "updated": "2023-03-17T08:17:42", "background_image": "https://media.rawg.io/media/screenshots/bde/bde1422d478ef4fa3132ce151b84de01_v80Xck7.jpg", "website": "https://homagames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Homa Games"], "genres": ["Board Games", "Card"], "publishers": ["HOMA GAMES"], "esrb_rating": "Everyone 10+"}