{"id": 941675, "slug": "street-fighter-duel", "name": "Street Fighter: Duel", "name_original": "Street Fighter: Duel", "description": "Enter the world of Street Fighter like never before with the first mobile RPG game of the franchise - Street Fighter: Duel! <br/><br/>Street Fighter: Duel is the official Street Fighter RPG mobile game for the casual Street Fighter fan, where you can collect and upgrade a team of recognizable fighters and ​battle your way through an original story or against friends and powerful opponents around the world. <br/><br/>OFFICIAL STREET FIGHTER MOBILE GAME<br/>Street Fighter: Duel features all the iconic characters you know and love with stunning graphics and smooth gameplay that stays true to the classic Street Fighter experience.<br/><br/>COLLECT NEW AND ICONIC STREET FIGHTER CHARACTERS! <br/>Choose from a growing roster of over 40 iconic characters, including Ryu, Chun-Li, Cammy, Guile, and more. Each character comes with their own unique fighting styles and special moves. Unlock character skins exclusive to Street Fighter: Duel, putting a fresh spin on beloved Street Fighter characters with new skins dropping all the time. <br/><br/>BUILD AND UPGRADE your own team! <br/>Collect and upgrade tons of unique accessories, armor, and special moves. Each character also has their own unique combo chains, allowing you to tailor your fighters to fit your play style.<br/><br/>ORIGINAL STORY!<br/>Be prepared to travel the globe recruiting friends to take down Shadaloo’s army of mech clones in an extensive story mode. <br/><br/>CREATE YOUR OWN EXPERIENCE! <br/>Strategize with real-time RPG combat or turn on auto-battle to lightning kick your way through fights.<br/><br/>PLAY WITH FRIENDS!<br/>Challenge friends and other players from around the world in real-time battles and climb the ranks. <br/><br/>JOIN A GUILD!<br/>Join a guild and play with friends, or make new ones in the game community. Guilds offer unique benefits for members, a private chat server, and more!<br/><br/>New Challenges, Events, Missions, and Rewards EVERY DAY!<br/>In addition to the thrilling PVP and PVE gameplay, the game also offers daily and weekly events, where players can compete for exclusive rewards and climb leaderboards. Log in every day for rewards and exclusive characters and skins, such as Chun-Li Vigilante. <br/><br/>Street Fighter: Duel is the ultimate mobile fighting RPG experience for fans of the series and newcomers alike. PRE-REGISTER NOW!", "metacritic": null, "released": null, "tba": false, "updated": "2023-03-17T10:02:25", "background_image": "https://media.rawg.io/media/screenshots/94a/94ae6fee266d99b75e264c73ad8283da.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 420, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Crunchyroll Games"], "genres": ["RPG"], "publishers": [], "esrb_rating": "Teen"}