{"id": 941620, "slug": "fields-of-battle-2", "name": "Fields of Battle 2", "name_original": "Fields of Battle 2", "description": "Build your own Paintball Park.  Battle other players in live PvP multiplayer.  Compete in Daily Tournaments and Monthly Leagues for the top spot and prizes!<br/><br/>The #1 Extreme Sports First-Person Shooter franchise, Greg Hastings Paintball, is back and better than ever!<br/><br/>If you're a first-person shooter fan, Fields of Battle 2 will satisfy your desire to blast the competition.  With ground-breaking motion and gesture controls including sliding, diving, leaning out from cover, throwing grenades, and more, this long-awaited sequel once again advances the mobile shooter experience to the next level.<br/><br/>Think you know shooters?  This takes real skill - one hit, one elimination.  Pick your cover, adjust for wind, angle your shot, and start sending paint.  There's no auto-aim here, it's PURE skill and PURE action!<br/><br/>* FREE to start creating your field and playing in multiplayer tournaments<br/>* Play LIVE PvP against players from around the world<br/>* Build your own paintball field in YOUR style - speedball, woodsball, or recball, with tons of realistic bunkers, buildings, even a castle!<br/>* Unlock new field items and HERO skins as you advance<br/>* Real life paintball gear, including automatic, burst mode, Mag-fed, MilSim, and speedball markers, and don't forget the PAINT GRENADES<br/>* Intuitive motion and gesture controls with full HUD and control customization<br/><br/>Visit our official site at http://www.gregredhastings.com<br/><br/>Privacy Policy: https://fobserver2.superxstudios.com/fcgi/FOB2/FOB2_WebServer.exe?privacy<br/><br/>Terms of Use (EULA): https://www.apple.com/legal/internet-services/itunes/dev/stdeula/", "metacritic": null, "released": "2022-11-08", "tba": false, "updated": "2023-03-17T08:58:33", "background_image": "https://media.rawg.io/media/screenshots/9cd/9cd68c516f443435cee94ec798ff3498_PThbnOv.jpg", "website": "https://www.superxstudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 302, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Super X Studios"], "genres": ["Action", "Sports"], "publishers": ["Super X Studios"], "esrb_rating": "Teen"}