{"id": 941628, "slug": "king-or-fail-castle-takeover", "name": "King or Fail - Castle Takeover", "name_original": "King or Fail - Castle Takeover", "description": "► ARE YOU A FARMER OR A FIGHTER?<br/><br/>In this fun new idle role-playing game, you’re both, with sidelines in mining, crafting, construction and management too. In fact, you’re a king, with a kingdom to protect, expand and develop, and if you want to succeed there’s a lot of work ahead of you. Start with just a small squad of swordsmen and a few berry trees, then get working to build a city, feed your people, raid enemy castles for resources and experience, expand your army and turn your tiny village into a flourishing and fearsome empire.<br/><br/>► ARE YOU WORTHY OF THE CROWN?<br/><br/>• Turn your swords to plowshares: Start the game farming berries, sell them at market to feed your hungry people and use the coins you make to invest in the development of your kingdom and your wars of conquest. <br/><br/>•  …and your plowshares into swords: Spend the profits you make from crafting in this all-action RPG on expanding and upgrading your army, with five different types of soldier to recruit and improve. Turn your small band of raiders into a mighty horde of fiercely armed knights and archers, ready to conquer the known world.<br/><br/>• Head for the longboats: Time management and resource mining aren’t enough: a great king has to prove themselves in battle. So, once you’ve taken care of your subjects’ basic needs, earned coins and upgraded your army, sail off to war, raiding over 90 enemy towns and castles for plunder and XP.<br/><br/>• The builder king: Equip your town with new houses and facilities. The game has over a dozen different types of resources for you to craft into over 150 different new buildings and industries, from warehouses to taverns to luxurious palaces, that will also bring you idle profits when you’re out of the game.<br/><br/>• By royal command: Of course, a king needs soldiers, but you’ll also need a whole host of other workers to keep your kingdom and your idle income ticking over. Hire and upgrade farmers, woodcutters, miners and more to really make your craft empire flourish.<br/><br/>• Go ballista: Start every battle with a bang by using the ballista to hit the enemy where it hurts. Upgrade this powerful weapon to get access to ten increasingly destructive types of projectiles so you can really show the enemy who’s king of the castle!<br/><br/>► ARE YOU READY FOR A ROYAL ADVENTURE?<br/><br/>Download King or Fail now and dive into an all-action RPG that combines crafting, conquest and world-building in a fun and addictive casual format. If you like the idea of role-playing as a hard-working, hard-fighting medieval monarch determined to build the biggest, fiercest, most prosperous kingdom, you’re guaranteed to enjoy King or Fail. Failure—like boredom—just isn’t an option.<br/><br/>Privacy Policy: https://say.games/privacy-policy<br/>Terms of Use: https://say.games/terms-of-use", "metacritic": null, "released": "2023-02-27", "tba": false, "updated": "2023-03-17T09:11:29", "background_image": "https://media.rawg.io/media/screenshots/001/0019346bc86fa2d3248900be317ec53a_Lj8yoUR.jpg", "website": "https://say.games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SayGames"], "genres": ["RPG", "Casual"], "publishers": ["SayGames"], "esrb_rating": "Teen"}