{"id": 941603, "slug": "tacape-2", "name": "Tacape", "name_original": "Tacape", "description": "Tacape is a deck-builder card game with roguelite elements for those who love a tactical challenge. Take part in a series of combats, build your strategy, upgrade your cards and face folkloric creatures along the way!<br/><br/>Be careful! Enemies can switch between positions and will be intent on hindering you in various ways during combat. You will have to manipulate the battlefield, understand the behavior of each enemy, and make smart moves to win every battle: there are countless strategies' opportunities!<br/><br/>Buy and upgrade your cards at the shop, get new abilities with the artifact, heal yourself at the campfire and fight bosses in a Brazilian folk universe!<br/><br/><strong>STORY:</strong><br/>How far would you go to face your fears?<br/>Follow the journey of Lorena, who, after having her little brother taken away by a mysterious creature must venture into the forest and face various folk figures.<br/>In Tacape fear and courage go hand in hand, it's up to you to decide which is stronger.<br/>Discover also the adventure of Lucas, the little brother of Lorena who will try everything to get out of the forest to get back to her big sister. <br/><br/>Do you have what it takes to save them from the creatures? Play now and help them to go through this mysterious forest!<br/><br/><strong>Download Tacape and discover: </strong><br/>• 2 different characters with unique abilities<br/>• More than 100 cards <br/>• More than 25 enemies<br/>• 4 playable areas", "metacritic": null, "released": "2023-02-28", "tba": false, "updated": "2023-09-29T05:32:45", "background_image": "https://media.rawg.io/media/screenshots/9a3/9a3ac53df7489b6e145d2492f764ae99_cYAoNVj.jpg", "website": "https://plugindigital.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "iOS"], "developers": ["Plug In Digital", "Really Long Birds", "Aiyra"], "genres": ["Strategy", "Card", "Indie"], "publishers": ["Plug In Digital", "PID Games"], "esrb_rating": "Everyone 10+"}