{"id": 941624, "slug": "block-mania-block-puzzle", "name": "Block Mania - Block Puzzle", "name_original": "Block Mania - Block Puzzle", "description": "Block Mania is an addictive block puzzle game combines block building, puzzle solving and enjoyable gameplay. This great block puzzle game offers an exciting and entertaining experience for players of all ages.<br/><br/>The goal of the game is place blocks in the 8x8 board and fill the lines. Drag and drop blocks onto the board to complete clearing multiple rows or columns at once. Match the lines and enjoy the shiny and satisfying animations. Blast as many colorful blocks as you can at once with an amazing experience.<br/>Players to use their strategic thinking and problem-solving skills to make more combo. Score in every block blasting. Make the combos, double score and reach the highest score.<br/>Try to clear the entire board from blocks with smart moves and get the extra scores. There is no time limit, no need to play fast. In every move think well, make the right decision!<br/>As you progress, the blocks become more harder to match, requiring players to think more and plan their moves carefully. Create your own playing strategy and pass your best point.It's Easy to learn but hard to master!<br/><br/>It's an exciting and challenging puzzle that you'll be addicted to in no time!<br/><br/>How to Play:<br/>- Drag blocks onto the board to place them in the grid.<br/>- Fill a line to clear blocks from the board.<br/>- Clear multiple row or column to earn Combo points!<br/>- Blast the colorful blocks and beat your best score!<br/>- Have a nice puzzles with colorful pieces.", "metacritic": null, "released": "2023-02-02", "tba": false, "updated": "2023-03-17T09:05:23", "background_image": "https://media.rawg.io/media/screenshots/e27/e278a334f0b44378ae857e5608e1c40c_lCEvTe9.jpg", "website": "http://loopgames.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Loop Games Oyun Teknolojileri Anonim Sirketi"], "genres": ["Casual", "Puzzle"], "publishers": ["Loop Games Oyun Teknolojileri Anonim Sirketi"], "esrb_rating": "Everyone 10+"}