{"id": 941606, "slug": "monkey-supermarket", "name": "Monkey Supermarket", "name_original": "Monkey Supermarket", "description": "You control a cute monkey character that just created their supermarket. Plant fruits, move around from station to station to fill the stands with bananas or corn, or more. Clients will pick them up and wait for you at the cashier desk. You can upgrade your character, unlock new work stations, or even recruit other workers to help you.<br/><br/>Monkey Mart is a fun and engaging mobile game available on the Apple iOS platform. In the game, players take on the role of a monkey shopkeeper and must manage their store, stock shelves, and keep customers happy. Players must make strategic decisions such as which products to stock, how to price items, and how to decorate the store to attract more customers.<br/><br/>The game features cute, cartoon-style graphics that bring the characters and world to life. The gameplay is simple and easy to pick up, with players interacting with the game primarily by tapping on the screen.<br/><br/>One of the most enjoyable aspects of Monkey Mart is the sense of progression as the player's store grows and evolves over time. As the player earns more money, they can purchase new items to stock in their store, upgrade the store's layout, and even expand the store to include new sections such as a bakery or a clothing section.<br/><br/>The game also includes a variety of different customers, each with their own unique personalities and preferences. Players must pay attention to what customers want and do their best to keep them satisfied. This adds an extra layer of challenge and replay ability to the game.<br/><br/>Overall, Monkey Mart is a fun and entertaining mobile game that offers a unique and satisfying experience for players. With its cute graphics, simple gameplay, and strategic elements, it's a game that is easy to pick up but offers a lot of depth for those who want to fully immerse themselves in the role of a monkey shopkeeper.", "metacritic": null, "released": "2023-01-29", "tba": false, "updated": "2023-03-17T08:42:38", "background_image": "https://media.rawg.io/media/screenshots/fd7/fd7961e7fda8db99482f55f8f9d4ac29_0pXBlzZ.jpg", "website": "http://keremgonen.com/wp/2023/01/22/monkey-mart-privacy-policy/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Yalcın Kucukoztas"], "genres": ["Simulation", "Casual"], "publishers": ["Yalcın Kucukoztas"], "esrb_rating": "Everyone 10+"}