{"id": 941602, "slug": "volzerk", "name": "Volzerk", "name_original": "Volzerk", "description": "Monster Breeding &amp; Action RPG. Explore the world and raise legendary monsters!<br/><br/>Volzerk：Monsters and Lands Unknown, the Crossbreeding Action RPG!<br/>Join protagonist Fina on an adventure to discover legendary monsters!<br/>Raise monsters, join a colorful cast of friends, and face off against powerful enemies!<br/><br/>◆Summary<br/>The island of Fort Lemuria.<br/>Discovered in a vast ocean, this island's rich landscape was dotted with countless mysterious ruins and inhabited by strange animals known as Monsters.<br/>Humankind agreed to organize a Research Commission in order to investigate the island and the monsters that live there.<br/>...Then one day, the island guardian Volzerk clashed with the legendary beast known as Magna, and both were apparently destroyed.<br/><br/>Ten years have passed since that day.<br/>Without the protection of Volzerk, the monsters of the island are in danger of extinction.<br/>However, a young girl is about to join the Research Commission.<br/>Her name is Fina, and she is the only human alive who witnessed Volzerk's disappearance.<br/>With her obsessive love of monsters, Fina's sole goal in life is to get as close to them as she can.<br/>And deep within her heart burns the desire to once again be reunited with Volzerk.<br/><br/>◆Genuine Action<br/>Volzerk：Monsters and Lands Unknown is an original action RPG that brings characters and monsters together for epic battles!<br/>Mix and match monsters with different riders to master different skills!<br/>Make use of the different weapon types and switch out characters at the right time to bring down powerful foes!<br/><br/>◆Raise Monsters<br/>Immerse yourself in a deep monster breeding system!<br/>Different characters can impart different abilities to monsters, allowing players to raise the monsters of their choosing!<br/>Crossbreed two monsters to give birth to a whole new monster, which will inherit its parents' abilities!<br/>Raise monsters to fit your own personal play style and take down the powerful enemies that stand in your way!<br/>You can even Crossbreed your monsters with those of your friends!<br/><br/>◆Music<br/>Yoko Kanno<br/><br/>◆An Amazingly Talented Team of Voice Actors (Alphabetical Order)<br/>Kohei Amasaki,Fairouz Ai,Toshinari Fukamachi,Yurina Furukawa,Megumi Han,Daiki Hamano,Mari Hino, Shun Horie,Ayasa Ito,Manaka Iwami,Hirohiko Kakegawa,Ai Kakuma,Asuka Kakumoto,Shinichiro Kamio,Jun Kasama,Rika Kinugawa,Akari Kito,Hiyori Kono,Ayumu Kotomiya,Tomori Kusunoki,Yasuhiro Mamiya,Satsumi Matsuda,Mii Miki,Inori Minase,Rika Nagae,Jin Ogasawara,Yuki Ono,Ryota Osaka,Satomi Sato,Sayaka Senbongi,Miyuri Shimabukuro,Yuki Tai,Shunsuke Takeuchi,Aimi Tanaka,Koki Uchiyama,Reina Ueda,Shinei Ueki,Sumire Uesaka,Taiki Yamashita,etc<br/><br/>◆Game Price<br/>This app is free to play.<br/>Note: This app offers in-app purchases.<br/>Please be sure to read the Terms of Service before playing.<br/><br/>＜OS＞<br/>iOS 13 3GB or greater", "metacritic": null, "released": "2023-02-22", "tba": false, "updated": "2023-03-17T08:38:42", "background_image": "https://media.rawg.io/media/screenshots/c3a/c3aa7e6f36606451d3475c8048ab3a4a_BbfrsLl.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 357, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["COLOPL"], "genres": ["Action", "RPG"], "publishers": ["COLOPL"], "esrb_rating": "Teen"}