{"id": 941808, "slug": "vic-mine-vic-20-by-kevin-prosser", "name": "VIC MINE (VIC 20) by Kevin Prosser", "name_original": "VIC MINE (VIC 20) by Kevin Prosser", "description": "<p>VIC MINE</p>\n<p>VIC MINE is the VIC-20 Version of the C64 Minefield game. The grid size is slightly smaller due to reduced memory on the unexpanded VIC. This will run nicely on the VICE Emulator running in VIC unexpanded mode. Cursor keys move the flashing cursor and space bar will examine a spot for mines. If a mine is present, you lose, otherwise a number will replace the circle to indicate the number of adjacent spots with a mine. F key will flag a spot as a potential mine without examining it.  </p>\n<p>1 PRINT\"SQSTBY...\":DIMM(14,14):DIMN(14,14):C=144:G=7771:FORX=1TO14:FORZY=1TO14</p>\n<p>K is the size of the minefield. M array holds mine info, N array holds the number of adjacent mines to each spot. C is the number of non-mine locations. G is upper left of grid on the screen</p>\n<p>2 W=(X&lt;&gt;1)*(X&lt;&gt;14)*(Y&lt;&gt;1)*(Y&lt;&gt;14)*INT(RND(0)*1.1):N(X,Y)=0:C=C-W:M(X,Y)=W:NEXT</p>\n<p>W randomly places a mine inside the playable area. And decrements C, N array is reset to all zeros. To increase the difficulty, change the 1.1 in the random function to a slightly higher value.</p>\n<p>3 NEXT:FORX=2TO13:FORY=2TO13:H=0:FORI=-1TO1:FORJ=-1TO1:H=H+M(X+I,Y+J):NEXT: NEXT:A=38491</p>\n<p>Count up the number of mines adjacent to each spot</p>\n<p>4 POKEA+X+22*Y,0:N(X,Y)=H:POKEG+X+22*Y,81:NEXT:NEXT:PRINT\"S\";C;\"SQCRSR=MOVE, SPACE=OPEN\"</p>\n<p>place the grid on the screen, print the remaining open spaces, print instruction</p>\n<p>5 S=22*Y+X+G: Z$=\"OQ|] FX+\":X=2:Y=2</p>\n<p>S is location on screen given x y coordinates. Z$ is a string of allowable inputs</p>\n<p>6 I=0:GETA$:FORT=1TO8:I=I-T*(A$=MID$(Z$,T,1)):NEXT:F=PEEK(S):F=(F=209)OR(F=171)</p>\n<p>Get the index number for the user input. f is flag for counting remaining open spaces. 209 is the symbol for unexamined spot, 171 is symbol for flag “+” (also unexamined), any other symbol is for a previously examined spot. </p>\n<p>7 POKES,127ANDPEEK(S):J=M(X,Y):X=X-(I=3)*(X&gt;2)+(I=4)*(X&lt;13):IF(I&gt;5)THENPOKES,43</p>\n<p>127and will Un-Reverse video of the symbol at the old cursor location, j is set to 1 if a mine is preset at current cursor location. update X value of cursor. Poke 43 puts a flag on the current space but does not examine it.</p>\n<p>8 Y=Y-(I=1)*(Y&gt;2)+(I=2)*(Y&lt;13):S=X+22*Y+G:POKES,128ORPEEK(S):IFC&lt;1THENPRINT\"WIN!!\"</p>\n<p>Move the Y value of the cursor and reverse video character at that location</p>\n<p>9 H=N(X,Y):IF(I=5)AND(J=0)THENPOKES,48+H:C=C+F:PRINT\"S\";C;:GOTO6</p>\n<p>If space bar (open) and there is no mine (j=0) then display on the screen the number of adjacent mines. Update count of open spaces remaining</p>\n<p>10 PRINT\"| \";:IF(I&lt;&gt;5)OR(M(X,Y)=0)THENGOTO6</p>\n<p>If a mine is at present cursor and player opens it, end program otherwise goto6 for new input</p>", "metacritic": null, "released": "2023-03-16", "tba": false, "updated": "2023-03-17T11:04:27", "background_image": "https://media.rawg.io/media/screenshots/e8b/e8b36a278f639aebd1e05e5cf06aeaa5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BASIC 10Liner"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}