{"id": 941994, "slug": "magic-city-itch", "name": "Magic City (itch)", "name_original": "Magic City (itch)", "description": "<p>English:<br/></p>\n<p>Be aware! This game is only in Spanish! It was a requirement from college, but if you don't mind, you can explore a little town without needing to understand anything!<br/></p>\n<p>This is a little prototype for college to test my abilities making pixel assets and basic code! This is just a little exploration build, in which you can talk and interact with basically anything! Every character will thank you, because this was a build for testers, there is a bit of history there and there, but the charas will mostly talk about themselves, It's just a peaceful town full of interesting characters, so don't worry about anything! <br/></p>\n<p>CONTROLS:</p>\n<p>Move with the arrow keys, interact with the space bar (Almost every object have something to say, so use it a lot!), and use the mouse to pass the dialogues and choose dialogue options, when you are done exploring, just close the window! <br/></p>\n<p>BE AWARE OF A BUG!</p>\n<p>At the start of the game, a blank dialogue will appear, just pass the dialogue and it will disappear.</p>\n<p>Thank you for trying this little game!<br/></p>\n<p>------------</p>\n<p>Spanish:</p>\n<p>Un pequeño prototipo que hice para la universidad y para probar mis habilidades haciendo píxel art y código básico! Esta es solo una pequeña versión de prueba, en la que puedes hablar e interactuar con todo.</p>\n<p>Todos los personajes te agradecerán, ya que ésta es una compilación para beta testers, hay un poco de historia aquí y allá, pero principalmente te hablarán de sus vidas, es solo una ciudad pacífica llena de personajes interesantes, así que no te preocupes por nada!</p>\n<p>CONTROLES:</p>\n<p>Muévete con las flechas del teclado, interactúa con la barra espaciadora (Casi todos los objetos tienen algo que decir! Asi que explora!), y usa el ratón para pasar los diálogos y elegir las opciones que se te den. Cuando ya hayas acabado de explorar a tu gusto, solo cierra la ventana!</p>\n<p>CUIDADO CON UN BUG!</p>\n<p>Al principio del juego, aparecerá un diálogo en blanco, solo dale a pasar el diálogo con el ratón y desaparecerá.</p>\n<p>Gracias por probar este pequeño juego! <br/></p>", "metacritic": null, "released": "2023-03-16", "tba": false, "updated": "2023-03-17T12:34:31", "background_image": "https://media.rawg.io/media/screenshots/f0c/f0cb134ea7cdb2291db663b0d60561f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Xana"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}