{"id": 941995, "slug": "gonzalo-the-chicken", "name": "Gonzalo the Chicken", "name_original": "Gonzalo the Chicken", "description": "<p><strong>Thanks for helping us test our game! </strong><br/><br/>Gonzalo the Chicken is a linear action adventure platformer that will have 14 chapters. The story is still growing, but you are playing as a humanoid chicken named Gonzalo and you are fighting an evil military called the \"Crocogators\".<br/><br/><strong>Please leave us some constructive feedback at</strong> https://forms.gle/m7coejKt9mC1eT9E9<br/></p>\n<p><strong>- THINGS TO KNOW -</strong></p>\n<p><strong>Scope: </strong></p>\n<p>3 completed levels out of 32 total</p>\n<p><strong>Gameplay: </strong></p>\n<p>Expect gameplay systems to be finalized, and any issues/suggestions regarding gameplay should please be noted in the survey</p>\n<p><strong>Visual:</strong></p>\n<p>Only about 10% of graphics are finished: things like crabs, Crocogators, the King Crab, Trees, Water, and Allidile. Things with a temporary-looking grid texture are either temporary (like most of the level blocking) or need revision (like Gonzalo). Cutscenes need some \"polish\" with better animations and camera angles. Most particle effects (explosions, lightning, etc) are temporary.</p>\n<p><strong>Audio:</strong></p>\n<p>Any sounds you hear are finalized, but there are a lot of \"holes\" where we have no audio yet. We only have a few music tracks as a sample stretched across the whole demo, so the music may not always fit the environment. The system we're using to implement these music tracks is a prototype and our new system will transition between \"layers\" of tracks seamlessly without restarting the music.</p>\n<p><strong>Performance: </strong></p>\n<p>The game is confirmed to run smoothly on Windows with a modern graphics card. Mac performance might be a little more spotty, please do let us know how it runs if you're on a Mac, including what type of Mac you're on!</p>\n<p><strong>Other Known Issues and Works in Progress:</strong></p>\n<ul><li>WIP: In-game fonts are being swapped out for better fonts\r\n</li><li>WIP: Lighting is being reworked entirely for raytracing\r\n</li><li>WIP: Controller buttons aren't currently remappable in the options menu\r\n</li><li>WIP: The level select menu will be replaced with a map\r\n</li><li>WIP: A graphics settings menu to adjust visual fidelity and performance\r\n</li><li>Bug: The coconut doesn't always \"follow\" the tank after being fired\r\n</li><li>Bug: The camera doesn't always face the right way after respawning at a checkpoint\r\n</li><li>Bug: When fluttering after bouncing on a spring, momentum stops entirely\r\n</li><li>Bug: The first checkpoint in level 1 can be re-triggered after triggering the 2nd checkpoint\r\n</li><li>WIP: A \"Stars\" system to promote replaying levels: finish in a certain amount of time, get all the eggs, etc\r\n</li><li>WIP: Different enemy death \"impulse\" when defeated by different attacks\r\n</li><li>Bug: objects in trees don't sway with the trees\r\n</li><li>Bug: the tooltip to \"pick up\" a dropped object doesn't appear until leaving the object and coming back\r\n</li><li>WIP: different colors of water, better lava\r\n</li><li>WIP: Improved camera placement and handling\r\n</li><li>Bug: the key is partially transparent\r\n</li><li>WIP: \"smooth\" turning for the enemy instead of snapping to the player\r\n</li><li>WIP: retreating enemies if they have a ranged weapon and you get too close\r\n</li></ul>", "metacritic": null, "released": "2023-03-16", "tba": false, "updated": "2023-03-17T12:35:23", "background_image": "https://media.rawg.io/media/screenshots/24f/24fad4a09d358a5ec4d64bc7f137c89d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WhaleplaneStudios"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}