{"id": 94204, "slug": "abandoned", "name": "Abandoned (itch)", "name_original": "Abandoned (itch)", "description": "<p>You are stuck in a small space ship, separated from your crew and all outside communication. Your only hope for escape is to survive long enough to create a distress beacon and attract a rescue party, but the required parts are scattered around the \"abandoned\" alien ship your crew mates so mysteriously disappeared into. Fortunately, you have remote control of a robot that can explore the alien depths while you struggle to survive.</p><p>Made in 72 hours for the Ludum Dare 37 Jam. </p><p><em>Downloads at bottom of page.</em></p><p><strong>CONTROLS</strong></p><ul><li>Use Left Mouse to interact with objects.</li><li>Hold Right Mouse to speed up time.</li><li>Press Escape to end the game.</li></ul><p><strong>INSTRUCTIONS</strong></p><ul><li>Your goal is to build and activate a rescue beacon.</li><li>The parts for the beacon are scattered about the alien ship.</li><li>Command your robot to explore the alien ship to find and retrieve the parts.</li><li>Throughout this you must keep a close watch on your own health, hunger, radiation etc., as well as the various systems on your small ship. You may need to turn off certain systems to conserve power, among other considerations.</li></ul><p><strong>KNOWN ISSUES</strong></p><ul><li>The game balance is somewhat wonky, and the game can be pretty difficult to beat if you don't know what exactly how all the systems work. Unfortunately I ran out of time to balance the game properly. It is possible to beat however. Make sure you keep a constant eye on your player stats, and also on the oxygen level. Good luck!</li><li>Game audio is sparse.</li></ul><p><strong>TOOLS</strong> </p><ul><li>Unity</li><li>MonoDevelop</li><li>Gimp</li><li>Blender</li><li>Paint</li><li>Bfxr</li></ul><p><strong>CHANGELOG</strong></p><ul><li>v1.0.0\r\n<ul><li>Game submitted.</li></ul><ul><li>macOS build available.</li></ul></li><li>v1.0.1\r\n<ul><li>Minor text fixes in starting log.</li></ul><ul><li>Slight performance enhancements. Windows and Linux builds available.</li></ul></li><li>v1.0.2\r\n<ul><li>Fixed a game breaking bug where the oxygenator couldn't produce enough oxygen to offset the player's breathing, leading to inevitable death at a definite point in time. </li><li>Fixed the collision area for the water producer.</li></ul></li><li>v1.0.3<ul><li>Fixed the reactor providing way too much power.</li><li>Fixed the flickering low supply levels message.</li></ul></li><li>v1.0.4\r\n<ul><li>Fixed not being able to repair the water producer.</li><li>Fixed the robot control taking power.</li></ul></li></ul>", "metacritic": null, "released": "2016-12-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2bb/2bbdd7ccc029ff64c43eeca2a79d827f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Epicruins195"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}