{"id": 94213, "slug": "the-roze-case", "name": "The Roze Case", "name_original": "The Roze Case", "description": "<p>This is a non horror murder mystery game, where players have control over how they want to investigate and solve the Case. There are suspects to question, clues to gather, puzzles to solve, and a murderer to catch!</p>\n<p>Content Warning: Brief depiction of intense violence,  some material may be inappropriate for children under 13<br/></p>\n<strong>   DETAILS</strong>\n<p>- Game Title: The Roze Case, Part 1<br/>- Author: Michelle Bond<br/>- Engine used: RPG Maker MV 1.5.1<br/>- Platform: Windows<br/>- Language: English<br/>- Length: 2-3 hours<br/>- Controls: WASD keys for movement &amp; Mouse clicks for interacting</p>\r\n   STORY\r\n<p>Vyne has worked hard to become a Detective for the Protectorate, but she never imagined her first Case would be anything like this. With the help of her new partner, Paalm, they must put their skills to the test by searching for clues, uncovering the truth, and solve the murder of a young woman at her birthday party. For hundreds of years the Protectorate has been the Guardian of Justice and kept the Prime Timeline from fracturing into Chaos. Now it’s up to the two rookies to piece together the truth and solve The Roze Case before it grows too late.</p>\r\n   CHARACTERS\r\n<p>Vyne: Eager to prove herself, Vyne has wanted to join the Protectorate her whole life. She has studied hard and hopes to pass the Final Exam this year to become a Junior Detective.</p>\n\n<p>Paalm: Born to privilege, Paalm is sick of the Noble pampered life. His quick wit and determination have led him on the path to join the Protectorate this year.<br/></p>\r\n   FEATURES\r\n<ul><li>Complex murder mystery with unique time bending elements</li><li>Interactive notebook that keeps records of information gathered</li><li>Over 30+ characters, with custom art and sprites</li><li>Hand-painted backgrounds</li><li>Puzzle areas and interactive environments to search</li><li>In-game help feature</li></ul>", "metacritic": null, "released": "2018-07-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7d5/7d51f14fe07d16878352cdb3f3bf481e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 243, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Michelle Bond"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}