{"id": 94214, "slug": "carmilla", "name": "Carmilla", "name_original": "Carmilla", "description": "<p><em>Carmilla</em> takes a close look at the Age of Enlightenment and encourages us to ask whether—alongside all the progress and benefits modern science has brought about— we might have lost something valuable in the process.</p>\n<p>length: approximately 5 hours</p><p><strong>Prologue</strong></p><p>Dr. Martin Heselius, a German physician, dedicates himself exclusively to those cases that promise to further his inquiry into the relation between the physical—, the spiritual—, and the divine sphere of existence. <br/>Ada Brunswick edits and translates the doctor's manuscripts.<br/>Under the name <em>Visual Gothic</em> they publish those cases that might benefit a wider public while illuminating the interplay between the rational, the supernatural, and the superstitious.<br/></p>\n<p><strong>The Story</strong></p>\n<p>Laura, narrator and heroine of the story, lives an idyllic life with her father in an old castle in Styria. Geographically isolated she is often lonely. A carriage accident delivers a mysterious young girl, named Carmilla, to the castle's doorsteps, hence putting a sudden end to Laura's solitude.</p>\n<p>The two girls grow close quickly, yet Laura occasionally feels overwhelmed and confused by Carmilla's passionate advances which ignite in her fascination and abhorrence in equal parts. However, these tense situations do little to tarnish the camaraderie that permeates their everyday life.</p>\n<p>Too soon this life is increasingly overshadowed as Laura starts to experience disquieting nightly visions and strange physical symptoms ...</p>\n<p><strong>What is it About?</strong></p>\n<p><em>Carmilla</em> has often been called a 'Lesbian Vampire Story', which is pointing out the obvious and missing its point at the same time. On its surface it is also a romance, a tale of bonding between two lonely girls in an isolated environment with a dash of mystery for good merit.</p>\n<p>Not far beneath this entertaining level of the story, readers who prefer their text to play the role of teacher or moralist will readily discover a lesson here: Do not allow dogmatic rationalism to replace superstition and blind you to the truth!</p>\n<p>However, at its center <em>Carmilla</em> is an exploration of the human condition after the Enlightenment cemented the distinction between mind and matter, the so called <em>mind-body-dualism</em>, with its clear preference for mind over matter. Today, this duality is hardly ever questioned. </p>\n<p>The editors have appended a collection of notes that might serve to illustrate the birth of this new paradigm and assist in carving a path to the real heart of the story.</p>", "metacritic": null, "released": "2018-07-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/efb/efb1bc3812dba432ad094584b3239a4e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["visualgothic"], "genres": [], "publishers": [], "esrb_rating": null}