{"id": 942331, "slug": "just-beyond-the-rainbow-bridge", "name": "Just Beyond the Rainbow Bridge", "name_original": "Just Beyond the Rainbow Bridge", "description": "<p>An in-progress game to inspect the aspect of grief as well as a unique interpretation of the subject of the rainbow bridge. Colors play a strong role and will be worked on to improve the narrative through it. Read the context below, thank you!</p>\n<p>Context: I was struggling to find a topic for this class until I saw a friend of mine on social media post that their pet had passed away and mentioned \"the rainbow bridge\". Even though I owned a pet myself I had never heard of such a phrase before so I did some digging. Turns out it refers to an other-world location where these pets reside after death, and the rainbow bridge leads them to heaven. I didn't want the game to be a direct tie to this topic and wanted to twist it a bit leading me to make a game where the pet does indeed reach the afterlife, but the owner also experiences his own version of the \"rainbow bridge\". Not because he died as well but rather because his moments and life with his dog did. And so the game takes a small journey across several parts of the owner's memories and shows emotions such as grief and self-blame but also reflection and forgiveness.</p>\n<p>My question: To those who have experienced a loss of a pet, what were the following days like for you? What were you thinking? What were you feeling about the whole thing? Did you feel as though you did everything you could for them? Did you feel regret for anything that you couldn't have done? A couple of short sentences could help in making this game more relatable.</p>\n<p>The game is unfortunately not finished as I had to cut out a bit of content after the character makes it outside so keep that in mind when playing through it.</p>", "metacritic": null, "released": "2023-03-15", "tba": false, "updated": "2023-03-17T15:19:59", "background_image": "https://media.rawg.io/media/screenshots/6b1/6b1d20dfb3455a73c35398d3fa2b9d38.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["RamenHoodlum"], "genres": [], "publishers": [], "esrb_rating": null}