{"id": 942390, "slug": "fateless-mechanism-wip", "name": "Fateless Mechanism (WIP)", "name_original": "Fateless Mechanism (WIP)", "description": "<p>Find clockwork components, place them in powerful configurations, use your mechanical armor to oppose magical oppression: Fateless Mechanism is a top-down action game where strength is found in your courage to fight in a new way.</p>\n<p>(Still in progress; I'd really appreciate if you checked back in in a week or so after the end of the Magical Girl Game Jam (around 3/21), I'll be posting updates on my Twitter and the jam Discord!)</p>\n<p>----------------------------------</p>\n<p>Hope: even as the four cardinal immortals slowly encroach on humanity's territory, the deeply spellbound culture of Adeitera's discovered a new universally accessible way to grow through mechanical innovation. Peck, pseudonymously known as the Clockwork Dragon, powers the movement with her unshakeable inquisitiveness and revolutionary system of kinetic drives; despite her royal blood, she's the one person in the world unable to use magic.</p>\n<p>As more subversive magical interests make their move, Peck's forced to take a stand for her craft with the help of her newest acquisition: a strange, shifting device forged from pure stardust seemingly based on her designs.</p>\n<p>----------------------------------</p>\n<p>Though I had to compress and adjust for this prototype here, Fateless Mechanism's always been my core original passion project. I only found out about the jam peripherally after taking part in my first one ever (and my first real time using Godot), but when I saw the themes, I realized this was the perfect time to really get my hands dirty with game development: every single prompt, in practically their full form, already corresponded perfectly with the ideas and characters I'd been fomenting for years. This was my chance to put them into tangible form. As unpolished as it is for now, I hope you like it, and I really appreciate your interest!</p>", "metacritic": null, "released": "2023-03-14", "tba": false, "updated": "2023-03-17T15:48:18", "background_image": "https://media.rawg.io/media/screenshots/a65/a65357f92ecd5b981ebc179e87f345c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["nanoswatch"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}