{"id": 94257, "slug": "quest-for-infamy-itch", "name": "Quest for Infamy (itch)", "name_original": "Quest for Infamy (itch)", "description": "<p>Quest For Infamy is a classic point and click adventure game, in which you assume the identity of 'Mister Roehm' a man trying to start over after running away from a shady past. Welcome to the little town of Volksville only to discover there is so much more going on in the valley than meets the eye! Come along and take a walk on the wild side with Roehm and discover just how infamous you might be.</p>\n<p>Featuring three different character classes, why not take on the sly and cunning path of the Rogue, or behold the wonder and limitless power of the Sorcerer.<br/> Or maybe you'd prefer the brute strength and brawn of the Brigand. Each class takes you on a different course throughout your quest making it ever so unique.</p>\n<p><em><strong>Features:</strong></em><br/></p>\n<ul><li>Classic fantasy RPG packed with adventure, puzzles, combat, and spellcasting</li><li> Play as one of three anti-heroes with unique quests: Brigand, Rogue, or Sorcerer</li><li> Lie, cheat, and steal your way through tales of charming villainy with multiple endings</li><li> Use swords, spells, or wits to blaze a path to victory: Styles vary with every play</li><li> Hand-drawn world seamlessly blends role-playing and adventure</li><li> Over 50 NPCs and 200 rooms to explore and interact with</li><li> Customize your own spells, skills, and adventures</li></ul>", "metacritic": null, "released": "2015-11-06", "tba": false, "updated": "2019-08-28T23:25:50", "background_image": "https://media.rawg.io/media/screenshots/8bb/8bb275400b64b9ea0bffee282830fe19.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 266, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Infamous Quests"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}