{"id": 942672, "slug": "cosmos-knights-rpg-spaceship-travel-game-demo", "name": "Cosmos Knights RPG SpaceShip Travel Game Demo", "name_original": "Cosmos Knights RPG SpaceShip Travel Game Demo", "description": "<p>Hello everyone, my name is Ryuujinn.</p>\n<p>For a long time I have been studying how to create games and learning a bit about programming. But it still wasn't enough. So I went after rpg maker vx, started with it, until the low FPS made me give up and continue to a new platform, I started to study media with unity.</p>\n<p>STILL VERY DIFFICULT. Then came a promotion of RPG MAKER MZ, I am very poor guys. So I managed to buy it, and started to develop this game</p>\n\n\n<p>And so it went on, I tried to improve even more.</p>\n<p>I am a writer, and this universe I created is based on Zodiacs.</p>\n<p>An expanded universe with thousands of possibilities.</p>\n\n\n\n<p>And basically like this, I created a universe. Where it would be possible to travel through many worlds, meet their inhabitants, get to know their stories, and increase the whole game's progress.</p>\n\n\n\n\n<p>This universe would be based on my written book.</p>\n<p>Which I have been writing for three years. The financial difficulties are great, but soon I will be working and will be able to invest more in the game. Any donation for the development I would be eternally grateful.</p>\n\n<p>My future project ideas.</p>\n<p>1 - Recruit Players on the planets, save them to help the ship and enable new features.</p>\n<p>2 - Possibility to maintain the ship, use fuel to travel to other galaxies and systems. If you run out, you are forced to mine on planets. </p>\n<p>3 - Having several bio-suites, where you will be able to have powers. </p>\n<p>4 - Weapons and equipment as equipment. </p>\n<p>5 - A passive skill system to increase possibilities.</p>\n<p>6 - A race system to identify new races on each planet, discover their habitat, their nature.</p>\n<p>7- Have different forms, change the mini small vessel and modify it to other types.</p>\n<p>8 - A lvl status, where it increases as it increases the skills.</p><p>9 - A cosmic timeline, where time will pass and the characters will change as time goes by, your room could be modified, increase the structures of the ship as time passes, improving it.<br/></p>\n<p> Much of this was not implemented, the Demo is very simple. But everything is already in my mind and in planning.</p>\n\n\n<p>Try the available demo. Thanks to everyone.</p>\n\n\n<p>Ismin, Our Queen of Jupiter sends her regards.<br/></p>\n\n\n<p>Cosmos Knights NFT OpenSea check my nfts, based in my game and book.<br/></p>\n<p>For more features and information join Discord Channel, can add me friend too.  &gt;&gt; Discord Channel </p>", "metacritic": null, "released": "2023-03-14", "tba": false, "updated": "2023-03-17T18:20:19", "background_image": "https://media.rawg.io/media/screenshots/f2a/f2a84676bec7a0aeae315a57d90a654c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ryuujinn7"], "genres": ["Adventure", "RPG", "Platformer"], "publishers": [], "esrb_rating": null}