{"id": 942704, "slug": "rabbit-vs-mole", "name": "Rabbit vs Mole", "name_original": "Rabbit vs Mole", "description": "<p>Rabbit vs Mole is an anti cooperation split-screen game. \r\nTake on the role of your favorite animal and try to complete the current objective.</p>\r\nAs a rabbit\r\n<ul>\n<li>Get some supplies</li>\n<li>Plant carrot seeds in your garden and water it.</li>\n<li>Wait to grow and collect your beloved carrots.</li>\n</ul>\n<p>But there is also a mole whose job is to spike your guns!</p>\r\nAs a mole\r\n<ul>\n<li>Dig tunnels under the rabbits garden</li>\n<li>Get rid of the soil by digging mounds.</li>\n<li>Come to the surface to mess with Rabbit.</li>\n</ul>\n<p>But believe! The rabbit has a shovel that is not only for digging!</p>\r\n\r\nGame modes\r\n<ul>\n<li><strong>Rivalry</strong> - A standard skirmish, the Rabbit must collect a certain amount of carrots and the Mole must not allow it within a certain time limit.</li>\n<li><strong>Carrot race</strong> - The player who collects a certain amount of carrots wins, there is no time limit.</li>\n<li><strong>Time attack</strong> - The winner is the one who collects more carrots within the time limit.</li>\n<li><strong>Cooperation</strong> - This time you have to cooperate. Collect the carrots together before time runs out.</li>\n<li><strong>Sandbox</strong> - There is no goal, a good opportunity to practice.</li>\n<li><strong>Duel</strong> - Same as Rivalry but you set the goal yourself.</li>\n<li><strong>Common goal</strong> - Same as Cooperation but you set the goal yourself.</li></ul>\n<p>There is a tutorial in the game that will guide new players through the game-play.</p>\r\nControls\r\n<ul><li>WSAD - Move with WSAD and do actions with left CTRL and SHIFT</li><li>ARROWS - Move with arrows and do actions with right CTRL and SHIFT</li><li>Gamepad - Move with left analog and do actions with right buttons A and B or circle and cross, depends on the type of controller.</li></ul>\r\n\r\nThis game requires itch.io game launcher to run.", "metacritic": null, "released": "2023-02-20", "tba": false, "updated": "2023-03-17T18:38:58", "background_image": "https://media.rawg.io/media/screenshots/bce/bce9bd5911e25bf70b87a19baa12dd0b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["atrox_games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}