{"id": 942793, "slug": "unbearable-demo", "name": "Unbearable (Demo)", "name_original": "Unbearable (Demo)", "description": "<p>Claudia, a woman who has lost her job as a reporter, decides to go to investigate the psychiatric hospital \"Milagros\" which keeps a story as secret as it is macabre. During this journey she meets people who have the same intentions and others who will get in the way.\r\n</p>\n<p>With the help of her new companions, she must face the secrets of the psychiatric hospital, but the biggest fight is against her own mind.\r\n</p>\n<p>This is only a demo of the game, so it is located somewhere late in the story, this is one level of  5 that are currently in the game. (More on the way).\r\n</p>\n<p>FULL GAME: https://farelas.itch.io/unbearable</p>\n<p>Controls:</p>\r\nInput\r\nKeyboard/Mouse\r\nJoystick\r\nAim\r\n\r\n\r\nShoot/Attack\r\n\r\nRun\r\nSHIFT\r\n\r\nInteract\r\nE\r\n\r\nCrouch\r\nC\r\n\r\nCrawlC  (HOLD) (HOLD)DodgeSPACEBlock (Armed)QInventory\r\nI\r\n\r\nPause\r\nESCAPE\r\n\r\nPartner FollowFPartner Attack/Int.GPartner HideHToggle lightTAB (HOLD) (HOLD)\r\n\n<p>Narrative Story: Delve into a dark and gritty story with mechanics inspired by survival horror games from the ps2 era.</p>\n<p>Cooperative Campaign: Play the story alone or with a friend in split screen.</p>\n<p>Transversality: Climb through the scenarios to reach objectives and solve puzzles.</p>\n<p>Hide or Fight: Go unnoticed without alerting enemies or use the different melee and fire weapons to finish them off.</p>\n\n<p>Inventory System: Collect items, manage your resources and combine them to solve puzzles.</p>\n<br/>\n\r\nDISCORD PAGE\r\n<p>The game is being developed by only one person and is in early access. But with the support of the community, we hope to make \"Unbearable\" a better game in the future. If you like these types of games, the only way to create more and better cooperative horror games is by supporting them and so more others developers will be encouraged to do so.</p><p>*HECHO EN MÉXICO*</p>", "metacritic": null, "released": "2023-03-13", "tba": false, "updated": "2023-03-17T19:23:11", "background_image": "https://media.rawg.io/media/screenshots/c65/c65220504bda2eb9379d050337915e7a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 326, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Farelas"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}