{"id": 942863, "slug": "tiny-smuggler", "name": "Tiny Smuggler", "name_original": "Tiny Smuggler", "description": "<p><strong>Tiny Smuggler v1.2</strong></p>\n<p>Collect supplies and avoid being stomped by a giantess!</p>\n<p><strong>Change log:</strong></p>\n<p>Added a total number of treasures obtained that won't refresh when you click R and a number of different stages with different dialogues based on it.</p>\n<p>Added a normal way to move the player.</p>\n<p>You can use the space key or the checkbox on the screen to change between the old (alternative) and the new moving method.</p>\n<p>Changed the player speed faster and added 1 sec of invincibility when dashing in alternative moving.</p>\n<p><strong>Control:</strong></p>\n<p>Arrow keys for moving.</p>\n<p>Q key for changing foot models.</p>\n<p>R key for reviving.</p>\n<p>Shift + Arrow key for dashing in alternative moving (It can be hard to trigger and has a cooldown of 6 seconds. When in cooldown, you will become half transparent).</p>\n<p>\n</p>\n<p><strong>Link:</strong><br/></p>\n<p>https://twitter.com/MDZZ_Main</p>\n<p>https://linktr.ee/MDZZ_</p>\n<p><strong>Background story:</strong></p>\n<p>As the gate guard of this human town, you've grown accustomed to a peaceful life. You spend your days greeting visitors, checking their identification, and making sure no troublemakers enter the town. Life has been good, and you're content with your role as the town's protector.</p>\n<p>However, everything changed when a gigantic elf girl appeared on the outskirts of town. She towers over everything around her, and her playful demeanour is both charming and terrifying. She seems to be having fun, but her actions are causing chaos in the town.</p>\n<p>The elf girl only attacks those who try to escape outside the town, so many of the town's residents are trapped inside. You know that you must collect supplies from the allies outside the gate, but the thought of facing the elf girl makes your heart race with fear.</p>\n<p>Despite your fears, you know that you have a duty to the town and its people. You must gather as many supplies as you can and return safely to the gate, all while avoiding the giant elf girl's playful attacks.</p>\n<p>Your skills as a gate guard have prepared you for this moment, but the stakes have never been higher. The fate of the town rests on your shoulders, and you must do everything in your power to succeed. Will you be able to collect enough supplies and avoid the giant elf girl's wrath, or will you fall victim to her playful rampage? The choice is yours.</p>\n<p>Tip me on itch.io if you enjoyed this game~</p>", "metacritic": null, "released": "2023-03-13", "tba": false, "updated": "2023-03-17T19:57:16", "background_image": "https://media.rawg.io/media/screenshots/b12/b12084d1c65801fc887dbdffcfb61043.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MDZZ"], "genres": [], "publishers": [], "esrb_rating": null}