{"id": 942811, "slug": "spinilization", "name": "Spinilization", "name_original": "Spinilization", "description": "<p><strong>SPIN THROUGH THE AGES!</strong></p><p>You are an angel, tasked by your Creator to guide a group of primitive humans through development into a thriving civilization! Doing so is kind of a gamble, so you'll need to spin the Wheels of the Cosmos and hope the fates align in your favor!</p><p>Earn resources based on how each spin resolves. Spend resources to unlock new technologies and add new Elements to the Wheels to hopefully attain better outcomes! Generate enough Faith to appease your Creator - or suffer Their Wrath!</p><p>This game was made for the 2023 Super∴Try Grab Bag Jam!</p><p>It was inspired by civilization games, and Luck be a Landlord.</p><p>Since this is a Game Jam game, it only goes until you finish Age I (by unlocking all of the Technologies). The plan, if we decide to expand on this game, would be to add more Ages that add new Technologies to the game and change the way you play up until you reach the Space Age - but getting ALL of those Elements and Technologies into the game and making them balanced, etc is a bit too much for just a few weeks of development.</p><p>We may come back and expand this into a full game in the future, if people seem to like it.</p><p><strong>HOW TO PLAY</strong><br/></p><p>Click on Spin to Spin the Wheels.</p><p>Earn Food, Production, and Science based on where the Elements end up in the grid after each Spin.</p><p>Wild Animals, Trees, and Boulders will occasionally be added each spin, randomly.</p><p>Some Wild Animals can Wound your Humans - any Element that gets Wounded while they have a Wound will Die.</p><p>After each spin, each Human on the Grid will eat some of the Food you have collected. If you cannot give a Human enough food, they will Die of starvation.<br/></p><p>Use Production to buy new Elements to add to your Inventory in the Shop between Spins.<br/></p><p>Use Science to buy Technologies in the Technologies Menu which will add new Elements to the Grid and/or change existing Elements and/or Mechanics.</p><p>Every Icon in the game you can hover over to see an informative Tooltip that will explain what that Icon is, and how it Works. The Tooltips are your friend!</p><p>After a few Spins in the early game, Your Creator will demand ask for Faith every few spins. From this point on, every spin, 10% of your collected Food will be offered up at the Shrine to become Faith. This is done after feeding your population. Make sure you are generating a surplus of Food to meet the Quota, or Your Creator will not be happy with you.</p><p>Icon Elements are from https://game-icons.net </p><p>Code &amp; design by Tim I Hely</p><p>Music by Elliot Hely</p><p>Made in St Louis with HaxeFlixel</p>", "metacritic": null, "released": "2023-03-13", "tba": false, "updated": "2023-03-17T19:31:43", "background_image": "https://media.rawg.io/media/screenshots/245/245c1f7911ddb5532fc623f56c3c2b55.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Axol Studio"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}