{"id": 942941, "slug": "industrial-era", "name": "Industrial Era", "name_original": "Industrial Era", "description": "<p>Industrial Era - simple city-building game for Lame Jame.</p>\n<p><strong>Controls</strong></p>\n<p>{</p>\n<p>    WASD = camera movement;</p>\n<p>    Escape = exit the game;</p>\n<p>    T = build a tunnel;</p>\n<p>    LMB = build the selected building or hire troops by clicking on the barracks / tank factory;</p>\n<p>    RMB = move the soldiers;</p>\n<p>}</p>\n<p><strong>Rules</strong></p>\n<p>{</p>\n<p>In our game, you need to monitor the level of oxygen, because if it drops below zero, then you will lose. Also, your main building (in the form of a house) can be destroyed by enemies. Build squads! Also, don't let the energy drop below zero. Otherwise, all buildings will stop working!</p>\n<p><strong><em>If your mines are not working, then make sure they have access to the surface! (Either through other mines or through tunnels)</em></strong><br/></p>\n<p>P.S. As such, there is no environmental control, you only have to monitor it, and all buildings worsen the air quality.</p>\n<p>Thank you for your attention and good luck!</p>\n<p>}</p><p>Tutorial</p><p>{</p><p>On the right in the corner is the building menu, where you select a building, press LMB and put it in the right place (the building will be green). Also, each building requires a certain amount of resources, which is written on the panel at the top right (in the corner). The building with the image of the soldiers is the barracks, you can build them and by clicking LMB on the barracks you create troops. Also works with tanks, but they require microchips. They are made in chip factories. To give an order to soldiers or tanks, press RMB and they will go in the direction you clicked.</p><p>Mines must be connected to the surface! They must have access to it in order to work stone and metal. That's what tunnels are for.<br/></p><p>}</p>\n<p><strong>Credits</strong></p>\n<p>{</p>\n<p><strong>    </strong><em><strong>AProxima</strong></em> = <em>game design and programming</em>;</p>\n<p><em><strong>    FazR51</strong></em> = <em>visual artist</em>;</p>\n<p>}</p>\n\n<p>we also wanted to add music, but did not have time, so a little later I will add a version with music(</p>", "metacritic": null, "released": "2023-03-13", "tba": false, "updated": "2023-03-17T20:36:45", "background_image": "https://media.rawg.io/media/screenshots/11d/11d3133531295868fbda0193db75e858.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["42Parsec"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}