{"id": 942911, "slug": "gravity-mage-evolvent", "name": "Gravity Mage (evolvent)", "name_original": "Gravity Mage (evolvent)", "description": "Gravity Mage\r\n<p>You are a mage with a powerful but unusual skill: you can manipulate gravity! However, you can't do much else. Can you use this power to battle through the dungeon and defeat your enemies?</p>\n<p>This game has less content that we wanted it to have, and it contains some bugs and glitches, but you can still go through it, win it and have quite some fun with it; hence, we would deem it to be \"complete\" (although we will probably make post-7DRL additions).</p><p><strong>Edit: </strong>I added a new post-7DRL version that has (hopefully) all the bugs fixed. There is no new content.<br/></p>\r\nPrinciple of the Game\r\n<p>This is a standard dungeon crawl: you need to fight through all the levels of the dungeon (currently two). At the end of each floor, there is a boss to fight; after you defeat it, you can proceed to the next floor.</p>\n<p>It is also a \"bullet-hell\" game: it is played in real time and the enemies will shoot various projectiles at you, but there's a catch: you're not very fast and your basic attack is weak and has a considerable cooldown.</p>\n<p>However, you have (Newtonian) gravity at your disposal. You can create sources of gravity that will act upon the missiles (that's the purple mist/blob/vortex in the screenshots). You can use it for various things, for instance:<br/></p>\n<ul><li>Deflect the missiles so that they don't hit you.</li><li>If you're skillful enough, the projectiles can turn back and hit your enemies.</li><li>You can also use it for shooting around a corner.</li></ul>\r\nControls\r\n<p>You can move around with WASD. You can also hit two of those keys at the same time to go diagonally.</p>\n<p>Left-click to shoot a basic missile (the red lightning). Use it wisely, though; you can use it only once each 3 seconds. </p>\n<p>Click and hold the right mouse button anywhere on your screen to make a gravity source.  As long as you hold the button, the source is \"charging\" and getting more powerful. You can also move your mouse while holding the button, and that will move the source as well. When you let go of the button, the source will stay at its current position and slowly lose power until it vanishes.</p>\n<p>You can have as many sources as you want, and the sources start working as soon as they appear, so they will be affecting the missiles as you drag them around. The sources can also be put anywhere, even inside walls etc.<br/></p>", "metacritic": null, "released": "2023-03-13", "tba": false, "updated": "2023-03-17T20:21:17", "background_image": "https://media.rawg.io/media/screenshots/70d/70df9e8236a9262834c0dd1afe59dbc1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["evolvent"], "genres": ["Action", "Puzzle"], "publishers": [], "esrb_rating": null}