{"id": 943112, "slug": "firefighter-in-hell", "name": "Firefighter in Hell", "name_original": "Firefighter in Hell", "description": "<p>The entrance to Hell opened up in Utah 7drl years ago. We finally know how to fight back!</p>\n<p>Hell has a cold climate, if you put out all the fires it will freeze over.</p>\n<p>We're sending in the best firefighter in the world to do the job.</p>\n<p>A Deckbuilding Roguelike with real-time card combat. You can go over 1 billion levels deep into hell!</p>\n\n<p><strong>Controls:</strong><br/></p>\n<p>   Most is mouse controlled, clicking and dragging.</p>\n<p>   Use hotkeys in battle.</p>\n<p>   <strong>How to Combo:<br/>    </strong>Drag one card onto a copy of itself or a combo card <strong>OR </strong>simultaneously hit the hotkeys of two cards.</p><p>   Mobile controls should work.</p>\n<p><strong>How To Play:</strong><br/></p>\n<p>Your objective is to extinguish the fires of Hell</p>\n<p>When you start a new game, you create a deck of 5 cards by choosing 1 of 3 cards x5</p>\n<p>You must traverse the Map deeper into Hell</p>\n<p>You will encounter fires and demons you must extinguish or be overcome by flames</p>\n<p>Your deck is not enough, it must be wielded skillfully.</p>\n<p>Make use of combos to extinguish fires and demons quickly</p>\n<p>Take opportunities to expand, sacrifice and upgrade your deck<br/><br/></p>\n<p><strong>Battle:</strong><br/></p>\n\n<p>You will encounter two types of enemies - fires and demons.</p>\n<p>  Fires will burn and spread across the board</p>\n<p>  Demons will DOOM you.</p>\n<p>You WIN the battle once all enemies are extinguished, their heat goes to zero.</p>\n<p>  You LOSE the battle if a demon DOOMs you, which occurs when a demon has 66+ heat</p>\n<p>  Boss Demons will DOOM you if they are over 200 heat.</p>\n<p>To Combo, drag one card onto the other OR press both hotkeys</p>\n<p>Combos are needed for better damage:</p>\n<p>  You can combo 2 of the SAME card</p>\n<p>  OR two combo cards together</p>\n<p>  When choosing a card, make sure to check for combos!</p>\n\n<p><strong>The Map:</strong></p>\n<p>After selecting the cards in your deck. You will view The Map!</p>\n<p>There are 5 different types of Locations on The Map</p>\n<p>Demon Battle - Fight rare, uncommon or common demons</p>\n<p>Boss Battle - Fight a notable demon</p>\n<p>Player - You are here</p>\n<p>Sacrifice - Removes a card from your deck</p>\n<p>Upgrade - Gives all cards of type +1 Douse</p>", "metacritic": null, "released": "2023-03-13", "tba": false, "updated": "2023-03-17T21:59:49", "background_image": "https://media.rawg.io/media/screenshots/e63/e637747ba57cca6f9c32f92f4b186b1f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["kigu"], "genres": [], "publishers": [], "esrb_rating": null}