{"id": 943300, "slug": "7d-mad-rogue-kart", "name": "7D Mad Rogue Kart", "name_original": "7D Mad Rogue Kart", "description": "<p><em>Submitted to the 7DRL Challenge 2023 </em></p>\n<p>7D Mad Rogue Kart is a rogue-like, turn-based kart racing game, build in one week during the 7DRL 2023. Your goal is to finish first, while racing against characters you might be familiar with. ;)<br/></p>\n<p>You can also throw some obstacles in their way - but be aware: You are not the only one with this ability...</p>\n<p>7D Mad Rogue Kart uses a custom engine, based on SFML. :)</p>\r\nScope for the 7DRL\r\n<p>This game started from a prototype that was already SFML.Net / C# based. it featured a grid, which was already walkable, and a character, that could be controlled. All tiles (excluding the fonts) have been handcrafted by myself.</p>\n<p>Note: The downloads WITHOUT any version info are the original downloads for the 7DRL jam. Each update afterwards will have a version number in it's name.</p>\r\nWhich version should I download?\r\n<p>If you are here to judge the game for the 7DRL, download the version without the version number in it. If you are just here for the fun, pick the one with a version number. :)</p>\r\nKey Mapping\r\nKey Alternative Action W Arrow UpMove Cursor Up<br/>AArrow LeftMove Cursor LeftSArrow DownMove Cursor DownDArrow RightMove Cursor RightB-Enter Placement Mode*N-Exit Placement Mode*ReturnSpacebarConfirm ActionNumpad +F2Zoom InNumpad -F3Zoom Out\r\n<p><em>* (only valid if an item is available)</em><br/></p>\r\nStart\r\n<p>After starting the game, you are thrown into the player selection mode, where you should pick your player:</p>\n\r\nPlayer selection upon race start\r\n<p>Move the cursor to change your selection. confirm your selection when ready, and you are golden!<br/></p>\r\nConfig\r\n<p>The root folder inclues a <em>config.ini</em>, where some settings can be changed:</p>\r\nSettingDefaultCommentResolutionWidth1280-ResolutionHeight720-EnableVSynctrueNote: For the final 7DRL, if your camera freaks out occasionally, try to set this to `false`. This bug surfaced after the submission deadline.Moddefault-Seed-1When set to `-1`, the total amount of seconds that have been passed since midnight are being used as the seed.MapSize128I would rather not recommend messing with that setting... But I won't stop you, either.", "metacritic": null, "released": "2023-03-04", "tba": false, "updated": "2023-03-17T23:22:35", "background_image": "https://media.rawg.io/media/screenshots/cd1/cd10c1ec5fe148983833edec9c2953c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Strange People Games"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}