{"id": 943393, "slug": "eats-roots-leaves", "name": "Eats Roots & Leaves", "name_original": "Eats Roots & Leaves", "description": "<p>Eats roots and leaves is a cosy game where you play as a wombat trying to help their forest friends. <br/><br/>Hand created watercolour artwork guides your wombat to help their echidna, crocodile and kookaburra friend. Hear what your friends need and use the hex tile environment setup to navigate creating a harmonious environment. <br/><br/>What out for the croc though…. They like picnics and inviting people for swims with them.</p><p>Made for Global Game Jam 2023.<br/></p><p><strong>A heads up on some tricky bits...</strong><br/></p>\n<p>Eats Roots and Leaves is a jam game, which means it's not fully polished. You could find yourself unsure of what to do next, or trapped in a dead end without knowing it.</p><p>You don't have to read these tips before you start playing, but come back here if you feel stuck.</p><ul><li>The grey menu bar on the right of the map will show your current objective. Tap to open it.</li><li>Once you've completed an objective, a green check mark will appear in the bottom left. Tap this to proceed.</li><li>If you ever destroy all of a given tile type - forest/trees, grassland, or water - then there is no way to get it back and you can no longer complete the game. Click the tiny 'restart' button at the bottom of the screen.</li><li>Generating new forest is tricky! After you dig, grassland will always grow in before forest. So if you need to create new forest, you have to create a situation where there is no adjacent grassland. In this case, forest will grow in.</li><li>There are only about 10 objectives to complete, so don't worry if you have to start over.</li></ul><p>Good luck! Let us know if you get really stuck.</p>\n<p>However, we have no plans to work on this game further, so please enjoy it as is.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2023-03-17T23:58:54", "background_image": "https://media.rawg.io/media/screenshots/689/6890fc3259284dfda168570a40050f24.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "PC"], "developers": ["hayfield"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}