{"id": 943472, "slug": "extreme-evolution-drive-to-divinity", "name": "Extreme Evolution: Drive to Divinity (itch)", "name_original": "Extreme Evolution: Drive to Divinity (itch)", "description": "<p>Extreme Evolution: Drive to Divinity is an expressive 3d platformer adventure where every obstacle has countless, overlapping solutions. You're set free in an organic underworld where every pickup expands your mobility!</p>\n<ul><li>Use § to transform between known forms at any time; each with its own movement system.<br/>\n</li><li>Discover and subsume new evolutionary forms, often hidden in temples... They afford new modes of mobility, and greater § costs.<br/>\n</li><li>Collect raw § to permanently increase max §.<br/>\n</li><li>Enter holes to unlock new sites on the Map.<br/>\n</li><li>Eventually, you can drive the organism to Earth; past the 6 seals of the 6 Gods!\r\n</li></ul>\n<p>String transformations together, performing extreme combos through the environment. Take big jumps as <em>Car</em>, trigger an avalanche as <em>Pump</em>, ricochet with the perfect bounce of <em>Bomp</em>, cling upside down to surfaces as <em>Spide</em>, perform heavy labor as <em>Truk</em>, and many more... Extreme Evolution is a game about options!<br/><br/><br/><br/>EEE: the Extreme Evolution Experiment. The Gods capitulate and call out, driving Extreme Evolution. The nutrient rich Body, the perfect Digital Way, the abject emptiness of Nothing, the Infinite Spirits, the Lies, and the Ouroboros: each essential stopgaps on the Drive to Divinity, for each contain a divine seal. Each seal calls out for its own closure and consumption, as any divine vacuum yearns for refill. Past this Body, there is Earth, out of reach and hiding the greatest power, and the last known location of the Human!<br/><br/><br/><br/>Movement as the original power; the ultimate story of mitochondrial evolution concludes in Extreme Evolution: Drive to Divinity!<br/><br/><br/><br/>the 4th game by Sam Atlas<br/>music by DL Salo</p>", "metacritic": null, "released": null, "tba": false, "updated": "2023-03-18T00:38:41", "background_image": "https://media.rawg.io/media/screenshots/a37/a37daa05d517bcfdabd8394e90695020.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 280, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sam Atlas"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}