{"id": 94346, "slug": "the-battles-untold", "name": "The Battles Untold", "name_original": "The Battles Untold", "description": "<p>The Battles Untold is a local multiplayer brawler, akin to titles like Samurai Gunn and Towerfall.</p><p>Characters in the game are based on public domain work. You are able to fight with Dracula, Joan of Arc, Blackbeard and Merlin. (We plan to add more characters soon).</p><p>A key aspect of the game is each character individuality. You have to pay attention to your characters attack and movement routines and master your strengths, while minding your own weaknesses.</p><p>After characters are selected, press Enter or Start to start the battle.</p><p>Use WASD to attack and the arrow keys to move when using keyboard. Left stick to move, A jumps, X attacks, Left Stick + X attacks in different directions.</p><p>Rule of thumb: experiment with your attacks to learn each character's move set. Each character is different and have their own fighting style. Have fun!</p><p><strong>How to enable AI?</strong></p><p>Choose \"play\", then \"4 players\", choose your character and start a match. The AI will pick the remaining characters.<br/></p><p><strong>Troubleshooting:</strong></p><p><strong>Q: Why are some sprites not showing up? When I walk left, my character disappears completely!</strong><br/></p><p>A: Some people are having graphic issues with the game, most noticeably when sprites that are \"flipped\" or when a character \"turns left\", end up being hidden, not rendering at all. We noticed this issue in one of our development machines and were able to solve it by updating graphics drivers to the latest version. For reference, the notebook in question had an Intel HD 4000 graphics chipset and we downloaded the update from the manufacturers website, in that case, Lenovo.</p><p><strong>Q: I'm trying to play with my friend using only the keyboard, what are player 2's controls?</strong></p><p>A: To play with your friend you will need at least one gamepad (we highly suggest you both use gamepads anyways). This is a limitation of the genre and the hardware. Let us explain: keyboards have a limitation in the number of simultaneous keys you can press. Since this is an action game, you can imagine the trouble of both players trying to press 4, 5 keys at the same time, while trying to jump-left-stomp-down-jump with Joan of Arc for exemple. It's a competitive game too so you won't like your friend trying to mess with your controls am I right? <br/></p>", "metacritic": null, "released": "2015-05-25", "tba": false, "updated": "2019-08-28T23:25:50", "background_image": "https://media.rawg.io/media/screenshots/090/090f3a1fb9316b8f71c6c132b7afcf18.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["matchola", "paulordbm", "thiago", "Elvex Kidd", "adrianogil"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}