{"id": 943545, "slug": "my-sister-in-law-wont-let-go-of-my-cock-seduced-by", "name": "My sister-in-law won't let go of my cock ~Seduced by a widowed proprietress~", "name_original": "My sister-in-law won't let go of my cock ~Seduced by a widowed proprietress~", "description": "<p>This is a Low-priced practical erotic game.《Contents》CG : 15<br />\nIntimate scene : 15<br />\nVoice : Heroine Full Voice.《Features》You can have the same experience as the protagonist.Two endingsCG Gallery ModeScene Replay Mode《Story》<br />\nI, Takeo Kashima, am currently taking a short break in the office of a hot spring inn.<br />\nThat inn is where I grew up.<br />\nMy parents are away from the inn for a few days to attend some sort of meeting in town.<br />\nWith two pairs of hands gone, this small inn can&#39;t keep up with all the work. That&#39;s why I was called in for the summer.<br />\nOh? Tired already?<br />\nThe person who appears in the door is Yukari Kashima.<br />\nShe&#39;s my older brother&#39;s wife, or in other words, my sister-in-law.<br />\nRight now, she&#39;s working as the proprietress of this inn.<br />\nOr… is it that you can&#39;t get motivated without a reward?<br />\nIf you want, I could give you one!<br />\nMy brother… passed away last year due to illness.<br />\nThat makes Yukari a widow.<br />\nIn light of that, I think it&#39;s inappropriate for her to joke around like this.<br />\nIn front of the guests, she&#39;s ever the gentle and elegant hostess, but… she&#39;s always like this with me.<br />\nThat night… I get lost in thought while soaking in the open-air bath, the pride of the inn.<br />\nAs I gaze up at the starry night sky while soaking in the tub, someone enters the bath.<br />\nUh… Yukari? Wh-why are you here?《Characters》<br />\nYukari Kashima (VA: Riko Amamori)<br />\nTakeo&#39;s sister-in-law.<br />\nSince Takeo&#39;s brother passed away, she is a widow.<br />\nShe&#39;s prone to joking around as a way to cope with her husband&#39;s death.<br />\nShe&#39;s actually quite shy.<br />\nShe&#39;s such a lightweight that just one small cup of booze is enough to get her drunk.<br />\n<em>Before purchasing this product, we highly recommend that you play the demo[Japanese only] to check if the game works properly on your computer in your region.<br />\n</em>Appetite is the licensor of this game. For inquiries about the product, please contact Tensei Games.</p>", "metacritic": null, "released": "2023-03-16", "tba": false, "updated": "2023-03-20T12:22:17", "background_image": "https://media.rawg.io/media/games/ae6/ae655e95adea692fc8d0f9afae1bd298.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 290, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Appetite"], "genres": ["Simulation"], "publishers": ["Tensei Games"], "esrb_rating": null}