{"id": 943567, "slug": "aquascaping-designer", "name": "Aquascaping Designer", "name_original": "Aquascaping Designer", "description": "With Aquascaping Designer, you setup, decorate and arrange a set of natural elements in an aesthetic way.<br/>\r\nUnleash your creativity, test your ideas and build endlessly.<br/>\n<br/>\r\nVR and PC compatible, Aquascaping Designer will automatically switch to VR mode if it detects a VR headset, otherwise it will launch into the PC version. The creations will be visible regardless of the used platform.<br/>\n<br/>\r\nFully tested with Oculus Rift S and Rift. Steam VR Vive, Steam VR Index and Cosmos are implemented but not tested. It's the main reason for the early access<br/>\n<br/>\r\nAquascaping Designer currently includes a Main menu, a designer mode and a diving mode.<br/>\n<br/>\r\nThe Main menu is the place where all your aquariums are exposed. It's your gallery of aquascaping.<br/>\n<br/>\r\nThe designer mode lets you create your favorite aquarium. Choose the size of your aquarium,the level of the water, and a various kind of natural element like rocks, stones, wood, and fishes. More and more content will become available with our regular updates. Build your aquarium without considering real-world restrictions. It's even possible to build natural scapes without water like terrarium or to build scape with small areas of water like island.<br/>\n<br/>\r\nThe diving mode gives you the perspective of a fish or a small animal. Immerse yourself in your creations. Swim as if you were a fish and discover your aquariums from another angle.<br/>\n<br/>\r\nThe screenshots and videos are all setup with Aquascaping Designer.", "metacritic": null, "released": "2023-03-19", "tba": false, "updated": "2023-03-20T03:15:59", "background_image": "https://media.rawg.io/media/screenshots/4e2/4e2e9dda377c2754ba498b7d40fdd77d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nipinfo"], "genres": ["Simulation", "Indie"], "publishers": ["Nipinfo"], "esrb_rating": null}