{"id": 9435, "slug": "white-noise-2", "name": "White Noise 2", "name_original": "White Noise 2", "description": "Enjoy a fresh horror experience with White Noise 2!<br/>White Noise 2 is the sequel of the successful White Noise Online. Be a part of the investigator team, or take control of the creature and devour them! White Noise 2 offers a 4vs1 asymmetric horror experience that won't leave anyone unmoved.Play with your friends<br/>White Noise 2 features a simple matchmaking system that allows you to play with your friends without complications. Enter the game, choose your side or leave it to luck, and start playing!The investigators are back<br/>As an investigator, explore the area, cooperate with your partners, and make sure not to get lost, or you'll be easy prey for the creature! Try not to lose your sanity and watch your flashlight battery level to avoid walking blind.And the creature as well!<br/>As the creature, stalk your preys and hunt them without being seen. Light can stun you, so use your powers to avoid it and wreak havoc upon the investigators, spreading them to make easier preys. Summon totems that will warn you of the presence of nearby investigators, and prevent them from picking the 8 tapes before you finish them off!Back from the grave<br/>In White Noise 2, death doesn't mean game over. Rise as a ghost and take advantage of your enhanced exploration skills to help the remaining investigators in their search.Unlock new items<br/>Unlock new characters and flashlights as you play, including the classic White Noise Online characters. Each one has different specializations and skills. Do you prefer a stealhty approach, or will focus on speed even while making noise? Better flashlight battery, or improved exploration skills?Relive the best moments<br/>Of course, the signature replay screen is back in White Noise 2. Once the thrilling session is over, take a laugh checking how the team walked in circles, or one of the investigators got lost!", "metacritic": null, "released": "2016-10-27", "tba": false, "updated": "2024-01-31T21:22:43", "background_image": "https://media.rawg.io/media/screenshots/f32/f3258050d3715b84e30fd592a2e01861.jpg", "website": "", "rating": 2.86, "rating_top": 3, "added_by_status": {"yet": 16, "owned": 312, "beaten": 3, "toplay": 8, "dropped": 12}, "playtime": 3, "achievements_count": 197, "ratings_count": 21, "suggestions_count": 642, "game_series_count": 1, "reviews_count": 21, "platforms": ["Xbox One", "PlayStation 4", "PC", "macOS", "Linux"], "developers": ["Milkstone Studios"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["Milkstone Studios"], "esrb_rating": "Teen"}