{"id": 943576, "slug": "eftu", "name": "Eftu", "name_original": "Eftu", "description": "<h3>Story</h3><br/>Something moves through the universe, burrowing through the fabric of spacetime. Whether it is consciously steering itself, mindlessly meandering, or compelled by some force of nature, we do not yet know. When its tendrils broke through to our world, it cast a ripple of energy through our society that sowed confusion, panic, and fear. Amidst the chaos, the necessity of community drew us into guilds.<br/><br/>Through its own corridors, we have traveled. Always, we arrive at a world in ruin. The creatures among these worlds - some of which left behind evidence of intelligence and technology - have been driven to extinction. In their absence, our guilds have discovered an abundance of resources to scrap over.<h3>Gameplay</h3><br/>In a world threatened by a mysterious interdimensional entity, pick your guild, pick your ship, and pick your battles!<h3>Pick Your Guild</h3>Create a guild to attract players with a similar playstyle - or join a guild that already exists! Prior to matchmaking, you’ll decide if you want to represent one of your guilds. This means you’ll be wearing the colors and banner of the guild, you’ll be able to join squads of fellow members, and your performance toward accruing resources will be shared.<h3>Pick Your Ship</h3>Select the vehicle that you want to pilot during the upcoming match. Each class is entirely unique in its design and playstyle in order to offer a variety of strategies.<br/><ul><li>Enter combat with guns blazing and engines roaring, or switch to Encore mode to retreat and recuperate.</li></ul><h3>Pick Your Battle</h3>In Eftu, you can customize the battle settings to make the most of each experience:<br/><ul><li>Teams: Will you collaborate with other players or fend for yourself?<br/></li><li>Pickups: Do you want the game to spawn items that will improve your stats?<br/></li><li>Time Limit: Will the match end after a certain point?<br/></li><li>Trails: Can vehicles generate physical trails behind them to block opponents' paths?</li></ul>", "metacritic": null, "released": "2023-03-17", "tba": false, "updated": "2023-03-20T03:26:52", "background_image": "https://media.rawg.io/media/screenshots/5c0/5c03d2a7a73d863577c3734c2c6a322e.jpg", "website": "https://www.tickingcandle.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ticking Candle"], "genres": ["Action"], "publishers": ["Ticking Candle"], "esrb_rating": null}