{"id": 94357, "slug": "mini-thief-itch", "name": "Mini Thief (itch)", "name_original": "Mini Thief (itch)", "description": "<p>\n<br/>\n</p><p>\n<strong>BECOME THE MASTER (mini) THIEF!</strong><br/>\n</p><p>\r\n\tCan you escape with the loot? Play as the Master Thief and steal as much as you can. Burgle houses in order to obtain some sweet, sweet loot but, be careful not to be caught!.\r\n</p><p>\r\n\tYour objective is simple, search the area for items which are exchangeable for money. Each level you pass will increase in difficulty. The more difficult the level is the more loot you will obtain.\r\n</p><p>\r\n\tAvoid the owner at all costs! If he catches you, well, you lose everything! including your money!</p><p>\n<strong>Bigger, Better and Harder Levels! + Possible Online Multiplayer!</strong><br/>\n</p><p>\r\n\tThe more support we have for Mini Thief the more we can make this a great game by expanding the development to push further goals.We have ideas for possible multiplayer modes which friends can challenge each other(excludes android and ios).\r\n</p><p>\n<strong>Use the sprites and tilesets!<br/>\n</strong>\n</p><p>\r\n\tIf you are interested in using sprites and tilesets like the ones you see in Mini Thief then this sprites asset pack may be what your looking for. These 16x16 sprites and tiles were used in most of my games and I am releasing them on here for everyone to use.\r\n</p><p>\r\n\tCheck out the page too I make personal custom characters too!\r\n</p><p>\r\n\tRelease Notes:\r\n</p><p>Alpha v1.08.3</p><p>-New Halloween theme level (Accessible through Pawn Shop door).<br/>-New Halloween theme outfit.<br/>-Fixed AI always knowing where players are after finding 1st player in co-op.<br/>-Changed Countdown timer.<br/>-Fixed co-op camera when one player gets knocked out.</p><p>Alpha v1.08.2</p><p>-Can now leave Night Vision Goggles on and use other tools.<br/>-Fixed Night Vision Goggles store item description.<br/>-Fixed Abyss walking glitch permanently.</p><p>Alpha 1.08.1</p><p>-Fixed a crash<br/></p><p>v1.08<br/></p><p>-Added 2 New Level<br/>-Added Night Vision Goggles to Shop<br/>-New Hats added<br/>-New Secret Hat added<br/>-Added 2 secret costumes<br/>-Fixed cutscenes skipping. Press a key to continue<br/>-Added lighting to the Police station level<br/>-Added more easter eggs <br/>-Fixed issue with Player getting stuck after searching an object<br/>-Fixed placement of the unlocked text and lock icon above doors<br/>-Aligned font letters better<br/>-Cameras that find you have an exclamation mark above them<br/>-Fixed security guards in bank running into the abyss<br/>-Fixed level skipping bug<br/>-Fixed using items while ingame pause menu is active <br/>-Disabled tool selection when ingame pause is active<br/>-Disabled tool usage when player is hiding<br/>-Change End level and title Animations<br/>-Added option to visit Pawn Shop after each level<br/>-Randomized patrols for Difficulties 2 and 3<br/>-Increased Tool icon Hud spacing<br/>-Fixed cutscene fade issue<br/>-Enabled controller for online PvP (must start match with controller)<br/>-Added online \"Alert\" graphic to offline as well in order to see how far the noise travels<br/>-Added lights to Security Cameras<br/>-Slight changes to AI<br/>-Added sprite to show you what loot you picked up<br/>-Trip wires can now run in any direction, Online and Offline (look out for future updated levels!)<br/>-Changed Safe mechanic. Now cheaper and acts as one-time insurance, in order to make early levels easier and later levels harder<br/>-Added \"Level Select\" to Result Screen Menu<br/>-Fixed Save File purge bug<br/>-Added Proximity Net trap, if set off you will be trapped. Either sneak by it or use cable cutters to disable it. If trapped, repeated tap interact to escape faster.<br/>-Added Randomized Security placements throughout levels<br/>-Fixed unlocking while knocked out (ex. exit window)<br/><br/>*Online*<br/>-Removed Lights as option to buy<br/>-Added Static lights<br/>-Added Safe to items to buy<br/>-Some optimization to netcode<br/>-Owner must place at least one safe before starting a match<br/>-Thief must find key and retrieve loot from at least one safe to finish the match<br/>-Added Hats to online play<br/>-Added controller support to online play (must start match with controller to use)<br/>-Money you earn as a thief is added to your money, both online and offline (start playing more online!)<br/>-Fixed Bug where Thief's Earnings does not get reset between matches<br/>-Increased Loot in online play<br/>-Added stats to Lobby screen<br/>-Adjustments to online Owner purchases<br/></p><p>v1.07.2<br/>-Added Fire Cracker distraction tool.<br/>-Fixed dog in Online mode.<br/>-Added unlockable Bounty Hunter hat. (Unlock last level)<br/>-Adjustments to difficulty.<br/></p><p>v1.07.1<br/>-Fixed Steam screenshots not working.<br/>-Added Saved screenshots to save location and Screenshot key; F12.<br/>-Fixed crash with Decoy and Chewtoy.<br/>-Fixed Retro Effect bug.<br/>-Changed \"Join\" to \"Enter IP\".<br/></p><p>v1.07<br/>-Online PvP added **Very early testing**. Mainly to gather information, bug test, and get feedback. Open port 26900.<br/>-Fixed co-op camera bug.<br/>-Changed Guard dog to grab player rather than bust the player.<br/>-Added delay from finishing a level to outcome screen.<br/>-Chat function implemented for online play.<br/>-Added Pause menu.<br/>-Added customizable hats. Only a couple are available at the moment. <br/>-Added Changing room to pawn shop. Interact to change hats.<br/>-Updates to existing levels. Larger in most cases.<br/>-Added music to levels.<br/>-Fixed Loot outcome screen bug.<br/>-Changed Looting so you can interact with only one instance at a time.<br/>-Added Retro style effect, can be removed in Settings.<br/>-Added Zoom effect, can be removed in Settings.<br/>-Resolution adjustments.<br/>-New Font Added.<br/>-Changes to AI.<br/>-Added Custom Controls for keyboard and controller.<br/></p><p>v1.06.7<br/>-Removed text near security cameras.<br/>-Updated Demo game.<br/>-Fixed Decoy/Security Camera crash.</p><p>v1.06.6<br/>-removed Small house 2. Was prematurely released.<br/>-fixed wife getting stuck in Small house 1.<br/>-updates to AI.</p><p>v1.06.5<br/>-(Hopefully) Fixed notorious Artorias bug.<br/>-Fixed light bug in bank and jewelry store.<br/>-Changed, can now escape after objective item is collected.</p><p>v1.06.4<br/>-Changed Menu back key BACK to Esc.<br/>-60fps support.<br/>-(Hopefully) fixed NPCs walking into Abyss.<br/>-Fixed guard crash.<br/><br/>v1.06.3<br/>-Fixed Loot crash.</p><p>v1.06.2<br/>-Fixed Owner being locked out of Medium House.<br/>-Added Clock sound to timer as audio cue.<br/>-Adjusted effectiveness of Tripwires.<br/>-Fixed lighting in Jewelry Store.</p><p>v1.06.1<br/>-Fixed crashes with the guard dog.<br/>-Fixed radial light not turning off while hiding.<br/>-Fixed player placement in Medium House.</p><p>v1.06<br/>-Fixed specific unlock crash<br/>-Fixed cameras seeing player through walls<br/>-Fixed constant sleeping dog<br/>-Reworked reaction icons<br/>-Updated menu controls to use enter key as well as Space key<br/>-Created sneak feature to get around NPCs without being detected; Keyboard = Ctrl, XBox = B<br/>-Flashlight button for Xbox controllers changed to Y<br/>-New NPCs<br/>-New NPC behaviors<br/>-Increased noise radius for broken floor boards<br/>-Updated Cameras with a blind spot directly below them<br/>-NPCs now react to flashlight<br/>-Some doors now not locked by default (bathrooms)<br/>-(Hopefully) fixed screen tearing<br/>-NPCs now check rooms if tampered<br/>-Doors can now be closed<br/>-Fixed never disappearing unlock gui<br/>-Lights no longer automatically come on if dog is in the house<br/>-Added Wardrobe hiding spot<br/>-Lighting adjust: Darker (flashlight now relevant)<br/>-Added personal radius light<br/>-New Tilesets<br/>-Local Co-op! (may be buggy at the moment): Friend can now help you progress the entire game.<br/>-HUD changed to better accommodate co-op</p><p>\r\n\tv1.01 (4/27/2016)\r\n</p><ul>\n<li>Minor fixes to alert system</li>\n<li>Audio fixes</li>\n<li>Minor menu adjustments</li>\n<li>Demo created</li>\n</ul><p>\r\n\tv1.02 (5/3/2016)\r\n</p><ul>\n<li>Minor fixes</li>\n<li>How to Play added to Main menu</li>\n<li>New Settings menu to adjust audio</li></ul><p>v1.03 (6/3/2016)</p><ul><li>Minor bug fixes</li><li>How to Play removed from Main menu</li><li>New tools to use</li><li>Changed controls:  Left and Right Arrow Keys select tool, Enter Key Uses tool</li><li>Gamepad controls updated: R&amp;L Bumper/R1&amp;L1 select tool, X Uses Tool</li><li>AI update: Creaking floors, falling vase, alarms, open doors, investigation</li><li>Hid Timer until 10 seconds left, also randomized Timer</li><li>Removed Dog barking while chewing on Chew Toy</li></ul><p>v1.04 (6/4/2016)</p><ul><li>Controls menu added to the Options menu to reflect new controls</li><li>Hotfix 1.04.1: AI bug fixes and minor adjustments</li></ul><p>v1.05 (6/13/2016)</p><ul><li>hide mouse cursor</li><li>New AI behavior</li><li>New levels</li></ul><br/><ul>\n</ul>", "metacritic": null, "released": "2016-04-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7b2/7b2ed5ac2c64d176b4be7a967c5d07a0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Stranga Games", "Tommah"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}