{"id": 94384, "slug": "columnae-a-past-under-construction", "name": "COLUMNAE: A Past Under Construction", "name_original": "COLUMNAE: A Past Under Construction", "description": "<p><strong>COLUMNAE is still under development, and this is a small demo from 2016.  If you like it, consider supporting COLUMNAE via Paypal and you will get a copy of the full game when it's out (2018): </strong><strong>moonburntstudio.com/paypal.htm</strong></p>\n\n<p>\"COLUMNAE: A Past Under Construction\" is a non-linear point &amp; click adventure game set in a post-apocalyptic steampunk world and developed by Belgrade-based Moonburnt Studio.<br/></p>\n<p>Aside from the classic point &amp; click adventure features, COLUMNAE introduces the <strong>concept of retrocausality</strong> which along with non-linear nature of the gameplay allows the player to affect not only the future but also the past of the main character and the world surrounding him. The game is divided into eight chapters, but the order of playing them is not chronological. Depending on the actions the player chooses within each chapter of the game, yet-to-be-played chapters are placed in an appropriate \"version\" of the past or the future.<br/><br/>COLUMNAE is set in a <strong>world ruined by a gradual environmental catastrophe </strong>that left the surface of the Earth uninhabitable. The story is focused on a society descended from people who couldn't afford to inhabit the \"city in the clouds\", called Deus, when the ecological disaster was imminent. Deus is a closed town built upon gigantic metal pillars - Columnae. Beneath them, a huge underground machine, called Machina, was constructed with the purpose of automatically extracting and processing resources and sending them via pipes through Columnae and into Deus. The society now living inside the columns settled there in an attempt to escape the lethal environment on the surface after Deus was locked down. Since then, they had no contact with the inhabitants of Deus, and they are parasitizing on the resources coming through the columns. But the people living there are far from innocent themselves - power struggle, corruption, lies, political manipulation and poverty are all present among the citizens of Columnae.</p>", "metacritic": null, "released": "2016-06-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e5e/e5e517dcc9ccef0c01344c2a10ee4ee7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Moonburnt Studio"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}