{"id": 943996, "slug": "vie-prototype", "name": "Vie - Prototype", "name_original": "Vie - Prototype", "description": "Synopsis\r\n<p>Vie immerses you in a post-apocalyptic, war-torn world. The few survivors who remain are not only left hunting for resources, but are also faced with two unique rivals to their survival - giants and critters.</p>\n<p>Giants took over the world years ago and wiped out nearly all humans; going outside is sure to result in your demise. Critters are rodents and insects affected by the radiation that have grown to monstrous sizes.</p>\n<p>This fractured world is ruled over by an elite. They have mastered the art of Arcana; a translucent force with unimaginable power. Most of those who use it have no interest in the lives of others.<br/></p>\n<p>In Vie, you cannot trust anyone. There are no rules on being nice, and only you can see items you keep in your pockets. However, with so little resources and so many contestants, if you stay on your own you surely won't last long.</p>\n<p>They say that, in the midst of this wasteland, there's a safe haven. If you survive for 30 days, you'll be able to find it and survive.</p>\r\nInformation\r\n<p>Vie is a multiplayer game, but it is playable offline. <em><strong>Note that the server is currently offline as the game is in the prototype stage.</strong></em></p>\n<p>You take the role of a randomly-generated character, and all death is permanent.</p>\r\nHelp\r\n<p>Multiplayer not working?<br/></p>\n<ul><li>Server is offline<ul><li>The server may be down.</li></ul><ul><li>You may have entered the wrong IP address.</li></ul></li><li>Can't see others<ul><li>You may have an outdated client.</li><li>Your IP address may be banned.</li><li>Other players may not be online.</li><li>Try restarting your game.</li></ul></li></ul>", "metacritic": null, "released": "2023-03-19", "tba": false, "updated": "2023-03-20T06:51:25", "background_image": "https://media.rawg.io/media/screenshots/638/6381ca92d7d5277648148925f0a82ae0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Joyless"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}