{"id": 944078, "slug": "data-race", "name": "DATA RACE", "name_original": "DATA RACE", "description": "<p><em>Tu es une assistante de dernière génération, en charge de la gestion d'un clinique de réabilitation d'organes et de prélévements (CROP). Ton travail est simple : gérer ta clinique. Néanmoins, en raison des coupes budgétaires et des économies à réaliser, tout dépassement de budget sera à ta charge. A toi de réaliser tes choix, éthiques ou non, pour que ta clinique perdure.</em><br/></p>\n<p>Prototype réalisé en à peu près 16 heures dans le cadre de l'Orbital Game Jam 5 ! Les thèmes étaient \"Intelligence Artificielle\", \"Race\", et \"Cyberpunk\". Mon premier jeu un peu poussé avec LÖVE !</p>\n<p>Je n'ai malheureusement pas réussi à terminer tout ce que je voulais faire, mais j'ai appris plein de trucs, donc c'est plutôt cool.<br/></p>\n<p>Explication des thèmes :</p><p>\n</p><ul><li><strong>Intelligence Artificielle</strong> : l'idée de base est d'avoir une intelligence artificielle \"vierge\" (le/la joueureuse), qui doit apprendre à gérer sa clinique, et réaliser des choix éthiques (ou pas) en fonction des éléments découverts au fur et à mesure de ses missions (exemple, un enregistrement audio qui traite d'eugénisme).</li><li><strong>Race</strong> : je me suis inspiré de RACE, à savoir Rapid amplification of cDNA ends, qui est une méthode d'isolement des extrémités 3' ou 5' de gènes afin de déterminer la séquence d'initiation ou de terminaison de la traduction par exemple. C'est une technique dérivée de la RT-PCR.</li><li><strong>Cyberpunk</strong> : l'ambiance générale et l'énergie de faire du super profit sur la santé.</li></ul>\n<p>Le jeu se joue à la souris.</p>\n<p>L'intégralité des éléments du jeu se trouvent sur GitHub : https://github.com/Amustache/DATA-RACE.<br/></p>", "metacritic": null, "released": "2023-03-19", "tba": false, "updated": "2023-03-20T07:31:59", "background_image": "https://media.rawg.io/media/screenshots/47d/47d4f8896efe52144fe6c2ca6334fcff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Stache"], "genres": [], "publishers": [], "esrb_rating": null}