{"id": 9440, "slug": "stardrop", "name": "STARDROP", "name_original": "STARDROP", "description": "http://steamcommunity.com/sharedfiles/filedetails/?id=954273686ABOUT STARDROP<strong>STARDROP</strong> is a narrative driven, single player experience. During the game, Aryn and John set out on a routine salvage operation of an unknown spacecraft reported to be somewhere in the Cassiopeia constellation.<br/><br/>EXPLORE<br/>In <strong>STARDROP</strong> you'll be able to experience what it's like to be a Salvage and Rescue Operative. Explore old derelict spaceships in the main game while being able to visit a range of other various locations across the universe through a number of side missions.<br/>INTERACT<br/>Throughout the game the player will be able to interact with various types of interfaces such as control panels, elevators and security system as well as other various interactive objects such as computer interfaces where you can read emails, listen to audio logs and more.<br/>THE APD HELMET<br/>The player will have to rely on his helmet's APD Functions. Installed with visual enhancements being able to simply light up a dark area using the suit's basic flashlight or the more advanced Object Scanner utility system with the ability to inspect his surroundings, spot security cameras and locate hidden control panels and more. <br/>THE DATAPADUsing your DataPad you will be able to receive mission objectives, read crew logs, view your location on the mini-map or remotely control certain androids to overcome obstacles and continue your journey.<br/>ZERO GRAVITY ENVIRONMENTSCertain parts of the game will have you fly around in space or interior areas through zero gravity. Luckily the APD suit comes built in with a propulsion system that enables the player to traverse these environments.<br/>SRO SIDE MISSIONSSTARDROP also offers a number of smaller side missions where you will be able to visit a number of new and exciting places such as an abandoned communications outpost or a surface mining facility somewhere on a distant planet. All with full narrative support with voice acting. <br/><br/><br/>We will continue to update the game throughout early access with full and complete narrative content and treat these as new episodic installments. For those who wan't to play a more unfinished and unpolished version can always opt into our public dev branch.<br/>​<br/><ul><li>A strong engaging story breaking from the usual dark Sci-Fi.<br/></li><li>Explore multiple spacecraft, Outposts, Stations and more as a salvage and rescue operative.<br/></li><li>Professional voice acting to drive its story full of mysteries and excitement.<br/></li><li>A range of light environmental puzzles and a touch of light stealth mechanics.<br/></li><li>Open world based exploration mixed with narrative driven gameplay. <br/></li><li>Inspired by story-rich classics such as Portal, Firewatch and even Alien: Isolation.</li></ul>", "metacritic": null, "released": "2017-06-01", "tba": false, "updated": "2019-08-28T22:14:58", "background_image": "https://media.rawg.io/media/screenshots/af6/af6967a7028122fbed00a4c1cf445ffc.jpg", "website": "http://www.stardropgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 29, "beaten": 1, "toplay": 2, "dropped": 2}, "playtime": 6, "achievements_count": 10, "ratings_count": 2, "suggestions_count": 495, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Joure Visser"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Joure Visser"], "esrb_rating": null}