{"id": 944150, "slug": "mine-craft-real-horror", "name": "Mine craft Real Horror", "name_original": "Mine craft Real Horror", "description": "<p>An intricately designed gameplay experience that employs a unique approach to horror gaming. The game's overarching premise is to immerse players in a world that is at once ethereal, surreal and ominous, without resorting to the use of jumpscares.</p>\n<p>The game features a visually minimalist aesthetic that is heavily influenced by surrealism. This design philosophy is reflected in the game's use of abstract shapes, lighting, and colors that create an otherworldly atmosphere. The game's sound design further enhances this surreal experience, with eerie soundscapes that blend seamlessly with the game's minimalist visuals.\r\n</p>\n<p>The gameplay itself revolves around exploration, with players tasked with uncovering the mysteries of the game's world. Throughout the game, players must navigate through a labyrinthine environment filled with strange and unsettling sights, sounds and objects. The game's puzzles require a keen sense of observation, and lateral thinking.\r\n</p>\n<p>The horror elements in the game are subtle and psychological, with the game relying on the player's imagination to create a sense of dread and unease. The game's narrative is likewise minimalist, with the story revealed through cryptic clues and hints scattered throughout the game world.\r\n</p>\n<p>Overall, this Minecraft surreal minimalistic horror game represents a unique and innovative approach to horror gaming, without traditional jump scares in favor of a more cerebral and immersive experience.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<li><strong><br/>\n</strong>\n</li>", "metacritic": null, "released": "2023-03-19", "tba": false, "updated": "2023-03-20T08:06:49", "background_image": "https://media.rawg.io/media/screenshots/1f3/1f3eb0af9c724128ab92c6944b80587e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Joel Astorga"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}