{"id": 944147, "slug": "robot-dreams-brown-can-studios", "name": "Robot Dreams (Brown Can Studios)", "name_original": "Robot Dreams (Brown Can Studios)", "description": "<p><em>Content Warning: the goal of the game can be interpreted as \"suicide\" - this is absolutely not the intention (if anything, it's opposite) - it just happens to be a trope that \"falling\" in dreams will cause you to wake up.<br/></em></p>\n<p>Robot <strong>Dreams</strong> is a game where you <strong>dream</strong> that you are a robot and you have to wake up! Each level acts as a <strong>dream</strong> within a <strong>dream</strong>, until finally you are able to wake up, but which ending will you wake up to?<br/></p>\n<p><strong>Disassemble</strong>: To beat Level 2, you must disassemble part of the level? Also wanted to have the robot lose appendages under certain conditions, but wasn't really able to tackle this sub-theme as much as we wanted.<br/></p>\n<p><strong>A Fork in the Road</strong>: there are 2 endings, can you get to each of them? Limits and terms apply.</p>\n<p><strong>Kaboom</strong>: there are infinite bombs in Level 2 which are fun to play with.</p>\n<p>Credits:<br/>Art: Sam DeVarti, Emmy Toyonaga<br/>Programming and Sound: Nikola Whallon</p>\n<p>Technology (<strong><em>SPOILER WARNING</em></strong>):<br/>A \"secret\" part of this game relies on websocket communication with a server I wrote in Rust which integrates with Twilio to connect to your phone, Deepgram for speech-to-text, and Polly for text-to-speech (https://github.com/nikolawhallon/game-twilio-deepgram-distributor/tree/robot-dre...) - I plan on making some blog posts on how this was done, because I think it's quite cool. I wasn't able to get up-to-speed on using websockets in Godot 4, so I played it safe and stuck with Godot 3.5.<br/></p>", "metacritic": null, "released": "2023-03-19", "tba": false, "updated": "2023-03-20T08:04:49", "background_image": "https://media.rawg.io/media/screenshots/717/71778e9aeab14fe80594c7f176eea4ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Brown Can Studios"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}