{"id": 94424, "slug": "monarchiesio", "name": "Monarchies.io", "name_original": "Monarchies.io", "description": "<ul><li><strong>Take on the role of a queen honey bee looking to build a hive.<br/></strong>She can start and build a colony by birthing workers and setting their tasks. Workers can forage flowers for nectar and pollen, nurse the brood, build new hive cells, and defend the hive from wasps and other players.</li></ul>\n<ul><li><strong>How to Play:</strong><ul><li>Press and hold where you want to go, and the queen bee will head there.</li><li>Place a hive with the 'new hive' button to place new hive cells.</li><li>Press a nearby hive cell to select it. Place eggs there with the 'lay egg' button.</li><li>Press one of your own workers to select them. Choose their job from the buttons below them. Foragers gather pollen and bring it to empty hive cells. Nurses bring collected pollen to your brood (which then become pupae, then birth as new workers), and builders eat honey and build new hive cells.</li><li>Press attack to toggle alarm pheromones in your workers. They will attack wasps, the nearest enemy bees, and player queens.</li><li>It is game over when all of your workers have perished, or your queen is killed.</li></ul></li></ul>\n<ul><li><strong>Planned Features</strong><ul><li>In-game tutorial</li><li>More hazards: Pesticides to be avoided and varroa mite infestations.</li><li>Sounds &amp; Music</li><li>Animation</li></ul></li></ul>\n<ul><li><strong>Support the Developer<br/></strong>While the game is free to play, servers and hosting cost money. If you like the direction Monarchies is headed, consider supporting it with a small donation.</li></ul>\n<ul><li>Also available at <strong>monarchies.io </strong>or on the <strong>Play Store.</strong></li></ul>", "metacritic": null, "released": "2018-06-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/162/16207fe4e1ef3fb009408947f64a288e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Corey Van Hoosen"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}