{"id": 944374, "slug": "one-bullet-with-yer-name-on-it", "name": "One Bullet With Yer Name On It", "name_original": "One Bullet With Yer Name On It", "description": "<p>On one faithful night, a curious stranger approaches Justice Joe in a bar. With the promise of an endless supply of whisky, the stranger convinces Justice Joe to retell the legend of how he got revenge on his horse's killer in the town of Rattlesnake, a few years back.<br/></p>\n<p>Players will be able to explore the legendary tale of Justice Joe in the past all the while influencing the storytelling in the present, although they will soon come to realize that Justice Joe is not the most reliable of narrators. <br/></p>\n<p>\"One Bullet With Yer Name On It\" is a humorous and lighthearted tale that pays homage to Spaghetti Westerns of the 60s, while also focusing on immersion and world building. <br/></p>\n<p>The game is meant to be highly replayable, having a total of 10 different endings. Will you be able to filter through Justice Joe's whiskey infused lies and find out the truth of what happened in Rattlesnake?</p>\n\n<p>The game uses a heavily modified version of the Unity FPS microgame as a template, with custom code.</p>\n<p>Assets are a combination of personal assets and assets from the Unity Asset Store:</p>\n<p>For the skyboxes: Customizable skybox, by Key Mouse</p>\n<p>For the campfire flames: os. Enflame | Stylized Fire, Smoke, Sparks, and Heat Distortion, by OccaSoftware</p>\n<p>For the revolver: Revolver Gun (Low Poly), by eretichable<br/></p>\n<p>For the music: Western Audio &amp; Music, by John Leonard French</p>\n<p>For the Wild West buildings: Western Pack, by dqurp<br/></p>", "metacritic": null, "released": "2023-03-18", "tba": false, "updated": "2023-03-20T09:53:09", "background_image": "https://media.rawg.io/media/screenshots/3a3/3a3159451e512eb66ec4dc949064bc93.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SirTangoGibus"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}