{"id": 944452, "slug": "asphalt-amphibian", "name": "Asphalt Amphibian", "name_original": "Asphalt Amphibian", "description": "<p>What happens when an ambitious frog collides with an amateur game developer? A unique opportunity for all participants. The frog is donating itself to a greater cause. A true life of service and sacrifice!</p>\n<p>We have placed a camera near a local road with a signalling system. A light turns on to signal when the participant presses the Up key on an attached keyboard. This signals the frog to hop forward. The frog will not question the choices of the player. All the frog asked is that we document and distribute the results. How will you treat this frog given control over its movements? Will you help it achieve its goals? will you take it into the path of danger? Will you leave it to sit unattended for a period of time?</p>\n<p>[redacted] has the pleasure of inviting you to partake in a recreation of The Milgram Experiment. Milgram 2: Electric Frogaloo</p>\n<p>This frog was going to cross the road regardless of our involvement here at [redacted]. We are only facilitators. Helping its efforts reach a larger audience. When asked why it was committing to the action, the frog answered that is was \"Guarded and Guided by Science\". We're not sure what that actually means. None-the-less, we invite you to help us gather results for our hero of the moment, The Asphalt Amphibian.</p>\n<p>///Game description is satire. Game is a recreation of Frogger. No data on game play actually recorded, streamed, collected, or transmitted.</p>\n<p>Inputs:</p>\n<p>Up Key: Hop forward</p>\n<p>P: Play game (when prompted)</p>\n<p>R: Restart game</p>\n<p>ESC: Close game</p>\n<p>Game developed in Game Maker: Studio 1.4</p>\n<p>Sound fx: FL Studio: a 3x Osc synth and some EQ's.</p>\n<p>Graphics: Drawn in Piskel https://www.piskelapp.com/</p>\n<p>links: https://en.wikipedia.org/wiki/Milgram_experiment </p>", "metacritic": null, "released": "2023-03-18", "tba": false, "updated": "2023-03-20T10:33:19", "background_image": "https://media.rawg.io/media/screenshots/40b/40b6fc9dcef58dd94aa22ffa6427843b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HashingSlash"], "genres": [], "publishers": [], "esrb_rating": null}