{"id": 944423, "slug": "back-to-the-collis", "name": "Back To The Collis", "name_original": "Back To The Collis", "description": "<p>Back To The Collis is a fully hand-drawn story-rich adventure puzzle game, that will take you on a journey  into the atmospheric world and amaze you with lots of logical puzzles and inspiring stories.<br/></p>\n<br/>\n\n<p>In Back to the Collis you will play as Benjamin, who has formerly left the town of Collis, built on a hill, and now lives in the forest in his comfort, nearby the town.</p>\n<p>But after a while, Benjamin must return to the Collis to tackle a seemingly simple problem of water shortage, which has already affected him as well.  </p>\n<p>With Benjamin, you will have a chance to explore the town, introduce its varied populace, their social problems, solve lots of exciting puzzles and who knows, maybe at the end of your shared journey you will even understand why he left this town long ago.</p>\n\n<p>Back to the Collis is classic point &amp; click game, where you will solve lots of engaging environmental quests and logical puzzles.</p>\n<p>This game is designed to be more than just a game,  it is an adventure that  will make you think about the way of life of its society, their coexistence issues, which has lots of in common with our real ones. </p>\n<p>• The backgrounds and characters in the game are fully hand-drawn, and every animation and sound has been carefully created especially for each engagement.</p>\n<p>• The game is story driven adventure without dialogues at all: there is no spoken language in the game. Instead, all character interactions are conveyed through bubbles and simple animations.</p>\n<p>• To enhance the experience of the atmospheric game world, unique music is crafted for each scene.</p>\n\n<br/>\r\nWe've dedicated subreddit to any topics related to the game. The main purpose of this subreddit is to build a close relationship with our game followers and once we've reached a certain number of members, we'll begin having regular discussions about game features and updates so that we can make game-related decisions together.\r\nHope to see you soon, Come join us!\r\n\r\n\n\n<p>                </p>", "metacritic": null, "released": "2023-03-18", "tba": false, "updated": "2023-03-20T10:20:16", "background_image": "https://media.rawg.io/media/screenshots/82d/82d49b6747b46f6d1baa5ce23429e8ff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 298, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["SollersTech"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}