{"id": 944460, "slug": "tales-of-storyteller", "name": "Tales of Storyteller", "name_original": "Tales of Storyteller", "description": "Sinopsis\r\n<p>En un mundo donde la creación de una Masterpiece es considerada un legado inmaterial que perdura con el paso del tiempo. Los artistas son quienes tienen como mayor objetivo crear varias Masterpiece a lo largo de su vida, el caso de los Storyteller son los libros que para algunos son guías, para otros una ventana al pasado o futuro, algunos lo usan para entretenerse, otros como un pasatiempo, pero algo de lo que todos están seguros es que cambia la forma de ver la vida, como la misma historia puede ser diferente dependiendo de quien la cuente, como cada Storyteller percibe el mundo que lo rodea y con ello crean su Masterpiece.\r\n  </p>\n<p>Esta es tu historia, eres un Storyteller que ha caído bajo la peor enfermedad conocida para aquellos Storyteller que buscan crear su Masterpiece, “Síndrome de hoja en blanco”. Determinado a encontrar una cura, te embarcas en una búsqueda para encontrar “inspiración” la única cura conocida para el “Síndrome de hoja en blanco”. El camino no será fácil, te encontrarás rodeado de varias amenazas que te impedirán buscar la verdadera “inspiración” entre ellos “Los temibles 7” una agrupación de los mas grandes clichés que buscan sabotear la originalidad de las Masterpieces mediante su influencia e impedimento de búsqueda de inspiración para no ser olvidados.</p>\n<strong>Recomendación</strong><strong>: </strong>Jugar en pantalla completa.", "metacritic": null, "released": "2023-03-18", "tba": false, "updated": "2023-03-20T10:37:01", "background_image": "https://media.rawg.io/media/screenshots/0c6/0c60c18e260262b630d8836d44e9abec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Stardust Knights - Marya"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}