{"id": 9445, "slug": "chkn", "name": "CHKN", "name_original": "CHKN", "description": "CHKN is an open-world sandbox game where life itself is your strongest tool!<strong>Create life, block by block…</strong>Bring living, breathing creatures to life in any size, shape, or combination you can imagine, with genuine personalities and feelings that respond to your actions and the world around them.<strong>Give your creatures unique traits and abilities…</strong>Life blocks have different stats and abilities built into them. Some are strong, some are fast, some shoot blinding ink, some poison enemies… they can all be used to your advantage to make creatures more effective.<strong>Work with your creatures to scavenge, craft, and build…</strong>Your creatures will help you gather resources in order to craft a wide array of tools, items, and structures. The better resources you find, the better the things you can craft!<strong>Fight for survival as you explore a mysterious island…</strong>Work together with your creature companions to survive the many dangers of CHKN, avoid starvation, and defend your thriving homestead.<strong>Get Creative…</strong>If the risk and survival of Adventure Mode aren’t your thing, you can spend your time in Creative Mode with an unlimited supply of every life block and resource at your fingertips. Create whatever you like with no restrictions.<strong>Bring Your Friends…</strong>Want to brave the wilds of Foot Island as a group? Or collaborate on a massive creature and see what happens? Invite other players to join you in any mode and see what you can accomplish together.<strong>Share Your Ideas with Us…</strong>We’re just beginning with CHKN and we’d like to involve you in this journey as much as possible! Our development is completely open, so you can see what we’re working on and share your ideas. We’re also available directly on Twitter, Facebook, or at heychkn@katapultstudio.com to chat. Show us a crazy creature or share any YouTube videos you’ve made (we collect them!).Thank you to all our CHKN fans for your feedback, bug reports, and suggestions so far!", "metacritic": null, "released": "2016-04-01", "tba": false, "updated": "2023-06-14T20:08:16", "background_image": "https://media.rawg.io/media/screenshots/35c/35c1f9fc0fe6a7f5491f40ad01b6d5d8.jpg", "website": "http://www.chkngame.com/", "rating": 3.22, "rating_top": 3, "added_by_status": {"yet": 5, "owned": 126, "toplay": 1, "dropped": 2}, "playtime": 2, "achievements_count": 21, "ratings_count": 9, "suggestions_count": 552, "game_series_count": 0, "reviews_count": 9, "platforms": ["macOS", "PC", "Linux"], "developers": ["Katapult"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Katapult"], "esrb_rating": null}