{"id": 944521, "slug": "focus-el-poder-de-la-mente", "name": "Focus el Poder de la Mente", "name_original": "Focus el Poder de la Mente", "description": "<p><strong>Concepto de juego</strong></p>\n<p>Experimentaremos una breve pero inmersiva historia de un Joven que se encuentra perdido en su mente. Más no sabe que en su aventura en búsqueda de respuestas<strong> la Lectura lo llevara a liberarse de su mente negativa y sabrá ver las mil y un maravillas que puede encontrarse en los textos que encontrara en su camino</strong>.\r\n</p><p><strong>MECANICA Y FEELING</strong></p><p>El jugador experimenta el sentido de explorar, buscar, interactuar con su entorno en los sitios donde se puede realizar dichas acciones, <strong>siente la experiencia y la vive ya sea de ir en el Mar con la brisa azotando en el personaje, o el regar las plantas y verlas crecer en el libro verde, o el vacío sentimiento de cuidado cuando avanzamos en los caminos estrechos del sector final.</strong></p><p><strong>FOCUS el poder de la mente, destaque desde el primer momento en el que tenemos contacto con nuestro personaje principal el cual, inicia su expresión sentimental en la historia del videojuego (Capitulo 01), podremos ir viendo secuencias en Tiempo real en la historia, y seguir la misión principal, teniendo que buscar y explorar la zona de la Ciudad en la que ocurre la historia.</strong></p><p>Muchas gracias por jugar mi prototipo - FOCUS<br/>Ha sido una gran experiencia el desarrollo de este proyecto, se aprenden cosas nuevas siempre, y ha sido un reto en el plazo de tiempo pero se ha logrado!.<br/>Eduardo Nuñez.</p><p>SERVIDOR ALTERNATIVO:<br/>https://aquariumtravelsgame.com/UFGgame/</p>", "metacritic": null, "released": "2023-03-18", "tba": false, "updated": "2023-03-20T11:03:56", "background_image": "https://media.rawg.io/media/screenshots/a87/a87d31204ad8e313e64d1c719e49b169.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ENA Studios - Eduardo Nuñez"], "genres": ["Adventure", "Educational"], "publishers": [], "esrb_rating": null}