{"id": 944824, "slug": "pick-bonus-sample-casino-game", "name": "Pick Bonus - Sample Casino Game", "name_original": "Pick Bonus - Sample Casino Game", "description": "<p>Sample Casino Pick Bonus Game - made in around a week for a Unity Proficiency Test as part of an interview. Heres the prompt!</p>\n<p>\"<strong> </strong>PROFICIENCY TEST v1.2 (Unity)</p>\n<p><strong>Game - Pick Bonus</strong></p>\n<p>A common bonus round in many slot/casino styled games is a Pick Bonus. This type of “mini-game” allows the player to pick from a finite number of objects that will each have the possibility of awarding a varying amount of money. The player continues to pick until a “Pooper” is selected, which in this case is an empty chest, and that would end the bonus round (and the turn in this case). In this exercise, you will create a simple rendition of this, while managing money and denomination.</p>\n<p><strong>Game Elements</strong></p>\n<p>• Play Button - this button will start each Play.</p>\n<p>• “Current Denomination” Readout - The current money that will be “bet” each Play.</p>\n<p>• Denomination Increase / Decrease Buttons - this will change the Current Denomination.</p>\n<p>• “Current Balance” Readout - Shows the Current Balance.</p>\n<p>• “Last Game Win” Readout - Shows the amount won on the previous turn.</p>\n<p>• Treasure Chests - The objects the player will pick to reveal prizes.</p>\n<p><strong>Mechanics</strong></p>\n<p>• Play Button &amp; Denomination Buttons must be greyed out / disabled during each Play.</p>\n<p>• Increase and Decrease Buttons for adjusting denomination (which updates “Current Denomination” Readout).</p>\n<p>• “Current Balance” readout</p>\n<p>o Starts on $10.00.</p>\n<p>o Denomination should be subtracted each Play Button press.</p>\n<p>• “Last Game Win” Readout</p>\n<p>o Starts on $0.00 and resets to $0.00 on every Play Button Press</p>\n<p>• 9 (3x3) Pickable Treasure Chests</p>\n<p>o Pickable after pressing Play</p>\n<p>o When picked</p>\n<p>1- Show Open Treasure Chest</p>\n<p>2- Display money in that chest (if any)</p>\n<p>3- Add money to the running total in the “Last Game Win” Readout</p>\n<p>4-  Become No longer clickable</p>\n<p>• After the Pooper is picked, add the total won to the “Current Balance” Readout.</p>\n<p>• Reset Treasures Chests / Visuals on every Play Button Press.</p>\n<p>• Disable play button whenever denomination is greater than remaining balance.</p>\n<p><strong>Technical Implementation</strong></p>\n<p>• Denomination has four possible values: $0.25, $0.50, $1.00, $5.00.</p>\n<p>• Valid win multipliers:</p>\n<p>1-  0x (instant loss) - 50% of the time.</p>\n<p>2-  1x, 2x, 3x, 4x, 5x, 6x, 7x, 8x, 9x, 10x - one of these 30% of the time.</p>\n<p>3-  12x, 16x, 24x, 32x, 48x, 64x - one of these 15% of the time.</p>\n<p>4-  100x, 200x, 300x, 400x, 500x - one of these 5% of the time.</p>\n<p>• On pressing the play button, one of the multipliers should be randomly selected with the appropriate frequency specified above.</p>\n<p>• Now you’ll need to figure out the best way to split the total win (given by multiplying the denomination by the multiplier selected) into smaller win amounts. Remember, at least 1 chest must be reserved for the Pooper which means you can only use up to 8 for the win amounts.</p>\n<p>• This is not a “random game” however so, for example, if you decide to have win amounts of $0.50 and $2.00 to give a total win of $2.50 then no matter which chest the player picks first it will contain a $0.50 win and the second one picked will contain the $2.00. The third one picked will be the Pooper. The chests that the player picks do not matter, it’s all predetermined and the chests are simply a way to deliver the win values to the player.</p>\n<p>• All win amounts should be no less than $0.05 increments (e.g. $2.45, $0.70, $12.55).</p>\n<p><strong>Considerations</strong></p>\n<p>• Any graphics can be used.</p>\n<p>• Any flare is nice, like tweens (using DOTween) on win amounts or anticipation on</p>\n<p>“Treasure chests”.</p>\n<p>• Any other creative liberties are encouraged.</p>\n<p>• Imagine playing the game with your own money. If you’re excited to be opening the chests, you’re probably on the right track. If you’re frustrated, bored, or confused when opening chests then you may want to re-think your algorithms. \"</p>", "metacritic": null, "released": "2023-03-17", "tba": false, "updated": "2023-03-20T13:32:47", "background_image": "https://media.rawg.io/media/screenshots/d93/d939610298f0dfa611318f6c096d1251.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["NightModeGames"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}