{"id": 944813, "slug": "gunsuit-guardians", "name": "GunSuit Guardians", "name_original": "GunSuit Guardians", "description": "<strong>Defend Earth from an immeasurable alien invasion in GunSuit Guardians, an action-roguelite twin-stick horde survival.</strong><br/><br/>Take to the skies in an advanced aerial combat suit, wield enormous weapons, and upgrade your gear to become an unstoppable force of destruction.<br/><br/>GunSuit Guardians condenses arcade shooter combat with roguelike elements to create a deep, action-packed experience where each run provides a fresh challenge.<h3>EQUIP</h3><br/>Choose your upgrades and evolve a unique GunSuit build in each run. Create overpowered arsenals of high-tech superweapons that can cut through alien hordes like butter.<h3>ENDURE</h3><br/>Face overwhelming enemy numbers, bring down gargantuan bosses and harvest strange alien artifacts with properties unknown to science. Navigate turbulent skies and atmospheric anomalies in an ever-changing aerial battlefield.<h3>RELOAD</h3><br/>Cash in the spoils of your victories to unlock permanent bonuses, passive abilities and new GunSuits to aid you in future battles. Endless combinations of equipment means you'll never have the same loadout twice.<h3>TAKE CONTROL</h3><br/>Seamlessly switch between auto-aim mode and twin-stick style controls. Play casually and let your weapons do the work for you, or take full control to concentrate your fire on the most formidable targets.<br/><br/><br/><strong>Become the ultimate GunSuit Guardian and protect Earth from annihilation!</strong><br/><br/><h3>Much more planned for Early Access!</h3><ul><li>More levels.</li><li>More GunSuits, weapons and special abilities.</li><li>More enemies and bosses.</li><li>More achievements and unlocks.</li><li>Plenty of polish and refinement.</li></ul>", "metacritic": null, "released": "2023-03-17", "tba": false, "updated": "2023-10-18T00:37:14", "background_image": "https://media.rawg.io/media/screenshots/9aa/9aa89784738ebb59200cd7f4e90ededf.jpg", "website": "https://www.mattglanville.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 8, "toplay": 1}, "playtime": 3, "achievements_count": 27, "ratings_count": 1, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Matt Glanville"], "genres": ["Action", "RPG", "Casual", "Indie"], "publishers": ["Matt Glanville"], "esrb_rating": null}