{"id": 944835, "slug": "everywhere-itch", "name": "Everywhere (itch)", "name_original": "Everywhere (itch)", "description": "<p>Everywhere is a small horror game made during the Global Game Jam 2023 on the theme \"Roots\".</p>\n<p>We had three days to make a project on this theme. </p>\n<p>We chose to make a small horror game where roots would chase the player in a cramped tunnel.</p>\n<p>The tunnel would occasionally open up into larger rooms to sometimes give the player time to breathe and sometimes force them to make choices for their survival. </p>\n<p>We tried to create fake tunnels with roots in them to catch the player. The player has to run away and backtrack to find the right tunnel. </p>\n<p>We also added an enemy that lurks in the tunnels and can catch you, you have to avoid it at all costs to hope to reach the exit.</p>\n<p>In terms of gameplay, the player can move and turn the camera. He can also turn on certain lights at specific points that symbolize safe zones where he knows he will not be attacked. There are also QTE's where the player has to spam a button when he gets caught by roots. The aim is to increase the stress when he can't move anymore. To do this, he can also crouch down to pass certain tunnels, which also slows him down. </p>\n<p>For the atmosphere, we used black and white to play with light contrasts to reinforce the idea that the player is trapped in a narrow tunnel. The sound effects and the music help to amplify this oppressive atmosphere.</p>\n<p>Because of the Game Jam, we didn't have enough time to finish everything we wanted to do. Overall we are happy with the game but there are some balancing issues that make it a bit hard to finish. It is difficult to avoid the enemy towards the end. </p>\n<p>Translated with www.DeepL.com/Translator (free version)</p>", "metacritic": null, "released": "2023-03-17", "tba": false, "updated": "2023-03-20T13:38:48", "background_image": "https://media.rawg.io/media/screenshots/784/784216d5e59d1d46c31c9667ea2ee6ea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Samuel Rouault"], "genres": ["Action"], "publishers": [], "esrb_rating": null}