{"id": 944958, "slug": "ghosts-of-tabor", "name": "Ghosts of Tabor", "name_original": "Ghosts of Tabor", "description": "<h3>SURVIVE &amp; STAY ALIVE</h3>Survival systems like health/hunger/thirst and needing to eat/heal to stay alive.<br/><h3>EXPLORE, LOOT &amp; SHOOT</h3>Large maps that allow for multiplayer exploration, looting, intense shoot-outs, snipers.<br/><h3>UPGRADE YOUR ARSENAL</h3>Trading with vendors AI and P2P to attain better gear, make money, and craft equipment.<br/><h3>AMAZING ENVIRONMENTS</h3>Experience amazing VR maps like Island of Tabor and Missile Silo at Closed Beta Launch.<br/><h3>2023 PUBLIC ROADMAP</h3><br/><br/>Ghosts of Tabor is the only extraction based VR FPS PvPvE survival game<br/>where you will have to use your wits, skills and resources to survive. Inspired by games<br/>such as Escape from Tarkov and Day Z, the game features a variety of scenarios from<br/>scavenging, looting to crafting. Make your safehouse your own by building your<br/>personal collection weapons and gear to display in your armory.<br/>Ghosts of Tabor is packed with features for unlimited replayability including:<br/>● Simultaneous PVP and PVE - Avoid both players and armed AI<br/>● Scavenge for a wide variety of loot such as gear, weapons, attachments, ammo,<br/>medical, food and water<br/>● Squad up or go at it alone in the world's most dangerous looting grounds<br/>● Make your way to your extraction point to get out with your life and your gear.<br/>● Customize weapons and craft items<br/>● Craft ammo of different types and sizes<br/>● Variety of weapons ranging from handguns to assault rifles<br/>● Huge armory to display your arsenal of weapons, armor, and gear<br/>● Choose your load out carefully<br/>● Visit the marketplace to source anything you may need for your next raid<br/>● Complete missions with vendors to unlock special goods<br/>Choose your playstyle from guns-a- blazing or take a stealthy approach. It’s up to you to<br/>find a way to escape Tabor alive. Can you survive the Ghosts of Tabor?", "metacritic": null, "released": "2023-03-20", "tba": false, "updated": "2023-03-24T03:19:10", "background_image": "https://media.rawg.io/media/screenshots/71b/71bf986d59ada2d4bf170042d3796ed4.jpg", "website": "https://ghostsoftabor.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9, "toplay": 2}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Combat Waffle Studios"], "genres": ["Action"], "publishers": ["Beyond Frames"], "esrb_rating": "Mature"}