{"id": 94496, "slug": "sole-itch", "name": "Sole (itch)", "name_original": "Sole (itch)", "description": "- - - - Coming Soon - - - -\r\nAll pre-orders will include Steam keys upon release\r\n\r\nUncover the secrets of a world lost in shadow . . .\r\n<p>Sole is an abstract adventure game where you play as the only source of light in a world shrouded in darkness. Wander through uninhabited environments, painting the land with light as you uncover its mysterious past. Explore the remnants of great cities and discover the history of an ancient civilization on your journey to restore life to an abandoned world.<br/></p>\n<p>Inspired by our personal experiences as new artists and developers, Sole is built on the feeling of wandering through the dark trying to figure out who you are, where you are, and what your purpose is. Expanding on the ideas of aesthetic-driven games like Flower, The Unfinished Swan, and Proteus, our goal is to create a dreamlike adventure that captures the sensation of being lost in an unfamiliar place.</p>\n<p>Get a sneak preview of the full game with our alpha demo builds below. As a brand new indie team, we would absolutely love to hear what you think! Please drop us a line here in the comments or over on Twitter, Facebook, or Discord.</p>\n<p><strong>Please Note:</strong><br/>These demo builds have yet to be fully optimized and may not play very well on your machine. You can adjust a handful of visual effects in the settings to improve performance, but if the game still chugs a little, know that there are a lot of optimization tricks we haven't got around to implementing just yet.</p>", "metacritic": null, "released": "2017-08-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/43a/43a13b4aabc79265ee528437849b0a62.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Gossamer Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}