{"id": 944944, "slug": "kinkinc-18", "name": "Kink.inc [18+]", "name_original": "Kink.inc [18+]", "description": "<p>The Kinkverse is yours, Vice Mayor!<br />\nWith an army of hot, loyal girls on staff, you are on the climb for political power and panty-dropping piles of cash. Run an empire of sex toys as you handle every lubed up mess your kooky mayor creates, and explore thematic universes to seduce more sexy babes.<br />\nIt&#39;s all sex with benefits! As the suave Vice Mayor Dick Ruff, maneuver through a series of dirty schemes and kinky deals and kickstart your lucrative sex-fueled empire. You are a rising political figure who’ll do just about anything to make a name for yourself as A Dick You Can Trust.<br />\nMoney, success, and power are just a few thrusts away!<br />\nThis saucy idle clicker is bathed in neon-signs, hot women, and more cold hard cash than your sexy assistants can account for. Grow your reputation in the incredibly lewd main storyline and impress the ladies in their personal interactive sex stories. You decide how your sexual conquests play out!<br />\nWeekly events take place in the Kinkverse. Explore wonky alternate timeline stories:<br />\nExplore the galaxy aboard The Enterpussy in Cosmic Sexploration<br />\nRule the wasteland as the Barons of Lube in Fury Load<br />\nBe the secret werewolf in a den of vampires in the deliciously devious Love Bites<br />\nHire new babes for your homeworld in Election.<br />\nExperience the luxurious trappings of power with Kink.inc as you build, upgrade, and run businesses, meet hot new contacts, and expand your network of influence.<br />\nKey Features<br />\n300+ Interactive Sex Stories<br />\n300+ Uncensored Sex Scenes<br />\n100+ Unique Girls to Seduce and Upgrade<br />\n13 Cash Generating Buildings<br />\nCompetitive Weekly Events<br />\nChoose Your Approach</p>", "metacritic": null, "released": "2023-03-20", "tba": false, "updated": "2023-07-20T09:15:37", "background_image": "https://media.rawg.io/media/games/c95/c95866a8c59ae3e19950aab47e2cafe6.jpg", "website": "https://tendertroupe.com/kink-inc/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 37, "toplay": 5}, "playtime": 1, "achievements_count": 7, "ratings_count": 1, "suggestions_count": 251, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Tender Troupe"], "genres": ["Casual"], "publishers": ["Tender Troupe"], "esrb_rating": "Adults Only"}