{"id": 944924, "slug": "nefastos-misadventure-meeting-noeroze", "name": "Nefasto's Misadventure: Meeting Noeroze", "name_original": "Nefasto's Misadventure: Meeting Noeroze", "description": "<strong><h3>Good news! The final version of Nefasto's Misadventure will be available on Steam on March 24, 2023. </h3></strong><br/>Until March 24th, you can still enjoy the early access version. <br/>It contains a reduced portion of the game, which does not yet benefit from the latest patches and improvements. It is therefore not representative of the final version of the game. <br/><br/><strong><h3>A Point'n Click adventure in the central unit of your computer.</h3></strong><br/>Bottle-fed with binary code, a hazardous aggregate of 0s and 1s, Nefasto is a game data, of a very bad game even. A bug generated by the appalling work of its developers brings down the world in which it lived. While the System purges his game, Nefasto manages to escape in extremis, armed with his sarcasm and his code... a very mediocre one at that!<br/>A countdown starts suddenly: here he is prisoner of your computer! Its corrupted code is compromising your system which is about to crash! No repairman on the horizon... we're counting on you to save the day!<h3>A zany race against the clock! </h3><br/>You don't have much time to get rid of Nefasto before the fateful crash. Your mission? To guide him through a strange and unusual world, while solving the problems he encounters... or creates, most of the time! Helped, or not, by the natives, each more eccentric than the other.<br/>Many branches will lead you to the elimination of the problem in order to stabilize your computer. Of course, Nefasto would prefer a solution that would keep him alive... But, between us, that's not mandatory.<br/><br/><ul><li>Guide Nefasto in a unique universe where nobody minds breaking the fourth wall.<br/></li><li>Characters with colorful looks and language, with their own way of getting in the way of Nefasto.<br/></li><li>A group of entities called Bytes, ready to share their Binary Powers, but only if they are in a conciliatory mood.<br/></li><li>Hard-working bosses busy corrupting the system and hurting Nefasto!<br/></li><li>Puzzles to solve and obstacles to overcome, with the help of items or Binary Powers. Or a walkthrough. We don't judge anyone.<br/></li><li>An adventure full of twists and turns... you will be amazed!<br/></li><li>Multiple endings, including lots of happy ones… but maybe not for everyone!<br/></li><li>You can jump, but pretend you were told nothing once you get to the tutorial.<br/></li><li>The game can be played with a mouse (unless you’re scared of mice) or a gamepad.<br/></li><li>53 Steam achievements… gotta catch them all!</li></ul>", "metacritic": null, "released": "2023-03-23", "tba": false, "updated": "2023-03-24T02:38:30", "background_image": "https://media.rawg.io/media/screenshots/ab0/ab00dfc7c1da1e6f9faf605ea991fe22.jpg", "website": "http://www.auroragamestudio.com/page/Nefasto%20Misadventure%20Meeting%20Noeroze", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aurora Game Studio"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Pix'n Love Games"], "esrb_rating": null}