{"id": 944948, "slug": "crossroads-escaping-the-dark", "name": "Crossroads: Escaping the Dark", "name_original": "Crossroads: Escaping the Dark", "description": "Elephant Games AR presents the first stunning sequel in the frightening new series with Crossroads: Escaping the Dark<br/>\n<br/>\r\nCrossroads is open for business once again, and Mistress Eve is back, serving up guidance as only she can! When a gamer wanders through the door fresh from a therapy session, our mysterious bartender offers a collection of special video games custom-designed to help them learn to overcome an array of phobias and anxieties that have plagued them for years. Make your way through three tales of terrifying horror as you help them cope with their traumatic past and deal with their fears, but be careful because when you’re at Crossroads, your choices matter! Will the troubled traveler learn a life lesson or crack under the pressure? The choice is yours in this reality-warping Hidden-Object Puzzle Adventure game!<br/>\n<br/>\r\nThis is a Hidden Object Puzzle Adventure game, meaning a specific genre of story-driven, point &amp; click adventures. Throughout the game, players are tasked to find a list of objects hidden within a particular scene, and to occasionally complete various mini-games/puzzles.<br/>\n<br/>\r\nBullets:<br/>\r\n•\tReplay previous chapters to explore alternate story paths!<br/>\r\n•\tGuide a troubled gamer through three spine-tingling stories!<br/>\r\n•\tExperience a game where your decisions matter!", "metacritic": null, "released": "2023-03-20", "tba": false, "updated": "2023-03-24T03:08:03", "background_image": "https://media.rawg.io/media/screenshots/bba/bba0cd0be8d317d6c8c1e37b2d95ce9f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 573, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Elephant Ar"], "genres": ["Adventure", "Casual"], "publishers": ["Big Fish Games"], "esrb_rating": null}