{"id": 944927, "slug": "house-of-jigsaw-masters-of-art", "name": "House of Jigsaw: Masters of Art", "name_original": "House of Jigsaw: Masters of Art", "description": "Imagine yourself being in the greatest musea by solving the Jigsaw Puzzles of master artists like Monet, Haring, Kadinsky, Hokusai, Rousseau and Rembrandt. All major art style are represented in more dan 100 high quality puzzles. Enjoy the modern UI and 4 difficulty levels (30/120/300/600 pieces).<br/><br/><br/><br/>Jigsaw Puzzlers who have a passion for Art can now combine both hobbies with the House of Jigsaw Masters of Art. Create the most wonderful paintings with the greatest works of art in existence. From Da Vinci and Van Gogh to Botticelli and Hokusai. Choose from different categories, such as classic Masterpieces, Abstract, Watercolor and Contemporary art. Enjoy all great painting without the need to travel the world for all the famous musea. Experience the paintings by solving the puzzle and find details you have never seen before.<br/><br/><br/><br/><ul><li> Choose from four categories: Masterpieces, Abstract, Watercolor and Contemporary<br/></li><li> Different puzzle levels (30/120/300/600 pieces)<br/></li><li> Use your solved puzzle as a screensaver or wallpaper<br/></li><li> Pick up where you left off thanks to the auto-save function<br/></li><li> Artists like: Monet, Munch, Haring, Rousseau, Kadinsky, Hokusai, Rembrandt</li></ul><br/>", "metacritic": null, "released": "2023-03-23", "tba": false, "updated": "2023-03-24T02:42:50", "background_image": "https://media.rawg.io/media/screenshots/d09/d092c0891af0e11b789154539e921e2e.jpg", "website": "https://denda-corporate.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Graphium Studio"], "genres": ["Adventure", "Casual"], "publishers": ["Denda Games"], "esrb_rating": null}