{"id": 945014, "slug": "venus-the-flytrap-2023", "name": "Venus the Flytrap (2023)", "name_original": "Venus the Flytrap (2023)", "description": "Originally released in 1990 for the Commodore Amiga and Atari ST computers, this side-scrolling platformer/shoot-em-up hybrid from prolific British developers Gremlin Graphics saw players take on the role of a robotic fly, tasked with saving the world from hordes of mutant cybernetic killer insects - the result of a disastrous attempt to restore the planet's ecological balance after the extinction of all insect life. Now, relive those days in this remastered emulated version.<br/><br/>This is an emulation of the Commodore Amiga version of the game.<h3>Gameplay</h3>Jump and shoot across 10 exciting worlds, each with 5 platforming levels. Collect powerups from defeated enemies that can give you anything from faster speed or an extra life, to one of an array of powerful weapons. As you fly from world to world, experience bonus side-scrolling shoot-em-up levels - try to collect as many points as you can! Also, hidden around the worlds are 20 secret rooms - look for the doors to them in obscure places...<br/><br/><br/>This enhanced version introduces a number of modern features to this retro classic, including:<br/><br/><ul><li> Saving/loading the game at any point<br/></li><li> Support for most modern game controllers<br/></li><li> Full control remapping<br/></li><li> Image scaling and smoothing options</li></ul>", "metacritic": null, "released": "2023-03-23", "tba": false, "updated": "2023-03-24T04:37:07", "background_image": "https://media.rawg.io/media/screenshots/7be/7bebb68c71e43474436ac3e67a558976.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gremlin Graphics"], "genres": ["Action"], "publishers": ["Pixel Games UK"], "esrb_rating": null}