{"id": 945084, "slug": "puff-3", "name": "Puff", "name_original": "Puff", "description": "<p>Puff is a beautiful lo-fi particle physics based arcade experience by Woodshed games built within the Godot engine. Enjoy a variety of game modes (starting with 3), as we update and play with the engine to get to know what we can do with it and try new features out for later titles! If you like this game,     Feel free to buy the developers a coffee! or donate here, and stay up to date with us and our upcoming projects on our Homepage. </p>\n\n<p><strong>Help us learn</strong>\n</p>\n<p>Our developer is  self taught, so we would love your input on gameplay balancing, game mode, the whole experience, etc. we have a long pipeline of game ideas and every update, every itteration and improvement is experience under our belt that helps ensure our future titles are even cooler than we thought was going to be possible when they started. </p>\n<p> \r\n</p>\n<p><strong>Instruction Manual:</strong><br/></p><p>Classic - catch the boxes as they fall, each missed box adds to your penalty counter until game over when you hit -1. </p><p>Bounce - Keep your eye on and Bounce the ball till you become overwhelmed by the enviroment and reach -1.</p><p>sandbox - toy with the particles and adjust the speed scale and see how it affects the sim. click to drag the cloud left and right, 'wasd' or joystick to move the little ball I put there.</p>", "metacritic": null, "released": "2023-03-23", "tba": false, "updated": "2023-03-24T05:35:19", "background_image": "https://media.rawg.io/media/screenshots/da5/da5f9cf060d31f498e10239d381792a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WoodShed_Games"], "genres": [], "publishers": [], "esrb_rating": null}