{"id": 945002, "slug": "puttzzle", "name": "PUTTZZLE", "name_original": "PUTTZZLE", "description": "You have only one objective in this game; <strong>Putt your ball into the hole.</strong><br/>In order to do so, you will be given two items in this game: a hammer and a heavy ball. <br/><br/>Putt the ball into the hole to complete the stage. <br/>Roll the ball freely on a puzzle-like map.<br/><br/>Also, various terrains or objects can be used or even passed to complete the stage. <br/>You can try using any method to complete the stage within the given opportunities. <br/><br/><strong>[Intuitive controls]</strong><br/>Just putt the ball into the hole by any means; PUTTZZLE is just simple as that. <br/>Even if you are unfamiliar with VR games, you can enjoy PUTTZZLE by just swinging the hammer!   <br/>It is super easy to enjoy because it requires no other controls.<br/><br/><strong>[Increasing difficulty level]</strong><br/>PUTTZLE takes work. Once you finish each stage, you will experience more difficult stages with even more obstacles.<br/>From the flat ground, uphill, downhill, wooden boards, to jump ramp or lava, you name it.<br/>Sometimes these objects are favorable, but they also can get you in trouble.<br/><br/><strong>[Simple &amp; cute graphics]</strong><br/>The game maps of PUTTZZLE are composed of cute design blocks. With simple yet vibrant colors, you won't get tired of playing it repeatedly.<br/><br/>1) Choose the direction and swing the hammer. Sometimes, the ball does not roll as you intend. However, setting the ball's direction will dramatically assist you in reaching the goal.<br/><br/>2) Resistance varies depending on the type of cubes.<br/>Check the type of cubes; for example, wooden cubes, grass cubes, soil cubes, etc., and roll the ball for the best outcome!<br/><br/>3) Utilize the unique cubes.<br/>Breakable glass cubes, hard-to-roll sand cubes, and bouncing springy cubes are unique cubes that could be helpful or painful during gameplay. <br/><br/>4) Objects can be your ally or enemy. <br/>Try to take an advantage of jump ramps that float the ball higher, magnets that pull or push the ball, and portals that transport the ball somewhere.<br/><br/>5) Whether to hit the ball forcefully or gently or whether to use special cubes or objects, you are the pathfinder in this game!", "metacritic": null, "released": "2023-03-22", "tba": false, "updated": "2023-03-24T04:19:26", "background_image": "https://media.rawg.io/media/screenshots/22a/22abbc95b5f1108b1bf76e5b62241872.jpg", "website": "https://pixelitygames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pixelity Gamelab"], "genres": ["Sports", "Casual", "Indie"], "publishers": ["Pixelity Games"], "esrb_rating": null}