{"id": 945028, "slug": "vom-drachentoten", "name": "Vom Drachentöten", "name_original": "Vom Drachentöten", "description": "\"Salutatio, Fremde!\"<br/>\"Ihr habt erreicht uns're Oase.\"<h3>Worum es geht</h3><br/>In der drückenden Wüstenhitze des Protektorats ziehen Drei aus, einen Drachen zu töten: <br/>Nare Nivadh. Illum. Lambda des Morgens Rot. Ein jeder trägt eine eigene Motivation, eigene Erfahrungen, einen eigenen Konflikt in seinem Inneren. Und auch das Land selbst rumort unter der Tyrannei des Wurms ... Wissen, Waffen, Fertigkeiten: Nun gilt es, die Kraft zu finden, vor der sich selbst ein Drache beugt!<h3>Wie es sich spielt</h3><br/>Ein textlastiges JRPG, reduziert auf seinen Kern.<br/><br/><ul><li><strong>Eine runde Geschichte.</strong> Etwa 4 Stunden, ganz ohne Sammelquests oder Grinding.<br/></li><li><strong>Erkundung mit Charakter.</strong> Eine lebendige Oase voller Geschichten. Ein ruiniertes Land uralter Geheimnisse, die es zu lüften gilt.<br/></li><li><strong>Fordernde Kämpfe.</strong> Jeder Charakter hat seine Rolle. Jede Aktion und jeder Erfahrungspunkt können entscheiden.<br/></li><li><strong>Taktik mit Effekt.</strong> Eine überschaubare Selektion an Fähigkeiten und Gegenständen, die es zu meistern gilt.<br/></li><li><strong>Konsequenzen.</strong> Jedes Risiko birgt Möglichkeiten ... und Gefahren!</li></ul><h3>Wie es entstanden ist</h3><br/>Dieses Erstlingswerk ist auch ein Experiment: Gelingt es, ein stilvolles, einnehmendes Rollenspiel nur mit den Ressourcen des RPG Maker MZ zu erschaffen? Um dieses Ziel zu erreichen, versucht sich das Spiel an einer ungewöhnlichen Sprache, inspiriert von den Dramen der Weimarer Klassik.<br/><br/><strong>This game is only available in German, for now.</strong>", "metacritic": null, "released": "2023-03-23", "tba": false, "updated": "2023-03-24T04:59:58", "background_image": "https://media.rawg.io/media/screenshots/abc/abccd4aad74004d64f232f589c726eb7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Zwiebelspiele"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Zwiebelspiele"], "esrb_rating": null}