{"id": 945020, "slug": "athenian-rhapsody-thunder-goobers-personality-dung", "name": "Athenian Rhapsody: Thunder Goober's Personality Dungeon", "name_original": "Athenian Rhapsody: Thunder Goober's Personality Dungeon", "description": "<ul><li><strong>certain hidden challenges will unlock secret types of Tokens</strong>, too...</li><li><strong>Your Token will be redeemable in Athenian Rhapsody's full game!</strong> - In the future, you'll be able to redeem your Tokens for rewards in ARhap's full game. This may come in the form of <strong>exclusive armors or other in-game items</strong>, or maybe even <strong>special marks on your Rhapsodies</strong>! Only time will tell...</li><li><strong>Thunder Freaking Goober, baby!</strong> - This game is all about Thunder Goober... You'll see <strong>many different sides of this wacky wizard</strong> throughout your experience, and maybe you clever players will <strong>discover a bit of wizard lore</strong>! Regardless, you'll have to <strong>piece everything together in Athenian Rhapsody</strong> later on.</li></ul><br/><br/><br/>The common goal of Athenian Rhapsody and Thunder Goober's Personality Dungeon is to provide a real, impactful experience for everyone who plays it. There's something for everyone and I hope that every player can relate to their story somehow, and maybe even reflect on their own lives. Remember to have fun, it's a game!<br/><br/><br/><br/>Similar to a Rhapsody, <strong>every decision, action, and event that takes place during a playthrough is recorded into your Token</strong>! Thunder Goober's Personality Dungeon may be small, (wizard budget cuts) but there's <strong>absolutely no shortage of individuality</strong> between two player's tokens. The information contained in a Token ranges from <strong>your battle stats</strong> as well as <strong>the status on any stomach issues your character has</strong>.<br/><br/><br/><br/><br/>As much as we may pray and hope, Thunder Goober is <strong>NOT real</strong> and <strong>DOES NOT</strong> exist in real life. He is <strong>definitely not filling out the description</strong> for this game, either! Regardless, <strong>you most likely should still be afraid of him to a reasonable degree</strong>.<br/><br/><br/><br/><br/><br/>While your real name might truly be <strong>(Insert Name)</strong>, and your character in Thunder Goober's Personality Dungeon is also named <strong>(Insert Name)</strong>, often Thunder Goober will refer to you as <strong>Cornball</strong>. This is simply due to the fact that <strong>Thunder Goober's wizard brain is completely fried</strong> and he sees reality in a different way than you or I might. <br/><br/>This is nothing to be concerned about! I believe somewhere, sometime long ago a human named Cornball may have made an impact on Athens, or... Maybe you're Cornball? Who knows! Just keep in mind that he means well.<br/><br/><br/><br/>", "metacritic": null, "released": "2023-03-23", "tba": false, "updated": "2023-03-26T21:56:39", "background_image": "https://media.rawg.io/media/screenshots/4ee/4ee162d2b740c7ad7b374fe2f1b9c2dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "toplay": 1, "playing": 1}, "playtime": 0, "achievements_count": 10, "ratings_count": 1, "suggestions_count": 296, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Nico Papalia"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Top Hat Studios"], "esrb_rating": null}