{"id": 945019, "slug": "zombie-watch-part-ii", "name": "Zombie Watch Part II", "name_original": "Zombie Watch Part II", "description": "Welcome to the world of Zombie Watch Part II! <br/>You have been extremely lucky so far. You survived a virus that has infected most of the population and turned them into flesh-eating zombies. They may be dead but they are still walking and will come after you. There are no rules - do what you need to do to survive!<br/><br/>Zombie Watch Part II is a first-person, open-world survival game in a post-apocalyptic world with zombies and wildlife. Gather, mine, scavenge for resources, and take your base - which is totally safe and fenced this time - to the next level. You have nothing left which is why you have to go on raids to different parts of the world for resources, food, water, and more. On each of these runs, you will need to carefully decide what will you be bringing home with you, that is - if you make it out alive. Whatever useful stuff you find you can sell to the traders and buy what you need in order to survive. Enjoy the adventure!<br/><br/><br/><strong>STORY</strong><br/><br/>You live in a post-apocalyptic world ruled by bloodthirsty zombies. They can smell you from the distance, hear every step you take, and will make you their one and only target once they spot you. While living in a secure base you really have nothing else left. Because of your actions from the past you were left behind and do not belong anywhere and never will. You are your only hope for survival. While going on resource runs you also have to attend to your basic human needs. It would be a shame if you perished from starvation or thirst. Choose your destinations wisely and get the most out of each resource run you take.<br/><br/><strong>FEATURES</strong><br/><br/> You can explore a fragmented world. Travel between different zones.<br/><br/><strong>- Inventory system</strong><br/><br/>  Find or craft different items, weapons, food, and other equipment to carry on you at all times.<br/><br/><strong>- Food and water system</strong><br/><br/>  You have basic human needs and you need food and water.<br/><br/><strong>- Crafting</strong><br/><br/>  Find or craft your own weapons and armor. Cook, scavenge, gather, mine ore, chop down trees, and much more.<br/><br/><strong>- Exploration</strong><br/><br/>  Explore the surroundings of the living, breathtaking world and gather food and items. Everything can come in handy.<br/><br/><strong>WEAPONS</strong><br/><br/> A large variety of weapons e.g. pistols, assault rifles, shotguns, sniper rifles, crossbow, bow, swords, axes, shields, knives, and much more. All of these items can be found or crafted at your crafting stations. You will be able to craft or find ammo.<br/><br/><strong>BASE BUILDING</strong><br/><br/>Chop down trees, mine, and refine different kinds of ore or metal. Scavenge for provisions or grow your own food. Create a base and craft your own gear.", "metacritic": null, "released": "2023-03-23", "tba": false, "updated": "2023-03-24T04:47:26", "background_image": "https://media.rawg.io/media/screenshots/2f3/2f35801005e144341888033d112f058f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 497, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wildlak"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Wildlak"], "esrb_rating": null}