{"id": 945027, "slug": "story-of-the-olivia", "name": "Story of the Olivia", "name_original": "Story of the Olivia", "description": "<strong>Story</strong><br/><br/>Olivia Carter immigrated west from Europe to her family, unaware of what was going to happen to her.<br/>she has to earn money to survive.<br/><br/>Join olivia's story and uphold the law. As you take on missions, the story will expand and you will find yourself in the adventure.<br/><br/><strong>Regions</strong><br/><br/><strong>Wild West</strong><br/><br/>These townspeople are kind of weird. Meet with the sheriff. The sheriff is largely responsible for the security of the town.<br/>Help an old and mysterious man Charlie and the desperate Oliver who is waiting for help and get involved in the story of the mysterious town.<br/><br/><strong>Mysterious Town</strong><br/><br/>A town free from all threats and its surroundings sheltered from bandit attack.<br/>Featuring the strange stories and quests of certain people for help against bandits.<br/>A mysterious environment awaits. Complete the quests and join the adventure.<br/><br/><strong>Weapons:</strong><br/><br/><ul><li>Rifle<br/></li><li>shotgun<br/></li><li>Revolver with 3 types and different styles<br/></li><li>hunting knife<br/></li><li>ax<br/></li><li>Rocket (Walls can break)</li></ul><br/><br/><br/><strong>Tasks:</strong><br/><br/><ul><li><strong>Fortress Raid</strong> (Take this fortress, the bandit's greatest defense and venue)<br/><br/></li><li><strong>Old Indian</strong> (A group of gangs ambushed an old Indian and his family. Investigate the case)<br/><br/></li><li><strong>Toxic Mine</strong> (Kill these thugs who are mining poison mines for money making and restore security)<br/><br/></li><li><strong>Train Raid</strong> ( Bandits ambushed the train and destroyed the train track. You must kill them and ensure safety)<br/><br/></li><li><strong>Billy the Kid</strong> (Find this famous and terrifying man before he finds you dead or alive)<br/><br/></li><li><strong>Bear Invasion</strong> (Many bears invading the forest in the north harm Humans.Kill the bears)<br/><br/></li><li><strong>Mining Quest</strong> (Help the family trapped in the mining factory)<br/><br/></li><li><strong>Lost tomb</strong> (you have to find the tomb of someone named Oscar mentioned by a mysterious elder)<br/><br/></li><li><strong>Factory Road</strong> (The biggest source of income is in the hands of bandits. Recapture the Factory)<br/><br/></li><li><strong>Save from Execution</strong> (A group of gangs is about to kill a person they hold responsible for the death of one of their families. Investigate the case.)<br/><br/></li><li><strong>Lost Ring</strong> (Barbara mentions a ring that belonged to her sister. You have to find it and return it to Barbara)</li></ul>", "metacritic": null, "released": "2023-03-23", "tba": false, "updated": "2023-03-24T04:58:53", "background_image": "https://media.rawg.io/media/screenshots/4ae/4ae7e0349dc0191ef4eaaa670f1cbc07.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 511, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mavi Game Studios"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Mavi Game Studios"], "esrb_rating": null}