{"id": 9452, "slug": "aurora-dusk-steam-age", "name": "Aurora Dusk: Steam Age", "name_original": "Aurora Dusk: Steam Age", "description": "Aurora Dusk looks like a lot of games but instead of being alone, you live in a community. You play a single villager and evolve in a dynamic world.<br/>- <strong>Create and improve your character in a fantasy world</strong>. Your skills will evolve according to your actions. You can choose either to play an archer/a mage/etc. or play them at the same time.<br/>- <strong>Develop your village through 6 ages from prehistoric age to industrial age</strong>. Build defenses and barracks. Order your armies and annihilate the enemy.<br/>- <strong>Plant and collect many resources</strong>: wood, iron, wheat, wool, meat… Use your workshops like mill or market to transform your resources and manufacture your equipment.<br/><br/>– <strong>A simulation game</strong>: In Aurora, you control a character able to plant and harvest resources. Building workshops, you manufacture these resources and make your equipment. The game has over 20 resources : animal, vegetable and mineral. Plant trees, wheat fields, raise pets and prospecting iron, gold or sulfur ore.<br/>– <strong>A sandbox game</strong>: Configure the game as you want. Playing a short game of 5 minutes or 5 hours. Play with few characters or play in huge with lot of characters. Choose the field, the resources, the number of allies, enemies…<br/>– <strong>A role playing game</strong>: You can create and customize your character from 7 playable races. You have more than 70 skills. Throughout the game, you gain experience and increase your character level. Each skill have an experience gauge. You can both specialize in one profession or in all activities. There is no level limit and you can make and remake all game modes with the same character.<br/>– <strong>A strategy game</strong>: Build barracks, defense turrets and recruit soldiers who obey your orders. There are gigantic golems too. You move through five ages from wooden club to firearms.<br/>– <strong>A survival mode</strong>: In this game mode, you must fight off the assault of monsters. You will not be alone because many of artificial intelligences have the same capabilities as your character will help. Your character cannot build defenses networks alone. Protect your allies and collaborate to defeat hordes of invaders.<br/>– <strong>A skirmish mode</strong>: In this game mode, you can play against other villages. This time, you’re an invader and you must destroy the opponents defenses. Crush your enemies with armies or with golems.<br/>– <strong>A custom game</strong>: All game data in readable text files. Any image editor lets you create your own graphics and maps. It is possible to create mods and add content made by the players.<br/><br/>– 6 ages from prehistoric age to industrial age.<br/>– 7 playable races.<br/>– 270 items.<br/>– 72 skills.<br/>– 55 buildings.<br/>– 24 resources to collect and transform.<br/>– 20 missions with 6 difficulty levels.<br/>– a skirmish mode to fight up to 8 villages.<br/>– a custom survival mode to fight off unlimited waves of monsters.<br/>– 43 maps.", "metacritic": null, "released": "2016-04-28", "tba": false, "updated": "2019-08-28T22:14:58", "background_image": "https://media.rawg.io/media/screenshots/3fb/3fb36eeade6b76d6f85931f4e08a5678.jpg", "website": "http://www.aurora-dusk.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 21, "toplay": 1}, "playtime": 6, "achievements_count": 31, "ratings_count": 3, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Sylvain Harlaut"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Sylvain Harlaut"], "esrb_rating": null}