{"id": 945269, "slug": "deadly-truck", "name": "Deadly Truck", "name_original": "Deadly Truck", "description": "Deadly Truck\r\nGameplay\r\n<p>Deadly Truck is a fast-paced, 2D pixel art game where you control a heavily armed truck and must survive against waves of zombie chords. Your vehicle can only turn left or right, but you have a turret on the roof that can rotate and shoot in all directions. As you progress through the game, you can upgrade your vehicle to become stronger and faster, but the zombies will also become smarter and more organized, making each wave more challenging than the last.</p>\r\nStory\r\n<p>In the year 2026, a deadly virus had spread across the world, turning people into mindless zombies. The streets were filled with abandoned vehicles, and the only way to survive was to keep moving. You are the driver of a powerful truck that has been modified to survive in this post-apocalyptic world. Equipped with a turret on the roof, you must navigate through waves of zombies that come at you from every direction.</p>\n<p>As you drive through the desolate city, you notice that the zombies have formed into organized chords, moving in unison towards your truck. With your quick reflexes, you dodge and weave between them, firing your turret in all directions. Between waves of zombies, you have a brief moment to upgrade your vehicle. You invest in stronger armor, more powerful weapons, and faster engines to outrun the zombie chords.</p>\n<p>As you progress through the game, you notice that the zombies are becoming smarter, forming more complex chords that are harder to dodge. The game becomes more intense, as the waves of zombies become more frequent and harder to defeat. You are constantly on the edge of your seat, trying to survive for as long as possible. The game is infinite, and the zombies never stop coming. But you are determined to survive, to upgrade your vehicle, and to defeat every wave of zombies that comes your way.</p>\n<p>As you reach higher levels, you become a legend among the survivors. Your name is whispered in hushed tones, as the survivors gather around campfires and share stories of your bravery. In the end, you know that the zombie chords will always be there, waiting for you. But with your trusty truck and your powerful turret, you are ready to face any challenge that comes your way.</p>\r\nControls\r\n<ul><li>Use mouse to rotate turret, shoot and navigate through menus;</li><li>Use A/D keys to rotate while moving.</li></ul>", "metacritic": null, "released": "2023-03-23", "tba": false, "updated": "2023-03-24T07:02:09", "background_image": "https://media.rawg.io/media/screenshots/98c/98cef6d2b3fd4c08058833090b1d680a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["nerdError", "Sima Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}