{"id": 945352, "slug": "trembling-essence-demo", "name": "Trembling Essence Demo", "name_original": "Trembling Essence Demo", "description": "<p><strong>Trembling Essence is a horror game/dating sim visual novel which focuses on survival. </strong>You're choices will lead to multiple different endings while learning more about not only Noah and the swamp, but everything else surrounding it.<br/></p>\n<p>You wake up lost in the swamplands within a large forest. The sense of time is lost on you while the full moon is your only guiding light.  At some point you can choose to receive help from Noah. He's a native of the swamp and has vast knowledge that will aid you in your survival. If you choose to go with him, he'll take you to his dreary and desolate cabin. He just wants to keep you safe and take care of you but there's a lot more to him than he lets on. It's up to you to make certain choices to survive to the end even if it means taking <strong>extreme risks</strong>. </p>\n<p><strong>=This demo will include the following range of triggering topics=</strong></p>\n<ul><li>-Drowning</li><li>-Audio hallucinations and visuals </li><li>-Violence</li><li>-Manipulation</li><li>-Shaking screen</li><li>-Graphic descriptions of death</li><li><strong>(More will be added once the full game is released.)</strong></li></ul>\n<p>If at any point you are feeling overwhelmed during gameplay, <strong><em>please </em></strong>take care of yourself and close the game.</p>\n<p>The full game is still a work in progress which will include more endings, easter eggs, and more darker/serious topics, <strong><em>this demo has 13 different endings and the average playtime session should be about an hour and a half. </em></strong><br/></p>\n<p>This is my <strong>first </strong>installment and creation of a horror-game so almost any comments and critique would be greatly appreciated as<em> </em><strong>this is still a demo and subject to change.</strong> I'm still learning and open-minded to suggestions,<strong> a very special thank you to those that have been following this project of mine and being supportive of it.</strong> If there's anyone that's a let's player that decides to try this demo out, I'd love to watch your video! If you run into any bugs, glitches, or errors please let me know!  :]</p>\n<p>(<strong>Note</strong>: There's a visual bug being fixed with the players Hp and Noah's love bar. At 1-5 Hp/Love or lower, it's showing the bars being empty when it's not suppose to be unless at you're at 0. This shouldn't effect overall gameplay.)</p>\n<p><strong>Here are my socials:</strong></p>\n<ul><li>My Tumblr : I am mostly active here so feel free to say hi! You'll find most of my progress and updates about Trembling Essence there.  :]</li><li>My Ko-fi  : Any amount of support is greatly appreciated!</li><li>My Tiktok : This is just where I post my finishing drawings with templates but eventually I'll add more there. </li></ul>", "metacritic": null, "released": "2023-03-23", "tba": false, "updated": "2023-03-24T07:41:23", "background_image": "https://media.rawg.io/media/screenshots/f23/f23e9240f7af63b297981424c9d64026.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["bee"], "genres": [], "publishers": [], "esrb_rating": null}