{"id": 94541, "slug": "walkerman-itch", "name": "Walkerman (itch)", "name_original": "Walkerman (itch)", "description": "<p><strong>Walkerman</strong> is a Visual Novel about hunting supernatural creatures. Each creature obeys a unique set of rules which must be exploited in order to defeat them, in a fashion similar to the old folk tales about vampires and garlic, or werewolves and silver bullets. Each act of Walkerman centers on a creature and the process of investigating it. Players will study the monster in order to ascertain its weaknesses, gather the necessary items, and then confront it in battle. Combat takes place on an isometric, pseudo-board game in which the player selects actions from a list of options. These battle sequences have multiple solutions, depending on the player's collected items and their knowledge of the monster. Players also steer the protagonist through his personal life in a similar fashion: deciding whom to trust, where to borrow money, etc which alters how the story progresses.</p>\n<p><strong>FREE Prologue Chapter Available at: https://scalemail.itch.io/walkerman-prologue<br/></strong></p>\n\n<p><strong>Prologue: The Thing in the Weald</strong></p>\n<p>Jorgen, a nineteen year old serf, has just embarked upon a peculiar career: monster hunting. As a walkerman, he will tour the streets and alleyways at night, battling supernatural creatures that emerge when the sun goes down. But before he can reach the city-state of Midgard, a chance encounter will send him spiraling headlong into a world beyond light and reason...</p>\n<p><strong>Out Now</strong></p>\n<p><strong>Act 1: Welcome to Midgard</strong><br/></p>\n<p>Jorgen's arrival in Midgard is marked by suspicious characters, perilous nights, and the all-pervading smell of a civilization in decay. Both ostracized and incensed by his countrymen, he raises his standard in the world's loneliest revolution... </p>\n<p><strong>Out Now</strong><br/></p>\n<p><strong>Act 2: Herdchaser-girl</strong><br/>Jorgen has survived his first contract, but now finds himself trapped between the circumstances of his family, religion, and trade. Hounded by their demands—and another more sinister offer—the young walkerman soon finds assistance in the most unlikely of allies...</p>\n<p>Page: https://scalemail.itch.io/walkerman-act2</p>\n<p><strong>Early 2018</strong><br/></p>\n<p><strong>Features:</strong></p>\n<ul><li>Over a dozen beautiful illustrations</li><li>Dozens of unique and fully illustrated characters</li><li>Branching story dependent on player agency</li><li>Five lengthy installments with instances of abstract, description-based puzzle solving</li><li>Pseudo-Board Game aesthetic for battle sequences</li><li>An extensive soundtrack featuring new tracks every episode</li><li>An extras menu featuring a CG gallery and music room</li><li>Free prologue chapter</li></ul>\n<p><em>BE WARNED: Walkerman may feature themes and imagery unsuitable for small children, including those of a violent, disturbing, or sexual nature.</em></p>", "metacritic": null, "released": "2017-01-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/59f/59ff0d0e5960f78b8c76c198e260b9be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 485, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["ScalemaiL"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}