{"id": 945407, "slug": "vagrant-srd-core-playtest-1", "name": "Vagrant SRD - Core Playtest 1", "name_original": "Vagrant SRD - Core Playtest 1", "description": "<p><strong>\"Vagrant SRD - Core Playtest 1\"</strong></p>\n<p>Vagrant SRD is a d20 system that is designed to be integrated or supplemental to other, similar TTRPGs. It is designed to be fluid and user friendly, allowing GMs to create balanced and narrative-focussed encounters, while players make interesting and inspired characters.</p>\n<p><em>\"This is the first of many blocks of playtest material for Vagrant SRD. It is designed to be used directly with characters and campaigns you have already created, allowing you to port it directly into your home game. If you are familiar with most d20, TTRPG rulesets, you will be able to use this playtest in its entirety. If you are not familiar, we’d suggest taking a brief look at the free rules available for systems such as Pathfinder, Starfinder, DnD and other, similar games.\"</em></p>\n\n<p>The goal of this set of playtest is to measure how well the core systems of Vagrant SRD (VSRD) can be adapted to other games. It will also test how easily the game, mechanics, systems, nouns and descriptors can be taught and applied to other games.\r\n</p>\n<p>\n</p>\n<p>By the end of the playtest, players and game masters (GMs) should be able to use all the mechanics at their disposal AND play an entire TTRPG game without having to rule edge-cases and homebrew “on the fly”.</p>\n<p>This set of playtest material includes:\r\n</p>\n<p>\n</p>\n<ul><li>Vagrant SRD - Playtest 1 -  Companion Guide\r\n</li><li>Vagrant SRD - Playtest 1 -  Character Sheet\r\n</li></ul>\n<p>\n</p>\n<p>Both materials are required to complete this playtest.\r\n</p>\n\n<p>Any and all feedback can be submitted directly through itch, or you can reach me on TWITTER and INSTAGRAM</p>\n\n<p>Please have fun with these free, playtest rules for Vagrant SRD. This is the first step in creating something brand new. I’m grateful you’ve chosen to be apart of this journey.</p>\n\n<p><em>lonomy - March 2023</em></p>", "metacritic": null, "released": "2023-03-23", "tba": false, "updated": "2023-03-24T08:06:13", "background_image": "https://media.rawg.io/media/screenshots/e72/e72c7487243274c8dee452315975df37.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lonomy"], "genres": ["Adventure", "RPG", "Puzzle"], "publishers": [], "esrb_rating": null}