{"id": 945436, "slug": "tactics-goblin", "name": "Tactics Goblin", "name_original": "Tactics Goblin", "description": "<p>Select a party of three adventurers to battle against an AI controlled opponent! </p>\n<p>This is just a small prototype to showcase pathfinding and decision making algorithms that I made for class as part of an 'AI for Games' unit. Inspired by my love for Fire Emblem and Final Fantasy Tactics, I figured this would be the perfect medium to showcase those concepts!</p>\n<p>Inputs:</p>\n<ul><li>Left Mouse Button - Used to select units, tiles, or interact with buttons.</li><li>Escape - Use to unselect a unit (if one is selected)</li></ul>\n<p>Third Party Attributions:</p>\n<ul><li>Sound Effects License: (CC0 1.0 Universal) You're free to use these game assets in any project, personal or commercial. There's no need to ask permission before using these. Giving attribution is not required, but is greatly appreciated!</li><li>Pixel Art Assets License: Crediting is not required but deeply appreciated! Use Gustavo Vituri for crediting. You are free to use all sprites in both personal and commercial projects. You are free to modify all sprites. Please do not redistribute this asset. Do NOT mint NFT's using this asset.</li><li>Tile Art Assets License: (CC0 1.0 Universal) You're free to use these game assets in any project, personal or commercial. There's no need to ask permission before using these. Giving attribution is not required, but is greatly appreciated!</li><li>Music ----FREE to use in any kind of commercial/non commercial project. :D---- (just don't resell and claim it as your own work) All the files of this package are released under the Attribution-ShareAlike 4.0 International (CC BY-SA 4.0) license. Composed and produced by Marllon Silva a.k.a xDeviruchi Background art by Kauê Daiprai Released on March 30, 2021.</li><li>Font License: Creative Commons Zero v1.0 Universal</li></ul>", "metacritic": null, "released": "2023-03-23", "tba": false, "updated": "2023-03-24T08:21:30", "background_image": "https://media.rawg.io/media/screenshots/853/853f7a7e0991329bc7b94dea08a3c5ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Barndone"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}