{"id": 94555, "slug": "super-slime-arena-itch", "name": "Super Slime Arena (itch)", "name_original": "Super Slime Arena (itch)", "description": "<p>Every 10,000 years the sun descends on Planet Blorb and the call of the Grand Arena rings out across all the land, beckoning its slimy denizens to battle! Countless slimes journey far and wide for a chance to be immortalized as true champions of technique to all slimekind!</p>\n<p><strong>Super Slime Arena</strong> is a multiplayer party fighting game embracing equal parts accessibility and chaos. Every slime has a unique attack and every attack is a one-hit-KO. Every time your slime gets KO'd, you respawn as a different character. True mastery demands understanding of 32 slimes with unique qualities, <em>and</em> learning how their abilities interact in over a thousand possible match-ups!<br/><br/>Play on 13 unique stages in 5 different game modes. Dive in to the chaotic action of Shuffle mode, or carefully consider each matchup while picking and counter-picking slimes for Elimination mode. Explore the wilds of the Rainbow Jungle, ricochet off walls in Lucky Neko Pinball, or fight between high-speed trains at Country Slime Station. Enjoy handmade 16-bit pixel art backgrounds and an original retro-inspired soundtrack from over a dozen different artists! </p>\n<p>Fight with all of your friends, and all of your controllers! Enter the arena using nearly any controller from retro to modern, fight sticks or flight sticks, plastic guitars and bongos! We don't put any limits on which controllers you can use, or how many controllers you can use. The game supports as many players as you have controllers for, both local and online! </p>\n<p>Inspired by a plethora of 90's Japanese console games and modern party game classics, <strong>Super Slime Arena</strong> seeks to capture the unique joy of playing together in a friendly and approachable fighting game for everyone!<br/><br/><strong>Features:</strong></p>\n<ul><li> Fast and frantic multiplayer battles at 60 frames per second, live and die like a slime!\r\n</li><li> 2-50+ Players (local and online, 2-8 players recommended)\r\n</li><li>Native support for a weird and wide variety of controllers with full customization\r\n</li><li>Simple, intuitive controls (move, jump, and attack)\r\n</li><li>32 slimes, each with a unique ability and flavor\r\n</li><li>13 stages, including a special  Slime-san crossover stage\r\n</li><li>Cute, handcrafted pixel art\r\n</li><li>5 Different Game Modes with both stock and timed options + teams:\r\n<ul><li>Shuffle: Play through all slimes in a random order, switching each time you are KO'd\r\n</li><li>Elimination: Pick slimes before the match, survive as long as possible\r\n</li><li>Swap: Choose 3 slimes and switch between them at any time\r\n</li><li>Monobattle: Score points by winning consecutive rounds where each player is the same slime\r\n</li><li>Slime Rush: Be the first to get one KO with every slime</li></ul></li><li>Fantastic retro soundtrack by over a dozen different artists:\r\nSlime\r\n Girls, Red&amp;Green, Shannon Mason (Pongball), Harry Lodes, Ruri \r\nMatsumura, Jean of mArc, Commandycan, Mark Sparling, Alex Sanchez, \r\nAlejandro Moros, Sean Thornton, Rob Karpay, Rachel Hartanto, and \r\nKommisar!</li></ul>", "metacritic": null, "released": "2018-01-11", "tba": false, "updated": "2019-08-28T23:25:48", "background_image": "https://media.rawg.io/media/screenshots/07e/07e2849a15bc1a2f917ff3435f59b48b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 266, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["JellyTeam"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}