{"id": 945642, "slug": "leisure-suit-larry-3-point-and-click", "name": "Leisure Suit Larry 3 Point and Click", "name_original": "Leisure Suit Larry 3 Point and Click", "description": "<p>A work in progress remake of Leisure Suit Larry 3 done in the AGS engine.</p>\n<p>The game is far from complete, it has the first 10 screens with animations and music but the idea is to complete remake the game with point and click controls instead of the text parser engine. I want to continue working on it when some things in my personal life are more stable.</p>\n<p>------------------------------</p>\n<p>WHY LEISURE SUIT LARRY 3?</p>\n<p>I'm well aware the themes and story of this franchise don't hold up nowadays and that they are very troubling. There are mainly two reasons why I selected this game:</p>\n<p>- It is the only one in the franchise that doesn't have a point and click version. (There is one fan remake done of the second one)</p>\n<p>- As a way to honor a relative. When I was a little kid, my cousin Damian and I used to play a lot of graphic adventures, his favourite franchise was Larry (this was around 20 years ago). He didn't know any english so usually we played by me translating for him and we spent a lot of afternoons finishing the classics. </p>\n<p>Unfortunately, about 6 years ago, my cousin Damian died of leukemia, so this is my way to honor him and to be close to him in some way. It helps me remember our afternoons together and how much fun we had together.</p>", "metacritic": null, "released": "2023-03-22", "tba": false, "updated": "2023-03-24T10:12:45", "background_image": "https://media.rawg.io/media/screenshots/37f/37f310474a9636e6b5e41fdd5bd0487e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Burning Arcade"], "genres": [], "publishers": [], "esrb_rating": null}