{"id": 945617, "slug": "bread-and-all-variations-of-the-aforementioned-int", "name": "Bread, and all variations of the aforementioned: Intermission 1 - Part 5 [ Visual Novel ]", "name_original": "Bread, and all variations of the aforementioned: Intermission 1 - Part 5 [ Visual Novel ]", "description": "<p><strong>Intermission 1 - Part 5 of \"</strong><strong>Bread, and all variations of the aforementioned</strong><strong>\"</strong>\n</p>\n<p>NOTE: This is<strong> not</strong> a standalone story. It is a specific chapter in BreadAVOTA and has a set narrative [ ie no choices or branching endings ]. The story here does not make sense without the context of the preceding chapters.\r\n</p>\r\nBreadAVOTA is a setting-driven webseries by rolypolyphonic under the primary genres of fantasy and dark comedy, and secondary genres of science fiction and horror*.\r\n\r\nIn Maldevara, a nation where “Living” is a Legal and not a biological status, a sentient Doll named Bread, and all variations of the aforementioned seeks to fulfill the Requirements of the Living so she can legally change her name to. Uh, not that.\r\n\r\nAlong the way, she accidentally gets dragged into a Quest™ involving angels and demons, dead Universes persisting as alien computer ghosts, zombie soldiers, not-really-time-travel, peer-reviewed research and something about the radio.\r\n\r\nThe story is told through a mixture of comics, videos, prose stories, obnoxious presentation slides and research documents.\r\n\r\n* It’s not that scary, but for ethical reasons I have to say people get impaled onscreen.\r\n\r\n<p>Art, story, characters and music by rolypolyphonic. Made using Ren'Py. <br/></p>\n<p>This is a first attempt at a visual novel, so forgive the simplicity. Made in about two days.<br/></p>", "metacritic": null, "released": "2023-03-22", "tba": false, "updated": "2023-03-24T09:57:13", "background_image": "https://media.rawg.io/media/screenshots/887/887d194ee60b7edc21711e5f9a482fc3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["rolypolyphonic"], "genres": [], "publishers": [], "esrb_rating": null}