{"id": 945662, "slug": "ghoul-smash-demo", "name": "Ghoul Smash [DEMO]", "name_original": "Ghoul Smash [DEMO]", "description": "<p>My name is Troy,  and I am 28 years old. I spend most of my free time  gaming, being a dungeon master for  a Dungeons and Dragons Campaign and  occasionally writing articles. I have always wanted to create a game  and publish it somewhere, and this project will be my leap towards that  goal. \r\n    </p>\r\nBeginners Guide\r\n<p><strong>Activate your Skills!</strong>  Every weapon (and some  items) have skills attached to them. To activate  the skill click the  box that appears next to their respective item slot when it is equipped.  An active skill will be red. Every skill costs <strong>1 Spirit </strong>and the cost will be used when you start your turn.     </p>\n<p><strong>Allocate Ski</strong><strong>llpoints!</strong>\r\nUnder the attributes section there will be a   emblem which  indicates the amount of skillpoints you have. A  skillpoint can be  allocated into either Strength, Dexterity, or  Intelligence (red, green,  and blue orbs respectively) attributes.  Skillpoints can be refunded for  free infinitely by clicking the  skillpoint emblem.     </p>\n<p><strong>Abuse the Shop!\r\n</strong>  Every time you successfully  complete a map the shopkeeper will re-roll  the three offered items for  free. You can also sell items by going to  the Salvage Tab.  Additionally, you can upgrade the shop tier by highlighting  the shop  tier indicator in the Purchase tab. Higher shop tiers equals  higher  quality items offered.     </p>\n<p><strong>Farm!</strong> \r\nDon't be  afraid to stick to an easier map  to gather more experience and salvage  to prepare for the harder maps.  The game is punishing for those who  aren't prepared for what lies  ahead.     </p>\n<p><strong>Crafting Recipes! </strong>\r\nThere  are many crafting  recipes, all of which are hidden and subject to  experimentation. To get  you started, try combing four of the same type  of ring together.     </p>\r\nDiscord\r\n<p>To get the latest news about Ghoul Smash and to find like-minded smashers, join the discord at this link:\r\nhttps://discord.gg/tHCpQG3cKn\r\n\r\n    </p>\r\n\r\nFreesync / Gsync\r\n<p>There have been reports of game slowdowns and potential frame losses  due to this, namely Gsync. Ensure that you have this feature disabled  when playing.\r\n    </p>\r\n\r\nCredits\r\n<p>Song : Plinian - Retro Gaming Version [Royalty Free]\r\nMusic provided and produced by LonePeakMusic\r\n<br/></p>", "metacritic": null, "released": "2023-03-22", "tba": false, "updated": "2023-03-24T10:22:31", "background_image": "https://media.rawg.io/media/screenshots/110/110d739193e37f0838536c6278396c9e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Alyr"], "genres": ["Action"], "publishers": [], "esrb_rating": null}