{"id": 945884, "slug": "don-vicente", "name": "DON VICENTE", "name_original": "DON VICENTE", "description": "<p>No es una sorpresa que las historias acerca de fenómenos paranormales estén</p>\n<p>presentes en nuestra vida social a lo largo de los años, algunas creíbles, otras no tanto,</p>\n<p>pero todas formando parte de la cultura mexicana; pero en algún momento te haz</p>\n<p>puesto en los zapatos del narrador y preguntado \"¿yo que hubiera hecho en esa</p>\n<p>situación?\".</p>\n<p>En este juego vivirás y enfrentarás esas fantasiosas historias que nos han contado a lo</p>\n<p>largo del tiempo, situado en el año de 1950 con un peculiar personaje llamado Don</p>\n<p>Vicente.</p>\n<p>Don Vicente, el hombre del pueblo que aparentaba gran valentía y arrogancia, el</p>\n<p>hombre que ha peleado con los seres mas fantasiosos durante toda su vida en su</p>\n<p>ciudad natal, nos prestará sus recuerdos plasmados en un pequeño libro en donde cada</p>\n<p>noche, después del trabajo, llegaba a escribir su vivencia del día y como siempre tenia</p>\n<p>una anécdota que contar a sus hijos y nietos.</p>\n<p>Esta libreta es muy importante, no debes olvidarla, ya que es la única prueba de que</p>\n<p>todo lo que nos cuenta Vicente, en algún momento fue real. La triste realidad actual de</p>\n<p>este hombre, es que ahora está solo y todo el pueblo piensa que está loco.</p>\n<p>Su objetivo, es que podamos vivir esas anécdotas en carne propia y al fin decir \"ya le</p>\n<p>creo a Don Vicente\"</p>", "metacritic": null, "released": "2023-03-21", "tba": false, "updated": "2023-03-24T12:03:43", "background_image": "https://media.rawg.io/media/screenshots/626/6262193dbc8c7fd0d619d3f341379c1b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["cotorros_STUDIO"], "genres": [], "publishers": [], "esrb_rating": null}