{"id": 94595, "slug": "citalis-itch", "name": "Citalis (itch)", "name_original": "Citalis (itch)", "description": "<p>\n</p><p>\n<strong>You have been granted a loan of 10,000,000$ to invest in building your own city and you are left with only 3,000$. You must use this money to start building your city and generate the income you need to keep up with your rising loan repayments. </strong>\n</p><p>\r\n\t Using Commercial, Residential and Park districts you must balance all the core aspects of a happy and successful city- such as building businesses, housing, monitoring water levels and ensuring the city remains beautiful at all times. \r\n\t<br/>\n<br/>\r\n\t But beware, if your city becomes unhappy your businesses will start partaking in criminal activity leading them to to be shut down. Failure to monitor water levels may lead to a drought to stop the city functioning properly or a flood to destroy housing, landscaping and roads.\r\n</p><p>\n<strong>But most importantly, make sure to keep up with your daily repayments. Falling behind leads to bankruptcy and ultimate failure so you must ensure your city is functioning properly at all times. The pace of change can be fast- do you think you can survive?</strong><br/>\n</p><p>\r\n\t___________________________________________________\r\n\t<br/>\n</p><p>\n<strong>Features<br/>\n</strong>\n</p><ul>\n<li>\r\n\tUnlimited city building!</li>\n<li>40 custom blocks to use with over 700 combinations of building.</li>\n<li>Adjustable UI positioning to suit your preference.</li>\n<li>Load and save function to retain your progress.</li>\n<li>Saves your highscores so you can challenge yourself.</li>\n<li>Normal and short challenege modes.</li>\n<li>No limit on the number of districts- enjoy building your city across thousands of blocks!</li>\n<li>Enjoy Citalis in up to stunning 1080p in windowed or fullscreen mode. </li>\n</ul><p>\r\n\t___________________________________________________\r\n</p><p>\n<strong>Requirements</strong>\n</p><ol>\n<li>Mouse and keyboard.</li>\n<li>1024x768 screen resolution or greater.</li>\n<li>Windows </li>\n</ol><p>\r\n\tRead the completely optional but highly recommended ingame help screen for more info on how to play Citalis!\r\n\t<br/>\n</p><p>\r\n\t___________________________________________________\r\n</p><p>\n<strong>Changelog</strong><strong><br/>v3.0</strong><br/>-Bug fixes<br/>-3 new game modes added! <br/>-Options preferences are now saved <br/>-Updated some tiles<br/><strong>v3.2</strong><br/>-Balancing! Lowered to pay multiplier in classic mode, increased upgrade effects and reduced the crime multiplier.<br/>-Added tutorial link to game menu <br/>-Game now pauses when naming a new district <br/>-Added some buttons to make interactable elements more obvious <br/>-Refined district swapping <br/></p><p>\r\n\t_____________________________________________________\r\n</p><p>\r\n\tSuper special thanks to \r\n\tKenney for publicly providing these free game assets!\r\n</p><p>\r\n\tAlso to the awesome \r\n\tLöve2d engine and the awesome community who are all so helpful!\r\n</p><p>\n<em><strong>If you have any questions, please feel free to drop me an email to contact.redforest@gmail.com!</strong></em><br/>\n</p>", "metacritic": null, "released": "2016-08-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/fa0/fa0f15ebeddbd15871111a74ecaa77ee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Red Forest"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}