{"id": 94608, "slug": "zissis-island-itch", "name": "Zissi's Island (itch)", "name_original": "Zissi's Island (itch)", "description": "<p>Zissi (the player) has traveled from far away to visit her grandmother which coincidentally is about to celebrate her birthday. Of course, Zissi forgot it was soon going to be her grandma's birthday so she didn't get her a present and must now search the island for pearls to make her a pearl necklace as soon as possible before it's too late... after all, it might be <em>her last birthday ever.</em><br/></p>\n\n<p>Features!</p>\n<ul><li>A pretty-big open world. Go almost anywhere at the very start of the game. </li><li>Find items to help you on your quest for the pearls. </li><li>Collect coins, gold bars and rubies to buy items. </li><li>Dynamic day-night cycle. </li><li>Talk to the inhabitants of the island to get tips or just find out what their favorite thing in the whole world is.  </li><li>Original art made by me. It's good enough, I think. </li><li>Multiple endings depending on how many pearls you collect (you need at least 20) and/or how long it takes you. </li><li>Sequence breaking? There are barely any sequences! Find out where a pearl is and go get it. Sometimes you need an item to get it but you can also get items in a different order every time you play. </li><li>Controller and Keyboard+Mouse support (Xbox Controller recommended). </li><li>No bosses. Sorry but boss fights didn't fit the carefree atmosphere \r\nof the game. Also, they're hard to do and I rather have no boss fights \r\nthan have crappy boss fights. \n</li><li>The game is pretty relaxed and chill. If you're looking for\r\n a challenge then this game might not be for you, unless you like \r\nspeedrunning.\r\n</li><li>There's backtracking. I like backtracking but do you? There\r\n is a way to turn on some teleporters that make moving around the island\r\n so much easier but you need to buy an item first and then bring it to a\r\n friend on the other side of the island.\r\n</li></ul>\n<p>I recommend you download the demo first to see if the game works on your computer and/or if you like it: https://spram.itch.io/zissis-island-demo </p>", "metacritic": null, "released": "2016-07-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6d5/6d5ac006a93c8a3ad69f077bc6e8b4bf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Spram"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}