{"id": 9461, "slug": "osy-osmosis", "name": "Osy Osmosis", "name_original": "Osy Osmosis", "description": "Osy Osmosis is a fun game for all ages where you must help Osy stay safe as she navigates through her world collecting stars. To help Osy you will use osmosis to keep her in balance with the world around her. Add and remove Osy’s bits (solute) to control the flow of water into and out of Osy. Be careful though, add too much water to Osy and she swells up and pops, too little water and she shrivels up.<br/><br/>Osy is the first game to show the key elements of osmosis as you play, namely bound and free water molecules. The textbooks get osmosis wrong - Osy gets it right!<br/><br/>Features<br/><ul><li> 17 levels that introduce exciting new elements and obstacles:<br/></li><li> Bit vents add more solute to the environment around Osy - add bits to match the concentration!<br/></li><li> Oxygen vents give Osy a speed boost<br/></li><li> Round crystals are hard to move, if only Osy were a little bigger...<br/></li><li> Sharp crystals can pop Osy, be careful around them!<br/></li><li> Pure water has no solute in it, and thus a higher concentration of free water that will continuously diffuse into Osy! Better not hang out in there for very long if you can help it.</li></ul><br/>Osy was developed by a group of researchers, educators, and developers at the University of Georgia (UGA), with support from the National Institutes of Health (NIH) Science Education Partnership Award (SEPA), The Georgia Research Alliance VentureLab, and UGA. Cogent Education was formed by members of this group to design and develop future education simulations and games. All profits from Osy will go towards the creation of other educational games and interactive software.The Science behind Osy Osmosis<br/>People can find understanding osmosis a little tricky – but this is because all the textbooks do a horrible job of explaining it! Let’s see if we can do a better job…<br/><br/>Osmosis is the diffusion of water through a semi-permeable membrane, like Osy’s cell membrane. When you add a solute, (e.g., table salt) to water, some of the water molecules attach to the solute, so you end up with two kinds of water – “solute-bound water” and “free water”. Only the free water can diffuse through the membrane.<br/><br/>Because diffusion is the movement of molecules from an area of high concentration to an area of low concentration, the concentration of free water determines which direction osmosis occurs. For example, when you add bits (solutes) to Osy, some of the free water molecules attach to the bits, and this reduces the concentration of free water inside Osy – so, free water diffuses into Osy and she swells up!<br/><br/>When you remove the bits from Osy, the water molecules are released from the bits, so the concentration of free water inside Osy increases – so free water diffuses out of Osy and she shrinks.<br/><br/>OK, that’s the science-y bit, now go and have some fun with Osy!", "metacritic": null, "released": "2017-03-20", "tba": false, "updated": "2019-08-28T22:14:57", "background_image": "https://media.rawg.io/media/screenshots/d59/d59b69454c7883c7d83bd8283f735ba6.jpg", "website": "http://osyosmosis.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 3, "achievements_count": 17, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC", "macOS"], "developers": ["Cogent Education"], "genres": ["Action", "Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Cogent Education"], "esrb_rating": null}