{"id": 94617, "slug": "forgotten-kira-zingmark", "name": "Forgotten (Kira Zingmark)", "name_original": "Forgotten (Kira Zingmark)", "description": "<p><strong>Description</strong><br/></p><p>You awaken alone by the water, the City looming overhead, with smoke billowing from every chimney, all the while dirty snow falls all around you. Despair begins to grip you, and isolation take hold, but in the far off distance you see a light. With what little hope you have left, you make your way towards this beacon, towards the light. But is there really another soul in this wasteland, or are you truly alone? </p><p><strong>Synopsis &amp; Gameplay</strong></p><p>'Forgotten' is a short experimental art-game in which you find yourself alone in an Apocalyptic landscape, and must explore the environment around you, with only a beacon of light in the distance serving as a guide. The game's creation was inspired by an original painting by artist Peter Booth called 'Untitled', created in 2002 and exhibited at the Brisbane Gallery of Modern Art (GOMA). An Oil on canvas piece, it depicts a non-descript landscape of an apocalyptic world, desolate and abandoned in tone.<br/></p><p>The goal of 'Forgotten' was to create a short video-game that conveyed my own personal expression of what Booth's original piece means to me. The world of 'Forgotten' is bleak and depressing in appearance, combined with music that is equally so. Taking inspiration from Booth's own background, it depicts a fictional portrayal of Sheffield, England at the turn of the 19th century, at a time when heavy industry began to dominate much of the UK. It showcases the divide between the old world and the new, as well as the toxic and environmentally destructive atmosphere that came as a result of 'progress'.</p><p>'Forgotten' was created by Kira Zingmark, a Game Designer residing in Brisbane and currently studying at SAE QANTM. Built in Unity 5, it was created as a project piece for GDS220 Studio 2.</p><p>Peter Booth's original piece can be seen here.</p><p><em>A Postmortem for 'Forgotten' is available here.</em><br/></p><p><strong>Legal</strong></p><p>'Forgotten' is an educational project, and is not for sale or commercial reproduction. It is provided free of charge, however users are free to make a donation if they wish. Any and all assets used including but not limited to Audio, Video, and 3D Models, were created solely for this project by the author, are available for use free of charge, or used in manner that falls under the use of the <em>'Fair Dealing'</em> clause of the <em>Australian Copyright Act of 1968</em>. Any remaining works consist of a mix of Freeware, Creative Commons, Public Domain, and Non-Commercial licenses. Due to their limited use and the non-profit nature of the project as an educational piece, their use in 'Forgotten' falls under the umbrella of <em>'Fair Use'</em>.</p>", "metacritic": null, "released": "2017-02-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/73d/73dcb1de81a8ffb0ea6b1593f33d5887.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Kira Zingmark"], "genres": [], "publishers": [], "esrb_rating": null}