{"id": 946154, "slug": "we-have-two-weeks-to-convince-apocalypse-ttrpg", "name": "We have two weeks to convince Apocalypse - TTRPG", "name_original": "We have two weeks to convince Apocalypse - TTRPG", "description": "<p>This is the TTRPG VERSION of my Interactive Fiction Game of the same name.</p><p><em>---<br/></em></p><p><em>Decades before you were born a disaster that wiped out 86% of humanity occurred. The current generations no longer remember or know what happened, and very few of the Oldest are still alive to recall the events. Governments have largely collapsed, money no longer has value, energy and transport are solar-powered, and people live by either farming or raiding old abandoned storehouses, shops, etc. Some people have moved into factories and are trying to recreate Old Things as a hobby (like certain processed foods, clothes, toys, fireworks, etc.). All knowledge of the Old World that existed digitally and in books was preserved, so you can even have things such as computers - but you need to find working electrical outlets, and very few places hold a satellite internet connection… but you can definitely play an offline video game if you find one! \r\n<br/></em></p>\n<p><em>Life is largely peaceful.\r\n</em></p>\n<p><em>Until...</em></p>\n<p><em><strong>“Prove to me that humanity deserves preservation - or choose annihilation right here and now.”<br/></strong></em></p><p>---</p>\n\n<p>This is a 1 player+ GM-less journaling game in which you will document your journey and impressions in order to plead humanity's case before the Apocalypse Eternal. You will most likely fail, but success isn't impossible. </p>\n<p><strong>AN INTERACTIVE FICTION VERSION IS IN DEVELOPMENT...</strong><br/></p>\n<p>The gameplay of <strong>‘We have two weeks to convince Apocalypse’ </strong>is based on The Wretched, product of Chris Bissette and Loot The Room.<br/></p>\n<p>Many thanks to somewherewithstories for the invaluable help they gave me with this game!</p>\n<p>I'm hoping to be able to add community copies in the future!<br/></p>", "metacritic": null, "released": "2023-03-20", "tba": false, "updated": "2023-03-24T14:21:43", "background_image": "https://media.rawg.io/media/screenshots/8dd/8dda7e274ed99ddcc8b2e868f81c7149.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nate Oldrin"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}