{"id": 946156, "slug": "koragusumaster-aventuras-plataformeras-x", "name": "KoragusuMaster: Aventuras Plataformeras X", "name_original": "KoragusuMaster: Aventuras Plataformeras X", "description": "<p>¡Este es un proyecto de Isla Koragusu, centrado exclusivamente en juegos del género \"plataformas\"!</p>\n<p>El juego usa SMBX2 (SMBX 2.0) como juego base, e incluirá varios juegos para elegir dentro del mismo; los cuales son protagonizados por los personajes de Isla Koragusu (cada uno con sus propias características y jugabilidad), muchos niveles variados, trepidantes jefes con los que pelear, ¡y mucho más! El juego está completamente en español, y cuenta con doblaje para cada personaje. <strong>NOTA IMPORTANTE: LOS CRÉDITOS DEL JUEGO ESTÁN DENTRO DE LA CARPETA DEL PROGRAMA.</strong></p>\n\r\nPersonajes jugables hasta el momento:\r\n  <strong>Koragusu Muminyora:</strong>\n<p>Él es el protagonista de la saga completa y creador de esta. Es un joven y ambicioso chico friki que lidera en su equipo, y nunca deja atrás sus sueños y esperanzas. Su sueño es llegar a terminar de crear sus proyectos de videojuegos y animaciones, para poder tener éxito con ellos. Se rumorea que tiene un gran y misterioso potencial oculto.</p>\n<strong>Cyrlea Glastanu:</strong><br/>\n<p>Ella es la novia de Koragusu y la waifu del creador de la saga (KoragusuMaster). Es una dulce y encantadora chica mapache que posee los poderes de la nieve; su especie es llamada \"yukitanuki\". Su sueño es convertirse en una estrella idol, para ganar un concurso de karaoke, baile y coreografía a nivel profesional. Tiene muy buenas habilidades motrices.</p>\n<p>  <strong>Dokrun Huriun:</strong></p>\n<p>Es el héroe principal de la primera entrega de la saga Isla Koragusu. Es un valiente, amable y formal extraterrestre venido del Planeta Krun; su especie es llamada \"krun\". Su sueño es llegar a ser uno de los guerreros más fuertes del Planeta Alternia (lugar de procedencia de la Isla Koragusu, donde se desarrolla la gran parte de la trama). Le encanta explorar sitios para aventurarse en ellos.<br/></p>\n<p>  <strong>Pakurun Hunugoro:</strong></p>\n<p>Primer aliado de Dokrun durante los sucesos de Isla Koragusu 1. Él es un extraterrestre proveniente del Planeta Kanomuro; un \"kanonoide\", que se muestra muy extrovertido y le gusta ser gracioso con los demás. Su sueño es conseguir novia, a futuro casarse, y más adelante si es posible, formar una familia. Sabe pelear bien, pero a veces es torpe y pierde reflejos.<br/></p>\n<p>  <strong>Zonoe Turujune:</strong></p>\n<p>Segunda y última aliada de Dokrun durante los sucesos de Isla Koragusu 1. Es una chica valiente, amable, divertida y cariñosa a la que le gusta hacer amigos, divertirse, explorar y tener aventuras. Su sueño es iniciar un periplo para encontrar grandes descubrimientos arqueológicos a los alrededores del Planeta Alternia, para ganar dinero, y así utilizarlo tanto como para su propio beneficio, como para combatir la pobreza mundial. Su espada de bambú fue heredada del sabio de la región donde ella se crió.<br/></p>\n\r\nJuegos disponibles hasta el momento:\r\n<ul><li>Super Dokrun Land</li><li>Isla Koragusu: Campeones del Combate (demo)</li></ul>\n\n<p>Este juego ha sido creado por KoragusuMaster: https://www.youtube.com/channel/UCNPVmCNL-CO6pwQ2SF_tIpA<br/></p>", "metacritic": null, "released": "2023-03-20", "tba": false, "updated": "2023-03-24T14:22:39", "background_image": "https://media.rawg.io/media/screenshots/90a/90a9871b467e84a0d8764f0774248acd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KoragusuMaster"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}