{"id": 946205, "slug": "isekai-pacts", "name": "isekai pacts", "name_original": "isekai pacts", "description": "<p>https://discord.gg/5qTqrqKPVq (found a bug?please tell me in discord.)<br/></p>\n<p>story:<br/></p>\n<p>As an summoner , you have the ability to summon powerful warriors from lower realms to do your bidding. However, your thirst for power and domination has not gone unnoticed.\r\n</p>\n<p>You receive an invitation from the ruling kingdom to participate in the tournament. during the tournament the every team gonna receive 10 thousand goods as sponsorship between every round.\r\n</p>\n<p>You realize that these tournament could help a lot with your research. So, you give 2 options to the warriors who came \"get back to your world and nothing will change for you or be here and i will give power beyond you wildest dreams you just need to fight in the tounament.\"- you offer them your knowledge and expertise in exchange for their loyalty and willingness to fight for you in the summoning tournament.\r\n</p>\n<p>soon find yourself competing against other powerful summoners from across the land. You must build the ultimate team of warriors and strategize your battles to defeat your opponents.\r\n</p>\n<p>The tournament is fierce and intense, with many surprises and challenges along the way. Will you use your power and your summoned warriors' abilities to dominate the tournament and claim victory, or will you be outsmarted by your opponents?\r\n</p>", "metacritic": null, "released": "2023-03-20", "tba": false, "updated": "2023-03-24T14:45:39", "background_image": "https://media.rawg.io/media/screenshots/d29/d295bdee98cf7c0f697318d97789bbb2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["SonGatsuCodes"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}