{"id": 946364, "slug": "b34-n", "name": "B34-N", "name_original": "B34-N", "description": "<p>B34-N is an asymmetrical top-down cooperative shooter set in a dystopian future where robots and humans live in harmony. But everything is not perfect as it seems, as corrupted AI tries to take over and destroy humanity.</p>\n<p>Defeat an AI gone rogue in this co-op bullet hell boss fight! Play with a friend as two bounty hunters with different skill sets. Master the art of bounty hunting to stop the AI from taking over the world. More importantly, can you claim the bounty and live the rest of your lives in fame and riches?\r\n  </p>\n<p>Core features include:\r\n  </p>\n<ul> <li>A symbiotic relationship is achieved between both      players through cooperative multiplayer\r\n  </li><li>The      attack player utilizes a great damage output of rapid fire and charging      shots for critical damage\r\n  </li><li>Support      player has the role of utility - disabling enemy turrets and healing both      players\r\n </li></ul>\n<p>Online component &amp; How to play:\r\n  </p>\n<ul> <li>One player hosts, the other inputs the IP\r\n  </li><li>Choose      between attack and support roles - one attack, one support player\r\n  </li><li>An      energy-based system where bullets and abilities recharge over time.\r\n  </li><li>A      dash for each player can mean the difference between life and death\r\n  </li><li>Losing      your health puts the player in a “downed state” where the other player can      revive them\r\n </li></ul>", "metacritic": null, "released": "2023-03-20", "tba": false, "updated": "2023-03-24T16:03:55", "background_image": "https://media.rawg.io/media/screenshots/cb8/cb8189c819cfdfc4c10b577b8f6bd968.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Futuregames", "Supermixerman"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}