{"id": 946365, "slug": "loop-runners-the-greatest-heist", "name": "Loop Runners: The Greatest Heist", "name_original": "Loop Runners: The Greatest Heist", "description": "<p><strong>The year is 2069.</strong><br/></p>\n<p> Maksims, the overqualified Robot Engineer has come up with an idea to invent a very agile robot prototype, able to create a safe point in a timeline and revert back to it to be able to steal valuable gems from most secure facility in the universe through trial and error. </p>\n<p>Your task is to operate such prototype to get all the required resources for the heist and execute it. Travel through secret facilities in a short amount of time, gathering knowledge and power-ups to be able to reach your destination. If you end up failing, do not worry, prototype will traverse back in time to give another chance for the success.</p>\n<p>Loop Runner is a 3D platformer/shooter  with a very high difficulty curve so it can be considered as a rage game as well.<em> [No, actually, trust me, few of the testers already voiced their fury over the high difficulty and it cannot make me even happier]. </em>The addition of in-game cinematics, voice acting for better story-telling and more full-fledged levels are currently under development.</p>\n<p><strong>Warning: </strong>This game is currently in a very early development stage as a test demo to receive feedback and improve the game with the help of it. Only one level is available with three available difficulty levels. The current level will be revamped and replaced with an actual tutorial and additional features later this week. It would be highly appreciated to voice your opinion about current build and possible changes to make the game more enjoyable.</p>", "metacritic": null, "released": "2023-03-20", "tba": false, "updated": "2023-03-24T16:04:47", "background_image": "https://media.rawg.io/media/screenshots/ae4/ae49446e8dbc27a96746ed8c5f121614.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MaxPro48"], "genres": ["Action", "Simulation"], "publishers": [], "esrb_rating": null}