{"id": 946403, "slug": "arcadis-system", "name": "Arcadis System", "name_original": "Arcadis System", "description": "<p>The Arcadis system is a network of three planets. The planets, poorly equipped with resources, were bursting at the seams due to the planned economic measures of Emperor Done Parker. </p>\n<p>There was too little food for the population and the military could only keep the peace by force of arms. This circumstance led to a dictatorship in the last years. The military removed Done Parker from office in a nighttime action. The military leader Tery Butly has ruled the Arcadis system for a year now.</p>\n<p>The economic and social situation of the population of the Arcadis system has rather deteriorated during this time. Thus, resistance is stirring among the population. They take on the role of resistance fighter Jose Ramoor. </p>\n<p>Over a longer period of time, the resistance has managed to collect several metal parts, generators and fuel. From these resources, a few engineers were able to build a spaceship ready to fly.</p>\n<p>On each of the three planets, Meno IV, A'Beri and Synthu V, Tery Butly has created five bases. The resistance is far superior in numbers to Tery Butly's military dictatorship. However, they lack weapons and spaceships. Therefore, you must attack the bases with your spaceship and destroy all enemy attackers.</p>\n<p>The resistance will then do the rest on the surface of the planets.</p>\n<p>Game genre:</p>\n<p>Sidescroller Space Invader</p>\n<p>Game Scope:</p>\n<p>- Three planets to liberate</p>\n<p>- On each planet there are five missions </p>\n<p>- Game duration about 1.5 hours</p>", "metacritic": null, "released": "2023-03-20", "tba": false, "updated": "2023-03-24T16:24:30", "background_image": "https://media.rawg.io/media/screenshots/46c/46ce13363325bb60d517c3568783533f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["grinseengel"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}