{"id": 946405, "slug": "penguins-and-dice", "name": "Penguins And Dice", "name_original": "Penguins And Dice", "description": "<p>The game is called <strong>\"Penguins And Dice\"</strong>, and it is a fun and exciting game for all ages. The objective of the game is to move your penguins around the board, collecting bonuses and avoiding elimination.</p>\n<p>To start the game, each player chooses a color of penguins (red, blue, green, or yellow) and places them on the starting spaces on the board. The board is made up of a series of spaces, some with bonuses and some with penalties.</p>\n<p>On each turn, the player rolls two dice. The total number on the dice determines how many spaces the player can move their penguins. For example, if the player rolls a 4 and a 3, they can move one penguin 7 spaces or two penguins 4 and 3 spaces.</p>\n<p>The goal is to collect as many bonuses as possible while avoiding the penalty spaces. Bonuses include additional penguins and extra dice rolls. Penalty spaces include spaces that eliminate a penguin if another penguin is stepped over.</p>\n<p>If a player lands on a bonus space, they can add an additional penguin to their team, increasing their chances of winning. If a player lands on a penalty space and another penguin is stepped over, that penguin is eliminated from the game.</p>\n<p>The game continues until one player has all of their penguins eliminated, or until a predetermined number of rounds have been played. The player with the most penguins remaining at the end of the game is declared the winner.</p>\n<p>Overall,  <strong>Penguins And Dice</strong> is a fun and exciting game that involves strategy, luck, and a bit of risk-taking. With its cute penguin characters and easy-to-learn rules, it is sure to be a hit with players of all ages.</p>\n<p>Robot</p>\n<p>Playing against robots can be a great way to practice strategy and get a feel for the game before playing against other human players. The robots are programmed to make smart and unpredictable moves, so players will need to stay on their toes and adjust their strategies accordingly.</p>\n<p>To play in robot mode, players simply choose the <strong>\"robot mode\"</strong> option when setting up the game. They can then select the number and difficulty level of the robots they want to play against.</p>\n<p>Overall, the robot mode adds an extra level of challenge and excitement to  Penguins And Dice, making it a game that players can enjoy both on their own and with friends. Whether playing against robots or human opponents,<strong> Penguins And Dice</strong> is a game that is sure to provide hours of fun and entertainment.</p>", "metacritic": null, "released": "2023-03-20", "tba": false, "updated": "2023-03-24T16:26:03", "background_image": "https://media.rawg.io/media/screenshots/a35/a358660cfb275163fc70c77870c6b7c5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Android", "Linux", "macOS", "PC"], "developers": ["carrot"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}