{"id": 946568, "slug": "a-land-goos-crazy", "name": "a land Goo's crazy", "name_original": "a land Goo's crazy", "description": "<strong>A land Goo's crazy</strong> is type of roguelike indie game.<br/><br/>You arrive to a land full of Goos, not knowing what is going on.<br/>You have a mark on your back corresponding to that of this kingdom. Maybe the king have more answers.<br/>But it is too dangerous. The first Goo helps you out whit a cape to cover your mark.<br/>Suddenly you transform to a special form with strong power. The power of memory.<br/>You take this gift and travel. By time the memory rise and things comes more clear.<br/>You are on a mission! Help the corrupted land to gain peace again!<br/><br/>This game is done by two person<br/>My Brother and Me<br/><br/>Powered with :           Pixel Game Maker MV<br/>Music created:           by my Brother in Garage Band<br/>Art:                             by Me in Art rage 2 with a pen table<br/>Voices:                        recorded by Me on Smartphone<br/><br/><h3>Here some first steps to start.</h3><br/>R1 Menue and R2 until page 9, there is the note spot where you can save the game \"as long as you are a Goo\".<br/>There is no else a save spot in game.<br/>After a win on the run or a fail in between, you loose all your gains except your memorys. Save after every run as mentioned.<br/>Don't be frustrated to much as there will be runs with a hard time. But you gain always some memory out of it to upgrade the protagonist.<br/><br/><h3>Information</h3>All informations are in the book of Goos. There are manny hints to have a better life.<br/><br/><br/><h3>In game currency</h3>The last shirt has no pockets so spend the coins wisely.", "metacritic": null, "released": "2023-03-25", "tba": false, "updated": "2023-03-27T02:49:06", "background_image": "https://media.rawg.io/media/screenshots/955/955db5aaf0c6c5fb028da5e7a7af8814.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 317, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Velemir Stjepanovic"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Velemir Stjepanovic"], "esrb_rating": null}