{"id": 946597, "slug": "planet-fights", "name": "Planet Fights", "name_original": "Planet Fights", "description": "Join the battle for world domination in Planet Fights, an online country management and war game where hundreds of US citizens come together to fight against other countries. With a giant world simulator at your fingertips, conquer territories, establish alliances, and become a powerful leader. Planet Fights is a gigantic online sandbox, in which USA can be conquered by Russia and Russia can be conquered by the USA... unless the USA elects a smart President and good politicians.<br/><br/>● Features:<br/>☆ Country management game<br/>☆ War game<br/>☆ Real-time multiplayer<br/>☆ President simulator<br/>☆ Online and real-time strategy<br/>☆ World simulation<br/>☆ Space colonies strategy<br/>☆ World alliances game<br/>☆ Economy simulator<br/><br/><br/><br/>In Planet Fights, the balance of power may be different from the real world, but you'll have the chance to elect a smart President and good politicians to lead your country to victory. Manage your economy, buy and sell products on the market, and upgrade your capital city by donating resources or helping your fellow citizens.<br/><br/>Create and manage your own space colony, earn special items, and increase your profits. Be part of global alliances, decide which fight to take part in, and choose between Agent Fights, Battlefields, Space Colonies, or Races. Only time will tell if you and your alliance could dominate the world in Planet Fights.<br/><br/><br/><br/>Experience the ultimate war sandbox game and take part in epic battles for world domination. Play Planet Fights now and show the world what you're made of!<br/><br/>With Planet Fights, you'll be able to immerse yourself in a unique and engaging world simulation that puts you in control of your country's destiny. Experience the thrill of conquering territories and making strategic alliances as you compete with other players in real-time multiplayer mode.<br/><br/><br/><br/>As a President simulator, you'll be able to lead your country to victory and earn money from all the fights happening around the world. And with an online and real-time strategy game, you'll have the chance to create the perfect balance between military, economy, and political career.<br/><br/>Whether you're looking for a country theme, country war simulator, or a war sandbox game, Planet Fights has it all. You can even become a space colonies strategy expert and grow your own colony in your country's space territory.<br/><br/><br/><br/>Join the massive community of players who are already online, trade money on the market, and make money transactions in real-time. With a country management game at your fingertips, you can buy or sell your products on the market, help upgrade the capital city, and donate resources to your fellow citizens.<br/><br/><br/><br/>As a war game, Planet Fights is not just about military might but also about making smart political moves. The game's economy simulator lets you make money and build a thriving business, while the world alliances game allows you to forge alliances and compete for dominance.<br/><br/>Experience the thrill of a country war simulator, where countries are part of global alliances that fight for world domination. Take part in epic battles on Agent Fights, Battlefields, and Space Colonies, and see if you and your alliance have what it takes to rule the world.<br/><br/>With its engaging gameplay, stunning graphics, races simulators, world alliances games, and economy simulators, Planet Fights is the perfect game for anyone who loves a good strategy game. So why wait? Play Planet Fights now and start your journey to world domination today!", "metacritic": null, "released": "2023-03-24", "tba": false, "updated": "2023-03-27T03:23:07", "background_image": "https://media.rawg.io/media/screenshots/1ee/1ee77b3b2dd0d74f986e98dc73fcc641.jpg", "website": "https://planetfights.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 326, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SCLITIFY IT"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Sports", "Racing", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["SCLITIFY IT"], "esrb_rating": null}