{"id": 94660, "slug": "rogue-space-marine", "name": "Rogue Space Marine", "name_original": "Rogue Space Marine", "description": "Description <p>\r\n\tRogue Space Marine features a unique, fast-paced \"asynchronous\" combat system with only two resources: abilities and time. The player is a lone marine trapped on a space station. The objective is to activate all of the computer terminals or eliminate all enemies on each level to progress.\r\n</p><p>\r\n\tThis game was made over the course of 7 days for the 7DRL_Challenge_2015 and uses some sprites from the Oryx 16-bit Sci-Fi pack (http://oryxdesignlab.com/).\r\n</p><p> <br/></p>  Tutorial <p>\r\n\tA simple video tutorial describing basic controls and tactics is available here: https://youtu.be/NcdQDSRY6OA?list=UU4qjdEvmVq2dNiFAXZhG4mg\r\n</p>  Central Mechanics <ul>\n<li> The game has an asynchronous turn system consisting of actions that require different amounts of time to perform. </li>\n<li> The player is limited to turn-based play, but the enemies can move and act freely, and are not restricted to turn times. Enemies freeze in place between player turns. </li>\n<li> The player has a range of abilities for movement, attack, and defense. Abilities require a cool-down time after each use. </li>\n<li> When the player takes damage, one ability is disabled at random for the remainder of that level. </li>\n<li> All disabled abilities are restored at the end of each level, and on levels 2, 4, 6, and 8, the player receives a new randomly-selected ability. </li>\n<li> When all abilities are lost, the player is limited to only movement, and any more damage to the player will end the game. The level can still be completed if all computer terminals are activated. [Update: in version 1.2, the Knife ability was restored for players on their last hit point]</li>\n<li> The player has 100 seconds to complete the level before a \"Red Alert\" is activated. This alerts all enemies on the level to the player's position, and starts respawning defeated enemies after 10 additional seconds pass. </li>\n<li> There are a total of 25 enemy types, all of which behave differently and have different skills. </li>\n<li> There are a total of 10 active abilities and 3 passive abilities. </li>\n<li> The game has 9 levels consisting of 9 rooms each, and the game usually takes under an hour to complete. </li>\n</ul>  Version History <p>\r\n\t15 March 2015: v1.0 Initial release\r\n</p><p>\r\n\t16 March 2015: Several bugs that would crash the game were discovered and fixed\r\n</p><p>\r\n\t20 March 2015: Several level generation bugs (that would make the game unbeatable) fixed\r\n</p><p>22 April 2015: Red alert respawning fixed, Ability description screen added</p><p>23 April 2015: Version 1.1: Enemy patrolling fixed</p><p>13 September 2015: Version 1.2:<br/></p><ul><li>The player can now use the knife when they are close to death (one HP remaining). This gives them a fighting chance. Previously, this was basically a death sentence.</li><li>Added a mini map that shows the grid of the 9 rooms in each level. The room will be displayed in red until the terminal in that room has been activated, at which point it will become green. This gives players a basic sense of what rooms they have visited and aids in exploring the level.</li><li>When the player gets the Goggles ability, the minimap becomes more detailed, showing hallway layout and the player's current position. This allows for more planning and should help the player navigate the level much more easily.</li></ul><p>22 December 2015: Version 1.3:</p><ul><li>Minor update. Added a few room types. Fixed two broken sounds.</li></ul>", "metacritic": null, "released": "2015-04-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e4c/e4c89d730bb1d2d04d106e150dc45212.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Brett Gildersleeve"], "genres": ["Action"], "publishers": [], "esrb_rating": null}