{"id": 946611, "slug": "out-of-the-park-baseball-24", "name": "Out of the Park Baseball 24", "name_original": "Out of the Park Baseball 24", "description": "<strong>Out of the Park Baseball 24</strong> - the 24th version of the award-winning sports strategy franchise - is the baseball strategy game beloved by fans for nearly a quarter-century. Loaded with powerful new 3D visuals, all-new in-game analytics, and a massive upgrade to its vaunted franchise mode, it appeals to baseball fans of all types. Featuring unmatched authenticity licensed by MLB and the MLBPA plus offline and online gameplay options, Out of the Park Baseball 24 builds on the series’ rich tradition as one of the longest-running video game franchises in history.<br/><br/><strong>“OOTP is an astonishing accomplishment!” - Boston Red Sox Principal Owner John W. Henry</strong><br/><br/>Out of the Park Baseball 24 is a franchise that has twice won Metacritic’s PC Game of the Year - the only game to ever do that!<br/><br/>If it happens in real baseball, it happens in Out of the Park Baseball! Discover new talent, draft the next superstar, negotiate with free agents, enter trade talks with other teams, build your dynasty and guide a franchise into an infinite future! As a manager, dive into the more hands-on management and set your team's lineups, pitching staffs, in-game strategy and call the shots from the dugout. You can oversee your league at a high level, or play out each game in the gorgeous 3D game mode, managing play by play or even pitch by pitch. OOTP has it all covered!<br/><br/>OOTP 24 comes with accurate 2023 MLB, MiLB, and KBO rosters featuring ultra-realistic player ratings, schedules, and league rules. Plus, all historical MLB Seasons (1871-2022, including full historical minor leagues). You can even create your very own fictional baseball universe with fictional teams and players, the possibilities are endless. The Infinite Baseball Sandbox!<br/><br/><strong>New features in OOTP 24 include:</strong><br/><ul><li>Huge visual improvements! Get deeper into the action with new 3D animations and visual improvements that bring the game to life! A new audience model will react to the action on the field, while new fielding, pitching, running, and batting animations make OOTP 24 the smoothest and most visually pleasing version in history. Plus! For the first time, get personal with your players, with names and numbers on their jerseys!<br/></li><li>An all-new Dynamic Trade Deadline Day! Feel the pressure of making key trade decisions in the heat of the moment, all while other teams are making deals at the same time! Can you hold your own and make the trades that will bring your team a World Series championship?<br/></li><li>Dramatically improved International Amateur Free Agency! Who do you want a closer look at? The world is your oyster - but it takes smarts and guts to land those prized players from across the globe.<br/></li><li>Trading \"hard mode\" and a new Trading Reputation brings you to the Big Leagues like never before! Feel what it's like to be a real-world MLB GM, wheeling and dealing with the brightest minds in the business who will stop at nothing to help their teams win!<br/></li><li>Updated Owner Goals will keep you on your toes! For the first time ever, you can push back at your owner's desires and negotiate with them. Can you keep your owner satisfied, while also bringing in the fans and the players to take you to a World Series championship?<br/></li><li>Improved AI throughout every aspect of the game! Can you lock in your superstars with the improved contract negotiations? Can you outfox your opponent with all-new trade negotiations? Running your organization has never been so deep and challenging!<br/></li><li>All-new on-screen analytics! You see the action and power your decision-making like never before! See where the batter is likely to hit the ball before the pitch, or dig in to a whole new view of the field with an action replay. You've never seen Out of the Park Baseball on the field quite like this!<br/></li><li>Upgraded MLB Live Starts and all-new KBO Live Starts! Pick up the 2023 MLB season from ANY DAY OF THE YEAR! And - for the very first time in history - KBO Live Starts! Start your MLB or KBO season from any time in 2023, with accurate standings, rosters, injuries, trades, and more!<br/></li><li>New 2023 MLB rosters and rules! As always, Out of the Park Baseball features up-to-the-minute 2023 MLB rosters that get updated all season long, with every franchise represented from its big league club all the way down to the low minors, and everywhere in between!<br/></li><li>Many, many more improvements, all built upon the incredibly deep award-winning Out of the Park Baseball engine.</li></ul><br/><strong>Perfect Team 24 mode:</strong><br/><br/>Perfect Team is an incredible<strong> free online competition mode</strong> in Out of the Park Baseball that shook up the industry when it first launched in OOTP 19. Assemble, customize, and manage your team by collecting baseball cards from the past, present and future of Major League Baseball. Set your strategy and tactics, then compete against players from around the world to see who is truly the best!<br/><br/>Do you have what it takes to build the Perfect Team?<br/><br/>New features in PT 24 include:<br/><ul><li>Thousands of new player cards with beautiful new artwork.<br/></li><li>An all-new pitcher BABIP model changes the game - and introduces new levels of strategy across the entire competitive platform, from League play to Tournaments and Perfect Drafts!<br/></li><li>An all-new Perfect Team Live mode lets you earn amazing rewards every day of the 2023 MLB season! Set your lineup and rotations based on your Live cards and reach the top of the Perfect Team Live leaderboards!<br/></li><li>Big rewards for League Promotion scale as you move from lower tiers to higher ones - all the way to Perfect League!<br/></li><li>Bigger and better Tournament competitions and rewards - including, for the first time-ever, exclusive \"Entry Fee\" tournaments that let you compete with the best in the world for amazing prizes!<br/></li><li>New content all season long, including big surprises, incredible content partnerships with old friends and new, and - for the first time ever - some legendary players as you've never seen them before.<br/></li><li>Amazing new content partnerships with familiar names - and new ones too!<br/></li><li>The LIVE Head-to-Head Perfect Team World Championship eSports event returns! Can YOU be the world’s greatest Perfect Team player - and prove it LIVE to a worldwide audience?<br/></li><li>Plus! Dozens of surprises big and small all year!</li></ul>", "metacritic": null, "released": "2023-03-24", "tba": false, "updated": "2023-03-27T03:45:54", "background_image": "https://media.rawg.io/media/screenshots/de5/de5fc2cbe9495d3ff2bcece3fbde13f0.jpg", "website": "https://www.ootpdevelopments.com/out-of-the-park-baseball-home/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 7, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Out of the Park Developments"], "genres": ["Strategy", "Simulation", "Sports", "Indie"], "publishers": ["Out of the Park Developments"], "esrb_rating": null}