{"id": 946613, "slug": "yi-shi-jie-za-huo-pu-skyscraper-in-another-world", "name": "异世界杂货铺 skyscraper in Another world", "name_original": "异世界杂货铺 skyscraper in Another world", "description": "Before purchasing, you can understand the basic gameplay and overall quality of the game through the page introduction, video, and pictures.<br/>This game is independently developed, you can report bugs encountered in the game in the following ways:<br/>Steam Community Forum<br/><br/>Game introduction<br/>You will play as a businessman, running a grocery store, make money through retail and other methods, and then continue to grow and develop with the goal of becoming the first chamber of commerce on this continent<br/><br/>Basic gameplay<br/><ul><li>Selling goods: By signing contracts with suppliers, purchasing goods, and then selling them to various customers to earn the difference.<br/></li><li>Place facilities: By building various facilities and rooms, attract customers to spend and increase income.<br/></li><li>Adventure collection: Go on adventures on various maps, collect raw materials, and obtain special items.<br/></li><li>Build production: By building various commodities by yourself, you can reduce dependence on suppliers and gain greater profits.<br/></li><li>Pet cultivation: Adventurers can capture all kinds of monsters and bring them back for cultivation. As a partner of adventurers, they can increase their combat power.</li></ul>", "metacritic": null, "released": "2023-03-26", "tba": false, "updated": "2023-03-27T03:49:22", "background_image": "https://media.rawg.io/media/screenshots/479/479d68718b560c4b55a063bb233cf7bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["one game"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["one game"], "esrb_rating": null}