{"id": 946608, "slug": "yong-shi-mo-lu-the-end-of-warriors", "name": "勇士末路 The End of Warriors", "name_original": "勇士末路 The End of Warriors", "description": "Cruel aristocrat Lord ruthlessly disrupted your life, anger in your heart reverberated, you resolutely embarked on the road of revenge, the end of the road is the end or life?<h3>A world of random change</h3>Each gambit will have a different experience, and enemies will be randomly generated. You can recruit your companions in pubs, strengthen your equipment at the forge, and challenge elite enemies for generous rewards.<h3>Full of unknown events</h3>You may encounter a vicious robber, you may encounter a kind farmer, when you encounter a homeless beggar choose to help or ignore, everything is full of uncertainty.<h3>A rich mix of skills</h3>There are 9 different classes in the game, and each class has a different talent route. Adjust your team and talent properly to create a relaxed battle scene.<h3>Reasonable role development</h3>Weapon oil and special accessories in the game can strengthen your hero, choose a good hero route, let the class advantage to play the biggest role.<h3>A challenge full of strategy</h3>You need to manage your resources carefully. If you are not careful, you may lose your companions forever. If you blindly explore the unknown in the map may also invite mercenary attacks due to increased urgency, which choice is up to you.", "metacritic": null, "released": "2023-03-24", "tba": false, "updated": "2023-03-27T03:37:01", "background_image": "https://media.rawg.io/media/screenshots/93d/93daa84906aebc17f48c5503464ef3d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Firebird"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Firebird"], "esrb_rating": null}