{"id": 946717, "slug": "shedx-ludum-dare-32-jam-prototype", "name": "SHEDX (Ludum Dare 32 Jam prototype)", "name_original": "SHEDX (Ludum Dare 32 Jam prototype)", "description": "<p>Published in memory of Esdeer aka BSOD - a game designer, a visual artist, a composer, a friend.</p>\n<p>A prototype for a Ludum Dare 32, immediately next one to the 31 where the Castle of no Escape 1 was made.</p>\n<p>Yes, it's the same Cardinal N'Rgon sprite that was used by Esdeer for a Castle of no Escape 2 hero, and was on sale (together with the Lizardian Huntress) on Envato Market's GraphicRiver sometime in 2015.  In sum with the other pixel art there, he had 32 sales and an icon for reaching $100 of revenue, which of course was nowhere near the profits from ConE2 in 2017+.</p><p>This game was supposed to be a mouse-controlled tactic/strategy game with element-based vulnerabilities, but the idea was scrapped because of no real idea of how it should work.</p>\n<p>From original Ludum Dare description, 20th or April, 2015:<br/></p>\n<p>I've got this bad (or is it? maybe actually not) habit of submitting a game that is actually in an alpha or beta stage, so here we go again. Planned 4 bosses, ended up with 2, just so you know. Now let's have just a cup of Touhou!<br/><br/>Arrows - move<br/>Z or CTRL - shoot<br/>Shift for slow movement<br/><br/>Of course, post-jam development is planned.</p>\n<p>Credits:</p>\n<p>Xitilon.HD408 - programming and game design (and failing to implement the first two game designs)<br/>Xeneder - backgrounds<br/>Esdeer - sprites and music (made a while ago, so Audio was excluded from the Ludum Dare's rating)</p>", "metacritic": null, "released": "2023-03-27", "tba": false, "updated": "2023-03-27T05:25:24", "background_image": "https://media.rawg.io/media/screenshots/a10/a10ad6a47d0d033ece527e5121901515.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Xitilon"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}