{"id": 946707, "slug": "jerrys-night-shift", "name": "Jerry's Night Shift", "name_original": "Jerry's Night Shift", "description": "Story:\r\n<p>After applying for a job at the local cemetery, Jerry was informed that he had been hired and could start working that night. Upon arrival, he received a flashlight and a note that told him that there are ghosts in the cemetery that would try to kill him, it was not a joke, and to turn back now before it was too late. Jerry thought nothing of it and assumed it was only a silly little joke. Unknowing of what would await him there, Jerry walked into the cemetery, and as for what happens next, well... you'll have to find that out for yourself.</p>\r\nControls:\r\n<p>W: Jump</p>\n<p>A/D: Move</p>\n<p>Left click: Toggle flashlight on/off</p>\n<p>Spacebar: Dodge</p>\n<p>0: Absolutely nothing ;)</p>\r\nOther things you should know:\r\n<ul><li>The flashlight takes about 3 minutes to deplete fully, but there are ways to charge it.</li><li>What the different modes change:<ul><li>Easy - The only types of ghosts that spawn are the Ghosts, Heart Ghosts (drop hearts when killed with a chance to drop different types of hearts), and Lightning Ghosts (charge your flashlight by 25% when killed, but if they attack you, you lose 5%)</li><li>Medium - Rage Ghosts (are faster) and Crazy Ghosts (can drop almost any item) now spawn</li><li>Hard - Glass Ghosts (harder to see) and Dark Ghosts (darker the screen and drop a peculiar item) also appear.</li><li>Hell - Ghosts spawn twice as frequently (only the blue ones, though), Glass Ghosts are invisible until you hit them with your flashlight, Lightning Ghosts are 2x faster, Heart Ghosts drop a... different... item, and the prize wheel at the end of the level is gone</li></ul></li></ul>\n<ul><li>This is my first attempt at making a game, so constructive feedback would be appreciated.</li><li>You don't have to pay for the game, but any donation would be GREATLY APPRECIATED! It will help me learn, expand my skills, and continue to create games!</li></ul>", "metacritic": null, "released": "2023-03-27", "tba": false, "updated": "2023-03-27T05:21:06", "background_image": "https://media.rawg.io/media/screenshots/5ef/5efb314260db9275a9df68b7afe0a63a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["RetroNova"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}