{"id": 946879, "slug": "knights-guns", "name": "Knights & Guns", "name_original": "Knights & Guns", "description": "<h3>Knight in shining armor, fight your way... with Guns!</h3>Inspired by the classics, developed for the modern audiences.<br/><br/>A classic revenge story set in a medieval fantasy world… with a touch of deadly modern firepower just to turn things up to eleven. Fight through the armies of undead, mutants, aliens, machines and beasts in order to get back what is rightfully yours and bring some semblance of peace back to the land. Who knows - if you’re thorough enough, you might even discover the history of the kingdom itself, long-lost to the scholars of the realm.<br/><br/><br/><br/>Knights &amp; Guns brings you to a dangerous world where you will fight, alongside your friend, against demons, ghouls &amp; ghosts. Use shotguns, lasers and the power of chivalry to overcome every obstacle. Become the best version of a knight - one with a gun.<br/><br/><br/><br/>Embrace the non-linear map, pacing yourself through carefully designed stages or rushing head-on into the chaos. Whether you're solo or joining forces with a friend in co-op multiplayer, your journey is yours to define.<br/><br/><br/><br/>Inside the game:<br/>• Fight awesome bosses on various stages!<br/>• Conquer the non-linear world! Rush through over 150 hand crafted stages, or enjoy the game at your own pace, looking for secrets and special routes!<br/>• Entire game designed for both single player or co-op multiplayer. Invite a friend at any time for some extra firepower and mayhem.<br/>• Try the different modes! Hunt the monsters! Survive! Play on small, big and narrow maps!<br/>• Check out all the awesome suits of armor and, of course, all the GUNS! Lasers, shotguns, grenade launchers, sniper rifles... They are all here!<br/>• Traps, chests, keys, scrolls of lore, books of monsters...", "metacritic": null, "released": "2023-03-26", "tba": false, "updated": "2024-04-19T10:12:09", "background_image": "https://media.rawg.io/media/screenshots/377/377ea49c2f7a4a1c496118dbefa4cafd.jpg", "website": "https://baltorogames.com/game/knights-guns/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Baltoro Games", "The Cool (not that much) Dev"], "genres": ["Action", "Shooter", "Adventure", "Indie"], "publishers": ["Baltoro Games"], "esrb_rating": null}