{"id": 94691, "slug": "nepenthe-itch", "name": "Nepenthe (itch)", "name_original": "Nepenthe (itch)", "description": "You wake up with no memory. Your day is starting off great!\r\n<p>Nepenthe is a hand-drawn RPG with a terrible sense of humor. Set in the strange world of Carithia, you play as a creepy bald dude who lost his memory. Yes, you read that right. Meet some very polite monsters, and battle both them and your sense of self-dignity in epic bullet-hell fight scenes.<br/></p>Definitely not a potato in a trench coat\r\n<p>Sporting a childish hand-drawn art style, Nepenthe is sure to either make you love it at first glance, or throw your computer away. The developer of Nepenthe takes no responsibility for such actions, and recommends drinking chamomile tea. “It’s really soothing,” he says. “You should really try it one day,” he says. “What was I talking about?” He asks. There is an awkward pause.<br/></p>designed for non-psychopaths, mostly\r\n<p>With three different endings, and countless side-quests, Nepenthe is designed for ultimate replayability. This can get quite annoying if you need to share a computer with someone else. Trust me. Almost every monster can be spared, for added challenge and less violence. They can also be killed - don’t worry, you psychopaths! If you enjoy dad-jokes or Chinese water torture, Nepenthe is for you.</p>\r\nBe psychoanalyzed by a monster!\r\n<p>Nepenthe is designed for both casual and hardcore gamers alike. Explore two \"modes,\" \"Adventure\" or \"Story,\" to find the play-style that best suits you.</p>\r\nStory or Adventure?\r\n<p>\"Adventure\" mode is a bullet-hell extravaganza, with ever increasing difficulty as the game progresses.</p>\r\nBattling legislation is always hard\n<br/>\n<p>\"Story\" mode's battles are easy one-click things, designed for those who just want the story, not the gameplay.</p>\n\r\nBattle Ninjas! ...if you want to, of course, we're not suggesting you actually do it..\r\n<p>Join us, as we stare into the Orb together.</p>\n<p>(also, feel free to join the Nepenthe Discord https://discord.gg/VtcyUB)</p>\r\nStare into the orb...<br/>", "metacritic": null, "released": "2017-09-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a93/a9305ec983560f3e215350409a821403.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Yitz"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}