{"id": 94700, "slug": "oh-im-getting-taller", "name": "Oh I'm Getting Taller!", "name_original": "Oh I'm Getting Taller!", "description": "In a grey world full of adults who just care about their business, youngsters tend to daydream and delve deep into their own fantasy realms.Story:<p><strong>Oh! I'm Getting Taller!</strong> is a light-hearted puzzle-platform game about a kid and his desire to grow up. Amazed, he notices that every day he grows so much that he can easily reach things he couldn't even see before. Through his eyes you will have to discover how his town changes from a grey piece of concrete to a vibrant imaginary world.</p><p>At the same time, you will have to interact with his family, friends, foes and why not, his first crush. Will his happiness and imagination survive until he reaches adulthood or will the world change him like it did with anyone else? Make the right (or wrong, that depends entirely on you) decisions and discover thanks to multiple endings how they affect his surroundings and his future!</p>Team:<p><strong>\"Oh! I'm Getting Taller\"</strong> was developed as a cooperative prototype project between Elf Games Works, Reverie Project and Andrea Fumagalli for the 2015 Indie Game Maker Contest. It won the Best Platform award.</p><p>As from 2016, the team started working on it again, in order to make it a complete game.</p><p>The current release is a bug fixed and improved version of the contest one. In the near future we plan to make a new release with new areas, lots of improvements and many endings.</p>Follow us also on:<p>Facebook.com/ElfGamesWorks</p><p>Twitter.com/ElfGamesWorks</p>", "metacritic": null, "released": "2016-05-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ba3/ba3aebb63a819d26cad1ac9962435cdd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Elf Games Works", "ProGM", "Guardian of Irael"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}