{"id": 947179, "slug": "cryptid-companions-chat-gpt-experiment", "name": "Cryptid Companions (Chat GPT Experiment)", "name_original": "Cryptid Companions (Chat GPT Experiment)", "description": "A game created in tandem with Chat GPT for the Sisters Processing podcast (2 day project)! \r\n<p>I did a bit of the scripting that it was having a hard time with, but otherwise guided the AI through the scripting process and it did pretty great! It also chose the color palette for the intro screen, made that ASCII art, and told me the notes to put in for the music (as well as the beat) which I then arranged in a less maniacal way.</p>\n<em>Note: Fullscreen recommended to avoid that turning glitch in the smaller view! Or just download it for</em><em> the best running version.</em>\r\nControls:\r\n<ul><li>F for Fullscreen (Web Only)</li><li>WASD to move\r\n</li><li>Space (repeatedly) to fly\r\n</li><li>After collecting a berry, hit 'E' to throw it to the Chupacabra babies\r\n</li><li>'R' will reset the game\r\n</li><li>'Exit' will exit out of the game (but not the intro yet)\r\n</li></ul>\n\n<p>Overall, a super fun project!! If you want to hear more on the details of how it was created, check out the Sisters Processing podcast, where I talk to my sis about how it was done.</p>\n<p>Youtube:  https://www.youtube.com/@sistersprocessing<br/>Spotify:  https://open.spotify.com/show/1m8Ij3fHelaKJ4Hixm2ZaE<br/>Amazon: https://www.amazon.com/Sisters-Processing/dp/B0BYCZ9SLV/ref=sr_1_1?crid=307XRK52...</p>\n<p><strong>For even more listening options, check out the Sisters Processing </strong><strong>site at </strong> https://sistersprocessing.com/podcast-information/<br/></p>\r\nPrompt:\r\n\"I would like an idea for a short, simple game regarding chupacabras, bigfoot and a merman. The player will be flying. The game is about friendship between the player and the mythical creatures.\"Chat GPT:<br/>Sure, here's an idea for a short and simple game that  incorporates  chupacabras, bigfoot, and a merman, with the player flying  and the  game focusing on friendship between the player and the  creatures:  <br/><br/>Title: \"Cryptid Companions\" <br/><br/>Gameplay: You play as a flying character who  has befriended three  different cryptids - chupacabras, bigfoot, and a  merman. Your objective  is to fly with each of them and collect items  that they need to complete  a special task. <br/><br/>In each level, you'll fly  with one of the cryptids. The chupacabra level  will have you flying  through a forest area, collecting berries that the  chupacabra needs for  its family. The bigfoot level will require you to  fly through  mountainous terrain, collecting wood that the bigfoot needs  for its  home. In the merman level, you'll have to fly through an  underwater  cave, collecting pearls that the merman needs for its  treasure  collection. <br/><br/>As you collect the items, you'll need to avoid obstacles and  enemies  that try to stop you. Once you've collected all the items,  you'll  deliver them to the cryptid and they'll reward you with a  special item  that will help you in the next level. <br/><br/>The game focuses on  the idea of friendship and cooperation between  different creatures,  showing that even mythical creatures can have bonds  with humans.", "metacritic": null, "released": "2023-03-25", "tba": false, "updated": "2023-03-27T08:45:25", "background_image": "https://media.rawg.io/media/screenshots/20b/20b20b5cb9fe2e7855abd21cdb92427b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["NvrSkipGameDay"], "genres": [], "publishers": [], "esrb_rating": null}