{"id": 947168, "slug": "keeper-of-time", "name": "Keeper Of Time", "name_original": "Keeper Of Time", "description": "<p>In the Space Between Time, a magnificent tower stands, governing the laws of time. Protected by the Keepers, a people dedicated to the continued flow of time, life is peaceful and the cycle continues. But one day, a traitor slips into the Tower and steals away its heart, the Time Gear. They cast it away into another time, and the world begins to unravel. But one young Keeper refuses to give into the despair, and jumps in after the Time Gear.<br/><br/>Reclaim the Time Gear. Fix what has been broken. Save those who were lost.<br/><br/>Keeper of Time is a 3D platformer centering on one Keeper's journey to an ancient island, now plagued by the rifts in time. Use your platforming abilities to overcome the trials before you to restore order to time once again.<br/><br/>BellChime Studio's final project! We hope you enjoy it!<br/><br/>Controller is supported, but will need to use kb&amp;m for UI interactions. Sorry for the inconvenience.<br/><br/>Controller Map:<br/>Move - Left Stick<br/>Look - Right Stick<br/>Jump - Bottom Button<br/>Special Action - Left Trigger</p>\n<p>Patch Notes 1.01<br/>- Changed Dialogue UI for nicer font and speed<br/>- Made branches wider in first level (If you already beat it you can say you beat it when it was harder)<br/></p>\n<p>BellChime Studio Credits:<br/>Daniel Le - Director<br/>Kiana Burnett - 2D Artist<br/>Daniel Cherng - 2D Artist<br/>Bill Chen - 3D Artist<br/>Stephany Lam - 3D Artist<br/>Roo Mutch - 3D Artist<br/>Jadon Ark - Audio Engineer<br/>Alejandro Johnson - Audio Engineer<br/>Simon Cho - Designer<br/>Leo Paragili - Designer<br/>Eric Park - Designer<br/>Victoria Winn - Producer<br/>Brendon Mye - Programmer<br/>Joshua Nunez - Programmer<br/>Thomas Wang - Programmer<br/>Shawn Xia - Programmer<br/>Hung Bui - Technical Artist<br/>Ashley Ly - UI Artist<br/>Andre Wells - Writer<br/><br/>Special Thanks to Tim Morten<br/></p>", "metacritic": null, "released": "2023-03-26", "tba": false, "updated": "2023-03-27T08:39:36", "background_image": "https://media.rawg.io/media/screenshots/271/27176b2017761d591bc316932cd2fdf0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Saffrona", "pjheric", "captaindiz", "Tahmoose", "Megalorix", "Pachwoom", "Puggytatoes", "scho22", "JadDoggy", "Funbam", "LeoParagili", "Nunez2000", "waterFalt777", "Daniel Cherng", "sirensorandre"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}