{"id": 94725, "slug": "ultra-hell", "name": "ULTRA HELL", "name_original": "ULTRA HELL", "description": "<p>ULTRA HELL is a prototype game that I've been developing in my free time during the past few months. The game is unpolished, unbalanced, unforgiving, and, more often than not, flat out unfair. However, for some reason, I still think the game is quite a bit of fun. I'm thinking about potentially working on it a bit more and releasing the game as a $1.99 bargain bin steam game.</p>\n<p>So far the prototype currently has 3 playable characters, 2 bosses, and ends after 145 seconds. I am planning on making the final game 5 minutes long in total. However, I highly doubt any of you would get any of you would get that far. Also there's no music/ sound effects, so play your own music in the background.</p>\n<p>If you played it, please give me feedback and tell me whether you had any fun with the game. If any of you actually make it past the 70 or 140 second mark, please tell me how much time it took you and your thoughts on the game!</p>\n<p>Also, I am looking for help/advice on finding a publisher for a small game like this. Any sort of help would be appreciated. Thanks!<br/></p>\n\n<p>Basic Tips:</p>\n<p>1. Kill big enemies faster for more points. Points let you level up, which will upgrade your characters in various ways.</p>\n<p>2. Play aggressively, but not too aggressively.  Enemies will stack up if you don't kill them fast enough, and you'll get overwhelmed.</p>\n<p>3.  GUNZ can dash/ glide by pressing space and EDGE can teleport to his thrown katana. Use these movement abilities wisely to both evade and chase after enemies. </p>\n\n<p>Full Video Walkthrough:</p>\n\n<p>More Tips and Tricks Here: https://pastebin.com/UMHhgpDr</p>\n<p>Twitter: https://twitter.com/mustard_bucket</p>\n<p>Mailing List for Updates: https://goo.gl/forms/ciADDwyF7K97Xwmv2</p>", "metacritic": null, "released": "2017-12-17", "tba": false, "updated": "2019-08-28T23:25:47", "background_image": "https://media.rawg.io/media/screenshots/bd5/bd59c95f13ef3226fd1bdbceca317509.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["mustardbucket"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}