{"id": 947223, "slug": "captaine-cortex-et-le-retour-de-la-gueule-de-bois", "name": "Cap’taine Cortex et le retour de la gueule de bois", "name_original": "Cap’taine Cortex et le retour de la gueule de bois", "description": "<p><strong>Le Jeux :\r\n</strong><br/>Cap'taine Cortex se souvient d'avoir passé une soirée absolument épique ! Mais derrière les effluves d'alcool et la gueule de bois monumentale, impossible de se souvenir comment il est arrivé au milieu du terrible Donjon d'Atomic Boomer, son pire ennemi. \r\n</p>\n<p>Pas moyen non plus de se souvenir du chemin vers la sortie... Heureusement, les neurones de Capt'aine Cortex se souviennent et sont toujours là pour l'aider !\r\n</p>\n<p>Utilisez les pouvoirs de mémorisation des neurones de Capt'aine Cortex pour lui permettre d’échapper aux pièges d'Atomic Boomer et sortir de son Donjon vivant.<br/><br/><strong>Trailer : </strong></p>\n\n<p><strong>Informations :\r\n</strong><br/>Ce jeu a été fait dans le cadre de la Scientific Game Jam « édition Lyon » 2023. Il a été conçu, codé, dessiné, débuggé et uploadé en 48h. \r\n</p>\n<p>Il se base sur des études sérieuses (si si !) démontrant l’existence de neurones dans notre cerveau, nommés ”cellules de lieux”, dont la particularité est de représenter notre position dans l’espace. A la manière d’un GPS, différentes cellules de lieux vont s’activer successivement dans différents endroits, permettant de coder une “carte cognitive” de notre environnement. Comme pour le cerveau de Capt'aine Cortex, différents neurones représentent différentes informations dans cette carte cognitive, comme les neurones dopaminergiques, essentiel pour la représentation de la récompense.\r\n</p>\n<p><strong>Crédits : </strong>\n<br/></p>\n\r\nJulien Coutouly, Game Developer\r\n\n\r\nOceane Lao, Artist\r\n\r\nStan Zbinden, Artist\r\n\r\nEliott Pustel, Game Designer\r\n\r\nLukas Tamayo, Sound Designer\r\n\r\nRaphaël Brito, Scientist and pixel art", "metacritic": null, "released": "2023-03-25", "tba": false, "updated": "2023-03-27T09:04:17", "background_image": "https://media.rawg.io/media/screenshots/ea3/ea3b206e9c3b9f8f48535c06003ce975.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["BinaryGleam", "Hornicar", "Julien Coutouly", "ElyottoSan", "Clopans", "oceanelao"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}