{"id": 947396, "slug": "fall-beans-sanmaniro", "name": "Fall Beans (sanmaniro)", "name_original": "Fall Beans (sanmaniro)", "description": "<p>Fall Beans is a fun and addictive game where players control a cute bean character and try to make it through three stages of obstacle courses. The game has a similar idea to Fall Guys, where players must overcome obstacles and outrun other players to reach the finish line.</p>\n<p>In the first stage, players navigate through a series of platforms and obstacles that get increasingly difficult to overcome. The platforms move and disappear, and players must jump, dodge, and maneuver their way through to avoid falling to their demise. As players progress through the stage, the obstacles become more challenging, requiring quick reflexes and precision movements.</p>\n<p>In the second stage,The player has to pay attention and remember the location of the fruit images in the area that is divided into parts of the images, then pay attention to the image that is displayed on the screen until he stops. He must choose the wrong image, which leads to loss and exclusion. Fun requires quick movement and attention.</p>\n<p>In the final stage, players must navigate across a series of floors that move . Players must keep their balance and avoid falling off the edges of the floors as they move forward. The final stage is the most challenging of all, and players must be extremely careful and precise in their movements to make it to the end.</p>\n<p>Overall, Fall Beans is a fun and engaging game that requires quick reflexes, strategic thinking, and precision movements. With its colorful graphics, cute characters, and challenging levels, Fall Beans is sure to provide hours of entertainment for players of all ages.</p>", "metacritic": null, "released": "2023-03-25", "tba": false, "updated": "2023-03-27T10:20:58", "background_image": "https://media.rawg.io/media/screenshots/ffb/ffb3e93c606bd9c0e73a553d6ce3e19a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["sanmaniro"], "genres": ["Action", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}