{"id": 947388, "slug": "bloons-tower-defense-itch", "name": "Bloons Tower Defense (itch)", "name_original": "Bloons Tower Defense (itch)", "description": "<p>Here it is! Bloons Tower Defense! Enjoy friends!</p>\n<p>This is my first proper game (the others are either remixes or prototype versions) so please don't blame me for the unprofessionalism. :)</p>\n<p>I HIGHLY recommend playing this game on Turbowarp (interpolation makes the movement more smooth and there is no clone limit when infinite clones are enabled): https://turbowarp.org/716558652?clones=Infinity&amp;interpolate</p>\n<p>Description:</p>\n<p>Stop any of the enemies (Bloons) from escaping the maze by the building towers. They can throw darts, bombs and even sending out tacks and ice.</p>\n<p>Here are the links (as I promised):</p>\n<p>Bloons: https://unblockedgames66.sites.google.com/site/playunblocked66/bloons</p>\n<p>Bloons Tower Defense: https://sites.google.com/site/thegamecompilation/bloons-tower-defense</p>\n<p>Bloons Tower Defense 2:</p>\n<p>https://unblockedgames66.sites.google.com/site/playunblocked66/bloons-tower-defe...</p>\n<p>Update History:</p>\n<p>Current Version: 3.6</p>\n<p>Version 3.6: Spikey Ball Tower Attack signficantly decreased from 1.4 seconds to 2 seconds. Now classed as a slow shooting tower.</p>\n<p>Version 3.5: Tack Tower Attack Speed increased from shooting every 1.8 seconds to 1.5 seconds.</p>\n<p>Version 3.4: Dart projectile size increased by 4%. Fixed tower layering issues and glitches.</p>\n<p>Version 3.3: Dart Tower Attack Speed increased from shooting ever 0.6 seconds to every 0.45 seconds. Now that game can be beaten with no lives lost. </p>\n<p>Version 3.2: Decrease pierce of spikey ball tower and attack speed from attacking every second to every 1.4 seconds. Now it is classed as attacking with medium speed instead of fast.</p>\n<p>Version 3.1: Changed cost of spikey ball tower from 650 to 1000 money. It was simply too OP and too easy to purchase and spam them. XD</p>\n<p>Also added the unaffordable message if you click the spikey ball tower icon and don't have enough money.</p>\n<p>Version 3.0: A new tower has been added, the Spikey Ball Tower! This tower was scrapped when Bloons Tower Defense was in development in 2007. I have made it far more viable as a tower because it used to shoot very slowly. Four spikey balls shoot out in 4 directions. This is an extremely useful tower that is even better than tack tower's late game.</p>\n<p>Version 2.9: Added two new sound tracks, the menu theme song from Raft Wars and the menu theme song from Raft Wars 2.</p>\n<p>Now all bloons spawned with be rotated slightly randomly. </p>\n<p>Version 2.8: All Bloons types have increased in movement speed.</p>\n<p>Red Bloon: 2.2 - 2.5</p>\n<p>Blue Bloon: 3 - 3.5</p>\n<p>Green Bloon: 4 - 4.5</p>\n<p>Yellow Bloon: 7 - 8</p>\n<p>Black Bloon: 3.5 - 5</p>\n<p>White Bloon: 4 - 6</p>\n<p>I wanted the red bloon to not look so slow and trailing. My main focus was making the Black bloons and White bloons a lot more powerful because I think late game was quite disappointing. So the main increases were towards the black and white bloons. This should make my game slightly more difficult, I want it to be challenging like the original but alas I doubt it ever will be. :(</p>\n<p>I also added Dr Zomboss theme from PvZ as a new soundtrack and the game over screen layering has been improved (should resolve the layering issues now).</p>\n<p>Version 2.7: Added 4 different songs as music for the game! First is Bloons IOS theme song, second is Sunshine Boulevard (from Learn to Fly 1 game), third is BTD4 theme song and final is the Old original BTD5 theme song. Identical to my Bloons Tower Defense Supermonkey game. Hope you guys are happy. :D</p>\n<p>Version 2.5: Bomb Tower now shoots every 1 second or so (0.2 seconds faster than before) and bomb projectiles now moves much faster. Start button should no longer appear once round 50 is beaten.</p>\n<p>Version 2.3: Tack Tower attack speed increased from shooting every 1.8 seconds to 1.6 seconds. This should make dealing with yellow bloons far easier. ;)</p>\n<p>Version 2.2: Tack Tower attack speed increased from shooting every 2 seconds to every 1.8 seconds. Should make tack towers only challenge easier and more doable.</p>\n<p>Version 2.0: Changed tack tower projectiles. Now tacks share the same AI as darts, this is critical because now tacks have only one pierce, before it was infinite making the tack tower OP. As the second version, I also added a nice little surprise. Don't tell. ;)</p>\n<p>Credits to bloonsfan12345 for reminding me of this and asking me to implement it into the game.</p>\n<p>Renamed project from Bloons Tower Defense 1 on Scratch to Bloons Tower Defense just like the thumbnail! Any other BTD1 features that you want to see, please let me know (apart from upgrades XD).</p>\n<p>Version 1.9: Changed bomb tower attack speed from 1.4 to 1.</p>\n<p>Version 1.8: Changed dart tower attack speed from 0.4 to 0.6.</p>\n<p>Version 1.7: Changed tack tower attack speed from 1.6 to 2. Changed thumbnail from original to current one.</p>\n<p>Version 1.4: Ice Tower Bug is 90% fixed. Previously some bloons would move extremely quick and appear frozen making it invincible. If it got through, it was a game over.</p>\n<p>Version 1.2: Fixed tower range circles. Bug where when one tower was selected range circles for all of its tower type was shown.</p>\n<p>Version 1: Game released</p>", "metacritic": null, "released": "2023-03-25", "tba": false, "updated": "2023-03-27T10:18:07", "background_image": "https://media.rawg.io/media/screenshots/3c5/3c5107b090365b7972caa5d8eb7b014d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["SamadiBeligaswatte1"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}