{"id": 947579, "slug": "that-night-toripuru", "name": "That Night (Toripuru)", "name_original": "That Night (Toripuru)", "description": "<p>\"That Night\" is a simplistic action-packed game that challenges players to survive and defeat a horde of terrifying monsters while trying to achieve higher and higher scores.\r\n</p>\n<p>Players take on the role of a fearless adventurer, equipped with a variety of weapons and abilities, as they explore dark and dangerous environments filled with lurking creatures. Enemies are getting stronger and more numerous as the player progresses.\r\n</p>\n<p>To survive, players must use their wits and reflexes to dodge enemies, strategically use their weapons, and collect power-ups to gain an edge over their monstrous foes. As they progress, players can unlock new upgrades, allowing them to face tougher challenges and score even higher.\r\n</p>\n<p>But time is not on their side, as the monsters are relentless in their pursuit. Players must keep moving, running to avoid getting caught while still fighting back with everything they've got.\r\n</p>\n<p>As the game continues, players can earn achievements and climb the discord leaderboard, competing against other players around the world to see who can achieve the highest score and survive the longest against the monsters.<br/><br/>This game is currently in the early development stage. There are many things planned in future updates. If you have any ideas make sure to share them on our discord server.<br/><br/>Currently works properly only on 64-bit Windows with 1920x1080 resolution. But support for every device is coming soon.<br/><br/>https://discord.gg/JWYWn2nSnt<br/></p>", "metacritic": null, "released": "2023-03-24", "tba": false, "updated": "2023-03-27T11:44:46", "background_image": "https://media.rawg.io/media/screenshots/a2a/a2aef811a24becc31218b963a994d355.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Toripuru"], "genres": ["Action", "Shooter", "Strategy"], "publishers": [], "esrb_rating": null}