{"id": 947572, "slug": "nonplatonic-forms-teaser-demo", "name": "NonPlatonic Forms Teaser Demo", "name_original": "NonPlatonic Forms Teaser Demo", "description": "People say that if you fall asleep in a certain theater, something very bad will happen to you...\r\n\n<p>From the creator of <em>May I Take Your Order</em> comes a horror romance about a tricky  human and a hungry storytelling god. Can you help Lee separate matter from myth, and navigate his way to freedom? Or will the dread deity scoop out his free  will, and make Lee into a sycophantic member of his eternal audience?<br/></p>\n\n<p>Drop a $5 tip to get an early access build, or back me on patreon to help fund development of the game! Currently, I'm working on this when I can, as a passion project, but we're over halfway toward my goal of getting to do regular updates!<br/></p>\n\n<p>The  current early access build has:         </p>\n<ul><li>Over 16,000 words, \r\n</li><li>A queer central relationship between a would-be trickster trans guy and a pompous GILF god, \r\n</li><li>A comedic tone, interspersed with moments of mind-bending cosmic horror.</li></ul>\n<p>However, I've got a lot more of the game left to show, and I'm   already writing more! The rough draft of the game is over 43,000 words,   and I'm planning for the final version to have:         </p>\n<ul><li>Finalized art,</li><li>Plot relevant H-Scenes,</li><li>A branching story structure with endings full of dark fates and   various outcomes to Lee and Diegesis' competition, </li><li>and just maybe, a happy True End. \r\n</li></ul>", "metacritic": null, "released": "2023-03-24", "tba": false, "updated": "2023-03-27T11:42:06", "background_image": "https://media.rawg.io/media/screenshots/b22/b22395bc1d718f93aef07a3a3c38c206.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "macOS", "PC"], "developers": ["AlexisRoyce"], "genres": [], "publishers": [], "esrb_rating": null}