{"id": 947618, "slug": "aliens-again", "name": "Aliens Again!!!", "name_original": "Aliens Again!!!", "description": "<p><em>Aliens Again!!!</em> foi  desenvolvido durante o curso de Programação de Jogos Eletrônicos do  Centro Estadual de Educação Técnica (CEET) Vasco Coutinho para  cumprimento da disciplina de Programação 3D para Jogos  (2022JOGOSNOTMOD203). <br/></p>\n\n<p><strong>✦  ✦  ✦<br/></strong></p>\n\n<p>UNESF Solitude - UNE, 4 de driadan de 2523 r.T.<br/>Do comissário Leroy<br/>À diretóra de segurança do 11º Comando Unificado, Emily Comarella Fontainelles<br/>Assunto: Relatório de ocorrência/Solicitação de resgate<br/>Registro: Nº 240-SLTD<br/></p>\n<p>Os tripulantes do Encouraçado UNESF Solitude foram acionados as 8h do dia 11 de coronian de 2523 r.T. para uma missão cujo o objetivo era investigar o desaparecimento do Porta Contentores Mirage-37. O cargueiro fez sua ultimo contato as 20h do dia 10 de coronian de 2523 r.T. perdendo comunicação em rota do planeta Forward, colônia da Nação Unificada da Terra (Unified Nation of Earth – UNE).<br/>...<br/>Ao decorrer da missão, no dia 26 de coronian de 2523 r.T. nossa espaçonave foi atingida por algum tipo de pulso eletromagnético de fonte desconhecida, ocasionando um apagão dos sistemas da nave, incluído os meus sistemas. <br/>...<br/>Após três dias do ocorrido, durante o dia 1 de driadan r.T. meus sistemas foram restabelecidos, porém não haviam sinais de tripulantes sobreviventes. O meu controle sobre 67% da espaçonave havia se perdido, restando apenas setores da proa e do bombordo. <br/>...<br/>O ataque foi causado pelos demônios que destruíram a capital de Nuwa e eles haviam tomado o controle do encouraçado e pareciam vagar pelos corredores e pelas cabines saqueando os equipamentos.<br/>...<br/>Como diretiva de sobrevivência, selei todas as portas sobre meu controle e tentei restabelecer os sinais vitais e  interromper a criogenia de alguns dos oficiais a bordo. Porém, por conta do incidente, obtive sucesso apenas em restaurar os sinais de Shb.  Dominique (minha sétima tentativa). Todos os seis oficiais anterior foram perdidos.<br/>...<br/>Por conta da falta de tempo, ao invés de me reconectar aos sistemas do restante do encouraçado, descidi priorizar a solicitação de resgate e o envio desse relatório. Ordenei que Shb.  Dominique levasse meu núcleo diretamente ao comunicador de Varya Zima  no exterior da espaçonave. <br/></p>\n\n<em>Bandeira da Nação Unificada da Terra (Unified Nation of Earth – UNE).</em>\n\n<p><strong>✦  ✦  ✦\r\n<br/></strong></p>\n<p>\n</p>\n<p><strong>Comandos<br/></strong>Setas do teclado - Movimentação<br/>Shift - Corrida<br/>Botão Esq do Mouse - Disparo<br/>Botão Dir do Mouse - Mira<br/>P - Pausar</p>\n\n<p><strong>✦  ✦  ✦<br/></strong></p>\n\n<p><strong>Design do jogo</strong><br/>Boldoboldin - Henrique Baldo</p>\n<p><strong>Artes conceituais<br/></strong>João Travassos (aliens)<br/>Boldoboldin (armas e espaçonave)<br/></p>\n<p><strong>Artes 2D<br/></strong>Dogmatic (skybox)*<br/>Eren Katsukagi - João Paulo (texturas)<strong>*</strong><br/>Boldoboldin (HUD)</p>\n<p><strong>Modelos 3D</strong><br/>DJMaesen (alien)*<br/>FUZE Technologies (mão)*<br/>Boldoboldin (armas, itens, espaçonave e armaduras)</p>\n<p><strong>Animações<br/></strong>Boldoboldin (disparo e recarga)</p>\n<p><strong>Efeitos Visuais</strong><br/>Unity Technologies (VFX)*<br/></p>\n<p><strong>Trilha sonora<br/></strong>VOID1 (Menu e jogo)*</p>\n<p><strong> Efeitos sonoros<br/></strong>Michael Baradari (disparo)*<br/>SpringySpringo (recarga)*<br/>qubodup (aliens e O2)*<br/>Kenney (passos e munição)*<br/><br/></p>\n<p><strong>Motor do jogo</strong><br/>Unity Technologies (Unity, 2021.3.18f1)</p>\n\n<p>Agradecimentos: Prof. Fabiano, Prof. William, Prof.ª Renata Machado, Prof. Saulo, Jess e Guilherme.<br/></p>\n<p>Os recursos externos de uso e distribuição livres estão identificados por um asterisco \"*\". <br/></p>\n\n<p><strong>✦  ✦  ✦<br/></strong></p>\n\n<p><em>Somewhere up in space, there are Aliens who are waiting to kick your ass -</em> A random human on an internet forum.</p>", "metacritic": null, "released": "2023-03-24", "tba": false, "updated": "2023-03-27T12:01:01", "background_image": "https://media.rawg.io/media/screenshots/dae/dae3554bed67880f5ddd93be84abd631.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Boldoboldin"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}