{"id": 947755, "slug": "the-re-aliving-of-the-un-alive", "name": "The Re-Aliving of the Un-Alive", "name_original": "The Re-Aliving of the Un-Alive", "description": "<p><strong>SYNOPSIS</strong></p>\n<p>“A year ago, Harriet’s twin brother Gary died in a horrific accident at their grandparents’ house. After that incident, the family could no longer bear to spend any time in that house, so left it was abandoned. </p>\n<p> On the lead up to the first anniversary of Gary’s death, Harriet has been visited by him in her dreams. He has been calling to her, night after night, urging her to come back to the house where he died. After realizing this was more than a dream, she began researching the occult in hopes of bringing her brother back.  </p>\n<p> On the day of Gary’s death-iversary, Harriet returns to the house. The ghostly visage of her brother greets her and together they uncover hidden items in the house to complete a ritual which might bring Gary back to life…“ </p>\n\n<p><strong>DESCRIPTION</strong></p>\n<p>Possess items as Ghostly Gary and touch things with your human hands as Harriet. </p>\n<p>Enjoy an original score by Eric Lindstedt. \r\n  </p>\n<p>Experience the highs and lows of sibling love. </p>\n<p>Re-Alving of the Un-Alive is a humorous two player co-op puzzle adventure game designed for younger teens and families. Inspired by the classic puzzle adventure game Resident Evil (1998) &amp; the classic Scooby Doo cartoon. \r\n</p>\n\n<p><strong>CREDITS</strong></p>\n<p>Product Owner: Gustav Magnusson.</p>\n<p>Scrum Master: Brad Neal.</p>\n<p>Game Design: Brad Neal, Hannah Purnell, Simon Winter, Gustav Magnusson.</p>\n<p>Programming: Petter Hallin, Carl Lindstedt.</p>\n<p>Art: Simone van der Merwe, Kristín Guðmundsdóttir, Fred Schütt.</p>", "metacritic": null, "released": "2023-03-24", "tba": false, "updated": "2023-03-27T13:12:36", "background_image": "https://media.rawg.io/media/screenshots/722/7221dd7754a179cfb6a3f1027abc3131.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Futuregames"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}