{"id": 948010, "slug": "the-secret-life-of-dorian-pink", "name": "The Secret Life of Dorian Pink", "name_original": "The Secret Life of Dorian Pink", "description": "A reimagination of the scandalous Victorian classic, <strong>the Picture of Dorian Gray</strong> by Oscar WildeDorian has put his Gray past behind him. He is now Dorian Pink, a wholesome, wondrous, wrinkly old man, and is boyfriends with Basil Hallward. Alas, Dorian’s old friend, the Devil, kidnaps Basil to cook for a Feastival. Blasphemy!!! Now Dorian has to go back to his Gray past in Hell to rescue his one true love.<br/><br/><br/><br/><br/>To find the Devil, go back to your young, plump, and tender self in Hell. You will make questionable dialog and life choices, such as what ingredient to put into a most important broth, or how you respond to people. What end will be upon you?<br/><br/><br/>Meet familiar icons like Sybil Vane, Lord Henry Wotton, and the Duchess of Monmouth. But this time, they're a bit... different. Gain allies for your dangerous rescue mission. Perhaps... you may even procure the aid of some dogs, if you are lucky?<br/><br/><br/>A gray/pink and dreamy hellscape entices you to sit back, relax. Meanwhile your boyfriend bathes in hell-exclusive BBQ marinade. Do take your sweet time.<br/><br/><br/>What? Why eat doughnuts? Don’t be so stuck up. Let people eat their doughnuts, whenever wherever, for whatever reason.<h3>WARNING: Side effects include sassiness becoming a personality trait. Play at your own risk.</h3>", "metacritic": null, "released": "2023-03-27", "tba": false, "updated": "2023-03-31T03:29:02", "background_image": "https://media.rawg.io/media/screenshots/0e8/0e8413dea2fda96f2b76c3c04b41b10a.jpg", "website": "https://www.dorian.pink/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["amberlimshin"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["amberlimshin"], "esrb_rating": null}