{"id": 948043, "slug": "combat-mission-battle-for-normandy-2", "name": "Combat Mission Battle for Normandy", "name_original": "Combat Mission Battle for Normandy", "description": "<strong>Combat Mission: Battle for Normandy </strong>faithfully recreates the experience of tactical land warfare in <strong>Western France</strong> during <strong>World War Two</strong>. The Base Game covers the three month period following the <strong>Allied D-Day landings</strong>, from Operation Overlord in June through the Cobra Breakout in August. The tough fight has become the stuff of legend and Combat Mission's high standards for accuracy and detail means you'll experience the fighting as realistically as can be.<br/><br/>Command the full array of <strong>American and German Heer formations</strong> fighting along the coast through to the interior of France. Four challenging campaigns, 21 standalone scenarios, and a plethora of Quick Battle maps will test your tactical acumen. Matching the painstakingly researched battles is the highly detailed combat equipment, including 67 vehicles and dozens of various small arms and heavy weapons.<h3>Features</h3><ul><li>Tactical warfare at battalion and below scale in a true 3D environment<br/></li><li>Command individual vehicles, teams and squads<br/></li><li>Expansive simulation of “soft factors” such as Morale, Experience and Leadership<br/></li><li>Innovative systems portraying Fog of War, Spotting, Line of Sight, Command &amp; Control and Objectives<br/></li><li>Unmatched realistic physics, ballistics and battlefield effects<br/></li><li>Fight in a wide range of weather and lighting conditions, all of which realistically impact fighting abilities<br/></li><li>Unique hybrid system for RealTime and WeGo (turn based) play<br/></li><li>Full featured Editor for maps, scenarios, and campaigns<br/></li><li>Quick Battle system sets up deliberate or randomized battles based on player specifications<br/></li><li>Single player and head to head play, including Play By Email (PBEM+++)<br/></li><li>Supported for the long haul with patches, upgrades and expansions</li></ul>", "metacritic": null, "released": "2023-03-28", "tba": false, "updated": "2023-03-31T04:16:36", "background_image": "https://media.rawg.io/media/screenshots/30d/30dc304a22f94032215f3123060a34fc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 276, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Battlefront"], "genres": ["Strategy"], "publishers": ["Slitherine"], "esrb_rating": null}