{"id": 948034, "slug": "3dkuang-gong", "name": "3D矿工", "name_original": "3D矿工", "description": "3D Miner is a small game integrating leisure, strategy and puzzle. The main gameplay is to grab items through mechanical hooks to obtain gold coins and sell them. The biggest feature is that the game has one level and only one level, because the game is set in a mine with limited resources,<br/><br/>Although there is only one level in this game, there are ten rounds (ten rounds) in total. After each round, you will enter the store. Of course, you can also directly end the round and enter the store by pressing TAB.<br/><br/>Of course, these items will cost you gold, so you need to match the items in the store and combine them so that you can maximize your profit in the next round. Of course, this is the core idea of the game, in the limited resources of the mine, with props, to maximize profits.<br/><br/>At the end of the 10 turns, you will be counted if you have reached your target amount of coins. If not, you will be fired by the mine owner! The game fails. When it is achieved, it is considered customs clearance.<br/><br/>By the way, the design of the game is 30% luck + 40% aiming power + 30% decision (product mix) to measure whether you can complete the game, and the game may add up to more than 75% to complete the game. Ideas in game design are as we are today<br/><br/>Situations in society require luck, strength and decision making. In line with the design idea that there is life in the game, there is a game in the life, I hope you play happy, more happy life. What are you waiting for? Experience it!<h3> Game operation: </h3><br/>Press the down key to lower the mechanical hook. Press the Up key to drop explosives to destroy the item. Press the Pgup key to raise the field of vision, and press the PgDn key to lower the field of vision. Tab key to enter the store, Esc key directly exit the game.", "metacritic": null, "released": "2023-03-28", "tba": false, "updated": "2023-03-31T04:03:53", "background_image": "https://media.rawg.io/media/screenshots/719/719be0dac8cc1dad386f1026fd1308ff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Little Monster Studio"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Little Monster Studio"], "esrb_rating": null}