{"id": 948027, "slug": "bitter-sweet-cohabitation", "name": "Bitter-Sweet Cohabitation", "name_original": "Bitter-Sweet Cohabitation", "description": "\"Bitter-Sweet Cohabitation\" is a novel game in which the protagonist, who seeks a girl, meets a girl who leads him to face other heroines who are in various circumstances.<br/>A Bishojo Game released in 2017 under the \"Noirsoft\" brand has been reworked for the \"PandaShojo\" platform for players of all ages worldwide to enjoy.<br/><br/><strong>◆Introduction</strong><br/>\"Can I stay here...? I have no place to go.\"<br/><br/>Starting with a single girl, many runaway girls start to visit the protagonist's house.<br/>Although knowing it's wrong, but after hearing what they are going through...<br/><br/><br/><strong>◆Synopsis</strong><br/>The protagonist, Keigo Sagami, is a typical boring businessman.<br/>While seeking to meet women, Keigo suddenly finds himself living with a runaway girl.<br/><br/>The girl's name was \"Rio Shina\".<br/>As they live together, they begin to open up, but Keigo rejects Rio, feeling that they cannot continue this ambiguous relationship.<br/><br/>However, the days without Rio were very empty.<br/>Then, many girls with different problems appear in front of Keigo.<br/>\"Akina Kobayakawa\", a friend of Rio.<br/>\"Nagi Asama\", a noble young girl who seeks freedom.<br/><br/>Keigo drowns into their charms, as if to fill a hole in his heart...<br/><br/><strong>◆Characters</strong><br/>Rio Shina<br/>\"Can I stay here...? I have no place to go.\"<br/>An innocent-looking female student, also with a gloomy appearance.<br/>Without explaining the situation, she was wandering around in search of a house to stay when she met Keigo.<br/>Although she seems quiet and obedient, she has a strong will and a homely side.<br/>Many men would accept her since she is cute and stylish, but...<br/><br/><br/>Akina Kobayakawa<br/>\"Hey, can I stay here? I got no place to go.\"<br/>Bright and friendly gal student.<br/>She came to Keigo's place after hearing from Rio about a place where she could stay.<br/>Her priority is to do what she wants and what she enjoys, but also has a surprisingly thrifty personality.<br/>Is she moving from house to house just for fun or...<br/><br/><br/>Nagi Asama<br/>\"Please... Just one night, please.\"<br/>A young and naive college girl.<br/>While lost in the city, she meets Keigo and decides to stay at his place.<br/>Smart and well-educated, but her knowledge is biased because of her nobility.<br/>She ran away from home, calling herself a \"caged bird\"...<br/><br/><br/>Keigo Sagami<br/>A dull businessman living alone.<br/>Although still in his mid-twenties, he is called \"Ojisan\" by the girls.<br/>Letting the girls stay at his place has changed his life and mindset.<br/>But he still struggling to interact with them.", "metacritic": null, "released": "2023-03-27", "tba": false, "updated": "2023-03-31T03:56:03", "background_image": "https://media.rawg.io/media/screenshots/445/44540d30b0168a4ed640708684da3d12.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 296, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CyberStep", "Rideon Works Co. Ltd,"], "genres": ["Adventure", "Simulation", "Casual"], "publishers": ["CyberStep"], "esrb_rating": null}