{"id": 948097, "slug": "bookypets-legends", "name": "BookyPets Legends", "name_original": "BookyPets Legends", "description": "<strong>BookyPets Legends</strong> is an adventure, exploration and collecting videogame, designed to encourage reading among children from 7 to 12 years old in an easy and fun way.<br/><br/>Now reading can also be a game for your children thanks to our exclusive methodology, <strong>GameReading®</strong>, for the development of a reading habit, which has been scientifically validated.<br/><br/><strong>BookyPets Legends</strong> transports children to the other side of the universe, the magical kingdom of Imaginatios which is inhabited by all the characters from fairy tales, and by magical creatures with book-shaped wings, the BookyPets!<br/><br/>The game consists of freeing the <strong>BookyPets</strong>, who have been trapped by 3 evil monsters (Fear, Laziness, and Selfishness), by reading hundreds of proverbs, fables, tales, legends and children's novels, in order to get keys and open the cages in which they are locked up. They will be helped by numerous fairytale characters, although some of them will also try to thwart the mission! <br/><br/>BookyPets seamlessly blends reading into the gameplay and narrative of the video game to encourage children to read. Now, reading and playing will be one and the same.<br/><br/><strong>Key features:</strong><br/><br/><ul><li>Game mechanics based on the most popular games for children aged 7 to 12 (RPG, Tower Defense, Collecting, etc.).<br/></li><li>More than 50 BookyPets to rescue, collect and evolve. The Tyrannosaurus Rex, the Unicorn, the Blue Mermaid and the Winged Lion are just some of them - children won't stop reading until they manage to rescue them! The habit and passion for reading are already underway!<br/></li><li>Character editor with dozens of customizable elements to create your own in-game avatars.<br/></li><li>More than 2,200 fantasy readings: traditional proverbs and sayings, classic and modern tales, fables, and children's novels.<br/></li><li>Your children will get rewards for each reading: spells, energy and keys to free their BookyPets. In addition, there are special rewards for daily reading.<br/></li><li>Information about the children's progress and the readings they have done: number of words read, new vocabulary, type of readings done...<br/></li><li>All the game texts and readings are bilingual: available in Spanish and English.<br/></li><li>BookyPets is the first Metaverse of children's literature that also has its own collection of books, with more adventures to read and discover many more details of the Imaginatios kingdom.</li></ul>", "metacritic": null, "released": "2023-03-30", "tba": false, "updated": "2023-03-31T05:28:16", "background_image": "https://media.rawg.io/media/screenshots/95b/95bb47e3e0748081381451c01fe23a4a.jpg", "website": "https://www.bookypets.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 310, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Beyourbest"], "genres": ["Action", "Adventure", "Casual"], "publishers": ["DevilishGames"], "esrb_rating": null}