{"id": 948028, "slug": "zabata", "name": "ZaBaTa!", "name_original": "ZaBaTa!", "description": "<strong>■ ABOUT THIS GAME</strong><br/><br/>ZaBaTa is an online multiplayer game that you can enjoy with friends.<br/>Keep an eye out to find real players hidden among AI NPCs, and become the last human player standing!<br/>Watch out though! Blend in so YOU don't get caught either.<br/><br/><strong>Which ones are human?</strong><br/>All NPCs appearing in ZaBaTa use Deep Learning to implement their movements.<br/>The character that just passed by, was that a human player or an AI?<br/>Find the \"real\" players hidden among many AIs!<br/><br/><strong>Complete missions faster than everyone else!</strong><br/>Certain missions are only for the human players.<br/>Complete the missions quickly but remember to act natural and blend in to avoid getting caught!<br/><br/><strong>Pretend you're an AI NPC</strong><br/>Give your best performance and trick other players.<br/>Feel the adrenaline rush of deceiving other humans to win!<br/><br/><strong>If you spot a \"real\" player, approach them... and attack!</strong><br/>Think you found a real player?<br/>Approach them - but be careful, they might catch you first!<br/>ZaBaTa is even more fun when you play it with friends!<br/><br/><br/><strong>Play Now!</strong><br/><br/><br/><strong>■ Game Features</strong><br/>Solo or team modes available.<br/>ZaBaTa can be played in two maps for solo/team battles.<br/>Compete with your friends in many different ways!<br/>We will keep updating and adding new game modes.<br/><br/>Special missions add suspense to the guessing game!<br/>Blend in to complete missions without being caught by other human players.<br/>You have to keep up the acting until you are the last human standing!<br/><br/>Charming characters and unique costumes<br/>Tons of cosmetics available for character customization!<br/>Make one-of-a-kind avatar and enjoy ZaBaTa!", "metacritic": null, "released": "2023-03-27", "tba": false, "updated": "2023-03-31T03:57:01", "background_image": "https://media.rawg.io/media/screenshots/c00/c005deb51b13e9a1c3070faeceb51b53.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TipToe Games"], "genres": ["Casual", "Indie"], "publishers": ["TipToe Games"], "esrb_rating": "Everyone 10+"}