{"id": 948035, "slug": "drop-system-breach", "name": "DROP - System Breach", "name_original": "DROP - System Breach", "description": "DROP is an action-strategy hacking simulator with puzzle and roguelike gameplay elements. Challenge yourself to the unique gameplay and intensity offered by Developer Etherfield Studio.<br/><br/>The future is disconnected.  The world has recoiled and fractured into countless digital enclaves and virtual fortresses in an era of digital isolation, suspicion, and espionage. In this world, there’s only one truth: hackers get fame, money, and dead if they’re not careful.<br/><br/><br/><br/><br/>You are a promising hacker with huge ambitions, an empty bank account, and the burning desire to prove yourself. When your actions attract the attention of a notorious hacker group, The Swarm, life gets complicated - real quick.<br/><br/>Your world turns upside-down when simple jobs hurl you into a power struggle between The Swarm, different factions, and megacorporations that could decide the fate of the world’s fragmented networks. Use your cunning, stealth, and prowess to stay ahead of what lurks around the next node.<br/><br/><h3>Key features</h3>Drop is a fast-paced action-strategy hacking simulator with puzzle and roguelike gameplay elements, unique visuals and electronic soundscapes that evoke the thrill of hacking.<br/><br/>Hack networks to gain respect and notoriety within the community.<br/><br/><br/><br/>Find solutions to complex puzzles.<br/><br/><br/><br/>Work against time, firewalls, and other nerve-racking hazards to get paid.<br/><br/><br/><br/>Procedurally generated side quests offer unlimited playtime.<br/>Play an unfolding story campaign through unique missions. Explore the opportunities offered by the numerous factions with their agendas and assignments.<br/>Intense gameplay is controlled through an elegantly-simple keyboard or gamepad configuration.<br/><br/>", "metacritic": null, "released": "2023-03-28", "tba": false, "updated": "2023-03-31T04:05:35", "background_image": "https://media.rawg.io/media/screenshots/259/259a3b2620124140cf5e9588f07f6310.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 3, "toplay": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 236, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Etherfield Studio"], "genres": ["Action", "Strategy", "Simulation", "Indie"], "publishers": ["MicroProse"], "esrb_rating": null}