{"id": 948071, "slug": "the-illusion-curse", "name": "THE ILLUSION: CURSE", "name_original": "THE ILLUSION: CURSE", "description": "One day, a man named Martin was conducting investigations about a secret cult, he was exposed and arrested by Zorya the daughter of the sun.<br/>\r\nHe was imprisoned In the Nightmare which is Zorya's mysterious mansion surrounded with dark energy, ghosts and Illusions<br/>\n<br/>\r\nAfter he managed to pass Zorya's tests in the previous Chapters, He is going to meet Moria the moonlight and he will face a new kind of challenges full of Horror and fear in the cursed mansion.<br/>\n<br/>\r\nMartin has to pass a psychological and mental exam to be adopted into the mysterious cult, or to be forgotten in the world of Illusions<br/>\r\nBut the abandoned mansion is full of ghosts, evil forces and intricate puzzles where he will be punished by Moria for every wrong decision.<br/>\n<br/>\r\nThe game begins when martin finds himself trapped in the Curse mansion.<br/>\r\nYou have to help him escape by solving the puzzles in the twenty four main rooms,<br/>\r\nWhere you will get a key in each room allow you to enter the next room<br/>\r\nBetween The Rooms You Have To Cross The Loop, The maze, And The Time Room<br/>\r\nIn every place of the game you will be attacked by ghosts and you will suffer from<br/>\r\nIllusions and strange events that will happen around you.<br/>\n<br/>\n<br/>\r\nDo you have the ability to challenge Moria? <br/>\r\nWill you help Martin pass the Curse mansion?<br/>\r\nOr you will leave him imprisoned in the illusions world.", "metacritic": null, "released": "2023-03-29", "tba": false, "updated": "2023-03-31T04:53:45", "background_image": "https://media.rawg.io/media/screenshots/888/88878a08a8ddd42f9e851c1599b49015.jpg", "website": "http://raven-games.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Raven Games"], "genres": ["Adventure"], "publishers": ["Raven Games"], "esrb_rating": null}