{"id": 948082, "slug": "furry-furries", "name": "Furry Furries", "name_original": "Furry Furries", "description": "<p>Furry Furries is a casual lewd match 3 game where you have to make matches of at least three same-colored gems to score points. The goal is to got 100 points , however you can also lose points and you have only limited turns to play. Matching different colors gives different results but don&#39;t worry, the rules are simple and clearly explained in the tutorial level!<br />\nThe game has 33 levels, featuring 8 different opponent species - all of them furries. You start with easy levels until you reach more difficult ones. There are no time limits and no stress - only fun! It&#39;s a simple but challenging game that will keep you entertained and wanting for more lewd furriness! You can play in whatever order you wish - start with hyena and end with wolf perhaps?<br />\nFeatures:<br />\n<em> Casual gameplay, no story<br />\n</em> Easy controls, can be played with one hand<br />\n<em> Funny furry characters<br />\n</em> No Ads or In-App Purchases, no patches needed<br />\n<em> Adult content right away, no boring intro levels!<br />\n</em> Juicy reward after each match - 42 images of 8 different species!<br />\n* Fun gameplay, 33 levels to play<br />\nGameplay<br />\nThis game is a match 3 puzzle. You need to win a match 3 level in order to progress in the game. There are 8 different furry species to choose from and you can play in any order you like. Each has 4 levels and 5 reward renders to unlock (one for losing). The puzzle is challenging yet not difficult! After winning a match 3 level, you unlock a reward render (nude) which can be also accessed from the gallery.</p>", "metacritic": null, "released": "2023-03-29", "tba": false, "updated": "2023-04-06T11:50:40", "background_image": "https://media.rawg.io/media/games/5ff/5ff8dc9df795bb7c0ef9127b83924660.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cute Pen Games"], "genres": ["Casual"], "publishers": ["Cute Pen Games"], "esrb_rating": null}