{"id": 948004, "slug": "heartwood-heroes", "name": "Heartwood Heroes", "name_original": "Heartwood Heroes", "description": "<strong>Heartwood Heroes</strong> is a fast-paced board game RPG for up to 4 players featuring humorous quests, quick turn-based combat and multiple-choice events. Play <strong>locally</strong> or <strong>online with Steam Remote Play</strong> - only one copy of the game is required. Work both together and against your friends as you race to complete randomly branching scenarios!<br/><br/><strong>Explore</strong> - Travel the board to flip tiles, uncover locations and meet \"helpful\" characters.<br/><br/><strong>Hero of the Week</strong> - Solve quests and battle monsters to earn experience points. When the final boss is defeated, whoever has the most experience wins! If you fall too far behind, a kindly snake will help you out.<br/><br/><strong>Light RPG elements</strong> - Customize your character's looks and equip yourself with weapons, armor, accessories and spells. Raise your stats and have followers tag along to probably help you win.<br/><br/><strong>Get a job</strong> - Choose from over 20 jobs such as Delinquent, Scam Artist, Diva and Super Hunk. Each one grants a set of skills to help you fight, earn money and equipment, and/or go really fast.<br/><br/><strong>Heroic battles</strong> - Take part in speedy turn-based battles against a throng of colorful foes. Join other players' fights to get a share of the experience! Even if you're knocked out, you'll be back on your feet in no time.<br/><br/><strong>Replayable scenarios</strong> - Between the random quests, events, shops, job market, and the board itself, no two matches are the same. Who knows what twists the story will take next?<br/><br/><strong>Quick play</strong> - One game can be completed in 1-2 hours.<br/><br/><strong>Customize</strong> - Fiddle with the game rules and board randomization, or make your own quests and characters via the Steam Workshop.", "metacritic": null, "released": "2023-03-27", "tba": false, "updated": "2023-03-31T03:21:41", "background_image": "https://media.rawg.io/media/screenshots/a3e/a3e8eaf0a10234b98578eb0c8edc8a67.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ludosity"], "genres": ["RPG", "Strategy", "Casual", "Indie"], "publishers": ["Ludosity"], "esrb_rating": null}