{"id": 948055, "slug": "final-dose", "name": "Final Dose", "name_original": "Final Dose", "description": "<h3>GAMEPLAY </h3>Final Dose is an immersive stealth simulator game inspired by slasher horror movies. You are being pursued by a relentless AI that can see and hear you. You will need to explore every inch of an abandoned clinic and find items and puzzle pieces to unlock doors and crawl through vents. Run or hide under beds, in bathroom stalls and cabinets, crouch to move around silently, and do whatever it takes to figure out how to escape this place!<br/><br/><h3>A TOTALLY OFFICIAL LETTER </h3>You receive a letter from the administration telling you there's an issue with your vaccination status. But instead of sending you to your regular clinic, you're sent to an unlisted creepy place. What is going on? You don't have much choice so you walk in... to get attacked and injected who-knows-what by a psychotic nurse!<br/><br/><br/><br/>You can only take so many shots... escape before she injects you with the <strong>FINAL DOSE</strong>!<br/><br/><h3>A TIKTOK NURSE ON ANOTHER LEVEL </h3>Final Dose is a short horror game themed after pandemic conspiracy theories, memes and a sexy psychotic nurse. If you are a fan of games like Granny and have a dark sense of humor, you should give this one a <strong>SHOT</strong>! <br/><br/><h3>FEATURES </h3><ul><li>AI sees you and tracks the noises you make<br/></li><li>Hide under beds, in bathroom stalls and cabinets<br/></li><li>Voiced AI talks to you and thinks out loud while looking for you<br/></li><li>Find puzzle pieces and then solve a sliding puzzle to reveal a secret passage<br/></li><li>Unscrew vent panels and crawl through them to reach new areas<br/></li><li>Find keys or ways around locked doors to unlock them<br/></li><li>Crouch to hide behind objects and move around silently<br/></li><li>Memes<br/></li><li>The game offers to save your progress when quitting the game</li></ul><br/>", "metacritic": null, "released": "2023-03-28", "tba": false, "updated": "2023-03-31T04:30:50", "background_image": "https://media.rawg.io/media/screenshots/ee4/ee4211332d2bb6f3731eb8de028d43b9.jpg", "website": "https://finaldose.gravedangergames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 269, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Grave Danger Games"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["Grave Danger Games"], "esrb_rating": null}