{"id": 948114, "slug": "roterra-4-magical-revolution", "name": "Roterra 4 - Magical Revolution", "name_original": "Roterra 4 - Magical Revolution", "description": "DiG-iT! Games presents the newest member of the Roterra® family: Roterra 4—Magical Revolution available for the first time on Steam. This new installment of the chart-topping series offers 35 levels of all new hand-built puzzles that intensify the perspective challenging journey through this fairytale world of gravity twists, scrambled paths and rotating blocks. <br/><br/><br/><br/>70+ unique puzzles await the player as they travel through mysterious lava-filled caves, explore icy extremes and devastating deserts, and interact with the world of Roterra in new ways. <br/><br/><br/><br/>Ride polar bears, fend off attacking scorpions and spin your world upside down with new mechanics in new environments. Roterra 4 continues the Roterra storyline, graphics and gameplay that have earned the Roterra series numerous awards. <br/><br/><br/><br/>Engaging level design includes more team-play, more multi-character puzzles and exciting new ways to flip, toggle and shift to clear your route. Changing your point of view can make all the difference especially when trying our all new Penrose staircase maze.<h3>Key Features</h3><br/>* Over 70 puzzles to solve across 35 levels<br/>* New illusionary puzzle maze inspired by the Penrose/M.C. Escher staircase<br/>* New* Ride a polar bear or be attacked by one!<br/>* Our new lava environment is so HOT.<br/>* Support for controllers for faster play<br/>* Numerous other graphics improvements and new mechanics<br/>* Our largest game in the series with hours of play<br/><br/><br/><br/>DiG-iT! Games® is a small woman-owned indie studio.  <br/><br/>Suzi Keehn is our Founder, Owner and Lead Designer. An industry thought-leader and innovator in educational gaming and interactive learning, Suzi is a world leader in social studies gaming, using archaeology to teach cultural understanding through the study of ancient history. The Roterra® games pull strongly from Suzi’s experience designing critical thinking games and are inspired by a historical work: the 16th century poem “Orlando Furioso” by Ludovico Ariosto, which focuses on strong female characters who repeatedly challenge the medieval perception of women.", "metacritic": null, "released": "2023-03-30", "tba": false, "updated": "2023-03-31T05:54:34", "background_image": "https://media.rawg.io/media/screenshots/b47/b4720a76cd276b6d93b5ad65d7dd7564.jpg", "website": "https://playroterra.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 485, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["DiG-iT! Games"], "genres": ["Casual", "Indie"], "publishers": ["DiG-iT! Games"], "esrb_rating": null}