{"id": 948154, "slug": "spark-in-the-dark-demo", "name": "Spark in the Dark DEMO", "name_original": "Spark in the Dark DEMO", "description": "Spark in the Dark is coming soon and can be wishlisted \nhere<br/><br/>\n<p>This place is shrouded in mystery. Horrible legends and gloom filled ancient stories, full of unimaginable things, have been going around for centuries. <br/><br/>The Endless Dungeon that was created long before humans...<br/>So say the old people.\n    Now — a place of darkness and ugly creatures. <br/><br/><strong>Spark in the Dark</strong> is an atmospheric Dungeon Crawler in a medieval dark fantasy setting, where our hero dives into the depths of a grim ancient Dungeon.<br/> </p>\n<ul>\n<li>5 classes of heroes each with unique skills.</li>\n<li>Bloody battles with monstrous creatures and deadly traps.</li>\n<li>A lot of interactions with the environment, including testing the skills of the hero.</li>\n<li>Many secret places.</li>\n<li>Deep and intricate lore; About one hundred books and annals with stories revealing the secrets of the dark Dungeon as well as diaries, notes and points of interest.</li>\n<li>Levelling up the skills of the hero as they are used. Blessings, curses and injuries.</li>\n<li>Damaging and repairing the Hero’s equipment.</li>\n<li>Procedural Generation; Monsters, equipment, loot, stats and some level elements are generated differently each time you enter the Dungeon.</li>\n</ul>\n<p>What terrible secrets keep dark depths in themselves? Is there a limit to the Abyss? Who lived here before us?<br/><br/>Try to survive in the darkness of endless Dungeon full of ancient secrets and terrible creatures. Or stay here forever, trying to\n    find a way out!</p>", "metacritic": null, "released": null, "tba": false, "updated": "2023-03-31T06:49:23", "background_image": "https://media.rawg.io/media/screenshots/842/8425da1865eea7e4062ca1038453bb72.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 318, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Stellar Fish"], "genres": [], "publishers": ["Stellar Fish"], "esrb_rating": null}