{"id": 94813, "slug": "jjat", "name": "JJAT", "name_original": "JJAT", "description": "\n<p>\r\n\tJJAT is a precision platformer with a few inspiration from metroidvania games (except it turned out really short...).  You play as two characters exploring a facility, looking for a way to defeat a monster.\r\n</p>\n<p>\r\n\tThe game can be played alone, using the left stick and left shoulder buttons to control one character and using the \"right side\" of the controller to control the other character. There are bindings for keyboard, but a gamepad should be used, if possible.\r\n</p>\n<p>\r\n\tThe game can also be played by two people. This make somethings easier, as its not necessary to control two characters at once, but add a new layer of complexity, since both players need to be in sync and cooperate.\r\n</p>\r\nCONTROLS<br/>\n<p>\r\n\tThe game can be played with both gamepad and keyboard. It was only tested with the XBox 360 Wired controller, so I can't guarantee it'll work with anything else. It was tested and worked both on Windows 7 64 bits and Ubuntu 14.04 64 bits.\r\n</p>\n<p>\r\n\t The controls can be checked and modified on the 'options' menu.<br/>\n</p>\r\nSOURCE CODE\r\n<p>\r\n\tThe game's source code is available on github, under the zlib license. Get it here. It was loosely based on my entry for Global Game Jam 2015, and it uses my own framework written in C (it uses SDL2 as the backend).\r\n</p>\r\nBugfixes\r\n<p>2014-04-04: Fixed a bug that allowed bullets to collide with some objects.</p>", "metacritic": null, "released": "2015-04-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/266/266ef6410ff6c9fb2460e1587376fdd4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["GFM"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}