{"id": 948104, "slug": "trans-agent-x", "name": "Trans Agent X", "name_original": "Trans Agent X", "description": "<strong>A top-down bullet-hell dodger.</strong><br/><br/>In a galaxy far far away... Oh, wait, no. We're still in our solar system. <br/>Anyways. After the gender war, transgendered people fled to a new planet and made it their own. Earth being completely devoid of trans people could not survive because of it and annihilated themselves. <br/><br/>You, should you choose to accept this mission, will revisit this post-apocalyptic earth, evade horrible hurtful memories, and retrieve the lost dignity of the, now ghostly, cisgendered people for closure.<br/><br/><br/><br/>Trans Agent X is a top-down bullet-hell dodger - a game that explores topics of growth, healing, and trauma.<br/>Every enemy in the game depicts a narrative fragment of the \"treatment\" transgender people in norway suffered from rikshospitalet. These fragments were collected from the norwegian transgendered community, norwegian media, and personal experience.<br/><br/>A full list of the enemy statements can be found on the game's open source wiki page.<br/><br/><br/>Developed over two months, this solo project is one of many controversial games the developer has made. Being able to artistically express yourself is a proven way to heal trauma and possibly also move on. This game hopes to achieve, for players who need it, through gameplay, to stir up hidden and muddied emotions, needs and thoughts.<br/>Please take care of yourself and your loved ones.<br/><br/><br/><ul><li> 5 levels<br/></li><li> 3 bosses<br/></li><li> Transgender themed<br/></li><li> Full controller support<br/></li><li> Voice acted intro<br/></li><li> Real-life examples of horrible things health practitioners tell trans people<br/></li><li> Achievements<br/></li><li> Customizable character</li></ul>", "metacritic": null, "released": "2023-03-30", "tba": false, "updated": "2023-03-31T05:39:26", "background_image": "https://media.rawg.io/media/screenshots/886/8866f82906af20111c9007691a5f893b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sandra Moen"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Sandra Moen"], "esrb_rating": null}