{"id": 948136, "slug": "bloodhound-first-day-in-hell", "name": "Bloodhound: First day in hell", "name_original": "Bloodhound: First day in hell", "description": "Take the role of a skilled and determined warrior tasked with stopping the malevolent cult of Astaroth. These sinister individuals have called upon the forces of Hell to aid them in their quest for power, and it's up to you to put an end to their nefarious plans. With your trusty firearms at the ready, you'll need to fight your way through hordes of cultists and demons, all while working to prevent Astaroth from making its way to Earth. Do you have what it takes to save the world from certain doom?<br/>Dive in a thrilling introduction to the game's action-packed world. In \"First Day in Hell\" you'll get a taste of what's to come as you begin your quest to stop the cult of Astaroth. From the first moment, you'll be thrown into the thick of the battle, facing off against waves of enemies as you work to make your way through the demonic realm. With intense, fast-paced gameplay and a hauntingly atmospheric setting.<br/><br/>As you journey through the depths of Hell, you'll have access to an impressive arsenal of weapons to aid you in your quest. In \"First Day in Hell\" you'll get a taste of what's to come as you wield weapons like the Machete, Revolver, Pump Action Shotgun, Double Barreled Shotgun with Harpoon, and Assault Rifle AG043. Each weapon has its own unique strengths and weaknesses, allowing you to tailor your approach to each encounter. Whether you prefer to get up close and personal with the Machete or take out enemies from a distance with the powerful AG043, Bloodhound's arsenal has something for every playstyle. So gear up, lock and load, and get ready to take the fight to the cult of Astaroth in this adrenaline-fueled shooter.", "metacritic": null, "released": "2023-03-30", "tba": false, "updated": "2023-04-09T04:59:23", "background_image": "https://media.rawg.io/media/screenshots/035/0352b28e457c1afdec6cb69dc18e22ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 39, "ratings_count": 1, "suggestions_count": 416, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Kruger & Flint Productions"], "genres": ["Action", "Indie"], "publishers": ["Kruger & Flint Productions"], "esrb_rating": null}