{"id": 948105, "slug": "tomomon", "name": "Tomomon", "name_original": "Tomomon", "description": "Welcome to Tetron, a planet teeming with life and adventure! Here, a progressive and modern society of humans coexists with a diverse and wondrous array of creatures, known as Tomomon. Explore this mystical world and uncover its secrets, as you embark on an epic journey filled with danger and excitement. Will you be able to forge alliances with the Tomomon and unlock the planet's full potential? The fate of Tetron rests in your hands.<br/><br/><br/>Zento, the first land you'll encounter on your journey to Tetron. Explore this land of diverse ecosystems and uncover its many mysteries.<br/><ul><li>Exploring beautiful and colorful pixel art world.<br/></li><li>Travelling across multiple types of environment to discover the lore and the monsters species.<br/></li><li>Gather valuable materials to craft new items and foods for your Tomomon. (Coming soon)<br/></li><li>Building, customizing your own secret base. (Coming soon)</li></ul><br/><br/><br/><br/>Tomomon are creatures that inhabit the entire planet of Tetron, having appeared and existed for a very long time. Each species of creature has its own unique characteristics, origins, and abilities.<br/>Living in the wild, each species may have a different attitude towards humans, but they can all be befriended and have their own unique function once they become your companion. Explore and get to know all the different species of Tomomon in the world of Tetron.<br/><ul><li>Collecting and taming over 150+ Tomomon (and counting).<br/></li><li>Discover Tomomon evolution and fusion.</li></ul><br/><br/><br/>Embark on an epic journey of discovery across Tetron and forge unbreakable bonds with the diverse Tomomon species that inhabit its lands. But be warned, your path will be fraught with perilous challenges that must be overcome if you are to emerge victorious and claim your rightful place as the ultimate champion of this wondrous world. Are you ready to take on the challenge and prove your worth as a true Tamers master?<br/><ul><li>Battling trainers to earn the victory and become the champion of Zento.<br/></li><li>Put your brain into the test of making new strategy to win the engaging 3v3 turn-based battle.</li></ul>", "metacritic": null, "released": "2023-03-30", "tba": false, "updated": "2023-03-31T05:41:00", "background_image": "https://media.rawg.io/media/screenshots/7e3/7e359831a34f40e48f24971a271e27f5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ManicBuild Studio"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["ManicBuild Studio"], "esrb_rating": null}