{"id": 948142, "slug": "temporian", "name": "Temporian", "name_original": "Temporian", "description": "Step into the shoes of a time traveler stranded in a prehistoric world and face a series of impossible challenges in Temporian, the thrilling new turn-based survival game inspired by the wildly popular anime Dr. Stone!<br/><br/><br/><br/>As the time traveler, you must repair your time-machine with resources that don't yet exist in this time. Fortunately, as an inventor, you're up to the challenge. Along the way, you'll reinvent everything from apple pie to electricity in order to return to your present.<h3>100+ Unique Recipes</h3>(Re)Invent everything from Apple Pie to Electricity on your journey to returning to your present.<br/><br/>But be careful: your settlement must be carefully planned, and you'll need to experiment with different combinations of cards to discover new technologies, recipes, and even meals.<h3>Difficult Choices</h3>As your settlement grows, you'll be faced with difficult choices and challenging decisions. Will you focus on building up your settlement, or use your limited resources to create better tools and equipment? When one of your settlers becomes gravely ill, will you risk spending the time to help them recover, or let them suffer and potentially die?<br/><br/>Just like in real life, there isn't always one right answer.<br/><br/><h3>Multiple Endings</h3>The butterfly effect is always in play in Temporian, and your choices will affect the outcome of the game. With multiple endings based on how you play, what you create, and how many ripples through time you make, returning to the future is a lot easier than returning to the future <strong>you</strong> left behind.<br/><br/><h3>Combat?</h3><br/>Temporian features no combat, instead focusing on experimentation, planning, and decisions that may affect the rest of your playthrough. Don't feel pressured into taking too many risks; play at your own speed and take your time.<h3>Multiplayer</h3><br/>Temporian includes a full multiplayer campaign.<br/><br/>Whether you play cooperatively or not is up to you! Send your friends tools, food or resources to help them survive the cold winters, or use them as a dumping ground for your unwanted waste.<br/><br/>Retaining the turn-based nature of Temporian, play with a friend, turn by turn, and see who can return home first, or work together and return at the same time. It's entirely up to you!", "metacritic": null, "released": "2023-03-30", "tba": false, "updated": "2023-03-31T06:32:04", "background_image": "https://media.rawg.io/media/screenshots/e3a/e3aad28f6f4a883a85468d4c1dbe85ef.jpg", "website": "https://challacc.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 258, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["ChallAcc"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["ChallAcc"], "esrb_rating": null}