{"id": 948111, "slug": "anyaroth-the-queens-tyranny", "name": "Anyaroth: The Queen's Tyranny", "name_original": "Anyaroth: The Queen's Tyranny", "description": "<h3>Explore the depths of Anyaroth</h3>The Queen’s control covers planet Anyaroth in its entirety. From the forests and historical cities of its surface, stepping down to the core at the centre of the planet, the Queen has spun a complex web of barracks, factories and mines. The Queen’s Regime is aiming to exploit all of the planet’s resources, even the its population!<br/><h3>Fight for the Rebellion!</h3>In Anyaroth: The Queen’s Tyranny, you will be provided with a full range of weapons, objects and abilities that will let you explore all possibilities within the game’s fighting system. Have fun combining your weapons and abilities to end with your enemies in stylish ways!<br/><h3>Unveil the secrets of this world</h3>During your adventures, you will get to meet all kind of fellow rebels. Talk with them if you want to know more about the world of Anyaroth, its history or the Rebellion’s cause.<br/>In the time between fights, pay attention to the surroundings, as you may find artifacts containing key information or materials for crafting a secret weapon. Will you unveil all that this weird planet hides?<br/><h3>Characteristics</h3><ul><li>Classic 2D action-platformer mechanics, with a modern twist.<br/></li><li>The free aim system makes for intense fights where looking for the perfect shooting angle could be a a matter of life and death.<br/></li><li>The variety of weapons, objects and abilities generate impressive moments during fights.<br/></li><li>Across the game’s levels, you will explore all three layers of planet Anyaroth: Surface, Mantle and Core.<br/></li><li>You will get through ruined cities, explosive spider nests, until you reach the Regime’s capital city. Enjoy the alien landscapes of this peculiar planet!<br/></li><li>Find all helmets scattered throughout the levels and discover the secrets that this planet hides.</li></ul>", "metacritic": null, "released": "2023-03-30", "tba": false, "updated": "2023-03-31T05:48:37", "background_image": "https://media.rawg.io/media/screenshots/0bc/0bc7398d2bfc9cc08ebddf76ab97419e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yggdraseed"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Firenut Games"], "esrb_rating": null}