{"id": 948118, "slug": "eggcelerate-to-the-tropics", "name": "Eggcelerate! to the Tropics", "name_original": "Eggcelerate! to the Tropics", "description": "<strong>Warning:</strong> Delivering Easter eggs on motorcycles is hard. <strong>Eggstremely Hard!</strong> You will drop an egg while you eggsplore multiple jungle routes. Throw the egg over steep mountain passes and navigate through deep caverns to discover ancient ruins and hidden secrets!<br/><br/>Do you have the skills to safely deliver eggs while riding a motorcycle?<br/><br/><br/><br/>Agile two wheeled vehicles allow more control through narrow jungle paths! Discover your favorite egg, bowl and bike combinations whilst overcoming the challenges of each track.<br/><br/><br/><br/>Delivering eggs requires a fine balance of speed and safety. If you think you are quick, challenge friends on leaderboards and race to deliver eggs <strong>faster</strong> than anyone in the world!<br/><br/><br/><br/>Eggsplore hidden temples for lost ancient treasures to find golden sea turtles with a shell of gems! Can you collect them all?<br/><br/><br/><br/>Race through thick jungles, sandtastic beaches, crystal caves and ancient ruins of South America. Wild coconuts, cursed treasures, fires, spikes and other traps will drive you bananas!<br/><br/><br/><br/>Jump for joy as you make insane saves, then instantly scream and shout in rage with the hopeless fails. Reactions that are perfect for live streaming!<br/><br/><strong>Warning:</strong> Use your sunscreen while at the beach.<br/>- This game may or may not actually cause sunburns.", "metacritic": null, "released": "2023-03-30", "tba": false, "updated": "2023-03-31T06:00:11", "background_image": "https://media.rawg.io/media/screenshots/dac/dac3b9618e325d5de386b78c16d73120.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Tim Beaudet", "Tyre Bytes"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["Tyre Bytes"], "esrb_rating": null}