{"id": 94820, "slug": "lingotopia-itch", "name": "Lingotopia (itch)", "name_original": "Lingotopia (itch)", "description": "<p>Lingotopia is a language learning game about being lost in a city where you don't speak the language. Learn Chinese, French, German, Japanese, Russian, Spanish and more! You play a little girl shipwrecked on the shores of a strange island. In order to get back home you'll need to explore the island and talk to its inhabitants. Sadly, no one speaks your language! You'll have to learn words one at a time to decipher what these strange creatures are saying.</p>\r\nHow does it work?\r\n<ul><li>Explore a lovingly handcrafted city.</li><li>Click on objects in the environment and your guide will teach you the word for them.</li><li>Learn words by talking to the city's inhabitants.</li><li>Voice recordings by native speakers teach you the correct pronunciation.</li><li>Learning a language with a different script? Toggle between the romanised and native script at any time.</li></ul>\n<p>Words you know can be translated when they appear during conversations. So, the more words you know, the more you'll begin to feel at home in this strange place. You might even be able to find a way off the island!</p>\n\r\nWill this really help me learn a language\r\n<p>Yes! Learning words is the most important part of language learning. You can learn several hundred words by playing Lingotopia. As the game only translates individual words and not entire sentences, you also learn word order and grammar by playing. All dialogue in the game is tied to the setting and story, so you have a reason to decipher each and every sentence.<br/></p>\n\r\nWhat languages can I learn?\r\n<p>The official languages are Arabic, Chinese, French, German, Japanese, Russian, Spanish. You can learn English in each of these languages. There are also over 20 \"unofficial languages\", these don't have voice recordings and I won't be able to vouch for the accuracy of the translations. I will keep an up to date list of the included unofficial languages at https://www.lingoludo.com/lingotopia/.</p>", "metacritic": null, "released": "2018-08-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/620/62075d0b8723b168135dcdf97bc434f9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Lingo Ludo"], "genres": ["Adventure", "Educational"], "publishers": [], "esrb_rating": null}