{"id": 948379, "slug": "certuv-mlyn-2023", "name": "Čertův Mlýn (2023)", "name_original": "Čertův Mlýn (2023)", "description": "<p><strong><em>„Hrajeme? Karty jsou na stole.“\r\n  <br/></em></strong></p>\n<p>Hlavní hrdinou našeho příběhu je mladík Martin Reif, který se stejně jako každý rok vydává na Šumavu na chalupu svého kamaráda. Cestou jej však zastihne silná bouře a jemu nezbývá nic jiného, než se před deštěm ukrýt ve staré dávno opuštěné budově, které nikdo v okolí neřekne jinak než „Čertův Mlýn“. Není však sám, kdo si toto místo vybral za útočiště před deštěm...\r\n  </p>\n\n<p><strong>Synopse</strong><br/></p>\n<p>Počítačová hra Čertův Mlýn vychází z populární hospodské karetní hry známé pod názvy „jednadvacet“ a „oko bere!“.  Na rozdíl od klasické inkarnace této hry se zde však hráči střídají v jednotlivých tazích, čímž mohou ovlivňovat další průběh partie nejen pro sebe ale i svého soupeře.</p>\n<p>Hra nabízí poutavý příběh s horrorovým nádechem se dvěma možnými konci. O namluvení dvojice hlavních postav se postarala známá skupina Fénix ProDabing.</p>\n<p><strong>Ovládání i pravidla jsou velice jednoduchá a intuitivní, přesto vám doporučujeme před prvním spuštěním hry pročtení manuálu, který naleznete v adresáři se hrou.<br/></strong></p>\n<p><strong>Hlavní vlastnosti</strong><br/></p>\n<ul><li>Jednoduchá pravidla na pochopení \r\n</li><li>Vysoká znovuhratelnost - hra využívá systém náhodně generovaných událostí \"na pozadí\". Žádné dvě hry nebudou stejné \r\n</li><li>Pokročilá inteligence počítačem ovládaného soupeře - Váš oponent blafuje, dělá chyby, riskuje... \r\n</li><li>Dva obtížnostní stupně \r\n</li><li>Poutavý příběh \r\n</li><li>Dvě rozdílná zakončení \r\n</li><li>Kompletně v Češtině a to včetně dabingu \r\n</li><li>Vynikající dabing od známé skupiny Fénix ProDabing \r\n</li><li>Vhodné pro zkušené i příležitostné hráče \r\n</li></ul>", "metacritic": null, "released": "2023-03-30", "tba": false, "updated": "2023-03-31T08:28:07", "background_image": "https://media.rawg.io/media/screenshots/f78/f7890794c78c161c9260b095d553542b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JC Software"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}