{"id": 94846, "slug": "the-outsiders-open-beta", "name": "The Outsiders - Open Beta", "name_original": "The Outsiders - Open Beta", "description": "IMPORTANTE NOTE: Please download the game via the itch app, that way the game will be automatically updated and you won't have to download the .zip every time an update comes out. Follow the link https://itch.io/app and get the windows app! =D\r\n---------\r\n<p>Hi there! </p>\n<p>We are Daisu Games, a small game studio from Brazil, and this is our newest title, The Outsiders. </p>\n<p>The Outsiders is a top-down survival shooter where you play as the Alien Boss defending your planet against human invasion. Fight human soldiers, giant mechs and more! But this time, <strong>YOU </strong>are the biggest badass on screen. <strong>NOTHING</strong> is bigger than you.</p>\n<p>Challenge yourself, learn how to survive longer, crash as much humans as you can and level up your Boss Badge and your ranking on the world leaderboard! [these features are in development and will be soon updated]</p>\n<p>The current version is the Open Beta. We are still in full development and will bring you more and exciting new features over time. If you play the game, you will be with us, together in developing and improving The Outsiders! We are collecting your feedback to make the game even better until final release on itch and Steam.</p>\r\nWhat you get with the Open Beta\r\n<ul><li>Play as <strong>THE BOSS </strong>slaughtering human soldiers and robots</li><li>Endless gameplay: kill, survive, die, repeat</li><li>Beat on your score</li><li>3 different and unique weapons, including acid blasts and spikes</li><li>A Powerful Boss Skill that leaves <strong>NO ONE </strong>standing [more skills soon]</li><li>Heavy metal soundtracks by Paulo Germano to spice things up</li><li><strong>FREE ACCESS </strong>to Final Release on Steam and <strong>ALL </strong>future updates </li><li><strong>50% </strong>Special Beta Discount on game price</li><li>Access to our Discord Community: help us improve the game! [soon]</li></ul>\n\r\nWhat you get with Final Release and Updates\r\n<ul><li>3+ Random Levels to explore different strategies</li><li>3+ Unique Boss Characters to choose</li><li>8+ unique human enemies (soldiers, vehicles, robots, airships)</li><li>World Leaderboard for you to show all your awesomeness </li><li>Boss Badges and Levels</li><li>Achievements to earn bonuses and new challenges</li></ul>\n\r\n- OPEN BETA special price: 50% OFF - \r\n<p>While in Open Beta, the game will be 50% OFF on itch.io and you get the Final Release on Steam <strong>FOR FREE.</strong></p>\n<p>If you have already played the game, please take 5 minutes and give us your honest feedback on your impressions by following the form below. This will help us IMMENSILY on improving the game for you guys!</p>\n<p>https://goo.gl/forms/RVz7irMI5VL3BDrO2</p>\n<p>Also, follow us on Twitter for more and constant news and updates! We are very active there and want to reach our community each day better.</p>\n<p>https://twitter.com/DaisuGames</p>\n<p>If you have any business inquiries or would simply like to get in touch, email us at harry@daisu.games. Harry is our Game Designer and Director. Say hello! </p>\n<p>Once more, we'd like to thank you for being part of this journey. It means the world to us indie developers. So, without further ado... <strong>LETS KILL'EM ALL</strong>!</p>\n<p>- Daisu Team</p>\r\n---------\r\nIMPORTANTE NOTE: Please download the game via the itch app, that way the game will be automatically updated and you won't have to download the .zip every time an update comes out. Follow the link https://itch.io/app and get the windows app! =D", "metacritic": null, "released": "2018-02-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6c3/6c3f34309c58ea664083064ed43b9354.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Daisu Games"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}