{"id": 948515, "slug": "windy-meadow-a-roadwarden-tale-demo", "name": "Windy Meadow - A Roadwarden Tale [Demo]", "name_original": "Windy Meadow - A Roadwarden Tale [Demo]", "description": "<p><strong>A demo for Moral Anxiety Studio's \"Windy Meadow - A Roadwarden Tale\"</strong></p>\n<p>From the creator of the award-winning RPG <strong>Roadwarden</strong></p>\n<p>Wishlist full game now on Steam: </p>\n\n<p>Step into the enchanting visual novel of \"Windy Meadow - A Roadwarden Tale\" and rediscover the mysterious world of Viaticum. This peaceful commune may not be the wealthiest or most renowned, but it offers something far more valuable - a haven of tranquillity and harmony amidst the hustle and bustle of the outside world.<br/></p>\n<p>The heart of the story lies in the intertwined stories of Vena, Fabel, and Ludicia - three unique protagonists facing life-altering choices that will shape their destinies. Join them as their stories unfold, brought to life by animated sprites and set to an evocative musical score.<br/></p>\n<p><strong>FEATURES</strong></p>\n<p><strong>Three intertwined Tales</strong></p>\n<p>Follow three unique protagonists and uncover their problems, fears, and the challenges they face. Their varying personalities make for interesting and complicated relationships with the multitude of moody side characters.\r\n  \r\n  </p>\n<p><strong>An immersive, detailed village</strong></p>\n<p>Enjoy a serene story world rich in gorgeous views, gentle rivers, fertile lands, and welcoming forests. In Windy Meadow, even the beasts and dragons tend to keep their distance while the inhabitants’ varying personalities and complex relationships make this community feel alive and relatable.\r\n  </p>\n<p><strong>Choices matter</strong></p>\n<p>From the seemingly small to the life-changing, choices players make can affect dialogue options, NPC feelings, and game endings.\r\n</p>", "metacritic": null, "released": "2023-03-30", "tba": false, "updated": "2023-03-31T09:35:20", "background_image": "https://media.rawg.io/media/screenshots/213/213df4258f8d1befa4a49c21491546d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 336, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Assemble Entertainment"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}