{"id": 94854, "slug": "the-terror-aboard-the-speedwell-special-edition", "name": "The Terror Aboard The Speedwell: Special Edition", "name_original": "The Terror Aboard The Speedwell: Special Edition", "description": "<p>It's the future. The remnants of humanity, in the aftermath of a cataclysmic event known only as The Fall, have fled a dying homeworld to seek refuge among the colonies of the solar system.</p><p>Two hundred years later a small reconnaissance team returns to survey the surface of the dead world. What they find there not only puts their lives in peril, but also endangers all of humanity.</p><p>The Terror Aboard The Speedwell is a sci-fi horror game where victory means surviving a two month trip back to Mars as a deadly creature stalks your spaceship, picking your crew off one by one.</p><p>Maybe if you're smart--and a little lucky--you'll make it back home with all your limbs intact. Choose poorly and the Speedwell will be your tomb.</p><p>Good luck.</p><p><strong>Features:</strong></p><p><strong>* </strong>A 50K word branching sci-fi horror story with 60 endings.</p><p><strong>*  </strong>A choice between two protagonists, each with their own unique dialogue and options.</p><p><strong>* </strong>Heroine. Murderer. Savior. Survivor. Corpse. Coward. Conquerer. What will you become?</p><p><strong>Content warning</strong>: Suicide, PTSD, and cannibalism are themes explored in The Terror Aboard The Speedwell. Violence, gore, and strong language are also part of the game.</p><p><strong>What Folks Have Been Saying About The Terror Aboard The Speedwell:</strong></p><p>\"The writing is tense, and it's fantastic. The characters play on archetypes, but each is fleshed out via dialogue and feels well-drawn. From gung-ho soldier Meat to prickly ship's surgeon Strauss, I was surrounded by people I immediately gave a shit about. That's key to good survival drama, and writer/designer Javy Gwaltney has a great ear for action/sci-fi dialogue.\" --Polygon</p><p>\"This game has quality in spades. The writing is excellent – to begin with I wasn't particularly convinced that horror could be done well in a text adventure format but by the end of the first section I was completely engrossed. The pacing is excellent and the way the story responds to your choices feels organic and smooth. The framing of the options as specific utterances or general actions allows the player to imbue the protagonist with a huge amount of character and I was able to easily play out the type of person I wanted to.\" --IndieHaven</p><p><em>\"</em>With 60 possible endings, over 50,000 words, 2 protagonists and dozens of difficult, story-altering choices to make, The Terror Aboard The Speedwell is a unique piece of interactive fiction you'll just have to play over and over again. Yes, over and over and over again, for this is an excellent sci-fi horror adventure that manages to have properly interesting characters, panic inducing set pieces and can unravel itself in all sorts of melancholy/gory/heroic/sweet/unfair/deadly ways.<em>\"  --</em>IndieGames.com</p><p>\"[<em>The Terror Aboard The Speedwell</em>] is more substantial than most Twine games and has a big cast of characters all of whom have detailed attitudes towards one another. After a linear setup, it branches fairly strongly — I played to three substantially different endings, as well as some smaller variants on these. There are some good set-piece moments, too; <em>Speedwell</em> does particularly well on the scenes where the protagonist is realizing that whatever just happened spells probable doom for everyone, even though the symptoms aren't yet in evidence. Overall, <em>Speedwell</em> is more about how you cope once the monster is definitely out than it is about the time you spend thinking about what might be under the bed.\" --Emily Short</p><p><strong>FAQ:</strong></p><p><em>Is The Terror Aboard The Speedwell a sequel to You Were Made for Loneliness?</em></p><p>Yes and no. TTATS takes place in the same universe 180 years after the events of YWMFL. It features all new characters.</p><p><em>How long does it take to play?</em></p><p>A single playthrough of TTATS can take anywhere from 20 minutes to an hour. Successive playthroughs will probably be shorter.</p><p><em>What do I get when I purchase a copy of The Terror Aboard the Speedwell? And how much does the game cost?</em></p><p>The game itself, the Twine source file, and a digital copy of the illustration that artist Elizabeth Simins drew for the game.  Oh, and maybe some eventual free DLC too.</p><p><em>DLC?</em></p><p>Sure.  For every 75 dollars the game makes, I'll write a small 3,000-6,000 word  backstory game for each character of The Terror Aboard the Speedwell that will become available for free to everyone who's purchased a copy of the main game. These will not be rushed or paltry offerings, but complete standalone experiences.</p><p>All DLC has been unlocked:</p><p>1. Lenore Strauss: <strong>Done.</strong></p><p>2. Jonas Salvucci. <strong>Done.</strong></p><p>3. Travis \"Meat\" Barker. Release Date: <strong>Done.</strong></p><p>4. Markie Daniels. Release Date: <strong>Done</strong></p><p>5. Neil Smith. Release Date: <strong>Done</strong></p><p>6. Ryan Benson. Release Date: Done.</p><p>7. Ben Bowman. Release Date:Done.</p><p>8. Naomi. Release Date: <strong>Done.</strong></p><p><strong><em>I wish to write a review/piece about The Terror Aboard The Speedwell and would like to request a copy of the game for that purpose. Where can I reach you?</em></strong></p><p>Cool! Just shoot me an email at jgwaltneiv@gmail.com.</p><p>----</p><p>The Terror Aboard the Speedwell was created by:</p><p><strong>Javy Gwaltney (designer/writer)</strong> devotes his time to writing about these video game things when he isn't teaching or cobbling together a novel. You can follow the trail of pizza crumbs to his Twitter.</p><p><strong>Elizabeth Simins</strong><strong> (illustrator)</strong> is an artist &amp; illustrator living in New York. She makes comics primarily about games, but also sometimes about other things. Her work appears regularly on Kotaku, irregularly elsewhere, and unceasingly on her twitter.</p><p>And special thanks to Zeh Fernando for permission to use his font.</p><p>---</p><p>UPDATE: Thanks for your support!</p>", "metacritic": null, "released": "2014-08-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b83/b839014f7f4a373864664a4228944f97.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["Javy Gwaltney"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}