{"id": 948510, "slug": "draw-thief", "name": "Draw Thief", "name_original": "Draw Thief", "description": "<p>Draw Thief is an exciting hypercasual game that will put your puzzle-solving skills to the test. As the player, you are a master thief who must navigate through a series of challenging levels to steal money and escape undetected.</p>\n<p>Each level of Draw Thief presents a unique set of obstacles and challenges that you must overcome to successfully complete the heist. You'll have to use your wits and strategic thinking to draw your path to the loot, avoiding obstacles such as lasers, guards, and other security measures.\r\n</p>\n<p>The game also features a variety of power-ups and bonuses that you can collect along the way, such as speed boosts and invisibility cloaks, to help you evade the police and make your escape.\r\n</p>\n<p>With its sleek graphics and intuitive controls, Draw Thief is easy to pick up and play, but offers a satisfyingly challenging experience. As you progress through the levels, the challenges become more complex and require more careful planning and execution.\r\n</p>\n<p>Whether you're a casual gamer or a seasoned pro, Draw Thief is a game that will keep you engaged and entertained for hours on end. With its addictive gameplay, immersive challenges, and endless replayability, this game is sure to become one of your favorites. So what are you waiting for? Start drawing your path to success and steal your way to victory in Draw Thief!\r\n</p>", "metacritic": null, "released": "2023-03-30", "tba": false, "updated": "2023-03-31T09:32:14", "background_image": "https://media.rawg.io/media/screenshots/ebe/ebea379339ea559a809309db9a20f4ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Edova"], "genres": [], "publishers": [], "esrb_rating": null}