{"id": 948555, "slug": "the-keyper", "name": "The Keyper", "name_original": "The Keyper", "description": "A narrative exploration game for Playdate - \r\nAbout - 🗝️\r\n<p>Many secrets lay behind the many doors of a building older than the city itself. The Keyper is an adventure game where you play as the new caretaker of the Winchester 21 building, after the previous one mysteriously disappeared.</p>\n\r\nFeatures - 🔑\r\n<p>Wander through the building and collect as many keys as you can. Meet the wacky dwellers, lose yourself in the many corridors and open door after door until you leave no corner unsearched. Solve a murder, search for a treasure, reunite two lost lovers, climb the tower of a powerful sorceress or serve the capricious orders of an annoying mouse-person. Something strange is going on in the building and it's up to you to solve it... or become part of it.</p>\n\r\nMade for Playdate - with love 💛\r\n<p>The Keyper has been made entirely using Pulp, and can only be played in a Playdate. To play, please download the .zip file and then sideload it to your console following the official instructions.</p>\n<p>Be careful! The Keyper doesn't have a save system. You can put the Playdate in sleep mode, but not close the game. </p>\n\r\nCredits - 🍋\r\n<p>Cool Lemon Club is a video game studio located in the back of a taco spot. If you manage to find us, ask for a \"Lemon special\" and we'll give you a free tour.</p>\n<p>Clara-T Medium font asset by ronlent.</p>\n<p>Music by LouisF.</p>", "metacritic": null, "released": "2023-03-28", "tba": false, "updated": "2023-03-31T09:53:58", "background_image": "https://media.rawg.io/media/screenshots/560/560164298dc21d4ed0d485a24f6f7a76.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cool Lemon Club"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}