{"id": 948618, "slug": "corrupted-files-garrygabbage", "name": "Corrupted Files (GarryGabbage)", "name_original": "Corrupted Files (GarryGabbage)", "description": "<p>NOTE: THIS GAME IS STILL IN DEVELOPMENT AND IS NOT YET RELEASED. \r\n</p>\n<p>You can download the demo here however.\r\n</p>\n<p>Years after the closure of “Todd Triceratops’s Family Fun Center”, a local entrepreneur buys its property in attempt to revive the once thriving location. You are hired as a night guard to watch out for intruders, and observe the mysteriously abandoned animatronic entertainers inhabiting the restaurant. You are told that they should be inactive during the night due to aging. For some reason, you’re not so sure……\r\n</p>\n<p>Experience the horror (ish) of running for your life with ultra-realistic (ish) 3D graphics,  2k    textures, and more all powered by Unreal Engine 5. This game boasts amazing optimization. It can run on almost any low end gaming pc and even some potatos. I recommend specs of this or higher: 16gb (8 will work fine) ram, amd 3200g, at least 2gb of integrated or dedicated VRAM. With these specs, expect around 60-80 fps on low settings.\r\n</p>\n<p>This is a FNAF fan game, but it is not a FNAF copy. It is not at all related to the Five Nights at Freddy’s plot, or any characters. It features similar mechanics (Doors, flashlight, ETC) but it it’s own thing. Thanks for playing.\r\n</p>\n<p>Huge thanks to Scott Cawthon for being an inspiration to this game.</p>", "metacritic": null, "released": "2023-03-29", "tba": false, "updated": "2023-03-31T10:23:48", "background_image": "https://media.rawg.io/media/screenshots/6cf/6cf1b337cd5526acb815bc1b27e28ca7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GarryGabbage"], "genres": [], "publishers": [], "esrb_rating": null}