{"id": 948734, "slug": "blaster-fighter", "name": "Blaster Fighter", "name_original": "Blaster Fighter", "description": "CONTROLS:\r\nP1:P2:WASDArrow KeysF to PunchO to PunchG to SpecialP to SpecialF+G to BlastO+P to blast\r\n\r\nA button to Punch and Select, B button to Special and Back, D-pad for navigation, Shoulder buttons to change difficulty, Start to pause.\r\n\r\nFIGHTING:\r\n<ul><li>Each fighter has a Punch, Special, Up-Special, and Blast ability. Read about each champion's unique abilities in the Guide.</li><li>Some moves are counters, meaning if the button is pressed right as your opponent is attacking, it deals back your opponent's damage.</li><li>Falling off the stage causes you to lose a stock.</li><li>Reduce your opponents health and stocks to 0 to win!</li></ul>\n\r\nBLASTING:\r\n<ul><li>Hold FG or OP at the exact same time to blast.</li><li>Fill your blast meter by landing punches. </li><li>Using special abilities deals more damage than regular punches, but fills your opponent's blast meter instead of yours.</li><li>Blasts are super powerful but must be used in the right way- read about each blast in the Guide.</li></ul>\n\r\nUPDATE:\r\n\r\n<p>1.6: Two new stages, Champions Arena and Streets! Combos are back, with lots of new character sound effects!\r\n</p>\n\r\nMUSIC CREDITS:\r\n<p>Title theme - EvanBP<br/>Homeland - Jeremy Blake<br/>String Theory - TeknoAXE<br/>Mud Pit - TeknoAXE<br/>Docks - HeatleyBros<br/>Temple - TeknoAXE<br/>Rooftop  - TeknoAXE<br/>Clouds -HeatleyBros<br/>Champions Arena - TeknoAXE<br/>Streets - HeatleyBros<br/>Training Room - William Rosati<br/>Fight Ending - EvanBP<br/>Victory themes - EvanBPWith the exception of the songs marked \"EvanBP,\" I do not own the songs in this game. The tracks are royalty-free non-copyrighted material sourced from YouTube.</p>\n\n<p><strong>Please share with your friends if you enjoy! Thanks for playing and I appreciate your support!</strong></p>", "metacritic": null, "released": "2023-03-29", "tba": false, "updated": "2023-03-31T11:15:13", "background_image": "https://media.rawg.io/media/screenshots/14d/14d88ab7149f64d7b13bf78e44f7b9ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["EvanBP"], "genres": ["Fighting", "Platformer"], "publishers": [], "esrb_rating": null}