{"id": 94876, "slug": "contracted-itch", "name": "CONTRACTED (itch)", "name_original": "CONTRACTED (itch)", "description": "<p>\r\n\tThe infection is spreading, Cases of outbreak are being reported across the globe.\r\n\t<br/>\n</p>\n<p>\r\n\tAs a highly skilled and experienced agent working for Harmond Intl, you are assigned with taking on the outbreaks head on. You must travel to various locations, from camp grounds to caves, and wipe the areas clean.\r\n</p>\n<p>\r\n\tHarmond Intl have a growing arsenal at your disposal. As you build reputation, they will give you increasing access to their array of weaponry. Bigger doesn't always mean better, however, sometimes a stealthy approach is the best way to get the job done.\r\n\t<br/>\n</p>\n<p>\r\n\tPreviously peaceful citizens are falling prey to the virus, causing them to become extremely aggressive. Reports are consistent, the infected will attack anything that moves. When engaging with the infected, special care must be taken to avoid contact with contaminated blood, Otherwise, infection is likely.\r\n\t<br/>\n</p>\n<p>\n<br/>\n</p>\n<p>\n<strong><em>KEY FEATURES:</em></strong>\n</p>\n<p>\n<strong>One Hit Death:</strong> The infected don't swipe at the player, dealing damage with each hit. Rather, they grab and kill the player with one savage bite to the neck, unless the player can time a melee attack to push them off.\r\n</p>\n<p>\n<strong>Player Infection:</strong> Smashing the Infected with a weapon will spill blood which can contaminate the player, causing disorientation and eventually, death.\r\n</p>\n<p>\n<strong>Variety of Maps:</strong> From close quarter hospitals, to large, open camp grounds.\r\n</p>\n<p>\n<strong>6 unlockable weapons(8 total):</strong>  from silenced pistols to grenade launchers.\r\n</p>\n<p>\n<strong>Character Creation:</strong> Choose from male or female, and a variety of skin colors.\r\n</p>\n<p>\n<strong>Headshot damage:</strong> Aiming for the head will deal more damage.\r\n</p>\n<p>\n<strong>Weapon Melee:</strong> Knock back the infected with a swing of your weapon.\r\n</p>\n<p>\n<strong>Responsive AI:</strong> responding to loud noises heard nearby, line of sight detection, look for the player in their last known position.\r\n</p>\n<p>\n<strong>Xbox Controller Support:</strong> All menus and in-game actions are mapped to xbox controller inputs.\r\n</p>\n<p>\n<strong>Horde Mode, Arcade Experience:</strong> horde mode is a score based game mode in which there is no reloading, ammo is dropped by the infected, explosions don't hurt the player and weapons are purchased with coins.\r\n</p>", "metacritic": null, "released": "2017-02-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/fb2/fb237031d44e38f97df3c418b6597459.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["hardygames"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}