{"id": 94891, "slug": "seventh-saga-7drl", "name": "Seventh Saga (7DRL)", "name_original": "Seventh Saga (7DRL)", "description": "<p>My first attempt at the 7DRL jam, and mostly done as an exercise to muck about with Unity 5.  Take control of an evil demonic overlord and conquer the world with minimal help from your hellish armies.  Was originally going to be an epic Dynasty-Warriors esque army-vs-army battle, but for various reasons had to tone back a few things.  The end result is a fairly simple little turn-based RPG when you charge around the map slaughtering everything.</p><p>Controls explained in game.  Fairly simple turn-based rogue 'lite' with some minimal strategy.  Game ends when you die or when all human bases are conquered. </p><p>Hints:</p><p>Houses are the easiest base to conquer as they have peasants and thieves.  Towers are in the middle and the Fortresses are the toughest, housing the mighty Paladins.  Wait till you level up a few times before tackling them, or have an army to help you.</p><p>Corruption will spread from bases you capture but will be resisted by human bases.  Standing on the corruption gives you attack bonuses.</p><p>Creatures in forests are harder to hit.  Creatures on higher ground will never miss an attack.  </p><p>Wildlife will drop meat when killed.  Eat this to regain some health.</p><p>You (and enemies) can travel through water with no penalties.</p><p>Creatures in a base will charge out to kill nearby enemies.  Luring enemy armies to your bases will cause your own soldiers to fight enemy humans and help turn the tide.</p><p>Bugs</p><p>Enemies aren't supposed to occupy the same spaces but sometimes do when spawning from bases.</p><p>The pathfinding messes up when 'retreating' from an enemy that stands next to you, causing slowdown and confusing other nearby enemies.</p><p>Enemies sometimes charge out of their holdings to murder nearby animals.</p>", "metacritic": null, "released": "2015-03-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/df0/df0a69b181cabc78818ba1023c16367d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["DragonXVI"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}