{"id": 949043, "slug": "harold-tales-end-d", "name": "Harold Tales - End D", "name_original": "Harold Tales - End D", "description": "<p><strong><em>Hey, Zakie-poo?</em></strong><br/></p>\n<p>Yeah, Mino-moo?\r\n</p>\n<p><strong><em>Are you sure you’re up for this? You know that Reid is a complete asshole right?</em></strong>\n</p>\n<p>Priscilla’s there to rein him down. Also, he’s got some surprises waiting for him. “Fun” surprises I might add.\r\n</p>\n<p><strong><em>Really? Fun? You were really, really annoyed at them when they started spinning round and round and they all go AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA-</em></strong>\n</p>\n<p>O-Okay, Mino-moo! You don’t have to remind me! Ugh! Now I’m getting the jitters.\r\n</p>\n<p><strong><em>Ehehe. This has been fun. Setting all this up.</em></strong>\n</p>\n<p>…Yeah. I enjoyed this.\r\n</p>\n<p><strong><em>Zakie-poo? Do you think we have too many cooks in the kitchen here?</em></strong>\n</p>\n<p>Probably? I don’t really give a damn tho. Let people think as they please. Impressions aside, this is for a greater cause on our end.\r\n</p>\n<p>To save our friend and convince him of his true feelings, we will do what is must. Even if it means changing our wishes accordingly.\r\n</p>\n<p><strong><em>…Do you love him more than me, Zakie-poo?</em></strong>\n</p>\n<p>Don’t misunderstand, Mino-moo. You are irreplaceable to me. But I don’t want to think you’re the only creature I ever care about. Since the world doesn’t revolve around the two of us. So you don’t have to get jealous. \r\n</p>\n<p><strong><em>…Thanks for the transparency. I-I’m just worried is all. You’re doing this so fervently. For him no less. Not that I don’t respect him. Its just… you’re very passionate for him just like you used to be when you were with Oldhar.</em></strong>\n</p>\n<p>I guess so. But he is my childhood friend. I would do anything for his true happiness. I didn’t do him right back then during the tournament of Harolds. So this time, I’ll make it right.\r\n</p>\n<p>Anyways, sounds like he and Priscilla are approaching. Time for us to begin.\r\n</p>\n<p><strong><em>Right. And Zakie-poo?</em></strong>\n</p>\n<p>Yeah?\r\n</p>\n<p><strong><em>If he ever pisses you off, the most you can do is just fight seriously, ok? I don’t want you to fill yourself with hatred and vengeance for the guy before its all over.</em></strong>\n</p>\n<p>….I’ll try, Mino-moo.\r\n</p>\n<p><strong><em>I love you sugar cube.</em></strong>\n</p>\n<p>Love you too sweetpea.\r\n</p>\n<p>--------------</p>\n<p><strong>Controls</strong>\n</p>\n<p><strong>Z/Enter</strong> - Select\r\n</p>\n<p><strong>X/Esc</strong> - Cancel\r\n</p>\n<p><strong>Arrow Keys</strong> = Move\r\n</p>", "metacritic": null, "released": "2023-03-28", "tba": false, "updated": "2023-03-31T13:34:05", "background_image": "https://media.rawg.io/media/screenshots/7f6/7f6878012ea077c16180730274bb5828.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Berry B"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}