{"id": 949071, "slug": "battle-bot-training-simulation-itchio-version", "name": "Battle Bot Training Simulation (Itch.io Version)", "name_original": "Battle Bot Training Simulation (Itch.io Version)", "description": "<p>This is a short educational game that teaches the player about probability mathematics. </p>\r\nGameplay\r\n<p>You play as a battle robot that's being trained through a battle simulator game. The objective of the game is to beat the boss, whom can only be challenged after clearing out all the other rooms. If the player enters a battle room, they must face-off against an enemy in a turn-based battle. Both the player and the enemies get stronger as the game progresses, and new moves can be learned at the completion of every room. The player will also be given math questions to answer, which will give rewards if answered correctly, and punishments if answered incorrectly.</p>\r\nControls\r\n<p>The game is controlled through mouse movement and the left mouse button. The game also supports touch controls.</p>\n<p>For text boxes, pressing the forward button while text is still scrolling will automatically show all of the text for the current page.</p>\r\nNotes\r\n<p>Some notes regarding this version of the game are as follows:</p>\n<ul><li>The game is around 24 minutes in length.</li><li>This game was originally developed for younger audiences (ages 11-14), so it isn't that difficult. <br/>\n</li><li>The tutorial can be disabled on the title screen, but this setting cannot be changed once the game is started.<br/>\n</li><li>The browser version does not support game saving.</li></ul>", "metacritic": null, "released": "2023-03-28", "tba": false, "updated": "2023-03-31T13:52:18", "background_image": "https://media.rawg.io/media/screenshots/cb2/cb21ecaa39f29c31556e7c37dd8af664.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["mecha-rm"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}