{"id": 949081, "slug": "infinity-tower-edu05", "name": "Infinity Tower (edu05)", "name_original": "Infinity Tower (edu05)", "description": "<p>You are a adventurer who found a giant tower, whose top is lost in the skies. You enter it and the door closes behind you. Now there is no way out but death, so keep rising to fight and become a powerful being.</p>\n\n<p>In this game you have three classes:</p>\n<ul><li>Warrior: More life, defense and a good attack, but little crit. chance and damage and none ability power;</li><li>Assassin: More crit. chance and damage and a good balance with other stats;</li><li>Mage: More attack and ability power, but have less life and defense than other classes.</li></ul>\n<p>Every class have 3 diferent type of weapons and 2 different type of amors with differents abilities and passives for you choose.</p>\n<p>When you start the game, you have 3 doors to choose to go up to the next floor, where there will be a notice above it that will let you know what will happen if you choose.</p>\n\n<ol><li>If there is no notice above, that door will lead nowhere;</li><li>If it has a green question mark, the port will lead to some random event;</li><li>If it has a red question mark, the port will lead to an enemy;</li></ol>\n<p>Every 10 floors have a diferent and power enemy and boss, so be carefull!</p>\n<p>None of these arts are mine, if you like them, please support the artists:<br/>Font: https://somepx.itch.io/humble-fonts-free<br/>Scenary: https://opengameart.org/content/tileset-8x8-rosy-42-palette<br/>Enemies: https://deepdivegamestudio.itch.io/<br/>Weapons: https://macrune12.itch.io/<br/>Armors: https://clockworkraven.itch.io/rpg-icon-pack-400-accessories-clockwork-raven-stu...<br/>Icons: https://thewristbandit.itch.io/boxes-be-gone<br/>Music: https://opengameart.org/content/game-music-loop-rising</p>\n<p>If you like the game, please consider donate any amount. This is not the final version that will be released on Google Play. Leave your comment if you think you have to change something</p>", "metacritic": null, "released": "2023-03-28", "tba": false, "updated": "2023-03-31T13:57:25", "background_image": "https://media.rawg.io/media/screenshots/614/614b061e78c660b04fe07f5cd06a0699.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["edu05"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}