{"id": 94923, "slug": "nomore", "name": "Nomore", "name_original": "Nomore", "description": "<p>The temple of the ancient Nomorians is a one of the few remaining relics of an ancient civilization now long gone. Within its subterranean halls there are rumored to be great secrets of knowledge and artifacts of long lost technology. Within, too, there is danger, for the Nomorian builders did not leave their secrets unguarded. To get to those secrets, one must navigate the dark passages, avoid its sleepless sentries, and defeat the guardian at its core. With such treasures, one could reshape this world, revolutionize industry, and transform society….</p><p>...Ehh, but what am I telling you this for, thief? Look, the job is simple - get in there, shut down those defenses, bring me the Nomorian Archives and I'll give you all the nice shineys. Such a simpleton…*ehem*….I'm counting on you Jacque; your reputation speaks well of you. I hope it is, for your sake. The last several hires didn't fare so well…</p><p>-------------------------------------------------------</p><p><strong>CONTROLS:</strong></p><ul><li>WASD - Move</li><li>J - Jump</li><li>K - Dash</li><li>L - Shoot</li><li>Return - Pause</li><li>Arrow Keys - Alt Move</li><li>Z - Alt Jump</li><li>X - Alt Dash</li><li>C - Alt Shoot</li><li>Escape - Alt Pause</li></ul><p><strong>Controller</strong> ----------</p><ul><li>Left Stick - Move</li><li>A Button - Jump</li><li>X Button - Shoot</li><li>B Button - Dash</li><li>Right Trigger - Alt Shoot</li><li>Left Bumper - Alt Dash</li><li>Start - Pause</li></ul><p>Birds of a feather may flock together, </p><p>But this crow works alone…</p><p><strong>NOTE!</strong></p><p>The post-ludum-dare build has a number of bug fixes, including:</p><ul><li>Charge shot shoots through enemy bullets (but not boss)</li><li>Boss actually works!</li><li>Boss has ending after you kill it</li><li>Jumping after falling off ledge with double jump works</li><li>Third section of game less reachable without completing second section</li><li>Less random tile lines (still not fixed completely)</li><li>Less abrasive sounds!</li></ul><p>We recommend you play it, but remember that in the spirit of ludum dare, it is not what should be judged! Then again, there's no judging this time around, so what's it matter? Give it a shot!</p>", "metacritic": null, "released": "2016-08-30", "tba": false, "updated": "2019-08-28T23:25:45", "background_image": "https://media.rawg.io/media/screenshots/434/43469cb92a62891b990b32b0c4759553.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Unibear Studio"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}