{"id": 949370, "slug": "kill-the-lich", "name": "Kill the Lich", "name_original": "Kill the Lich", "description": "Description\r\n<p>Kill the Lich is an attempt at combining the genre of asymmetric multiplayer with tower-defence and action role playing gameplay to produce a new and fresh experience that could reinvigorate the many players who love these types of games. With this combination, we can provide players with experiences that address some of the pain points that we see in action role playing and tower defence games.</p>\n<p>Game balance tuned for 4 players: 3 heroes vs 1 lich<br/></p>\n<p>Possible for the game to be played by a minimum of 2 players: 1 hero vs 1 lich</p>\r\nFeaturing\r\n<p><strong>Four Unique Heroes:</strong></p>\n<ul><li>Rogue: fast, does big damage at close range</li><li>Spellsword: uses rapid attacks which provide self healing</li><li>Cleric: defends allies and controls crowds of enemies</li><li>Wizard: launches adaptive ranged spells</li></ul>\n<p><strong>The Lich and its Minions:</strong></p>\n<ul><li>Necrotic: Undead creatures seek to drag you to an early grave</li><li>Shamanistic: Nature strikes back against those who abuse it</li><li>Infernal: Demons and their ilk hellbent on wreaking havoc</li></ul>\r\nGameplay\r\n\r\n\r\nDiscord Community\r\n<p>Feel free to join our Discord community https://discord.gg/ySHXxs5BNg to find players, get updates and suggest changes!</p>\r\nDisclaimer\r\n<p>The game is currently in development.  We're currently offering a free demo version of the game to test demand and networking costs among other things. In the meantime, we'd appreciate any feedback you might have! </p>", "metacritic": null, "released": "2023-03-28", "tba": false, "updated": "2023-03-31T16:14:34", "background_image": "https://media.rawg.io/media/screenshots/fed/fedc5cf38a12c37f3bf8f593f7cb3020.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["SandyChip06", "GodofDragons", "eveehguo"], "genres": ["Action", "Strategy"], "publishers": [], "esrb_rating": null}