{"id": 949324, "slug": "escape-literarily", "name": "Escape, literarily!", "name_original": "Escape, literarily!", "description": "<p>Bienvenido a la demo de nuestro emocionante videojuego de escape room en primera persona ambientado en los mundos de los libros clásicos. En esta demo, tendrás la oportunidad de sumergirte en una aventura única en la que te encontrarás en la biblioteca de un viejo castillo.\r\n</p>\n<p>Tu objetivo es encontrar una manera de recuperar tus recuerdos. Para ello, tendrás que ayudar a personajes de los libros a resolver una serie de desafiantes acertijos y enigmas que te llevarán a través de sus mundos imaginarios y sus personalidades icónicas salidas de los libros más famosos de la literatura.\r\n</p>\n\n<p>Podrás explorar los libros de la bilbioteca, descubrir pistas ocultas, resolver rompecabezas y desbloquear secretos para avanzar en tu búsqueda de tu verdad. Pero cuidado, el tiempo corre en tu contra y cada segundo cuenta.\r\n</p>\n<p>Este juego de escape room en primera persona está diseñado para ofrecerte una experiencia única, llena de emoción y desafíos. Si te encanta la literatura clásica, la aventura y los juegos de escape, esta demo es perfecta para ti. ¡Prepárate para sumergirte en un mundo mágico y emocionante de libros clásicos!\r\n</p>\n\n<p>El desarrollo del juego ha sido una labor integra de los alumnos que recibieron consejo y apoyo durante la formación dual en la empresa Drakhar Studio.</p>\n<p>El equipo:</p>\n<p>- Bryan Andrés Pedroza Maldonado  Redes de Bryan</p>\n<p>- Eduardo Peña García </p>\n<p>- Mario Sierra Acosta</p>\n<p>Recomendamos jugar la versión descargada ya que la versión web tiene limitaciones técnicas y visualmente hay una gran diferencia:</p>\n\r\nVersion Web\r\n<p> <br/></p>\r\nVersión Windows\r\n\n\n<p>Usa el teclado [WASD] y [flechas] o el ratón. También disponible con mando.<br/></p>", "metacritic": null, "released": "2023-03-28", "tba": false, "updated": "2023-03-31T15:47:37", "background_image": "https://media.rawg.io/media/screenshots/afe/afe679b9c8020d8839a4789c6a2458f3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["CesarManriqueGames"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}