{"id": 949434, "slug": "robot-resistors-itch", "name": "Robot Resistors (itch)", "name_original": "Robot Resistors (itch)", "description": "<p>Attempt to out-maneuver and out-gun waves of enemies with different stats, abilities, and behaviors</p>\n<p>Our current build has 14 playable characters, 3 complete levels and a vast array of unlockable weapons and upgrades. With more of everything to come. <br/></p>\n<p>Confront challenging bosses with unique designs and movesets<br/></p>\n<p>Explore strange and exotic locales and get a glimpse of the dark future that awaits robot-kind should you fail. Each procedurally-generated level has different moods, objectives, and dozens of distinctive, hand pixeled, 16 bit inspired, enemies with unique traits to overcome. <br/></p>\n\n<p>Complete in-game achievements to unlock a vast armory of weapons, upgrades, and abilities</p>\n\n<p>Level up and select new weapons and upgrades to help you to survive in the face of adversity<br/>Collect salvage and purchase permanent upgrades to customize your characters and power them up for each run</p>\n<p>Discover the Ultimate versions of your weapons, should you upgrade early and lock in the Ultimate? or push your luck and wait to level the base weapon further?</p>\n<p>This is our rough plan for for upcoming content. The focus of each new big version will be the new level, but all the smaller additions (characters, weapons, etc.) will come out as we finish them. <br/><br/>V0.9 - Spring (or early Summer) 2023</p>\n<p>Complete Stage 4</p>\n<p>V1.0 - Fall 2023</p>\n<p>Complete Stage 5</p>\n<p>End of Early Access</p>\n<p>More?</p>\n<p>Other things we're planning to add as we have time for them<br/></p>\n<p>New Characters</p>\n<p>New Weapons</p>\n<p>New Ultimate Weapons<br/></p>\n<p>Mac Support<br/></p>\n<p>Difficulty settings</p>\n<p>Run History Page</p>", "metacritic": null, "released": "2023-03-17", "tba": false, "updated": "2023-03-31T16:43:05", "background_image": "https://media.rawg.io/media/screenshots/476/476c66a953d1dc29dae8a9f198407b9f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["crablacksmith.studios"], "genres": ["Action"], "publishers": [], "esrb_rating": null}