{"id": 949464, "slug": "fallen-star-ppowersteef", "name": "Fallen Star (ppowersteef)", "name_original": "Fallen Star (ppowersteef)", "description": "<p>The Sky has been blacked out into an endless night with the stars constantly shifting and falling. <br/>The Nightmare Knight has awoken and breaks havoc on those who try to sleep through it.<br/>It's up to the starborn Safire and her two magical friends to stand up and put an end to the endless night!<br/><br/>Jump and fight your way up through this vertical platformer through variouss short levels. <br/>But watch out, dying means starting over!<br/><br/>Choose between 3 characters that have varying abilities that gets stronger as long as you keep up a combo streak:<br/>- <strong>Safire </strong>has a short range fireball, maintain a combo to make her fire stronger and regenerate faster.<br/>- <strong>Kalynn </strong>uses arrows at a long range, but can resort to her melee weapon when she gets too close. <br/>However, her arrows can't damage dark enemies without her combo power.<br/>- <strong>Serene </strong>can create a bubble shield around her, dealing damage to any enemies nearby, she also deals extra damage to dark enemies.<br/><br/><strong>Controls:</strong><br/>Arrow keys: Move<br/>Z: Jump<br/>X: Shoot<br/>Enter: Pauze, reset<br/>Defeat enemies in a row to unleash a combo streak, the abilities of the combo depends on the character.<br/><br/>Gameplay inspired by Kid Icarus and Kamiko<br/>Some music tracks inspired by chorus from Rend Collective:<br/>- Title theme: Burn like a Star<br/>- Sky theme: My Lighthouse<br/>- Ending theme: Every Giant Will Fall<br/><br/></p>", "metacritic": null, "released": "2023-03-27", "tba": false, "updated": "2023-03-31T16:55:53", "background_image": "https://media.rawg.io/media/screenshots/7cb/7cb68082ec50b6a221744aed4cc853b7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ppowersteef"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}