{"id": 949412, "slug": "soothsayer-the-oraclepus-knows-all", "name": "Soothsayer: The Oraclepus Knows All", "name_original": "Soothsayer: The Oraclepus Knows All", "description": "<p>Soothsayer: The Oraclepus Knows All an adventure/simulation game with a deep lore. This game is between 1 to 2+ hours long.  Are you ready to jump into this rabbit hole into the Lasagnaverse?<br/></p>\n<p>You're playing as Zayden, a Thinphi alien. The thing is, you know weird things happen when emotions are high. You see, your parents, who are Thinphi themselves wanted you and your sister Faizah to live a normal life after what they went through. They've been working hard to keep this a secret from everyone, but you know better.</p>\n<p>Soothsayer has been broken up into 3 games:<br/><em>(Note: The games do take a few seconds to load. Do no worry if you see a black screen for a little bit.)</em></p>\n<p><strong>Game # 1 - Soothsayer: The Spiritium (prologue)</strong><br/></p>\n\n<p>After hearing all these stories about people disappearing from a place called the Spiritium,  you send your followers on Chirper, a late-night Chirp at 11:57 p.m., informing them that you're going in to see what this place is about. Little did you know that the owner would greet you at the door and let you in at midnight. Enter the world of The Spiritium, the place for all of your psychic needs. There's a talking magic 8 ball, a talking cat named Pawtrick Meowtimer, and a talking (sentient, demonic) fortune cookie too. You will also be introduced to the mysterious Cairistiona sisters: Aprika, Tanya, and Xania. Take your time and see what the future holds for you.</p>\n\n<p><strong>Game # 2 -  Soothsayer: The Oraclepus Knows All part 1</strong><br/></p>\n\n\n<p>11 months ago, Zayden's childhood friend went missing (yes, the same character you played as in The Spiritium). His last post on Chriper was at 11:57 p.m., and he was going to go into the Spiritium, the large, creepy-looking mansion where people flock to get their fortunes read with complete accuracy. Many people go in but never come out. Out of the blue, this new spokesperson named Joshua appears, pushing more people to come to the Spiritium, and it's working. But wait a minute, the spokesperson looks like Zayden's friend. What is going on here? Why is he calling himself Joshua? That isn't his name. Enter the world of Soothsayer: the Oraclepus Knows All. Face off against the devoted followers called Oraclepodians. Can you make it through the first eight areas of the Spiritium? Your destiny had already been decided by Oraclepus. There's nothing you can do but to just accept it, right?</p>\n\n<p><strong>Game # 3 -  Soothsayer: The Oraclepus Knows All part 2</strong></p>\n\n<p>Octodomination continues into this part of the game. You will interact with the Cairistiona sisters: Tanya, Xania and Aprika, Listen to the fortunes they give you or ignore it and search for your friend. Time is running out to save him and your destiny is calling.  </p>\n\n\n<p>Within the walls of the Spiritium, you will see the following:</p>\n\n\n<p>In both games, you will have access to the magic 8 ball. I have over 50 answers created but I could always use more questions. If you have a good question, send me a DM and I will add it into the game. Please let me know what name you would like to see in the credits.</p>\n\n\n<p><strong>Fortune Cookie</strong></p>\n\n\n<p>Don't forget to get your fortune from the cookie. There are over 70 cookie fortunes in game. Just remember... never mock the cookie. It may lead to you becoming a cookie or getting a really bad stomach ache and the Spiritium and its subsidiaries will not be responsible for anything that happens.  </p>\n\n<p>The player will have a choice of two types of readings: a three or a five card reading with the Spiritium <strong>Tarocchi</strong> master: Tanya Cairistiona. </p>\n\n\n\n<p>\n</p>\n<p>There are some one-off enemies but this could change for future update. Here are the enemies you will be facing off with the most:\r\n</p>\n<p><strong>The Octogrunt (Followers)<br/></strong></p>\n<p>People who follow decided to follow Oraclepus and his teachings. They will be given a 'gift' from Oraclepus. Some will stay at this level while some will become... 'Octobosses'.</p>\n\n\n<p><strong>The Octoboss</strong></p>\n\n<p>Octoboss Higher ranked followers who have already 'evolved to the next level thanks to Oraclepus' gift. They are deeply loyal subjects to Oraclepus. FYI, that is not a mask.</p>\n\n\n<p>See this square crystal? It is called a Zune Crystal. Pick it up to unlock a way to the next stage. Note: Not all stages will have the crystal. <br/>In the library, it will only give you the planned activities.</p>\n\n\n<p>Need some health? Talk to the Wise Old Man. He's always there to help. Just don't get mad if he doesn't call you by your right name.</p>\n<br/>\n\n\n\n<p>Okay, so you're getting three games, an instruction manual and... a lore book but there is a catch though.<br/></p>\n<p> The lore book is password protected and the answer is in Soothsayer: The Oraclepus Knows All parts 1 &amp; 2. Can you figure it out? Hint: It is a nine letter word. Answers should be entered in the PDF in ALL CAPS.<br/></p>\n<p>  The first person to figure out, send me a DM on:</p>\n<p>  Twitter: @XaniaLasagna  </p>\n<p>or</p>\n<p>  Mastodon: @Xanialasagna</p>\n<p>Keep your eyes on my socials for more details.</p>\n\n\n<p>I want to pick up where I left off. All game sales will continue to support the 'Fight climate change with Nature' with World Wildlife Fund (WWF). I started this last year with animal donations and I would really like to reach the goal. Once that goal is reached, another one will open up. <br/></p>\n\n<p>Thanks for checking out my game. I hope it's been an<strong> eye opening</strong> experience. See you soon Oraclepodian.</p>", "metacritic": null, "released": "2023-03-13", "tba": false, "updated": "2023-03-31T16:32:56", "background_image": "https://media.rawg.io/media/screenshots/b1f/b1fe600a548b3e6b01532ecf053d4d6a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["XaniaLasagna"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}