{"id": 949553, "slug": "zhi", "name": "Zhi", "name_original": "Zhi", "description": "<p>Zhi is a <strong><em>two-player</em></strong> cooperative<em><strong> puzzle game</strong></em> that takes players on a gripping journey of uncovering the mysterious and complex backstory of a broken family of four. As players work together to solve the puzzles, they gradually reveal the intriguing narrative that serves as the game's backbone.  </p><p>The immersive gameplay is inspired by<strong><em> escape rooms' </em></strong>challenging and mind-bending experiences. It encourages and requires players to communicate effectively with each other to unlock the secrets of the game. This aspect of the gameplay provides an excellent opportunity for players to develop and strengthen their communication and collaboration skills. \r\n</p>\n<p>The game is designed to be played in a relaxed, comfortable environment, ideally with a glass of wine and a good friend. The slow-paced nature of the game allows players to take their time and immerse themselves fully in the story, creating a truly captivating and engaging experience. \r\n</p>\n<p>The art style of Zhi is unique and cohesive, creating an atmospheric experience that draws players into the game world. The 2D pixel art segments add to the charm and retro feel of the game, and the attention to detail is evident in <br/>every aspect of the design. \r\n</p>\n<p>Overall, Zhi is an excellent choice for anyone looking for a thought-provoking and engaging cooperative puzzle game with a richly immersive narrative and a unique art style that will leave players craving more.</p>", "metacritic": null, "released": "2023-03-27", "tba": false, "updated": "2023-03-31T17:38:28", "background_image": "https://media.rawg.io/media/screenshots/171/171402b789b69d82f360c548cdee7231.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TeamZhi"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}