{"id": 94950, "slug": "theres-poop-in-my-soup-pooping-with-friends", "name": "Theres poop in my soup: Pooping with friends", "name_original": "Theres poop in my soup: Pooping with friends", "description": "<p>After it's viral success in 2016 There's Poop In My Soup is back and better than before. Featuring 3 brand new locations to poop all over, poop on Cowboys and Indians, poop on Pirates, poop on the Undead! Poop anywhere you please!<br/></p><p>The sequel features a completely overhauled graphics and physics engine, ability to pause the action and fly around the scene, a mini map for more accurate pooping and some of the dankest tracks you have ever laid your ears on!</p><p>Head to the wild west and poop on cowboys and Indians. Call upon the flaming poop caravan to send Bonnie and Clyde up up and away!</p><p>Drop a deuce on the decks of Captain Jack Spoorow's ship and unlock the mighty poop cannon.</p><p>Poop on the undead, give them a taste of the good ol' freedom and liberate them with a poop airstrike</p><p>Features:<br/>- Complete graphics and physics engine overhaul<br/>- 3 Unique locations to Poop on including the Wild West, a Pirate ship and Zombie Land<br/>- Pause or slow motion your gameplay and fly around the scene to see your destruction from any angle<br/>- All new achievements<br/>- Mini map for more precise aiming<br/>- Some of the freshest, dankiest music tracks<br/>- All new trading cards and shiny badges</p><p>Thank you to everyone who has supported and laughed with us over the last year, here is to another one!</p>", "metacritic": null, "released": "2017-04-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/09c/09c136054ac266a043a3b05bcb8e5d34.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 339, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["K Bros Games"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}