{"id": 9497, "slug": "tiledynasty-fps-arena", "name": "TileDynasty FPS Arena", "name_original": "TileDynasty FPS Arena", "description": "TileDynasty is an FPS Arena, where Players can work together against AI Enemies or go head-to-head accomplishing objectives within each game mode.<br/><br/>WEAPONS: Weapons compliment the game, from movement to the game play. Rocket jump to scale heights, or teleport to and from danger to defend your team. Use the EMP to slow down enemies, with a crippling 'Time-Dilation' effect. Remember you have the porter gun to make quick escapes, so use it wisely!<br/><ul>PORTER GUN</ul><ul>TIME-DILATION NADES</ul><ul>RAIL GUN</ul><ul>HEAVY MACHINE GUN</ul><ul>ROCKET LAUNCHER</ul><br/>MOVEMENT: Designed for fluid-like motion, coupled with Wall Movement, use multiple approaches to get to different platforms to your strategy! <br/><br/>OBJECTIVES: Depending on the Game Mode, objectives will vary. Each game, players are expected to work to the advantages of their class to be as successful as possible. Work together as a team or against the Bots to achieve high-scores!<br/><br/>ENEMIES: Bots are free to move in all directions, coupled with a tight way-point navigation system, they are tricky to out run or hide from. They're used either as allies or as opponents.<br/><br/>LEVELS: Maps will be designed to tailor to the 'Arcade-Feel' of the game, such as Wall Movement specific platforms / Teleporter-Gun only accessible ledges / Jump pads, to navigate to strategic areas or capture points.<br/><br/><br/>CASUAL MODES:<br/><br/>TileDynasty, Death Match, Survival<br/><br/>SURVIVAL: Introducing a survival mode, which features Online-Coop gameplay between single or multiplayers. This is a highscore mechanic where you have 3 lives shared between ALL players, so keeping each other alive is Key for survival!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:14:56", "background_image": "https://media.rawg.io/media/screenshots/878/878a087108ae22e4084835784d580b14.jpg", "website": "http://www.indiedb.com/games/tiledynasty-fps-arena", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 1, "achievements_count": 1, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Purpl3Grape"], "genres": ["Action", "Indie"], "publishers": ["Purpl3Grape"], "esrb_rating": null}