{"id": 94975, "slug": "fatal-flash", "name": "Fatal Flash", "name_original": "Fatal Flash", "description": "<p><strong>Look below for the Downloads. </strong></p>\n<p><strong>What is Fatal Flash and who are Single \"A\" Productions?</strong></p>\n<p><strong>Fatal Flash</strong> is a <strong>Free-to-Play 2D Multiplayer Brawler</strong> coming to<strong> PC</strong> and <strong>Mac</strong> that's full of beautiful pixel art. Our <strong>Kickstarter </strong>campaign begins February 27th and runs until March 29th.  We're a small team, but we're spread out across great distances. Our lead designer is in China, our programmer is in Brazil, and our artists are scattered all throughout the United States and Europe. We can't wait to deliver the full experience in the months to come. </p>\n<p><strong>Features: </strong></p>\n<ul><li>The game will release with at least 12 Archetypes, while the current roster includes just 6: <ol><li>The Swordsman</li><li>The Archer</li><li>The Assassin</li><li> The SHIELD</li><li>The Astralmancer</li><li>The Nightmare</li></ol></li><li>Each archetype has a set of abilities like one might find in a MOBA, yet they participate in a match much more like a fighting game.</li><li>The Archetypes participate in <strong>Elimination mode</strong>. It's essentially a 3v3 Team Deathmatch or a Free-for-All if you so choose. If you die, you're out for the round and your teammates must fend for themselves. </li><li>We have developed a <strong>Loadout system</strong> that allows players to pick perks in the form of cards which alter abilities and stats of their favored archetypes. This means you will have more control over the way you want to play, and as a result there will be more variability in gameplay. </li><li>There is an <strong>in-game Tutorial </strong>which we recommend you play to get a feel for the mechanics and controls (which can be set in the Options menu).</li></ul>\n\n<p>We intend to create more maps, more modes, and continue to add to the game. It will remain Free-to-Play even after the Kickstarter, but we will need to be fully funded for that to happen.  Follow us on our Twitter, Facebook, and go to our website to sign up for the mailing list and receive new builds of the game each week. Feel free to download the game and play it any time with your friends. Submit feedback and keep playing! </p>", "metacritic": null, "released": "2017-09-14", "tba": false, "updated": "2019-08-28T23:25:45", "background_image": "https://media.rawg.io/media/screenshots/c4c/c4ce322d1aee636e1f10a4edf1193020.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 329, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["SingleAProductions"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}