{"id": 949834, "slug": "now-you-have-no-one", "name": "Now You Have [No] One", "name_original": "Now You Have [No] One", "description": "<p>Published in memory of Esdeer aka BSOD - a game designer, a visual artist, a composer, a friend.<br/></p><p>The legless robot boss has probably inspired the form of Nikolai The Demon from Castle of no Escape 1-2. Though, sometime after this prototype and before the release of ConE2, Esdeer has introduced another character to the LD[T}W (Let's Destroy [The] World) project, named K'Noodsen, as an owner of the said robot (called \"golem\" for no real reason except a magic flavor to the word).</p>\n<p>Now You Have [No] One (beta-version 5)</p>\n<p>Made for: Ludum Dare 28 — December 13th-16th Weekend — Theme: You Only Get One</p>\n<p>How to play: </p>\n<p>Controls:</p>\n<p>Click the START button to start or continue the game.</p>\n<p>Select one or multiple units by pressing or holding left mouse button.</p>\n<p>When selected:</p>\n<p>1) Click right mouse button to make the selected units move to the mouse cursor position;</p>\n<p>2) Click middle mouse button to set their direction.</p>\n<p>3) Press 1-5 keys to raise their parameters (500 EXP for each upgrade). You can see what you upgrade with which key on the upper in-game info panel.</p>\n<p>Gameplay:</p>\n<p>Each character has his/her own unique passive abilities:</p>\n<p>Esdeer (red): every friendly unit in range does 2X damage.</p>\n<p>Kotori (yellow): auto-spawns EMP waves that damage enemies.</p>\n<p>Rezista (cyan): slowly heals every friendly unit in range.</p>\n<p>R2 (blue): certain enemies in range are slowed down to 50%.</p>\n<p>You lose when you have no characters left alive.</p>\n<p>There is no ending in this beta-version and technically there are only 5 levels, as nothing new appears after the fifth one.</p>\n<p>Authors:</p>\n<p>Game concept: Esdeer and Xitilon</p>\n<p>Programming: Xitilon</p>\n<p>Spriting: Esdeer (some visual effects by Xitilon)</p>\n<p>Music: Esdeer (title menu soundtrack - feat Xitilon)</p>\n<p>Original LD[T]W characters and visual designs by Esdeer</p>\n<p>Tools used: </p>\n<p>Engine: Game Maker 8.1 Standard</p>\n<p>Graphics: GM built-in sprite editor, and I forgot to ask Esdeer, probably WinXP MSPaint</p>\n<p>Music: FL Studio, OpenMPT</p>\n<p>Sound: findsounds.com</p>\n<p>17.12.2013</p>", "metacritic": null, "released": "2023-03-27", "tba": false, "updated": "2023-03-31T19:50:12", "background_image": "https://media.rawg.io/media/screenshots/555/5550b82fd2487d9635d9788d3bb20e17.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Xitilon"], "genres": ["Action"], "publishers": [], "esrb_rating": null}