{"id": 949843, "slug": "pixel-survivors-jamgame", "name": "Pixel Survivors - JamGame", "name_original": "Pixel Survivors - JamGame", "description": "<p>March 2023 libGDX 7 Day Game Jam Entry\r\n</p>\n<p>Theme: Pixel Wars</p><p>*Updated: 3/28. In my haste, I didn't realize current level and xp was not getting reset on death. Fixed that. Oops!</p>\n<p>To anyone who's played my previous Jam games, Don't go into this one expecting too much, I \"tried\" to take it easy. But in reality I ended up taking the theme a little too literally. I forced myself to use nothing but a single white pixel texture to create all the enemies and weapons. So I wasted a lot of time. Man what a headache. But I was able to throw together this crappy Vampire Survivors Clone anyway.  Enjoy.</p>\n<p>(If you want to play an actual good VS clone this jam. Just go play Sandra and Fourlastor's  instead) </p>\n\n<p>Warning, Balance may either be too easy or too hard. Good Luck<br/></p>\n<p>Basic Gameplay:</p>\n<p>You control a pixel.</p>\n<p>Movement WASD and Mouse for projectile aiming.</p>\n<p>The entire game works on the concept of auto-attacking.</p>\n<p>Each weapon (except 1) has a cooldown. Which will repeatedly fire off as time passes.</p>\n<p>Most of the projectiles will Fire Towards where your Mouse Cursor is. </p>\n<p>The one exception is the Sword. The sword will swipe Horizontally in the direction you are facing when you walk. (Yes, i know you are  a Pixel so I added Arrows to help you understand which direction you face)</p>\n<p>Kill enemy pixels and Collect the gems they drop, you must collect these Gems as fast as possible if you hope to survive. Collecting Gems will level you up. Giving you an Option to upgrade any of your possible weapons.</p>\n<p>Every upgrade to a weapon Increases Firepower, Lowers Cooldown, And May occasionally add additional projectiles or increase projectile speed.</p>\n<p>If enemies touch you, you will take Damage. \r\n</p>\n<p>Pick up the yellow pineapples that will drop to heal.</p>\n<p>To reach the End defeat the Boss which spawns after the 5 Minute mark.</p>\n\n<p><strong>Assets Used:</strong><br/></p>\n<p>All visual assets made my me.<br/></p>\n<p>All sounds and music found through https://freesound.org/</p>", "metacritic": null, "released": "2023-03-26", "tba": false, "updated": "2023-03-31T19:53:50", "background_image": "https://media.rawg.io/media/screenshots/5b2/5b25c94c77e92bc66385325fd67ba7f9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["BobIsHere"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}