{"id": 949890, "slug": "league-funny-you-xi-da-luan-dou", "name": "League Funny 遊戲大亂鬪", "name_original": "League Funny 遊戲大亂鬪", "description": "Introducing the ultimate KOL influencer multi-character battle action game! Immerse yourself in epic battles on the chaotic battlefield where every second counts. With a wide variety of hero characters to choose from, each with their own unique skills and abilities, the possibilities are endless!<br/><br/>Experience heart-pumping action and intense gameplay as battles can be completed within 5 to 8 minutes, making it perfect for a quick adrenaline rush on-the-go. And to up your game, customize and upgrade your arsenal with powerful dimensional props, traps, obstacles, and even gravity black holes to gain maximum tactical advantage.<br/><br/>But the fun doesn't stop there. With various styles and accessory configurations to choose from, create your own unique character image and stand out from the crowd. Whether you prefer a fierce warrior or a stylish fashion icon, the choice is yours!<br/><br/>Join the ranks of elite players and become a true champion in this amazing game. Download now and experience the excitement for yourself!<h3>Multi-character action brawl</h3>Diverse and distinctive hero characters possess unique martial arts skills, allowing them to exhibit various combat styles and defeat players from all over the internet.<h3>High-paced gaming experience</h3>Each battle lasts approximately 5 to 8 minutes, allowing players to easily enjoy the fun of a chaotic brawl in a short amount of time.<h3>Strategic props can be customized</h3>Powerful dimensional props allow players to place traps, obstacles, and even gravity black holes on the battlefield, providing greater flexibility in response to combat scenarios and increasing the game's strategic depth.<br/><br/><br/>\"Dream combination\"<br/><br/><br/>\"Adorable characters\"<br/><br/><br/>\"Thrilling battlefield\"", "metacritic": null, "released": "2023-03-30", "tba": false, "updated": "2023-04-03T04:46:47", "background_image": "https://media.rawg.io/media/screenshots/c67/c67471bd55828d48d211dbc18a7b9cad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 290, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["遊戲大亂鬥"], "genres": ["Action", "Massively Multiplayer", "Indie"], "publishers": ["遊戲大亂鬥"], "esrb_rating": null}