{"id": 949880, "slug": "boom-royale", "name": "Boom Royale", "name_original": "Boom Royale", "description": "Welcome to the battlefield in \"Boom Royale\"! Get ready for an exciting and challenging gaming experience in a simple and straightforward multiplayer shooter. With stunning graphics and fluid gameplay, \"Boom Royale\" offers unique and amazing Deathmatch game mode.<br/><br/>You'll face players from all over the world in intense and chaotic battles, where precision and speed are key to survival. With a wide selection of weapons and equipment, you can customize your character and prepare to dominate the battlefield.<br/><br/>The game is easy to play but hard to master. You'll need quick reflexes and skill to outwit your opponents in an adrenaline-fueled battle. And with balanced matchmaking, you'll always get a fair and challenging gaming experience.<br/><br/>If you are looking for an exciting multiplayer shooter with intense action, then \"Boom Royale\" is the perfect game for you. Join the battle now and show your skills to become the best soldier in the Deathmatch arena!<br/><br/>Play together with your friends and have fun! in Boom Royale, you can play with up to 8 players!<br/><br/>Customize your own player character, your personal t-shirt, to your liking. With hundreds of possible combinations, you'll always look unique!<br/><br/>Boom Royale is a game that gives you a lot of freedom and a lot of game mechanics to use or abuse. With full focus on multiplayer games, you will never get bored.<br/><br/>Main features:<br/><br/>.Online multiplayer with up to 8 players<br/>.Matchmaking and custom<br/>.More than 5 maps to explore<br/>.A variety of modern weapons<br/>.Smooth weapon system<br/>.IA<br/>.Flexible camera system<br/>.Timed deathmatch gameplay<br/>.Leaderboard and leaderboard<br/>.Multi kill system<br/>.Character cosmetics<br/>.Item pickups and power-ups<br/>.Elements of the interactive world<br/><br/>Easy to learn, hard to master. You'll never stop learning new tricks while playing Boom Royale, no matter how long you play. At the same time, it's easy for new players to just pick it up and enjoy.<br/>", "metacritic": null, "released": "2023-03-31", "tba": false, "updated": "2023-04-03T04:35:02", "background_image": "https://media.rawg.io/media/screenshots/330/330ecda26965c8a8a94652bb2cee6ac2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["HutStudious Company IRC"], "genres": ["Action", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["HutStudious Company IRC"], "esrb_rating": null}