{"id": 949931, "slug": "landfall-archives", "name": "Landfall Archives", "name_original": "Landfall Archives", "description": "<p>Break into the Landfall Archives and steal previously unreleased games, demos, interactive slide shows, and even an old version of TABS!<br />\nLandfall Archives is a collection of every project Landfall and friends have worked on since 2016 that didn&#39;t make it to the shelves but which all deserve to see the light of day. This collection of 23 projects includes:<br />\nAnything for my pals (2021)<br />\nControl a herd of Pals to help you navigate through a short level with obstacles.<br />\nRobots Forever (2018)<br />\nFind weapons to fight modular robots! Every robot part has its own health and can be destroyed separately so you better watch out…<br />\nRobots Forever 2 (2019)<br />\nThis game builds on the concept of modular robots from the first Robots Forever. Included are more robots with varying sizes and parts, as well as randomly spawning weapons with upgrades.<br />\nPost Game (2019)<br />\nSmall building game where you build conveyor belts and other parts to move packages around a facility. The more packages you get into the containers, the more credits you collect!<br />\nPhysics Survival (2019)<br />\nA physics animated top-down game where you explore and interact with the environment and animals to gather resources that you can use to get more equipment and units.<br />\nTABS 2017 (2017)<br />\nTABS 2017 is an early version of Totally Accurate Battle Simulator using the 2.0 physics system that was scrapped in 2017 in favor of the current 3.0 version. In the game you use a variety of different units to beat a level or you can play around in the sandbox mode.<br />\nAirships 1 (2018)<br />\nAn exploration of airship building, using a system with different modular parts you can use to build your ship. Fly the ship around the landscape to explore! We imagined this to be a way to travel around in some of the other prototypes.<br />\nAirships 2 (2018)<br />\nAnother version of airship building with different modular parts and improved stabilization for the airships, aiding in flying and construction.<br />\nWrecktangels (2019) Local PVP<br />\nSimple side-view battle game where you jump and shoot each other while using a time-slow mechanic. The world is built out of objects that collapse and break apart as they are hit, to keep you on your toes!<br />\nRTS card game (2021)<br />\nPlay cards to spawn units, and cast spells during real-time strategy gameplay. Build your own deck and combine cards to change which units and abilities are part of your deck. We made this to explore real-time card mechanics with some light RTS gameplay.<br />\nPhysics Fighter (2021)<br />\nBrawl with enemies in small rooms, using your fist, legs, and a knife. The enemies have different attacks and patterns that they follow during fights to keep you on your toes.<br />\nMedieval America (2020) Online PVP<br />\nPhysics shooter where you battle your enemy on a destructible level that collapses as the battle goes on, be careful not to fall!<br />\nPlant Plane (2019)<br />\nGo on a peaceful journey along the level in a plane, creating bushes and leaving nature around you as you fly past.<br />\nOcean Plane (2023)<br />\nFly around and fire small missiles at airships and towers, in and around an ocean.<br />\nPlayful (2021) Online PVP<br />\nA 1v1 game where you can battle and play in different scenarios with your own rules and goals. It was made to be a sandbox to create your own small games in.<br />\nBlob Game (2018)<br />\nA small experience of being locked in a room with an unknown creature while a voice speaks to you. There are a few different endings to this game, can you find them all?<br />\nWalking House Game (2021)<br />\nPrototype for a building game where you control and build a walking castle. Travel to explore and gather resources around you to build and upgrade your base. Beware of the enemies lurking nearby!<br />\nMissile Game (2021)<br />\nControl missiles and fly them through different levels with varying obstacles to bring down physics towers, with the goal of destroying the small objects you find in the structures.<br />\nCreepy Robots (2017)<br />\nRun and climb around a small town scene while being chased by humanoid robots!<br />\nROUNDS 3D (2022) Online PVP<br />\nPrototype for a 3-dimensional version of the game ROUNDS. It’s mainly explored with the shooting mechanics and a handful of upgrades.<br />\nCounts and Stakes (2020) Online PVP<br />\nA vampires vs vampire hunters-themed top-down-shooter focusing on precise aiming. Play against other players in small arenas with physics obstacles that you can interact with.<br />\nPhysics Presentation (2018)<br />\nNot exactly a game, but more of an interactive slideshow made to be used as a presentation explaining the principles of the physics used in Landfalls games.<br />\nAuction Brawl (2017) 2-4 Local Splitscreen<br />\nSplit screen fighting game where you bid on items that you then use to brawl against the other bidders. You can also grab and use most other items in the auction room to fight your fellow players!</p>", "metacritic": null, "released": "2023-03-31", "tba": false, "updated": "2024-01-06T12:15:13", "background_image": "https://media.rawg.io/media/games/b1b/b1b9f4082f6208527c67af297055f631.jpg", "website": "http://landfall.se", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 136, "beaten": 4, "toplay": 4, "dropped": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Landfall"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Landfall"], "esrb_rating": null}