{"id": 949992, "slug": "stray-souls-2", "name": "Stray Souls", "name_original": "Stray Souls", "description": "Unlock the secrets hidden within the haunted town of Aspen Falls, featuring gruesome enemy encounters, epic bosses, cunning puzzles, and a deep story where not everyone is who they seem. Play as Daniel – an average teenager whose life is forever changed after inheriting the home of his estranged grandmother and meeting a mysterious woman with intimate knowledge about his family, the house, and its shocking connection to his past. The gameplay elements inspired by classic horror combat with soulslike precision, put a fresh spin on the modern action-horror genre.<br/><br/><strong>FEATURES:</strong><br/><br/><ul><li>Explore the town of Aspen Falls and surrounding areas to uncover a malevolent plot set in motion at Daniel's birth.<br/></li><li>Immerse yourself in Daniel's story. Choose responses at key moments through branching dialogue options, shaping Daniel's tone and personality.<br/></li><li>Fight hordes of nasty creatures or run for your life. Simplified combat without massive loadouts puts the focus on strategizing combat tactics and resource management.<br/></li><li>Solve dozens of clever puzzles with out of the box solutions to test your wit.<br/></li><li>Randomized systems ensure that enemy encounters, item locations, changing weather patterns, and strange phenomena all occur at various places, making each playthrough unique.<br/><br/><br/><br/>Experience sheer terror like never before with the raw combined power of the Unreal Engine 5 and MetaHuman technology. Advanced facial animations capture a wide range of human emotion, creating a whole new level of photorealism! Dynamic lighting and weather bring Aspen Falls to life in eerie detail, from the peeling wallpaper of Grandma's house to the dense reaches of a fog-covered forest and beyond!<br/><br/><br/><br/><br/><br/>Welcome to Aspen Falls, a small town plagued by a sinister curse devouring everything in its path. After inheriting the home of his estranged grandmother on his 18th birthday, Daniel thinks he's won the lottery, but soon discovers luck had nothing to do with it. He's now at the center of a dark ritual that threatens his very existence and must embark on a terrifying journey to uncover the secrets of his past.<br/><br/><br/><br/><br/><br/>The choice is yours. Daniel is not a trained soldier. Grab a weapon and stand your ground or run to safety and save your health and ammo for one of the game's tough bosses.<br/><br/><br/><br/><br/><br/>Test your powers of deduction and problem solving on classic-style puzzles with a modern facelift.<br/><br/><br/><br/><br/><br/>Featuring legendary guest composer Akira Yamaoka (Silent Hill) and veteran indie composer Pete Wicher. Haunting and ethereal at times. Hellacious and unnerving at others. Get lost in the captivating original score on your journey across Aspen Falls.</li></ul>", "metacritic": null, "released": "2023-10-25", "tba": false, "updated": "2023-11-26T08:32:36", "background_image": "https://media.rawg.io/media/screenshots/327/32742df4ae48bce2a39e43eee82c5e3c.jpg", "website": "http://www.straysoulsgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 4, "beaten": 3, "toplay": 8, "dropped": 3}, "playtime": 0, "achievements_count": 10, "ratings_count": 2, "suggestions_count": 417, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Jukai Studio"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Versus Evil"], "esrb_rating": null}