{"id": 949906, "slug": "retro-golden-age-goody", "name": "Retro Golden Age - Goody", "name_original": "Retro Golden Age - Goody", "description": "Retro Golden Age games revive the glorious past of Spanish classics in a unique retro line. Relive the original SPECTRUM action, platform and puzzle game from the classics as originally designed by their creators and experienced by your parents and your parents' friends.   <br/><br/>The Retro Golden Age line also adds an \"Experience 2023\" mode that allows you to go back in time up to 5 minutes to correctly retrace your steps to succes.<br/><br/>It's up to you to live the adventure “fair and square”, or with aids that allow you to live the full experience. <br/>---<br/><br/><strong>A very Good(y) story </strong><br/><br/><br/><br/>Life is hard for everyone. If not, just tell it to Juan Nelson Brainner Stravinsky, alias Goody, a gentleman of noble descent from a good and noble family. As fate would have it, he has found himself as poor as rats, being forced to dedicate himself to a little-appreciated \"art\": the appropriation of other people's property. But of course, this new lifestyle brings with it some added risks... <br/><br/>Goody is thinking of leaving this life and never do an ounce of work, but for that he needs a lot, a lot of money. His latest plan consists of the BIG BANK ASSAULT (yes, in capital letters), something that will not be easy, especially because the city is besieged by enormous dangers for such a distinguished thief. <br/><br/>Rodríguez, a police officer, is trying to catch Goody and put him in jail, thus securing his prized promotion in the force. In addition, \"Charly el Bardeos\", a notorious and unsubtle crook who envies Goody and wants to \"steal\" all the money he has on him, is roaming the streets of the city. To all this we add vile snakes, gorillas in the park, rats in the sewers, evil bankers, ghosts, bricklayers... <br/><br/>But a thief's dream is more powerful than all!", "metacritic": null, "released": "2023-03-31", "tba": false, "updated": "2023-04-03T05:08:29", "background_image": "https://media.rawg.io/media/screenshots/c3d/c3dc77a8ca1981f34c14b19df2ae0206.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Opera Soft", "Zerouno Games"], "genres": ["Adventure", "Indie"], "publishers": ["Zerouno Games"], "esrb_rating": null}