{"id": 949993, "slug": "blacksmith-master", "name": "Blacksmith Master", "name_original": "Blacksmith Master", "description": "\n<br/><br/><br/><br/>\nFrom city building to RTS, space exploration to ancient history, see more indie strategy, simulation, and RPGs from Hooded Horse.<br/>\n\nBlacksmith Master puts you in charge of your own medieval forge and has you manage resource acquisition, refining, and the production and sale of finished goods alike. Find and hire the best staff for each respective step of the process and equip them with the right tools to optimize your business. Design your shop for the best throughput, and seek out new opportunities in the market as customers come in looking for a variety of historically inspired items – from weapons and armor to tools and cooking utensils, you’ll perfect your craft to become the Blacksmith Master. \n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nTucked away through the winding alleys of a small medieval town lies your workshop – at first just a humble place for a humble blacksmith, but with potential for greatness. Here, you control the entire production chain - from mining the ores to smelting them into ingots, then crafting weapons, armor, tools, and jewelry to put on display and sell to customers for a profit. You will design your shop to make the best use of space, ensuring there’s enough room for the production and sale of goods alike, while adding personal touches to liven up an otherwise dreary space. As your reputation grows, so too will your operation, and it won’t be long before you become a master of your craft. \n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nBe it a footman’s sword, a woodsman’s axe, or an inn keeper’s frying pan, everything you produce will require raw materials dug up from the earth. Hire miners, equip them with the right tools, and ensure they have everything they need to be efficient – without them, you cannot keep your business operational. Each additional miner means additional wages that need to be paid, though overworked staff are likely to get tired and inefficient. Will you opt to provide rest stations and additional staff to keep your employees satisfied regardless of cost, or will you instead keep a handful of overworked individuals to maximize your profits? After all, mining the ore is only the first step of the process, and there are many more wages to pay. \n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nThere will be many different ways to craft items in Blacksmith Master - some will require a longer process which includes heating an ingot, hammering it on an anvil, tempering it, assembling parts, and finally sharpening it on a grinding wheel.  Other items will be simpler to make, requiring less effort and time, though they might sell for a smaller profit margin as a result. \n<br/>\nYour job will be to optimize your workspace as much as possible so your team of blacksmiths can work in tandem, creating goods from the simple to the highly complex, servicing customers from and around your small town. Besides weapons, shields, and armor, your crafting recipes will include other common things that medieval blacksmiths would make. This includes items like:\n<br/>\n<ul><li>Kitchen utensils - spoons, forks, pots, cauldrons and everything in between.\n<br/>\n</li><li>Tools - from axes to hammers, take your pick!\n<br/>\n</li><li>Jewelry - necklaces, rings, bracelets, and crowns all fetch a handsome price.\n<br/>\n</li><li>Plus many others!</li></ul>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nDifferent blacksmiths will have different skills that you need to cultivate. Some will be great at working with metal, others will be great glassblowers, and others still might be particularly proficient with gems. Crafting items of a certain category will increase a blacksmith’s skill level, enabling them to craft more complex creations, though it might come with an added cost. Will you train them as generalists, ensuring they all have support when needed, or will you seek to train famed specialists?", "metacritic": null, "released": null, "tba": false, "updated": "2023-04-03T07:42:59", "background_image": "https://media.rawg.io/media/screenshots/ef3/ef31683bc00754b1662b8d91a18df279.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 426, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Untitled Studio"], "genres": [], "publishers": ["Hooded Horse"], "esrb_rating": null}