{"id": 95017, "slug": "dragondell", "name": "Dragondell", "name_original": "Dragondell", "description": "Features\r\n<ul><li>Play an adorable dragon, avoiding knights, collecting treasure, and befriending royalty.</li><li>Each playthrough is only a few minutes, but generated rooms and layouts make every one unique.</li><li>Three difficulty modes, from peaceful Tourist to hardened Veteran.</li><li>Detailed scoring system rewards you for being clever, brave, and thorough, along with a few surprise bonuses to keep you on your toes.</li><li>Bonus downloads: Pico-8 game cartridge, soundtrack mp3, and game manual.</li></ul>\r\nInstructions\r\n<p><em>Want more details, strategy tips, and lore? Full game manual coming soon!</em><br/></p>\n<ul><li>Move with <strong>arrow keys</strong>, breathe fire by <strong>holding X</strong>, and befriend a royal immediately in front of you with <strong>Z</strong>.</li><li>Lead royals to the doors of castles whose flags match their robe color.</li><li>Find keys to open chests and get treasure.</li></ul>\n<p>The game ends when you find and use the blue portal ... unless a knight gets to you first. Whether you want to be sneaky or aggressive, quick or complete, is up to you.</p>\n<p><strong>Note: There's a flickering effect when you go through the portal. </strong>You can turn it off by pressing <strong>P</strong> and selecting \"disable flicker.\" (You can also toggle the music this way.)<br/></p>\r\nCredits\r\n<p><em>Design, Code, &amp; Art</em> - Relsqui</p>\n<p><em>Music &amp; Sound Design</em> - Gruber</p>\n<p><em>Game Manual Design</em> - DotDotCo</p>\n<p><em>Playtesting &amp; Support </em>- Jeremy Apthorp, Yoshi Murai, Joel Bradshaw, Randall Munroe, the Pico-8 community, the fine folks of Hype o'Clock, and others. Thank you!</p>", "metacritic": null, "released": "2018-04-13", "tba": false, "updated": "2019-08-28T23:25:45", "background_image": "https://media.rawg.io/media/screenshots/80d/80df0da1798c2ff63d70658308e109f2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["relsqui"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}