{"id": 950233, "slug": "the-vhs-alchemist-remastered-alpha", "name": "The VHS Alchemist [REMASTERED] (Alpha)", "name_original": "The VHS Alchemist [REMASTERED] (Alpha)", "description": "<p>Ремастер вот этой игры: https://vas1l1us.itch.io/the-vhs-alchemist</p>\r\nКоманда 8 \r\n<ul><li>Артем Петрович - Unity Developer<br/>\n</li><li>Артем Бабицкий - 3D Artist<br/>\n</li><li>Михаил Апасов - 2D Artist\r\n</li><li>Андрей Распутин - Sound Designer<br/>\n</li><li>Мария Русакович - Narrative Designer<br/>\n</li><li>Егор Павлин - Game Designer</li></ul>\r\nОписание\r\n<p>Главный герой - ученик королевского алхимика, чей наставник бесследно пропал. Послушник осознает, что если наставник вскоре не вернется , то его самого обяжут стать следующим алхимиком на службе у короля. Не имея достаточных навыков, ученик опасается прослыть жуликом и лишиться головы. Потому герой и отправляется на поиски своего учителя, используя таинственный артефакт наставника - видеокассету, что открывает портал в Retrowave измерение. \r\n</p>\n<p>Retrowave измерение - набор уровней разной сложности, дизайн которых выполнен в стиле киберпанка, ретрофутуризма, а музыка звучит в стиле Synthwave. Препятствия в этом измерении вынуждают героя в кратчайшие сроки постичь навыки алхимии, чтобы остаться в живых. На своём пути он будет крафтить простые и сложные зелья, которые помогут ему в преодолении ловушек и головоломок.\r\n</p>\n\n<p>********</p>\n\n<p>Team-8</p>\n<ul><li>Artem Petrovich - Unity Developer\r\n</li><li>Artem Babitskiy - 3D Artist\r\n</li><li>Mihail Apasov - 2D Artist\r\n</li><li>Andrei Rasputin - Sound Designer\r\n</li><li>Mary Rusakovich - Narrative Designer\r\n</li><li>Egor Pavlin - Game Designer</li></ul>\n<p>Description</p>\n<p>The main protagonist is a royal alchemist's apprentice. His master dissappears without a trace. The apprentice realises a terrible thing: if his master doesn't come back, he'll be chosen as the next royal alchemist. He isn't ready for this position and doesn't have enough skills. He's afraid that his lack of skills can lead people to accusing him of being a crook. He set off on a journey to find his master using his teacher's secret artefact - a videotape that opens a portal to another dimension.</p>\n<p>Retrowave dimension is a set of levels of different complexity. The design of these levels is made in cyberpunk and retrofuturism styles. The music is made in the style of synthwave. Obstacles in these levels make the protagonist learn alchemy in no time to stay alive. On his journey he'll craft simple and complex potions that'll help him to survive.</p>", "metacritic": null, "released": "2023-04-02", "tba": false, "updated": "2023-04-03T12:17:38", "background_image": "https://media.rawg.io/media/screenshots/9a1/9a11fdf44c407087f768ba1c19149b9b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Narrative_Mari", "Yahor Paulin", "Bobch_Art", "Fetych"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}