{"id": 950355, "slug": "shortest-fuse", "name": "Shortest Fuse", "name_original": "Shortest Fuse", "description": "<p>Experience the full story of the Short Fuse factory, taking the side of both the employee tasked with defusing wacky bombs and the person creating them! This is a bundle of Short Fuse and Fuse Short, two games created for RPI's Experimental Game Design class.</p>\n\n<p><strong>--- Short Fuse ---</strong><br/></p>\n<p>For one reason or another, your employer has a LOT of bombs. And because you signed the paperwork (not that you knew what you were getting into), you need to defuse each and every bomb! Did we mention that these bombs are all about to explode? Don't worry, all you need to do is snip the red wires. Good luck! <br/></p>\n<p><strong>--- Fuse Short ---</strong></p>\n<p>Way back in the time of Short Fuse, there was someone on the other end of the intercom to help you on your way. Well... not really help, but they were there, that's for sure. Now you can finally experience a piece of what's on the other side of the intercom! Play as an average office worker whose only job is to make bombs!</p>\n\n<p><strong>--- How To Play ---</strong><br/></p>\n<p>Shortest Fuse is meant to be played with the mouse. Click on a bomb with left click and use the scroll wheel to zoom in and out. <br/></p>\n<p>In Short Fuse, your goal is to find and defuse each bomb as fast as possible. This is done by clicking on all of the red wires on the bomb.</p>\n<p>In Fuse Short, your goal is to create the bombs to spec. Click on the bomb the spec calls for (as seen in the top left monitor) and construct it so it has the same number of red and normal wires (seen as a red and white number respectively.) When done, press the \"GO\" button.</p>\n\n<p><strong>--- Credits ---</strong><br/></p>\n<strong>Charles Reverand</strong>Programming, VFX, &amp; UI<br/><strong>Kend'or Wilson</strong>Sound Programming, Sounds, &amp; Game Design<br/><strong>Chad Van Patten</strong>3D &amp; 2D Artist<br/><strong>Mike Farley</strong>3D Artist<br/>\n<p>// Audio\r\n    </p>\n<p>Base Cake Explosion Sound by Toby Fox (Deltarune)\r\n    </p>\n<p>Ambient Sound Base by InspectorJ\r\n    </p>\n<p>// Fonts\r\n    </p>\n<p>Digital-7 by Sizenko Alexander\r\n    Nanum Pen Script by Sandol</p>", "metacritic": null, "released": "2023-04-02", "tba": false, "updated": "2023-04-03T13:21:09", "background_image": "https://media.rawg.io/media/screenshots/395/39543ac0a300900e454686fb329ab078.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["taliyos", "ken10wil", "Chad VanPatten"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}