{"id": 950667, "slug": "the-violette-mage", "name": "The Violette Mage", "name_original": "The Violette Mage", "description": "<p><strong>The Violette Mage (Demo)</strong></p>\n<p>A downloadable game for Windows, macOS, and Linux.\r\n  </p>\n<p><strong>The Violette Mage is still in development, so this is only a demo. If you’re interested in seeing more to come, please check back for development updates.</strong></p>\n<p><strong>Story Summary:</strong>\n<br/></p>\n<p>During the twilight hour in Mourningwood… Violette, a young mage with a fascination for the supernatural, stumbles upon a floating mirror in the forest while exploring. She touches it and finds herself transported to an ancient magical realm that resembles her own but much older.\r\n  </p>\n<p>Lost and alone, she is discovered by an elf named Ferrand in the misty forest who takes her under his wing, and then he takes her to his village to meet the elven king.\r\n  </p>\n<p>There, the king reveals that Violette may have been brought to their world through a liminal space and he assigns Ferrand to help her navigate this place.\r\n  </p>\n<p>Later, the elf takes Violette back to his home, where she meets his skeptical sister. And even though, the sister initially distrusts the human stranger, she eventually warms up to her.\r\n  </p>\n<p>Not only that, a mysterious purple-blue eyed faun has been entering Violette’s dreams and whispering cryptic messages to her about her fate and destiny.\r\n  </p>\n<p>And these strange words seemed to hold a secret, a promise of something greater than what Violette had ever known. <em>But what did they mean? What was her destiny?</em>\n</p>\n<p>Although no one sensed it yet… an evil far more ancient was lurking within the realm, and all the magic in the land may not be enough to stop it from consuming the world...<br/></p>\n<p><strong>FEATURES:</strong></p>\n<ul><li>Original      Character Art.\r\n</li><li>Custom hand-painted backgrounds with a fantasy theme.\r\n</li><li>8456+      words (in the Demo Version, but the Full Version will be much longer).\r\n</li><li>Estimated      Playtime: Around 30 minutes.\r\n</li><li>6+      endings (<strong>Full Version ONLY</strong>).\r\n</li><li>Full game will have two romanceable characters (but only one character  is actually seen in the demo so far). – And if there’s some interest in  even further development of the game… we might add in two other  characters, making it four possible romance choices.</li></ul>\n<p><strong><em>Features that are still missing in the Demo:</em></strong>\n</p>\n<p>Character Sprites for the other characters (ATM, it’s just silhouettes… since the artist wasn’t able to finish shading them all, due to the time constraints of the game jam).\r\n  </p>\n<p>More Backgrounds (as there is still quite a lot missing, but the other backgrounds are in progress right now…).\r\n  </p>\n<p>Character Route(s) + Endings</p>\n<p>CGs + CG Gallery.\r\n  </p>\n<p>Sounds Effects (Ambience, etc).\r\n  </p>\n<p>Branching Choices. <br/></p>\n<p>Fog Effect, plus sprite lighting effects.</p>\n<p><strong>Credits:</strong>\n<br/></p>\n<p><strong>Writing, Coding, Editing, Original Story Concept by:</strong> Keiryth (Kei).\r\n  </p>\n<p><strong>Logo, Character Art &amp; Concept/Design, Painted Backgrounds and GUI + Coding by:</strong> Runayo (Runa).\r\n  </p>\n<p><strong>Music:</strong> Sascha Ende + Alexander Nakarada + MusicLFiles (filmmusic.io), Dova Syndrome.\r\n  </p>\n<p><strong>Sound Effects:</strong> N/A yet. <br/></p><strong><strong>Extra Note</strong>:</strong><p>We added a mac version. Unlike the windows version, it's untested, as we both don't have a mac computer. So, hopefully it works.<br/></p>\n<p><strong><strong>For Feedback, Contact</strong>:</strong><br/></p>\n<p>citruskoigames@gmail.com</p>\n<p>At the moment... our social media links are not ready for our group (which consists of two people), so email is currently the best way to give us feedback.</p>", "metacritic": null, "released": "2023-04-02", "tba": false, "updated": "2023-04-03T16:08:29", "background_image": "https://media.rawg.io/media/screenshots/16f/16f6051dda9b8d61ebb87af31ab5f952.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Citrus Koi"], "genres": [], "publishers": [], "esrb_rating": null}