{"id": 950683, "slug": "journey-to-the-fairy-city", "name": "Journey to the Fairy City", "name_original": "Journey to the Fairy City", "description": "<p>You are lost in the middle of the woods... When you lay down to rest you remember a clear path in front of you but now you only see trees everywhere... And it's getting darker and darker as the fire pit goes off. You need to do something quickly and get out of there, you don't know what is lurking in the shadows.\r\n</p>\n<p>Known Issues</p>\n<p>You want to help me with the bugs? I would love that! You can make push requests and help me with those basic things I don't know!\r\n</p>\n<p>So let's list everything that I know that is not working:\r\n</p>\n<ol><li>Yeah, you can't play forever (in a single run)... You can only once click the \"continue\" button, the second time the game freezes :(\r\n</li><li>The spiders can kill you and everything in the game ...... if they get inside you. It's creepy, but it's true. (It's because the code I'm using for the spiders to follow you, if they reach the same position as you, it can't calculate where to go...)\r\n</li><li>Sometimes the spiders get lazy and just stay in their place... Sometimes it's because they can't see you, sometimes it's because they don't know how to get to you.\r\n</li><li>You can pass all the trees if you use the action button and arrow keys at the same time in some situations. It looks like you are cheating hehe.\r\n</li><li>The spritecollide don't work all the time with the spiders and sometimes it takes a lot of attacks to kill one... I could say it's a feature, but I don't know how exactly I could fix it... I needed to redo all the sprites, maybe?\r\n</li><li>There is no sound. I know it's sad... But I didn't have time to do that :((((\r\n</li><li>There is no other levels. I couldn't make them... But I promise I'll do it after the end of pyweek (at least once a month I'll update the game!)\r\n</li><li>There is no fairy city...yet. If you finish the game, you can only see the beatiful emptyness and think about your life choices. I hope it's not much for you.\r\n</li><li>There is no movements. BUT 99% of this is not an issue. I just need movement for the attacks and repel the spiders so the player don't die so fast...\r\n</li></ol>\n<p>Thanks for trying my game!</p>", "metacritic": null, "released": "2023-04-02", "tba": false, "updated": "2023-04-03T16:14:24", "background_image": "https://media.rawg.io/media/screenshots/419/419a0882ec4785f306743cc682704ee6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shyr"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}