{"id": 950862, "slug": "rage-blade", "name": "Rage Blade", "name_original": "Rage Blade", "description": "<p><strong>(Note: Enter full-screen mode or download for the best experience!)</strong></p>\n<p><strong>Welcome to RAGE BLADE!</strong></p>\n<p>A game created by John Cervantes for DMD 2542</p>\n<p>You play as an accursed sword that was cast away by the hero, transforming from a blade of honor to a blade of rage. A Rage Blade, if you will.</p>\n<p>You swear vengeance on this unforgiving world! Cut down hordes of monsters and even your fellow Rage Weapons! Build up your rage and UNLEASH IT!</p>\n\n<p><strong>GAMEPLAY:</strong></p>\n<p>This game is an endless turn-based RPG battle, where enemies will randomly spawn in one after the other.</p>\n<p>You play as the Rage Blade. Make sure your HEALTH METER doesn't drop to 0, and charge up your pink RAGE METER to use special moves!</p>\n<p>You gain 1 Rage when you are attacked by an enemy. The enemy also gains 1 Rage when you attack it.</p>\n<p>You have four options to choose from at the start of your turn:</p>\n<p>ATTACK: You take a swing at the enemy, dealing damage.</p>\n<p>HEAL: Consume 1 Rage to restore half your HP.</p>\n<p>DEFEND: Reduces an enemy's attack damage to 1, and builds up 3 Rage.</p>\n<p>UNLEASH: You can one of these special moves when your Rage meter is full! Each move consumes 10 Rage.</p>\n<p> PURGE: A better Attack. A devastating one-shot attack.</p>\n<p> CATHARSIS: A better Heal. Fully restore your HP.</p>\n<p> SPURN: A better Defend. Completely block an enemy's attack, building up half your Rage meter and reflecting the hit back to the enemy.</p>\n<p>Cut down your enemies and get the highest kill streak! But watch out! Enemies can build up their Rage meter too, and unleash a Purge at you!</p>\n<p>Cut down enough enemies, and you might find that other Rage Weapons seek your downfall too, such as the mighty RAGE BOMB and RAGE AXE.</p>\n<p>The Rage Bomb enters combat fully charged with rage, ready to throw a Purge at you. Make sure you DEFEND to absorb all of its rage for yourself!</p>\n<p>Meanwhile, the Rage Axe is a formidable foe, with no weaknesses. Do your best to fell this enemy!</p>\n<p>Go forth, and RAGE!</p>\n\n<p><strong>CREDITS:</strong></p>\n<p>BGM \"Anime Fight Music Loop #1\" by Sirkoto51 https://freesound.org/people/Sirkoto51/sounds/414214/</p>\n<p>Sound Effects:</p>\n<p>\"samurai slash\" by nekoninja https://freesound.org/people/nekoninja/sounds/370204/</p>\n<p>\"Cyber Punch 03\" by JohnLoser https://freesound.org/people/JohnLoser/sounds/573378/</p>\n<p>\"healpop.wav\" by shyguy014 https://freesound.org/people/shyguy014/sounds/458533/</p>\n<p>All artwork, animation, and programming by me!</p>", "metacritic": null, "released": "2023-04-01", "tba": false, "updated": "2023-04-03T17:25:10", "background_image": "https://media.rawg.io/media/screenshots/d16/d163566a39e6ecb365a52b612b1590f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Cinnamatsu"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}