{"id": 950877, "slug": "alakablam", "name": "Alakablam", "name_original": "Alakablam", "description": "<p><strong>Alakablam </strong>is a chaotic multiplayer platformer where you're tasked to use spells, potions, and armor to your advantage, defeat (up to 3) of your friends, and emerge victorious as the greatest mage of all time! <em>...or the greatest of the past five minutes, at least.</em></p>\n<p>Included in this release are five potion concoctions, six types of armor, and nine distinct and <strong>powerful</strong> wands to wield in battle across six fun arenas. That's a lot of numbers! But trust me, <strong>Alakablam</strong> has a TON of <strong><em>BANG </em></strong>for your buck--assuming you consider time legal tender. Particularly because one of the wands shoots grenades! <em>The rest of the wands are cool though too, I promise.</em></p>\n<p>Interested in spicing things up? I'm not, but if <strong><em>you </em></strong>are, there's a whole range of options ranging from round timers, default health values, handicaps, and probably one or two more I dunno. Never play the same way twice, because if you do I'll be really sad that I spent all that time making a shiny new option menu just for you <em>and you didn't even bother touching it</em>, <strong>you <em>ungrateful</em></strong>--</p>\n<p>Don't have any friends? Who does? <em>Well I do, but I'm speaking metaphorically.</em> You don't need anybody else to have fun in <strong>Alakablam</strong> though; just start a round and a computer opponent will hop in alongside you to give you a walloping. That, or get stuck trying to jump to a platform it can't reach. Does that every now and then. Could be trying to communicate with the outside world, could be iffy code. <em>Potato tomato.</em></p>\n<p>Anyways. That's <strong>Alakablam</strong> for you! So go ahead, try it! Blast away the competition and claim supreme victory as the person that won a match that one time in a random itch.io multiplayer game! Become the champion you always wanted to be, ever since like two minutes ago! <strong>We're all rooting for you!</strong></p>\n\n<p>Okay that's it you can go now bye.</p>\n\n<p>--- Credits ---</p>\n<p>Programming: Jepe</p>\n<p>Visuals: Jepe</p>\n<p>Audio: Bfxr &amp; sheet music Jepe found lying around an abandoned parking lot (FL Studio scraps n whatnot.)</p>\n<p>--- --- --- ---</p>", "metacritic": null, "released": "2023-04-01", "tba": false, "updated": "2023-04-03T17:31:10", "background_image": "https://media.rawg.io/media/screenshots/93b/93ba5914374e6189f8134d90532b6b0c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jepezz"], "genres": ["Action"], "publishers": [], "esrb_rating": null}