{"id": 950868, "slug": "explory-story-blue-pin-studio", "name": "Explory Story (Blue Pin Studio)", "name_original": "Explory Story (Blue Pin Studio)", "description": "<p>This game is currently in development. This itch page will match the demo version on our Steam Page. Once this game is released, this itch page will be updated to reflect the full retail version of the game. Thanks for you support!</p>\n\n\n<p>Our highly detailed worlds involve beautiful hand-drawn pixel scenery and thoughtful stories. The text on the floor can be interacted with, leading to a huge variety of effects and experiences. Reading and engaging with the text are crucial for progressing through the puzzles. Additionally, many secret interactions and hidden locations are spread out throughout the game.<br/></p>\n\n<p>The entire game can be played solo; however, we recommend grabbing a friend and battling through Explory Story. We have devised all of the levels, puzzles, and boss battles to accommodate one or two players.</p>\n\n<p>Progressing through each level will involve cleverly interacting with objects and text. In some cases, you will be tasked with restoring context to a sentence. In other cases, you will be crafting entirely new and highly variable phrases.</p>\n\n<p>Explory Story contains a boss at the end of each Act. That means 4+ entirely unique boss fights with unique mechanics and challenges. These can be undertaken alone or together with a friend. Additionally, each boss has variants that you can access by engaging with the story.</p>", "metacritic": null, "released": "2023-04-01", "tba": false, "updated": "2023-04-03T17:28:04", "background_image": "https://media.rawg.io/media/screenshots/c66/c6670387853b0610d5fcbdd69df81b3d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Blue Pin Studio"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}