{"id": 95088, "slug": "brushstrokes", "name": "Brushstrokes", "name_original": "Brushstrokes", "description": "<p><strong>Story and Gameplay:</strong></p><p>Waking up from a strange dream of falling upon flights of stairs, our main character faces an empty house with surreal properties, familiar objects and a seemingly parental being relaying reactions to her through text imprinted on objects. In reality, the character, later to be introduced as Lora, is actually within another dream. Her physical body still lying in bed trapped in a comatose state, while her mind is trying to piece memories of her upbringing and her family together, of which may later on decide her fate.</p><p>The core mechanic of Brushstrokes focuses on interactable items you find throughout the game that will help you rebuild your colorless home. These items serve as the puzzle elements to progress through the levels. Some items won't be interactable until a certain item/s is/are obtained. This forces players to search around for items that may be in relation to that inactive item.</p><p><strong>Note:</strong></p><p>This game is meant to be a tech demo, as we are studying various tools. We'll probably reboot it if we do decide to create a longer game.</p><p>Read more about Brushstrokes here.</p><p><strong>Team:</strong></p><p>2D Artist &amp; Art Director: Cheris Princess C. Socro<br/>Programmer: Dylius Jov Ouano<br/>3D Artist: Jose Silverio P. Reynoso<br/>Producer: Beatrice M.V. Lapa, PhD</p><p>Voice Actors: Logan Hinolan, Nicole Azachee</p><p>Quality Assurance and Testers: Erin T. Yap, Sheryl M. Lim, Cameron James V. Russell, Doodrun</p>", "metacritic": null, "released": "2017-04-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8f0/8f0461b65ad0d08b0487d9a346c7915e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Senshi.Labs"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}