{"id": 950945, "slug": "space-virus-2", "name": "Space Virus!", "name_original": "Space Virus!", "description": "<p>Space Virus!!</p>\n<p>A viral threat has emerged in the universe in search of life to invade! Defeat this viral threat before it reaches earth! It has been spawned by an advanced race controlled by the virus and is well guarded by it's drone fighters.</p>\n<p>Modified from the Coursera Course taught by Brian Winn with the template provided for that course. </p>\n<p>Modifications include:</p>\n<ol><li> Artwork - added a space virus sprite and animation.</li><li>Artwork - added a space virus straight projectile.</li><li>Adjusted level one - more difficult to defeat the virus but can progress to the next level. If you do defeat the virus - you won. If you go to the next level - it is closer to earth.</li><li>Added level two - more difficult to defeat the now larger virus but can progress to the next level by defeating more of its minions. If you do defeat the virus - you won. If you do not defeat the virus it gets closer to earth.</li><li>Added level three - the virus, in preparation for infecting earth is in a weakened state. It is calling on more minions for protection but is easier to defeat. If you don't defeat the virus now, it will infect earth and we're all doomed. Good luck!</li><li>Added artwork for earth in background that gets closer with each stage.</li></ol>\n<p>Credits - the virus artwork was created in Biorender.com; and the Earth image is from the Unity Asset store Earth &amp; Planets skyboxes, by Stagit East. The Unity templates and everything other than the above modifications were provided by Brian Winn, the course instructor.</p>\n<p>Otherwise \"created\" by Sean Collins to meet the requirements of this course. While I had more lofty hopes and goals, this was what I could do with what I currently know!<br/></p>", "metacritic": null, "released": "2023-04-01", "tba": false, "updated": "2023-04-03T18:02:19", "background_image": "https://media.rawg.io/media/screenshots/a0f/a0f206b210bd2f8214536580cc294315.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "macOS", "PC"], "developers": ["Sean Collins"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}