{"id": 950901, "slug": "flashback-its-ukraine-not-a-game", "name": "Flashback (It´s Ukraine, not a game)", "name_original": "Flashback (It´s Ukraine, not a game)", "description": "Explore a Ukrainian backyard occupied by the Russians in 2022 and witness war crimes and tragic fates.\r\n<p>Flashback portrays one person's memories of her neighborhood before the war. The world is a quiet Ukrainian backyard, with carefree neighbors, children playing, and sunny weather.  This snapshot is interrupted by agonizing flashbacks. The person has survived the Russian occupation in 2022, but many of her neighbors have not. The flashbacks take the person back to the moments when she was the witness to the fates of her neighbors. All the stories pictured there are true and the sources are added.</p>\n<p><strong>Disclaimer: The game contains imagery and sounds that might be triggering. \r\n</strong></p>\n<p><strong>The game is best experienced with headphones. To play the game open the page on a PC.</strong></p>\r\nGoal\r\n<p>The goal of this project is to sensitize people to what is happening in Ukraine. With the passage of time and the number of cruel reports from Ukraine, people living outside Ukraine become numb. Therefore, this is an attempt to increase attention to the Ukraine-Russia war of those not affected and reduce doubts regarding the support of Ukraine.<br/></p>\n<p>We learn about the war, mostly through press articles, photos, and videos. These are two-dimensional and linear media. Reports about horrible events can be just short texts without many details. It gives the audience a lot of room for misinterpretation and imagination. This brings me to the question: Can I use the power of interactive media, and games, to give a different perspective on what is happening? Can I make the events and the reports up close and personal? Can I visualize the reports authentically? If so, how can I accomplish all of this?<br/></p>\n<p>Since the goal is to raise awareness about the war in Ukraine, the content must have the potential to trigger strong emotions. It is important to evoke emotions by telling true events, not by emotional manipulation. This means not portraying more than it is and was, and not exaggerating. Emotions are important because they are the opposite of indifference. Indifference to the subject of Russian aggression against Ukraine is what the project is trying to resolve.</p>\r\nDescription\r\n<p>The game world is a small Ukrainian backyard. It depicts two states: just before the outbreak of war and at the beginning of it. In the backyard there are inhabitants. Their fates are represented in this backyard. The world is \"frozen\" in motion. Time is stopped - a snapshot, a memory, a flashback.\r\n</p>\n<p>In the first state, people live their everyday life: young families, children on the playground, and elderly people. Through their posture and spatial arrangement, viewers can learn about their everyday life and lives. In addition, the environment serves as a storytelling element.\r\n</p>\n<p>In the second state, these people become victims of Russia's aggression. The backyard is occupied by Russian soldiers, which terrorize the people. The state forms the fates of the people you met in the first state. This snapshot contains violence, murder, and suffering.\r\n</p>\n<p>The two states are in objective past. The memories may belong to a person who lived there and survived the war. From this person's point of view, the \"players\" view the game world.\r\n</p>\n<p>The players can trigger the change between the states by interacting with people. The interaction triggers flashbacks. where the fate of a selected person is visualized. The flashback can be left at any time. The players decide whether they want to watch the scene and learn more about fate. When the flashback is left, the player is back in the peaceful first state.\r\n</p>\r\nControls\r\n\n\n<p><strong> Vlad T.</strong></p>\n<p>Additional research by Polina Zvezdohliad</p>\n<p>Sound Design by Christoph Weinreich\r\n</p>\n\n\n<p>The game was made as part of the \"It´s Ukraine, not a game\" project. To explore more games on the topic of the Ukraine-Russia war, visit our website. </p>", "metacritic": null, "released": "2023-04-01", "tba": false, "updated": "2023-04-03T17:42:37", "background_image": "https://media.rawg.io/media/screenshots/80e/80e07f3df965080e42fca5fa169459d9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["It´s Ukraine, not a game"], "genres": [], "publishers": [], "esrb_rating": null}