{"id": 950900, "slug": "what-are-the-lives-behind-these-windows", "name": "What are the lives behind these windows?", "name_original": "What are the lives behind these windows?", "description": "<p><strong>Description / How to play:</strong><br/></p>\n<p>In this game, you'll scroll through a tiny portion of a city filled with houses, and as you do, you'll notice that some of the windows in the buildings are lit up. These are your entry points into the lives of the people living in the city.\r\n</p>\n<p>Click on a window, and you'll be transported into the life of the person living there. You'll get to read descriptions of what they're doing, what their day looks like, and what they're feeling.\r\n</p>\n<p>But this isn't just any ordinary day in the life of the city. There's something different in the air, something that's causing chaos and disrupting the normal flow of things. As you explore further, you'll get to see the changes that take place during this very abnormal day in the life of the city.\r\n</p>\n<p><strong>Disclaimer: The game contains imagery that might be triggering. \r\n</strong></p>\n<p><strong>To play the game open the page on a PC.</strong></p>\n<p><strong>Why was this game created? What's the goal?</strong>\n</p>\n<p>The main goal was to create an immersive experience that showcases the unexpectedness and abnormality of war coming to a town, and how the usual daily routine of the people living there gets disrupted in horrible ways.\r\n</p>\n<p>The game is designed to make you think about how tragedies, like war, can disrupt the lives of ordinary people, and how easily it could happen to any of us. By exploring the lives of the people in the city, you'll begin to see just how similar they are to you and your own family and friends, and you'll realize how devastating it would be if war were to suddenly come to your doorstep.\r\n</p>\n<p>The game aims to awaken a depressing and unsettling thought in players about the fragility of our lives and the unpredictability of tragedy. Through this game, you'll gain a new appreciation for the resilience of the human spirit and the importance of cherishing the moments that we have with our loved ones.</p>\n\n<p>Ariana Zeyvald</p>\n\n<p>The game was made as part of the \"It´s Ukraine, not a game\" project. To explore more games on the topic of the Ukraine-Russia war, visit our website. <br/></p>", "metacritic": null, "released": "2023-04-01", "tba": false, "updated": "2023-04-03T17:41:55", "background_image": "https://media.rawg.io/media/screenshots/412/412321e562aec6e01af18c71d3b0121c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["It´s Ukraine, not a game"], "genres": [], "publishers": [], "esrb_rating": null}