{"id": 950905, "slug": "dog-days-its-ukraine-not-a-game", "name": "Dog Days (It´s Ukraine, not a game)", "name_original": "Dog Days (It´s Ukraine, not a game)", "description": "<p><strong>Intro</strong></p>\n<p>The start of the war of aggression against Ukraine has affected the fate of many people, but it is not only people who are suffering the consequences of the war. Countless dogs, cats, and other pets have been left behind in their owner's panicked flight from war and destruction.\r\n</p>\n<p>Experience a small, sensitive story from the perspective of a dog who is locked up in a flat, and directly encounters the horror of war.\r\n</p>\n<p><strong>What is the game about?</strong>\n</p>\n<p>Due to the events of 24 February 2022, many Ukrainians fled in panic. Many pets, especially larger dogs, had to be left behind. In this short narrative, we put the audience in the perspective of a dog named \"Dina\", who does not yet know what terrible fate awaits her.\r\n</p>\n<p>Move \"Dina\" through her forced new everyday life, all alone and abandoned in the flat, as the horror of war comes tangibly closer.\r\n</p>\n<p><strong>Combining game design and the war theme:</strong>\n</p>\n<p>In this audiovisual content, we try to create an alternating image of emotions with antithetic and other design elements. The perspective of an animal allows us to take a more neutral look at individuals who are directly affected by the consequences of death and destruction.\r\n</p>\n<p>We aimed to condemn the situation and the accompanying war of aggression through a strong empathetic feeling. Due to the staging of the war, we had to be careful to create a sense of proportion so as not to re-traumatize those affected.\r\n</p>\n<p><strong>Why is this game important in this situation?</strong>\n</p>\n<p>War is a particularly sensitive topic, especially when it is a current conflict. The fact that war is a cruel, destructive force and has probably been deeply within us since time immemorial will come as no surprise to most people. For many Western Europeans, the barbaric invasion of Ukraine marks the beginning of a historiography that we only knew from dusty history books. To educate, inform and arouse compassion for those affected, we have taken up this topic.\r\n</p>\n<p>We can only oppose suffering and injustice if we stand up for our values and act in solidarity! Especially the situation of many animals in war zones is often forgotten about, which is why we wanted to emphasize this specific topic. Many independent organizations try to get abandoned animals out of Ukraine and place them in animal shelters in Poland and Germany. These organizations are financed by donations. If you also want to help, these organizations are grateful for every small donation. </p>\n\n<p><strong>Disclaimer: The game contains imagery and sounds that might be triggering. \r\n</strong></p>\n<p><strong>The game is best experienced with headphones. To play the game open the page on a PC.</strong>\n</p>\n\n\n<p>Polina Zvezdohliad: Narrative Design\r\n</p>\n<p>Kay Priesnitz: Programming\r\n</p>\n<p>Lenja Raschke: Technical Art, Sound Design\r\n</p>\n<p>Raphael Sindermann: Visual Development\r\n</p>\n<p>Matthias Voigt: Programming\r\n</p>\n<p>Sebastian Voigt: Level- und Environment Design\r\n</p>\n<p>Christoph Weinreich: Sound Design\r\n</p>\n<p>Zwi Zausch: Game Design</p>\n\n<p>The game was made as part of the \"It´s Ukraine, not a game\" project. To explore more games on the topic of the Ukraine-Russia war, visit our website. <br/></p>", "metacritic": null, "released": "2023-04-01", "tba": false, "updated": "2023-04-03T17:44:42", "background_image": "https://media.rawg.io/media/screenshots/6b3/6b357988d0ceeeb983a0b2eedb287397.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["It´s Ukraine, not a game"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}