{"id": 951001, "slug": "morbent-manor-alpha", "name": "Morbent Manor (Alpha)", "name_original": "Morbent Manor (Alpha)", "description": "Morbent Manor\r\n<p>Welcome to Morbent Manor - a roguelike game that I have developed as part of my final year university project. In this game, you will delve into an ever-changing world filled with unique enemies, powerful items, and unpredictable encounters. Your journey through the procedurally generated levels will test your strategic and decision-making skills as you unravel the mysteries of Morbentia.\r\n</p>\n<p>Morbent Manor is currently in its testing phase and has been uploaded to Itch.io for feedback purposes. I am seeking constructive input from players like you to help me refine the game and make it a truly memorable experience. Your thoughts and suggestions will be invaluable in shaping the final version of the game.\r\n</p>\r\nHow to Play\r\n\r\n<p>Your aim is to traverse a series of rooms, defeating enemies, collecting items and obtaining powerups. Each level becomes progressively harder and eventually reach a final boss marking the end of the game. <br/></p>\r\nControls\r\n\r\n<p>Left click - Auto attack</p>\n<p>Q - First ability</p>\n<p>E - Second Ability</p>\n<p>C - Third Ability</p>\n<p>X - Fourth Ability</p>\n<p>TAB - Open Talent Menu</p>\n<p>M - Open map (you can use teleport pads to manoeuver quickly)<br/></p>\r\nProviding Feedback\r\n\r\n<p>As part of my master's dissertation, your feedback is not only valuable but essential. Please take a moment to share your thoughts on the gameplay, design, level progression, and any other aspects of Mobent Manor that you find noteworthy.<br/></p>\n<p>By providing feedback, you agree that your comments may be quoted directly in my thesis, although all feedback will be anonymized to protect your identity. Your input will play a significant role in the final version of Manor and will contribute to my  dissertation.\r\n<br/></p>\n<p>If you have any questions or need additional information, please feel free to reach out to me. Stay tuned for future updates and improvements based on the feedback gathered during this testing phase.\r\n</p>\n<p>Once again, thank you for being part of this exciting journey, and I hope you enjoy playing Morbent Manor!\r\n</p>\n<p>Happy adventuring!\r\n</p>", "metacritic": null, "released": "2023-04-01", "tba": false, "updated": "2023-04-03T18:25:39", "background_image": "https://media.rawg.io/media/screenshots/c89/c891185592947937a86aa8e0eee68dc4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["jacksonl22"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}