{"id": 951111, "slug": "divine-retribution", "name": "Divine Retribution", "name_original": "Divine Retribution", "description": "An Action 2D Metroidvania inspired by the likes of Castlevania and Blasphemous.<br/>Currently still in development and at an early stage.\r\nControls-\r\nEnter - To Pause\r\nWASD - to move the character\r\nJ - Attack\r\nK - Ability #1\r\nL - Ability #2\r\nU - Heal\r\nI - Parry\r\nThe game currently contains the first opening area of the game, with 4 different enemies, two unlockable abilities and a completed boss fight.<br/><br/>After completing the first area, the player can play a prototype version of the second bossfight.\r\nAbout the Game:\r\n<p>Divine Retribution is a game about a man driven by Revenge after he loses everything he cared for, all as collateral in the war between the gods and demons. <br/></p>\n<p>Seeking revenge the man trains his body and soul, and <strong>in death starts his journey</strong>.<br/></p>\n<p>The first half of the game is a journey through hell, where he goes through the different layers, all controlled by an <strong>Archdemon</strong>. The demo shows the uppermost layer of hell, Haunted by <strong>Undead</strong>, and Controlled by <strong>the Ferryman.</strong></p>\n<p>Later onwards, multiple different characters would enter the fray, manipulating and influencing the Warrior's journey.</p>\n<p>The second half would deal with the player journeying into heaven.</p>\n<p>As he deepens his revenge, his soul grows demonic. This is seen in-game through the various mechanics that trade the player's power for defence when played aggressively.<br/></p>\n<p>As of April 2023, The game is still early in development and many different features discussed earlier are still to be implemented alongside more areas.<br/><br/></p>\r\nThanks to Ansimuz for providing the backgrounds/Placeholder sprites. Check out their work at - https://ansimuz.itch.io/\r\nCreated by-\r\nAbhyuday Chauhan-Programming/Design\r\nHarshh-Character-Art and Spritework\r\nChakshu Bhardwaj-Tileset creation", "metacritic": null, "released": "2023-04-01", "tba": false, "updated": "2023-04-03T19:09:59", "background_image": "https://media.rawg.io/media/screenshots/220/2204e7a93d86d42ac558a1ba81361981.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["PHAST"], "genres": ["Action"], "publishers": [], "esrb_rating": null}