{"id": 951113, "slug": "isekai-simulator-2024", "name": "Isekai Simulator 2024", "name_original": "Isekai Simulator 2024", "description": "<p>The world of Elysia was once a mighty Empire, until a great catastrophe tore it apart. In its place are ten kingdoms, ruled by ten tyrants and their descendants.</p>\n<p>There is a prophecy, though, that say a great Hero will arrive and unite the world with their godlike powers.</p>\n<p><strong>You</strong> are that Hero, for you have been summoned by the god of this realm to be that Hero.<br/></p>\n<p>Yes, you, the person who got <em>hit by a truck while walking around Tokyo.</em><br/></p>\n<p>Now, I know what you might be thinking: \"This is just like my Japanese animes!\"</p>\n<p>Well... actually... oh no...</p>\n<p>You're an isekai protagonist, aren't you?<br/></p>\n<p>Yeah... just one problem. See, you may be a  Hero, but this is an <strong>entire continent full of warlords and their armies.<br/></strong></p>\n<p><strong>Also, you don't know how to fight.</strong></p>\n<p>So, what can a would-be anime protagonist do when they're up against these odds?</p>\n<p>Well, the only logical explanation is to get your own magical truck, send it back to Earth, and have it run over more people so you'll can summon more Heroes!</p>\n<p>Put those Heroes to work in the camps and temples so you can buy more trucks to run <em>more</em> people over in the street to summon them to this world!</p>\n<p>Keep summoning more heroes to gather more resources and run more people over until your army is ready to make their move.<br/></p>\n<p>After all, it<em> is</em> your destiny to unite the fractured kingdoms of Elysia.</p>\n<p><strong>And if that means you will conquer every province with human waves' worth of anime protagonists, then so be it.</strong></p>\n<p><strong>Available Now, on April 1st, 2023!</strong><br/></p>", "metacritic": null, "released": "2023-04-01", "tba": false, "updated": "2023-04-03T19:10:47", "background_image": "https://media.rawg.io/media/screenshots/33b/33bd332c3bdbe90f46743d32a088aa62.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["cGh ONE"], "genres": ["Adventure", "Simulation"], "publishers": [], "esrb_rating": null}