{"id": 9511, "slug": "deadtruth-the-dark-path-ahead", "name": "DeadTruth: The Dark Path Ahead", "name_original": "DeadTruth: The Dark Path Ahead", "description": "DeadTruth is an episodic, <strong>puzzle-based</strong>, first-person horror adventure, featuring a complex and emotional story, filled with dark and mysterious secrets. DeadTruth: The Dark Path Ahead is the first episode of the DeadTruth series.<br/><br/>This game is based in solving puzzles. If you like games with tricky, challenging puzzles, this game is for you!<strong>Synopsis:</strong><br/><br/>You play a character named Michael Anderson who's life from loss of his loved ones, turned upside down into his worst nightmare. Despite of losing both of his parents and wife by the tragic events, another recent tragedy struck Michael's life- mysterious dissapearance of his brother Lusifer. The haunting sarrows of terrible deaths, led Michael to the dark trail of using drugs. Despite of constantly being surrounded by the never resting terror of loss and sadness, Michael finds the only spark of hope left inside of him and steps into the unknown to find his missing brother and uncover the truth behind the terrible accident.. But as further he walks into the darkness, the more he realises that the chance of life he left behind, was completly faded the moment he stepped into the shadow, as he slowly started to become the shadow himself. <br/><br/>Are you willing to enter the unknown? <br/><br/><strong>Features: </strong><br/><br/><ul><li>Puzzle solving challenges: Horror adventure game in puzzle-like style. To challenge the player throughout the game. <br/></li><li>Environmental sounds system The sounds of the different environments are contributing to the atmosphere and give the player scaring hints. <br/></li><li>High quality environment: Detail graphics with chilling atmosphere and tension. <br/></li><li>Sophisticated music and sounds. <br/></li><li>Combat system.<br/></li><li>Compelling and detailed story: Finding the answers to questions of the mysterious disappearance of your brother throughout the game. Haunting weaknesses of main characters past. <br/></li><li>Interactive environments: You can interact with objects! Pick up and move around objects through a simple drag and drop interface.<br/></li><li>Estimated game length: 5 - 6 hours</li></ul><strong>Caution: </strong><br/><br/>DeadTruth contains violence, use of drugs, gore and strong language.<br/><br/><strong>Quick note's: </strong><br/><br/>This game is inspired by two amazing titles: Penumbra and Outlast.<br/><br/>It is strongly recommended to read the manual before playing the game! You can find the manual on the right side of the page.", "metacritic": null, "released": "2017-01-21", "tba": false, "updated": "2019-08-28T22:14:56", "background_image": "https://media.rawg.io/media/screenshots/49d/49d912a0927270ab21eb47bd1dfb070d.jpg", "website": "http://blackclothgames.com/DeadTruth_Episode_1.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 125, "dropped": 1}, "playtime": 4, "achievements_count": 15, "ratings_count": 1, "suggestions_count": 307, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Rukas Skirkevicius"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Rukas Skirkevicius"], "esrb_rating": "Adults Only"}