{"id": 95114, "slug": "oddly-assorted", "name": "Oddly Assorted", "name_original": "Oddly Assorted", "description": "<p>2028: In a world with exponentially rising lot and flat prices you, as a constructor, have to stack new rooms on top of your building but take care of your balance and the increasing demand of services in your oddly assembled house at the street corner.<br/></p>\n<p>As the owner of a single story house you cannot cope with the ever increasing taxes anymore and you try to build new rooms on top of the building to benefit from the rents for the rooms. The higher you go the more complex the demand and the shapes of the rooms become. Rentable rooms are oddly shaped and have high demands for services.<br/></p>\n<p><strong>What's Your Task?</strong></p>\n<p>Gain money by placing flats and connecting them via Hallways to the ground level. As you advance you gain new modules that require specific rooms to generate profit.</p>\n<p><strong>Oddly Assorted</strong></p>\n<p>Oddly Assorted is our trustworthy company for affordable living modules which will enable you to become rich today! As we all live in 2028 we can agree that living space is way too expensive and no one can live like a normal person anymore. We from Oddly Assorted want to enable everyone to live with the highest standards!</p>\n<p><strong>Controls &amp; Gameplay</strong></p>\n<p>PC - Mac - Linux</p>\n<strong>Q, E</strong>Rotate the selected room<strong>Left Mouse Button</strong>Place, Select, Activate (positive input)<br/><strong>Right Mouse Button</strong>Cancel current action (negative input)<strong>1, 2, 3, 4</strong>Speed modes<br/><strong>A, D</strong>Rotate the camera view<strong>W, S</strong>Change floor\r\n<ul><li>Use the wrecking ball icon to activate the demolish mode.</li><li>Use the wrench icon to activate the repair mode.<ul><li>Rooms wear out and require repairs from time to time for the tenants to stay</li></ul></li><li>Category Supply (ordered):<ul><li>Hallway -&gt; Connects the single rooms with the floor</li></ul></li><li>Category Appartements (ordered):<ul><li>Students A + B -&gt; not profitable (in long term) but nicely shaped</li><li>Pairs A + B -&gt; medium profitable (needs Gym)</li><li>Families A + B -&gt; very profitable but oddly shaped (needs Park + Kindergarden)</li></ul></li><li>Category Services (ordered):<ul><li>Gym (spreads 3 fields)</li><li>Kindergarden (spreads 4 fields)</li><li>Park (spreads 5 fields)</li></ul></li></ul>\r\nPrototype Warning\r\n<p>This game is in <strong>early prototyping stage! </strong>We can guarantee for bugs, missing UI, missing features and missing sounds! You get the idea.</p>\n<p><em>Why did we put it here?</em></p>\n<p>We are a small team of students and our range is limited. For our game we want to get as much constructive feedback as possible and we hope to get some here. <strong>There are some questions we have in particular:</strong></p>\n<ul><li>Does the placement of rooms \"feels\" right to you?</li><li>Are the speed modes well chosen? (x1, x2, x8)</li><li>How long did your motivation last (in this version)?</li><li>Do you think you have not enough or too much money?</li><li>How is the performance of the game? - If bad: what are your specs?</li><li>Do you wish more complicated shapes?</li><li>Do you wish decoration rooms?</li></ul>\n<p><strong>UI, shop, options, effect visualization, Room shapes</strong> and many <strong>more features</strong> are under <strong>active development</strong>. - If you have feedback for these parts we'd love to hear it but be aware that all of those<strong> features can vary in upcoming versions</strong> dramatically!</p>", "metacritic": null, "released": "2018-06-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9ee/9ee91f42fde8feb62d32c0f400efe9e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Nox"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}