{"id": 951299, "slug": "goons-blast-alpha", "name": "Goon's Blast (Alpha)", "name_original": "Goon's Blast (Alpha)", "description": "<p>This game is a modern take of old N64 era action adventure games with the primary inspiration coming from the Bomberman entries on that console.<br/></p>\n<p>This started as a side project I put together to learn about writing a game with netcode via the PUN2 framework in a Unity project.</p>\n<p><strong>Alpha Build Features:</strong></p>\n<ul><li>VS Mode (online play only)</li><li>Level Editor</li><li>Playing Custom Levels in online VS mode</li><li>Partial Controller Support (works for VS mode and most of the editor but can't operate menus)</li></ul>\n<p><strong>Planned Features For Full Release:</strong></p>\n<ul><li>Audio</li><li>Proper models/animations</li><li>More powerups</li><li>Config for match settings (number of rounds, timer, etc.)</li><li>Co-op mode / Single player campaign</li><li>Enemies (may be restricted to co-op mode)</li><li>Sudden death mode</li><li>More editor features (lighting, backgrounds, song setting)</li><li>Editor enhancements (easier mass block placement, better controls explanation, etc.)</li><li>Editor support for custom campaigns</li><li>Full controller support</li><li>Local co-op/VS</li><li>Bots for VS Mode</li><li>Unlockable Old School Cheat Codes</li><li>Community Mod Support</li></ul>\n<p><strong>Release schedule</strong></p>\n<p>Currently this project is being worked on by just myself as a fun little hobby project. In addition to my full time day job I also have a side company that I work on games with and a live stream that I have a fairly frequent schedule I try to maintain. While my current other game project is now released (check out Straylight on Steam, Playstation, AppLab and Sidequest) there's still a fair amount of work in terms of updates and prototyping out our next idea(s).</p>\n<p>TL;DR I'm working on this as much as possible so I don't have firm dates of when I'd like to be done with things but here's a rough idea that is HIGHLY subject to change:</p>\n<p>3/31/2023 - Alpha version 0.0.1 release</p>\n<p>Q4 2023 - Beta version release (most of planned features listed above)</p>\n<p>??? - Full release (planned feature list + probably more)</p>\n<p>There's a good chance this project may move from Itch to Steam as this moves in to Beta for security reasons (to link Steam user accounts to the PUN servers), but that's still TBD at this point.</p>\n<p><strong>Recordings</strong></p>\n<p>I have streamed a large portion of the development process on my Twitch channel and there are backups of these streams on this YouTube playlist. I can't promise that they're informative but I am very open to questions, feedback, and general programming discussion while I'm streaming. This is regardless of whether I'm currently streaming game development so feel free to pop in if you're looking for some realtime feedback.</p>\n<p><strong>Source Code</strong></p>\n<p>The source code for this project is publicly available on this GitHub page. Licensing info an project setup is documented therein.</p>", "metacritic": null, "released": "2023-04-01", "tba": false, "updated": "2023-04-03T20:28:31", "background_image": "https://media.rawg.io/media/screenshots/831/831aae367de5496a8e7e6ed3a672750b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["mrgoonandwatch"], "genres": ["Action"], "publishers": [], "esrb_rating": null}