{"id": 951217, "slug": "underboard-omen", "name": "Underboard: Omen", "name_original": "Underboard: Omen", "description": "<p><strong>A roguelike autobattler about people appearing in a dangerous place. Build a team of characters, equip them with items and aid them with spells to battle against monsters and meet their fate in the Underboard.</strong><br/></p>\r\nExplore the Underboard\r\n<p><strong>Go into runs made up of acts and randomized stages. Get rewards and experience by completing stages and fighting bosses at the end of acts.</strong></p>\n<p><strong>Stages contain combats against monsters, with boss stages being harder encounters that reward more experience.</strong></p>\n<p><strong>Progress through the Underboard to uncover its secrets!<br/></strong></p>\r\nBuild your team\r\n<p><strong>You'll get to choose between random characters, items and spells as stage rewards, being able to reroll them with experience. Plan a strategy around the classes you get to build an effective team.<br/></strong></p>\n<p><strong>Classes give bonuses to characters of that class upon reaching thresholds of characters with that class. The more characters of a class you have, the bigger the bonuses they get!<br/></strong></p>\n<p><strong>Characters get a random class and skill, and can be leveled up with experience. Equip items to your characters to increase their stats, give them extra classes or even unique passives. Cast spells to aid your characters in battle or passively increase their classes.</strong></p>\r\nCommunity\r\n\r\nSteam", "metacritic": null, "released": "2023-04-01", "tba": false, "updated": "2023-04-03T19:53:48", "background_image": "https://media.rawg.io/media/screenshots/303/303cc69ba21afc0d07e0aba2b9532518.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Headless"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}