{"id": 951234, "slug": "diggybomb", "name": "DiggyBomb", "name_original": "DiggyBomb", "description": "<p>README</p>\n<p>Diggy Bomb is an exploration roguelike where you must dig or Bomb to keep moving towards your destination. </p>\n<p> This is a demo version. Randomization is limited to items and characters, not terrain.</p>\n<p>Controls/Interaction:</p>\n<p> Arrow keys = movement </p>\n<p>Z = Bomb </p>\n<p>X = Stop drill (useful for exploring on foot) </p>\n<p>C = restart drill </p>\n<p>R= Restart game</p>\n<p>You may use the arrow keys to move around freely.  To navigate your drill, you must use bombs to adjust the drill angle.  Bombs will also dig if you are away from the drill.  To regain bombs, you may collect crystals.  Collect chests to enlarge your drill and kill more worms.  In the future a bigger drill will allow you to get past hard rocks which have not yet been implemented  If you have no more bombs and you cannot return to your drill, that is the end. You can restart by pressing R to try a new run. </p>\n<p> OCR: </p>\n<p>Objective Reach the last area and explore. </p>\n<p>Challenge Ensure you keep collecting bombs and manage the location of your drill. If you are too far from it, you won't be able to continue to a new area. </p>\n<p>Reward While there is no final destination, the demo sports several locations to investigate, as well as a plethora of wildlife to meet drill first. How you decide to interact with the world is up to you. Are you a worm murderer, or a docile protector of underground fauna? We'll chalk it up to how many worms are left in the end<br/></p>", "metacritic": null, "released": "2023-04-01", "tba": false, "updated": "2023-04-03T20:01:09", "background_image": "https://media.rawg.io/media/screenshots/28b/28bb89d07e84871ef5a647a2e30e72ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MewMewMake"], "genres": [], "publishers": [], "esrb_rating": null}