{"id": 951323, "slug": "slime-hero-itch-yeymak", "name": "Slime Hero (itch) (Yeymak)", "name_original": "Slime Hero (itch) (Yeymak)", "description": "Run. Rescue. Survive.\r\n    \r\n    \r\n    In the depths of the forest, a small community of slimes live in hiding.<br/>\r\n    \r\n    Moved by a stirring sense of curiosity, they set out on a journey, eager to unravel the secrets that lay hidden in the dark recesses beyond the safety of their village.<br/>\r\n    However, unbeknownst to them, a treacherous trap lay in wait, threatening to ensnare them and shatter their dreams of discovery.<br/>\r\n    \r\n    Despite the trauma they had endured, they did not give up, they did not falter, for they knew that somewhere, somehow, a hero would come to guide them through the darkness.<br/>\r\n    \r\n    With courage in their hearts, the slimes use their unique abilities to blend into their surroundings and evade detection. But they know they can't stay hidden forever.<br/>\r\n    \r\n    They wait, watching and listening for any sign of hope, and prepared for the day when a savior would arrive to bring them out of the shadows and into the light.<br/>\r\n    \r\n    Slime Hero\r\n    \r\n    \r\n    <p>Embark on an epic journey through a dark and dangerous forest.<br/>\n</p><p>Slime Hero is an exciting endless runner game that will keep you on the edge of your seat as you try to rescue your slime comrades,\r\n    while fighting against an insistent darkness that yearns to plunge everything into chaos.</p>\n<p>With its addictive gameplay, charming visuals, and challenging difficulty, Slime Hero is sure to keep you running and rescuing for hours on end.</p>\n<p>Are you ready to take on the challenge?</p>\r\n    \r\n    \r\n    Features\r\n    \r\n    <p>Buckle up and get ready to discover some of the standout features that make this game so fun and addictive. Let's jump in!</p>\r\n    \r\n    Skills\r\n    <p>Light is your ally, and you can generate it to illuminate your environment.\r\n    However, darkness will gradually try to make it harder and harder to see.\r\n    To counteract it, you can collect bolts to recharge yourself and keep your inner light shining.\r\n    With every five bolts you collect, you can use your <strong>lighting skill</strong> to explode in light, making the darkness reset.</p>\n<p>Discovering hidden slimes is not easy for the untrained eye.\r\n    As you progress deeper into the forest, you'll load the <strong>detection skill</strong> that will allow you to see beyond, where the small slimes are.</p>\n<p>It's up to you to use your skills strategically and balance your priorities\r\n    - do you use your bolts to keep the light shining, or save them to rescue more slimes?\r\n    Both skills are equally important and can make the difference between a high score and a game over.</p>\n<p>\n</p>\r\n        \r\n         \r\n        \r\n        \r\n    \r\n    \r\n    Obstacles\r\n    <p>As you enter the dark forest, you can sense the danger lurking in the shadows. The trees are dense, the ground is uneven, and the obstacles are plenty.\r\n    You need to navigate your way through the unknown, but it won't be easy.\r\n    As you overcome each obstacle, a surge of adrenaline courses through your body, causing you to instinctively pick up speed, which in turn, adds to the difficulty of maintaining control.</p>\n<p>But fear not. The forest is a challenging place, but it's also rewarding. As time passes, you will be invaded by a feeling of satisfaction.\r\n    You will become more skilled and confident, ready to face the next challenge.\r\n    The forest might seem daunting, but with practice and determination, you can conquer it.</p>\r\n    \r\n    Achievements\r\n    \r\n    <p>The game features <strong>30 achievements</strong> to unlock, each with their own unique challenge to overcome.\r\n    Whether you're a completionist or just looking for an extra challenge, these achievements will keep you coming back for more.</p>\n<p>Remember that only true heroes are expected to complete all the challenges.</p>\n\r\n    \r\n    Game modes\r\n    \r\n    <p>Slime Hero offers two difficulty modes to cater to both casual and hardcore players.</p>\n<p>The <strong>easy mode</strong> retains the core essence of endless runner games. Although each run will be different, you can expect obstacles and items to spawn at certain positions,\r\n    allowing you to recognize patterns and develop strategies for success.</p>\n<p>On the other hand, <strong>hero mode</strong> takes things up a notch. With random obstacles and items popping up left and right, it requires an extra level of skill to conquer the challenges thrown your way.</p>\r\n    \r\n    Call to action\r\n    \r\n    <p>Ready to experience the slimy adventure for yourself?</p>\n<p>Head over to the download section and get Slime Hero today! And if you enjoy the game, be sure to leave a review and share it with your friends.</p>\n<p>Can't wait to see your score!</p>\r\n    \r\n    Roadmap\r\n    <p>In the event that the game is positively received, there are a few potential features and enhancements to implement in the future.\r\n    Below are some of those preliminary ideas that might be worth exploring.</p>\n<p>\n</p><ul>\n<li>Leaderboard</li>\n<li>More languages</li>\n<li>Power-ups</li>\n<li>New obstacles</li>\n<li>New map! (snow, desert... who knows)</li>\n</ul>\n\r\n    \r\n    Note from the developer\r\n    <p>First of all, thank you for your interest in Slime Hero!</p>\n<p>This has been my first completed game as a solo developer, and I couldn't be more proud of it.\r\n    What started as a simple game for my kids rapidly turned into something worth finishing and publishing.</p>\n<p>I know another endless runner game won't be winning any award for originality.\r\n    However, it is precisely the simplicity in the game loop that has left me room to explore other areas such as original mechanics (or at least I tried to), effects, shaders, achievements and a long etcetera.</p>\n<p>I really hope you enjoy the game.</p>", "metacritic": null, "released": "2023-03-31", "tba": false, "updated": "2023-04-03T20:37:44", "background_image": "https://media.rawg.io/media/screenshots/cf8/cf88568e3c644a91d4c2fe95903309f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "Linux", "macOS", "PC"], "developers": ["Yeymak"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}