{"id": 951519, "slug": "the-null-doctrine", "name": "The Null Doctrine", "name_original": "The Null Doctrine", "description": "<p><strong>The Null Doctrine</strong> is a turn-based game about a super-powered operative who can see things before they happen. Play as Omen, an agent of Sentinel, as she protects her homeworld of Dominion from a deeply-rooted internal threat.</p>\n<p>The game is not finished, but you can play a prototype of the first level for free. If you do so, your feedback would be greatly appreciated! You can submit feedback here (Google Forms).</p>\r\nEven the Odds\r\n<p>As an elite operative, you will be going into the field alone. You will always be outnumbered and outgunned, so choose your equipment and abilities carefully to give yourself the advantage. Make use of your Remnant powers to manipulate enemy attacks - turning your foes' numbers against them.</p>\r\nPerfect Your Strategy\r\n<p>No chances to crit or miss, no hidden abilities, no unexpected outcomes. Every turn starts with giving you perfect information, and every potential action you want to take shows you what it's going to do. If your strategy was lacking (or if you just plain misclicked), simply rewind time - what you saw was merely a potential future which Omen can avoid thanks to her power of Foresight.</p>\r\nDiscover Dominion\r\n<p>Enter the world of Dominion, eternally hunted by an ancient malicious  deity known as Nemesis. As you discover more about the growing threat,  you'll meet various denizens of Dominion. Develop your knowledge and  relationships with the planet and its people.\r\n</p>\r\nConfigure Everything\r\n<p>The game features an extensive settings menu, allowing you to tinker with a wide array of technical and gameplay parameters. Whether you want to limit how often you can rewind, tweak how deadly you or your enemies are, adjust UI colors, or downscale the game from 8x your resolution, the settings have you covered.</p>", "metacritic": null, "released": "2023-03-31", "tba": false, "updated": "2023-04-03T21:56:44", "background_image": "https://media.rawg.io/media/screenshots/a21/a2158ea04297aa76d98e76b7950e0ab2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["alxl"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}