{"id": 951507, "slug": "metallic-mayhem", "name": "Metallic Mayhem", "name_original": "Metallic Mayhem", "description": "<p><strong>An online game by The Arcade Alchemists</strong><br/></p>\n<p><strong>What other robots say: </strong>\"Metallic Mayhem offers a unique and enjoyable gaming experience as a top-down arcade shooter that doubles as a fun party game. With its fast-paced action and intuitive controls, it's easy for players of all skill levels to jump in and have a blast together. The game's ability to create friendly competition and cooperative play makes it the perfect addition to any gaming night.\" - Son of Eliza</p>\n\n<p>Metallic Mayhem\" is an action-packed, top-down multiplayer 3D shooter game that takes place in futuristic arenas filled with robots. Players take control of their own robot, each with its unique set of weapons and abilities, and compete against each other in fast-paced, intense battles.</p>\n<p>The objective of the game is to eliminate all opposing players and be the last robot standing in the arena. To do this, players must strategically navigate through the various obstacles and hazards within the arena while dodging incoming fire and using their own weapons to take out other robots.</p>\n\n<p>As players progress through the game, they can collect power-ups and upgrades that enhance their robot's abilities, such as increased speed, triple shot, or even explosive bullets. </p>\n<p>\"Metallic Mayhem\" features multiple game modes, including team-based matches and free-for-all battles, as well as a variety of different arenas with unique layouts and hazards. With fast-paced gameplay, strategic depth, and an ever-changing battlefield, \"Metallic Mayhem\" offers endless hours of adrenaline-fueled fun for gamers of all skill level.</p>\n<p><strong>Attention all Metallic Mayhem players! </strong>We are excited to announce that new features and game modes will be added to the game every other week! Get ready for even more intense action and exciting gameplay. Keep an eye out for updates and don't forget to check back regularly for the latest additions to Metallic Mayhem. Thank you for playing and we hope you enjoy the new updates!<br/></p>\n\n\n<p><strong>How To Play:</strong></p>\n<p>Keyboard Controls:</p>\n<ul><li>Use the \"W\", \"A\", \"S\", and \"D\" keys to move your character in the corresponding directions.\r\n</li><li>Use the \"I\", \"J\", \"K\", and \"L\" keys to fire your weapons in different directions.\r\n</li><li>Collect power-ups to upgrade your weapons and abilities.\r\n</li><li>Press \"ESC\" to go back to the main menu and select options.\r\n</li></ul>\n<p>Controller Controls:\r\n</p>\n<ul><li>Use the left stick to move your character.\r\n</li><li>Use the right stick to aim and fire your weapons.\r\n</li><li>Collect power-ups to upgrade your weapons and abilities.\r\n</li><li>Press \"select\" to go back to the main menu and select options.\r\n</li></ul>\n<p>Mobile Phone Controls:\r\n</p>\n<ul><li>Go to the website displayed on the game screen to connect your mobile device.\r\n</li><li>Use the left virtual stick to move your character.\r\n</li><li>Use the right virtual stick to aim and fire your weapons.\r\n</li><li>Collect power-ups to upgrade your weapons and abilities.\r\n</li></ul>\n<p>To join via keyboard or controller:\r\n</p>\n<ul><li>Press any key during the game execution to connect to the game.\r\n</li><li>Follow the on-screen instructions to join the game using your keyboard or controller.\r\n</li></ul>\n<p>No matter which control option you choose, your goal is to survive the game's various levels and defeat all the enemies in your path. Use your weapons strategically and keep an eye out for power-ups that can give you an edge. Good luck, and have fun!\r\n</p>", "metacritic": null, "released": "2023-03-31", "tba": false, "updated": "2023-04-03T21:52:08", "background_image": "https://media.rawg.io/media/screenshots/c42/c4254b3d74df0e36d65e0ef8cbefead2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Arcade Alchemists"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}