{"id": 95151, "slug": "gunnihilation-alpha", "name": "Gunnihilation Alpha", "name_original": "Gunnihilation Alpha", "description": "<p>\r\n\tGunnihilation is chaotic 2D platform shooter inspired by the classic arcade titles like Contra and Smash TV. It combines side-scrolling action gameplay with dual stick bullet-hell mayhem and supports up to four player local co-op. </p><p>You control one of four elite soldiers tasked to engage the forces of a shadowy cabal hatching nefarious schemes across the globe. Combine deft maneuvering with accurate shooting to defeat hundreds of enemies through unique action packed missions. </p><p>\n</p><p>This alpha demo will let you:<br/></p><p>- Rack up the body count with a powerful arsenal at your disposal </p><p>- Battle through frenzied levels, hellish arenas and a boss to really test your mettle </p><p>- See how long you can last in endless survival mode and earn an unbeatable score.</p><p>Some features we'll be implementing in the future are:\r\n\t<br/>\n<br/>\n</p><p><strong>Level Editor</strong> - We're developing a public version of our development tool so you guys can create and share your own levels and will be working to add steam workshop integration with the ability to import custom sprites and sound.  </p><p><strong>Full Campaign </strong>- Loads more guns, enemies and bosses on the way, we'll let you know more about some of these features in the future. </p><p><strong>Challenge Levels</strong> - Special extra tough novelty missions as well as more endless mode levels. Mini Games - Fun competitive and solo stuff, just for fun.</p><p><strong>Online Leaderboards</strong><strong> - </strong>What's a game without a little competition. Kill enemies quickly and efficiently to get great scores and let the world know you can Gunnihilate with the best of em'.</p><p>\r\n\tIf you enjoyed the demo please go to Steam Greenlight and back us. </p><p>http://steamcommunity.com/sharedfiles/filedetails/?id=703536273<br/></p><p>and you can follow us on twitter @ \r\n\ttwitter.com/RoboPixelGames<br/>\n<br/>\n<br/>\n</p>", "metacritic": null, "released": "2016-06-23", "tba": false, "updated": "2019-08-28T23:25:44", "background_image": "https://media.rawg.io/media/screenshots/8b2/8b2f62b0b3c2e6b2e665e3fc2724db2b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 363, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RoboPixelGames"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}