{"id": 95164, "slug": "jazon-and-the-dead", "name": "Jazon and the Dead", "name_original": "Jazon and the Dead", "description": "Now crowdfunding on Fig !\r\nDescription<p>\r\n\tJazon and the Dead is a style-rich, blood-splashed, top-down, action-adventure game that mixes brain-twisting puzzles with an engaging narrative, dark humor and a hip 80's vibe. The game's stark comic book visuals set this game apart from others in the genre.\r\n</p><p>\r\n\tJazon and the Dead is heavily inspired by old horror and B-movies (Night of the Living Dead and Braindead), with visuals influenced by comic book artists such as Mike Mignola, Charlie Adlard and Frank Miller.\r\n</p><p>\r\n\tAs the game starts, Jazon wakes up disoriented in the restroom of a bar and he doesn't remember a thing. As he leaves the bar, he finds a ruined world ruled by zombies and scumbags.\r\n</p><p>\r\n\tAs Jazon travels across the wasteland, he must discover his past to save the future. Along the way he meets Zoey, a wasteland veteran who just wants to forget about her history. Together they visit the oracle in the mountains, who foresees a prophecy leading them on an epic odyssey to save humanity from complete annihilation.\r\n</p><p>\r\n\tTim Schafer - President &amp; CEO, Double Fine\r\n</p>\n<em>\"What if Full Throttle had zombies and was made in Denmark?\"</em>\n<p>\r\n\tBrian Fargo  - President &amp; CEO, InXile Entertainment\r\n</p>\n<em>\"Nice visual style guys.... looking good.\"</em>\n<p>\r\n\tJavy Gwaltney - Game Informer\r\n</p>\n<em>\"The game's gorgeous visuals do a good job of making it stand out\"</em>\n<p>\r\n\tJacob Wood - IndieHangover\r\n</p>\n<em>\"With a B-movie vibe and fantastic graphic novel style aesthetic, Jazon and the Dead looks incredibly polished.\"</em>\r\nGame Features<ul>\n<li>Player-driven story where you must weigh the consequences of your choices. The story is divided into acts, each with bridging cinematic scenes that focus on different aspects of human nature.</li>\n<li>Fight your way through hordes of zombies with a heavy gun or bloody fist. Ammunition is scarce so you need to make every shot count! Dash and push zombies out of your way to survive through close combat.</li>\n<li>Explore a world inspired by 80's sci-fi B-movies with chunky old technology and lots of blood and gore. Your journey takes you through deserts, abandoned towns, underground caves, surviving cities and military facilities.</li>\n<li>Puzzle your way out of tense situations before the slow, brain devouring creatures reach you. Work cleverly with corpses in the world -- as weights or to stand on to reach your destination.</li>\n<li>Groovy 80's inspired soundtrack. Nothing less will do it.</li>\n</ul>", "metacritic": null, "released": "2016-11-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8dc/8dcf774f699660ca90eb8b7df4dfbbd9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["2ndstudio"], "genres": ["Action"], "publishers": [], "esrb_rating": null}