{"id": 951703, "slug": "stuck-in-the-liminal", "name": "Stuck In The Liminal", "name_original": "Stuck In The Liminal", "description": "<p>The sequel to Stuck In The Past! Things don't go as planned after Reid leaves Appold and he finds himself in another unfamiliar world without his sword. The only way out is to scale a tower, picking up the Facets of his shattered crystal, battling using different Aspects of his personality, and making new friends and reuniting with old ones.</p>\n<p>Featuring:</p>\n<ul><li>A battle system based on changing your Aspect! Customize your playstyle and bounce off your allies with different movesets, elemental types, and stats!</li><li>Camouflage into the background to find Facets, avoid enemies, and decrease target rate in battle!</li><li>Party switching to utilize different overworld abilities!</li><li>Learn the mysteries of the Liminal as you ascend!</li><li>A retro aesthetic featuring the work of Violet Spinel, Nateplays95, and more!</li><li>A classic callmeDJ chiptune soundtrack featuring plenty of Theme6 and... DJ's brother?!</li><li>40-60 minute playtime.</li></ul>\n<p>Known issues:</p>\n<ul><li>Enemies sometimes clip into you when they notice you. Unfortunate drawback of the camouflage mechanic and how it's set up.</li><li>Couldn't get my head around some of the Yanfly plugins in time so there's some visual jank. Does not affect gameplay.</li><li>One user reported a memory leak that froze the game. This was a one-time issue and he was able to complete it afterwards. Press F5 to refresh the game should this happen.</li></ul>\n<p>By callmeDJ and The Colors Of Life Team. #reidsweep</p>", "metacritic": null, "released": "2023-03-31", "tba": false, "updated": "2023-04-03T23:14:55", "background_image": "https://media.rawg.io/media/screenshots/f8b/f8b21d58ddaa883718ff2e7388cf7ce3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["callmeDJ"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}