{"id": 951740, "slug": "faithfulleap", "name": "FaithfulLeap", "name_original": "FaithfulLeap", "description": "<p>DAF JAM'e katılan Yapmayan Zeka takımının oyunu Faithful Leap. Takımın Level ve Game Designer ve Developer'ı olarak repostluyorum.</p>\n<p>Jam versiyonu linki: https://ozgurd5.itch.io/faithful-leap</p>\n<p>Jam versiyonundan farklı olmak üzere bu versiyon oynanabilir halde ve geliştirmeler alacak. -Agah.</p>\n<p>Hareket etmek için WASD ve Spacebar (boşluk tuşu) tuşlarını kullanın. Haritada bulunan altıgen şeklindeki noktalara tıklayarak kanca atın. Sağ tıklayarak kendinizi (o noktaya doğru) çekin. NPC karakterleri yönlendirmek için onlara tıklayın ve J(sol)K(dur)L(sağ) ile yönlendirin. Ekranda bulabileceğiniz kutucuğa tıklayarak build modunu açın ve NPCler veya kendiniz için yol yapın. Gerektiğinde bölümü tekrar başlatmak için R tuşunu, ana menüye dönmek için T tuşunu kullanın. İyi eğlenceler (bol şans).</p>\n\n<p>DAF JAM participator team \"Yapmayan Zeka\"s game, Faithful Leap. As the Game  Designer and Developer of the team I am reposting it.</p>\n<p>The Jam version of the game : https://ozgurd5.itch.io/faithful-leap</p>\n<p>Differing from the Jam version this one is playable and will recieve development.</p><p> -Agah.</p>\n<p>Use WASD and Spacebar to move. Use J(left) K(stop) L(right) to direct the NPC's. Click at the white hexagons to grapple. Right-click to pull yourself (at them). Click the little box you can find on the screen to enable builder mode and build the way for the NPC's or yourself. You can use the button R to reset the level, T button to return to the main menu when needed. Have fun! (good luck).</p>", "metacritic": null, "released": "2023-03-30", "tba": false, "updated": "2023-04-03T23:29:23", "background_image": "https://media.rawg.io/media/screenshots/c98/c98ea85e409701d7d69cf6fe1a09d5d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["agahgames"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}