{"id": 951987, "slug": "polygunner-2", "name": "PolyGunner", "name_original": "PolyGunner", "description": "<strong>Defeat enemies as they rush towards you, upgrade your weapons to prepare for more powerful enemies!</strong><h3>Controls</h3>The player can switch weapons with the number 1 and number 2 keys.<br/>The player can run with the left shift key and jump with the space key.<br/>Melee attacks do not exist.<br/>The controls are the same as most FPS games, but if you're new to the game, be sure to check the skill keys in the settings window.<h3>Victory Conditions</h3>Battles are fought in waves.<br/>A wave begins with an enemy spawning in one of the four regions,<br/>enemies always travel to the player's location.<br/>The wave ends when all enemies are defeated, and the next wave begins after a certain amount of time.<br/><br/>The player wins if they survive 30 waves.<br/>Every 10 waves, a boss appears. Be prepared to battle bosses with powerful patterned attacks.<h3>Resources</h3>When capturing an enemy, the player gains a certain amount of experience. When maximizing experience, players gain skill points and recover a certain amount of HP.<br/><br/>In addition, at the beginning of each wave, a supply crate spawns in the sky.<br/>Attacking and destroying supply crates will give you a large amount of skill points and ammo.<h3>Skills</h3>Pressing the F1(default) key opens the Skills window.<br/>In the Skills window, you can enhance your player's stats or gain skills that are useful against enemies.<br/>You can select up to four types of skills, and for active skills, you can freely set a hotkey for the skill to use in the Skills window.", "metacritic": null, "released": "2023-04-02", "tba": false, "updated": "2023-04-07T03:05:08", "background_image": "https://media.rawg.io/media/screenshots/fd9/fd92b2efd9dac7ed69fc1a874ac56d02.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BigPillar"], "genres": ["Indie"], "publishers": ["BigPillar"], "esrb_rating": null}