{"id": 951981, "slug": "meta-lines", "name": "Meta Lines", "name_original": "Meta Lines", "description": "<strong>[About this game]</strong><br/><br/>Metaline is a minimalist puzzle game. Your only goal is to connect all points with lines, and then enter the next level<br/><br/><strong><h3>Game play:</h3></strong><br/><br/><ul><li>1. Click the check point with the main mouse button, and then slide to the normal point to create a short line<br/></li><li>2. You need to gradually create lines between two identical checkpoints to connect them<br/></li><li>\"All points must be connected by lines, and you cannot omit any point that is not connected.\"<br/></li><li>4. All checkpoints must be endpoints. Similarly, all endpoints must be checkpoints<br/></li><li>5. All connections you create cannot cross each other</li></ul><br/>When all your lines meet the above conditions, you can win the level and then enter the next level.<br/><br/>The rules of the game are very simple, and Meta Lines is perfect for relaxing in your spare time while exercising your brain's thinking abilities.<br/><br/>Meta Lines is the second game I developed, and it will continue to be updated. I hope everyone likes it!<br/><br/>Thank you for your feedback and strong support for Meta Lines. If you encounter any issues in the game, have misleading content on the store page, want to give comments and suggestions, or simply want to say hello, you can contact me through the Steam game forum or email. I will spare no time to have a pleasant conversation with you as much as possible. If I did not respond to your information in a timely manner, I am very sorry, it may be that I did not notice, Or too busy, I will try to avoid it.<br/><br/>Thank you for taking the time to read this article, and I sincerely hope you enjoy my game. Y. J. ------ Matrix Science<br/><br/><strong><h3>Game features:</h3></strong><br/><br/><ul><li>1. As the level ordinal number increases, the difficulty will also increase<br/></li><li>Minimalist interface, providing you with the most comfortable visual effects<br/></li><li>3. If you prefer, there are multiple color themes in the game for you to choose and replace, to avoid aesthetic fatigue as much as possible<br/></li><li>4. You can use white or black as the main color<br/></li><li>5. A few quiet, comfortable, and relaxed atmosphere music to alleviate your brain fatigue<br/></li><li>6. Support multiple languages such as English, Russian, Chinese, and French (of course, considering font compatibility issues, this will be gradually updated, please be patient while playing the game)<br/></li><li>7. Support for Steam Cloud archiving. When game data is accidentally cleaned up or the computer is replaced, past progress can be downloaded from Steam Cloud at any time<br/></li><li>8. There are a total of 29 simple and interesting achievements that you need to complete<br/></li><li>9. Extremely low pricing and frequent discounts<br/></li><li>10. In the future, I will carefully design more levels, and I eagerly hope for your challenge!</li></ul><br/>The audio in the game is a royalty free file provided by excellent websites such as freeSound<br/><br/>This page is translated using DeepL. If there is any misleading content, error propagation, or cultural sensitivity, please contact me at Steam Community or email.<br/><br/><strong>Thank you for your help and feedback!<br/><br/>Thank you all!</strong><br/><br/>", "metacritic": null, "released": "2023-04-03", "tba": false, "updated": "2023-04-07T02:57:16", "background_image": "https://media.rawg.io/media/screenshots/c84/c84d0fc996b7c5b48f64a3f684e44155.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Matrix Science"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Matrix Science"], "esrb_rating": null}