{"id": 951993, "slug": "brinefall", "name": "Brinefall", "name_original": "Brinefall", "description": "<strong>Join us on Discord!</strong><br/><br/><br/>Experience the ultimate adventure in Brinefall, where you'll gather resources, build and expand your own village, and uncover the secrets of a vast open-world. Explore dense forests, treacherous mountains, and mysterious ruins as you uncover the hidden treasures of the world. Battle fierce enemies and collect valuable loot as you progress through the journey. With a unique blend of sandbox and RPG gameplay, Brinefall offers endless possibilities for player choice and creativity. Whether you want to focus on building and expanding your village or delving deep into the mysteries and secrets, the choice is yours. Join the adventure now and see what Brinefall has in store for you.<br/><br/><br/><br/>Brinefall is yours. Build your own town and bring new villagers to it like a blacksmith, merchants, and more to aid you in your adventure. But be careful, you may get the attention of the wrong people too!<br/><br/><br/><br/><br/><br/>The world is massive, build your own boat, discover new areas and gather resources scattered around the world.<br/><br/><br/><br/><br/><br/>Brinefall uses a classless system. Use everything you got and defend yourself (and your village) against dangerous enemies. Craft your own equipment, brew the best potions, and find the strongest spells to overcome your challenges.<br/><br/><br/><br/>Brinefall offers multiple playstyles where you have the freedom to do what you like to do whether it is to build, craft, or explore the world, there is something for you!", "metacritic": null, "released": "2023-04-03", "tba": false, "updated": "2023-04-07T03:12:04", "background_image": "https://media.rawg.io/media/screenshots/b5f/b5fc79860002921547e55b9089a70153.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 371, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Qwerty Studio"], "genres": ["Adventure", "RPG"], "publishers": ["Qwerty Studio"], "esrb_rating": null}