{"id": 951977, "slug": "qualification-as-rogue", "name": "Qualification as Rogue", "name_original": "Qualification as Rogue", "description": "Traverse various landscapes including hills and underwater and defeat the monsters! <br/>\r\nSolve the puzzles and save the Princess from the Dark King!<br/>\n<br/>\r\nDon’t be fooled by the simple 2D graphics because you will definitely enjoy the fun that is only found in classic retro games!<br/>\n<br/>\r\nAn adventure platformer game with a new concept of combining brain puzzle elements to solve various traps and devices. Find hidden routes or open treasure chests to defeat the monsters while passing through various landscapes including rocks, hills, or underwater!<br/>\n<br/>\r\nAn exciting adventure with pocket dot heroes!<br/>\r\nYou will confront many pocket monsters with hundreds of abilities that will get in your way.<br/>\n<br/>\r\nElegant yet powerful super dot heroes!<br/>\n<br/>\r\nDynamic dungeons await you!<br/>\r\nWhen players successfully clear a dungeon, they will be rewarded with money to obtain more powerful swords.<br/>\n<br/>\r\nTurn these brave dot heroes into super heroes!<br/>\n<br/>\r\nFocus and keep trying until you reach the highest dungeons.<br/>\n<br/>\r\nNever give up!<br/>\n<br/>\r\nA game with simple controls that can easily be played by anyone<br/>\r\nWith an unbelievable addiction factor.<br/>\n<br/>\r\nElite Heroes is a love letter to the classic retro platformers of the past.<br/>\n<br/>\r\nTrek across various terrains and use your sword to defeat the enemies in the dungeons.<br/>\n<br/>\r\nDungeon Adventure<br/>\r\n• Explore underground prisons and towns while encountering treasures and wicked monsters.<br/>\n<br/>\r\nMagic Skills and Swords <br/>\r\n• Gather powerful gear, items, spells, and gold to defeat dungeon enemies.<br/>\n<br/>\r\nSide-scrolling Platformer<br/>\r\n• Fluid and challenging platformer gameplay designed specifically for smartphones.<br/>\n<br/>\r\nThis game requires the following permissions. No other permissions will be required.", "metacritic": null, "released": "2023-04-06", "tba": false, "updated": "2023-04-07T02:52:26", "background_image": "https://media.rawg.io/media/screenshots/040/04088ba8cc93187b08b4a9ecec3d4e8e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 339, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SUNBEESOFT"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["SUNBEESOFT"], "esrb_rating": null}