{"id": 952042, "slug": "an-adventurers-gallantry", "name": "An Adventurer's Gallantry", "name_original": "An Adventurer's Gallantry", "description": "An Adventurer's Gallantry is a visual novel set in a fantasy world of dungeons and monsters. This is a kinetic visual novel, ie. it doesn't have any choices and only has one ending.<br/>\n<br/>\n<br/>\r\nOren has always dreamed of becoming a knight. It's what he's trained for all his life, and he was all too happy to squander his savings and leave his home behind to make it happen.<br/>\n<br/>\r\nUnfortunately, the reality of being a knight isn't so glamorous. What's common sense for Oren is unthinkable for the knights, and he quickly finds himself tossed out onto the street after failing to adapt.<br/>\n<br/>\r\nJust when Oren thinks his life has hit rock bottom, an adventurer named Litia invites him to join her party. Knights and adventurers are usually mortal enemies, but desperate times call for desperate measures, and Oren isn't above swallowing his pride in order to survive.<br/>\n<br/>\r\nOren and Litia bicker to no end. There seems to be very little the duo can agree on. But as a team, the two work together surprisingly well, and the work of an adventurer is nothing like what Oren had imagined.<br/>\n<br/>\r\nGiven a glimpse of a different future, will Oren abandon his dream of becoming a knight and embrace his new life as an adventurer?", "metacritic": null, "released": "2023-04-04", "tba": false, "updated": "2023-04-07T04:18:13", "background_image": "https://media.rawg.io/media/screenshots/fa2/fa24c53799eb19ac17bb9fab7ceb52fe.jpg", "website": "https://zetsubou.games/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 6, "ratings_count": 0, "suggestions_count": 315, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Zetsubou"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Zetsubou"], "esrb_rating": null}