{"id": 95201, "slug": "dsa", "name": "D.S.A", "name_original": "D.S.A", "description": "<p>D.S.A is a surreal action/adventure game that follows D.S.A, an ameteur girl group, as they get lost on their school campus one night after the worst gig of their lives. And to make matters worse, they're all split up, and tripping out.</p><p>The group consists of Alice, Wendy, and Dorothy. They suffer constant disagreements, over the band's style, name, and often, just with eachother.</p><p>Now they must get back together, get back to their dorms, and maaaaaybe uncover something bigger, as the hallucinations get more vivid, and the people they meet get stranger.</p>PRESS\"an increasingly surreal and trippy landscape full of rough style and offbeat humor.\" -Offworld<br/><br/><br/>\"this feels like a lost game from before indie gaming exploded, something like Treasure Adventure Game or Eternal Daughter. (i.e. it's huge and fully featured, and rather ambitious.)\" -PC Gamer<br/><br/><br/><br/>FEATURES<ul><li>Unlike a lot of adventure games, there are no fiddly item puzzles, and you navigate with the keyboard instead of the mouse. You also switch between each of the 3 main characters, to work together to find your way out.</li><li>Takes place in a huge world full of dungeons, tons of secrets, and surprises.</li><li>Over 6000 lines of dialogue</li><li>Low-Quality MSPaint Graphics- let's not lie here</li><li>3 Acts Long. It's actually really long</li></ul>FURTHER INFO<p>I made this game on my own from 2010 to 2015, and it was a hell of a lot of effort and it means a lot to me. Full credit for everything is included in the game.</p><p>(It was made on my own with the exception of two pieces of music by Dawid W Mika , and several samples of other songs by other artists)</p><p>Soundtrack also available for free listening on BandCamp: HERE</p><p>(If you have any questions or bug reports, direct 'em to @thewaether on twitter.)</p><p>(version info: Save files work on any version of the game! You can just shift them over.)</p><p>D.S.A is copyright © Kate/S Barrett / Thewaether<br/></p>", "metacritic": null, "released": "2015-09-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/56f/56fb72f45bdc471828b127a155b58685.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TheWaether"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}