{"id": 952101, "slug": "across-the-valley-2", "name": "Across the Valley", "name_original": "Across the Valley", "description": "Across the Valley is your <strong>friendly farm simulator</strong>, developed <strong>exclusively for VR</strong>.<br/><br/><strong>Lend a hand — literally —</strong> so that everything can grow and thrive. <br/><br/>Sow, water and harvest your own plants. <br/>Raise adorable baby animals. <br/>Milk the cows, shear the sheep and go on a truffle hunt with the pigs — all in fun mini-games.<br/><br/>The graphics in Across the Valley have a fantastic <strong>hand-drawn style</strong>. The grass here is lush and green, and the sunsets are golden. Enjoy the idyllic countryside and relax to the sounds of the atmospheric soundtrack.<br/><br/>On your farm, <strong>there’s something to do every day</strong>. Give your plants and animals plenty of love and care! They’ll reward you with a bountiful harvest. You can use your profits to expand your farm — your planning table will let you see it all easily.<br/><br/>Until now, you’ve only played farm simulators — but now you can move into <strong>your own virtual farm</strong>.<br/><br/>Instead of clicking around in menus, you care for the animals and plants with your own hands. Instead of looking at your farm from up above, you’re right in the middle of it.<br/><br/>Why just watch an avatar pet your animals when you can pet them yourself?<br/><br/>", "metacritic": null, "released": "2023-04-06", "tba": false, "updated": "2023-04-07T05:34:48", "background_image": "https://media.rawg.io/media/screenshots/3a9/3a97d42daf0ceb376a9a329dff97835a.jpg", "website": "http://www.across-the-valley.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FusionPlay"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["FusionPlay"], "esrb_rating": null}