{"id": 952126, "slug": "road-96-mile-0-stronger-together-bundle", "name": "Road 96: Mile 0 - Stronger Together Bundle", "name_original": "Road 96: Mile 0 - Stronger Together Bundle", "description": "The Road 96: Mile 0 – Stronger Together Bundle includes everything any Road 96 veteran or newcomer could dream of owning.<br/>\n<br/>\nDiscover the deceivingly luxurious city of White Sands at times prior to the events taking place in Road 96 in its prequel: Road 96: Mile 0.<br/>\n<br/>\nRelive the hype of the game’s rides and the emotional whirlwind of Zoe and Kaito’s journey with Road 96: Mile 0’s OST which includes the song exclusively composed by “The Midnight” for the game: “Land Locked Heart”.<br/>\n<br/>\nLast but not least, dig deeper and unearth more of Petria’s secrets with the gamebook Road 96: Mile 0 “About a Girl”; whether you played Road 96 or are discovering Petria with Road 96: Mile 0, this gamebook is a must-read/play.<br/>\n<br/>\n•The game - Road 96: Mile 0 <br/>\n<br/>\nRoad 96: Mile 0 is DigixArt’s latest game following the hugely successful Road 96. This new game is a direct prequel to Road 96 and suitable for both Road 96 fans and newcomers. Alternating between Zoe and Kaito, you will live in and explore White Sands, a luxurious gated community where Petria´s elite resides.<br/>\n<br/>\nZoe is one of the characters of Road 96. She’s had a very wealthy and sheltered life and her father works for the government. Kaito, a character from Lost in Harmony, lives in the far less privileged area allocated to workers and is eager to challenge the status quo.<br/>\n<br/>\nAgainst all odds, they're best friends but their differences will ultimately catch up to them.<br/>\nMirroring its protagonists, Road 96: Mile 0 features a thrilling mix of gameplay, blending the narrative mechanics native to Road 96 with musical action levels inspired by Lost in Harmony.<br/>\n<br/>\n•The gamebook - “Road 96: About a Girl” gamebook <br/>\n<br/>\nMuch like the acclaimed book series of the 80s and 90s, it offers the reader the chance to experience a literary adventure where your choices shape your adventure and ultimately its ending.<br/>\n<br/>\nThe “Road 96: About a Girl” eBook takes place in the Road 96 videogame universe and covers the timeline between Road 96: Mile 0’s grand finale and the beginning of Road 96. As part of this bundle, you’ll be able to continue to follow Zoe’s antics and find out what becomes of her once completing the game. Furthermore, this gamebook will take you right before Road 96’s beginning so it is the perfect transition if you have never played Road 96 before. All in all, whether you played either or both games, you can expect to recognize places, events, and characters, but also to expand your knowledge of the world of Petria.<br/>\n<br/>\n•The Soundtrack - The Road 96: Mile 0 <br/>\n<br/>\nYou’ll find in this collection soundtracks that can be heard as you venture throughout White Sands and beyond! Including the song exclusively composed by The Midnight for Road 96: Mile 0: “Land Locked Heart” as well as original creations and mixes. Some of those tracks are produced by local artists such as Arslan Elbar, Alexis Laugier and Jean-Claude Charlier.<br/>\n<br/>\nWhether you want to experience the thrill of the game’s action sequences again, project yourself in Zoe’s teenage years or listen back to what accompanied the heart-wrenching moments of the game, this is the collection for you.", "metacritic": null, "released": "2023-04-03", "tba": false, "updated": "2023-04-08T07:15:49", "background_image": "https://media.rawg.io/media/screenshots/9d8/9d895eda4a014f49fe9d6d18854535eb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 402, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Digixart"], "genres": [], "publishers": ["Ravenscourt"], "esrb_rating": null}