{"id": 952102, "slug": "golden-legend-harald-quest", "name": "Golden Legend -Harald Quest", "name_original": "Golden Legend -Harald Quest", "description": "<ul>\n<li>Story<br />\nThe northeastern part of the Elstra continent, it is a legendary land called &quot;Adventure World&quot;.<br />\nAdventurers who pursue dreams and wealth gather to create a new legend.<br />\nThis is where the story of mercenary-turned female warrior blonde Harald begins.  </li>\n<li>Content<br />\nSandbox SRPG  </li>\n<li>Control<br />\nLeft Click: Confirm<br />\nRight Click: Cancel, Move in Combat/on Main Map<br />\nDirectional keys: Move on Main Map<br />\nESC: Menu<br />\n·Adventure<br />\nExperience the life of a mercenary with a high degree of freedom, create your own mercenary group, and explore the continent.<br />\nDungeon, business, quests, crime, prostitution... how you live is up to the player.<br />\nThe game has a loop system. When the heroine dies or visits a special NPC, a new loop starts.<br />\nNPCs that die once cannot be revived in the current round, but all events are reset again in the new loop.<br />\n・Mercenaries<br />\nThe heroine meets various NPCs on her journey and creates a mercenary group.<br />\nDifferent events will occur depending on the type of NPC in the mercenary group.<br />\n(*Even you could sell your companion to a slave trader. Yeah, you can do that!)<br />\n·Battle System<br />\nCombat takes place in real time.<br />\nThe player gives orders as the leader of the mercenary group.<br />\nMercenaries, including the heroine, will automatically fight based on their orders.<br />\nWhether or not it goes well depends on training and the combination of mercenaries.<br />\nOne of the charms of this game is seeing how the slightly clumsy NPCs fight with different tactics.<br />\n・H Scenes<br />\nDefeat H, Prostitution, Rape, etc.<br />\nIn addition to the heroine, multiple female characters will appear.</li>\n</ul>", "metacritic": null, "released": "2023-04-06", "tba": false, "updated": "2023-04-10T11:40:27", "background_image": "https://media.rawg.io/media/games/3be/3be761a22750535ae699f05b385e9f39.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 453, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PastureSoft"], "genres": ["RPG", "Casual"], "publishers": ["PastureSoft"], "esrb_rating": null}