{"id": 952124, "slug": "arcrunner", "name": "ArcRunner", "name_original": "ArcRunner", "description": "Engage in a thrilling, Cyberpunk-styled roguelite shooter as you venture through a futuristic space station to reset an evil AI gone rogue. Clash in gun fights with swarms of deadly sentient robotic enemies, programmed with one objective - your annihilation. Select a character that aligns with your unique combat style and utilise cutting-edge augmentations after every successfully completed level to power up. Experiment with a diverse arsenal of firepower and team up with friends locally or online as you attempt to save 'The Arc'.<br/><br/>Take on the rogue AI together with up to three players in online multiplayer. Coordinate your tactics and battle plan as you attempt to reset an AI gone rogue!<br/><br/><br/>Battle through multiple zones, each with uniquely generated levels, from the dystopian cyberpunk metropolis of The City to the luxurious Eden Heights. With each level randomised, no two runs will be the same.<br/><br/><br/>Whether you prefer brute force as a Soldier, manoeuvre like a Ninja, or hack your way to victory as a Hacker, each character brings unique advantages, weapons, and abilities to match your playstyle.<br/><br/><br/>Strategically augment yourself with stronger abilities &amp; power ups at the end of every level. Make yourself even more advanced with by spending your collected 'nanites' &amp; purchase powerful meta-progression upgrades in the cryochamber. Choose from a variety of improvements to increase damage, health, add weapon mod slots, and equip powerful augmentations to help you survive.<br/><br/><br/>Scan the environment and loot defeated enemies for new weapons such a the cluster-firing-shotgun 'Demolisher' and the pin-point accurate 'Plasma Bow' as you traverse The Arc. Utilise permanent nanite upgrades to attach modifications to increase damage and equip multiple weapons.<br/>", "metacritic": null, "released": "2023-04-27", "tba": false, "updated": "2023-06-01T09:58:14", "background_image": "https://media.rawg.io/media/screenshots/115/1150134426679680ba0f2be1221bd418.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 431, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Trickjump Games"], "genres": ["Action", "Indie"], "publishers": ["PQube"], "esrb_rating": null}