{"id": 952117, "slug": "blocky-dungeon-2", "name": "Blocky Dungeon", "name_original": "Blocky Dungeon", "description": "Blocky Dungeon is a roguelike... mixed with a puzzle game! <br/><br/><br/>Venture inside dungeons you build yourself, just as you explore them. Place blocks to form paths for the knight and lead him across the dungeon.<br/><br/><br/>But be careful! If the Dungeon map fills up, it's game over for you! <br/>Luckily if you create a full line with the blocks you place, the knight can 'mark' that line to make it disappear from the Dungeon, creating more space for you to place Blocks and continue your adventure.<br/><br/><br/><br/><br/><br/><br/>These dungeons are no safe place for the knight. All sorts of enemies dwell the blocks and will target him as soon as they are placed on the map. You can clear lines with enemies on it to get rid of them quickly.<br/><br/><br/>Don't do this willy nilly though! The curse placed upon the Knight will gain power if the Knight doesn't directly kill enemies, so you better be ready to fight your battles. Pay close attention to your resources and study your opponent's behavior or you'll be in trouble!<br/><br/><br/><br/><br/><br/><br/>As the game goes on, enemies will become tougher to take down, but the knight has one skill at his disposal to help counter this!<br/>By defeating an enemy with just the right amount of damage (aka a Perfect Strike), or by marking lines for removal, the Knight gets a temporary powerup! Keep the streak going to take down more powerful enemies!<br/><br/><br/><br/><br/><br/>- 30+ enemy types with distinct behaviors<br/>- 4 bosses<br/>- 6 dungeon themes<br/>- 3 game modes<br/>- infinite layout combinations!", "metacritic": null, "released": "2023-04-06", "tba": false, "updated": "2023-04-14T11:38:37", "background_image": "https://media.rawg.io/media/screenshots/9de/9deffe341e189b5b902a55bdde4c43ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "toplay": 2, "dropped": 1}, "playtime": 2, "achievements_count": 16, "ratings_count": 1, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["SquareAnon"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["SquareAnon"], "esrb_rating": null}