{"id": 95212, "slug": "star-traveller", "name": "Star Traveller", "name_original": "Star Traveller", "description": "<p>\r\n\t Star Traveller was made in 72 hours for the Ludum Dare game jam, and was originally released in April 2017. It's small space exploration game, with light puzzle elements and some reactive audio. <br/>\n</p><p>\n<strong>WHY WE MADE IT</strong><br/>\r\n\t This game was made for Ludum Dare 38, and the theme was Small World.  Initially the idea was to explore solar systems looking for a small world to call home, the theme was lost a little in translation from concept to finished game. We focused more on creating an audio visual experience that the player could interact with, rather than a challenging puzzle game.</p><p>\n<strong>CONTROLS &amp; HELP</strong><br/>\r\n\tAll of the game is controlled with the Mouse.  Use left click to select a star system, and left click again to zoom in on a particular planet or moon.  When you're zoomed in, you can right click at any time to zoom out again.<br/>Left clicking on the little alien avatar will return you to the galaxy view.</p><p>You can also left click on some objects to pick them up and add them to your inventory.  Once they are in your inventory they will appear in the top left oft he screen, from here you can drag the objects onto planets or moons to see how they interact.</p>\n<strong>JAMES</strong>\n<strong>EDGE</strong>\n<strong>ADAM</strong>\r\n\t\r\n\t\r\n\t\r\n\r\n\r\n\t\r\n\t\r\n\t\r\n\t\tArt &amp;<br/>Animation\r\n\t\r\n\tMusic &amp;<br/>Sound\r\n\tGameplay &amp;<br/>Design", "metacritic": null, "released": "2017-04-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0a0/0a07941f40fd3e8512866671523d3004.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Second Dimension Games"], "genres": [], "publishers": [], "esrb_rating": null}