{"id": 95226, "slug": "totems-sound", "name": "Totem's Sound", "name_original": "Totem's Sound", "description": "<p><em>This is the story of the Norwegian explorer Johan Adrian Jacobsen. From 1881 to 1883 he travelled along the northwestern coasts of the Americas. Commissioned by a support comitee, he purchased and catalogued an immense number of artefacts and objects from local tribes for the German Humboldt Foundation. Totem's Sound is based on his personal accounts. </em></p>\n<p><em>Well, almost!</em></p>\n<p><em>Enjoy a day of Johan's journey, featuring great outdoor activities such as canoe races, collecting clams, not getting eaten by a giant grizzley and of course fish oil binge drinking. Get in contact with the local tribes, that are struggling to preserve their ways of life and their cultures in a rapidly changing world.</em></p>\n<p>\r\n\tTotem's Sound was conceived and produced by gold extra with the support of Causa Creations in the framework of the Humboldt Lab Dahlem, a project by the Kulturstiftung des Bundes in collaboration with the Foundation Preußischer Kulturbesitz Berlin. As part of Rehersal Stage 4 - Travelogue Totem's Sound is being shown in the Museum Dahlen from  23.09.2014 to 08.02.2015.</p>\n<p>\r\n\tDeveloper: Adeline Ducker (Art), Tilmann Hars (Code &amp; Design), Georg Hobmeier (Text &amp; Design), Brian Main (additional Art), Karl Zechenter (Music, Sound &amp; Research)</p>\n<p>\r\n\tLibraries: vrld (hump), kadoba (atl), markngo (atc), Xelu (Key-art)</p>\n<p>\r\n\tFonts: LastPriestess, Pixel UniCode by ivancr72</p>\n<p>\r\n\tTested by the amazing Patrick Borgeat, Steven Colling, Henning Thiele, Kasia Zielinska  + Timo Rostasy</p>\n<p>\r\n\tThanks to: Harald Hackl (Yurp.at), Schwerpunkt Wissenschaft und Kunst Salzburg, Filipe Canha</p>\n<p>Updates!</p>\n<p>10/10/14, Version 1.0.1: Possible fix for Shader error covering half the screen.</p>", "metacritic": null, "released": "2014-09-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/aa8/aa83ed29a3c70347b6adfe840a0d87b7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["causacreations", "gold extra"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}