{"id": 95252, "slug": "if-one-thing-changed", "name": "If One Thing Changed", "name_original": "If One Thing Changed", "description": "<p>This is an experience. about 30 min or longer depending on if you get all the endings. This game is a text based story using only sound, music and text, 3 Endings are available (4th one being finished)<br/></p>\n<p>\r\n\tHeadphones strongly recommended.</p>\n\n<p>\r\n\tWARNING: </p>\n<p>This game may contain subject and language matter that may be offensive, this will be your only warning. If you are sensitive to serious and realistic situations. DO NOT PLAY THIS GAME. </p>\n<p>\n<br/>\n</p>\n<p>\r\n\tWhat would your life be like if you just made one decision different, victory or defeat? Right or wrong? Better or worse?\r\n</p>\n<p>\r\n\tWe all reflect at one time or another wondering what would have happened.\r\n</p>\n<p>\r\n\tNOTE: IF YOU TRY TO CLICK PAST TOO QUICKLY YOU WILL SKIP SOUNDS!\r\n</p>\n<p>If you have any issues/bugs with the game please join the Discord or the channel and let me know!</p>\n<p>https://discord.gg/NXFNZUR<br/></p>\n<p>http://www.youtube.com/kahmehkahzeh</p>\n\n<p><strong>:5/6/17 - Comment section:</strong></p>\n<ul><li><strong>Changed the comment section to a forum to avoid spoilers on this page. Please post all YouTube experiences in the threads! As I encourage all videos. But I want people to experience the game first hand.</strong></li></ul>\n\n<p><strong><strong>:5/5/17 - 0.959 update:</strong></strong></p>\n<ul><li><strong>Removed the silent sound, as people were skipping over the sounds when they clicked to fast.</strong></li></ul>\n<p><strong>:</strong><strong>5/4/17 - 0.958 update:</strong></p>\n<ul><li><strong>ADDED MAC LINUX AND ANDROID VERSIONS - Need people to test! </strong></li><li><strong>Fixed Android bug that showed wrong size text and textbox for cellphones</strong></li><li><strong>Fixed all spelling errors reported or found. (please report more if found)</strong></li><li><strong>Added a silent sound so if you skip past sounds it will be quiet instead of playing the sound.(when trying for all endings)</strong></li><li><strong>Delayed chime by 2 seconds allowing you to skip past quieter</strong></li><li><strong>Headphone recommendation added (yes headphones make a difference)</strong></li></ul>\n\n<p>\r\n\t:::Game Backstory:::\r\n</p>\n<p>\r\n\tThis game was created after someone tried to impersonate me to get free game keys, one of the game makers contacted me through youtube, and thus a friendship started.\r\n</p>\n<p>\r\n\tInitially it was a request by him for a project idea that could be made in a day. after throwing him some random ideas, he said he would be right back, at that time I wrote a story, just the basics. But he loved it, then I spent the next 5 hours til the break of dawn writing and expanding the story.\r\n</p>\n<p>\r\n\tThough later he decided it would not be possible in a day. we spent the next week shooting back and forth edits updates and the creation of the game within Unity (he did all the coding). The game quickly became a Imageless Visual novel.(intentionally imageless)\r\n</p>\n<p>\r\n\tBut at a point he had to get back onto his other companies projects, so he sent me all of the coding that he used... Which exploded my brain, and I decided I would make it all from scratch.\r\n</p>\n<p>\r\n\tAfter a great deal of time and effort this was born.\r\n</p>", "metacritic": null, "released": "2017-04-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0bc/0bcd35fe771139bfa1270db13fd99570.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["kahmehkahzeh"], "genres": [], "publishers": [], "esrb_rating": null}