{"id": 952510, "slug": "hakaiju", "name": "Hakaiju", "name_original": "Hakaiju", "description": "**CREATOR'S NOTE**: HAKAIJU WORKS BEST WHEN YOU DOWNLOAD IT TO YOUR COMPUTER. The WebGL version is functional but has a noticeable performance drop.\r\n<p>This game made in 2 weeks for the Kaiju Jam II 2023.</p>\n\n<p><strong>Hakaiju</strong> is a third person action game where YOU are the giant Kaiju rampaging through the city. You will need to fight off waves of military opposition while destroying as much of the city as you can! Fill the Destruction Meter to 100% or die trying. </p>\r\nHOW TO PLAY\r\n<p>Gather experience points by destroying the city and military units. \r\n</p>\n\n<p>Once your experience meter is full, you’ll be prompted to level up! You can spend your level up point on your Toughness, Destruction, or Agility stats, each of which will grant different stat buffs to your Kaiju. \r\n</p>\n<p>At specific levels, you’ll earn brand new abilities regardless of which stats you’ve already buffed. Explore the Stats screen from the pause menu for more details!\r\n</p>\r\n\r\nCONTROLS\r\n\n<p>Move with WASD or the left analog stick of your controller.      Move the camera with your mouse or the right analog stick of your controller. </p>\r\nABILITIES\r\nLight Attack \r\n<ul><li>Controls: Left Mouse Button or Right Bumper/R1</li><li>Description: Swipe your claws in the direction you're facing. Your go to for hurting anything and everything.</li><li>Cooldown: None\r\n</li></ul>\n<strong>Charge</strong>\n<ul><li>Controls: Left Shift or Right Face Button.  \r\n</li><li>Description: Launch forward with a quick burst of speed. Useful for closing the gap on enemies or getting out of firing range.\r\n</li><li>Cooldown: 3 seconds</li></ul>\r\n\r\nTail Attack\r\n<ul><li>Controls: Right Mouse Button or Right Trigger/R2 \r\n</li><li>Description: A devastating tail swing attack. Hits a wider area than the basic attack, and does bonus damage to buildings.\r\n</li><li>Cooldown: 12 seconds</li></ul>\r\n\r\nRoar\r\n<ul><li>Controls: E Key or Left Bumper/L1 \r\n</li><li>Description: Your roar creates a devastating EMP shockwave damaging enemies nearby.\r\n \r\n</li><li>Cooldown: 15 seconds \r\n</li></ul>\r\n\r\nAtomic Breath \r\n    \r\n<ul><li>Controls: Q Key or Left Trigger/L2 \r\n</li><li>Description: A stream of nuclear fire will blast out of your  mouth in the direction you are facing, cuts through both enemies and  buildings like butter.\r\n \r\n</li><li>Cooldown: 45 seconds \r\n</li></ul>\n<br/>\r\nCredits\r\n<p>Alex Lazea: Programming, Art, UI<br/>Cory Sowick: Game Design, Level Design<br/>Peleg Bahat: Music, Sound FX<br/>Samantha Scardino: Voice Acting, UI</p>\r\nKnown Issues\r\n<ul><li>WebGL build can have significant performance issues. Please try to download the Windows build for a smoother experience.</li><li>The controls are frame rate dependent and can fluctuate in responsiveness.</li><li>The UI is not fully compattible with the UI. It is best to use the mouse for UI interaction.</li></ul>", "metacritic": null, "released": "2023-04-06", "tba": false, "updated": "2023-04-07T08:42:58", "background_image": "https://media.rawg.io/media/screenshots/fc2/fc2bca5c24b277dfbc7e5f9e5eb3a039.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["pwnofprophecy", "Griggy", "Peleg Bahat"], "genres": ["Action"], "publishers": [], "esrb_rating": null}