{"id": 952530, "slug": "may-the-hunt-be-everlasting-and-may-nature-guide-y", "name": "May The Hunt Be Everlasting and May Nature Guide You Home", "name_original": "May The Hunt Be Everlasting and May Nature Guide You Home", "description": "<p>CW: Questions relating to gender exploration, sexual orientation, and some implied violence</p>\n<p>Average play time: 1-3 hours, but that can fluctuate quite a bit depending on how much you feel like writing for each section.</p>\n<p>I am aware of a bug where on the last passage before the night of the transformation, there is a message about \"nth value not set to 1\" but I didn't have time to fix that before the jam deadline. The game allows you to click the link and continue the story, so please ignore it for now. </p>\n<p>May the Hunt Be Everlasting and May Nature Guide You Home is a solo journaling game where you play by writing down responses to the prompts given to you. I've set up a set of thirty prompts that are randomized for each playthrough and clicking through the Twine will give you a new prompt. In total there's 31 prompts, one for each day of a hypothetical month. I've also listed the prompts in this description in the case that you want to randomize them yourself or want them to copy into a document so that you can better organize your answers as the prompts are given to you. </p>\n<p>I could say a bunch about what I was trying to get at with this project, but I think I just like coming back to werewolves as an expression of queer identity and self-actualization. I choose to be the monster because that is comfortable for me. That is what feels right and helps me to become who I was meant to be. </p>\n<p>I hate that I have to put this as a disclaimer, but in 2023 it is a non-zero chance so, please do not use the writing prompts with a text generating AI like chat GPT.</p>\n<p>I would love to read everyone's journals! Please comment them below or link to a place where you have them hosted. <br/></p>\n\n<p>Individual day prompts: </p>\n<p>1: It’s been a particularly hard day at work today. How does this affect you? Do you notice anything different about how you reacted? \r\n</p>\n<p>2: The moon is at its most distant today. How does that make you feel? \r\n</p>\n<p>3: The weather is mild enough for a walk outside. What happens on that walk? How does that go?\r\n</p>\n<p>4: Emotions tumble forth and make themselves especially known today. What does that feel like for you?\r\n</p>\n<p>5: The transformation continues and is impacting your diet. What kind of cravings are you having?\r\n</p>\n<p>6: Your senses are heightening and you are becoming increasingly aware of this fact. Describe a moment where it was too much and what happened after. \r\n</p>\n<p>7: You seem to have more energy when you wake up in the morning and the general lethargy and malaise that was once a constant buzzing in the background of your subconscious is fading slowly. How does this change your day to day routine?\r\n</p>\n<p>8: Your libido is on your mind today. Has it increased? Decreased? Stayed the same? Have your preferences shifted at all over these last days? \r\n</p>\n<p>9: When you stare at the moon, can you feel her? Does she whisper to you long and late into the night? Far past the realms of dreams and into your subconscious? \r\n</p>\n<p>10: Are you frightened or excited at what you are becoming? Are they in fact the same emotion from different angles when you stop to analyze them? \r\n</p>\n<p>11: Do you find yourself doing more wolf-like behaviors without thinking about it? Or have you kept up a healthy veneer of humanity? What does that look like?\r\n</p>\n<p>12: When singing along to music, have you noticed that you can hit notes that you couldn't before? How will this help you in joining in the great song of the pack at the time you finally see her in her glory?\r\n</p>\n<p>13: Have you noticed a change in your ability to sit still? Is it difficult to keep yourself from moving? Or have you developed a supernatural stillness about you? \r\n</p>\n<p>14: Do you feel more calm when surrounded by nature? Do the sounds and smells of the outside have a different context to you now? Do you find yourself making excuses to go outside more often? \r\n</p>\n<p>15: How is your sleep pattern? Are you sleeping more or less? Have the hours that you sleep shifted slightly? How has that impacted your daily life? \r\n</p>\n<p>16: Do you regret this decision? There is no shame in stopping, if you must. (link to another passage that goes outside of the normal flow, then to the credits)\r\n</p>\n<p>17: Since starting this process, have you tried something you’ve never tried before? How did that make you feel?\r\n</p>\n<p>18: Are you particularly excited for any specific wolf body part you will soon have? A tail? Claws? A snout? Teeth, so many teeth, razor sharp and pointed? Describe that feeling while focusing on that part of your body. \r\n</p>\n<p>19: Have you noticed your feelings for precious metals change at all? Do they hold more or less value to you? \r\n</p>\n<p>20: Today you are feeling like you want to be around other people. Is this perhaps the instinct to form a pack? How do you handle this feeling? What do you do? \r\n</p>\n<p>21: Focus on your hair. Is it longer? Thicker? Fuller than normal? Is it softer or coarser? \r\n</p>\n<p>22: Where are you? Where are you really? Here, in the realm of petty concerns of mere humans? Are you on the moon? Does the night run through your veins faster than your blood?\r\n</p>\n<p>23: Do you find that it is easier to play? To allow yourself to feel silly? Do you take yourself as seriously as you once did?\r\n</p>\n<p>24: How do you feel about your gender? Are you hoping that the great transformation to come will bring you closer to an ideal form you long for?\r\n</p>\n<p>25: Can you taste moonlight?\r\n</p>\n<p>26: Are you worried about becoming a monster? Who put those ideas in your head? How easily will you be able to silence them, lest they keep you from becoming who you truly are? \r\n</p>\n<p>27: You are beginning to be able to see in darkness much easier now. Have you seen secrets with your new sight? Write down three of them. \r\n</p>\n<p>28: Have you noticed that you are more easily able to discern others feelings now? Is it an effect of your increased sense of smell? Are you more empathetic than you had been? Do you find that your own emotions are easier for others to read on you? Does this excite or disappoint you?\r\n</p>\n<p>29: Have you been running in your sleep? What are you running from? What are you running from? What are you running from? What have you to fear anymore? Where is the light of the moon? Where is the fur of your pack? Tucked up against you, safe and comforting? No??? Why? When will it be more than a dream? When will you run with all of your heart, unfettered by the shackles of humanity?\r\n</p>\n<p>30: You can feel it building stronger than it ever has. Tonight is the night that ''She'' will grant you what you have spent so long seeking. Revel in your change and claim the night and the moon as your lovers at last. \r\n</p>\n<p>31: Is it everything you wanted?\r\n</p>\n<p>It was for me, friend. </p>\n<p>May the hunt be everlasting and may nature guide you home.\r\n</p>\n\n<p>Cover art created using Public Domain images from these sources</p>\n<p>https://www.nga.gov/collection/art-object-page.177979.html</p>\n<p>https://www.artic.edu/artworks/146701/mountain-brook</p>\n<p>Moon credit from NASA/Bill Dunford<br/></p>", "metacritic": null, "released": "2023-04-06", "tba": false, "updated": "2023-04-07T08:52:22", "background_image": "https://media.rawg.io/media/screenshots/a1c/a1cdacdd73bb172e28d62dac9b21d47e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Nenekiri"], "genres": [], "publishers": [], "esrb_rating": null}