{"id": 95266, "slug": "glitchrunners-demo", "name": "Glitchrunners Demo", "name_original": "Glitchrunners Demo", "description": "<p>\n<br/>\n</p><p>\n<strong>Glitchrunners</strong> is an asymmetric local multiplayer game that uses second-screen technology to create a chaotic and exciting experience.\r\n</p><p>\r\n\tUp to four players, using a PC/Mac, run an action-packed side scrolling 3D gauntlet, contending with treacherous team mates, hair-raising hazards and a whole lot of explosions.\r\n</p><p>\r\n\tA final player takes on the role of the \r\n\t<strong>Architect</strong> – and uses a second screen to dynamically control the game environment itself. With the world at their fingertips, the Architect can collapse buildings, throw countless objects, and unleash mind bending special powers in real time as they attempt to stop their friends.\r\n</p><p>\n<strong>Glitchrunners is now LIVE on Steam </strong>and available for pre-purchase from <strong>Greenman Gaming with a 15% launch discount! </strong>Glitchrunners will be launching on the <strong>8th of April, 2016!</strong>\n</p><p>\n<br/>\n</p><p>\n<br/>\n</p><p>\n</p><p>\r\n\tThe \r\n\t<strong>Glitchrunners</strong> demo features two different game modes for you and your friends to try.\r\n</p><ul>\n<li>Battle it out for the Powercube in <strong>Glitch Run</strong>, connecting two PC/Macs for a truly unique local multiplayer experience. Join the <strong>Glitchrunners</strong> in their attempts to overcome the architect and each other in the struggle to escape with the loot before its too late - or take control of the Architect and unleash your awesome powers as you teach the Glitchrunners a lesson they'll never forget!</li>\n</ul><ul>\n<li>Keep the action to a single screen in <strong>Arena </strong>mode, as you settle old scores and start new ones! With <strong>Deathmatch, King Of The Hill </strong>and <strong>Power</strong><strong>cube </strong>match types, there'll always be time for one more game.</li>\n</ul><p>\r\n\tWe're always on the lookout for bugs and feedback, so be sure to get in touch and let us know what you think!\r\n</p><p>\n<br/>\n</p><p>\r\n\tTorque Studios are a \r\n\t<strong>BAFTA-nominated independent team from Manchester</strong>, UK that was formed after winning Dare To Be Digital 2014. They specialise in innovative use of new technology to create fun, accessible and unique game experiences.\r\n</p>", "metacritic": null, "released": "2016-02-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e94/e94a8eaa42a7e2e7ca0e8afe59bfed08.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 258, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Torque Studios"], "genres": ["Action"], "publishers": [], "esrb_rating": null}