{"id": 95284, "slug": "paper-dungeons-crawler-demo", "name": "Paper Dungeons Crawler Demo", "name_original": "Paper Dungeons Crawler Demo", "description": "<p>PDC is a True classic 16 bits Roguelike, with real challenge and deep gameplay, a unique specialization system and draw-to-cast spells.</p>\n<p>This is a sequel of our first game Paper Dungeons, a few years later in the same realm.</p>\n<p>Explore the mysterious Dungeons of Cyndaria and unearth an extensive lore. A plethora of creatures and magical items are waiting for you to step into ever-changing dungeons, with diverse biomes and challenges.</p>\n\n<p>Defeat Dragon bosses to unleash hidden runes and recover the sacred Seeds of Cyndaria to restore the divine trees.</p>\n<p>Dungeons can be unforgiving: be sure to eat and rest in time, use all your abilities wisely.</p>\n<p>Nothing stops you from skipping bosses to rush and move to the next dungeon, but you’ll also meet true death if you don’t take time to level up your character and abilities.</p>\n<p>Make your character unique, based on your gameplay: do you prefer shooting arrows with your warrior? Just use your bow more often, and your “Ranged weapons” specialization will level up twice faster if you chose the talent \"Hunter\" when rolling your character.</p>\n<p>Our game is similar to classic roguelike such as Nethack, enhanced with a modern inventory and an intuitive fast access to melee, ranged or spell casting.</p>\n<p>Life and mana gradually refill after several turns, but you can choose the faster way by sleeping, which consumes precious food.</p>\n\n<p>FEATURES:<br/>Permadeath, turn by turn gameplay, runecast system, hunger, random levels with predetermined land patches on each floor, 200+ equipment pieces to loot, cursed items and enchanted items, extensive inventory system, random potions, scrolls... and so much more to discover! The better to handle all situations.</p>\n<ul><li>4 Biomes (with caves and dungeons)</li><li> 60 creature types</li><li> 120 unique items</li><li> 5 classes</li><li> 9 specializations to level up: One-handed weapons, Two-handed weapons, Ranged weapons, Thrown weapons, Rune type 1, 2, 3, 4, Appraisal.</li><li> 6 talents (natural gifts that help your specializations level faster): Champion, Heavy, Hunter, Ninja, Runic, Merchant.</li><li>5 Bosses</li><li> 25 randomized dungeon floors to beat</li></ul>\n\n\n<p> 5 CLASSES that can master 4 class-related rune types:<br/></p>\n<ul><li>WARRIOR: Justice, Fury, Dark, Draconic\r\n  </li><li>ARCHER: Elfic, Sylvan, Wind, Drownic\r\n  </li><li>PRIEST: Life, Death, Nature, Chaos\r\n  </li><li>MAGE: Fire, Water, Air, Earth\r\n  </li><li>THIEF: Ninjutsu, Poison, Shadow, Robbery\r\n  </li></ul>\n<p>9 SPECIALIZATIONS (that level based on your gameplay):</p>\n<p>One-handed weapons, Two-handed weapons, Ranged weapons, Thrown weapons, Rune type 1, 2, 3, 4, Appraisal.</p>\n<p>6 TALENTS (natural gifts that help your Specializations level twice faster):<br/>Champion, Heavy, Hunter, Ninja, Runic, Merchant. </p>\n<p>Our characters have a cheerful design, each drawn pixel by pixel and animated with love. We try to bring as much diversity as possible, while maintaining a coherent art style and screen visibility.</p>\n<p> </p>\n\n\n\n<p>Paper Dungeons Crawler is released on Steam Early Access for PC, Mac and Linux.</p>\n<p> Minimum Requirement : Windows XP - DirectX9 - 512Mo Ram</p>\n<p>Steam Page: http://store.steampowered.com/app/754340/Paper_Dungeons_Crawler/<br/></p>\n<p>Sign up to our mailing list at http://paperdungeonscrawler.agentmega.net/ to stay up to date.<br/></p>\n<p>Follow us on Facebook: https://www.facebook.com/paperdungeonscrawler/\r\n Twitter: https://twitter.com/agent2mega\r\n Instagram: https://www.instagram.com/agent.mega/\r\n  </p>\n<p>Devlog: https://forums.tigsource.com/index.php?topic=64161.0<br/></p>\n<p> \r\n  </p>\n<p>Thanks for taking the time to check out Paper Dungeons Crawler.\r\n  </p>\n<p><strong> GAME TRAILER:</strong></p>\n<p><strong>GAMEPLAY VIDEO:</strong>\n</p>\n\n<p> <br/></p>\n<p><strong>TEAM:</strong>\n</p>\n<p>Coding &amp; Design: Stephane Valverde.\r\n Arts: Leslie Inthavong.\r\n  </p>\n<p> </p>", "metacritic": null, "released": "2018-04-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e4a/e4a0d65acf753b56bf2dd204cb7fefa6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["paifu"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}