{"id": 952979, "slug": "speed-racer-itch-carmenw12345", "name": "Speed Racer (itch) (CarmenW12345)", "name_original": "Speed Racer (itch) (CarmenW12345)", "description": "<p>In <strong>Speed </strong><strong>Racer</strong>, you take on the role of a skilled driver in a high-speed race against time. Your objective is to collect enough scores to earn a spot on the leaderboard by collecting as many scores as you can while avoiding obstacles and using strategic speed boosts.</p>\n<p>The game takes place on a challenging track filled with twists and turns, obstacles, and power-ups that can help or hinder your progress. The timer is constantly ticking down, adding a sense of urgency to the race. If you fail to complete the required number of laps before the time runs out, you lose the game.\r\n</p>\n<p>One of the key mechanics in Speed Racer is the ability to speed up or slow down your car by crossing special mechanics on the track. These mechanics can either give you a boost or decrease your speed, depending on which type you hit. You'll need to use these mechanics strategically to navigate the track and stay ahead of the competition.\r\n</p>\n<p>To win the game and earn a spot on the leaderboard, you'll need to master the art of strategic driving, avoiding obstacles, hitting the right mechanics, and using power-ups effectively. With addictive gameplay, challenging levels, and exciting power-ups, Speed Racer is the ultimate racing game for players who love fast-paced challenges.<br/></p>", "metacritic": null, "released": "2023-04-05", "tba": false, "updated": "2023-04-07T11:51:08", "background_image": "https://media.rawg.io/media/screenshots/d19/d19f746c7bc6f3eaf35dbeca87427189.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["CarmenW12345"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}