{"id": 952967, "slug": "aladdin-of-the-forsaken-lands", "name": "Aladdin of the Forsaken Lands", "name_original": "Aladdin of the Forsaken Lands", "description": "<strong>Aladdin of the Forsaken Lands</strong> is a retro rpg which offers a novel take on the classic Arabian Nights tale. Six unlikely allies will join together to uncover an ancient artifact and prevent their kingdom from falling into the wrong hands...<h3>NARRATIVE</h3>Aladdin is a thief and adventurer who was found near the border of the Forsaken Lands. Forced to become a prisoner, he is joined by Inaya, a cloaked woman with a hidden past, and Altair, a guardsman who watches over yet cares for the prisoners in his stewardship. However, when the group discovers a strange woman named Sena, Aladdin's goal of escaping servitude begins to evolve into something grander...<h3>ROMANCE &amp; PARTNERSHIPS</h3>When resting, the various party members can be conversed with, nurturing bonds which may grow into either romances or a partnerships. Different endings can be played out depending on the romantic interest or chosen partner.<h3>ATB COMBAT</h3>The ATB (Active Time Battle) system made famous in various retro rpgs makes a return, seeing characters' turns arrive as time passes with aggressive enemies who will attack even as a move is being selected. A \"Wait ON\" option can be toggled to prevent the enemy from attacking while a move is being selected, allowing the player to decide how frantic they'd like their combat encounters to be.<br/><br/><br/><br/>This game is a collaboration between:<br/>TheCrimsonBulb - Project Lead, Pixel Artist, Writer, Designer<br/>Wojtek Kielar - Composer<br/>Mari - Portrait Illustrator, General Illustrations", "metacritic": null, "released": "2023-04-05", "tba": false, "updated": "2023-11-17T09:45:31", "background_image": "https://media.rawg.io/media/screenshots/475/475330a196b00656c9e62a9278ac6fd6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mari", "CrimsonBulb", "Wojtek Kielar", "ManOfStories", "TheCrimsonBulb"], "genres": ["Adventure", "RPG"], "publishers": ["TheCrimsonBulb"], "esrb_rating": null}