{"id": 953122, "slug": "standonlyone", "name": "standonlyone", "name_original": "standonlyone", "description": "<p>it's a mugen like game for more information:</p>\n<p>hello!</p>\n<p> the stand only one!\r\n</p>\n\n<p>Stand Only One is a fighting game where users can create <strong>their own</strong> characters!\r\n</p>\n<p>It's one of the few fighting games released on mobile, and it's great that you can even create characters!\r\n</p>\r\ngame mode\r\n\r\n<p>game mode is\r\n</p>\n<p>training mode\r\n</p>\n<p>vs AI mode\r\n</p>\n<p>AI vs AI mode\r\n</p>\n<p>team battle mode\r\n</p>\n<p>arcade mode\r\n</p>\n<p><strong>online mode</strong>\n</p>\n<p>In this way, there are 6 modes in total!\r\n</p>\n<p>Let's explain each mode\r\n</p>\n<p>Training Mode: A mode mainly for checking character skills and practicing combos\r\n</p>\n<p>vs AI Mode: A mode where you randomly select an opponent and face off against artificial intelligence.\r\n</p>\n<p>AI vs AI Mode: A mode\r\n</p>\n<p>Team Battle Mode: Playable 1P and AI vs. two AI mode\r\n</p>\n<p>Arcade Mode: A mode in which you clear the stages one by one with the character you choose.\r\n</p>\n<p>Online Mode: Mode where you and your opponent play multiplayer with each other's characters\r\n</p>\n<p>\n</p>\n<p>You can see it like this!\r\n</p>\n<p>\n</p>\r\noption\r\n\r\n<p>In the options, you can adjust the size of the game's BGM and sound effects, change the basic game mode (normal, tag, helper) and number of rounds, change the default online nickname, move to cafes, hide ads, and adjust latency. !\r\n</p>\n<p>Here, latency can be set for optimization in multi, but adjust latency (waiting time) appropriately according to your internet speed!\r\n</p>\n<p>For example, if your internet speed is fast, you should set the latency low, and if it is slow, set it high.\r\n</p>\n<p>\n</p>\r\nreplay\r\n\r\n<p>Replays literally replay the version you played!\r\n</p>\n<p>Every time you play the game, it is automatically saved, but there is no need to worry as the capacity is small!\r\n</p>\n<p>Mods that support replay\r\n</p>\n<p>vs AI mode\r\n</p>\n<p>AI vs AI mode\r\n</p>\n<p>team battle mode\r\n</p>\n<p>online mode\r\n</p>\n<p>Here it goes!\r\n</p>\r\ncharacter creation\r\n\r\n<p>As I briefly mentioned above, it was said that users can create their <strong>own characters!</strong>\n</p>\n<p>If you run SOnOne\r\n</p>\n<p>PLAY EDITOR\r\n</p>\n<p>You will see an option like this, right click and you will be taken to the editor!\r\n</p>\n<p>To create a character, click 'create' in the menu below (create, edit, close) and a new character will be created with a new chr file!\r\n</p>\n<p>For detailed information on how to make a character, go to the 'Crafting Course/Tips Bulletin Board' in the Stand Only One official cafe linked below, and you can get information on how to make it!\r\n</p>\n<p>(Oh, by the way, when signing up for a cafe, be sure to read the cafe rules!)\r\n</p>\r\ndigression\r\n\r\n<p>hmm....\r\n</p>\n<p>First of all, I hope that more people will know this game by introducing it like this first!\r\n</p>\r\nscreenshot\r\n\r\n\n<p>For reference, I made the blue dragon by taking a dot myself.\r\n</p>\n\n<p>\n</p>\n\n<p>also official discord:https://discord.gg/KMztSM7jSr</p>", "metacritic": null, "released": "2023-04-04", "tba": false, "updated": "2023-04-07T12:47:32", "background_image": "https://media.rawg.io/media/screenshots/5a1/5a110d9b91a01375c5a787a6800d5ea0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["finnjake"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}