{"id": 95313, "slug": "a-tale-of-toys-and-terrors", "name": "A Tale of Toys and Terrors", "name_original": "A Tale of Toys and Terrors", "description": "A note from the Creative Director...<p>When I was a kid, like many others, I enjoyed playing with toys. They brought me comfort and understanding in a world filled with uncertainty and fears. A Tale of Toys and Terrors is a love letter to those times, and to kids who have ever felt the same way, and looked to toys for protection - that there was something deeper going on when the lights went out at night.<br/><br/>A Tale of Toys and Terrors is a 2.5D Turn-Based Tower Defense and Card Game hybrid. In it, you play as a toy who is in charge of a toy army, defending a sleeping child at night against a monster that comes from the closet. The game explores the themes of the maturation of fears over time.</p><br/>Features<ul><li>An exploration of the human psyche for PC! </li><li>Beautiful, hand-drawn animations and images!</li><li>5 Levels of Fears!</li><li>...combined with Tower Defense mechanics from games like Bloon's Tower Defense...</li><li>Toys throwing themselves at Terrors so that you won't have a nightmare at night.</li><li>Hearthstone-inspired simple Card System...</li></ul>Audience<p>Those who like strategy and simple-to-pick-up card games. Also, people who enjoy stories about the psyche of the human mind.<br/>And for people who have always wanted to be a stuffed toy bunny.</p>What other games is your game like, and how is it new and different?<p>The game is like a combination of Hearthstone and Bloon's Tower Defense. The building system is like the card system of Hearthstone, where you drag cards and spend resources to play them on spaces, and the battle system is like most tower defenses, notably Bloon's Tower Defense. The innovations are that the battles are turn-based, and instead of fighting against waves of enemies, the player has to fight against giant bosses.</p>Platform<p>PC</p>website<p> ataleoftoysandterrors.com</p>", "metacritic": null, "released": "2016-06-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f5b/f5b11647e1a7ba80280617536a4189b5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AToTaT_Admin"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}