{"id": 95314, "slug": "lost-wing-itch", "name": "Lost Wing (itch)", "name_original": "Lost Wing (itch)", "description": "<p><strong>We're launching with an updated version of Lost Wing on Steam in November 2017!We've removed downloads and payment options from this page. We will be providing Steam keys to all those who purchased here on Itch.io</strong></p>\n<p>\r\n\tLost Wing is a fast-paced, procedurally structured, endless arcade game, with a Neon Sci-Fi aesthetic. Quick to learn, hard to master - you'll need quick reaction times and super-fast decision making to achieve a high score on the global leaderboards.\r\n</p>\n<p>\r\n\tSwerve around or jump over obstacles, slow down time when it's getting a little too close for comfort - just get ready for when the world goes for a spin!\r\n</p>\n<p>\r\n\tHave a close shave with an obstacle and you may be lucky and escape with only losing a wing, but hit an obstacle head on and it's game over. Health pickups are available in the environment to help you gain your wings back (and your full steering strength).\r\n</p>\n<p>\r\n\tDownload for Windows or MacOS, and delve into the world of Lost Wing - where one false move can end in disaster!\r\n</p>\n<p>\n<br/>\n</p>\n<p>\n</p>\n<ul>\n<li>Endless, procedural gameplay</li>\n<li>Intense speed</li>\n<li>Neon Sci-Fi visuals</li>\n<li>Powerups</li>\n<li>Global leaderboards</li>\n<li>Daily Challenge</li>\n</ul>\n<p>\n<br/>\n</p>\n<p>\n</p>\n<p>\r\n\tSpeed of delivery for the roadmap is entirely dependant on the amount of people purchasing Early Access, funding us to be able to dedicate more development time to the project.\r\n\t<br/>\n<br/>\r\n\tOur roadmap is available as a public trello board, here: \r\n\tLostWing Roadmap\r\n</p>\n<p>\n<br/>\n</p>\n<p>\n</p>\n<p>\r\nWe are a team of three, with one programmer/designer and two artists. Between us we have experience working on multi-million dollar projects with companies such as Sony, BBC, THQ and Rare.\r\n</p>\n<ul>\n<li>Website: http://www.boxfroggames.com</li>\n<li>Twitter: http://www.twitter.com/boxfroggames</li>\n<li>Facebook: http://www.facebook.com/boxfroggames</li>\n<li>Mail: lostwing@boxfroggames.com</li>\n</ul>", "metacritic": null, "released": "2016-09-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d32/d32e78a273148292b8243d0cd367b55e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BoxFrogGames"], "genres": ["Action", "Racing"], "publishers": [], "esrb_rating": null}