{"id": 953577, "slug": "grimdark-terrain-essential-pack", "name": "GrimDark Terrain (Essential Pack)", "name_original": "GrimDark Terrain (Essential Pack)", "description": "<p>GrimDark Terrain (Essential Pack) is a set of about 350 x .STL files (prepared for 3D printing on FDM and Resin printers). <br/>You can easily use this set with miniatures that are in 28-32mm scale (cyberpunk, grimdark, sci-fi tabletop wargames).  <br/>The above application was created to illustrate the complex nature of the GrimDark Terrain (Essential Pack) kit, which will allow you to expand your tabletop wargames architecture to the next level of complexity. You can tour the entire area, carefully tracing the details found on various pieces of architecture and objects. Keep in mind that the architecture composition shown in the application is just one of many you can build thanks to the set of 350 x .STL files that make up GrimDark Terrain (Essential Pack).<br/></p>\n<p>GrimDark Terrain (Essential Pack) was developed using Unreal Engine 5, and uses both Nanite and Lumen (Real Time Global Illumination) technologies. If you have an old computer with a weak graphics card - you will most likely not run the above application.</p>\n<p>Navigation: <br/>Keyboard - (W, A, S, D, Q, E) - Movement<br/>Mouse - Look<br/>F11 - Toggle between Full Screen On/Off <br/>Resolution change possible only in Windowed Mode.</p>\n<p>Notice:<br/>The file is completely free of viruses and all kinds of spyware, etc. It was scanned with BitDefender Total Security antivirus software.<br/></p>", "metacritic": null, "released": "2023-04-03", "tba": false, "updated": "2023-04-07T16:03:15", "background_image": "https://media.rawg.io/media/screenshots/089/08904467b251bfa9343a49561e91bd05.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 538, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TrigonumVR"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}