{"id": 953687, "slug": "the-opportunity", "name": "The Opportunity", "name_original": "The Opportunity", "description": "<p><strong>CONTEXT:</strong>\n</p>\n<p>I was not sure if this game truly needed to be released onto my itch page. It feels odd and personal, which, fair enough, was the main goal to start with. However, people around me seemed to think it had its place here as well, and with the occurring events in my personal environment, it might be the ideal time to finally give it a place on here.\r\n</p>\n<p>This is an experience game made for a school task where I needed to design the gameplay to reflect a specific emotion and experience.\r\n</p>\n<p><strong>PRACTICAL INFO:</strong>\n</p>\n<p>Download the zip file, extract it, and find the executable called \"ItIsHardToTell\".\r\n</p>\n<p>You will mainly interact by using your computer mouse: clicking and dragging items.\r\n</p>\n<p><strong>WHAT IS IT ABOUT?</strong> (Might spoil bits of the experience)\r\n</p>\n<p>Showing appreciation towards the people we care for can feel needlessly scary. Telling someone you love them is hard and is constantly associated with a position of true weakness. Could it be that this has impacted the way we use these words towards our friends and family, feeling uncomfortable telling them we love them ?\r\n</p>\n<p>In a romantic context, this fear and idea of weakness can feel absurdly greater. However, how hard it might feellike, there is never much nor anything to lose. And even if there is, doing nothing is already accepting the \"worst\" case scenario without even knowing what is truly going on inside the beloved one's emotional fort.\r\n</p>", "metacritic": null, "released": "2023-04-03", "tba": false, "updated": "2023-04-07T16:51:32", "background_image": "https://media.rawg.io/media/screenshots/2d9/2d9c9129d76186c26e14ac63483e2ce9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lord_Vizenco"], "genres": [], "publishers": [], "esrb_rating": null}