{"id": 953746, "slug": "maze-adventure-kelver-figueiredo", "name": "Maze Adventure (Kelver Figueiredo)", "name_original": "Maze Adventure (Kelver Figueiredo)", "description": "<p>A ideia hoje vai ser de um jogo de labirintos, com gráficos parecidos com o de um RPG Pixel Art e câmera isométrica.</p>\n<p>A narrativa acompanha Leon, um humano escolhido pelos deuses para participar de um desafio que consiste em recuperar os cristais da luz que estão ao final de uma série de labirintos que precisam ser superados.   </p>\n<p>A história começa quando por mero capricho, os deuses decidem tirar a luz de todo o mundo. Tudo não passou de uma grande aposta que existia entre si de tempos em tempos, em que eles escolheram um humano aleatório no mundo, que desviava de vencer uma série de desafios, e se chegasse ao final, recuperaria essa luz.\r\n  </p>\n<p>Uma parte dos deus apostava no sucesso daquele humano, mas outra parte apostava no fracasso.\r\n  </p>\n<p>Aquilo era um esporte pra eles! Em cada momento da história o desafio era diferente, e nesse nosso contexto, os desafios seriam labirintos.   </p>\n<p>O humano escolhido da vez era Leon, que por algum motivo havia sido tirado de seu cotidiano e foi transportado para uma espécie de salão, cheio de portais. Lá ele recebe as instruções do que precisa ser feito, e o jogo começa a partir daí.  \r\n  </p>\n<p>Nosso personagem, mesmo relutante, acaba cedendo ao capricho dos deuses, e aceita tal desafio. O objetivo é chegar ao final de cada labirinto, antes que o tempo acabe, e recuperar cristais, que quando unidos, ao final de todos os labirintos, traz a luz de volta ao mundo.   </p>\n<p>Mas será que as coisas vão acontecer assim mesmo? </p>\n<p>Só jogando para saber...</p>\n<p>Quanto a jogabildiade, o game terá mecânicas simples de movimentação, e o objetivo é chegar ao final de cada labirinto antes do tempo acabar.   </p>\n<p>Quanto aos cenários, tudo será em câmera isométrica, com gráfico em pixel art, e cada labirinto possui características e personalidades distintas e aleatórias.   </p>\n<p>A trilha sonora deve acompanhar as características de cada labirinto, e sua intensidade deve acompanhar os acontecimentos do roteiro.   </p>\n<p>A maior inspiração quanto aos gráficos e o estilo de movimentação, é o jogo To The Moon, da Freebird Games. A inspiração quanto a ideia dos desafios, são os filmes da franquia Maze Runner. \r\n</p>", "metacritic": null, "released": "2023-04-03", "tba": false, "updated": "2023-04-07T17:14:15", "background_image": "https://media.rawg.io/media/screenshots/450/45081cccd512e7daf13f23c8447a11a4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kelver Figueiredo"], "genres": ["RPG", "Puzzle"], "publishers": [], "esrb_rating": null}