{"id": 953709, "slug": "autistic-trans-person-living-in-the-us-the-game", "name": "Autistic Trans Person Living In The U.S (THE GAME)", "name_original": "Autistic Trans Person Living In The U.S (THE GAME)", "description": "<p>WARNING: THIS GAME WAS NOT MADE TO DISCRIMINATE OR INSULT ANYONE.</p>\n<p>THIS IS A HARMLESS JOKE THAT STARTED WITH ONE TIK TOK STITCH </p>\n\n\n<p>SEXY ARTHUR MORGAN</p>\n\n<p>Flashing lights (lights) Flashing lights (lights) Flashing lights (lights) Flashing lights (lights) She don’t believe in shooting stars, but she believes in Dutch and plans (Can I have money mister). With horse and a new camp, Robbery get us to Tahiti .You more like report to law shit ! I’m more of the, stick Van Der Linde, Big money, helping camp, running from the lawmen. While we go ahead and shoot some O’Driscolls . And the money so easy, man why can’t Dutch always be this easy .Always making plans but we always super far away. John running off like, where are you Marston.  And I tried to reason with Dutch, but I get caught with the Pinkertons  Damn, diesel on a dime. As I recall I know you like to show off, but I never thought that you would rat to the law What do I know? (Flashing lights) What do I know? [Flashing lights (lights)] Know Flashing lights  Flashing lights  Flashing lights Flashing lights (lights x7) </p>\n\n<p><strong><em>\n</em></strong></p>\n<p><strong><em>Assets by Running with Scissors </em></strong></p>", "metacritic": null, "released": "2023-04-03", "tba": false, "updated": "2023-04-07T16:59:05", "background_image": "https://media.rawg.io/media/screenshots/592/592e0873d3237e1720d8d07cc5e17028.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LeviticusCornwall"], "genres": [], "publishers": [], "esrb_rating": null}