{"id": 953734, "slug": "relic-of-light", "name": "Relic of Light", "name_original": "Relic of Light", "description": "<p>Welcome to our survival game, where you are a child trapped in a terrifying nightmare. To escape, you must survive and save the sacred relic that is the only key to your freedom. However, this relic is vulnerable to darkness and needs to be protected from the shadow that surrounds it.</p>\n<p>You are the main character in the game, and you must face many challenges in order to survive and escape the nightmare. The relic of light is the only hope for you to return to the real world, and to do this, you must find your way to the sun, taking the relic along with you.</p>\n<p>The game features several levels, each more challenging than the last. You must find a way out of each level, dealing with the shadow that tries to get hold of the relic of light and ruin your chance of escape. You will need to race against shadowy monsters while trying to protect the relic of light.</p>\n<p>But beware, the shadow is cunning and dangerous, so you must be quick and clever to outrun it. </p>\n<p>This survival game will be an exciting challenge for anyone who enjoys adventure and horror games. Are you ready to face your fears and fight for your freedom? Then join us on this journey to escape the nightmare and protect the relic of light!<br/><br/><strong>Dev's</strong></p>\n<p>Arthur Randolpho - Art 2D - instagram.com/arthur.randolpho/<br/>Gabriel Andrade - Art 3D - instagram.com/gabrielandradearc.3d/<br/>Guilherme Martins - Developer - linkedin.com/in/guilherme-martins-b97930b6/<br/>Guilherme Santos  - Art 3D - instagram.com/guimedeirossantos/<br/>Pedro Bearari - Animator 3D - twitter.com/Pedro_bearari<br/><br/><br/></p>", "metacritic": null, "released": "2023-04-03", "tba": false, "updated": "2023-04-07T17:09:06", "background_image": "https://media.rawg.io/media/screenshots/7d2/7d28a7c20a3bb5dbe00adb817ce7ddf5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Guilherme Martins"], "genres": [], "publishers": [], "esrb_rating": null}