{"id": 953800, "slug": "suffering-sacrifice", "name": "Suffering & Sacrifice", "name_original": "Suffering & Sacrifice", "description": "Suffering and Sacrifice\r\n<p>A game where you willingly disable yourself to power up. Mobs mostly can't hurt you since you are powered up, but debuffs are still afflicted.  Made for the Mac Game Jam with the theme: \"Risk vs. Reward\".</p>\r\nControls\r\n<p>I would like to say that in the beginning you are given the liberty of sane character controls, which will be listed below. Well until you make the sacrifice<br/></p>\n<p>WASD for movement.</p>\r\n\r\nNote: S allows you to drop through platforms.\r\n\r\n<p> E to interact.</p>\n<p>Remember: The game is about suffering. Part of that is figuring out the controls.<br/></p>\r\nHow to Play?\r\n<p>It would have been more fun if the enemies were more interesting or if I could have gotten attack mechanics and health into the game. But I guarantee it can be fun to play. Allow me to explain how.<br/></p>\n<p>Find yourself a timer (on a phone works well) and maybe a friend. Then you race to see how long it takes you to figure out the keymap and complete the game, play with other people I highly recommend. <br/></p>\r\nHow to win?\r\n<p>The game consists of four levels. On each level, there are holes/ways off the map that will take you to previous levels or the next level. <br/></p>\n<p>The order is as follows:</p>\n<ol><li> Farm Place</li><li> Blue Cave</li><li> Green Cave</li><li> Red Cave</li></ol>\r\nTo win you need to exit the red cave and go into the light.  Time your first run-through to compare with other people.<br/>\r\nSlow load times?\r\n<p>The only suggestion I have to offer you is to either change your browser or operating system. I tested the load speed of this game on only two computers: a 5-year-old Macbook Air running an outdated version of macOS using firefox, and a year-old laptop with windows using chrome.<br/><br/>Unfortunately, the chrome version loaded in ~1.5s and the firefox version took ~1m30s which was an L for freedom and firefox but oh well. Most likely the browser is the problem, though as long as you're using a sane browser the game will load eventually.</p>", "metacritic": null, "released": "2023-04-03", "tba": false, "updated": "2023-04-07T17:35:43", "background_image": "https://media.rawg.io/media/screenshots/bba/bba0e5bc72dfebf5271895ad7182c210.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["GenericConfluent", "AwkwardTobi"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}