{"id": 953858, "slug": "stationary-itch", "name": "Stationary (itch)", "name_original": "Stationary (itch)", "description": "CS 491 Spring 2023 - Team 2 Phase 2 (Playtest 1)\r\n\n<p>Stationary is a 3D first-person puzzle game. Some phenomenal cosmic power has inflicted critical damage to your space station. All systems are down so you must manually prepare the escape pod to get off the space station before it’s too late. Solve word puzzles to deduce the correct code to input into the terminal before launching the escape pod and getting off the ship.</p>\n\r\nControls:\r\n<p><em>WASD</em> to move</p>\n<p><em>Mouse </em>to look<br/></p>\n<p><em>Left-Click</em> to interact</p>\n<p><em>Right-Hold </em>to shoot water<br/></p>\n<p><em>Esc</em> to quit</p>\n\r\nQuestions:\r\n \r\n<ol><li>What do you think of the puzzles? Too difficult or too easy?</li><li>What types of puzzles would you like to see added? (More interaction/exploration?)</li><li>How did you feel about the oxygen meter? (Balanced? Too slow? Dynamic with player movement and fire?)<br/>\n</li><li>How did you feel about the fire/extinguisher?</li><li>What did you think of the pace/length of the game?</li><li>What did you like about the game? </li><li>What did you dislike about the game? </li><li>What could be improved or added to enhance the overall gameplay?</li></ol>\r\nNotes:\r\n \r\n<p>We have plans to include an additional puzzle element that will involve opening doors in such a way as to not block yourself in. Additionally, there will be more puzzles in the next iteration of the game (we are planning on including at least 3 puzzles in the final game). The level design was made very simple for this playtest but there will be more intricate puzzles and room design later on.</p>\n<p>The countdown timer for the launch button hasn't been implemented yet either but will be included in future versions of the game. Also, the fire extinguisher object was not added as an interactable object yet, so the player has access to the water at all times.</p><p>There are still some bugs with the game so let us know what you find.</p>", "metacritic": null, "released": "2023-04-03", "tba": false, "updated": "2023-04-07T17:58:58", "background_image": "https://media.rawg.io/media/screenshots/272/272fa6736e5b4140f29447d2a84737f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["awvz"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}