{"id": 9538, "slug": "thehunter-call-of-the-wild", "name": "theHunter: Call of the Wild", "name_original": "theHunter: Call of the Wild", "description": "<p>theHunter: Call of the Wild offers the most immersive hunting experience ever created. Step into a beautiful open world teeming with life, from majestic deer and awe-inspiring bison, down to the countless birds, critters and insects of the wilderness. Every inch of the 50-square mile world is crafted using Apex, award-winning technology crafted by Avalanche Studios during a decade of developing explosive action games. In addition to its rich single player experience, theHunter: Call of the Wild offers unique multiplayer options – cooperative and competitive – for up to 8 players. Share the ultimate hunting experience, and earn those bragging rights!KEY FEATURES:<br />\nA Next-Generation Hunting Experience.<br />\ntheHunter: Call of the Wild offers the most immersive hunting experience ever created. Step into a beautiful open world teeming with life, from majestic deer and awe-inspiring bison down to the countless birds, critters and insects of the wilderness.<br />\nExperience complex animal behavior, dynamic weather events, full day and night cycles, simulated ballistics, highly realistic acoustics, scents carried by a sophisticated wind system, and much more. All systems work together to increase immersion and bring out the hunter in you.<br />\nExplore a Vast Open World. By Foot or ATV.<br />\nExplore 50 square miles of varied terrain, ranging from wetlands and dense forests to lush valleys and open farm fields. The vast world of theHunter: Call of the Wild is split up into separate and distinct hunting reserves, each one filled with surprises and memorable moments.<br />\nTake on missions and challenges from the locals, or go off the beaten path. Discover lookouts, hunting towers and outposts. Tired of walking between your hunts? Get the ATV Saber 4x4 (optional paid DLC) and drive around! This capable vehicle will carry you across rough terrain at breakneck speeds. Exploring the open world has never been more fun.<br />\nA Decade in the Making.<br />\ntheHunter: Call of the Wild is the evolution of theHunter, Expansive Worlds’ stand-out hunting game, with over 6 million registered players and 7 years of live operations.<br />\nAvalanche Studios and Expansive Worlds bring hunting to a new generation of players. theHunter: Call of the Wild is built using Apex – Avalanche Open World Engine, award-winning technology crafted during a decade of developing explosive action games.<br />\nBecome a Hunter. Design the Hunt.<br />\nAcquire and equip a range of rifles, handguns and bows and customize them with scopes and different ammunition types. Find and master your favorites. Practice and steady your aim at the shooting range. Develop your character by unlocking various skills and equipment. Learn how to use callers and scents, but above all else, study your prey: pay close attention to animal behavior, traits and patterns of movement.<br />\nNew to hunting? Not a problem. Intelligent systems will aid and assist to make sure you get the most out of your hunt, whether you’re a hopeful novice or grizzled veteran.<br />\nShare Hunting Experiences. Earn Bragging Rights.<br />\nIn addition to its rich single player experience, theHunter: Call of the Wild offers unique multiplayer options. Join up to 8 friends (or complete strangers!) in cooperative and competitive modes. Enjoy a wide range of in-game challenges and events. Hunting is more rewarding and exciting with friends, so share your experiences and earn those bragging rights.<br />\nHead out with your friends using ATVs. Moving between hunting spots on four wheels is fast, easy and most importantly – a lot of fun. Besides, after a long day of hunting, no one is going to turn down your invitation for an impromptu off-road race!</p>", "metacritic": 74, "released": "2017-02-16", "tba": false, "updated": "2024-03-13T20:06:53", "background_image": "https://media.rawg.io/media/games/e6f/e6fed89f004972a1967e181fe63e78b0.jpg", "website": "", "rating": 3.46, "rating_top": 4, "added_by_status": {"yet": 109, "owned": 1678, "beaten": 24, "toplay": 29, "dropped": 166, "playing": 18}, "playtime": 4, "achievements_count": 661, "ratings_count": 215, "suggestions_count": 411, "game_series_count": 0, "reviews_count": 218, "platforms": ["Xbox One", "PlayStation 4", "PC"], "developers": ["Expansive Worlds"], "genres": ["Shooter", "Adventure", "Simulation", "Sports"], "publishers": ["Astragon Entertainment", "Avalanche Studios"], "esrb_rating": "Teen"}