{"id": 953951, "slug": "story-of-animal-sprite", "name": "Story of Animal Sprite", "name_original": "Story of Animal Sprite", "description": "Story of Animal Sprite is a causal merge game where you can get better items by merging those of lower levels. More resources and land pieces can be unlocked by merging materials and unlockables, building structures and summoning animals. Once the gameplay loop of production, consumption and building is established, advanced structures will be available to place and build so that the homeland will be more organized and lovely.<br/><br/><br/><br/>Legend has it that in a picturesque beachside wonderland is an age-old Spirit Tree that has been blessing this place since the dawn of time and attracted animals to dwell around it.<br/><br/>One day, a volcano erupted, laying to waste many parts of the land. The inhabitants take actions, deciding to restore the environment and revive their homeland with the help of Purifying Light.<h3>Merging Brings Happiness and Cures OCD</h3>Create a new home and everything is about merging objects to upgrade. Various items are for you to merge. Collecting and organizing will never end.<br/><h3>Manage Resources with Efficient Recycling Loops</h3>A variety of plants and resource-producing structures require constant merging and planning on the go. Make sure that production and building are in tandem with each other to develop the homeland.<br/><h3>Cute Animals Help You</h3>Merging animal balls summons helpers like kittens, bearlings and monkeys to collect stuff for you. Merging animals unlcoks new styles for them to busy themselves in the forest with cuter styles.<br/><h3>Develop a Land of Your Own</h3>A great piece of land can be unlocked part by part as you progress in the game. Merge an assortment of items and structures to develop a land of your own.<br/><h3>Endless Unlockables</h3>Tons of animals, plants and structures for you to unlock and fill the Encyclopedia.<br/>", "metacritic": null, "released": "2023-04-06", "tba": false, "updated": "2023-04-10T03:23:03", "background_image": "https://media.rawg.io/media/screenshots/bd1/bd145e12f671b33506a0867f27ae54ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Alonds"], "genres": ["Casual"], "publishers": ["Alonds"], "esrb_rating": null}