{"id": 953995, "slug": "reflections-of-life-spindle-of-fate", "name": "Reflections of Life: Spindle of Fate", "name_original": "Reflections of Life: Spindle of Fate", "description": "Grandma Studios returns with the newest spell-binding adventure in the Reflections of Life series!<br/>\n<br/>\r\nCountless years have passed since the Spindle of Fate brought chaos and destruction to the worlds, making the artifact little more than a relic…or so you thought. That is until the warlike people it wiped out come back with a vengeance! The Nilds have returned for the Spindle they created, capable of shaping the fates of all the realms. And if they find its parts first, everyone will be at their mercy. Only a Guardian of your caliber can find the fabled keepers of the artifact and stop the Nilds from using their power to wreak devastation! Can you traverse new and challenging lands to save them from ruin in time? Find out in this breathtaking Hidden-Object Puzzle adventure!<br/>\n<br/>\r\nWeave your own fate to save the worlds!<br/>\r\nExperience a vibrant fantasy world of stunning visuals!<br/>\r\nA stirring soundtrack brings a sense of adventure!<br/>\n<br/>\r\nThis is a Hidden Object Puzzle Adventure game, meaning a specific genre of story-driven, point &amp; click adventures. Throughout the game, players are tasked to find a list of objects hidden within a particular scene, and to occasionally complete various mini-games/puzzles.", "metacritic": null, "released": "2023-04-07", "tba": false, "updated": "2023-04-10T04:28:23", "background_image": "https://media.rawg.io/media/screenshots/23e/23e682d408fd4adc2872135a91bb2823.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 554, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Grandma Studios"], "genres": ["Adventure", "Casual"], "publishers": ["Big Fish Games"], "esrb_rating": null}