{"id": 953937, "slug": "holy-catch", "name": "Holy Catch", "name_original": "Holy Catch", "description": "<strong>The game is still in development, don't buy it yet!</strong><br/><br/>You have been sent on your way by your dear grandfather who knows a city where fishermen are desperately needed. Although he didn't tell you that the city also has a dark world.<br/>You'll soon get to know some locals who will help you on your way to becoming a fisherman.<br/>But when you think it's going well, it still goes wrong, the dark world is harder than you would expect.<br/><br/>You can fish in many different types of waters, each containing different types of fish such as sea, lake &amp; river.<br/>By using several types of rods and baits you can catch certain rare fish faster.<br/><br/>Will you survive?<br/><br/>You get your own house.<br/>You can go to other worlds.<br/>Various shops, such as a fish shop, weapon shop, and a bank.<br/>The game contains various kinds of fish, they really exist.<br/><br/>At the beginning of the game you will see a short tutorial on how to play the game.<br/><br/>You can catch 10 different types of fish, we will add more later.<br/>There are 5 different types of enemies, more will be added in the future.<br/>The maps will also be expanded later so that you can discover more.<br/>Plans have also been made to play this game CO-OP with your friends.<br/>The game will also be made available for MacOS and Steamdeck at a later date.", "metacritic": null, "released": "2023-04-08", "tba": false, "updated": "2023-04-10T03:06:26", "background_image": "https://media.rawg.io/media/screenshots/048/0484a427a342fdb4e3ea1f70921ca245.jpg", "website": "https://www.blueplanetgames.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BluePlanetGames"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["BluePlanetGames"], "esrb_rating": null}