{"id": 953922, "slug": "super-space-towers", "name": "Super Space Towers", "name_original": "Super Space Towers", "description": "<p>Super Space Towers is a space 3D physics puzzle action game. You have been tasked with cleaning up the mess left by the aliens&#39; attempts to sabotage the orbital power towers. Contain the orbs, rescue the stranded workers &amp; escape the towers!</p>\n<p>The year is 3721 - Humans have terraformed many worlds across the galaxy using orbital power towers.</p>\n<p>Unfortunately, a discarded floating red car crashed into an alien space station and was traced back to Earth via its vehicle registration plate TSLA 10. The Aliens have been broadcasting a strange warning message continuously ever since the destruction of their space station…</p>\n<p>The message reads:</p>\n<p>‘All Your Base Are Belong To Us’</p>\n<p>Our power towers are now being sabotaged by the Aliens. We need you to go and fix the problems they have caused! Contain the power orbs and rescue the stranded workers.</p>\n<p>Super Space Towers is a space 3D physics puzzle action game. You have been tasked with cleaning up the mess left by the aliens&#39; attempts to sabotage the orbital power towers.</p>\n<p>Contain the orbs, rescue the stranded workers &amp; escape the towers!</p>\n<p>Super Space Towers features over 30 challenging levels that will test your flying and combat abilities. For more seasoned players achieving that best perfect time on a given tower!</p>", "metacritic": null, "released": "2021-06-29", "tba": false, "updated": "2023-11-04T14:29:31", "background_image": "https://media.rawg.io/media/screenshots/47b/47b5e69df8e61974794e61d6c43b1ca6.jpg", "website": "https://www.happy-cactus.com/super-space-towers", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Happy Cactus Games"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Arcade", "Indie", "Puzzle"], "publishers": ["Happy Cactus Games"], "esrb_rating": null}