{"id": 954003, "slug": "exhibitors", "name": "Exhibitors", "name_original": "Exhibitors", "description": "Deep within the clouds of a gas giant, supermassive creatures occupy the sky, each exhibiting an ecosystem.<br/><br/><strong>Exhibitors is a Factory building game with elements of farming and exploration. </strong><br/><br/>Exploring deep within a gas giant, you did not expect to find life beneath the clouds. Upon closer inspection super massive floating creatures called exhibitors can be observed, each holding an ecosystem upon their backs. These ecosystems range widely depending upon the exhibitors' size, material composition and temperature. You decide to explore each of these biomes, learning about the ecosystem and the organisms that inhabit them. As you learn more about them, you decide to begin ranching and farming. Eventually you begin to increase production and efficiency as you continue to research the organisms. This increased production slowly harms the parent creature and its ecosystem. Good thing you can always jump between newer and bigger ecosystems as you find them. <br/><br/><h3>Features:</h3><ul><li><strong>Explore the different worlds.</strong> Each biome has over 10+ plants and animals for you to observe. Each biome/ecosystem is unique in their own way where the plants and animals within them have evolved in their into their own biological niches. Learn about these organisms and understand their behaviors by observing and researching them.<br/></li><li><strong>Be a part of the world.</strong> As you run around and observe these organisms, you stop to take notes and create quick sketches of these plants and animals. The further you observe the organisms, the more detailed these drawings become. The more you get to know these plants and animals, the more you learn about how to utilize them.<br/></li><li><strong>Make the exhibitor your own</strong> Work towards terraforming and controlling the exhibitors. Start with small outposts and slowly move towards megafactories. As you learn and discover new exotic recipes, the production possibilities increase. But be careful, each exhibitor only has a finite amount of resources and a delicate ecosystem. When an ecosystem falls out of balance, the exhibitor may begin to sink into the depths of the planet.<br/></li><li><strong>Venture deep into the planet.</strong> When you venture deeper into the planet, the sizes of the exhibitors increase by the magnitudes. The larger these ecosystems become, the more biodiversity there is. These larger ecosystems provide the energy needed for larger and more niche species to thrive. Possibly increasing the production possibility and unlocking more exotic recipes. <br/></li><li><strong>Make the planet your own</strong> Once you reach a certain level, everything becomes possible. These exhibitors become your world, allowing you to control where they move and how they behave. Create meta-structures to control the temperature, humidity, air composition and more. Eventually you may even be able to create your own exhibitors.</li></ul>", "metacritic": null, "released": "2023-04-07", "tba": false, "updated": "2023-04-10T04:40:09", "background_image": "https://media.rawg.io/media/screenshots/037/0376da7e15a7b5244b4e4d4f63138a13.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Suncats"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Suncats"], "esrb_rating": null}