{"id": 95425, "slug": "towards-the-pantheon-itch", "name": "Towards The Pantheon (itch)", "name_original": "Towards The Pantheon (itch)", "description": "\r\nThe Story\r\n<p>The Sworn Light have been gaining power throughout the world through divide and conquer tactics. While the humans, felines, electropunks, and ghosts argue amongst themselves, <strong>The Sworn Light</strong> are taking advantage of each situation in order to take ultimate control. One day Keltoi village chief <strong>Wuotan</strong> summons his strongest warrior <strong>Freyja</strong> to embark on a long and dangerous journey. Her mission is to trek towards The Pantheon to defeat the source of <strong>The Sworn Light</strong> before the world falls into chaos. Along the way <strong>Freyja</strong> and her party will battle deadly enemies, make new friends, and encountered long forgotten horrors!<br/><br/><br/></p>\r\nThe Game\r\n<p>Towards The Pantheon is a turn based 2D RPG with unique twists on the classic formula. Gone are genre standards of elemental types, elixirs, elves, inns, and generic love stories. Instead players of <strong>Towards The Pantheon</strong> will ride hamsters, journey through a survival horror inspired mansion, collect dead memories, eat copious amounts of sushi, and partake in regular chats around the campfire. <br/></p>\n<p><strong>Features include:</strong><br/></p>\n<ul><li>Over 10 hours of gameplay including sidequests and myriads of secrets.\r\n</li><li>Unlockable NewGame+ mode and cheat codes for additional replay value.\r\n</li><li>Ability to switch between party members in the overworld to use their unique mechanics.\r\n</li><li>An eclectic original soundtrack consisting of over 65 songs which incorporate elements from orchestral, noise, drone, breakbeat, and chiptune genres.\r\n</li><li>A massive fully connected overworld with the ability to ride Speedsters to cut down on backtracking.\r\n</li><li>Turn based combat system where each character has unique battle stats and mechanics.\r\n</li><li>Collectible cards and combos found throughout the world that can be used during battle.\r\n</li><li>More than 10 regions to explore including lush forests, cities full of kitties, electropunk metropolises, barren wastelands, and a dark mysterious mansion.\r\n</li><li>Dialog and support systems that allow for further character development and stat boosts.\r\n</li><li>A unique and complex overarching story line that ties together all subplots and backstories.\r\n</li><li>Over 45 unique enemies and a dozen boss battles</li></ul>\n<br/><br/><strong>Development</strong>Towards The Pantheon began in 2016 when lead developer <strong>Connor O.R.T. Linning</strong> set out to create an RPG that incorporated elements of adventure and horror genres. Soon afterwards <strong>Leandro Tokarevski</strong> joined in to create the pixel art using a palette of only 16 colors resulting in a vibrant and distinct world full of charm. <strong>Towards The Pantheon</strong> is the result of big dreams and two grueling years of hard work. In October of 2017 the prequel game <strong>Towards The Pantheon: Escaping Eternity</strong> was released for free on Steam, Itch.io, and Gamejolt to great reception. <br/>\n\n<p>Check out Towards The Pantheon's soundtrack here on Itch.io: https://connorort.itch.io/towards-the-pantheon-soundtrack<br/></p>", "metacritic": null, "released": "2017-06-22", "tba": false, "updated": "2019-08-28T23:25:42", "background_image": "https://media.rawg.io/media/screenshots/610/61009d10f521e646c4fe87d727bfac6b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ConnorORT"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}