{"id": 95424, "slug": "stellar-stars-the-star-of-records", "name": "Stellar Stars - The Star of Records", "name_original": "Stellar Stars - The Star of Records", "description": "<p>\n<strong>Stellar Stars is the 1st Ever Multiplayer Online Rogue-lite Arena (MORA) that passionately cooks the best of Multiplayer Online Battle Arenas (MOBAs) and Rogue-lites together, empowering you with the ability to level up in direct and interactive ways, while fighting other players in a sci-fi &amp; fantasy 8-bit world with procedurally generated stages.</strong>\n</p><p>\r\n\tWhat? You woke up one day and you are now a pixel art character? Search for the legendary Star of Records to find out what happened!\r\n</p><p><strong>Stellar Stars is the 1st ever Multiplayer Online Rogue-lite Arena (MORA) with key features such as:</strong></p><ul>\n<li>Challenge and grab trophies by fighting against other players in the multiplayer leagues!</li><li>Leap higher! Sprint faster! Decide and choose from the many fun ways to progress your character when you level up!</li><li>Play as different characters and unlock new characters as you progress through the game!</li><li>Explore various procedurally generated stages filled with unique enemies and overpowered bosses in the story mode!</li><li>Experience the best gameplay with an Xbox One Controller!</li>\n</ul><p>\n<strong>ALPHA ACCESS</strong>\n</p><p>\r\n\tGet the game now in its alpha version and receive all future updates for free! You will also receive a free Steam key when the game gets greenlit! New content is constantly being added to Stellar Stars! And that includes:\r\n</p><ul>\n<li>New playable characters</li>\n<li>New worlds, stages, enemies and bosses</li>\n<li>New character growths and spells</li>\n<li>Multiplayer co-op / versus mode</li>\n</ul><p>\n<strong><br/>\n</strong>\n</p><p>\n<strong>CURRENT STATUS</strong>\n</p><p>\r\n\tStellar Stars is still in development so all visuals and gameplay aspects that you see here is subject to change. The game's blog is also updated regularly every Tuesday and Friday at \r\n\thttp://www.whitesponge.com/blog!\r\n</p><p><strong>LATEST UPDATE</strong></p><p><strong>STELLAR STARS 1.1: THE ARRIVAL OF TINK (22nd December 2016):</strong></p><p>\n<strong>v1.1 has arrived! This new version brings to Stellar Stars:</strong>\n</p><ul>\n<li>Added the new 5th character - Tink!</li><li>Improved the jumping movement for all characters. Tap the jump button lightly to jump really low and press and hold it to jump really high!</li>\n</ul><p>\n<strong>Changes in v1.1 includes:</strong>\n</p><ul>\n<li>Mana and health orbs now drop more frequently if your mana and health is critically low respectively</li></ul><p><strong>Bug fixes in v1.1 includes:</strong></p><ul><li>Fixed the bug where the menu from the character build preparation will sometimes still stick around and block the view when a multiplayer match starts</li><li>Fixed the bug where characters would sometimes not stop immediately when you release the left/right movement keys (e.g A for left or D for right)</li></ul>Upcoming Stuff!<p>1.2: Rise Of Magic</p><p>- New spells!</p><p>- New animations!</p><p>- Play as Vona, the new mage of misfits!</p><p>- Double Jumping!</p><p>\n<strong>LIVE STREAM</strong>\n</p><p>\r\n\tThe development of Stellar Stars is also being live streamed every Monday, Thursday and Saturday (9 PM to 11PM EST) at \r\n\thttp://www.twitch.tv/WhiteSponge. This also allows you to voice your feedback and interact on the live stream directly! Hop over to say hi!\r\n</p>", "metacritic": null, "released": "2014-11-13", "tba": false, "updated": "2019-08-28T23:28:18", "background_image": "https://media.rawg.io/media/screenshots/c94/c943b85b9060d7e1fa6d5040e84925cf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Linux", "PC"], "developers": ["WhiteSponge"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}