{"id": 954321, "slug": "tiny-fighter-unstoppable-run", "name": "Tiny Fighter: Unstoppable Run", "name_original": "Tiny Fighter: Unstoppable Run", "description": "<p>Tiny Fighter is an exciting and action-packed mobile game that brings player to a mysterious woods and castles. The game begins with a dramatic scenario in which a vampire has stolen the princess and the brave Tiny Knight is the only one who can save her.<br/><br/>As the princess is abducted, the Tiny Knight embarks on a quest to retrieve her by through dangerous woodlands and battle his way through the castle's maze. Along the journey, the knight must fight Orcs and Skeletons as well as overcome obstacles like as snakes, scorpions, rotary saws, lava, poison, bats, and spikes.<br/><br/>The game consists into numerous level based on two basic locations: the forest and the castle. The player must seek the princess in one of the castles while overcoming the different obstacles on his path. Each level concludes with a boss encounter against an Orc or a Skeleton.<br/><br/>Сollect gold coins while passing levels and use them to improve the Knight's health and power of attack. As the knight becomes stronger and he can easily overcome the obstacles and defeat bosses.<br/><br/>Tiny Fighter has an intuitive controls: tap to jump and double tap to double jump. This will help you to control the knight fast and effectively across the game's dynamic scenarios. The game also includes great pixel graphics and an enthralling music that completely immerses the player in the game's universe.<br/><br/>So what are you waiting for? Save the princess! ....if you can...</p>", "metacritic": null, "released": "2023-04-09", "tba": false, "updated": "2023-04-10T06:57:36", "background_image": "https://media.rawg.io/media/screenshots/123/12333448cf111597e4d89f6baefe44ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["playrea_official"], "genres": ["Action", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}