{"id": 954344, "slug": "funky-fungus-reloaded", "name": "FUNKY FUNGUS RELOADED", "name_original": "FUNKY FUNGUS RELOADED", "description": "Un gioco per lo ZX SPECTRUM 128K<br/>(48K per utenti DivIDE/DivMMC con ESXDOS)\r\nA game for the 128K ZX SPECTRUM<br/>(48K for DivIDE/DivMMC with ESXDOS users)\r\nUn juego para ZX SPECTRUM 128K<br/>(48K para ususarios de DivIDE/DivMMC con ESXDOS)\r\nGioco e manuale in:<br/>Game and manual in:<br/>Juego y manual en:\r\nITALIANO - ENGLISH - FRANCAIS<br/>DEUTSCH - ESPAÑOL - PORTUGUÊS\r\n\n<p><strong>*** ITALIANO ***</strong></p>\n<p>Il pacifico popolo dei Fungi è preoccupato. Seto Taisho, un guerriero fatto di stoviglie rotte, e i suoi alleati minacciano di impossessarsi del loro villaggio. Solo FUNKY FUNGUS, l'ultimo in grado di sfruttare il potenziale della Stella Rotante, può difenderli dagli invasori.</p>\n<p>In quattro mondi di 12 schermi ciascuno, Funky Fungus dovrà battere gli stravaganti nemici, prima di affrontare Seto Taisho nel duello finale.</p>\n\n<p><strong>*** ENGLISH ***</strong></p>\n<p>The peaceful Fungi people are worried. Seto Taisho, a warrior made of broken pottery, and his allies threaten to take over their village. Only FUNKY FUNGUS, the last one capable of harnessing the potential of the Spinning Star, can defend them from the invaders.</p>\n<p>In four worlds of 12 screens each, Funky Fungus will have to defeat his bizarre enemies, before facing Seto Taisho in the final duel.</p>\n\n<p><strong>*** ESPAÑOL ***</strong></p>\n<p>El pacífico pueblo de los Fungi está preocupado. Seto Taisho, un guerrero hecho de vajillas rotas, y sus aliados amenazan con apoderarse de su aldea. Solo FUNKY FUNGUS, el último capaz de aprovechar el potencial de la Estrella Girante, puede defenderlos de los invasores.</p>\n<p>En cuatro mundos de 12 pantallas cada uno, Funky Fungus deberá derrotar a sus extravagantes enemigos, antes de enfrentarse a Seto Taisho en el duelo final.</p>", "metacritic": null, "released": "2023-04-09", "tba": false, "updated": "2023-04-10T07:07:02", "background_image": "https://media.rawg.io/media/screenshots/141/1412ed620c59168fa58d85ac97d157d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["zanklesoft"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}