{"id": 95438, "slug": "badlands-max-carnage-pc", "name": "Badlands - Max Carnage (PC)", "name_original": "Badlands - Max Carnage (PC)", "description": "<p><strong>BADLANDS - MAX CARNAGE is a casual turn-based RPG set in the post-apocalyptic wastelands of Discordia</strong>.</p>\n<p><em>Discordia was once our beacon of hope. The distant planet represented our fresh start; a new beginning for our species. The science of terraforming had been long since perfected in our own solar system, and for the first time it was essential to our species' survival outside of it. We moved to Discordia, and turned it into our new paradise. We planted and farmed, we created technology to ensure our survival, we raised families, we lived.</em></p>\n<p><em>Then we found... The Void Mind.</em></p>\n<p><em>Buried in an ancient vault deep within a previously unexplored cave, someone accidentally discovered and activated ancient alien technology that changed everything.</em></p>\n<p><em>After The Hello World Event and The Epic Burn, our paradise is a Wasteland.</em></p>\n<p><em>We need your help. Discordia needs you to be its Hero.</em></p>\n<p><strong>GAME FEATURES:</strong></p>\n<p>★ Welcoming and active community - no bullying, spam, sexism, etc.</p>\n<p>★ Hero-Centric gameplay where you level up a collection of characters.<br/></p>\n<p>★ 17 unique Heroes to collect, each with their own unique vehicle!<br/></p>\n<p>★ Unlock the secrets of the world of Discordia through more than 40 missions in 7 Chapters. <br/></p>\n<p>★ Make friends and use one of their Heroes to further your progress.<br/></p>\n<p>★ Evolve Hero vehicles by collecting 'Cores.' <br/></p>\n<p>★ Collect 'Pilot Tokens' to ascend your Heroes and make their attacks stronger<br/></p>\n<p>★ Free drops of crates to get tokens and cores. <br/></p>\n<p>★ Game Creators play the game with you -- play against them, talk to them, and more.<br/></p>\n<p>★ FREE to play -- always!<br/></p>", "metacritic": null, "released": "2017-05-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a35/a35fa7d2dfb274c10d71d3d80999f5d9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 236, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SHGStudios"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}