{"id": 95448, "slug": "hyperskill-hard-but-fair-browser-version", "name": "Hyperskill - Hard but fair (Browser Version)", "name_original": "Hyperskill - Hard but fair (Browser Version)", "description": "Hyperskill<br/> Hard but Fair<p>(This is the free version. The full game is still in development.)<br/></p><p>Amberlight Hyperskill is an arcade top-down shooter.<br/> A game about reflexes, split second decisions and advanced skills.</p><p>Imprisoned in the hypernet, the player must defend himself against the creations of an artificial intelligence infected by madness.</p><p>There are two modes: The story and the challenge.</p><p><strong>Challenge</strong><br/> Upgrade your various abilities, evade dangers and conquer the enemy.</p><p><strong>Story</strong><br/> Dive into the dark, cyberpunk space of the Hypernet and its many dangers. Meet the denizens of this virtual world and the broken AI holding them captive. Uncover the rise and fall of this artificial intelligence and the hope and despair of humanity.<br/> You will face hard challenges and fail many times, but if you give your best, you can succeed.</p><p><strong>WARNING</strong><br/> This game is not meant for casual players. The levels and enemies are designed to offer a real challenge for true gamers.<br/> Enjoy the rush of battle and give your best to beat the challenges of Amberlight Hyperskill.</p><p><strong>Controls</strong><br/> WASD - Movement<br/> Left Mouse Button - Beam Attack (Lightray)<br/> Righ Mouse Button - Teleport (Dash)<br/> Space - Shockwave<br/> Shift - Rockets<br/> Scrollwheel - Fireflies<br/> Q - Menu<br/> Fullscreen Recommended</p><p><strong>Hints</strong><br/> In the story mode you find your upgrades as you progress through the levels. If some levels are too hard, try getting upgrades in another place. Talk to people by moving into them. They change their dialog, when you progress (e.g. solve the countdown levels). There is a health upgrade inside the hub (next to the stranger).<br/> In the challenge mode open the menu (Q), hover over a skill. Left click upgrades the skills. Right click removes an upgrade (as soon as you close the menu, the upgrades are fixed and can't be reduced).</p><p>Follow me on twitter and get news about updates: @RaveryNet <br/> This game is a work in progress and not all levels are finished and unlocked yet and I will include more skills in the future.</p>", "metacritic": null, "released": "2017-04-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/49a/49a7f2abda93d88869d915b82f6bf74d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Ravery"], "genres": ["Action"], "publishers": [], "esrb_rating": null}