{"id": 954443, "slug": "ducks-despair", "name": "Duck's Despair", "name_original": "Duck's Despair", "description": "With only two buttons to hop your bouncy feathered ass, death is inevitable.<br/>Duck's Despair is a crazy hard platformer, driven by an absurd story that will make you enjoy suffering.<br/><br/><h3>Featuring</h3><ul><li>Gameplay of a disabled bouncing Duck.<br/></li><li>Level design and mechanics with speedrunning in mind.<br/></li><li>Eggs to collect &amp; medals to unlock, for veteran players.<br/></li><li>Crazy characters in a satirical story, full of epic twists.<br/></li><li>Blood and tears.</li></ul><br/><h3>A Quacktastic Adventure</h3><br/>While all your friends went to feast on the beach, you remained stuck in the stinky old Pink City. <strong>Unable to fly</strong> after being struck by lightning, you chose the less painful option: ending it all... But as you commit the irreparable, a Gnome appears from the void and makes you <strong>live forever</strong>! The only choice left to bear this life of yours now: to seek the <strong>Golden Feather</strong> in the hope of maybe one day, flying towards your dream!<br/><br/><h3>Flap, Bounce, Cry</h3><br/>Your only means of movement? Hopping like a chicken and bouncing like a rubber ball! Uncover the depth of these mechanics, ridiculously easy-to-learn but so hard-to-master. Only blood, sweat and tears, will take you through the 72 handcrafted stages with an <strong>ever-growing difficulty</strong>! Not tired yet? Try getting all the eggs, and beat the best time for each level.<br/><br/>Hop into the absurd journey ahead, and flap your way through Hell and Heaven to fulfill your dream of becoming a real Duck!", "metacritic": null, "released": "2023-04-09", "tba": false, "updated": "2024-01-29T06:33:51", "background_image": "https://media.rawg.io/media/screenshots/f67/f6787c3cb25ec632bd6ee031f174640e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Faith", "Fluffy Duck"], "genres": ["Action", "Adventure", "Indie", "Platformer"], "publishers": ["Fluffy Duck"], "esrb_rating": null}