{"id": 954457, "slug": "the-last-can", "name": "The Last Can", "name_original": "The Last Can", "description": "<p>This game is unfinished. I've only completed about half of the game, but only half of that has been actually implemented in the game so far. I've only been working on this game for like a week :p<br/></p>\n<p>I haven't implemented the credits yet, nor the two levels after the neighborhood section.</p>\n<p>All assets were made by me, aside from 2 royalty free sound effects I got from online (hitting a can [on Pixabay, Tin Can 01 by Tim Verberne], and the mousetrap snap [sry i cant find this one anymore for some reason, idk. If I can't trace its origin I'll replace it later]). The rest of my team last semester helped out with concept work though, so they'll get some credit for that. But I don't remember their names, and only remember some of their discord usernames... :(</p><p>And you better like that run animation. I worked hard to nail that old person run look.<br/></p>\n<p>________________________________________________________</p>\n<p>DESCRIPTION:<br/></p>\n<p>In a post-apocalyptic 1988, civilization has collapsed. What happened  exactly? you can check the vault because I don't feel like explaining  it.\r\n  </p>\n<p> You play as a starving mutated 50 year old man chasing what could be your last meal. Good luck. <br/></p>\n<p>It's my first time using Unity. Using any game engine for that matter, and I've only been using it a week so don't be too harsh plz<br/></p>", "metacritic": null, "released": "2023-04-09", "tba": false, "updated": "2023-04-10T07:51:43", "background_image": "https://media.rawg.io/media/screenshots/2f3/2f31026117931fe40182e94bfb9e166f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["juspsliu"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}