{"id": 954406, "slug": "lewc", "name": "LEWC", "name_original": "LEWC", "description": "Last Equinox Winds of Change was a game that I participated in just producing props and had a slight participation in the level design of enemies, it was also a college project. However the game belongs to a group called Alameda Games.\r\n\r\nLast Equinox Winds of Change \r\n<p>Last Equinox Winds of Change is an action roguelike game with RPG elements, where the player must strengthen his character and use his abilities to advance.</p>\r\nGame Story\r\n<p>In a world controlled by four goddesses who respectively maintain its balance through the four fundamental elements, fire, water, air and earth, there would come a day when evil would emerge from another dimension and spread its roots far and wide, consuming everything that played. <br/></p>\n<p>But a fairy with great courage and capable of controlling the four primordial elements would be the only one capable of using her powers to face evil and extinguish its roots, thus bringing peace to the world again. <br/></p>\r\nGameplay \r\n<p>It is based on collecting resources and leveling skills, according to the season your weapon gains different attributes according to the current element, which also influences the skills. Levels are randomly selected so every time you enter a new level it will always be a different path, varying with the seasons as well. Likewise, the seasons also change the scenery and enemies. <br/></p>\n<p> <br/></p>", "metacritic": null, "released": "2023-04-09", "tba": false, "updated": "2023-04-10T07:32:39", "background_image": "https://media.rawg.io/media/screenshots/687/687f702ba3dedfbaf9da20a01e252130.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 263, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Diego Rammzah"], "genres": [], "publishers": [], "esrb_rating": null}