{"id": 954569, "slug": "corridors-roblox-doors-on-scratch", "name": "Corridors | Roblox Doors On Scratch", "name_original": "Corridors | Roblox Doors On Scratch", "description": "<p>--*NOTE*--</p>\n<p>THIS GAME IS NEW SO EXPECT BUGS. THIS GAME IS ENDLESS BUT I HAVE ONLY ADDED ROOM 50 AND SEEK CHASE.</p>\n<p>PRESS SPACE TO GET FREE ADMIN!</p>\n<p>IF YOU WANT JUMPSCARES GO SWITCH IT ON THE SETTINGS.</p>\n<p>--MOVEMENT--</p>\n<p>WASD/Arrow Keys - Move</p>\n<p>Press E to interact If on PC</p>\n<p>Press 1 to select the item and press E to use it.</p>\n<p>--INFO ABOUT  THE ENTITIES--</p>\n<p>Scream/Screech - Go crazy with your mouse cursor when you here \"psst\"! When your mouse cursor is far away it will be invisible, but when the mouse cursor is close you can just see screech/Scream! But be careful... You only have 2 seconds to find him!</p>\n<p>Dash/Rush - Hide in the closet before Dash/Rush gets you!</p>\n<p>Rebound/Ambush - Hide in the closet before Suprise/Ambush gets you! Becareful, it may check the room more times than dash.</p>\n<p>Hide - Don't stay for the closet for too long or else hide will kick ya out and lock the closet for a few seconds!</p>\n<p>Play/New Monster - He will appear as a broken closet but becareful, Check the closet if Play is in there! ( If the closet has black marks around it that means play is there! )</p>\n<p>Stop/Halt - When the screen flashes turn around, then turn around!</p>\n<p>Camouflage Figure - This is Figure but he will become invisible if you are not close to him. He will appear if you get close so be aware! Get all 6 paper to beat the room!</p>\n<p>--R U N / S E E K CHASE--</p>\n<p>The rooms with eyes on the floor - Dodge the black stuff with eyes to avoid getting killed!</p>\n<p>3 Door Room - The Guiding Light will light up in the correct door or the eyes on the floor will look at the correct door</p>\n<p>--Double Team! Dash &amp; Rebound--</p>\n<p>There is a slight chance that Dash and Rebound will spawn together! ( This feature is totally not a bug that I can't fix )</p>\n<p>Gaze/Eyes - Yes Gaze is very beautiful but don't be fooled, staring at it will drain your hp! Look away before it kills you.</p>\n<p>Stalk - Stalk somehow breaks the 4th wall and stalks you in the real world, Don't move or else he'll dmg you! If you don't have your camera on Stalk will then instead kill you if you move. Beware, If his pupils are showing that means you get dmged if you move so becareful!</p>\n<p>Bob - He just wants friends.</p>\n<p>Annihilate - Basically an Undertale fight.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2023-04-10T08:38:13", "background_image": "https://media.rawg.io/media/screenshots/d8b/d8b9aca67a3d549d86be3006af55ea1a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["rain3owz"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}