{"id": 954552, "slug": "timmys-choice", "name": "Timmy's Choice", "name_original": "Timmy's Choice", "description": "<p>Timmy's Choice is a Stanlike, immersive, choose-your-own-adventure game that puts players in the shoes of Timmy, a young man faced with a life-changing decision. <br/><br/>Players will embark on a journey with Timmy as he discovers the truth about his existence and the world around him. The game offers two divergent story paths - one where Timmy embraces the power of choice and sets out on a journey of adventure and discovery, and one where he returns to the safety of his old life, shunning the unknown and limiting his potential.</p>\n<p>Throughout the game, players will encounter obstacles, illusions, and challenges that test Timmy's determination and character. Players will make choices that affect the outcome of the story and ultimately determine Timmy's fate.<br/><br/>With its deep storyline, engaging characters, and thought-provoking themes, Timmy's Choice is a unique gaming experience that will challenge players to question their own beliefs about the power of choice and the meaning of existence. Get ready to embark on a journey that will change your life forever!</p>\n<p><strong>Note</strong>: The above game description is of an ideal game. This actual \"finished\" game is most likely to be viewed as a bad game. The objective was, for me at least, is to finish the game in a short period of time, take any shortcuts to get it done, as low effort as possible, all so a game can be \"completed\" and \"released\".</p>\n<p>The game's duration is 10 minutes~<br/></p>", "metacritic": null, "released": "2023-04-09", "tba": false, "updated": "2023-04-10T08:29:18", "background_image": "https://media.rawg.io/media/screenshots/c55/c554f103d2868bfbe6e2ecb85ae6fa86.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Freakoverse"], "genres": [], "publishers": [], "esrb_rating": null}