{"id": 954585, "slug": "the-big-mining-versao-pre-alfa", "name": "The Big Mining - Versão Pré-Alfa", "name_original": "The Big Mining - Versão Pré-Alfa", "description": "ADICIONE Á SUA WISHLIST DA STEAM!\r\n<p><strong>The Big Mining já está disponível na steam para ser adicionado á wishlist, caso tenha se interessado, basta clicar aí no link ;)</strong></p>\r\nWishlist: https://store.steampowered.com/app/2269800/The_Big_Mining/\r\n<p>---------------------------------------------<br/></p>\n\r\nCONSIDERAÇÕES\r\n<p><strong>Esse jogo trata-se de uma versão de testes. O que está contido nele (gráficos, mecânicas e afins) será melhorado para a versão final. O intuito da distribuição dessa versão é para testes e demonstração do conceito principal do jogo.</strong></p>\n<p><strong>Sinta-se á vontade para deixar seu comentário aqui na página a respeito do que achou do jogo ou até mesmo se encontrou algum bug. Se por algum motivo, não quiser criar uma conta aqui nesse site para comentar, deixo aqui o link do instagram da Amazing Block e por lá você pode me contatar através do chat. Terei muito prazer em lhe receber e trocar alguma ideia :D</strong></p>\r\nInstagram: https://www.instagram.com/aamazingblock/?utm_medium=copy_link\r\n<p><strong>---------------------------------------------</strong></p>\n\r\nSOBRE O JOGO\r\n<p><strong>Ayla está animada para o seu primeiro dia sendo a mais nova mineradora de sua vila. O que deixa isso ainda mais especial é o fato de que ela está substituindo seu pai, o maior minerador que a sua vila já teve e que acabara de se aposentar. Porém, nem tudo sai como o esperado e Ayla se encontra com uma realidade inesperada por ela: Todos de sua vila têm essa consideração por seu pai e não por ela.</strong></p>\n<p><strong>Agora, o que para ela seria um primeiro dia de trabalho acaba por se tornar o início de uma jornada para provar seu valor...</strong></p>\n<p><strong>A questão é, até que ponto isso vale a pena?</strong></p>", "metacritic": null, "released": "2023-04-09", "tba": false, "updated": "2023-04-10T08:45:13", "background_image": "https://media.rawg.io/media/screenshots/cc1/cc1728b7c56b870ae9c576d89054e990.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Amazing Block"], "genres": ["Shooter", "Adventure"], "publishers": [], "esrb_rating": null}