{"id": 954650, "slug": "quarter-lens-crisis-one-shot", "name": "Quarter Lens Crisis ~ One-Shot ~", "name_original": "Quarter Lens Crisis ~ One-Shot ~", "description": "<p><strong>Quarter Lens Crisis</strong> is a slice of life narrative game about self-growth, overcoming grief and forming connections. Player will follow Deena, a freelance designer turned photographer, capturing photos of life in a vintage city inspired by Bandung in Indonesia. Find truth about your father's death, get to know variety of people and create memories with your friends. </p>\n<p>Currently, this version is released as a one-shot playthrough and it will take around 15-20 minutes of playtime. It took place at the beginning of a larger story, but it’s also self-contained and open-ended enough. We are still using unfinished line art, sketches, placeholders, free to use music and sounds, and cobbled prototype codes, BUT we hope you can still enjoy this version of the game.</p>\r\nFuture Plan\r\n<p>Since this is a project that we worked on between our main jobs, we don’t have any plan to continue the development of the full game at this time. Our aim was to express our passion in creating games no matter how small the product is. </p>\n<p>If you encounter any bugs, glitch, weird translations, or you have any thoughts or comments about the current state, please don’t hesitate to comment here!</p>\r\nCredits\r\nChill Street Society\r\n\r\n<ul><li>Marszha (Twitter) - 2D Artist, Storywriter</li><li>Arinal (Twitter) - Storywriter, Additional Sketch Art</li><li>Lei (Twitter) - Game Designer, Narrative Designer, Additional Art &amp; Animation, Co-Producer</li><li>Karunia (Twitter) - Programming, Content Implementation, Dialogue Editor, Co-Producer</li><li>Ardhan (Twitter) - Product Manager, Additional Programming, Co-Producer</li></ul>\r\nThird Parties\r\nMusic and Sounds\r\n<ul><li>LesFM</li><li>Oak Studios</li><li>Sudut Musik</li><li>prodbyIOF</li><li>Sound Holder</li><li>Nathan Gibson</li></ul>\r\nArt\r\n\r\n<ul><li>potat0master\r\n</li></ul>", "metacritic": null, "released": "2023-03-19", "tba": false, "updated": "2023-04-10T09:18:07", "background_image": "https://media.rawg.io/media/screenshots/0d2/0d2fedfb15f2de049397e49d9b4a1319.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chill Street Society"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}