{"id": 954605, "slug": "deadline-itch-redredred-studios", "name": "Deadline (itch) (RedRedRed Studios)", "name_original": "Deadline (itch) (RedRedRed Studios)", "description": "<p><strong>Deadline</strong> is a puzzle game with cubes, buttons, glass, and other clever stuff. However, you can get through it without possessing a high intelligence. </p>\n<p>There are several levels in the game, each one getting more and more complicated and confusing. \r\n</p>\n<p>You'll have to use your logic and strategic thinking to find the right path to the exit, in as little time as possible, because each level is given time. \r\n</p>\n<p>If you do not have time to get through the door before the timer ends - start over. The goal of each level is to open the door by pressing the red button, and to press it - you need more intelligence. \r\n</p>\n<p>There will be other buttons, different cubes and glass, through which you can pass a certain number of times. \r\n</p>\n<p>Who would have thought that such a simple action as pressing a button could be so complicated and confusing? Don't forget about time as well, sometimes, it really does run out of time. Don't worry, we're sure you can get through this task in a few minutes (or a few days... or weeks... or...). If you do decide to challenge your brain and make it to the end - we'll be proud of you (or feel sorry for you). \r\n</p>\n<p>Anyway, don't forget that it's just a game.\r\n</p>\n<p><strong>CONTROLS</strong>\n</p>\r\nW, A, S, D or Arrows\r\nMovement\r\nSpace\r\nJump\r\nE\r\nUse\r\nLeft Mouse Button\r\nGrab\r\nR\r\nSlow down time\r\n\r\n<p>This game was made for Ramadan Development Night's Jam.\r\n</p>\n<p>At the moment the game is unfinished, in the future it is planned to create a full version of the game.\r\n</p>", "metacritic": null, "released": "2023-04-08", "tba": false, "updated": "2023-04-10T08:55:39", "background_image": "https://media.rawg.io/media/screenshots/f2d/f2dd86b9117f7f2c95504c266fba45ea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RedRedRed Studios"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}