{"id": 954676, "slug": "the-ancients", "name": "The Ancients (itch)", "name_original": "The Ancients (itch)", "description": "<p>The Old Lands is under attack since the 1st Ancients disappearance.  Time to find out what happen to them and what you can do to stop the destruction.  Work with your team to find out the mystery of the 1st disappearance and help bring peace back to the realm.</p>\n<p>Customize your party.</p>\n<p>Choose your party members class and add a subclass.  Decided what skills would be best to serve you on your j ourney.  Allocate points to specific stats that you want to build.  Upgrade weapons and armor to make them more powerful.  Craft items that you will need to find the secret behind the 1st disappearance.  </p>\n<p>Class change.</p>\n<p>You can change the class of most of the party members.  Decided if you want a bunch of warriors, or maybe a magical team of sorcerers and warlocks.  Your decision will determine how you play.  You can also add a sub class to your party members.  Ever wonder what it would be like to that a warrior that also has the skills of a necromancer.    This will allow you to add skills of a necromancer to your warrior.</p>\n<p>Learn new skills.</p>\n<p>As you progress through the game you will accumulate points that you can use to learn new skills for your chosen class.  This gives you more customization on how you what your party members to play.    Do you want to know all elemental  spells or have different party members learn different elements.</p>\n<p>Allocation.</p>\n<p>As you level up, your party members gain allocation points that can be used to buff specific stats.  Maybe you want your ranger to have more agility or your summoner to have more magic power.  The choice is yours.</p>\n<p>Crafting.</p>\n<p>Learn recipes and craft all kinds of items.  Need more potions but can not get to a shop.  Brew it up yourself.  Weapons have broken, make new ones.  Other items that may be needed to help your chances in the game can be crafted once the recipes have been found.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2023-04-10T09:30:41", "background_image": "https://media.rawg.io/media/screenshots/56a/56ad7fd7b7cd9abde0ecf5f90a4f4f49.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 322, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dark Coma Gaming"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}