{"id": 954718, "slug": "the-lost-seconds", "name": "The Lost Seconds", "name_original": "The Lost Seconds", "description": "<p><strong>NB:</strong> We Should note that the online button inside the main menu is experimental, and we will be implementing it in case of continuing work on the game after the end of jam!<br/></p>\n\n<strong>Keys:</strong>\n\n<p><strong>WASD</strong> and <strong>Arrows</strong> to move players</p>\n<p><strong>V</strong> : player 1 attack (sword)</p>\n<p><strong>Mouse click</strong> : player 2 attack (bow), NB: <strong>hold</strong> your mouse button down for a longer attack!</p>\n<p><strong>Y</strong> to send some of your time</p>\n\r\nThe game story: \r\n\n<p>Deep in the heart of a magical forest, there lived two friends, Lily and Lea. They were adventurers at heart and had explored every corner of the enchanted forest. But one day, they stumbled upon a cursed artifact that would change their lives forever.</p>\n<p>The artifact had the power to freeze time, but it came with a terrible curse. Lily and Lea were trapped within their own bodies, their inner clocks frozen in time. Every time they moved or attacked, their lives ticked away, represented by a timer that was constantly decreasing.</p>\n<p>Desperate to break the curse, Lily and Lea set out on a perilous journey to collect the missing cogs that would fix their inner clocks and restore their freedom. The journey was fraught with danger, and they had to fight fierce monsters and overcome deadly traps to collect the missing cogs.</p>\n<p>As they traveled deeper into the dungeon, Lily and Lea's timer continued to decrease. They were forced to move quickly, using their skills and wits to overcome the obstacles in their way. Every second counted, and the pressure mounted as they approached their goal.</p>\n<p>(that's a prototype for the RDN game jam we will upgrade it in the future)</p>", "metacritic": null, "released": "2023-04-08", "tba": false, "updated": "2023-04-10T09:51:56", "background_image": "https://media.rawg.io/media/screenshots/e2e/e2e30bd7dbfb52316ac14c636129117c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nassim Kraiem"], "genres": [], "publishers": [], "esrb_rating": null}