{"id": 95473, "slug": "the-egg", "name": "The Egg (itch)", "name_original": "The Egg (itch)", "description": "<p>A short atmospheric game about the meaning of life.</p>\n<p>This is an adaptation of Andy Weir's short story, with permission of the author. It tries to be as close to the original material as possible, while offering an immersive interactive experience, with minimal 3D visuals and a dynamic ambient soundtrack.</p>\n<p>If you like the game, share it! It's meant to be free, and freely distributed. You can also try A Road to Awe, for a similar atmosphere, and RPG in a Box, the game engine.</p>\n<p>The original short story was translated in many languages, and I'd like the game to offer the same diversity, but it's difficult to get in touch with each translator individually.</p>\n<p>Feel free to contact me on Twitter or with this contact form if you want to provide a translation in your language.<br/></p>\n<p>You can read the original story here (<strong>SPOILERS!</strong>)</p>\n\n<p>CHANGELOG</p><p>1.0.2</p><ul><li>Added a Dutch translation, thanks to Ernst van Gassen.</li><li>Changed a few details in the French translation.</li><li>Fixed the character's position when standing on stairs.</li><li>Fixed some missing files that may have caused the game to crash on macOS, depending on your version.</li></ul>\n<p>1.0.1<br/></p>\n<ul><li>Fixed a small dialogue issue where the player's name was displayed instead of the main NPC's name.</li></ul>", "metacritic": null, "released": "2017-03-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/727/72779895fa1e6f5aa58e0d39e5479dd5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["lectronice"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}