{"id": 954862, "slug": "crawl-back-to-me", "name": "Crawl Back To Me", "name_original": "Crawl Back To Me", "description": "<p>My entry for the Dungeon Crawler jam.</p>\n<p>Unfortunately I did not have enough time to finish the game. It is playable, but not complete yet. I will continue to work on it after the jam.</p>\n<p>I did not test the build (It starts, that's all I know)</p>\n<p>Background story:</p>\n<p>You play as Alastair, I brave knight, follower of the Lord of Light. A few months ago, your wife Casandra died due to a failed alchemy experiment, while you were away on a mission for your church. Devastated by the loss, you can't find it in your heart to go through her things. Until a week ago that is. There you find a letter, addressed to you.</p>\n<p>In the letter Cassandra explains the danger of the experiment she was about to do. She tells you that if things go wrong and she dies, you should seek out a Soul Stone. It will enable you to speak to her again, even though separated by death. A detailed map is included, showing you the way to a long forgotten dungeon. You set out to find such a Stone, even though contacting the dead is frowned upon by your church. There are so many things you wanted to say to her, but you could never find the words to express yourself while she was still alive. Perhaps this is your chance to tell her how much you loved her, how much she meant to you, and how much you miss her...</p>\n<p>Controls: WASD to move, QE to turn, Space to attack, H to heal yourself, Enter to interact (there isn't much to interact with yet), O to open/close options. M toggles the mini map, Tab to open/close the full map. </p>\n\n<p>Known bugs:</p>\n<p>* Sometimes enemies move in ways they are not supposed to move. If they do you can't attack them. Moving away from them can solve this.</p>\n<p>* Doors stopped working for some reason, couldn't find what caused it. So there are only a few doors right now, none lead to important areas. If you interact with them they will not animate open, but you can move right through them.</p>\n<p>* Please leave a comment if you find any issues, or simply to let me know if you enjoyed what little I was able to make.</p><p>Credits:</p><p>Game Design: Kethram's Games</p><p>Programmer: Imelda Weijers (aka Kethram)</p><p>Narrative Designers: Deniz Keleş, Daan Dunnewold</p><p>Models by Synty Studios</p><p>GUI by Poneti</p><p>Music from the Ultimate Music Bundle</p><p>Sound Effects from the Ultimate SFX Bundle</p>\n\n<p> </p>", "metacritic": null, "released": "2023-04-08", "tba": false, "updated": "2023-04-10T10:55:03", "background_image": "https://media.rawg.io/media/screenshots/41c/41c46e79c5c4b426cc176fd88680e133.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kethram"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}