{"id": 95487, "slug": "shrug-island-the-meeting", "name": "Shrug Island - The Meeting", "name_original": "Shrug Island - The Meeting", "description": "<p><strong>Everything is alive, but how do you talk to it?</strong></p>\n<p><strong>Shrug Island - The Meeting</strong> is a warmly wistful adventure, an open door into a playful celebration of music, mystery and nature’s dances.  In a personal fusion of genres crafted by a small team of music and nature lovers, it's a game about hope, reconnecting friendship, and hidden pasts, featuring beautiful hand-drawn art and soundscapes. </p>\n<p>The Watcher, keeper of the Island’s balance, is losing their powers and calls for help. Delve into the adventure with two separated Shrug friends, Li and Shri, as they heed the call, exploring their shape-shifting musical landscape they’ve just returned to. Using their power to transform the land, by playing music or revealing a hidden layer of the world where forgotten things lie, combine their skills on a journey towards each other.</p>\n<p>  </p>\n<p><strong>Come away</strong> and spend an hour or two with the Shrugs on their lively home. Unravel riddles of groaning cliffs and puzzles of the past, where crispy crabs, sweeps of seaweed, flights of fish and more mysteries of Shrug time await your voice to speak.</p>\n<p><strong>Shrug Island - The Meeting</strong> can be played by a goal oriented adventure gamer in around an hour. Wanderers can take a more leisurely path and explore the changing season around the Island.<br/></p>\n<p>Shrug Island is an allegory on the many levels of identity, belonging, care and renewal.</p>\n\r\n\"The lovely interplay between island, music, and the two playable shrugs was a ray of sunlight that I quite enjoyed basking in while it lasted..\" - Merlina McGovern, Adventure Gamers<br/><br/><br/>\"<em>Shrug Island - The Meeting</em> draws the player into its colorful world, then lets them free to see what music can do in this enchanted place. While it can be finished quickly, it's well worth your while to lose yourself in its sights and sounds<em> </em>.\" - Joel Couture, indiegames.com\r\n<br/>\"<em>Shrug Island</em> is a relaxing spiritual experience transmitting positive feelings: beauty, love, friendship, empathy, harmony with nature, childhood nostalgia.\" - Video Games Art<br/><br/>\n\n\n\n<p><em>Shrug Island - The Meeting is a first commercially released  game based on an awarded animation film by Alina Constantin . Followed by many migrations, strawbale building, prototypes, a Kickstarter campaign, cultural grants and changing tides, you can look into the long gestation process on www.shrugisland.com</em></p>\n<p><em> </em><br/></p>", "metacritic": null, "released": "2018-05-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d1e/d1e724c68f1e5f8538477b2249d5cec7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 2, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Tiny Red Camel"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}