{"id": 954974, "slug": "bozo-dungeon", "name": "Bozo Dungeon", "name_original": "Bozo Dungeon", "description": "<p>Aren't you <strong>tired</strong> of dungeon crawlers that take themselves too seriously? No? Well, even so, you might want to try<em> Bozo Dungeon</em>. The theme for this game jam was <strong>Duality</strong>, and this game offers that by pioneering an innovative new system: Only half your time will be spent walking around! The game has a<strong> special mechanic</strong> that allows you to go into a fight screen and dodge bullet-hell attacks from enemies. No game has ever combined those ideas before, so this is completely original. OK, maybe there was this <em>one</em> game that used that idea before.</p>\n<p><em>Bozo Dungeon</em> has <strong>over five </strong>(six) weapons to use, and <strong>at least </strong>five different enemies to fight, each with their own special attacks. If you download this game you're sure to have fun, but beware: you're on a <strong>very restrictive time limit</strong>! Just kidding, nobody wants that.</p>\n<p>Let's get serious for a second while I list the controls:</p>\n<p><strong>WASD</strong> to move</p>\n<p><strong>ESC</strong> to close game</p><p><strong>Mouse Wheel </strong>to adjust volume<br/></p><p>In the <strong>Main Menu</strong>, you can switch to an alternate control scheme that allows A and D to strafe and uses E and Q for looking left and right instead.</p>\n<p><strong>Touch a chest</strong> to loot it</p>\n<p>Walk onto a red<strong> Combat Square</strong> to start combat</p>\n<p>In Combat:</p>\n<p>On your turn, you can <strong>attack</strong> or <strong>heal</strong> (but not both). Before attacking, it might be wise to <strong>switch weapons</strong> and see which one will work best for your current situation.</p>\n<p>On the enemy's turn, you simply have to <strong>dodge</strong> whatever they throw at you until they get tired and let the turn pass back to you. Just don't run out of health and you'll be fine.</p>\n<p>To win, simply find your way to the<strong> final boss</strong> and beat it in combat.</p>\n<p>That should be all you need to get started on your Bozo journey! Good luck, and one last note:</p>\n<p><em>Bozo Dungeon can only be enjoyed by lollygaggers, tomfoolerers, jokers, hoaxers, tricksters, jokesmiths, humorists, jesters, hooligans, goofballs, charletons, scoundrels, rapscallions, miscreants, jokesters, japers, hoodlums, scallywags, clowns, quipsters, harlequins, buffoons, wisecrackers, rascals, neerdowells, rabbel-rousers, shenaniganizers, goofsters, merrymakers, ruffians, skylarkers, goobers, knuckleheads and other ridiculous folks.</em><br/></p>\n\n<p><em>All assets were made by me within the time of the jam. The only exceptions are the sources credited in the game for some of the sound effects, and a template I used for grid-based movement.</em><br/></p>", "metacritic": null, "released": "2023-04-08", "tba": false, "updated": "2023-04-10T11:44:04", "background_image": "https://media.rawg.io/media/screenshots/882/882720b7f66e097e03869247e38c9960.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Funky_Mushroom"], "genres": ["Action"], "publishers": [], "esrb_rating": null}