{"id": 954986, "slug": "scryer", "name": "Scryer", "name_original": "Scryer", "description": "<p><strong>Scryer</strong> is a \"<em>I'm on observation duty</em>\" ripoff where your task lies in reporting changes on a set of monitored areas. Good memory and a watchful eye are key in order to survive the shift which ends at 6:00 am. Otherwise a dark pressence will be set free and haunt the scryer.</p>\n<p>Nightmare difficulty becomes available as soon as you beat a stage on Normal.  Nightmare mode includes more rooms to observe, new anomalies, and darkens the entire areas leaving you only with your flashlight to spot anomalies.</p>\n<p>This game was developed as an educational exercise in my journey to becoming a gamedev and also a gift to my partner. Thank you for playing!</p>\n<p><strong>-----Controls-----</strong></p>\n<ul><li><em>Mouse </em>- Interact with the UI and click buttons to report anomalies or switch between cameras.</li><li><em>Keyboard </em>- You can use the arrows or WASD to switch between cameras.</li></ul>\n<p><strong>-----Anomalies-----</strong></p>\n<ul><li><em>Picture </em>- Only occur on pictures that are normally present in the area. The picture portrayed changes into something else.</li><li><em>Blood </em>- These anomalies can range between drawings done in blood, or new blood splatters on the floors or walls of the area. Very rarely can an entire area be flooded in blood or have it cover the camera.</li><li><em>Opening/Closing</em> - Specifically refers to anomalies that involve doors being opened or closed, not to be confused with Object Movement.</li><li><em>Intruder </em>- Foul entities that visit the area. Usually easy to detect, but some have the power to end the watch if you're not quick enough to report them.</li><li><em>Light Anomaly</em> - These can alter the lightning of an area by introducing new light sources or modifying existing ones. In nightmare mode, these can alter the player's flashlight.</li><li><em>Object Disappearance</em> - Some objects previously sighted in the area can vanish.</li><li><em>Extra Object</em> - Sometimes, new objects that weren't there before can show up in the monitored areas.</li><li><em>Object Movement</em> - These only happen on objects that are normally present in the area. The object will slightly change position or gain movement of some sort. Some tricky ones involve a couple of objects swapping places with each other.</li></ul>", "metacritic": null, "released": "2023-04-08", "tba": false, "updated": "2023-04-10T11:49:27", "background_image": "https://media.rawg.io/media/screenshots/542/542e69ece995ff26ae02575487c5c447.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Amaakir"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}