{"id": 955052, "slug": "williams-legacy", "name": "William's Legacy", "name_original": "William's Legacy", "description": "<p>Controls:</p>\n<p>WASD - Move character</p>\n<p>QE - Rotate character<br/></p>\n<p>Space - Confirm</p>\n<p>ESC - Open Pause menu</p>\n<p>I - Open inventory (Click the cards to open equip menu)<br/></p>\n<p>M - Mute music</p>\n<p>Plot:<br/></p>\n<p>The games starts right in the first stage. We are introduced to Sir William III. He doesn't remember how he got there. After looking around he sees a strange figure laying in the ground unconscious. Weird, that figure looks just like him. An imposter perhaps.</p>\n<p>He kicks him and shouts:</p>\n<p>\"Hey you, imposter! Who are you?!\"</p>\n<p>The strange figure wakes up and rapidly gets up, pointing his rifle at Sir William.</p>\n<p>\"Wha- Who the hell are you?! And where are we?! Tell me before I blast you!\"</p>\n<p>\"I'm Sir William III, a noble hero from my beloved kingdom! And you, imposter, what is your name? Tell me me before I slay you with my blade!\"</p>\n<p>\"HAHAHAHAH! With that tiny knife?! You know that I can kill you in one shot.\"</p>\n<p>\"What do you mean 'shot'? What kind of bow is that? And you didn't tell me your name yet!\"</p>\n<p>\"I'm Captain Will, a.k.a. \"One Shot Kill\". And this 'bow' is the most powerful gun in the army, it can modify into any weapon, with the right parts.\"</p>\n<p>\"Not very humble, are you?\"</p>\n<p>\"Humbleness is for fools... Wait... Your face... You have my face!\"</p>\n<p>\"No! YOU have my face! You must be a monster. I heard stories about them!\"</p>\n<p>\"Monsters don't exist fool! You must be a spy trying to infiltrate my army!\"</p>\n<p>They both prepare to fight when suddenly a big portal opens in front of them.</p>\n<p>A large figure appears. He looks at the two of them.</p>\n<p>\"Oh... This is interesting. Looks like I have summoned the same person from two different worlds. Well, it's okay. <strong>clears throat</strong> I am the Dual Master and I have a proposal for you two. I will grant you infinite power, in return, you give me your 'Contrast'.\"</p>\n<p>Sir William III swings his sword at him:</p>\n<p>\"I would never make a deal with a demon!\"</p>\n<p>Captain Will points his gun at Dual Master:</p>\n<p>\"I have never seen that kind of technology before. But more importantly, that deal seems shady as hell. So no.\"</p>\n<p>\"Well, I tried. Looks like I'll have to lock you in here, forever.\"</p>\n<p>\"Wh-\"</p>\n<p>Before they knew, the Dual Master disappeared into another portal.</p>\n<p>Sir William says:</p>\n<p>\"He's gone. And what was that about 'two different worlds'?\"</p>\n<p>\"Doesn't matter! We'll have to fight our way outta here! What about a temporary truce?\"</p>\n<p>\"Fine by me!\"</p>\n<p>The game starts.</p>", "metacritic": null, "released": "2023-04-08", "tba": false, "updated": "2023-04-10T12:22:09", "background_image": "https://media.rawg.io/media/screenshots/c7c/c7c521a07f307bd2b348dc39fab0aeef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["LibreTen", "Tomas Oliveira", "brazuca2000"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}