{"id": 955274, "slug": "event-hour", "name": "EVENT HOUR", "name_original": "EVENT HOUR", "description": "<p>Welcome to the game \"Event Hour\"</p>\n\n<p> Game Overview //</p>\n<p> The game is of the type of puzzles and in-depth thinking, as well as research, exploration and time travel</p>\n\n<p> How to Play//</p>\n<p> In the beginning, there is the main menu, which contains 3 buttons. The first is to enter the selection room and start playing</p>\n\n<p> And the second is our website</p>\n<p> And the third is the exit button</p>\n\n<p> After entering the selection room, you will see a portal and a computer in front of it. Go to it and point to it with the sign on the screen, and press the left mouse button to open the door. Then you will find a portal to travel through time, and there is another computer next to it. Go to it and press the mouse button to open it for you.  checklist</p>\n\n<p> There is an audio explanation inside each map that you must listen to carefully in order to know what your mission is</p>\n\n<p> Missions //</p>\n<p> The first map, you must collect data in papers distributed in the map and enter them to deactivate the nuclear reactor</p>\n\n<p> The second map is a desert map, and your task in this map is to search for the missing king's crown before the time limit ends</p>\n\n<p> The third map is a spacecraft map, and your task is to detonate the meteor that is heading towards the Earth</p>\n\n<p> information//</p>\n<p> 1- We worked on the game for about five days intermittently, which is an estimated three hours a day in general, which is equivalent to 24 hours.</p>\n\n<p> 2- What has been accomplished during this period?</p>\n<p> * Three complete levels are designed</p>\n<p> * The U.I. was produced and designed</p>\n<p> * Lots of utilities searched (ASSETS)</p>\n<p> * A cutscene has been created on the third level</p>\n<p> * The game was fully programmed as (ALPHA) version</p>\n\n\n<p> We were not fully dedicated to completing the game to the fullest (the game lacks many factors)</p>\n\n<p> What we intended to add:-</p>\n<p> * Movie scenes</p>\n<p> Realistic lighting</p>\n<p> * Main voices and characters</p>\n<p> * Color processing (Post Processing)</p>\n<p> * Many puzzles and diversity in the way of playing</p>\n<p> * Interaction with the environment</p>\n<p> Moving sky</p>\n<p> * Add Arabic speaking</p>\n<p> * Adding translations and texts to the screen and an assistant system for the player</p>\n<p> * Add a realistic movement to the traffic</p>\n\n<p> Unfortunately, time did not support us in order to show you our true level, and I hope that everyone takes into account that the duration of work on this game is approximately (18-24 hours maximum)</p>\n\n<p> Thank you for your opinions in advance and we wish you a good time and an enjoyable experience</p>\n<p> I wish you best wishes</p>\n<p> This is Mohamed Dev from the WOLF EVIL team</p>\n\n\n<p> Sites from which estes were derived (resources)</p>\n<p> SketchFap</p>\n<p> Free3D</p>\n<p> 00C Texture</p>\n<p> Free PBR Texture</p>\n<p> Unity asset store</p>\n<p> YouTube</p>\n<p> Google</p>\n\n<p> Note: You will find pictures with an explanation of all the game controls, please look into them</p>\n<p>note</p>\n<p>//The mouse pointer has been intentionally left to control menus, input, and the user interface</p>\n\n<p> And the cursor in the middle of the screen is used to interact with the environment, such as operating devices, opening doors, and also reading some papers</p>\n\n<p>In the following pictures we explain that</p>", "metacritic": null, "released": "2023-04-07", "tba": false, "updated": "2023-04-10T14:01:33", "background_image": "https://media.rawg.io/media/screenshots/d78/d7800e10733bc8f7dd13a47680845efd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WOLF EVIL STUDIO"], "genres": [], "publishers": [], "esrb_rating": null}