{"id": 955343, "slug": "paint-with-wind", "name": "Paint With Wind", "name_original": "Paint With Wind", "description": "<p>\"Yunshan Rain\" is a Chinese-style casual puzzle game. Each level in the game is a faded landscape painting, and players need to recolor these paintings. By comparing the original painting provided in the game with the picture on the screen, players use their mouse and keyboard to gather the \"painting intention\" that randomly appears on the screen to form \"colorful clouds\". The \"colorful clouds\" then drop raindrops in the corresponding positions, allowing the painting to be recolored. Players must complete the recoloring of the entire painting within a designated time limit to pass the level. These paintings are sketches from the artist's youth, recording the mountains and rivers they've visited and the stories they've witnessed. Over time, the colors have faded. The process of recoloring is also a way of slowly awakening the memories buried deep in one's heart.</p>\n\n<p>《云山染雨》是一款中国风休闲益智类游戏。游戏中每个关卡都是一张已经 褪色的山水画卷，玩家需要给这些画卷重新上色。对照游戏提供的原画作图片， 玩家通过鼠标和键盘的配合，将画面中随机升起的“画意”聚拢形成“彩云”，“彩云” 在对应位置降下雨滴，令画卷重新染色。在规定时间内完成整张画卷的染色，使 其恢复原本面貌即可通关。画卷是少时写生之作，记录着踏足过的山川和见证过 的故事。岁月辗转，色彩已然暗淡。重新染色的过程，也是在慢慢唤醒深埋心底 的记忆……</p>", "metacritic": null, "released": "2023-04-07", "tba": false, "updated": "2023-04-10T14:33:05", "background_image": "https://media.rawg.io/media/screenshots/467/467fce46032a39edbc4c73e6b55c32a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ChenZiHong-Gavin"], "genres": [], "publishers": [], "esrb_rating": null}