{"id": 955357, "slug": "van-hellswing", "name": "VAN HELLSWING", "name_original": "VAN HELLSWING", "description": "<p>You are the last surviving vampire slayer facing the hordes of Dracula himself. <br/></p>\n<p>In the dark abyss, on the floating remains of his ruined castle, you are all that stands between our world, and theirs... </p>\n\n\n\n<p>Your arsenal consists of a limited number of tools: your shotgun, your grappling hook, and your trusty legs. Use these to the best of your ability to outsmart the enemy and send them all to hell!<br/></p>\n<ul><li>Run around with <strong>WASD</strong><strong><strong> </strong></strong>and use <strong>Space </strong>to jump</li><li><strong>Hold W+A/D</strong> while in-air near a wall, to wall-run</li><li><strong>Time your jumps right</strong> to get a speed boost</li><li>Use <strong>Shift </strong>to dash</li><li><strong>Hold Left-Click</strong> to charge your gun, and <strong>Release </strong>it to let go of your shot</li><li><strong>Shoot the floor</strong> while grounded to launch yourself</li><li><strong>Shoot the crystal</strong> to heal and score some points</li><li><strong>Hold Right-Click</strong> to grapple</li></ul>\n<p>Compete for the top score by shooting every bat and crystal that you come across. Follow us on social media to see what we're up to, and show us what your top runs and top scores are!</p>\n<ul><li>Twitter: https://twitter.com/VanHellswing</li><li>Instagram: https://www.instagram.com/vanhellswinggame/</li></ul>\n<p>Download the first prototype of our game down below, leave a rating on the page, and let us know what you think in the comments!</p>\n\n\n<p>Codeglue is a high-quality co-development studio from Rotterdam, The Netherlands. With a team of 30 passionate people, we make great games playable on every platform!  <br/></p>\n<p>We love to think of ourselves as collaborative technology specialists. We love collaborating with publishers and fellow game developers, and we are always tinkering with the latest innovations in gaming like VR, AR, and blockchain technology. </p>\n<p>Twice a year we do a week-long game jam at Codeglue, and some real gems come out of those. One of those is Van Hellswing. We've polished it up a little further beyond the game jam state, and feel like we have something truly enjoyable to share with the rest of you.<br/><br/>Van-Hellswing is a brand-new original IP and our love letter to the gaming community, especially to those who love first-person shooters at their core.</p>", "metacritic": null, "released": "2023-04-07", "tba": false, "updated": "2023-04-10T14:39:27", "background_image": "https://media.rawg.io/media/screenshots/c06/c0684fd165aa95f2b0fd72566d7b076d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 369, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Codeglue"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}