{"id": 95547, "slug": "recycl0", "name": "Recycl0", "name_original": "Recycl0", "description": "Le projet\r\n<p>Dans ce RPG tour par tour / Craft Game, découvrez les aventures de Zéro qui doit survivre dans un monde post At0 face à des hordes de créatures (telles que des cochons volants, des chats unijambistes ou encore des ornithorynques racailles) en recyclant un maximum de vieux matériaux pour fabriquer des armes et des objets à usage unique.  100% des assets sont originaux (à l'exception des polices de texte), même les sons ont été enregistrés à la bouche !<br/></p>\n\n\n<p>Le monde étant en destruction, vous n'avez que vos objets recyclés qui sont à usage unique pour vous battre, pas d'arme indestructible ou de magie !</p>\n\r\nComment jouer ?\r\n<p>Dans la phase de craft, vous pouvez glisser vos ingrédients (qui sont sur votre droite) dans le chaudron pour reproduire une des recettes présentes sur les livres. Vous voyez vos objets déjà fabriqués en bas à gauche.</p>\n<p>Dans la phase de récolte, cliquez sur tout les tas de déchets pour ramasser de nouveaux ingrédients.</p>\n<p>Dans la phase de combat, utilisez vos objets pour frapper votre adversaire. Si vous êtes à cour d'objet, vous pouvez ramasser des ingrédients ou en fabriquer de nouveaux, mais attention, ces actions vous coûteront un tour de jeu !</p>\n<p>Chaque ennemi a une faiblesse et une résistance à un type d'arme, arriverez vous à les trouver ?</p>\n\n<p>En espérant que ce petit jeu vous plaise :)</p>\n\r\nCrédits\r\n\n<p>Simon Delavenne (Dedjo0)<br/>- GameDesign, Développement et Management</p>\n<p>Louise Geffroy (Kyakune)<br/>- Graphismes, Animations et UI</p>\n<p>Mélissa Coz (Melusine)<br/>- Graphismes, Animations et UI</p>\n<p>Hugo Delavenne (AvatarsBlanc)<br/>- Composition des bruitages et musiques</p>", "metacritic": null, "released": "2018-07-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/436/436efff78acbff80b21a2652edb39244.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dedjo0", "MelusineLaSorciere", "Kyakune"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}