{"id": 955465, "slug": "until-death-do-us-part-luna", "name": "Until Death Do Us Part (Luna)", "name_original": "Until Death Do Us Part (Luna)", "description": "<p>\" Love is fragile. It shatters easily against the walls of reality. \"</p>\n\n<p>There are those who pick up the pieces with gentle hands and repair what has been broken.</p>\n<p>But even the kindest heart can only give so much love.</p>\n<p>...</p>\n\n<p>There is a way to return to happiness. </p>\n\n<p>What has been given can be taken back again.</p>\n\n<p>A gift from the gods. A hammer, to break, not heal.</p>\n\n<p>Take back what they took from you, dearest heartsmith.</p>\n\n<p>Love is not the only thing a smith can manipulate.</p>\n\n\n\n<p>Project's mostly a learning experience to figure out some things I've always wanted to try, therefore, kinda not very coherent. Focuses mostly on the art part. </p>\n<p>Made it to learn pixel art, better animation and to make combo attacks work in construct.</p>\n<p>Absolutely accomplished my goal. </p>\n\n<p><strong>Controls:</strong></p>\n<p>NOTE: I think it's most fun to play with a controller, but the browser version works with a keyboard. If you'd like to play with a controller, you can download a standard controller input version and another one with different inputs.</p>\n<p>It came to me during the jam that apparently my controller doesn't use the standard inputs, so please check which version works with your model.</p>\n<p>I'd appreciate any feedback on the controls for the normal controller input version as I do not have a standard controller and can't actually check if they're working properly. </p>\n<p>Thank you.</p>\n<p>PS: I have actually no idea how HTML works so if you can't actually play the downloadable games, let me know and I'll put them all separately. </p>\n<p>A-D - Move </p><p>W - Jump</p><p>J - Attack</p><p>I - Heavy Attack </p><p>L - Ranged Attack </p><p>J midair - Air attacks </p><p>I midair - Downward slam </p><p>L midair - Homing attack</p><p>S in menu - switch through </p><p>I in menu - select</p>\n\n\n\n<p>This was made for XAMK Game Jam during Spring 2023. Made solo by me and took around 44 hours of work. I slept exactly 5 hours.</p>\n\n\n<p>Art and Game Design by me</p>\n<p>Music:</p>\n<p>https://opengameart.org/content/upbeat-chiptune-theme</p>\n<p>https://freesound.org/people/luckylittleraven/sounds/117776/ - luckylittleraven<br/></p>", "metacritic": null, "released": "2023-04-02", "tba": false, "updated": "2023-04-10T15:21:59", "background_image": "https://media.rawg.io/media/screenshots/d00/d00a1394467d633a2e1c1e9005586ea0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "macOS", "PC"], "developers": ["Luna"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}