{"id": 9554, "slug": "freestyle-football", "name": "FreeStyle Football", "name_original": "FreeStyle Football", "description": "Freestyle Football is a football game where you play using four players and one goalkeeper. During the game, you do not control all of the players simultaneously- rather, each player controls one player on the field.<br/><br/>There are three types of matches in Freestyle Football: fast-paced Battle Matches which allow you to experience the thrilling tension of not knowing when you might score while attacking and defending; Friendly Matches where you can play casual games with friends; and Single Matches for users seeking to escape from the stress of team gameplay and enjoy their own play time. <br/><br/><strong>Awesome features include:</strong><br/><ul><li>\tUse real-life football strategies and techniques as well as communication with other users for the ultimate team game play experience! <br/></li><li>\tTrain your own customized and unique characters to dominate the football field! <br/></li><li>\tA huge variety of over 50 skills including everything from realistic football techniques to exaggerated skills infused with fantasy!<br/></li><li>\tTrain even more powerful characters which are suited to your own gameplay style through the five-stage training system!! <br/></li><li>\tOffense, midfield and defense each clearly represent the characteristics of the position preferred by the player through further division into four positions each for a total of 12 positions<br/></li><li>\tEvaluate individual and team contributions to gameplay through the record and evaluation system where you need not only good attack and defense records but also assists, base points and killer passes in order to succeed!<br/></li></ul>", "metacritic": null, "released": "2017-02-22", "tba": false, "updated": "2023-07-29T14:53:03", "background_image": "https://media.rawg.io/media/screenshots/79d/79de65dc73bc3434a2ffd70615ef0d2e.jpg", "website": "http://freestylefootball.gamekiss.com/main", "rating": 2.62, "rating_top": 1, "added_by_status": {"yet": 7, "owned": 288, "dropped": 1}, "playtime": 2, "achievements_count": 41, "ratings_count": 13, "suggestions_count": 321, "game_series_count": 0, "reviews_count": 13, "platforms": ["PC"], "developers": ["Joycity"], "genres": ["Action", "Sports", "Casual", "Indie"], "publishers": ["Joycity"], "esrb_rating": null}