{"id": 955422, "slug": "the-shattered-sigil-of-harmony", "name": "The Shattered Sigil of Harmony", "name_original": "The Shattered Sigil of Harmony", "description": "Info\r\n<p>The Shattered Sigil of Harmony is a grid based dungeon crawler made during the Dungeon Crawler Jam 2023 #dcjam2023 hosted by https://dungeoncrawlers.org/</p>\n\n<p>There is an HTML 5 version that you can play directly in the browser, or an Windows 64bit Version available for download.</p>\r\nStoryline\r\n<p>In the world of Cyronia, the Sigil of Harmony maintained balance and peace, uniting all beings in a state of perfect equilibrium. Yet, a sinister force, envious of this harmony, sought to disrupt it. Shattering the Sigil into two pieces - the Ring of Unity and the Ring of Duality - the malevolent power unleashed a rift in reality, causing the world to fracture into two parallel dimensions. As the Champion of Cyanida, you must embark on a perilous journey to recover the rings, reforge the Sigil of Harmony, and restore balance to the fractured realms of Cyronia.</p>\r\nMovement\r\nBasic movement\r\n<p>Use WASD to move/strafe (or numpad 8, 4, 6, 2).</p>\n<p>Use QE to rotate 90° (or the numpad 7, 9)</p>\r\nAttack/Interact\r\n<p>Use the spacebar (or numpad 5) to attack or interact with objects.</p>\r\nHealing\r\n<p>Use the left control key (or enter on the numpad) to consume a healing potion.</p>\r\nUsing the Ring of Duality\r\n<p>You will need to find rift energy to charge the Ring of Duality. Once it is charged you can use it to port the other reality. Using the 'Tab' key or the numpad 0 key. </p>\r\nMenu\r\n<p>Press the 'M' key to access the in game menu to restart or quit the game.</p>\r\nGameplay\r\n<p>At the start of a new game you can pick your boots. The boots of \"Limited time compression\" will give you instant tile movement, however since time will be compressed, this also affects enemies.</p>\n<p>You will receive the \"Ring of Duality\" that will enable you to switch between the two dimensions, but there is a small catch to it. The ring requires \"Rift-Energy\" so collecting this may help you progress towards the arch evil as they are slight differences between the realities.</p>\n<p>Your task is to defeat the evil, claim the \"Ring of Unity\" and reforge the \"Sigil of Harmony\" once again. </p>\r\nStretch goals for the jam\r\n<ol><li>Riddels, doors and traps. They all where postponed after the jam.</li><li>You can use the Ring of Duality on enemies to switch souls with them, enabling you to open doors, sleep on trap doors triggers, drop special loot to the ground.</li><li> The look of the other dimension is completly different (open world instead of a dungeon).</li><li> You can pick the \"Necklace of the third eye\" which will enable a automap and visible healthbars and possibly other things. Or the \"Necklace of the unseen\" which will disable all helper functions for a more hardcore experience.</li><li>More secrets/spinners/teleporters and fun stuff.</li><li>Load &amp; Save.</li><li>An useable inventory system (pickup/drop)and equipable items with stats.</li><li>Make the controls configurable.</li><li>Everything else what it takes to make a good crawler but had to be cut out because of the time constrain.</li><li>Options and overall better UI.</li></ol>\r\nAttribution\r\n<ul><li>The game uses some PBR textures from FreePBR (https://freepbr.com/) for the floor and walls textures.</li><li>Voice overs generate with Replica studio (https://replicastudios.com/)</li><li>The movement is based on my advanced grid movement script https://github.com/LutzGrosshennig/unity3d-advanced-grid-movement</li><li>The logo was generated by Midjourney AI (https://www.midjourney.com/)</li></ul>", "metacritic": null, "released": "2023-04-06", "tba": false, "updated": "2023-04-10T15:05:39", "background_image": "https://media.rawg.io/media/screenshots/c26/c269d6f77dde627eda05e899c20047af.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["LutzGrosshennig"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}