{"id": 955552, "slug": "fear-of-mine", "name": "Fear Of Mine", "name_original": "Fear Of Mine", "description": "<strong>Fear Of Mine</strong> - A Thrilling Visual Novel Adventure<br/><br/>Setting is in Anti-utopia cyberpunk world, 2040.<br/><br/>Embark on a heart-pounding journey through the anomalous mine of the future in this visual novel. With 10 chapters planned, one of which is already available, this mysterious and unexpected story will keep you on the edge of your seat.<br/><br/>In the year 2040, the mining industry is in crisis due to a shortage of tools. But one cutting-edge company, X-Company, has developed advanced nano-tools to meet the demands of the industry. You'll play as one of the miners of the future, tasked with working in a mine where ominous experiments were once conducted. The past horrors of the mine still linger, and the scientists who conducted the experiments have long since become monsters themselves. But even they couldn't have predicted the terror that would be unleashed when they opened Pandora's box.<br/><br/>Here's what you can expect from <strong>Fear Of Mine</strong>:<br/><br/>✔ Interactive story<br/>✔ An unexpected and intriguing plot<br/>✔ An original universe, ripe for expansion<br/>✔ A hauntingly beautiful original soundtrack<br/>✔ Plot twists that will leave you breathless<br/><br/>Take a look at what's in store:<br/><br/><br/><br/>Get a glimpse into the world of the anomalous mine with this short gameplay GIF animation.<h3>Characters</h3><br/>Meet the characters in <strong>Fear Of Mine</strong>:<br/><br/> Alex<br/> Kira<br/> Neath<br/> Zoook<h3>Style</h3><br/>Marvel at the breathtakingly beautiful and haunting art style of the game through these screenshots.<br/><br/><br/><h3>Concept:</h3><br/><br/><br/><br/><br/>Get a deeper look into the world of <strong>Fear Of Mine</strong> with this concept art and character design.<br/><br/><br/>and other....<br/><br/><strong>The visual novel adapts a story that was once featured on YouTube and now it's time for you to experience it in a new and thrilling way. Don't miss out on this opportunity to experience fear like never before.</strong><br/><br/>Experience the horror and tension of the anomalous mine for yourself in <strong>Fear Of Mine</strong>.", "metacritic": null, "released": "2023-04-10", "tba": false, "updated": "2023-04-14T04:40:37", "background_image": "https://media.rawg.io/media/screenshots/974/974c5aa318716c33e767333b371b0630.jpg", "website": "https://fearofmine.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["NVG Games", "Vopilov Group"], "genres": ["Adventure", "Indie"], "publishers": ["New Vektor Group", "Vopilov Group"], "esrb_rating": null}