{"id": 955505, "slug": "cosmic-clash-chennyyun-idlesoldier", "name": "Cosmic Clash (chennyyun, idleSoldier)", "name_original": "Cosmic Clash (chennyyun, idleSoldier)", "description": "<p>Compatible<strong> with Xbox controllers</strong></p><p><strong>Cosmic Clash </strong>- Game Development Process and Playtesting</p>\n<p>Hello everyone,</p>\n<p>We are excited to share our journey of developing Cosmic Clash, a thrilling 2D shooting game set in space. Our team of three members worked tirelessly to create an immersive player experience with challenging levels and exciting gameplay mechanics. Let's take a look at the development process and the challenges we faced along the way.</p>\n<p><strong>Game Development Process:</strong>\n</p>\n<p>We started our game development process by brainstorming ideas and conceptualizing the game mechanics. Once we finalized the concept, we divided the tasks among team members. I was responsible for creating the sprites with bones and their animations, as well as implementing the player movement and weapon systems. We used Unity2D for game development, which provided us with a wide range of tools and features to bring our vision to life.</p>\n<p>One of the key aspects of our game was the player's ability to travel through different worlds and face different enemies in each level. We created four levels in total, with the tutorial level serving as the introduction to the game mechanics. The first level required the player to find and destroy enemy spaceships, while the second level involved killing enemy characters and rescuing a friend. The third level was the boss level, where the player had to battle against both enemy spaceships and characters. We also included a mini-map to help players with navigation and coordination.</p>\n<p><strong>Playtesting:</strong>\n</p>\n<p>As we progressed with the development, we conducted extensive playtesting to gather feedback and make necessary improvements. We invited friends and family to playtest the game and gathered their feedback on gameplay mechanics, controls, and overall player experience. This helped us identify areas that needed improvement and make necessary adjustments to ensure a polished and enjoyable gameplay experience.</p>\n<p><strong>Successes:</strong>\n</p>\n<p>We are proud of the following successes in our game development journey:</p>\n<ol><li>Game Mechanics: We successfully implemented various game mechanics, including player movement, weapon systems, mini-map, and enemy behavior, which added depth and excitement to the gameplay.\r\n  </li><li>Sprites and Animations: Despite facing challenges with sprites with bones and animations, we were able to create visually appealing sprites and animations that added life to the game.\r\n  </li><li>Playtesting: Conducting playtesting sessions helped us gather valuable feedback and make necessary improvements, resulting in a more polished and enjoyable gameplay experience.</li></ol>\n<p><strong>Challenges:</strong>\n</p>\n<p>We also faced challenges during the development process, including:</p>\n<ol><li>Sprite Animations: I personally struggled with sprite animations, as one state would sometimes crash the whole animator, requiring me to spend additional time troubleshooting and fixing the issues.</li></ol>\n<p><strong>What I Learned:</strong>\n</p>\n<p>Despite the challenges, I was able to learn valuable skills during the game development process, including:\r\n  </p>\n<ol><li>Sprite Creation: I learned how to create better sprites with bones and animations, which improved the visual quality of the game.\r\n  </li><li>Game Management: I gained a deeper understanding of game management and organization, as well as how to troubleshoot and fix issues related to animations and states in Unity2D.\r\n  </li><li>Resourcefulness: I learned the importance of seeking out resources, such as tutorials and documentation, to overcome challenges and improve my skills in game development.</li></ol>\n<p><strong>Possible Future Revisions:</strong>\n</p>\n<p>In the future, we plan to make the following revisions to further improve our game:</p>\n<ol><li>Animation Optimization: We will work on optimizing animations and states to prevent crashes and improve overall performance.\r\n  </li><li>Game Balance: We will continue playtesting and gathering feedback to fine-tune the game balance, including enemy behavior, player movement, and weapon systems, to ensure a challenging yet enjoyable gameplay experience.\r\n  </li><li>Additional Features: We plan to add more features, such as power-ups, different types of weapons, and more levels to expand the gameplay and provide more variety for players.</li></ol>\n<p>In conclusion, the development process of Cosmic Clash was challenging yet rewarding. We overcame obstacles, learned new skills,\r\n</p>", "metacritic": null, "released": "2023-03-31", "tba": false, "updated": "2023-04-10T15:37:38", "background_image": "https://media.rawg.io/media/screenshots/6e4/6e4c334cd3d5b07de57b317a29e07cca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["idleSoldier", "chennyyun"], "genres": [], "publishers": [], "esrb_rating": null}