{"id": 955539, "slug": "crash-bump", "name": "Crash & Bump", "name_original": "Crash & Bump", "description": "<h3>GAME FEATURES</h3><br/><br/><ul><li> Play online with your friends.<br/></li><li> Try to eliminate other players while dodging obstacles.<br/></li><li> Get power-ups with each health pack.<br/></li><li> Customize your character (more customization options coming soon).<br/></li><li> Laugh with the hilarious physics when eliminating opponents or being eliminated.</li></ul><br/><br/><br/><strong>BUT</strong><br/><br/><ul><li> No single player mode (maybe in the future).<br/></li><li> Gamepad doesn't work yet. You can play with it in-game (not for menus), but it might not work as expected.</li></ul><h3>Note From The Developer</h3><br/><br/>Hi everyone! I'm Darian, the creator of Crash &amp; Bump, and I'm thrilled to introduce you to my video game. I was inspired by my love for shooter games but wanted to give it a different twist and thought that adding obstacles would be a fun way to do so, thus Crash &amp; Bump was born.<br/><br/>The entire game has been made by me, and it has taken me over 2 years to develop it so far.<br/><br/>My goal with Crash &amp; Bump is to offer a fun, action-packed gaming experience that puts your skills to the test. And with each new update, I am committed to improving and adding new features to make the gaming experience even more exciting.<br/><br/>If you decide to purchase a copy, I want to thank you in advance for your support, and I hope you enjoy the game as much as I enjoy creating it. Thank you for playing and being a part of the development process of Crash &amp; Bump!", "metacritic": null, "released": "2023-04-13", "tba": false, "updated": "2023-04-14T04:24:32", "background_image": "https://media.rawg.io/media/screenshots/2c3/2c33e1f63abe57ae0d06f8a41fd513bc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Darian Verduzco"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Darian Verduzco"], "esrb_rating": null}