{"id": 955626, "slug": "hybrislave", "name": "Hybrislave", "name_original": "Hybrislave", "description": "《Hybrislave》 is the first part of Hybrislave developed by \"触手折檻部屋\" and officially released by BokiBokiGames!<br/>※This is a short story of the prologue, there will be a longer theme story in the future!<br/><h3>◆Story</h3><br/>Once upon a time, the sudden appearance of monsters called \"Burana\" invaded human territory, and a war between humans and Burana broke out. <br/>Many men were killed and women were raped, but after a long battle, humans finally sealed the gate to the Makai. <br/>However, the losses suffered by various countries were enormous, and they are still struggling to rebuild their countries. <br/>Many areas still lack basic infrastructure, and the Burana that have survived in various places are breeding and continuing to survive...<br/><br/>　――This is the story of a girl living in such a world.<h3>◆Concept</h3><br/>This work mainly depicts a story of \"the protagonist being strong and unyielding even after experiencing harsh hardships\".<br/><br/>Although this is a very short story, every erotic scene is extreme and relentless!<h3>◆Character Introduction</h3><br/><br/><strong>Raira</strong><br/>The protagonist of this work. <br/>She is a lively and energetic girl. <br/>For some reason, she lives in an orphanage and works hard to solve the problems of the village. <br/>Although she looks no different from humans, she is actually called a \"mixed race\" and has both human and Burana bloodlines, she hides this fact.<br/><br/><br/><strong>Risha</strong><br/>A nun who manages the orphanage. <br/>For Raira, she is like her older sister. <br/>Since the war with Burana, the subsidy has decreased, and she has had to resort to emergency management. <br/>And her way of earning money is...<h3>◆Game Features</h3><ul><li>Classic RPG game style<br/></li><li>There are 3 types of Endings<br/></li><li>Quickly unlock all the erotic scenes in the memory room</li></ul>", "metacritic": null, "released": "2023-04-11", "tba": false, "updated": "2023-04-14T06:18:22", "background_image": "https://media.rawg.io/media/screenshots/ca2/ca22919f4d13933eee17a886f1b8f770.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 446, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["触手折檻部屋"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["BokiBoki Games"], "esrb_rating": null}