{"id": 955699, "slug": "sky-haven-tycoon-airport-simulator", "name": "Sky Haven Tycoon - Airport Simulator", "name_original": "Sky Haven Tycoon - Airport Simulator", "description": "\n\nBecome the biggest airport tycoon and create a home and route connections for both planes and passengers. Create your very own Skyhaven airport sandbox.\n<br/>\nHave you ever had a flight or travel delayed or canceled or not been able to get your baggage right away? Real airports can often be annoying, inconvenient and an emotional rollercoaster to visit - so why not build your own? \n\n<br/><br/>\n<br/>\n\nBuild every part of your own airfield. Construct everything from landing strips, control towers, roads, parks, terminals, gates, buildings and much more. Buy extra land to expand your airport to city size and manage a world of planes, pax and cargo.\n\n<br/>\n\nBut you can go even deeper. Not only can you plan the entire layout of your airport, but you can also design the smallest details in the terminals to get the most optimal passenger flow.\n\n<br/><br/>\n<br/>\n\nManage the entire airport to keep clients and passengers happy and satisfied in order to create a healthy economy. Make sure there is a bus or car for every man or woman that needs to get to a terminal, check if you have the fuel needed, transport their luggage safely and so on.\n\n<br/>\n\nA well managed place for planes is a direct route to success.\n\n<br/><br/>\n<br/>\n\nSkyhaven is more than just an airport building simulator. You can play out the entire history of airplanes all the way back from 1916 and into modern days, where you research and develop your way through the years to improve your technology and facilities.\n\n<br/>\n\nYou can choose your own difficulty and start with a lot of money if you are new to city builders or you can create a real challenge for yourself and create your empire from scratch.\n\n<br/><br/>\n<br/>\n\nThe strategy you create matters and determines how your airport looks and works. Remote or bridged ramps? Charter or regular flights? Big or small aircrafts? Domestic passengers or connected flights? Fly single planes or entire airlines? You are the manager of this tycoon/simulation and the world is your sandbox.", "metacritic": null, "released": "2022-11-19", "tba": false, "updated": "2023-04-14T07:59:28", "background_image": "https://media.rawg.io/media/screenshots/fb3/fb3232105628a15196c90fa25f08fedc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 371, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Real Welders"], "genres": [], "publishers": ["Real Welders"], "esrb_rating": null}