{"id": 955609, "slug": "platos-disciple-on-wall-street-with-20-playpacks", "name": "PLATO'S DISCIPLE ON WALL STREET (WITH 20 PLAYPACKS)", "name_original": "PLATO'S DISCIPLE ON WALL STREET (WITH 20 PLAYPACKS)", "description": "<h3>Welcome to our unique &amp; original Day trading game!</h3><strong>Don't be fooled by its game title! </strong>This simulator focuses on BUY/SELL practice with <strong>real</strong> market data. The gamer can play stocks like google, amazon, tesla endlessly without financial risk, also learn to manage emotions such as panic, greed, fear while facing the market! See if you can beat the market or not... Good Luck!<br/>============================<br/>Game features:<br/>1. Focusing on BUY/SELL sensitivity training. SIMPLICITY is the key point of this game. NO NEED to memorize hundreds buttons and indicators, because at the end of the day, BUY/SELL decision is the only thing that matters to a day trader.<br/><br/>2. Just launch and play it offline, no registration, no login, no membership. The whole game is self-contained, with built-in 20 PlayPacks. 1 Pack = 5 stocks X 1 day session. 20 Packs = 100 day trading sessions.<br/><br/>3. The PlayPack data are not random fake numbers, it's from real stock market (NYSE, NASDAQ) with real numbers, not by hour, not by 30 min, not by 15 min, not by 5 min, but minute by minute.<br/><br/>4. Scores and candlestick charts saved locally and can be reviewed offline. (Pro DTs always review their transactions and think of improvements)<br/><br/>Bonus feature: other than built-in 20 PlayPacks, the player can also download most recent PlayPack (which holding latest market data) from vendor's website for FREE. (*NOTE* the future availability of this feature is not guaranteed)<br/>============================<br/>This game is simple but<strong> NOT EASY!</strong><br/>You pin, pan, drag, zoom in/out candle-stick charts just do what a real day trader does. With the flowing in of the market price bars, you can really feel the market pressure!", "metacritic": null, "released": "2023-04-11", "tba": false, "updated": "2023-04-14T05:55:45", "background_image": "https://media.rawg.io/media/screenshots/851/851161d45e9d3dcd8d00810e4a934e0e.jpg", "website": "https://AristotleIsNotAlwaysRight.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aristotle Is Not Always Right"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Aristotle Is Not Always Right"], "esrb_rating": null}