{"id": 955652, "slug": "gravel-gang", "name": "Gravel Gang", "name_original": "Gravel Gang", "description": "Gravel Gang is a simple but challenging real-time strategy/tactic casual game.<br/>\n<br/>\r\nMake smart plans and show your strategic skills, fight and conquer the challenging maps to WIN!<br/>\n<br/>\r\nYou will be richly rewarded for victories, you can buy epic heroes and prove your skills with them.<br/>\n<br/>\r\nDownload it and experience for yourself!<br/>\n<br/>\r\nEVERY MAP IS A NEW CHALLENGE<br/>\r\nMaps with 3 to 6 players and some with holes in the middle. Each opponent starts from a corner and tries to conquer the map. Last team standing is the winner, try to survive, invade areas, fight enemies in big gang-wars and show your strategic-thinking-skills.<br/>\n<br/>\r\nNEW HEROES TO UNLOCK<br/>\r\nEarn coins and unlock new heroes. From humans to witches and zombies, it's all there.<br/>\r\nEach hero comes in 6 different colors and you can unlock them all at once!<br/>\n<br/>\r\nPLAYABLE OFFLINE<br/>\r\n3 different bot difficulty levels, with which there is a certain challenge for everyone, more difficult maps offer much more reward. Even without an Internet connection, fun is guaranteed, because the game is also playable offline.<br/>\n<br/>\r\nFREE GAME<br/>\r\nPlay this game without spending money, we provide you with free updates and new content constantly. Earn a lot of coins from wins in different Maps, collect the rewards from achievements and buy great heroes with them.<br/>\n<br/>\r\nONLINE MULTIPLAYER COMING SOON<br/>\r\nWe are currently working on the online multiplayer, the same Maps with a lot more Skins will be soon available for the online multiplayer. Until then, you can play and get better to have the advantage.<br/>\n<br/>\r\nNEW ACHIEVEMENTS<br/>\r\nWith great rewards to claim, one can now start unlocking and collecting achievements. The rewards bring with them new goals to achieve, while having fun in the challenging maps.<br/>\n<br/>\r\nAll contents of Gravel Gang - GG are freely available, some content is available for purchase.<br/>\n<br/>\r\nGame created by 'InArt Games' - stay tuned for new epic content!", "metacritic": null, "released": "2023-04-12", "tba": false, "updated": "2023-04-14T06:55:05", "background_image": "https://media.rawg.io/media/screenshots/167/167e157bee803d5b552123ecb2304225.jpg", "website": "https://5ff20d5adf761.site123.me", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ismail Inan", "Jens Burkhart"], "genres": ["Action", "Strategy", "Simulation", "Casual"], "publishers": ["InArt Games"], "esrb_rating": null}