{"id": 955696, "slug": "trine-5-a-clockwork-conspiracy", "name": "Trine 5: A Clockwork Conspiracy", "name_original": "Trine 5: A Clockwork Conspiracy", "description": "<p>Trine 5: A Clockwork Conspiracy will take Amadeus the Wizard, Zoya the Thief, and Pontius the Knight on their most action-packed journey yet!<br />\nWith their reputations tarnished, loved ones in danger, and their own magical powers at stake, the Heroes of Trine must reunite to push back a fearsome Clockwork army and bring peace and justice to the land!<br />\nTraverse breathtaking 2.5D landscapes in Trine&#39;s deepest and visually richest chapter to date, with an all new cast of characters - some friends, some foes, but all unforgettable.<br />\nWhether by yourself or playing with up to three friends in online and local co-op, the upgraded puzzle difficulty system keeps things fresh, adapting the challenge to the number of players.<br />\nLevel up the heroes&#39; abilities with the all-new skill quest system, growing their legend as they are once again united by… the Trine!<br />\n2.5D adventure with world-renowned puzzle platformer action<br />\nCombine forces in 1-4 players (single player, local and online co-op)<br />\nAccessibility and replayability through an adaptive difficulty system for both combat and puzzles<br />\nBeautiful fantasy world with stunning visuals<br />\nNew combat system and tense boss encounters<br />\nFairytale soundtrack, as well as a voice cast of returning favourites and charming new additions<br />\nCharacter-specific skill quest system adds greater depth and playstyle variety than ever before<br />\nTrine&#39;s most epic tale yet, with more levels, puzzles, and battles than previous entries<br />\nExpress yourself - deck the heroes of Trine out in customisable outfits<br />\nBring the kingdom back from the verge of clockwork oblivion in Trine&#39;s most magical story, with fiendish villains and memorable allies</p>", "metacritic": null, "released": "2023-08-31", "tba": false, "updated": "2024-02-25T01:17:58", "background_image": "https://media.rawg.io/media/games/d15/d15d9aabb5b8d0479f351ef530a266f3.jpg", "website": "https://trine5.thqnordic.com/", "rating": 4.25, "rating_top": 4, "added_by_status": {"yet": 18, "owned": 21, "beaten": 17, "toplay": 44, "dropped": 4, "playing": 7}, "playtime": 6, "achievements_count": 62, "ratings_count": 16, "suggestions_count": 398, "game_series_count": 0, "reviews_count": 16, "platforms": ["Xbox Series S/X", "PC"], "developers": ["Frozenbyte"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["THQ Nordic"], "esrb_rating": null}