{"id": 955620, "slug": "floating-islands-of-nucifera", "name": "Floating Islands of Nucifera", "name_original": "Floating Islands of Nucifera", "description": "<h3>The World of Nucifera</h3>The islands of Nucifera hang in the skies. What were once gleaming paradises have become the dwelling places of monstrous horrors. Take the helm as Rosanna, daughter of an esteemed merchant and wizard - sail to Nucifera, strike down its abominations, recover past treasures, rebuild your family's legacy, and rescue your lost father!<h3>Customizable Shop Management</h3><br/><ul><li>Take full control of your shop’s inventory! Decide which of Nucifera’s weapons, armors, jewelry, potions, and more you’ll stock your shelves with, and what cost you’ll price them at. <br/></li><li>Decide your shop’s layout! Arrange the shelves and items in your store in whichever way you want, to maximize your profits. <br/></li><li>Set your own selling strategy!  Hone your bargaining skills as unique customers attempt to talk items’ costs down to their distinct preferred prices. Do you stay firm and maybe lose a sale, or give a bit and potentially lose profit?<br/></li><li>Go big or go home! Buying a bigger shop means more shelves, more items, more customers, and possibly more profits… Do you upgrade?</li></ul><h3>Navigate Nucifera in Your Upgradeable Airship</h3><br/><ul><li>Air travel is the only travel! Fast travel from the mainland to Nucifera’s floating islands and between the islands themselves in your rugged airship. <br/></li><li>Choose how and when you upgrade your ship! Do you install larger cargo hulls to carry more loot back to your shop? Do you overhaul the engines to travel faster and save time? Do you convert your ship from your home into an adventurer’s ship to fly even faster and carry even more? The choices are yours!</li></ul><h3>Choose Your Quests, Reap Your Rewards</h3><ul><li>Unlock rewards while questing in an open world! Completing a quest in one of Nucifera’s provinces will unlock that specific area’s unique customers for your shop, new floating islands, and possibly also a dungeon key...<br/></li><li>Expand the number of monsters you can summon! Complete quests to acquire dungeon keys, defeat the monsters lurking in the dungeons’ depths, and then use these newly captured familiars to do battle with Nucifera’s other horrors.</li></ul><h3>Turn-Based Monstrous Fights</h3><br/><ul><li>Danger dwells in the skies! Travel to the islands to take on the monsters lurking there, with your own roster of familiars. <br/></li><li>Strategize in the midst of turn-based fights! Successfully landing hits on monsters or blocking monsters’ attacks will charge up your own familiars’ unique abilities.<br/></li><li>Run the gauntlet, claim the prize! Completing individual checkpoints within a fight will land you partial rewards. Completing a full fight will net you the entire reward.<br/></li><li>Each island’s fight is different! Nucifera’s monsters are numerous and varied, and so are their rewards…<br/></li><li>Choose the plunder to take home! Your airship can only hold so much. Which items from your rewards do you take with you?</li></ul>", "metacritic": null, "released": "2023-04-11", "tba": false, "updated": "2023-04-14T06:11:12", "background_image": "https://media.rawg.io/media/screenshots/5ab/5abd7393c0da983ee6b578f8d254f084.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 290, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Odooh Games"], "genres": ["Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["Odooh Games"], "esrb_rating": null}