{"id": 95580, "slug": "forget-away", "name": "Forget Away", "name_original": "Forget Away", "description": "<p>Forget away is a first person interactive game based in a small cozy cabin. The story revolves around two lovers Kina and Nora and the mysteries surrounding an eventful night of their accident. Kina has to find out what happens and is torn between staying in her blissful ignorance or finding the bitter truth.</p>\n<p>Hey friendos, my name is Joanna Tran and I'm a first year Game Design student at RMIT university. This is a huge learning experience for me as it is my first game that I have ever made! Please enjoy and thank you for playing! :)</p>\n<p>This project is a starting point for a huge weird idea I have in my head and hopefully I can further pursue this story and game and make something bigger from it! If the feedback I receive from my teacher or friends (or even strangers) is good then maybe I will try to expand from it further :DD</p>\n<p>I have never published anything like this online before so I'm still not 100% sure what I need to put here or what I need to credit or what I don't but I'll try credit everything I can think of!!</p>\n<p><strong>*</strong><strong> Known issues: </strong><em>(Please be aware of them when you play the game!)</em><br/></p><ul><li>The volume of the audio files are all out of whack so the background/ ambient noises will probably be much louder than those of the voice acting. <em>[HEADPHONES/ EARPHONES RECOMMENDED OR MAYBE TURN THE VOLUME UP. THIS IS UNTIL I FIGURE OUT HOW TO WORK WITH THE SOUND IN UNITY :(]</em></li><li>Your head might bump into the ceiling/ or do something weird at the stairs. A collider was put there because when I was making the model of the cabin itself I didn't realize that I made the gap between the stairs and the next level too small so the player would just go through the ceiling. It's really funky but it was what was put in place to prevent that from happening.</li><li>Pages may be hard to reach but you can read all of them.</li><li>Forgot to but a box collider around shelf on top level.</li></ul>\n<p><strong>Audio:</strong> [ALL AUDIO FILES ARE ROYALTY FREE]</p>\n<p><strong>Songs:</strong></p>\n<ul><li>Bet on it - Silent Partner</li><li>Hi, be mine - Muciojad</li><li>Sandbox - Silent Partner</li></ul>\n<p><strong>SFX:</strong></p>\n<ul><li>Thunderstorm - rhumphries (freesound.org)</li><li>Fire crackling - dobriode (freesound.org)</li><li>Chimney Fire - reinsamba (freesound.org)</li></ul>\n<p><strong>Voice over:</strong></p>\n<p>Done by my amazing talented friend <em>Evanna Pirlo </em>who I really wish to meet one day. &lt;3</p>\n<p><strong>E: </strong>cowspider202@gmail.com<br/></p>\n<p><strong>IG: </strong>@bananaevanna<br/></p>\n<p><strong>Fonts:</strong><br/></p>\n<p>- Moon Flower: Denise Bentulan [<strong>http://douxiegirl.com</strong>]</p>\n<p>- A little sunshine: Vanessa Bays [<strong>http://bythebutterfly.com</strong>]</p>\n<p>Made in Unity. All assets and drawings are done by me unless they were from the standard assets thingo in unity!! (<em>I promise I draw better than what is shown in the game xx</em>) I would also like to thank my lovely boyfriend for helping me with the scripts and coding when I was very close to crying and calling quits.</p>\n<p><strong>Contact me:</strong><br/></p>\n<p><strong>E: </strong>tran.joanna97@gmail.com<br/></p><p>T: @joatra_</p>", "metacritic": null, "released": "2016-10-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c63/c63635a244faabbeac0aab36c4d05558.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["joot"], "genres": [], "publishers": [], "esrb_rating": null}