{"id": 955873, "slug": "office-escape-hook-line-and-sinker", "name": "Office Escape: Hook, Line and Sinker.", "name_original": "Office Escape: Hook, Line and Sinker.", "description": "<p>Office Escape: Hook, Line, and Sinker is a charming  top-down stealth game where you play as Bob, an overworked office worker who dreams of enjoying the great outdoors. Bob is tired of the daily grind and yearns for a sunny day out fishing. Help Bob sneak out of his mundane office job and avoid getting caught by Managers, Sticklers, and security guards, so he can finally cast a line and reel in a day of serenity!\r\n</p>\n<p>In this exhilarating adventure, you'll need to carefully navigate the labyrinth of cubicles, conference rooms, and break areas while staying out of sight from your pesky coworkers. Each enemy type presents its unique challenges: Managers with their watchful gaze, Sticklers who are eager to rat you out, and vigilant security guards who won't hesitate to escort you back to your desk.\r\n</p>\n<p>As you progress through the game, you'll encounter various obstacles and puzzles. Utilize office furniture to hide as you tiptoe your way to freedom. Will you be able to help Bob outwit his colleagues and successfully trade his office chair for a fishing chair? <br/></p>\n<p>Help Bob fulfill his dream of enjoying the great outdoors! Embrace the challenge, strategize your moves, and reel in the fun. Happy sneaking!</p>\n<p>Controls:</p>\n<p>Arrow keys: Move</p>\n<p>E: Interact<br/></p>", "metacritic": null, "released": "2023-04-13", "tba": false, "updated": "2023-04-14T09:18:30", "background_image": "https://media.rawg.io/media/screenshots/01b/01b6f1253f6e37b6e70ebc2aeef3e7d9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["freezyblanco"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}