{"id": 95591, "slug": "dragonflying", "name": "Dragonflying", "name_original": "Dragonflying", "description": "<p>Shoot, drive, upgrade, puzzle and explore on your spacebike, the Dragonfly, as you uncover what mysteries lie behind the vast dunes and canyons of the arid desert planet of Yar in the Centauri system.<br/></p><p>What's the worst that can happen? But in case you run into more trouble than just sand-filled socks, your iron horse, the \"Drake Dragonfly\", will carry you the extra mile. Upgrade, customize, color and equip your trustworthy steed accordingly, for more than paint may chip off (SPF 100 is advised!).</p><p>Dragonflying is a Star Citizen fan game created by a team of 3 over 3 1/2 months.<br/></p><p><strong>Features</strong></p><ul><li>Top-down arcade shooting on a vehicle</li><li>Different weapons and items</li><li>Loot and upgrade your Dragonfly and its weapons</li><li>Different enemies and boss fights</li><li>Story with various missions and puzzles</li><li>Side activities: Racing, hacking, exploring</li><li>Full soundtrack</li><li>Secret items and easter eggs</li></ul><p><strong>Some tips</strong></p><ul><li>C toggles control method coupled/decoupled</li><li>1 toggles seperate weapon fire (LMB/RMB instead of LMB)</li><li>2 toggles Turret on/off (once acquired)</li><li>Turrets just hit mechanical targets</li><li>If you get stuck in any way, there's a respawn option in the options menu.</li></ul><p><strong>Platform:</strong> Windows<br/><strong>Language: </strong>English<br/><strong>Input:</strong> Mouse and Keyboard (or some kind of input that mimics that). No controller support.</p><p><strong>Patch notes</strong></p><p><strong>1.0.4</strong></p><ul><li>Added: <strong>Free fly </strong>camera. Implemented this to make some in-action screenshots, so why not make it available for players? Pressing F12 in game will toggle between your player and a flee fry camera, which appears over the players head. The camera is moved with WASD, C and Spacebar. The camera rotates by moving the mouse (If it doesn't rotate try right-clicking or pressing Left Alt). With the mouse wheel the camera speed can be adjusted. While being in the free fly camera the world is \"paused\". There can be some tiny movement. If you go back to your player physics objects can also freak out. This camera moves through terrain and everything. So you can spoil yourself by using it, be aware of that. Have fun!</li></ul><p><strong>1.0.3</strong></p><ul><li>Changed: Big sandworms can now be damaged by laser weapons, but damage is reduced by 50% (Too many people had problems with this and I don't have time for a bigger solution)</li><li>Changed: Harkons Fortress mission now hints to use mines</li><li>Fixed: The secret homing weapon attacks now soldiers and power cores</li><li>Fixed: Mouse cursor is now shown during intro without the need to press Left Alt (some people got stuck here)</li><li>Fixed: Gate won't open if saved after race mission</li></ul><p><strong>1.0.2</strong></p><ul><li>Changed: Missions start earlier at game start to prevent dialogue box blocking cry astro weapon menu</li><li>Added: When starting a new game the player can select between coupled/decoupled mode on the basis of an explanation</li><li>Added: Cry astro weapon menu has an \"X\" to close the menu instead of just driving off the platform</li><li>Fixed: Mouse buttons can be rebound now</li><li>Added: Warning in the keybindings menu if a key is not bound</li><li>Added: Seperate \"Apply resolution\" button for people that have problems with bottom button being cut off</li><li>Added: When pausing ingame, \"Press ESC to resume\" will inform how to get back into the game</li><li>Changed: A lot of people try to use the hook forwards, it can be used forwards now with 1/3 of the range backwards</li><li>Added: The symbols for Coupled/Turret/Firemode in the button left can be clicked now to toggle their functions instead of using keybinds</li><li>Added: Most HUD elements have a tooltip now when hovering over them with the mouse</li><li>Changed: Dialogue after first mini boss will hint now where to go next</li><li>Changed: Color customization has been changed to incentivise pulling the sliders, instead of typing in values</li><li>Changed: Race checkpoints are much more forgiving if the player slips past them a bit too far</li><li>Added: In transport mode a little info box will pop up to inform the player that he is and which keybind to use to change back to normal speed</li><li>Added: A container in the first outlaw camp prevents pushing the box in an unfortunate position</li><li>Added: Armory now says \"Currently equipped\" and \"Select weapon\" for more clarity</li></ul><p><strong>1.0.1</strong></p><ul><li>Fixed: Blade damage upgrades are now getting applied</li><li>Added: Turret description mentions now that it just shoots \"mechanical\" enemies</li><li>Fixed: Upgrade bonus section displays correct values for Bulldog damage, crit and Blade damage now</li><li>Fixed: Turret equips properly after death</li></ul><p>We hope you will enjoy this game! Any feedback is welcome!<br/><em>Saiodin (@Saiodin, Lead, Design, Graphics, Programming, QA)<br/>Utho (@uthoriley, Music, QA)<br/>Andres (@Arvangath, Sound Effects, QA)</em></p><p>This product is a Star Citizen fan work playing in the Star Citizen universe. It is in no way assiociated with CIG or RSI. No assets of the original game have been used. Designs used with permission of RSI.</p>", "metacritic": null, "released": "2017-04-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3cd/3cd36223d357b9f398ebed918d44f359.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 299, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Saiodin"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}