{"id": 955941, "slug": "oryume", "name": "Oryumé", "name_original": "Oryumé", "description": "<strong><em>Oryumé</em></strong>\n<em>Oryumé</em> is an incredible MMORPG world that is reminiscent of a fantasy realm filled with adventure, excitement, and danger. This amazing game offers players the opportunity to immerse themselves in a world where they can live and play as any creature of their choice. Whether you want to be a fierce dragon, a cunning wolf, or a graceful unicorn, you can be anything you want in this world.\r\nOne of the most fascinating aspects of Oryumé is its multiplayer and solo modes. In multiplayer mode, players can interact with one another and engage in exciting quests, battles, and adventures. They can team up to take down powerful enemies or explore new areas of the world together. The sense of camaraderie and cooperation in multiplayer mode is truly remarkable, and players can form lasting friendships with others who share their love for this incredible game.\r\n\r\nOn the other hand, solo mode offers players the chance to embark on an epic journey through the story mode. They can explore the vast, intricate world of Oryumé at their own pace and uncover the rich lore and history that makes this game so special. Players can go on thrilling quests, solve puzzles, and uncover hidden treasures as they make their way through the game.\r\n\r\nAnother fantastic feature of Oryumé is the ability to hunt, breed, and nest. Players can hunt for food and resources to survive in the game. They can also build their own nests and establish their own territories in the game.\r\n\r\nOverall, Oryumé is an incredibly immersive and exciting MMORPG world that offers players a unique and unforgettable gaming experience. Whether you prefer multiplayer or solo mode, you'll find plenty of adventure, excitement, and challenge in this amazing game. So come and join the world of Oryumé, where anything is possible and anything can happen!\r\n<em>FEATURES</em>\r\n- 4 creature\r\n- Open world\r\n<em>CREDITS</em>\n<strong><em>Codeur - Texturing world</em></strong> : FoggoDev\r\n<em>Model - animator 3D</em> : Oska Oskera\r\n<em>Music</em> : Yokee\r\n<em><strong>Designer </strong></em>: Elion\r\n<em><strong>Coming soon</strong></em>\r\n- Other creature\r\n- Bigger map\r\n- New mission\r\n- More options\r\n\r\n- Learn more\r\n- Discord", "metacritic": null, "released": "2023-04-13", "tba": false, "updated": "2023-04-14T09:50:42", "background_image": "https://media.rawg.io/media/screenshots/a26/a26e331848eb053820307672399be67a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["foggo"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}