{"id": 95606, "slug": "tune-it-up", "name": "Tune It Up!", "name_original": "Tune It Up!", "description": "<p>Tune It Up! is a digital music toy that allows players to create a short composition using a drag and drop interface. There are 3 themes to choose from, each with a unique set of art and musical notes, as well as random events that can start a score-based mini-game or change the composition's tempo.</p><p>This project's creation was funded by the Iowa City Public Library and the primary development target was a 1080p touch-enabled table housed in the children's area of the library. For the best experience, we recommend running the app on a touchscreen large enough for multiple players to collaborate, but if you don't have a touch device available, you can still enjoy most of the functionality using a mouse.</p><p>For the library's purposes, an \"Administrator Menu\" can be opened at any time by pressing Ctrl+Shift+A. This menu allows certain game options to be set and allows the user to manage saved compositions. Additionally, a \"Debug Menu\" can be opened by pressing Ctrl+Shift+D.</p><p><strong>If you are interested in using Tune It Up! in a public space (such as a public library), please let us know!</strong></p>Controls:<ul><li>Tap anywhere on the grid to spawn a note</li><li>Tap and drag from one of the four note \"containers\" to spawn a corresponding note, release to place it on the grid</li><li>Tap and drag any existing notes to reposition them on the grid or drop them off-grid to delete them</li><li>Double tap one of the four containers to designate that container as the \"active\" one (notes generated by tapping on grid will come from the \"active\" container)</li><li>Tap the THEME button to change themes</li></ul>Credits:<p>Programming by Eric Neuhaus (@donkeyspaceman)<br/>Art by Colin Greenhalgh (@CuddlyColin)<br/>Music &amp; Sound Effects by Reid Turner (Bandcamp)<br/><br/>Created with Scirra Construct 2<br/>\"Smart\" spritefont by Eeve Somepx</p><p>Funded by the Iowa City Public Library</p>", "metacritic": null, "released": "2016-06-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5c5/5c5cbcc6bdcb39fad245fad276b4cdbd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Virtually Competent"], "genres": [], "publishers": [], "esrb_rating": null}