{"id": 956040, "slug": "moonlight-city-will-survive", "name": "Moonlight City Will Survive", "name_original": "Moonlight City Will Survive", "description": "<p>¡Bienvenido a Moonlight City Will Survive! Este emocionante juego de estrategia combina elementos de cartas y tower defense, donde te pones en la piel de una maga para defender tu ciudad de los invasores. </p><p>Con un hermoso diseño visual, este juego te llevará a través de niveles cada vez más desafiantes, así como al modo horda, donde tendrás que enfrentarte a oleadas interminables de enemigos.</p>\n<p>Moonlight City Will Survive ofrece 5 tipos diferentes de cartas que te permitirán luchar contra los enemigos con una gran variedad de habilidades. Cada enemigo tiene tres cartas distintas que debes eliminar, pero ten cuidado: ¡las cartas tienen un orden específico! Tendrás que usar la estrategia para decidir cuándo y cómo utilizar tus cartas para hacer el mayor daño posible a los invasores.\r\n</p>\n<p>La cámara de Moonlight City Will Survive es totalmente rotativa, lo que te permitirá tener una vista de 360 grados de la acción. Prepárate para ser atacado desde cualquier dirección y pon a prueba tus habilidades para defender tu ciudad de la amenaza enemiga.\r\n</p>\n<p>Moonlight City Will Survive es un juego emocionante y desafiante, creado por seis talentosos alumnos del CIFP César Manrique. ¡Descarga el juego ahora y demuestra que eres el mejor mago en la defensa de tu ciudad!\r\n</p><p>\n</p>", "metacritic": null, "released": "2023-04-13", "tba": false, "updated": "2023-04-14T10:33:58", "background_image": "https://media.rawg.io/media/screenshots/216/21619dc125b6549329c61654ff32489a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "PC"], "developers": ["CesarManriqueGames"], "genres": [], "publishers": [], "esrb_rating": null}