{"id": 95627, "slug": "cake-kills-candy", "name": "Cake Kills Candy", "name_original": "Cake Kills Candy", "description": "<p>Cake Kills Candy was made in a week. Its an arcade platform shooter with procedural generated levels. Stomp and shoot enemies. Score points for getting the key to the door. Bonuses for health and not shooting in a level reward you for strategy over dumb shooting. High score is kept, great with a controller and there are a slew of settings.</p>\n<p><strong>QUICK FEATURES<br/></strong></p>\n<p> - Procedural generated levels<br/> - Arcade scoring system based on level completion<br/>- Happy environment of chocolate and candy canes<br/> - 5 guns<br/>- Giant mega boss fight every 10 levels (11, 21, 31 and so on)<br/> - Mega Man - ish play style with bigger guns<br/>- Full Controller Support</p>\n<p><strong>GAME HISTORY</strong><br/>Made for the Hamjam 2 with a cake theme. Then a day before the game jam ended I noticed a different game jam with a candy theme. Lucky for us we always had the idea of cake kills candy. Two week long game jams with one game.<br/></p>\n<p><strong>UPDATES:</strong></p>\n<p><strong>Version 1.9 (the boss jam)</strong></p>\n<p> - Added huge boss fight.<br/> - Added 3 new tile sets (root beer + cotton candy + orange cream filled bar)<br/> - Added version numbers.<br/> - Added more sound effects.<br/> - Modified a lot of the game to enhance minor details.<br/> - Modified enemy parts and enemy jam.<br/> - Modified candy cane shotgun to be more useful.<br/> - Modified level system to generate easier maps in the starting room.<br/> - Modified music volume so the sound effects stand out more when volume and sound levels are at even percentages.<br/> - Fixed an issue when on rare occasion the enemies falling to the ground would snap to the ground rather than fall to the ground.</p>\n<p><strong>Version 1.5 - 1.8 (after the original cake &amp; candy jams)</strong></p>\n<p>- Added company logo.<br/>- Modified how the backgrounds are generated to hopefully fix an issue.<br/>- Added a low bounce stomp if you hold down when hopping on an enemy.<br/>- Fixed title menu to be more consistent and always show tiles rather than the occassional background.<br/>- Fixed an issue where the player sprite would appear several times instead of once.<br/>- Added a method to turn off controller support in the options to comply for a game jam. The game can still auto detect if you are playing on a controller or keyboard.<br/> - Added a different HUD for life and weapon ammo..<br/> - Fixed a major crash caused by incorrect level loading (this would happen once for each new player).<br/> - Fixed doors appearing too high up on larger levels.<br/> - Modified temporary file cleanup.<br/>- Fixed a specific crash in windowed mode where the game would somehow forget the levels.<br/> - Fixed visual issue with the K in the font.<br/>- Added loading screen. Depending on your computer's processor it will be either a blink or a wait.<br/> - Added larger variety to floor tile sets (wider and taller tiles).<br/> - Fixed background tiles not showing up on the first screen of larger rooms.<br/> - Fixed negative point bonus.<br/> - Fixed candy cane text.<br/> - Fixed rare issue where enemies could damage the player while being pulled into the door.<br/> - Modified the single room generation to prevent a more challenging room from appearing first.<br/> - Fixed keys from spawning too high to jump in the larger maps.</p>\n<p><strong>Version 1.0 - 1.4 (during the first 2 jams)</strong></p>\n<p> - Added more diversity with the tilesets just before the deadline. There are now 7 tilesets.<br/>- Removed an exploit to switch weapons.<br/>- Fixed a crash with adjusting music volume in the options.<br/>- Fixed a rare crash relating to how a level is generated (hopefully).<br/> - Fixed how the game cleans up temporary files.</p>\n<p><strong>CREDITS</strong><br/></p>\n<p>A game by:<br/><strong>Sitebender</strong></p>\n<p>Pixel art from:<br/><strong>Freshbone</strong></p>\n<p>Original music composed by:<br/><strong>@Replay_50101</strong></p>", "metacritic": null, "released": "2017-03-15", "tba": false, "updated": "2019-08-28T23:25:41", "background_image": "https://media.rawg.io/media/screenshots/a8f/a8fff6dbbec4747aabb61071287e3275.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 307, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["sitebender"], "genres": ["Action", "Shooter", "Platformer"], "publishers": [], "esrb_rating": null}