{"id": 956203, "slug": "factory-town-idle-demo", "name": "Factory Town Idle (Demo)", "name_original": "Factory Town Idle (Demo)", "description": "<p>NOTE: This is a demo of the full game, and is still under active development. There's no restriction on playtime, but a large chunk of the research tech tree is locked off, and only a few Biomes can be settled. Demo save game progress can transfer to the full game. The full game is scheduled to be released 20 April, 2023 into Early Access.</p>\n\n<p>Factory Town: Idle lets you build a large town, manage its workers and economy, and unlock new technology that rewards you with efficient upgrades and valuable new recipes. With enough progress you'll be able to build additional towns in new biomes containing unique resources, and trade goods between them to maximize each region's specialties.<br/><br/>Starting from a single tree, chop wood manually to build housing for workers, who can then harvest more resources for you. Create new production buildings and storage, distribute your workers carefully, and decide which items to sell and which to invest back into research. Keep an eye on your natural resources, and make sure you are cultivating enough crops to keep up with the harvest. However, the game will not punish you for mistakes so you can relax and take your time. Detailed feedback lets you know where the bottlenecks are so you can fix them and achieve maximum efficiency.<br/><br/>Progress happens even when the game is closed, and your rewards will be waiting for you to collect the next time you visit. Complete quests and perform town resets to earn special perk points that can exponentially speed up productivity for all your towns.</p>", "metacritic": null, "released": "2023-04-12", "tba": false, "updated": "2023-04-14T11:44:58", "background_image": "https://media.rawg.io/media/screenshots/b3b/b3be0aaad0fcf03aada209cf3297928f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Erik Asmussen"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}