{"id": 9564, "slug": "sid-meiers-railroads", "name": "Sid Meier's Railroads!", "name_original": "Sid Meier's Railroads!", "description": "<p>Sid Meier&#39;s Railroads! is an economic strategy developed by Firaxis and Sid Meier. Despite the creation of Railroad Tycoon by Meier, he was inspired by Miniatur Wunderland to reimagine his original creation.</p>\n<h3>Gameplay</h3>\n<p>Railroads! is a 3D economic real-time strategy. In contrast to Sid&#39;s previous games, the game field of Railroads! is a bit smaller which encourages more interactions between the players. The game has little space for creating flat and long parts of the roads, hence why hills, mountains, rivers, and straits are much more important.</p>\n<p>The game focuses more on the economic aspect of railroad building. Players create and sustain a whole industry using the railroad system. The game features an auction system. From time to time, new technologies are up on the auction and the player who made the largest bid is granted exclusive rights on using this tech for ten years. After ten years pass, the technology is made available for every player. It is also possible to put one of the factories the player own up on the auction for sale.</p>\n<p>The creation of railroads themselves is much easier and automated than in Railroad Tycoon. Railroad building can also be used to prevent your opponents from creating new useful paths.</p>\n<p>The game features 15 historical scenarios where the players can act as several notorious railroad magnates of the past.</p>\n<p>A multiplayer mode is also present in the game. Four players can play a game using LAN or Internet.</p>", "metacritic": 77, "released": "2006-10-17", "tba": false, "updated": "2023-11-07T15:01:03", "background_image": "https://media.rawg.io/media/screenshots/adb/adb9e34f5ee059021fc21474f79ec6ee.jpg", "website": "http://www.2kgames.com/railroads/railroads.html", "rating": 3.18, "rating_top": 4, "added_by_status": {"yet": 50, "owned": 1208, "beaten": 22, "toplay": 10, "dropped": 23}, "playtime": 1, "achievements_count": 0, "ratings_count": 60, "suggestions_count": 564, "game_series_count": 0, "reviews_count": 60, "platforms": ["PC", "iOS", "macOS"], "developers": ["Feral Interactive", "Firaxis"], "genres": ["Strategy", "Simulation"], "publishers": ["2K Games", "Feral Interactive"], "esrb_rating": "Everyone 10+"}