{"id": 956401, "slug": "cross-wave", "name": "Cross Wave", "name_original": "Cross Wave", "description": "<p>Cross Wave is a 2D platform adventure game with a complete worldview, background setting and storyline.  You can move, jump, and attack enemies. You will also automatically learn new skills when you earn enough scores.</p><p>W, A, S, D - To Move<br/>Space - To Jump<br/>1 - Skill 1<br/>2 - Skill 2<br/>LMB - Attatck</p><p>In 1919,5,4, the Treaty of Versailles was signed. United Russia (UR) did not agree with the agreement and started a new war. In the same month, UR blitzed Poland and attacked Germany. After the failure in defence of Berlin, Germany surrendered 7,1. After 40 days of resistance, France surrendered. Till 8,9, UR has swept Continental Europe.<br/></p><p>You, Tissot Lee, a wizardry school graduate, will lead a small team in a fictional war against United Russia.</p><p>Introducing the classic platformer obstacles —— Spines! </p>\n<p>Like always, spines will stop you and hurt you seriously. But just for more fun, our spines will push you back! You might be pushed off the platforms if you are at back luck.</p>\n<p>\"How about we explore the area ahead of us later?\" A mysterious but familiar sound just appeared nowhere.</p><p>Just some boring platforms that fall off when someone steps on them.</p><p>\"Why do we even have that other platform down there?\" (Disappointing)</p><p>You might not know that playing this game without using your mouse is possible.</p>\n<p>\"Why am I here for? Please respect my profession!\" said our outsourced mage.</p><p>And most importantly...</p>HAVE FUN!<p>The game was made for DATT 2310 at York University.<br/></p>\n<p>Made By Lab 01 Group 4<br/>Beining Yang<br/>Haoqian Gu<br/>Jiaqi Li<br/>Qiyue Zhang<br/>Yiwen Wang<br/>Yudong Zhang</p>\n<p>This game is purely fictional. It must be a coincidence if there are any similarities.</p><p>This is only a prototype.<br/></p>", "metacritic": null, "released": "2023-04-12", "tba": false, "updated": "2023-04-14T13:23:43", "background_image": "https://media.rawg.io/media/screenshots/86a/86a12a1f6058e54bd7a647703d660569.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blannnk"], "genres": ["Adventure", "Strategy", "Platformer"], "publishers": [], "esrb_rating": null}