{"id": 956543, "slug": "the-horizon-framework", "name": "The Horizon Framework", "name_original": "The Horizon Framework", "description": "<p>Horizon is a free, open source TTRPG framework made to be as simple as possible to run, play, and design for. The Horizon Framework is just that—a framework—a foundation of tabletop roleplaying rules and mechanics. <br/><br/><strong>Designing With Horizon </strong><br/>So far as licensing, the Horizon Framework License is used. This license is a perpetual, irrevocable version of the MIT license. This means that, so long as you include the Horizon logo and the license in your game, you can use the framework however you want. <br/></p>\n<br/>\n<p><strong>The Rules </strong><br/>Horizon runs on a D6-pool rule set that uses Contested Rolls to determine how adversarial challenges pan out, a combat system that is simple but easily malleable, and includes rules for crafting, pets, and much more. <br/><br/>A D6 that results in a 4 or 5 counts as a success, while one that results in a 6 is called a <strong>Triumph</strong>, and counts as 2 successes. The more dice you roll, the better your odds of success, but Horizon does not have critical failures or degrees of failure; you either fail, succeed, or triumphantly succeed. This aims to make Horizon very simple to learn and play, and allow for players and GMs to focus on roleplay over rules. <br/><br/><strong>Vista </strong><br/>If playing via Discord, GMs and players can look up rules, roll dice, and track turn order with the Vista Discord bot. Use /vista for how to use the bot (once it is in your server, of course), or visit the bot's GitHub page for a full list of commands. <br/><br/><strong>Virtual Tabletops </strong><br/>Horizon is available on Role, and soon to be released on Foundry VTT. We hope to continue to add it to as many VTTs as possible, depending on what is requested.<br/></p>\n<p><strong>Playing The Game</strong> <br/>Horizon has 10 attributes, each of which has optional forks (skills based on their attributes). Simple games don’t normally use forks, whereas ones that wish to allow for more custom play do. While default forks are included, GMs and players can add custom ones for whichever forks are relevant. Horizon is genre agnostic, so it can be played in any setting. <br/><br/>Players gain a resource called <em>Fortune</em>, which allows them to bend fate to reroll dice. This resource returns slowly but, once a day, a player can say their chosen catchphrase to regain some of their spent <em>Fortune</em>. <br/><br/>Player relationships are measured with Connections. As players encounter new NPCs, they can use Connections to keep track of those relationships. As their Connections deepen, players can owe and be owed favors, and call them in to gain temporary (general, minor) and permanent (large, game-changing) advantages. <br/><br/>Players advance with Tiers (levels), acquiring new Talents as they do so. When players roll well, they can also gain new abilities, or increase their attributes. <br/><br/><br/></p>\n<p><strong>Running The Game</strong><br/>Horizon is rules light, but closes off those rules as little as possible to allow for customization by GMs. Setting the difficulty of a challenge is as easy as deciding the number of successes required to overcome it. Tasks of average difficulty typically require 2 or 3 successes, while a task requiring 4 or 5 successes poses a hard challenge, and one requiring 6 or 7 successes is considered nearly impossible for most. <br/><br/>Combat is not required for games that use Horizon, but GMs that use it will find that creating adversaries for their players is a quick and easy process. The level of challenge an enemy creates is based on the players, their number, and their strength. Those especially worried about encounter balance and tracking Life (HP) will find the Time Not Life mechanic helpful, as it bases the amount of time enemies persist for on how long they've posed a challenge, not on their Life. NPCs are differentiated by Aspects, which are special properties that can be mixed, matched, and determined randomly as a GM sees fit. <br/><br/><br/></p>\n<p><strong>Our Partners!<br/></strong>We worked with Grim Press to help market Horizon, and we'll be using the amazing maps by Domille's Wondrous Works on stream! Be sure to check them out!</p>\n<p><strong>Learn More<br/></strong>The links below navigate to where you can find Horizon and its partners across the web. GMs and designers that have questions can ask them in our Discord server, and players looking to try out Horizon can do so in our server as well! </p>\n<p>Join Our Discord Server<br/>Rulebook (Web Version)<br/>Our YouTube Channel<br/>Our Twitch Channel<br/>Horizon On Role VTT<br/>Our Patreon<br/><br/>Visit Grim Press<br/>Support Grim Press On Patreon<br/>Visit Domille's Shop<br/>Support Domille On Patreon<br/><br/>Art by David Revoy (CC BY-SA 4.0)<br/></p>", "metacritic": null, "released": "2023-04-11", "tba": false, "updated": "2023-04-14T14:26:07", "background_image": "https://media.rawg.io/media/screenshots/63b/63bd269bc76c312719185d511273b185.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AUTOSAVE"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}