{"id": 9565, "slug": "wanderland", "name": "Wanderland", "name_original": "Wanderland", "description": "We're proud to present Wanderland, the latest game from Artogon, the world-famous creator of great casual adventures series such as Shiver, Treasure Seekers and Depths of Betrayal. In this mystery adventure, Sleeping Beauty has been kidnapped! Explore a world full of temples, crypts, and more as you help the Prince rescue her.<br/>– Locations. Adventure locations appear on the map as glowing portals, where the main plot gets twisted like a Gordian knot. Each portal can lead to several different locations, determined by the story; in turn, each location consists of three to four screens with several NPCs and many tasks to complete…<br/>– Map. Move your character across the map. Select an object your character will automatically to move towards it.<br/>– HOS. Hidden Object Scenes (HOS) are the main part of the gameplay. Search each scene for one or more objects listed below the scene. Each object you find will help you fulfill your quest and move forward in the story. There are lots of HOS in the game, all carefully drawn and beautifully animated.<br/><br/><br/><br/>– Special Objects. The map contains several special upgradable objects that you can visit. Each object may reward you with a special item or ability. Each reward is only available once in a specified period of time; you can also spend resources to upgrade the special objects for better ones or more powerful abilities<br/>– NPC. Looking for NPCs (Non-Player Characters)? There are many—both friends and enemies of your player character. Some can move around the map. Others live in fixed locations.<br/>– Quests. Quests move the game forward—and they’re everywhere! Defeat a drudge of wandering skeletons… Explore an abandoned cave… Rescue a kitten from the tree… All are quests! Anything you must accomplish in an Adventure location is a quest. But there are also many things you can do on the map without searching for an NPC or undertaking a real quest.<br/><br/>But who needs a quest to kill an evil ogre anyway? Why wait until an ogre triggers a quest by robbing or killing someone? You can be proactive and go after that ogre first!<br/><br/>Wanderland: your journey to the land of fairy tales now begins!<br/>P.S.<br/>For all game players we'll offer a bunch of adorable collection of collectible items - 7 trading cards, 4 backgrounds and 5 amazing emoticons!", "metacritic": null, "released": "2016-12-20", "tba": false, "updated": "2023-01-02T18:33:28", "background_image": "https://media.rawg.io/media/screenshots/8a9/8a9bca1f57f92fb3dcf77e3e58fa61eb.jpg", "website": "http://jetdogs.com", "rating": 2.17, "rating_top": 1, "added_by_status": {"yet": 4, "owned": 265, "beaten": 1, "dropped": 1}, "playtime": 1, "achievements_count": 81, "ratings_count": 6, "suggestions_count": 578, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["Artogon"], "genres": ["Adventure", "Casual"], "publishers": ["Jetdogs Studios"], "esrb_rating": null}