{"id": 956546, "slug": "the-immersion-sound-studio", "name": "The Immersion Sound Studio", "name_original": "The Immersion Sound Studio", "description": "<p><strong>Welcome to the Immersion Sound Studio!</strong>\n</p>\n<p> \r\n</p>\n<p>Congratulations! You have got a job working at the studio as a sound recordist. \r\n</p>\n<p>Now you have a place working at the studio, I can let you into a secret about what makes this an unassuming little building stand out. The studio contains a portal that takes those who enter it into different worlds, each containing unique soundscapes.\r\n</p>\n<p>At your time working in the studio, you will be exploring sonic worlds and collecting your preferred noises to play in your own personalised audio piece. Along the way, you will meet fellow staff members and learn about the history of the studio. We hope you enjoy the Immersion Sound Studio, an interactive audio story that is accessible for sighted, visually impaired and blind players. The game is based on interacting with audio through using computer keys and does not include an interactable visual element.\r\n</p>\n<p>The Immersion Sound Studio is the first self-titled audio game - created by the games visually impaired producer, sound designer and musician. The Immersion Sound Studio was produced in collaboration with amazing musicians, voice actors, graphic designers and a Python programmer.\r\n</p>\n<p>Please go to the Immersion Sound Studio website to find more information, stay up to date with audio projects and get in contact.\r\n</p>\n<p>Thank you and enjoy!\r\n</p>", "metacritic": null, "released": "2023-04-11", "tba": false, "updated": "2023-04-14T14:27:25", "background_image": "https://media.rawg.io/media/screenshots/921/921e7eb7b1d47b6fd15ae97d4885f780.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Immersion sound Studio"], "genres": [], "publishers": [], "esrb_rating": null}