{"id": 9566, "slug": "malevolence-the-sword-of-ahkranox", "name": "Malevolence: The Sword of Ahkranox", "name_original": "Malevolence: The Sword of Ahkranox", "description": "Enter the world of Ahkranox - the first ever genuinely infinite first person roguelike. Become the incarnate form of a magical, sentient Sword, protecting a realm of dreams from the shadows of its own tormented soul, and stand as an eternal guardian against the infinite darkness that threatens to consume all.<br/><br/>In development since 2010 and meticulously inspired by the classic RPG experiences of the early 90s, this turn-based roguelike drops you into the infinite realm of Ahkranox, a dream-world in the mind of a sentient sword. The world is infinite, the loot is infinite, the quests are infinite and the possibilities are infinite. Relive the classic adventure experience of the past in this modern day salute to the pioneers of modern role playing.<br/><br/><br/><br/><strong>Features:</strong><br/><br/><ul><li>A procedurally generated, yet permanent, world to explore.<br/></li><li>All players experience their own copy of the same world. Share your finds with friends!<br/></li><li>Plunder an infinite amount of procedurally generated loot.<br/></li><li>Compete against your fellow adventurers to prove yourself the greatest hero to have lived.<br/></li><li>Choose from a never-ending supply of quests.<br/></li><li>Interact with your fellow players through rifts in time.<br/></li><li>Relive the brutal difficulty and merciless game mechanics of the golden age of video gaming.<br/></li><li>Claim undiscovered locations as your own for other players to stumble upon.<br/></li><li>A game without an ending and with no level cap! You live to reach greater heights than your fellows, or you die gloriously!</li></ul><br/><br/><strong>This game is in early access. What does that mean?</strong><br/><br/>While very playable, and quite feature-rich, this game is not 100% complete yet. We still have some bugs to iron out, and we still have a few features left to complete, but we're not far off! Join the action now and get access to each new feature in our regular updates! Get in early to discover places that no other player has yet found, and make a name for yourself on the leaderboard as one of the mightiest heroes that Ahkranox has yet seen.<br/><br/><br/><br/><strong>So what else do you have planned to add to the game?</strong><br/><br/><ul><li> More dungeon types<br/></li><li> More quest types<br/></li><li> More dwelling types<br/></li><li> Weapon and armour crafting<br/></li><li> A new, totally updated magic system<br/></li><li> Boss monsters<br/></li><li> More global multiplayer functionality<br/></li><li> More bug fixes and enhancements<br/></li><li> And more!</li></ul><br/><br/><strong>What's Next For Ahkranox?</strong><br/><br/>Malevolence was the result of a wonderfully successful Kickstarter campaign, whose stretch goals allowed us to begin early work on Malevolence's first expansion pack, which we will be diving into as soon as the base game is done. Sales from this base game will also go to furthering the development of the expansion pack!<br/><br/><br/><br/>So come on in and join the hundreds of players already enjoying the game, and while you're here, jump on our official forum to share what you find! Remember that if you can see it in your game, everyone else can, too!", "metacritic": null, "released": "2014-05-09", "tba": false, "updated": "2019-08-28T22:14:54", "background_image": "https://media.rawg.io/media/screenshots/9aa/9aa4df57cc41eb3fb35dd3f0e22f0004.jpg", "website": "http://www.malevolencegame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 11}, "playtime": 1, "achievements_count": 88, "ratings_count": 1, "suggestions_count": 507, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Visual Outbreak"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Visual Outbreak"], "esrb_rating": null}