{"id": 956776, "slug": "that-sinking-feeling-dillyda", "name": "That Sinking Feeling (dillyda)", "name_original": "That Sinking Feeling (dillyda)", "description": "<p><strong>Blurb</strong><br/></p>\n<p><em>That Sinking Feeling</em> is a game about choosing what you can let go in order to save your life.</p>\n<p>This 2D doll-house puzzle game puts the player in the shoes of <em>Little Blue</em>, whose house is being swallowed by the rising waves. The player’s task is simple: feed <em>The Machine</em> with organic objects that it can turn into synth blocs, which are in turn used to build a ship that will allow them to survive. However, as the player explores the house, they soon learn that objects are often more than just material things, and that the cost of surviving can be life itself.\r\n</p>\n<p>Growing up and surviving in a world plagued by climate change is the not-so-subtle subtext of the game.\r\n</p>\n<p>The game also features;\r\n</p>\n<ul><li>Unique hand-drawn art that melds the doll-house aesthetics with dystopian features of an over-industrialized near future\r\n</li><li>Custom animation for the rising waves that is both contemplative and foreboding\r\n</li><li>Unique traversing mechanism that adds some depth to the standard side-scroller puzzle-game formular\r\n</li><li>A secret third ending!\r\n</li></ul>\n<p><strong>Team</strong></p>\n<p>This game was made with a lot of love in a small amount of time by two students studying Game Development in Germany</p>", "metacritic": null, "released": "2023-04-10", "tba": false, "updated": "2023-04-14T16:05:30", "background_image": "https://media.rawg.io/media/screenshots/5d9/5d9853e64e53773502a63abfe2c7e4f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["dillyda"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}