{"id": 956824, "slug": "crossing-2dpixx", "name": "Crossing (2DPIXX)", "name_original": "Crossing (2DPIXX)", "description": "The Game\r\n<p>Crossing is a mini game prototype that was inspired by a recent art asset challenge and overall just a portfolio project for me to express more of my skillset than just illustration or animation alone. </p>\n<ul><li><strong>The Game is intended for mobile and </strong><strong>touch devices, but can also be played with a mouse.</strong></li></ul>\n<ul><li><strong>Please do not expect a perfect gaming experience with this, but enjoy it for some insights and inspiration as it was intended.<br/></strong></li></ul>\n\r\nGoal, Rules and Controls \r\n<ul><li>You are controlling the speed and direction of the ferryman by navigating him with the ball of light on the display. You do that by touching the screen on the direction you want him to go. </li></ul>\n<ul><li>The goal of the game is to rescue the soul on board from becoming a \"lost one\" by getting to the save shore on bottom of screen.</li></ul>\n<ul><li>The distance between you and the save shores is indicated by the dotted UI on the top. Directly below you will find the health bar of the soul on board. If it becomes to low the goal is not achieved.</li></ul>\n<ul><li>The enemies in this game -the before mentioned \"lost ones\"- are randomly spawning in the waters around you and throwing turquoise flames towards the boat. Getting hit costs you soul energy.</li></ul>\n<ul><li>The enemies can either be avoided by driving around them or you can cast a protective spell around your vessel and hit them. The spell is activated via double tapping anywhere on the screen. Note: The casting of the barrier costs energy.</li></ul>\n<ul><li>Without the protective spell around the boat, you are taking damage on impact as well as when you are being hit by a turquoise flame cast by the enemy. </li></ul>\n\r\nBackground and Concept\r\n<br/>\r\nInspired by the \"Shoot them Up\" themed Spring Art Challenge of 2023 at OpenGameArt https://opengameart.org/content/spring-art-challenge-2023-shoot-em-up\r\n<p>The game is a typical horizontal scrolling shooter with enemies, missile projectiles, continuous scrolling background and a player ship. The special thing about it is the non-typical dark fantasy inspired theme.</p>\n<p>I wanted to create something non-generic and think outside of the box a little. So I paired up this genre with the legend of the ferryman (https://en.wikipedia.org/wiki/Charon) It is a greek saga originally, but has had many variations over time and a lot of times it was mixed in with the european imagination of the grim reaper.</p>\n<p>Your goal as the ferryman is to ride across the river of death and bring the paying soul on your boat to save shores on the other end.</p>\n\r\nMaking-Of\r\n<p>You can find making-of videos on my YouTube channel. If you are interested in creative work and some background insights to differing approaches, I invite you to visit and follow for future content:</p>\n<p>https://www.youtube.com/@2dpixx<br/>https://youtu.be/JcjQjtxb8dw</p>\n\r\nCredits\r\n<p>As an artist and designer I came up with the concept of the game and all graphical assets. </p>\n<p>The programming and implementation however was done by Philipp Lenk from code<metas>. A very talented software developer and also a teacher and mentor.</metas></p>\n<p>https://codemetas.de/</p>\n<p>Further thanks go out to my friends who will be named under their pseudonyms MadMax and Mini. They were kind enough to create and provide the voices in this game :)</p>\n<p><strong>The Music and Sound Effects are a collection of Open Game Art Assets:</strong></p>\n<ul><li>Title Screen Atmospheric Music:  Swarm by elerya, https://opengameart.org/content/swarm</li></ul>\n<ul><li>Title Screen Starting Sound: 80 CC0 RPG SFX, by rubberduck, https://opengameart.org/content/80-cc0-rpg-sfx</li></ul>\n<ul><li>Ingame Screen Atmospheric Music:  Insistent: Background Loop, by yd, https://opengameart.org/content/insistent-background-loop</li></ul>\n<ul><li>Ingame Screen Enemy SFX:  25 CC0 Bang/Firework SFX, by rubberduck, https://opengameart.org/content/25-cc0-bang-firework-sfx</li>Flare Ignition, by qubodup, https://opengameart.org/content/flare-ignition</ul>\n\n<p>If you enjoy the game or have something to say feel free to comment.</p>", "metacritic": null, "released": "2023-04-10", "tba": false, "updated": "2023-04-14T16:26:18", "background_image": "https://media.rawg.io/media/screenshots/f72/f72870d3a09692ead205cff4874b9076.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["2DPIXX"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}