{"id": 956971, "slug": "power-itch-netzwerk2-green-lemonade", "name": "Power (itch) (Netzwerk2, Green Lemonade)", "name_original": "Power (itch) (Netzwerk2, Green Lemonade)", "description": "<p>The project's source code can be found  here. We recommend using the native build for better visuals (sky texture + better transparency).<br/></p>\r\nAim of the Game\r\n<p>This game takes place in an alternate reality where people actually care about climate change. You are working at the public utility company of a small town, and your main task is to provide the town with enough power for the citizens. But beware! The citizens want you to emit as little CO₂ as possible. The more CO₂ you emit, the lower your reputation becomes and the less money you will get. If you do not have enough money, you can not keep up with the growing power demand and will be replaced by someone, who, contrary to you, does a decent job.</p>\r\nControls\r\n\r\nInputActionQ/E/middle-click + drag rotate the camera W/A/S/Dmove the camera R/F/mouse wheelzoom right-clickclear building selection left-clickplace/Select buildingsspace  pause/Unpause the game.increase the time speed,decrease the time speed-reset the time speed\r\nPlot Controls\r\nInputActionleft-click + drag\r\npanning \r\nmouse wheel\r\nscroll vertically\r\n mouse wheel + Shift\r\n scroll horizontally\r\n mouse wheel + Ctrl\r\nclear building selection\r\n left-click\r\nzooming\r\nright-click + drag\r\nbox zooming\r\ndouble-clickreset view\r\n\r\nCore Mechanics\r\n<p>The game time is split into months. Each month has a power target and a maximum CO₂ emission target. At the end of every month, you get money based on your reputation and your CO₂ emissions. You gain or lose reputation depending on the amount of CO₂ emitted. If you emit more CO₂ than you are supposed to, you will lose reputation, otherwise you gain it. </p>\n<p>You start with limited technologies which will not allow you to satisfy the CO₂ constraints in the long term. By researching new technologies (which costs money) you might be able to emit less CO₂ and satisfy your customers.</p>\n<p>Generating too little power will make you lose the game. You will notice a red progress bar appearing in the bottom right corner if you produce less power than is demanded. The greater your power deviation is, the faster you lose. However, the progress bar will reset each month.</p>\n<p>To open windows like the plot window or building options, simply click the corresponding icons at the bottom left of the screen. If you do not know which icon corresponds to which window, hover over the icons to see their tooltips.</p>\n<p>The game is paused at the beginning. Place your buildings first and then choose a game speed you like (either using the buttons at the bottom or the keybindings).</p>\r\nBuildings\r\n<p>The only way to generate power is to place buildings. Each building emits CO₂ when built and some also emit a significant amount of CO₂ each month after being built. Buildings can be placed through the buildings window. Once you selected a building, simply click on the terrain to place it.</p>\n<p>Clicking on an already placed building will bring up a little menu. There you can choose between destroying or upgrading the building. Destroying buildings can be useful to meet the CO₂ targets, but keep in mind that destroying buildings also emits CO₂. </p>\n<p>Upgrades cost money and in exchange offer more power (for renewable energy sources) and less CO₂ emissions (for fossil ones).</p>\n<p>The previewed building will be green if you are allowed to place it. If you do not have enough money, if there already is a building, or if the building can not be placed on this terrain type, the previewed building will be red.</p>\r\nCoal Plants\r\n<p>Coal plants are fairly cheap to build considering the amount of power they generate. However, they emit a lot of CO₂. Coal plants can be placed anywhere except on water.</p>\r\nGas Plants\r\n<p>Gas plants are basically coal plants, but better. They generate slightly more power while emitting less CO₂. Gas plants can be placed anywhere except on water.</p>\r\nSolar Arrays\r\n<p>Solar arrays emit a negligible amount of CO₂, but do not generate that much power at day and none at night. It is recommended to compensate the lack of power generation at night with batteries. Solar arrays can be placed anywhere except on water.</p>\r\nWind Turbines\r\n<p>Wind turbines, like solar arrays, do not produce a lot of CO₂, however they generate more power than solar arrays. Their power generation varies, since it is influenced by the wind. Wind turbines can be placed anywhere, but they produce more power if they are in the water and even more when they are on mountains.</p>\r\nBatteries\r\n<p>Batteries enable you to store surplus energy. This energy is fed back into the power grid, if too little power is generated. Batteries can be placed anywhere except on water.</p>\r\nPlots\r\n<p>Plots help you to plan ahead. They display e.g. your current power production and the power demand for all future months to come. This allows you to decide when to build new buildings. </p>\n<p>There are five different plots:</p>\n<ul><li>CO₂: Displays the CO₂ emissions as well as the CO₂ emission targets of the past and future.</li><li>Power: Displays the current power production as well as the power demand of the past and future.</li><li>Energy: Displays the currently stored energy as well as the maximum possible stored energy.</li><li>Money: Displays your money.</li><li>Reputation: Displays your reputation.</li></ul>\r\nResearch\r\n<p>Most of the buildings require research before they can be built. To research a technology, click the corresponding button in the research window. You can also expand the limited building space you have by researching new rows or columns. Some technologies, like wind turbines, require other technologies to be researched first. </p>\n<p>Researching costs money, so pay attention to not spend too much on researching a technology that you then can not build.</p>\n<p>Technologies which can be researched will be marked light green, whereas technologies which already have been researched will be marked as dark green. Technologies which can not be researched, either due to a lack of money or due to dependencies which have not been researched yet, will be marked red.</p>\r\nShipping Options\r\n<p>Shipping options affect the overall costs and CO₂ emissions of buildings when placed. There are four shipping options: bicycles, electric cars, big trucks and standard. For more information see their corresponding tooltips.<br/><br/></p>\r\nCredits\r\n<p>- https://github.com/bevyengine/bevy</p>\n<p>- https://github.com/mvlabat/bevy_egui</p>\n<p>- https://github.com/aevyrie/bevy_mod_raycast</p>\n<p>- https://github.com/NiklasEi/bevy_asset_loader</p>\n<p>- https://github.com/becheran/grid</p>\n<p>- https://github.com/Peternator7/strum</p>\n<p>- https://github.com/johanhelsing/noisy_bevy</p>\n<p>- https://github.com/lampsitter/egui_commonmark</p>\n<p>- https://github.com/BlackPhlox/bevy_dolly</p>\n<p>- https://github.com/mamrhein/quantities.rs</p>\n<p>- https://github.com/JonahPlusPlus/bevy_atmosphere</p>\n<p>- https://github.com/rustwasm/console_error_panic_hook</p>", "metacritic": null, "released": "2023-04-10", "tba": false, "updated": "2023-04-14T17:30:57", "background_image": "https://media.rawg.io/media/screenshots/a3b/a3b77877f2741b728730cfbf73b2052c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "PC"], "developers": ["Netzwerk2", "Green Lemonade"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}