{"id": 9569, "slug": "fictorum", "name": "Fictorum", "name_original": "Fictorum", "description": "A reign of terror never feels so satisfying as when you leave a literal pile of rubble in your wake. Giving wizards a much-needed makeover, Fictorum is an action role-playing game that features fully-destructible structures, a randomized node-based world map, and a satisfying magic system with on-the-fly spell shaping and customization.<br/>\n<br/>\r\nIn Fictorum, your mage wields real, legendary power right from the start—unlike those found in most magic-centric games. Our magic system uses a dynamic and intuitive spellcasting and shaping system that grants the player an unrivaled level of customization and reconfiguration. Up to three runes can be applied to a spell, each affecting a different spell characteristic. The runes are easily swapped to suit the player’s current need, interest, or whim. You might amplify ice blasts to freeze enemies in place, expand the radius of a fireball explosion to crumble a bridge and hinder pursuers, or chain a lightning attack together to strike several targets in a cluster. Shaping makes spellcasting much more tactical and satisfying.<br/>\n<br/>\r\nRather than starting out as a hapless farm boy who stumbles into his powers and avoids enemies or entire areas until leveling up, players take on the role of an established wizarding badass, hell-bent on his mission for revenge. Yet challenge is abundant—the wizard must bring down a sprawling empire by himself, besting scores of bandits, cadres of Inquisitors, and hordes of corrupted abominations on his quest for vengeance. The protagonist has access to unlimited magical powers, making the game less about spamming that one spell that works passably well until it becomes upgradable. The experience is more about tailoring your magical arsenal, giving the player a wide range of freedom and the ability to effectively, efficiently, and enthusiastically destroy every obstacle. The randomly-generated world map features locations where every structure (from large buildings to bookshelves to tables to even a lone fork) can be demolished.", "metacritic": null, "released": "2017-08-08", "tba": false, "updated": "2022-10-01T23:42:08", "background_image": "https://media.rawg.io/media/screenshots/243/2435226d3370e6ced1fa8bd056d9090d.jpg", "website": "http://www.fictorum.com", "rating": 3.0, "rating_top": 4, "added_by_status": {"yet": 9, "owned": 174, "beaten": 1, "toplay": 3, "dropped": 4, "playing": 1}, "playtime": 2, "achievements_count": 68, "ratings_count": 7, "suggestions_count": 423, "game_series_count": 0, "reviews_count": 7, "platforms": ["PC"], "developers": ["Scraping Bottom Games"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Scraping Bottom Games"], "esrb_rating": null}