{"id": 957262, "slug": "battle-tower-royale", "name": "Battle Tower Royale", "name_original": "Battle Tower Royale", "description": "<p>Many brave challengers enter the Battle Tower, but there can be only one Champion! Fight your way through hordes of enemies as you climb to the top towards glory and fame! But as you progress through the tower, you get the sense that your progress is being watched. It seems as though there is a reason for why it is here...</p>\n<p>Battle Tower Royale is an Action RPG that lets you create a character that you can build and customize in many different ways! You have the freedom to:</p>\n<p>-Select a race to play that will endow you with different bonuses.<br/></p>\n<p>-Learn powerful spells that you can cast to give you an advantage in combat.</p>\n<p>-Customize your character with over thirty different feats to choose from as you gain levels.<br/></p>\n<p>-Buy and upgrade many different kinds of equipment. The Forge can be used to create thousands of different permutations of equipment that can be tailored to the types of challenges you are facing.<br/></p>\n<p>----------<br/></p>\n<p>The NPCs you can talk to come from so many different backgrounds, but they are there for the same reason you are. Most of them are quite friendly and happy to speak to you, but as you grow in power you may attract attention from the wrong sort of crowd...<br/></p>\n<p>The game is in continuous development, with new features being implemented all the time. Feedback is encouraged and appreciated!<br/><br/></p>", "metacritic": null, "released": "2023-04-03", "tba": false, "updated": "2023-04-14T19:26:40", "background_image": "https://media.rawg.io/media/screenshots/3dd/3dd634a96b00ea17b003180b8dc78cb5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bynary Fission"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}