{"id": 957454, "slug": "dfhack-dwarf-fortress-modding-engine", "name": "DFHack - Dwarf Fortress Modding Engine", "name_original": "DFHack - Dwarf Fortress Modding Engine", "description": "DFHack is an add-on for Dwarf Fortress that enables mods and tools to significantly extend the game. The default DFHack distribution contains a wide variety of these tools, including bugfixes, interface improvements, automation agents, design blueprints, modding building blocks, and more. Third-party tools (e.g. mods downloaded from Steam Workshop or the forums) can also seamlessly integrate with the DFHack framework and extend the game far beyond what can be done by just modding the raws.<br/><br/><strong>DFHack’s mission</strong> is to provide tools and interfaces for players and modders to:<br/><br/><ul><li> expand the bounds of what is possible in Dwarf Fortress<br/></li><li> reduce the impact of game bugs<br/></li><li> give the player more agency and control over the game<br/></li><li> provide alternatives to toilsome or frustrating aspects of gameplay<br/></li><li> <strong>make the game more fun</strong></li></ul><br/><strong>Our online Quickstart Guide</strong> will help you get up to speed with how to use DFHack. It's also available in-game via the <strong>quickstart-guide</strong> command.<br/><br/><strong>The best way to make feature requests or report problems</strong> is to open an Issue at our GitHub page.<br/><br/>When reporting problems, links to your zipped, uploaded savegame and mods are immensely helpful, and issues with attached savegames and mods get fixed faster. We need a zip of your mods because we can't load your savegame without them.<br/><br/>DFHack installs directly into your Dwarf Fortress directory, so <strong>be sure to install it to the same Steam library and drive as Dwarf Fortress.</strong><br/><br/><strong>It is not a problem if you already have DFHack manually installed.</strong> You can subscribe to the Steam version and it will absorb the installed files. Your data in dfhack-config/ is safe. No additional steps are necessary.", "metacritic": null, "released": "2023-04-13", "tba": false, "updated": "2023-04-17T07:39:24", "background_image": "https://media.rawg.io/media/screenshots/a0c/a0c27c2e660c31039a35298e598cdf89.jpg", "website": "https://github.com/DFHack/dfhack/releases", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 326, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The DFHack Team"], "genres": ["RPG", "Strategy", "Simulation"], "publishers": ["The DFHack Team"], "esrb_rating": null}