{"id": 957452, "slug": "mega-man-battle-network-legacy-collection-vol-2", "name": "Mega Man Battle Network Legacy Collection Vol. 2", "name_original": "Mega Man Battle Network Legacy Collection Vol. 2", "description": "<p>Note: This product is also available as part of a bundle. Please be careful of duplicate purchases. Vol. 1 is also available, which contains Mega Man Battle Network 1-3.<br />\nThe Battle Network is back! Get ready to jack in to the net to face off against deadly enemy programs in electrifying grid based battles, and search the net for rare and powerful BattleChips to build the ultimate deck of special moves!<br />\nThe renowned Mega Man Battle Network series, which has expanded into anime and comics, is back in the Mega Man Battle Network Legacy Collection. Volume 2 includes six action packed games from both versions of Mega Man Battle Network 4 to both versions of Mega Man Battle Network 6, plus additional features like a gallery of illustrations and music! In addition, online play is supported!<br />\nIn 200X, the rapid advancement of Internet technology has created the “network age.” People have come to enjoy the benefits of network technology through portable exploration devices called “PET” and personality simulation programs called NetNavi. As the network world expands and life becomes more convenient, however, network crime is raging. Main character Lan Hikari and his NetNavi, MegaMan.EXE, join forces to confront these incidents.<br />\nMega Man Battle Network Legacy Collection Vol. 2 includes:<br />\nMega Man Battle Network 4 Red Sun<br />\nMega Man Battle Network 4 Blue Moon<br />\nMega Man Battle Network 5 Team Protoman<br />\nMega Man Battle Network 5 Team Colonel<br />\nMega Man Battle Network 6 Cybeast Gregar<br />\nMega Man Battle Network 6 Cybeast Falzar<br />\nThe games in this collection are playable in English, Japanese, and Simplified/Traditional Chinese only.<br />\nNote: The toy link features found in the original versions are not supported.</p>", "metacritic": null, "released": "2023-04-13", "tba": false, "updated": "2023-06-19T07:58:32", "background_image": "https://media.rawg.io/media/games/0a9/0a98bf8945e874454a45bcc133b7856f.jpg", "website": "https://www.capcom-games.com/megaman/exe/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 18, "toplay": 1}, "playtime": 1, "achievements_count": 32, "ratings_count": 0, "suggestions_count": 366, "game_series_count": 2, "reviews_count": 0, "platforms": ["PC", "Nintendo Switch", "PlayStation 4"], "developers": ["Capcom"], "genres": ["Action", "RPG"], "publishers": ["Capcom"], "esrb_rating": "Everyone 10+"}