{"id": 957470, "slug": "memory-land-extreme", "name": "Memory Land Extreme", "name_original": "Memory Land Extreme", "description": "Welcome to Memory Land Extreme, the game where your memory skills will be pushed to their absolute limits!<br/><br/>In this experimental game, we've thrown all notions of \"fun\" out the window and replaced it with a singular focus on memory retention. If that doesn't make you want to play this, we don't know what will.<br/><br/><strong>Shoot the correct objects: </strong>You'll need to remember which objects to shoot in order to progress through the level. Which objects are correct? It's up to you to figure it out!<br/><br/><strong>Arbitrary correctness: </strong>There's no rhyme or reason to which objects are correct. It's all completely arbitrary, which means you'll need to rely solely on your memory skills to succeed.<br/><br/><strong>4 different guns: </strong>Spice up your memory training by using one of our four unique guns to shoot the objects. Each gun has its own strengths and weaknesses, so choose wisely!<br/><br/><strong>One thousand objects: </strong>The ultimate goal of the game is to correctly remember one thousand objects. Can you do it?<h3>Features</h3><ul><li> Remember Boats<br/></li><li> Remember Vegetables<br/></li><li> Remember Numbers<br/></li><li> Remember Tables<br/></li><li> Remember Sofas<br/></li><li> Remember Letters</li></ul><br/><br/>If you're looking for a challenge and a chance to push your memory skills to their limits, then Memory Land Extreme is the game for you. Just don't expect to have \"fun\" while you're at it!", "metacritic": null, "released": "2023-04-14", "tba": false, "updated": "2023-04-17T07:58:59", "background_image": "https://media.rawg.io/media/screenshots/b2c/b2c1d814810ac8381bcad08fbcd8c71a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cosy Computer"], "genres": ["Casual", "Indie"], "publishers": ["Cosy Computer"], "esrb_rating": null}