{"id": 957533, "slug": "scarlet-fantasia", "name": "Scarlet Fantasia", "name_original": "Scarlet Fantasia", "description": "The devil's minions are approaching, and the fantasy land is at stake!<br/>Defeat the devil, save the princess, many mythical heroes from all over the world are waiting for your call!<br/>Convenient functions such as high offline earnings and automatic map push battles allow you, who will become the savior, to enjoy the benefits all the time! Come meet these heroes now<br/><br/>Game Features:<br/><br/>【Easy to play game experience】<br/>Exquisite characters present a pleasing adventure experience; a hundred consecutive draws will be given at the beginning to help you easily pass the novice period. You can also get high-yield income and complete the level by hanging up the phone. It is the best game partner for you to sneak in!<br/><br/>[Diverse and exciting tactical combinations]<br/>The battle situation is changing rapidly, free combination of camps and formations, timely adjustment of combat strategies, multiple resource management methods, winning with strange moves, ordinary characters can also become myths and make great contributions!<br/><br/>【Guild battles for everyone to enjoy】<br/>Brand-new guild system design, battle duels that respond to everyone, diverse and exciting gameplay, explore the fog with players from all walks of life, challenge the strong, and reach the top of the server!<br/><br/>[unexpected discovery]<br/>The epic game plot spanning thousands of years, participate in the role-playing of mythical characters, and unravel the grievances and hatreds in the world of God's Domain. In addition to fighting, you can also carry out home construction and create your own castle in another world!", "metacritic": null, "released": "2023-03-28", "tba": false, "updated": "2023-04-17T09:27:18", "background_image": "https://media.rawg.io/media/screenshots/9fa/9faac40ed4f107b6d047399694da41d0_Kqv16cL.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["欢 李"], "genres": ["Strategy", "Card"], "publishers": ["欢 李"], "esrb_rating": "Teen"}