{"id": 957564, "slug": "car-crash-game-online", "name": "Car Crash Game Online", "name_original": "Car Crash Game Online", "description": "The most realistic car destruction on phones &amp; pads.<br/>Real auto damage! Unique destruction engine <br/>Smash cars online with friends and other rivals! Top car game where you need to crash awesome and expensive cars with real handling like in a driving simulator. <br/>Our unique racing gaming app about Street and Drag racing, car crash &amp; Drifting made for guys and girl who passionately love vehicles like Sport cars, SUV, Trucks, Passenger bus, Muscle car and Classic auto. <br/>Enjoy the destruction of the Americans muscleCars and European SportCars, Japan drift cars and more vechicles with the various types of devices and traps that we offer in our game. <br/>Every car has multiple characteristics and is destoyed in different ways. We are developing a multiplayer mode. Game online, break down rival cars in real time. Free Russian cars to destroy. Soviet car are already in your garage<br/><br/> Do you like fast racing, fire up the nitrous oxide and go full speed ahead? This race is made for you! The most spectacular accidents and car crash tests in your phone.<br/><br/>This game will give you a unique experience of a real racer:<br/><br/>Compete against other players online in battle royale knockout races<br/>Crush your opponents in derby mode<br/>Beat the record in timed challenges<br/>Ride freely on scenic trails with a view from the cockpit<br/>You drive the car, not the car you.<br/>Collect cars from all over the world, from stock cars to premium cars.<br/>And most importantly, break, crush, blow up. This is a game about how to beautifully arrange destruction.<br/>An adrenaline rush is guaranteed. Download the game right now, fasten your seatbelt and step on the gas!", "metacritic": null, "released": "2023-02-10", "tba": false, "updated": "2023-04-17T10:02:42", "background_image": "https://media.rawg.io/media/screenshots/42e/42e6714c0768e305f1a65d877fe06ad7_pyQskQ7.jpg", "website": "https://aagbrothers.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Stepan Ivanov"], "genres": ["Simulation", "Racing"], "publishers": ["Stepan Ivanov"], "esrb_rating": "Everyone 10+"}