{"id": 957547, "slug": "music-empire-rise-to-fame", "name": "Music Empire: Rise to Fame", "name_original": "Music Empire: Rise to Fame", "description": "Welcome to Music Empire: Rise to Fame, business tycoon and music management game where you can start your own company and build your own record label. In this immersive business game, you'll experience the thrill of building a real estate empire while managing a roster of talented artists.<br/><br/>Our story games are the perfect blend of role-playing and choose your story games, where every episode and chapter is full of drama, love choices, and intriguing stories that will keep you hooked. With our interactive story feature, you can make your own decisions and determine the course of your own music empire.<br/><br/>In Music Empire, you can sign and manage talented artists, choose the best songs for them, and help them rise to fame. But the competition is fierce, and you'll need to be savvy in your business dealings to stay ahead of the game.<br/><br/>Whether you're a fan of dating games, love stories, or business simulators, Music Empire has something for everyone. So what are you waiting for? Download Music Empire: Rise to Fame and start your journey to becoming a music mogul today!<br/><br/><br/>Subscription:<br/><br/>Recurring billing. Cancel anytime.<br/><br/>You can subscribe to get access to Premium Version, which ads-free content, no timers and dark mode. The subscription is $4.99 monthly and $39.99 yearly. You'll be able to get ads-free gameplay, no waiting time and all the chapters of the game for the duration of your subscription. Payment will be charged to your iTunes Account at confirmation of purchase. Subscription automatically renews unless auto-renew is turned off for at least 24-hours before the end of the current period. Account will be charged for renewal within 24-hours prior to the end of the current period at the cost of the chosen package. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase. No cancellation of the current subscription is allowed during active subscription period. You can read our privacy policy and terms of use at https://asterhills.co/terms. Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication. *Prices are equal to the value that \"Apple's App Store Matrix\" determines is the equivalent of the subscription price in $USD. By using Music Empire, you agree to our Terms of Use and Community Guidelines available at https://asterhills.co/terms", "metacritic": null, "released": "2023-03-01", "tba": false, "updated": "2023-04-17T09:43:23", "background_image": "https://media.rawg.io/media/screenshots/cd4/cd4c667b92609035df7244e239da199d.jpg", "website": "https://www.asterhills.co", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Aster Hills"], "genres": ["RPG", "Simulation"], "publishers": ["Aster Hills"], "esrb_rating": "Teen"}