{"id": 957549, "slug": "endless-nightmare-5-curse", "name": "Endless Nightmare 5: Curse", "name_original": "Endless Nightmare 5: Curse", "description": "This is the fifth work in the Endless Nightmare series, and it is a Chinese-style horror game.<br/>There is a desolate village filled with scary evil spirits and graves. The autumn wind is rustling, and it seems that the wronged ghosts are crying bitterly. This weird village is called Sunset village, and the peaceful scene in the past no longer exists. You are a Taoist priest who is practicing in Xuanqing Temple, your peaceful life is broken with thee. Younger sister is missing, demons are rampant, you must investigate to save your sister and slay scary ghosts. A tragic past that has been dusty for a long time is about to be revealed.<br/><br/>Gameplay:<br/>* Explore the Sunset village, discover clues and investigate the truth<br/>* Obtain higher quality swords to make yourself stronger<br/>* Collect pill recipe and resources, make items and pills<br/>* Learn Taoist spell, get more charms and enhance skills<br/>* Upgrade swords and charms to increase attack<br/>* Defeat bosses to equip artifacts, get more skills and buffs<br/><br/>Game Features:<br/>* Exquisite 3D graphics, giving you a real visual effect<br/>* Full of Chinese style elements, you can appreciate the essence of Chinese culture<br/>* First-person perspective, immersive experience<br/>* Fascinating and creepy plot, revealing the miserable past<br/>* Rich gameplay, extremely playable<br/>* Larger map, more areas and instances can be explored<br/>* 4 game difficulties, challenge your limit<br/>* 16 swords and 4 charms, you will find the preferred one<br/>* A variety of ghosts, please destroy them one by one<br/>* Scary music and creepy atmosphere, bring headphones for a better experience<br/><br/>Endless Nightmare 5: Curse is an epic scary game, it has added more horror game contents than previous scary games, cool spell effects, large map, various creepy ghosts and bosses, powerful weapons, richer resources, and a new element – artifacts. You can get more special skills by equipping artifacts, refresh the attributes to get more bonuses. But the gameplay is far from that, if you have never played being a Taoist priest to slay creepy ghosts, you are welcome to experience this scary horror game which is full of Chinese elements, it will give you different surprises.<br/><br/>Communicate with us via Facebook and Discord.<br/>Facebook: https://www.facebook.com/EndlessNightmareGame/<br/>Discord: https://discord.gg/ub5fpAA7kz", "metacritic": null, "released": "2023-04-06", "tba": false, "updated": "2023-04-17T09:45:48", "background_image": "https://media.rawg.io/media/screenshots/33d/33dab986f649d8e96f03c8a1845aa1e4.jpg", "website": "https://707interactiveplay.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 346, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["707 INTERACTIVE"], "genres": ["Adventure", "RPG"], "publishers": ["HONGKONG 707 INTERACTIVE TECHNOLOGY CO"], "esrb_rating": "Everyone 10+"}