{"id": 957584, "slug": "arrange-them-little-right", "name": "Arrange Them Little Right", "name_original": "Arrange Them Little Right", "description": "This is a simple yet addictive and entertaining game. This game helps you to organize and arrange your living space with ease. Sharpen your mind with this Hexa A little left puzzle game. Enjoy this classic puzzle game with more than hundreds of beautiful &amp; alluring graphics. If you are a fun lover &amp; like these sorts of puzzle games then you will surely gonna love these little left puzzles! A great mind relaxing exercise.<br/><br/>How To Play: <br/>- A blank graphic will appear in front of you on the screen.<br/>- Multiple puzzles will be there to choose &amp; select in the right place.<br/>- You will drag the puzzle &amp; place it in the accurate blank place.<br/>- All the puzzle assembles in the right way and the charming image will be completed.<br/>- If the selected puzzle is not right you are supposed to choose this again to paste it in the right place. <br/>- If you are unable to fill out the puzzles you can click on the “Watch Ad” &amp; have the clue where to place it in the right way. <br/>Features: <br/>- One Finger drag &amp; drop control game.<br/>- Attractive graphics.<br/>- Clues provided.<br/>- Use hints to solve puzzles that are hard to solve. <br/>- Over 1000+ Logical puzzles.<br/>- Enjoyable for all ages.<br/><br/>Perfect for people who enjoy playing casual puzzle games and who find the organization to be gratifying. You can play this casual logical puzzle game on your mobile phones &amp; tablets online as well as offline.<br/>Get ready to create a cozy, clean, and sophisticated home with this fantastic app!", "metacritic": null, "released": "2023-02-17", "tba": false, "updated": "2023-04-17T10:25:17", "background_image": "https://media.rawg.io/media/screenshots/216/216f160f2dcc2748a4e4e91c5de0ffdc_VGvM8JL.jpg", "website": "https://kunhargames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["KUNHAR GAMES"], "genres": ["RPG", "Puzzle"], "publishers": ["KUNHAR GAMES"], "esrb_rating": "Everyone 10+"}