{"id": 957596, "slug": "call-of-dragons", "name": "Call of Dragons", "name_original": "Call of Dragons", "description": "Call of Dragons is an MMO fantasy conquest game from the creators of Rise of Kingdoms, offering an incredible strategic combat experience:<br/><br/>1) All-New Behemoth Combat System: Fight alongside your allies to defeat powerful Behemoths, then summon them in PvP battles as your secret weapon!<br/><br/>2) Freedom To Fight: Take advantage of truly 3D terrain to create your strategy, command flying legions to traverse mountains and rivers, and unleash powerful combat skills to lead your allies to victory in huge-scale fantasy warfare!<br/><br/>3) An Immersive Fantasy World: Recruit Elven maidens, mighty Orcs, powerful frost mages, and countless other magical heroes. Journey to the mystical Firefly Tree, the daunting Frozen Spires, and other fantastic wonders, and enjoy a vast fantasy world like nothing you've ever seen before.<br/><br/>Game Features:<br/><br/>【Hunt and Tame Behemoths】<br/>The land of Tamaris is infested with Behemoths—giant ancient beasts like Hydras, Thunder Rocs, and mighty and terrifying Dragons. Stand shoulder to shoulder with your allies to bring them to heel, then train them to become your secret weapon. Then, in your hour of need, deploy Behemoths to crush your enemies!<br/><br/>【Heal Units for Free】<br/>Wounded units can be healed automatically without consuming any resources. Wage war, challenge other players, and fight to your heart's content! Enjoy the thrill of the battlefield without worrying about your stockpiles. Your path to conquest begins now!<br/><br/>【Countless Fantastic Creatures】<br/>The land of Tamaris is filled with many fantastic races: noble Elves, mighty Orcs, wily Satyrs, wise Treants, majestic Forest Eagles and otherworldly Celestials. Each of these races can join your forces and lead them to victory. Meanwhile, Hydras, Giant Bears, Thunder Rocs and other terrifying creatures lie in wait...<br/><br/>【Powerful Hero Skills】<br/>Assign mighty heroes to lead your forces, and train them up to use powerful abilities that allow them to turn invisible, charge across the battlefield in an instant, or unleash devastating AoE attacks! Master the battlefield, then strike at a critical moment to turn the tide of battle and claim victory!<br/><br/>【3D Terrain &amp; Flying Legions】<br/>Take advantage of rich and varied 3D terrain to carry out rapid assaults, defend your position, and unleash air raids to crush the enemy with strategy. Deploy flying legions across canyons, deserts, rivers, and mountains to deliver a devastating blow!<br/><br/>【Expand, Exploit, Explore, &amp; Exterminate】<br/>The prosperity of the kingdom is in your hands. Upgrade buildings and technologies, train troops, gather resources, expand your territory, and prove that you are worthy to rule Tamaris!<br/><br/>【Every Unit Matters】<br/>Fight as a team! Whether you're charging the front lines, maintaining vital roads, or building defensive barricades, everyone can play their part to run the battlefield like a well-oiled machine—your victory depends on it!<br/><br/>SUPPORT<br/>If you encounter any issues during the game, you can send us feedback via the in-game Customer Service Center.<br/>Customer Service Email: callofdragons-service@farlightgames.com<br/>Official Site: callofdragons.farlightgames.com<br/>Facebook:  https://www.facebook.com/callofdragons<br/>YouTube: https://www.youtube.com/channel/UCMTqr8lzoTFO_NtPURyPThw<br/>Discord: https://discord.gg/Pub3fg535h<br/><br/>Privacy Policy: https://www.farlightgames.com/privacy<br/>Terms of Service: https://www.farlightgames.com/termsofservice", "metacritic": null, "released": "2023-03-28", "tba": false, "updated": "2023-04-17T10:37:54", "background_image": "https://media.rawg.io/media/screenshots/334/3341168272ab61c2ab98183c68a44c5e.jpg", "website": "https://farlightgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 439, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Farlight Games"], "genres": ["RPG", "Strategy"], "publishers": ["FARLIGHT"], "esrb_rating": "Everyone 10+"}