{"id": 957557, "slug": "bus-games-driving-master-3d", "name": "Bus Games: Driving Master 3D", "name_original": "Bus Games: Driving Master 3D", "description": "Completely revamped Bus Games : Driving Master 3D is on the App Store.<br/>Are you ready to take on the responsibilities of a city bus driver and transport passengers to their destinations? Do you have what it takes to become the top bus driver in the city?<br/><br/>Experience the daily life of a real bus driver with a combination of bus driving on busy streets and bus parking on tight parking spots. Feel the thrill of bus simulation and get ready to enjoy hours of driving with beautiful environments.<br/><br/>DON’T FORGET TO WEAR A SEAT BELT!<br/><br/>Bus Simulator Gameplay &amp; Features:<br/>Select your favorite bus from the garage and get ready to explore the city streets and parking lots. Pick up passengers from bus terminals and drop them at their destination. Move from one bus station to another until all the bus stops are empty. Park your bus in different designated spots in the city and level up your bus parking skills. Complete all the missions to earn coins &amp; rewards which you can use to buy new buses or upgrade your bus. Modern Bus Driving Simulator also brings its players a thrilling opportunity to showcase their creativity through a new user creative mode.<br/><br/>Game Modes:<br/>Easy Parking: In this mode, practice the art of parking buses in designated spots around the city. Complete multiple challenges and become a professional bus driver 2023.<br/>Offroad Driving: In this mode, drive buses on crazy off-road tracks and rough terrain. Show your pro driver skills and transport passengers safely while hill climbing.<br/>City Traffic Mode: Maneuver your bus through busy streets and avoid collisions with other vehicles. Follow all the traffic rules and deal with real life traffic situations.<br/>Hard Parking: This mode is specially designed for pro drivers who love to take challenges. Avoid roadside hurdles and park the bus in tight spots with a limited amount of time.<br/>User Creative Mode: Create your own custom tracks, roadside hurdles, start and finish lines as well as weather selection in user creative mode of bus simulator game.<br/><br/>Follow Our YouTube Channel: https://www.youtube.com/channel/UCNq75e3JuMJSPd5ZLlMZzSg<br/> <br/>Terms &amp; Privacy Policy<br/>https://www.theknights.com.pk/privacy-policy/<br/> <br/>Disclaimer<br/>Bus Games : Driving Master 3D is completely free to play, but some in-apps such as buses, customization items within the game may be available for purchase. To disable the payment feature, you can go to your device settings and turn off in-app purchases.<br/><br/>Download free and play now!<br/>Subscription pricing and terms:<br/>This app offers an auto-renewing weekly subscription at $3.99/week to provide unlimited access and other premium features.<br/>Payment will be charged to the credit card connected to your iTunes Account when you confirm the initial subscription purchase. Subscriptions automatically renew unless auto-renew is turned off at least 24-hours before the end of the current subscription period. Your account will be charged for renewal within 24-hours prior to the end of the current period, and the cost of the renewal will be identified. You may manage your subscription and auto-renewal may be turned off by going to your Account Settings after the purchase. Any unused portion of a free trial period, if offered, will be forfeited when you purchase a subscription, where applicable.<br/>Your use of this application is governed by the Terms of Service available at: https://www.apple.com/legal/internet-services/itunes/dev/stdeula/.", "metacritic": null, "released": "2020-08-08", "tba": false, "updated": "2023-04-17T09:54:21", "background_image": "https://media.rawg.io/media/screenshots/f02/f029c96387c5a3cdf03308f6f0e1c281_OLoYzru.jpg", "website": "https://www.theknights.com.pk/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Knights IOS"], "genres": ["Simulation", "Racing"], "publishers": ["Knights IOS"], "esrb_rating": "Everyone 10+"}