{"id": 957586, "slug": "offroad-4x4-jeep-driving-games", "name": "Offroad 4X4 Jeep Driving Games", "name_original": "Offroad 4X4 Jeep Driving Games", "description": "Tom and his friends had always dreamed of going on a jeep trip to the mountains, and finally, the day had arrived. They loaded up their jeeps with all of the necessary supplies and set out on the long journey.<br/><br/>As they drove through the winding mountain roads, Tom couldn't help but feel a sense of excitement and adventure. The views were breathtaking, and he couldn't wait to explore all that the mountains had to offer.<br/><br/>After several hours of driving, they finally arrived at their campsite. They set up their tents and started a fire, ready to spend the next few days exploring the trails and taking in all of the beauty around them.<br/><br/>The next morning, they set out on their first trail, driving their jeeps through the rugged terrain. They saw all sorts of wildlife along the way, from majestic eagles soaring overhead to playful chipmunks scampering through the brush.<br/><br/>As they made their way deeper into the mountains, the views only got more breathtaking. They stopped at several overlooks to take in the stunning vistas and snap a few photos.<br/><br/>On the final day of the trip, they reflected on the amazing experiences and memories they had made over the past week. They vowed to make this an annual tradition and to continue seeking out new and exciting off-road adventures in the future.<br/><br/>As they packed up their jeeps and headed back home, John, Mike, and Lisa felt grateful for their friendship and the unforgettable trip they had just shared.", "metacritic": null, "released": "2023-02-21", "tba": false, "updated": "2023-04-17T10:27:20", "background_image": "https://media.rawg.io/media/screenshots/be0/be05ab190de4dab61d09c949a5922dfc_7CATfgU.jpg", "website": "https://kingofgames.co", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ahmad Javaid"], "genres": ["Sports", "Racing"], "publishers": ["Ahmad Javaid"], "esrb_rating": "Everyone 10+"}