{"id": 957590, "slug": "ace-racer", "name": "Ace Racer", "name_original": "Ace Racer", "description": "Ace Racer is a racing mobile game introducing innovative vehicles with ultimate skills. Experience various actual cars from legendary vehicle manufacturers like Porsche and Nissan, along with our own custom creations. Each vehicle has its own ultimate skills. So, what are you waiting for? Start your engines and experience our own spin on vehicle ultimates along stunning race tracks! Let's race with ultimate skills to feel ultimate thrills.<br/><br/>FEATURES:<br/>[UNIQUE ULTIMATES] Every vehicle has a unique ultimate skill. Flash across walls, transform while driving, and drift at high speeds! Enjoy every drive and make your own rules!<br/><br/>[MULTIPLE FASCINATING TRACKS] Drag to your heart's content in multiple fascinating tracks around the world. Los Angeles, Shanghai, Tokyo, Nevada, and California are all at your fingertips! Speed along beautiful scenery in famous tourist attractions whenever you want!<br/><br/>[COLLECTIONS GALORE] Enhance your garage with iconic collections! Hop in the driver's seat of a Porsche 911, Nissan GT-R, and other real-life luxury rides, along with some of our own creations. Drive 100+ authorized vehicles from more than 25 well-known car manufacturers. Make each ride your own!<br/><br/>[CUSTOMIZABLE VEHICLES] Customize your vehicle with paint, decals, rims, and lights. You can even get your own license plate! Time to ride your way!<br/><br/>[FAST-PACED, EASY RIDES] Enthusiasm is all you need to drive, even if you're new to the game. Each competition is fast-paced with one minute per round! Dig, drift, drag, and drive your way across the finish line. You own the track!<br/><br/>[COOPERATION] Team up with friends and choose to be a Speedster, Supporter, or Interceptor. Let the unique 3v3 match system add even more thrills to your high-speed experience!<br/><br/>To get more information about the game, please follow us: <br/>Official site: http://www.aceracer-game.com/pre <br/>Twitter: https://twitter.com/AceRacerNE <br/><br/>Please contact our customer service at: gameaceracer@global.netease.com if you have any questions.", "metacritic": null, "released": "2023-03-14", "tba": false, "updated": "2023-04-17T10:31:29", "background_image": "https://media.rawg.io/media/screenshots/d2f/d2f4c032522066cd4d6440cc92c1842a_tPJ8wRD.jpg", "website": "http://www.aceracer-game.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["NETEASE INTERACTIVE ENTERTAINMENT PTE"], "genres": ["Sports", "Racing"], "publishers": ["Netease"], "esrb_rating": "Teen"}