{"id": 957589, "slug": "perfect-avenger", "name": "Perfect Avenger", "name_original": "Perfect Avenger", "description": "What would you do if everything was suddenly taken — no, STOLEN from you?<br/>Your money. Your family's business. Your father's life. Even your girlfriend? Gone.<br/>All taken away by a despicable man you used to call \"boss\".<br/><br/>It's time for revenge!<br/><br/>Join in on this exciting interactive journey of a fellow who seeks to avenge his father's death and claim back everything that was once his. His ultimate mission? To bring down the boss who took everything. How? By building something greater and getting ridiculously rich—way richer than the evil boss!<br/><br/>Build and manage a mega-luxurious mall that has everything...spas, shops, restaurants, markets, nightlife, and much more! You may need to start small at first...but, with your effort and management skills—watch your businesses grow and shoot through the roof!<br/><br/>Remember: the more amenities and businesses you're able to open at your mall, the more visitors you'll have...which means—money...lots of MONEY! Continue upgrading in order to keep your visitors happy and coming back for more.<br/><br/>It won't be long before your boss meets his match and pays for his awful sins!<br/>———<br/>Subscription terms – Perfect Avenger<br/><br/>Here are the subscriptions available in our game:<br/>- Weekly subscription for $9.99<br/>- Monthly subscription for $29.99<br/>- Yearly subscription for $129.99<br/><br/>The offer unlocks the following features:<br/>– New Segway<br/>– Attendants Pack<br/>– No interstitial and banner ads<br/>– 200 gems per day<br/>– 2 mins Cash per day<br/>– 2 Cards per day<br/><br/>This is an auto-renewable subscription. The payment is charged to your account after confirmation. The subscription is renewed unless you unsubscribe 24 hours before the period ends. Your account will also be charged for renewal<br/><br/>End of subscription renewal:<br/>-The payment is charged to your iTunes account after a confirmation of purchase<br/>-The subscription is renewed unless you unsubscribe 24 hours before the end of the current period<br/>-The account will be charged for renewal 24 hours before the end of the current period at the standard cost of the monthly subscription<br/>-The user may manage the subscription and auto-renewal by accessing the user's account settings after purchase in the store<br/>-No cancellation of the current subscription is permitted during the active subscription period<br/><br/>For more information, please visit https://support.apple.com/ht207865<br/>If you have any questions, feel free to contact us at info@kingboat.io<br/><br/>Privacy policy and terms of use: http://kingboat.io/privacy<br/>Link to subscription terms(EULA): http://kingboat.io/userLicense", "metacritic": null, "released": "2023-01-19", "tba": false, "updated": "2023-04-17T10:30:27", "background_image": "https://media.rawg.io/media/screenshots/e7e/e7e846fb494852fc10b35b4aeea6f549.jpg", "website": "https://y5c3dd2a0.app-ads-txt.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kingboat Co"], "genres": ["Simulation", "Casual"], "publishers": ["Kingboat Co"], "esrb_rating": "Teen"}