{"id": 957598, "slug": "mutant-master", "name": "Mutant Master", "name_original": "Mutant Master", "description": "Looking for zombie games with mutants? Enjoying games with enemies transformations?  Then Mutant Master gets you covered. Fully new experience with simple mechanics of elemental games! In this game you’re an insane scientist who created a magic potion in his lab. Now you use this potion to defeat bad guys to survive.<br/><br/>The world is in danger! Use the magic potion in syringes to defeat the villains. Get new elements for your magic potions. Merge them in the mixing station and test on bad guys. Who will will appear after your gang potion? Pass the levels and turn villains into zombies, mutants and monsters. Under your magic potion enemies will lose control and kill each other. Be careful! Gang potions can trigger the zombie apocalypse. Don’t forget about the reward at the end of the level. Use them to upgrade your character to have more fun in the potion game.<br/><br/>GAME FEATURES<br/><br/>• Upgrade your hero. Choose new skin in common and rare sets. Do you wanna play with tattooed hands or colorful gloves? In the game only you decide what to wear!<br/><br/>•  Open new locations. Start your mutant adventure in the open sea. Defeat the bad guys among snow &amp; glaciers. Continue your mission in the place with volcanoes and lava. What location will be next?<br/><br/>•  Create various mutants. Make a new magic potion with different elements, viruses and poisons. Merge all staff in the mixing station. Different gang potions turn the bad guys into different beasts, zombies, fire monsters or even into a crazy sunflower. <br/><br/>Download Mutant Master and enjoy your playing!", "metacritic": null, "released": "2023-03-17", "tba": false, "updated": "2023-04-17T10:39:53", "background_image": "https://media.rawg.io/media/screenshots/00e/00ef7b61afaa3497ba9c55e8608a02fd.jpg", "website": "http://moonee.io", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MOONEE PUBLISHING"], "genres": ["Action", "Casual"], "publishers": ["MOONEE PUBLISHING"], "esrb_rating": "Everyone 10+"}