{"id": 957531, "slug": "winzo-solitaire-money-games", "name": "WinZO: Solitaire & Money Games", "name_original": "WinZO: Solitaire & Money Games", "description": "WinZO Games offers a wide range of skill-based games, including casual, arcade, card games, and more. It has 20+ money games like Solitaire, FreeCell, Rummy, Carrom, Candy Match, Fruit Samurai etc. Play these easy games and win real money up to $10,000. You can also play free games  &amp; win prizes and cash rewards.<br/><br/><br/><br/>QUICK REASONS TO DOWNLOAD WINZO<br/><br/><br/><br/>1- We are the world's leading platform to play real money games on the App Store.<br/>2- Play free games or add a boot amount of your choice.<br/>3- 100% safe &amp; secure with instant withdrawals.<br/>4- Win cash prizes up to $10000.<br/>5- Withdraw your winnings securely through PayPal, Credit Cards and Bank transfer.<br/>6- Become a WinZO superstar and get upto $2000 per month.<br/><br/><br/><br/>GAMES: CHOOSE YOUR BEST GAMES FOR FUN-FILLED HOURS!<br/><br/><br/><br/>WinZO offers a variety of real money games like casual games, card games, action games, racing games, arcade, etc. in single-player and multiplayer modes.<br/><br/><br/><br/>1. CARD GAMES <br/><br/><br/><br/>Solitaire: Become a solitaire legend &amp; experience the smoothest solitaire on iphone.  <br/>Rummy: Capture the best Rummy experience ever and win real cash.<br/>Free-cell: The classic card games to escape the mundane.<br/><br/>All Card games have multiple personalized leaderboards, so double your cash winnings!<br/><br/><br/>2. CASUAL GAMES<br/><br/><br/>Fruit Samurai: Slash the fruits in an ultimate ninja style &amp; win real money.<br/>Candy Match: Match at least three candies and win rewards.<br/>Knife Up: Thrash the board with a knife and score high.<br/>Carrom: The classic board game played with a striker, in which the Queen rules the mind.<br/><br/><br/>3. ARCADE GAMES:<br/><br/><br/>Snake Rush: Collect more points with your snake and aim for the win real money<br/> .<br/>Stupid Birds: Save the eggs from these angry stupid birds attacking the nest. The birds are angry and fast but you can be faster.<br/>Bubble Shooter: Reach the top by shooting the same color bubbles.<br/><br/><br/>4. SPORTS GAMES:<br/><br/><br/>Cricket: Beat the batting score of opponents and win in simple yet exciting cricket games.<br/>Archery: Aim, shoot, and take home your winning cash.<br/>Pool 3D: Become the ultimate Pool star with exclusive shots.<br/><br/><br/>TEAM GAMES<br/> <br/>WINZO WORLD WAR:<br/><br/>Play gaming tournaments daily of your favorite games, chat with your teammates, strategize and win cash up to $10,000<br/><br/><br/>WINZO SPINNER:<br/><br/>Complete Spinner streaks to win bonuses and exciting rewards! More than 10,000 people have already won it.<br/><br/><br/>In case of any query, the players can reach out at support@winzogames.com anytime.", "metacritic": null, "released": "2023-02-13", "tba": false, "updated": "2023-04-17T09:25:04", "background_image": "https://media.rawg.io/media/screenshots/f61/f612b88d35393abaaac11168fa5f85bf.jpg", "website": "https://www.winzogames.com/en-us", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["WinZO Games PVT"], "genres": ["Casual", "Card"], "publishers": ["WinZO Games PVT"], "esrb_rating": "Mature"}