{"id": 957633, "slug": "voc-the-isle-dragon-roars", "name": "VoC: The Isle Dragon Roars", "name_original": "VoC: The Isle Dragon Roars", "description": "Voice of Cards, a series inspired by tabletop RPGs and gamebooks told entirely through a medium of cards, is now available for smartphones! Enjoy an all-new yet appealing nostalgic gaming experience from YOKO TARO, Keiichi Okabe, and Kimihiko Fujisaka, developers of the NieR and Drakengard series.<br/><br/>■Gameplay<br/>Just like during a tabletop RPG, you're guided through the story by the game master as you journey through a world where all the field, town, and dungeon maps are depicted as cards.<br/><br/>The battles are turn-based, and gems—an item needed to unleash skills and granted each turn—are key to victory. You can also deal extra damage or inflict status ailments with a roll of the dice—an action that may determine your fate...<br/><br/>■Story<br/>Long, long ago, the people lived in peace. But then the Dragon appeared, sowing terror throughout the land.<br/><br/>Valiantly, the kingdom fought, claiming narrow victory. Grievously wounded, the Dragon fled.<br/><br/>Thenceafter, the years passed, and people again knew peace. Until the Dragon returned.<br/><br/>Now the queen gathers adventurers to slay the Dragon...<br/><br/>*Voice of Cards: The Isle Dragon Roars Chapter 0, Voice of Cards: The Isle Dragon Roars, Voice of Cards: The Forsaken Maiden, and Voice of Cards: The Beasts of Burden can be enjoyed as standalone adventures.<br/>*This app is a one-time purchase. Once downloaded, the entirety of the game can be enjoyed without purchasing additional content. Cosmetic in-game purchases, such as changes to the aesthetic of cards and pieces or the BGM, are available.<br/>*You may find that the gamemaster occasionally stumbles, corrects themselves or needs to clear their throat, in order to give you the most immersive and true to life Tabletop RPG experience.<br/><br/>[OS Compatibility]<br/>iOS 16.0 or higher<br/><br/>[Applicable Devices]<br/>iPhone 8, iPad (7th generation), iPad Air (3rd generation), iPad mini (5th generation), iPad Pro 10.5-inch, iPad Pro 12.9-inch (2nd generation), iPad Pro 11-inch (1st generation) and higher", "metacritic": null, "released": "2023-03-22", "tba": false, "updated": "2023-04-17T11:18:42", "background_image": "https://media.rawg.io/media/screenshots/4e9/4e9b3f062c407857adda744c4bc17472.jpg", "website": "https://voiceofcards.square-enix-games.com/en_US/theisledragonroars", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 325, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Square Enix"], "genres": ["RPG", "Card"], "publishers": ["Square Enix"], "esrb_rating": "Everyone 10+"}