{"id": 957802, "slug": "oxigen-crisis-on-the-moon", "name": "Oxigen Crisis on the Moon", "name_original": "Oxigen Crisis on the Moon", "description": "<p>GameJam https://itch.io/jam/mini-jam-130-lunar : Theme :Lunar - Limitation : 10 seconds.</p>\n<p>---Story---</p>\n<p>As your eyes adjust to the dimly lit surroundings, you begin to realize the gravity of the situation. The vast emptiness of space stretches out before you, and the barren landscape of the moon looms ominously in the distance. </p>\n<p>Your heart pounds in your chest as you struggle to take in the reality of your predicament. You are stranded on the moon, with no hope of rescue, and only a limited supply of oxygen to keep you alive.</p>\n<p>But giving up is not an option. You steel yourself for the challenge ahead, determined to find a way out of this desolate wasteland. Your mission is clear - you must navigate through the treacherous terrain of the moon's surface, avoiding the craters and obstacles that stand in your way, and collect oxygen canisters to replenish your dwindling supply.</p>\n<p>But time is not on your side. With a 10-second penalty for each collision, every mistake could cost you precious seconds, bringing you closer to the brink of disaster. You must act quickly and make wise decisions to escape before your oxygen runs out.</p>\n<p>As you take your first steps on the dusty surface of the moon, you feel a sense of both awe and fear wash over you. The sheer scale of the lunar landscape is breathtaking, but the dangers that lurk in the shadows are all too real. You know that the road ahead will be perilous, but you also know that you have no choice but to press on.</p>\n\n<p>---Credits----</p>\n<p>Development  and Idea : </p>\n<p>Mauro Rilla - https://misterm.itch.io </p>\n<p>Graphics</p>\n<p>Mauro Rilla with Bing A.I., Krita and Unity animations</p>\n<p>Music</p>\n<p> Hypercasual music Pack - song \"Never Going Back\" (www.void1gaming.com)</p>", "metacritic": null, "released": "2023-04-16", "tba": false, "updated": "2023-04-17T12:40:08", "background_image": "https://media.rawg.io/media/screenshots/87c/87c680963fa11d43722191852688b0e4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Misterm"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}