{"id": 958118, "slug": "keexs-spirits", "name": "Keex's Spirits", "name_original": "Keex's Spirits", "description": "<p><strong>Game is prone to glitches :3<br/><br/></strong><strong>Engelsk</strong></p>\n<p><strong>Step into the magical forest world of Keex's Spirits, where you'll serve up delicious drinks to an array of wacky creatures. As the spirited Kitsune, Keex, it's your job to dash around the floating tables and serve up the perfect drinks to satisfy your guests. <br/><br/> Each level brings new challenges and obstacles to overcome, from jumping over gaps to maneuvering through tight spaces in order to deliver your kitsune concoctions.<br/>But don't worry, Keex's powerful magic abilities, including dashing through the air and throwing bottles very hard, will help you serve your guests quickly and efficiently.<br/><br/>Mix drinks to perfection by following each creature's unique recipe, from tangy fruit blends to dark, mysterious brews. The more drinks you serve, the more points you'll earn in order to grow your business to its maximum potential. But be warned, the guests are in a hurry and won't wait around forever! <br/><br/> Keex's Spirits offers a captivating experience with colorful, cute, and lively graphics, enchanting soundtracks, and fast-paced gameplay. Whether you're a casual player or an avid gamer, you'll love exploring this magical world and serving up delicious drinks to its unique inhabitants. So put on your bartender tie, grab your mixing tools, and get ready to dash through the forest to become the ultimate spirit server!</strong><br/><br/><strong>Dansk</strong></p>\n<p><strong>Træd ind i den magiske skovsverden af Keex's Spirits, hvor du vil servere lækre drinks til en række skøre væsner. Som den energiske Kitsune, Keex, er det din opgave at skynde dig rundt om de svævende borde og servere de perfekte drinks for at tilfredsstille dine gæster.\r\n</strong></p>\n<p><strong>Hver bane bringer nye udfordringer og forhindringer at overvinde, fra at springe over kløfter til at manøvrere gennem snævre rum for at levere dine kitsune-kreationer. Men vær ikke bekymret, Keex's kraftfulde magiske evner, inklusiv at flyve gennem luften og kaste flasker hårdt, vil hjælpe dig med at servere dine gæster hurtigt og effektivt.\r\n</strong></p>\n<p><strong>Bland drinks til perfektion ved at følge hvert væsens unikke opskrift, fra frugtige blandinger til mørke, mystiske bryg. Jo flere drinks du serverer, jo flere point vil du tjene for at vokse din virksomhed til sit maksimale potentiale. Men pas på, gæsterne har travlt og vil ikke vente for evigt!\r\n</strong></p>\n<p><strong>Keex's Spirits tilbyder en fængslende oplevelse med farverige, søde og livlige grafikker, fortryllende soundtracks og hurtig spiloplevelse. Uanset om du er en tilfældig spiller eller en ivrig gamer, vil du elske at udforske denne magiske verden og servere lækre drinks til dens unikke beboere. Så tag din bartender slips på, grab dine blandeværktøjer og gør dig klar til at skynde dig gennem skoven for at blive den ultimative åndetjener!<br/><br/>Lavet med kærlighed af vores hold:<br/>Jamie - Art &amp; Graphics<br/>Leyo - Sound &amp; Music, and Level Design<br/>Niko - Programming, Level Design, and Particle Effects, <br/>Johan - Programming and GUI<br/>Tae - Programming<br/><br/></strong></p>", "metacritic": null, "released": "2023-04-16", "tba": false, "updated": "2023-04-17T15:10:18", "background_image": "https://media.rawg.io/media/screenshots/422/422ee6ddd35b7f3d5d4b60aa6c452395.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TaeWilliam"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}