{"id": 958156, "slug": "button-legacy-rise-of-genz-defenders", "name": "Button Legacy: Rise of GenZ Defenders", "name_original": "Button Legacy: Rise of GenZ Defenders", "description": "<p>Lore:</p><p>In a far-off kingdom, there existed a powerful artifact known as the Sacred Button. This button was the source of all life in the kingdom, and its power was revered by all who lived there.</p><p>But the peace and tranquility of the kingdom were shattered when a dark force emerged, intent on stealing the sacred button and using its power for evil. The people were helpless, and it seemed as though all was lost. </p><p>But in their hour of need, a hero emerged. His name was (insert hero's name), and he was the last line of defense against the forces of darkness. He stood alone, defending the sacred button to his last breath against waves of enemies. </p><p>With every passing moment, the battle grew more intense, and the odds seemed insurmountable. But (hero's name) refused to back down, drawing strength from the knowledge that the fate of the kingdom rested on his shoulders. </p><p>As he fought on, the people of the kingdom rallied to his side, inspired by his bravery and determination. Together, they stood against the forces of darkness, united in their quest to protect the sacred button and preserve the kingdom's way of life. </p><p>In the end, (hero's name) emerged victorious, having defeated the dark force and saved the sacred button. But his victory came at a great cost, and he knew that he could not fight forever. </p><p>And so he passed on the legacy of the GenZ Defenders to a new generation, teaching them the ways of the warrior and the importance of defending the sacred button. For as long as there are heroes willing to fight, the legacy of the GenZ Defenders will endure in the \"Button Legacy: Rise of GenZ Defenders\" game.</p>", "metacritic": null, "released": "2023-04-16", "tba": false, "updated": "2023-04-17T15:29:57", "background_image": "https://media.rawg.io/media/screenshots/06a/06a7e0b395ed806785cbd24efbfd598d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GenZ Bager"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}