{"id": 958196, "slug": "muso-and-the-meteorites", "name": "Musō and the Meteorites", "name_original": "Musō and the Meteorites", "description": "Story:\r\n<p>When a soul passes from the human realm its emotions and memories coalesce into a meteor that travels to the Tanuki plane where the Tanuki mine the gemstones found in the meteorites to grow their hoards! However, one little Tanuki, Musō, is different from the others. He is a dreamer who ponders the complexities and concepts of life and not just material wealth. One day as he starts mining the meteors he experiences the memories and emotions encased within the different gemstones. With this newfound knowledge, he tries to enlighten the other Tanukis in the village who are having trouble connecting to their emotions. </p>\n\r\nGame Objectives:\r\n<p>\"Musō and the Meteorites\" is an open-world exploration game with narrative elements. You play as Musō, a Tanuki who's not your usual treasure-loving and hoard-building Tanuki. When a meteor from the human world crashes on the Tanuki planet, Musō sets out to find the meteor fragments and uncover the emotions hidden within. You must explore the open world and mine all of the meteorites each of which hides a memory tied to an emotion. You can then use these emotions to enlighten the other Tanuki's and help them express emotions they didn't know existed. There is no rush or win condition so take it slow and immerse yourself in the stories presented.</p>\n\r\nControls:\r\n<p>Movement: W, A, S, D</p>\n<p>Interaktion: E or Left mouse button</p>\n<p>Mining: press and hold E or Left mouse button<br/></p>\n\r\nTeam:\r\n<p>Programming: Andreas</p>\n<p>Level design: Tobias</p>\n<p>Writer &amp; Sound: Mirza</p>\n<p>2D art: Matilda</p>\n<p>3D art: Daniel</p>\n\n<p>Made during <strong>Nordic Game Jam 2023</strong></p>\n\n<p>Theme words: Tanuki, LuftMensch and Meteorites</p>", "metacritic": null, "released": "2023-04-16", "tba": false, "updated": "2023-04-17T15:52:19", "background_image": "https://media.rawg.io/media/screenshots/eb0/eb04aeac751aeab7e3833c32de816a9d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GmaerSheep", "Matiti"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}