{"id": 958208, "slug": "mega-drive-drifter", "name": "Mega Drive Drifter", "name_original": "Mega Drive Drifter", "description": "<p>Wciel się w uciekiniera ze strefy kwarantanny znajdującej się w czarnej dziurze.<br/>Zdobądź Mega-Drive i wydostań się z Sektora B8QZ.<br/>Wykorzystaj umiejętność strzelania w bok podczas zakrętu do pokonania dużej liczby przeciwników.</p>\n<p>Sterowanie:<br/>W/S - Napęd do przodu<br/>A/D - Pochylenie statku w bok<br/>Spacja/LMB - Strzał/Następny Dialog<br/></p>\n<p>Wersja przeglądarkowa posiada parę błędów wizualnych i opóźnienie w sterowaniu. Zalecaną wersją gry jest wersja pod systemy Windows x64.</p><p>Interpretacja motywu:<br/></p><p>W dosłownym znaczeniu, granicą w Mega Drive Drifter jest strefa kwarantanny, z której gracz usiłuje się wydostać. Jest to sytuacja bardzo podobna do ucieczki z więzienia czy też realiów z pandemii Covidowej, przez co każdy jest w stanie utożsamić się z bohaterem gry.</p>\n<p>Innym aspektem jest granica determinacji. W pogoni za wolnością, bohater popełnia takie przestępstwa jak kradzież czy morderstwo, tylko po to, aby zdobyć mikroskopijną szansę na ucieczkę. Jedyną inną opcją jest śmierć. W obliczu astronomicznych przeciwności, można sobię zadać pytanie. Jak daleko jesteśmy w stanie zajść, jak dużo możemy poświęcić, aby osiągnąć nasz cel.</p>\n<p>Od strony funkcjonalnej, możemy mówić o łamaniu granic konwencjonalnych. Statek kosmiczny należący do gracza jest prymitywny w budowie. Posiada tylko jeden silnik odrzutowy, a także tylko jedno działo, skierowane zawsze do przodu. Aby móc się mierzyć z licznymi przeciwnikami, gracz jest zmuszony do skorzystania z siły dośrodkowej uzyskiwanej przy obróceniu statku, pozwalając na ruch po krzywej, a także na strzelanie w kierunku innym od ruchu. Cały manewr można by porównać do \"driftu\".</p>\n<p>Autorstwa:<br/>MiałemIśćNaNicolas'aCage'aDoKinaAleRobięGameJam Studio<br/>Bański Krzysztof<br/>Kowalski Jakub<br/>Szerszeń Wojciech</p>", "metacritic": null, "released": "2023-04-16", "tba": false, "updated": "2023-04-17T15:57:33", "background_image": "https://media.rawg.io/media/screenshots/9dc/9dcf73d7c6843c2550338492a6778ff8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["KrzBan"], "genres": ["Action"], "publishers": [], "esrb_rating": null}