{"id": 95820, "slug": "clapper-a-rhythm-clap-game", "name": "Clapper - A rhythm & clap game!", "name_original": "Clapper - A rhythm & clap game!", "description": "A completely new kind of rhythm game!<br/><p>\r\n\tClapper is a unique mix between digital rhythm games and traditional hand-clapping games.</p><p>\r\n\tClapper is the only game that can distinguish between different types of claps. For instance Clapper can distinguish between straight or diagonal claps, or claps being performed with both hands at the same time.\r\n</p><p>\n</p><p>\n<strong>KEY FEATURES:</strong><br/>\n</p><ul>\n<li>Unique clap input! – The only game that can distinguish between five different claps.</li>\n<li>2 player co-op! – Play together with a friend on the same pad, or practice on your own.</li>\n<li>Custom music! - Irresistibly clappy music.</li>\n<li>Beautiful game world! - Explore the Jungle while unlocking new songs.</li>\n<li>Four difficulty levels! - Suitable for first time players and seasoned rhythm game veterans alike.</li>\n<li>Fun for all ages! - Perfect for kids, parents and grandparents.</li>\n</ul><p>\n<strong>\r\n\tCLAPPER´S ACHIEVEMENTS:</strong></p><ul><li>Winner of the \"Indie Sensation Award\" at Nordic Game 2016.</li><li>Winner of \"Best in Show - Audience choice\" at Casual Connect Amsterdam 2016.</li><li>Nominated for \"The Best Kids and Family Game\" at Casual Connect Amsterdam 2016.</li></ul><p>\n<strong>WHY PLAY CLAPPER?</strong>\n</p><p>\r\n\tClapper is a 2 player cooperative rhythm and clap game that encourages teamwork rather than competition. You play together with a friend on the same device, or you practice by yourself. The game is perfect for parents that would like to take part in their child's interest in games, but Clapper is also perfect for music teachers wanting to teach children about music and rhythm in a new and exciting way. Clapper may also work as a great exercise for quarreling siblings to show them how fun it can be to work together to finish a level. Clapper is also a great party game, and can be enjoyed by all ages at all occasions. \r\n\t<br/>\n</p>", "metacritic": null, "released": "2016-05-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7e0/7e0d050da2586f0538577290112c5076.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["bridgeside"], "genres": [], "publishers": [], "esrb_rating": null}