{"id": 958365, "slug": "lufia-iduras-revenge-hardcore-en", "name": "Lufia - Iduras Revenge Hardcore EN", "name_original": "Lufia - Iduras Revenge Hardcore EN", "description": "<p><strong>You need the old RPG Maker 2000 RTP in order to play the game! You can get it at one of these links:</strong></p>\n<strong>\n<p>https://rpgmaker.net/engines/rt2k/utilities/199/</p>\n</strong>\n<p><strong>https://cherryshare.at/f/U9CtlJ</strong></p>\n<p>It's been more than 18 years, but finally an english translation of my german Lufia 2 Fanfiction exists. So, let's do a quick trip down memory lane, shall we?<br/><br/>\"<em>Lufia 2 - Rise of the Sinistrals</em>\", or simply \"<em>Lufia</em>\", as it was called in Germany, is probably my favorite game of all time. I always dreamed about creating my own Lufia game. And when I finally played \"Lufia - Cult of Daos\" sometime in 2004, it gave me the final push to create my own game. Many of the systems that exist here were taken from there, so a big thank you to DarkMax, the original creator!<br/><br/>I started working on Iduras Revenge back in late 2004/early 2005. I had several breaks but the game was finished in 2007. I did plan several other things, like a proper Retry Mode, but that was only finished in 2013. Then, in 2016, I made a \"Hardcore mode\", which rebalanced the whole game and added some new items and enemies. It was supposed to be the final time I worked on the game.<br/><br/>Fast forward to 2021 and a friend of mine who happened to mention the existance of this game to some people in the Lufia 2 Ancient Cave Speedrunner Community. Long story short, said friend made a rough translation of the whole game and gave it to \"dank_meats\", one of said speedrunners. Well, he started playing, I fixed the translation and now, the game has been translated and it should be good enough for you folks to finally play it. :D<br/><br/><strong>Lufia - Iduras Revenge</strong> takes place roughly 20 years after Lufia 2. You take control of Jeroes, Maxim's and Selan's son, who is on a journey around the world to find his own destiny. However, someone or something from his past has already put their sight on him.<br/><br/>As the title suggest, this is a translation of the hardcore version. The game is hard, very much so. Be prepared to load and reload, die and die again, but if you like hard games or Lufia in general, I am sure you will enjoy your time with the game. Due to the age of the game and my limited technical know how back in the day this game is rather basics compared to some other Lufia games, like \"<em>Lufia V</em>\" or \"<em>Birth of a Legend</em>\".<br/><br/>The game houses 16 dungeons + 2 optional dungeons. Enemies are visible and there are many puzzles inside the dungeons. A sort of IP like system exists, but that's it, more or less. Rather basic, but hey, if it's fun, who cares, eh?</p>\n<p>So with that out of the way, enjoy the game!<br/></p>", "metacritic": null, "released": "2023-04-15", "tba": false, "updated": "2023-04-17T17:14:00", "background_image": "https://media.rawg.io/media/screenshots/263/2636c34a69bc2c5a7792071789690c86.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Soelf"], "genres": ["RPG", "Puzzle"], "publishers": [], "esrb_rating": null}