{"id": 958341, "slug": "gravity-assist-dprv-games-studio", "name": "Gravity Assist (DPRV GAMES STUDIO)", "name_original": "Gravity Assist (DPRV GAMES STUDIO)", "description": "<p><strong>Single Sentence Description:</strong> Gravity Assist is a one-button space adventure game where players must navigate their spaceship through a treacherous obstacle course to reach their destination, all while avoiding hazardous planets and space debris.<br/></p>\n\n<p><strong>Design Pillars:</strong> Fast-paced. High-stakes. Addictive. </p>\n<p>Genre/Story/Mechanics Summary: In Gravity Assist, players must steer their spaceship through a series of challenging levels, each with their own unique obstacles and hazards. With only one button to control the ship's movement, players must use precise timing and quick reflexes to make it through to the end. Along the way, they'll encounter different types of planets, each with their own properties, as well as collectibles and power-ups that can help them along the way. </p>\n<p><strong>Features: </strong></p>\n<ul><li>Over 50 levels of challenging space gameplay </li><li>Unique planet types with varying properties</li><li>Collectibles and power-ups to help players along the way </li><li>One-button controls for simple, intuitive gameplay</li><li>Leaderboards to compete with friends and other players worldwide </li></ul>\n<p><strong>Interface: </strong>Players will control the spaceship using a single button or tap, with the objective of avoiding hazards and reaching the end goal of each level. The interface will be designed to be simple and intuitive, with clear and easy-to-understand visuals to guide the player. </p>\n<p><strong>Art Style:</strong> Gravity Assist will have a bright and colorful art style, with a mixture of 2D and 3D elements. The game's aesthetic is inspired by classic arcade games like Super Mario, with a touch of modern design elements from popular games like Fall Guys. Some art style references include Super Mario Galaxy, Sonic Colors, and Spore. </p>\n<p><strong>Music/Sound: </strong>The game's sound design will feature an upbeat and energetic soundtrack, with a mix of electronic and orchestral elements to create a futuristic space vibe. The sound effects will be designed to be impactful and immersive, with a focus on creating a sense of urgency and excitement in the player. Some sound references include the soundtracks for Super Mario Galaxy, No Man's Sky, and FTL: Faster Than Light</p>", "metacritic": null, "released": "2023-04-16", "tba": false, "updated": "2023-04-17T17:04:53", "background_image": "https://media.rawg.io/media/screenshots/b7b/b7bc36de229d658425c05084444fdd9f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DPRV GAMES STUDIO"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}