{"id": 958304, "slug": "poly-blitz", "name": "POLY-BLITz", "name_original": "POLY-BLITz", "description": "<p><strong>POLY-BLITz</strong> is a minimalist bullet hell game. Can your square survive an onslaught of bullets and take down the strongest shape? The mighty triangle is relentless and has defeated thousands of squares before you. Put an end to his reign of terror and destroy the powerful triangle empire!</p>\n\n\r\nTips\r\n\r\n<ul><li>Try and collect items to launch an attack on the mighty triangle to take him down\r\n</li><li>After dashing hold down the space/shift key to move slower and more precisely\r\n</li><li>Its best to collect the items between attacks\r\n</li><li>You are invulnerable during your dash, but its tough to not get hit after the dash runs out - try using this when the bullets are dying down\r\n</li><li>You can take 3 hits before death</li><li>It take 8 hits to defeat the mightily triangle</li></ul>\r\n\r\nCredits\r\n<p>Music is by Creative Commons Legend - Doctor Dreamchip</p>\n<p>All other sound effects were made with my mouth lol</p>\n<p>This game was somewhat inspired by Duel (a shooter game)</p>\n\r\nLore\r\n<p>For generations, the Square lineage has been locked in a bitter struggle against the ruling Triangle Empire. The Triangles, with their acute angles and superior structural integrity, have held sway over the polygonal world for centuries, enforcing their laws with an iron fist and stamping out any who dared to resist. But the Squares, with their right angles and easily calculatable area, have always chafed under the Triangles rule. They have sought to overthrow their oppressors and establish a more just and equitable society.\r\n</p>\n<p>The rebellion against the Triangle Empire has taken many forms over the years, from peaceful protests to violent uprisings. But nothing has ever truly threatened the Triangle's grip on power - until now. The current Square leader, a fierce and determined warrior, has rallied their people to a new cause: to storm the Triangle's stronghold and take down the tyrant at its head. The fate of the polygonal world hangs in the balance.\r\n</p>\n<p>You, as a player, take on the role of this Square warrior, charging headlong into the heart of the Triangle's power to challenge its leader and bring about a new era of freedom and equality. But the path ahead is perilous and fraught with danger. The Triangle's defenses are formidable, and the bullets it spews forth like a deadly rain threaten to destroy you at every turn. Your only hope is to navigate the gauntlet of death and emerge victorious on the other side. Will you succeed where so many others have failed? Only time will tell in POLY-BLITz: A Minimalist Bullet Hell.</p>", "metacritic": null, "released": "2023-04-16", "tba": false, "updated": "2023-04-17T16:49:33", "background_image": "https://media.rawg.io/media/screenshots/e9c/e9cdde81963cfe4debdd394f0006eb2f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["SHMORGUS"], "genres": ["Action"], "publishers": [], "esrb_rating": null}