{"id": 958531, "slug": "moving-legocity", "name": "Moving LEGOCity", "name_original": "Moving LEGOCity", "description": "<p>For længe, længe siden, da LEGO universet blev delt op i forskellige temaverdener, blev en ekstraordinær opdagelse gjort - opdagelsen af det mystiske metal kaldet \"Bygtal\". Det blev sagt, at Bygtal var så gammelt som universet selv, og dens oprindelse var blevet glemt over tid.<br/></p>\n<p>Bygtal var ikke bare et almindeligt metal, det besad enestående kræfter. Det var i stand til at \"smelte\" forskellige LEGO brikker fra forskellige universer sammen, og det tillod byggerne at skabe utrolige bevægelige byer ved at kombinere forskellige typer brikker på magisk vis.\r\n</p>\n<p>Rygterne om Bygtals kræfter spredte sig som en løbeild i hele LEGO universet. Byggere fra alle verdener begyndte at søge efter dette mystiske metal for at kunne skabe utrolige kreationer. Men det var ikke nemt at finde eller arbejde med Bygtal - det krævede dygtighed, erfaring og mod.\r\n</p>\n<p>Nogle sagn fortalte om legendariske byggere, der havde mestret kunsten at arbejde med Bygtal og havde skabt de mest fantastiske bevægelige byer, der kunne udforske hele LEGO universet. Disse byggere blev kendt som \"Mester Byggere\", og de blev beundret og respekteret af alle.\r\n</p>\n<p>Men vejen til at mestre Bygtal var ikke uden farer. Nogle mente, at Bygtal havde en egen vilje og kunne udfordre dem, der forsøgte at beherske det. Det blev sagt, at Bygtal kun valgte de mest dygtige og modige byggere til at afsløre sine hemmeligheder og kræfter.\r\n</p>\n<p>Således blev historien om Bygtal en legendarisk fortælling i LEGO universet, en historie om opdagelse, mysterium, og mestring. Og det var op til spillerne at træde ind i rollen som de modige \"Mester Byggere\" og bruge Bygtal til at skabe deres egne eventyrlige bevægelige byer ved at kombinere forskellige brikker fra forskellige LEGO verdener og udforske det ukendte i LEGO universet.\r\n </p>\n\n<p>Efter opdagelsen af det mystiske og kraftfulde Bygtal, blev LEGO personerne grebet af en næsten besættende trang til at bruge det i deres byggeprojekter. De kunne se det enorme potentiale i metallet, men uanset hvor meget de prøvede, gik det altid frygteligt galt. Der var en slags \"besked\" fra universet, som om det fortalte dem, at der var nogen andre væsener, der var i stand til at beherske Bygtal på en helt anderledes niveau.\r\n</p>\n<p>Historien fortsætter med fem LEGO personer, der beslutter sig for at tage på en episk rejse for at skabe det første kort over det kaotiske LEGO univers. For at bygge et køretøj, der kan fragte dem rundt i hele universet, var de nødt til at bruge Bygtal til at konstruere motoren. Mirakuløst nok lykkedes det dem at bygge motoren uden nogen ulykker, og de var klar til deres første køretur på deres opdagelsesrejse.\r\n</p>\n<p>Men det var kortvarig sejr. Under den første køretur eksploderede motoren pludselig i en voldsomt brølende ildkugle, og de fem LEGO personer blev kastet ud til hver deres fjerne hjørne af LEGO universet. De var nu spredt langt fra hinanden, uden mulighed for at finde hinanden igen.\r\n</p>\n<p>Men eksplosionen havde en uventet konsekvens. Den øredøvende lyd fra braget tiltrak opmærksomheden fra den første Mester Bygger, en legendarisk figur kendt for sin uovertrufne evne til at skabe. Den første Mester Bygger brugte resterne fra den eksploderede motor til at konstruere den allerførste mobile by - Mobile City. Det blev et mesterværk af bygningskunst og teknologi, og det blev et symbol på håb og inspiration for alle LEGO personerne i universet. Mobile City blev et episk udgangspunkt for Mester Byggerne og den ville forandre LEGO universet for altid.\r\n </p>", "metacritic": null, "released": "2023-04-15", "tba": false, "updated": "2023-04-17T18:28:23", "background_image": "https://media.rawg.io/media/screenshots/178/1781dd43e903b489378a772380ec8305.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DocVonW"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}