{"id": 958682, "slug": "dragons-edged", "name": "Dragon's Edged", "name_original": "Dragon's Edged", "description": "<p>My Tumblr Link: Dragon's Edged Tumblr</p>\n<p><em><strong>Introduction:</strong></em>\n</p>\n<p>\"Another one bite the dust\" a voice says sorrowful, peering through a mirror and seeing a image of people gathering around a mangled body.\r\n</p>\n<p>The person waves their hand in the air and the mirror disappeared, leaving them alone to their thoughts.\r\n</p>\n<p>\"Looks likes I need to prepare for the ritual for this one!\" they sigh and head aching due to thinking the preparation that must be done.\r\n</p>\n<p>Still contemplating, they heard their door slammed wide open and a figure barging into their quarters.\r\n</p>\n<p>\"LUCIAN!\" they scold the person for being disrespectful and disturbing their peace.\r\n</p>\n<p>Lucian dismissed the rebuke with a wave of his hand.\r\n</p>\n<p>\"Yes, I know Lucille and I apologize but I want to be sure.\" he says in a somber tone and a sad look on his eyes.\r\n</p>\n<p>Lucille looked at his brother with a puzzling look; <em><strong>\"Sure of what?</strong></em>\" she ask herself in her mind.\r\n</p>\n<p>She and his brother are Gods and they can sense if a life is snuffed out on Earth.\r\n</p>\n<p>Due to her being the <em><strong>Goddess Of Life</strong></em> and his brother <strong>,</strong><strong><em>God Of Fertility</em></strong>.\r\n</p>\n<p>Up to this day she still doesn't know why the roles are swapped, is it the job of the woman to oversee which will be fertile?\r\n</p>\n<p>But nevertheless the two of them do their job with upmost devotion.\r\n</p>\n<p>\"What do you mean? My Brother?\" she looked at him with calculating eyes.\r\n</p>\n<p>Still waiting for a reply, she was shocked to see that her brother burst to tears.\r\n</p>\n<p><strong>\"MY FAVORITE AUTHOR DIED!!\"</strong> he screamed at the top of his lungs and eyes flooding with tears.\r\n</p>\n<p>Lucille mouth gone slack and can't help but face palm.\r\n</p>\n<p>\"Oh brother!\" she exclaims in slight annoyance and with a roll with her eyes.\r\n</p>\n<p><em><strong>Story:</strong></em>\n</p>\n<p><strong>You're a IF writer, correction was a IF writer!</strong>\n</p>\n<p><strong><em>So the gist of the IF that you written is that the MC(you) is imbued with a dragon’s soul but of course you don’t want to make the life of MC’s easy, that particular dragon is ruthless and stubborn waiting for the opportunity to kill your MC.</em></strong>\n</p>\n<p><strong><em>You finished the game and launched it lived and never thought that people would loved it and gaining so many followers on “Rumblr”</em></strong>\n</p>\n<p>But an accident happened and forced you to stop breathing on the realm of the living ,you were still processing what happened and your memory is still blurry.\r\n</p>\n<p>Everything happened so fast, you were coming out of the cake shop with cake in hand and starting the journey back home so that you and the family can celebrate the birthday of your Father.\r\n</p>\n<p>Then, you saw a little girl crossing the streets and a vehicle fast approaching.\r\n</p>\n<p>Afterwards, everything went black and your can't remember what happened next.\r\n</p>\n<p>To your surprise when you heard a Goddess speaking to you and telling that you will be reincarnated.\r\n</p>\n<p>As added bonus to getting a second life, you will be reincarnated to your IF.\r\n</p>\n<p>Frankly, you still don't know how you feel about this?\r\n</p>\n<p>Leaving your past life and exchanging it with a fictional one but still what's done is done and besides dead people can't be choosers.\r\n</p>\n<p><strong>\"A walk in the park!</strong>\" you boast and knowing that you know the ins and out of your story.\r\n</p>\n<p><strong>\"Oh one more thing!\" </strong>a voice interrupts your moment.\r\n</p>\n<p><em><strong>\"Your IF has been rewritten by the Gods!\"</strong></em>\n</p>\n<p><strong>\"Oh!\"</strong> you exclaim worriedly.\r\n</p>\n<p><em><strong>Features:</strong></em>\n</p>\n<ul><li><strong>Pick your MC's gender</strong>\n</li></ul>\n<p><strong>*Customize your MC's physical appearance.</strong>\n</p>\n<p><strong>*Make choices that will affect the story and the people around you.</strong>\n</p>\n<p><strong>*Choose your class and mastery.</strong>\n</p>\n<p><strong>*Can you love among the characters that you created? Know their new story, see what makes them tick. 2 males and 2 females with their own personality.</strong>\n</p>\n<p><strong>*Will you follow the story that is dictated in the book or will you make your own narrative.</strong>\n</p>\n<p><strong>*Battle liches, dark knights, tackle conspiracy and many more!.</strong>\n</p>\n<p><strong>*Oh! A surprise character will be waiting for you in the story!</strong>\n</p>\n\n<p><strong>Romance Options:</strong>\n</p>\n<strong>\"</strong><em><strong>Clara Dacre</strong></em><em>, </em><strong><em>The Royal Princess\"</em></strong>\n<p><strong><em>\"You think being royalty is a boon?</em></strong>\n</p>\n<p><em>The Royal Heir to the throne and the eldest of her brother.</em></p>\n<p><em>A little shy despite her status but when you get on her good side the two of you can talk for hours with tea of course!</em>\n</p>\n<p><em>Just like how you wrote her in your story but something is amiss.</em>\n</p>\n<p><em>Did you just watched her beheaded a enemy?</em>\n</p>\n<p><em>Well looks like the Gods did the princess dirty by changing her sweet and kind attitude with something feisty and</em> <em>ferocious.</em>\n</p>\n<p><em>So don't mistake her gentleness for weakness because when the time comes she is a fearsome warrior on the battlefield, her parents made sure that she can protect herself from any possible threats that can come her way.</em>\n</p>\n<p><strong>A courageous and fearless fighter, not afraid dying on the battlefield and seeing her royalty as only restriction to her passions and hobbies.</strong>\n</p>\n<p><strong>Much preferring to solve the problem with her own hands and not wanting to waste her life sitting on the throne all day.</strong>\n</p>\n<p><strong> While making sure the safety and her future kingdom will be protected  and dispose those who will dare harm it.</strong>\n</p>\n<p><strong><em>\"Can your love prevail through the complicated politics of royal courtship or will you drown under the sea of bodies seeking also the favor of being the consort of the princess?\" </em></strong>\n</p>\n\n<strong><em>\"Lucas Pierce, The Royal Bodyguard Of The Princess\"</em></strong>\n<p><em><strong>\"Everyone and everything is an enemy, until proven not, by me!\"</strong></em></p>\n<p>The most angsty and cruel character you have ever written for your story, not to mention the most beloved and thirst for by your followers in <strong><em>Rumblr.</em></strong>\n</p>\n<p><em>Tasked with companying and ensuring the safety of the princess at all times.</em>\n</p>\n<p><em>Has that gaze with death shining in his eyes, always on edge and a aloof person who doesn't care what position or status you have.</em>\n</p>\n<p><em>To him if he saw you a threat he will not hesitate to take you down even if you have the biggest reputation on the kingdom.</em>\n</p>\n<p><em>Don't believe me? heck even the closest friends of the princess and his own comrades must get inspected and interrogated before they can get an audience with the princess.</em>\n</p>\n<p><strong>Very devoted and thorough in his job, no one is exempted in his screening and interrogation.</strong>\n</p>\n<p><strong>Quick, precise and deadly in the ways of the sword but you seem to noticed that he is very lonely and only the princess is talking to him.</strong>\n</p>\n<p><em><strong>\"Can you convinced him that there is more to life than his job? Like being loved by you? or Lucas will cut your heart out before you have the chance to confess to him?\"</strong></em>\n</p>\n\n<strong>\"Lucian, The God Of Fertility\"</strong>[M]\r\n\n<p><em><strong>\"I love your story so much and it's one of my dreams to be a part of it!\"</strong></em>\n</p>\n<p><em>You still don't know the reason why the heck  is a man the God Of Fertility.</em>\n</p>\n<p><em>You don't mean to stereotype but your just used to seeing in movies that women are always in charged of the Fertility department.</em>\n</p>\n<p><em>But you see him not complaining and loving his job with enthusiasm.</em>\n</p>\n<p><em>Despite being a God, you can't help but see him act like a child, because people are used to seeing Gods acting dignified and regal.</em>\n</p>\n<p><em>But don't doubt his competency in his Godhood, because he's well-versed in his powers</em><strong><em>(Not that much really)</em></strong><em>, you hoped for both of your sakes.</em>\n</p>\n<p><strong>A God and a Fanboy of the MC, yup he's a loyal follower to the MC and when MC drops a post he is always there to leave a like and a reply to show his support and love.</strong>\n</p>\n<p><strong>So you can imagine how devastated he was when he learned that his idol died and how joyful he was when his fave Author will get reincarnated and meeting them on the flesh.</strong>\n</p>\n<p><strong>Carefree and a friendly attitude, making you give your trust to him early on or making you doubt that for a God he acts super friendly and maybe that he has some sort of hidden agenda?.</strong>\n</p>\n<p><strong>But still he's always there for the MC and giving his aid whenever someone needs it.</strong>\n</p>\n<p><strong><em>\"Can you see past through the fan love and childish banter and notice that there's something brewing in your chest or will you be content on being his favorite Author?</em></strong>\n</p>\n\n<strong><em>\"Songixoninne(Variel), The Raging Inferno\"</em></strong><strong><em>[F]</em></strong>\n<p><strong><em>\"Humans are so small and fragile beings, how quint</em></strong><strong><em>!\"</em></strong></p>\n<p><em>The most vile and cruel dragon you have written in your story, in your version of the narrative her soul is forcefully bonded to the MC as a way to imprison and punish her for her crimes.</em>\n</p>\n<p><em>But you leave it to the readers to mold the MC if they like being used as a container for the dragon without their permission.</em>\n</p>\n<p><em>But the Gods would not keep their hands to their selves and have to change her too also.</em>\n</p>\n<p><em>Now the dragon that you portrayed as the annoying villain and parasite in your story, will be now accompanying you in your new life whether you like it or not. </em>\n</p>\n<p><em>You prepared yourself for the battle that will begin but meeting her firsthand made you changed your thoughts about her.</em>\n</p>\n<p><em>Now instead of defeating her, you have to endure the condensing and insults that she will throw in your way.</em>\n</p>\n<p><strong>A name so hard to pronounce and having a mean and bestial attitude, cursing the day for no having choice to team up with MC.</strong>\n</p>\n<p><strong>Also, making sure that MC knows of it throughout the journey</strong>.\r\n</p>\n<p><strong>Laughing at MC's blunder, stupidity and the tiniest mistake.</strong>\n</p>\n<p><strong>Ridiculing and condescending but as time goes on their snappy attitude started to subside and it looks like they're starting to have a soft spot</strong>.\r\n</p>\n<p><strong>But there's that occasionally taunts and name calling every now and then but it seems those insults lose some of it's bite.</strong>\n</p>\n<p><strong><em>\"Can you fall for a person, nigh a dragon? Who keeps mocking you?</em></strong>\n</p>\n<p><em><strong>Thinking that maybe this is her way of confessing to you? or maybe you will fight and return her insults, fueling her fiery rage for you?\" </strong></em>\n</p>", "metacritic": null, "released": "2023-04-15", "tba": false, "updated": "2023-04-17T19:39:46", "background_image": "https://media.rawg.io/media/screenshots/54a/54a52c3590824803154a225d2eeca35b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Second Chance123"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}