{"id": 958689, "slug": "the-pixel-pantheon-museum-of-artistic-gods-and-god", "name": "The Pixel Pantheon: Museum of Artistic Gods and Goddesses", "name_original": "The Pixel Pantheon: Museum of Artistic Gods and Goddesses", "description": "<p>My project takes the player on a virtual journey through a town, beginning at their home and ending at a museum where they can view a collection of historical paintings depicting gods and goddesses. The goal is to provide an immersive and engaging experience for the player, as they explore the virtual town and gather the necessary items to enter the museum.\r\n  </p>\n<p>To make the journey more engaging, I've incorporated a mini-game where the player must collect six stars hidden throughout the various buildings and areas before they can enter the museum. The stars are scattered throughout the rooms but are easy enough to find without too much effort. This provides a fun challenge for the player and gives them a sense of accomplishment once they collect all the stars.\r\n  </p>\n<p>Also, the player must obtain a ticket to enter the museum, which they can easily find in the house. I've made sure to remind the player to get the ticket and starts a few times to avoid confusion. This helps the player to stay on track and complete the mission.\r\n  </p>\n<p>Once the player enters the museum, they are greeted with descriptions of the paintings. The descriptions help to provide context for the paintings and give the player a deeper understanding of the art they are about to view. After reading the descriptions, the player can then enter the room where the full images of the paintings are displayed. This adds to the overall immersive experience, as the player is transported into another room where they can fully appreciate the art.\r\n</p>", "metacritic": null, "released": "2023-04-15", "tba": false, "updated": "2023-04-17T19:43:13", "background_image": "https://media.rawg.io/media/screenshots/689/689b3763d0716283368e8976c3c02a98.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Nat.arias"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}