{"id": 958830, "slug": "time-possum", "name": "Time Possum", "name_original": "Time Possum", "description": "<p>As you probably know, here at the Time Institute we’ve built enormously expensive machines that generate ultradimensional wormholes and then create Einstein-Rosen bridges that allow us to exchange consciousnesses across time. We manage the destructive positive feedback loop of virtual particles circulating through a wormhole generator by sending returning particles not to their universe of origin but to a parallel dump universe we don’t care about. Since we’re operating in Minkowski space, which is inherently non-Euclidean and lacks all the generalized Riemannian geometries with intrinsic curvature, everything stays just stable enough. I mean it works, but don’t ask too many probing questions.</p>\n<p>The downside to flavor-blasting the strands of time with virtual particles is that the consciousness’ our clients swap with belong to an extremely specific non-sapient taxon. It’s the Virginia opossum, Didelphis virginiana.</p>\n<p>You can ask me why and I can’t tell you because we have no idea. That’s just how time travel works. If you want to send your brain back in time, a possum must be waiting on the other side. I wish it were not so, but it is definitely so.</p>\n<em>Time Possum</em> and <em>Possum Time </em>are twin, parallel two-person games.\r\n<p>In <em>Time Possum</em>, you play a brave client of the Time Institute, transferring your consciousness into the body of a possum some time in the past.</p>\n<p>In <em>Possum Time</em> you play the possum whose consciousness has been kicked out, now in a human body in its own future. Just another weird day in the life of a possum.<br/></p>\r\nLogistics:\r\n<ul><li><strong>Participants</strong>: Two, who take turns facilitating for each other.</li><li><strong>Time</strong>: Variable. A couple of hours, or one-hour chunks over time.\r\n</li><li><strong>Materials</strong>: Two six-sided dice. A way to track basic information (printed character sheets or a shared document will work). These rules.</li><li><strong>Space</strong>: In-person or remote.</li><li><strong>Intended Tone</strong>: Light, silly, and over the top, with room for a little seriousness or darkness if you’re into that.</li><li><strong>Content warnings</strong>: Loss of agency, potential cruelty to animals, the need to improvise, high levels of silliness, the innate intensity of two-player games</li></ul>\n<strong>What's Included?</strong>\n<ul><li>13 page PDF \r\n</li></ul>\n<strong>Questions?</strong>\n<p>Comment here, or get in touch with us at info@bullypulpitgames.com.\r\n</p>\n<strong>Effusive Praise?</strong>\n<p>We're on Facebook,  Twitter, and Instagram. Tag us in @bullypulpit_HQ.\r\n</p>\n<p><strong><em>Thank you to our supporters on Patreon for making this game possible.</em></strong>\n</p>", "metacritic": null, "released": "2023-04-14", "tba": false, "updated": "2023-04-17T20:42:07", "background_image": "https://media.rawg.io/media/screenshots/fe1/fe15267ab1ecdc2a5057c64a5e378717.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bully Pulpit Games"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}