{"id": 958851, "slug": "bear-necessities-cartridge-tilt", "name": "Bear Necessities (Cartridge Tilt)", "name_original": "Bear Necessities (Cartridge Tilt)", "description": "Four bears, one beehive. Nobody gets left behind!\r\n<p>Play local co-op with your friends in this short, but sweet puzzle platformer with tiny bears trying to get their honey fix before winter comes around.</p>\n<p>Jump on platforms, push logs, bounce on mushrooms, and most importantly, avoid the spiky bear-unaliving thorns. They hurt a lot.</p>\n\r\nThe Protagonists\r\n\n<p>Meet the bears! From left to right, we've got Gary the Grizzly Bear, Barry the Black Bear, Perry the Polar Bear, and last but not least, Simon the Panda Bear.</p>\n<p>Hold on, what's a panda and a polar bear doing all the way out here? I guess they're just visiting their cousins before winter starts, I suppose. Or perhaps they're lost and looking to find their way back home.</p>\n<p>Should we help them? Nah, they're probably going to be fine.</p>\n<p>Right?</p>\n\r\nFeatures\r\n<ul><li>3 levels of bear necessitatin' action!</li><li>Storybook-quality hand drawn graphics<br/>\n</li><li>Dynamic soundtrack changes as you progress through levels</li><li>Test your friendships with puzzles that require teamwork and coordination (teamwork and coordination sold separately)</li><li>Non-existent reward for collecting all 3 golden berries hidden in each level</li></ul>\n\n\r\n\r\nControls\r\nACTIONPLAYER 1PLAYER 2PLAYER 3PLAYER 4LeftAFJLeftRightDHLRightJumpWTIUpCrouch/TeabagSGKDownPauseEscEscEscEsc\r\n<p>Gamepads are also supported.</p>\n<p>Pausing the game will also show a list of controls for easy reference.<br/></p>\n\r\nFor The Best Experience\r\n<p>Playing with 4 controllers is recommended for the best experience, but the second-best option is to play with external keyboards plugged in to prevent n-key rollover.</p>\n\r\nCredits\r\nCartridge TiltProgrammer, Sound DesignZowynnProgrammer, ArtistRJ GonzalesArtistKekwdyneLevel DesignerGlennetProgrammer\r\n<p>Game created in about a month by Manila Manufacture</p>", "metacritic": null, "released": "2023-04-14", "tba": false, "updated": "2023-04-17T20:52:24", "background_image": "https://media.rawg.io/media/screenshots/938/938b243d344596a4152e7b5af27def6b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Cartridge Tilt"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}