{"id": 958953, "slug": "legion-lords", "name": "LEGION LORDS", "name_original": "LEGION LORDS", "description": "LEGION LORDS\r\n<p><em>This is a test build of the current work-in-progress prototype of Legion Lords.</em></p>\n<p>A competitive RTS, choose your army composition to strategically outmaneuver your opponent. No micro, only macro. Use your resources on buildings that will continually spawn units to the Rune Portal on the battlefield.  Build on the side of your building grid to spawn units on the corresponding lane.<br/></p>\n\n\n<p>You can buy upgrades on each building for each unit. It is a global upgrade that will work on all future spawned units no matter the building. Buy once to keep per match.</p>\n\n\n<p>There is a spell system for a player to use a spell ONE TIME during a match, so be very careful. You can use it defensively or offensively. Currently there is only one spell in this build called 'Wrath', which will increase all spawned units attack speed significantly for 12 seconds. Future spells will also be targetable with a radius indicator. For example, a spell that kills ALL units within a radius of 20. (Yes, even your own.)<br/><br/></p>\n<p>(The red particles in the image below show the 'Wrath' effect on the blue team)</p>\n\n<p>Each team has 2 defensive towers per lane. Destroying these towers rewards gold. The first turret is weaker than the next, therefore the reward is also smaller. Aggression can pay off if you get a tower down.</p>\n\n\n<p>The Prototype currently has 6 units and 1 resource generator. We're working on adding many more. We want to hit at least 20 different units before thinking about an alpha stage.</p>\n<p><strong>Prototype Roadmap</strong><br/></p>\n<ul><li>20 Units</li><li>Flying units</li><li>Stealth units (and revealer units to bust them out of stealth)</li><li>A gold mining trait unit (Will be able to mine gold veins on the lanes for additional gold)</li><li>A center lane advantage gold increase (one for each lane)</li><li>Calculate Armor, Penetration, and Resitances when an Entity takes damage</li><li>A way  to choose which lane/rune portal a unit should spawn. This is still early game design, and is mainly being considered for 3 lane maps</li><li>Upgrade system to upgrade units on their corresponding buildings (This is currently visually represented, but not functional in the current build)</li><li>5 one-time spells for a player to choose between</li><li>3D graphic models</li></ul>\n<p><strong>Beyond Prototype Roadmap</strong></p>\n<ul><li>2v2</li><li>3v3</li><li>A variety of maps that can have up to 3 lanes for more strategic manouvering</li><li>Server Architecture Matchmaking over Steam Relay (Currently only Host &amp; Client over Steam is functional for testing purposes. Not yet included in this build.)</li><li>Steam SDK intregration for easy lobby party matchmaking with Steam Friends</li><li>Ranking System for all game modes (1v1, 2v2, 3v3)</li><li>A shop for skins for units, buildings, islands, etc. NO P2W</li></ul>", "metacritic": null, "released": "2023-04-14", "tba": false, "updated": "2023-04-17T21:37:36", "background_image": "https://media.rawg.io/media/screenshots/49a/49abb295373f45792c3867988e4a2c92.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SleepyGolem"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}