{"id": 958950, "slug": "poppet-quest-imaginary-villain", "name": "Poppet Quest (Imaginary Villain)", "name_original": "Poppet Quest (Imaginary Villain)", "description": "<em>Please note: This is a prototype, it is not finished, and everything is subject to change. </em>\n\n\n<p>Life was good for Poppet, she had her window, and every night she would look at the stars from it. Then each morning she would fall lifeless where she stood. You see Poppet is a doll, and she’s always been in the attic. She’s always had her window. Oh the others? Does it matter what they do all night? They’re just other toys after all. How could they matter? As long as Poppet had her window, all was right in the world.\r\n</p>\n<p>However tonight she woke up in a box, this wasn’t her window. In fact this was on the other side of the attic. But how did she get here? Why was she in this box? She had to make it back, the voice in her head said so, and it wasn’t about to be denied.\r\n</p>\n<p>But a curious pair of eyes watched, a harlequin girl, a ghost living in the paintings who claimed they weren’t always toys, and that Poppet wasn’t always at the window. But that’s preposterous! The window was all Poppet knew… right? The voice in her head seemed to say so, but another voice… One she hadn’t heard in a long time, her own inner voice said differently.\r\n</p>\n<p>Would she set out as the harlequin girl suggested to free herself? Or return to her  window as the other voice wanted her to do? What really is the secret behind the attic? Why are there so many toys here? Why do they all move at night? How did anyone get there? Questions, questions, questions… One thing is for certain, it’s going to be a very long night. A great many cursed toys live in this attic, and not all of them are friendly.</p>\n\n\n<p>Currently added:</p>\n<p>1. Combat areas are entirely randomly generated.\r\n</p>\n<p>2. Top down action RPG gameplay.\r\n</p>\n<p>3. Two dimensional story areas.\r\n</p>\n<p>4. Tarot Mini Game</p>\n<p>5. Custom graphics\r\n</p>\n<p>6. Unlockable new things and areas by saving your friends.</p>\n<p>7. Magic based combat, currently with 8 spells.</p>\n<p>8. An incorporeal ghost form allowing you to fly and pass through objects for a limited time.</p>\n\n\n\n\n<p>Moving: WASD or Left click with the mouse</p>\n<p>Block: Q </p>\n<p>Ghost Form: E</p>\n<p>Select spells: 1-7</p>\n<p>Cast a spell: Right click</p>\n<p>Talk/Interact: Spacebar</p>\n<p>Status Menu: Escape</p>\n\n<p>Talk to Tinka in the game to learn additional effects abilities and controls have.</p>\n\n\n\n\n<p>Have an idea to improve this game? Feel like seeing it created right before your eyes? If so drop by my live streams and join in the game dev fun! Streams are Tuesday through Saturday 2AM Pacific Time!\r\n</p>\n<p>https://www.youtube.com/@ImaginaryVillain/streams\r\n</p>\n<p>\n</p>", "metacritic": null, "released": "2023-04-14", "tba": false, "updated": "2023-04-17T21:36:29", "background_image": "https://media.rawg.io/media/screenshots/173/173bf6e3afd0a10207f96be75f39043e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 378, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Imaginary Villain"], "genres": ["Action", "Adventure", "RPG"], "publishers": [], "esrb_rating": null}