{"id": 959058, "slug": "shadows-of-the-gun", "name": "Shadows of The Gun", "name_original": "Shadows of The Gun", "description": "<p>The Wild West.  Daunting. Unforgiving. Untamed.<br/></p>\n<p>You know better than anyone the tragedies that have plagued these lands, the injustices that have been committed, and the lives that have been lost. You've seen it all. Seen good people fall victim to the ruthlessness and corruption, seen entire towns burn to the ground, and watched families be torn apart by violence and greed.\r\n</p>\n<p>For as long as you can remember, you've been a renegade, living on the edge of society. You've never known stability or security, always moving from town to town never settling down. You've been forced to leave nothing but a trail of pain and destruction in your wake. Never been able to stop long enough to think about the consequences.\r\n</p>\n<p>But is that all you are? Given the chance to change, would you take it? To give instead of take. To help instead of hurt. To build instead of destroy. Or do you want to continue down the same path? To forever be the child without a home, without purpose, without hope.\r\n</p>\n<p>Will you make sure the West remains untamed or will you too look for a new beginning?\r\n</p>\n\n<ul><li>Customize who you are in the Wild West: appearance, sex, gender, and sexuality \r\n</li><li>Be an angry little gremlin who's trying to find the place they want in the world\r\n</li><li>Make life harder for your make shift family or just for yourself\r\n</li><li>Risk making friends and falling in love. Will you be able to let them go when it's time to run again?\r\n</li><li>Be an absolute disaster of an outlaw</li><li><em><strong>Rated 18+ due to Child Abuse/Neglect, Gore/Violence, Drugs, Alcohol, Potential Sexual Content</strong></em></li></ul>\n\n<p><em><strong>'Blessing' Cain / The Renegade </strong></em>\n</p>\n<ul><li>That's you. The young outlaw causing havoc across the West alongside the infamous duo Jesse Alden and Harrison Boyd. I would say that this wasn't always your life but, that would be a lie. Your parents looked at the West and, like every other person, saw a new beginning. They, however, felt that the land out West wasn't for everyone, only for those chosen by the Lord himself. Out they went claiming their land and dealing with anyone who tried to stop them. They hurt people, a lot of people, but the one they hurt the most was <strong><em>you</em></strong>. When they felt it was time to return to the Lord they planned to take their entire family with them. You fought and managed to survive. Now it's up to you to decide if that fight was worth it.\r\n</li></ul>\n<p><em><strong>Jesse Alden / The Older Brother</strong></em>\n</p>\n<ul><li>The reason you're here and alive. Jesse is about as close as you can get to an older brother without actually being blood-related. Since the moment he met you, he has always made taking care of you his top priority. Sure, he's annoying at times and doesn't listen to you, but that's what older brothers are supposed to do right? No matter how much you bicker, you know that he'll always have your back. At least you believe he will, he would never hurt his little Blessing right?\r\n</li></ul>\n<p><em><strong>Harrison Boyd / The Old Bastard</strong></em>\n</p>\n<ul><li>You and Harrison don't exactly get along real well. If Jesse could be considered your brother, Harrison would be your very distant and always unhappy father. He doesn't hate you, you would know if he did, but he doesn't exactly like you either. Harrison may be a grumpy old bastard, but you can trust him to protect you and Jesse till his dying breath. Try not to annoy him too much, or he might ignore you the rest of the week.\r\n</li></ul>\n<p><em><strong>Aster Vega / The Star-Eyed Outlaw / Gender Selectable (RO)</strong></em>\n</p>\n<ul><li>Aster Vega is your first and oldest friend. You first met when you were twelve and they attempted to steal your satchel. After you chased them down and, very aggressively I may add, took it back, they looked at you like you had hung the stars. They still have that look every time you end up running into them again along the road. You have no idea what you did to be looked at like that, but you think it might have something to do with Asters none stop prattling about fate and how \"One day we'll ride together. It's written in the stars I know it\". Maybe your fates truly are interlinked like they seem to believe.\r\n</li></ul>\n<p><strong><em>Roman/a Escuella / The Savior / Gender Selectable (RO)</em></strong>\n</p>\n<ul><li>You met Ro at one of your darkest times ,yet in just a matter of weeks they bring back the light to your life that you had been searching for. They're kind, caring, gentle, and everything that you're not. They love and care for you without hesitation, bringing you into their life and sharing everything they have with you. Allowing you to experience everything you had dreamed of. The real question is, how badly are you going to burn them for their naivety?\r\n</li></ul>\n<p><strong><em>Andrew &amp; Elizabeth Cain / The Devout</em></strong>\n</p>\n<ul><li>You're parents who dragged you and your siblings along on their quest. They're actually insane, and dead. They may be gone, but their actions are hard to forget.\r\n</li></ul>\n<p><em><strong>Adrian Blake / The Leader</strong></em>\n</p>\n<ul><li>He leads the gang that Aster is a part of.  From what Aster has said he has a bit of a temper, but as long as you stay on his good side you'll be fine. He's after someone though, but Aster hasn't been told who. Just make sure to avoid him for now, it's for the best.\r\n</li></ul>", "metacritic": null, "released": "2023-04-14", "tba": false, "updated": "2023-04-17T22:25:48", "background_image": "https://media.rawg.io/media/screenshots/3bc/3bc116ef40e6d60a9c4447223f61dc64.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["konosadmaru"], "genres": [], "publishers": [], "esrb_rating": null}