{"id": 95910, "slug": "gun-princess", "name": "Gun Princess", "name_original": "Gun Princess", "description": "<p>Take on the role of a girl with the worst form of amnesia; only having dark, depressing flashbacks from her time as a soldier. The first two people you meet lie to you and force you back into a life as a killer, albeit as a masterless mercenary who can help whoever she pleases. But shadows of your past are always a single step behind you, and whether they are out for revenge or simply desire, they do not forget just because you did.<br/></p>\n<p>Will you find out who you were, or will you stay blissfully ignorant in a world that cannot forget what you did? Will you settle down for a quiet life or keep pushing on and on until you find the truth? Or will you just hoard as much gold as possible by doing the one thing you're good at - shooting people?</p>\n<p>My unfinished masterpiece from 2008-2010, Gun Princess is a metroidvania with <strong>broken english</strong>, game-breaking bugs, terrible music, physics that were intended to run on 24 frames per second, far too many bosses that are huge leaps up on the difficulty curve, tons of story exposition early on, an user interface that requires writing a ten-page essay on the included separate PDF instruction booklet to wrap your head around it, <strong>floaty jumps</strong> that makes Cave Story feel like Ganondorf wearing Iron Boots, and very aged semi-retro pixel art with a color pallet from the fifth circle of hell.</p>\n<p>What it also has, though, is tons of content: 4 out of 12 planned endings using a complex branching path system, 450 game rooms to explore (with an average size of 8 screens), 42 different weapons (including fireballs, boomerangs, electric nunchakus, shotguns, a portal gun and a weapon that spawns giant, spiky flowers when it hits something). Power-up Bottles can be spent on any stat you please at a reduced efficiency, letting you invest points in ammo capacity or reload speed if you're confident enough to skip a bit of HP and XP upgrades.</p>\n<p>It also has a quirky story in the vein of the Mother (Earthbound) series, where you alternate between resisting the advances of a talking bat, fighting flying tomatoes and karate rabbits, exploring a giant abandoned aquarium, and pondering on whether eternal life is worth it when everyone you love die one by one.</p>\n<p>If you're feeling like playing a VERY old game - back from the days when Windows Vista wasn't even released yet - feel free to try out GP1, but be warned that it is not supported in any way and that there may be glitches around. Save whenever you can just in case.</p>\n<p><em>The faint impression of Diane's voice echoes throughout the chamber...</em></p>\n<p><em>\"I will remain, forever protected.\"</em></p>", "metacritic": null, "released": "2016-04-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e96/e9699f3b907099d6480191e8d8fc7ae6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yal"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}