{"id": 95917, "slug": "about-love-hate-the-other-ones", "name": "About Love, Hate & the other ones", "name_original": "About Love, Hate & the other ones", "description": "<p> is a puzzle game, in which you influence your surroundings by the force of Hate and the power of Love. <br/><br/>They shouldn't have pushed the button! Life on the hill was just perfect for Love and Hate before that shiny red device appeared. Suddenly, they are trapped in a dark and spooky cave, far away from home. <br/><br/>Now it is up to you to control the opposing forces of Love and Hate. They will soon meet a lot of Other Ones, wondering how they might react when Loved, or when Hated. Find a way through caves and ice, castles and factories, all by the might of your puzzling! If you ever return to that hill, life will be sweet again...</p>SET YOUR BRAIN CELLS ABLAZE<p>Master mind-bending puzzles and crack tricky riddles with a mix of Love, Hate and your analytical skills!</p>MY, ISN'T THIS PLEASANT<p>Those little personalities, as if taken right from a picture book, will warm your heart and bring joy to your vision!</p>SIX OTHER ONES<br/><p>Figure out how each Other One reacts to Loveʻs and Hateʻs attitudes towards life. Make use of your findings to return back home.</p>Hardware requirements<ul><li>Windows: XP or newer, 32 or 64 bit</li><li>Mac: OS X 10.6 (Snow Leopard) or newer</li><li>Linux: 32 or 64bit kernel with GLIBC 2.14 or newer</li><li>CPU with SSE2 support required (Core 2 Duo, Athlon X2 or newer). Core i3 or better recommended.</li><li>Memory: at least 1024 MB RAM, 2048 MB recommended.</li><li>OpenGL 2.1 compatible graphics card. Nvidia GeForce or AMD Radeon recommended.</li><li>600 MB available hard disk space</li></ul>", "metacritic": null, "released": "2016-03-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ce3/ce320051caaed767731f3159e0c5ded3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Black Pants Studio"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}