{"id": 959154, "slug": "the-town-watch", "name": "The Town Watch", "name_original": "The Town Watch", "description": "<p>Venture out to hunt a local nuisance, the Owl Bear.</p>\n<p>Harass the local spiders, gain experience, and restock at the local shop.</p>\n<p>But be aware that the night is dark and kind of unpleasant, so hold your torch and find that owl and or bear.<br/></p>\n\n<p>Full mouse &amp; keyboard and controller support <br/>Controls:</p>\n<p>move forward/ back (can be held): W / S or left stick forward / back</p>\n<p>turn: A/D or left stick left/right</p>\n<p>strafe: Q/E or right/left bumper</p>\n<p>attack/action: down key, a button, on screen A button</p>\n<p>torch toggle: right key, b button, or on screen B button<br/></p>\n<p>use ration(heal): up key, y button, or on screen Y button</p>\n<p>shoot gun(ranged attack): left key, x button, or on screen X button</p>\n<p>stat menu toggle: tab or start button<br/></p>\n\n<p>The inn is a free full heal, just be aware higher level enemies appear at noon through morning.</p>\n<p>Returning to town acts as a checkpoint and will remember your Hp, Exp, items, level, and money. So failing in the field is not a strict game over.</p>\n\n<p>Known bugs:</p>\n<p>Inputs are delayed due to the way turns are taken. There's no indication of when you can move again, but just assume button mashing will not work. Forward and backward movement is the exception and can be held and executing as soon as your turn returns<br/></p>\n<p>Removing any shortcut wall and returning to town will remove all shortcut walls on return, effectively opening a strait shot path to the boss.</p>\n<p> Using the on screen face buttons forces tab to cycle between them instead of opening the stat menu.  Buttons behave as normal.</p>\n<p>When the torch counter runs out the torch sprite disappears <br/></p>", "metacritic": null, "released": "2023-04-08", "tba": false, "updated": "2023-04-17T23:05:49", "background_image": "https://media.rawg.io/media/screenshots/36f/36f597c9867175d742aacc14910804b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 274, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["QuishyTehQusih"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}