{"id": 959281, "slug": "im-scared", "name": "I'm Scared", "name_original": "I'm Scared", "description": "<em>TW:  discriminatory language, mention of hate crimes and violence, suicide, anti-trans legislation.</em>\n\r\nHow to Play:\r\n<ul><li>Arrow keys or ASWD for movement. </li><li>Run into something to interact.</li></ul>\r\nSummary: \r\n<p>This game highlights the discriminatory anti-trans bills that are either being passed or have been proposed and how those bills are or will harm the trans community. Interact with the environment and the people in it to explore the situation.</p>\r\nManifesto:\r\n<p>Over the past year, there have been several anti-trans bills proposed. Several of them have passed at this point in southern and conservative states. Most of them aim to cut support for if not outright ban trans healthcare. As a trans person from Texas, this scares me. I am scared for myself and for my fellow trans brothers and sister in states like Texas who are having their rights infringed upon. This article from <em>Them</em> is only one of many on this subject. </p>\n<p>This game places the player in front of a house of representatives where voting on anti-trans bills is being held. In interacting with the protestors outside the building, the politicians inside of it, the people in the surrounding area, and items in the environment, the player can see how much damage bills like these will do to trans people and how the reasoning being used to support them is not in good faith. I use cycling dialogs and have several items, sprites, etc. giving this dialog so that the dialog is spread out throughout the map. Having the dialog spread out allows the player to find each piece of information as they explore. Utilizing cycle dialogs also allowed me to have several items/sprites use one dialog object that had a lot of entries allowing me to quickly edit the dialog of all of them.  To create a sense of space and of this game being centered around the house of representatives (physically and metaphorically), the physical building itself spills into every room, be it the sides or the statue on the roof. Because this situation doesn’t have a clear ending, I opt to have a soft ending with a closing statement rather than a definitive one. </p>\n\r\nHow You Can Help:\r\n<p>If you are able, please donate to organizations fighting against this like:<br/></p>\n<ul><li>Transgender Education Network or Texas: https://www.transtexas.org/\r\n</li></ul>\n<ul><li>American Civil Liberties Union: https://www.aclu.org/\r\n</li></ul>\n<p>Support clinics offering gender-affirming care, like the Kind Clinic in Texas (https://kindclinic.org/) in your area.\r\n</p>\n\r\nSources:\r\n<ul><li>3+ colors in bitsy: https://aurysystem.itch.io/multicolorbisty\r\n</li><li>Stories from: https://transequality.org/sites/default/files/docs/resources/TDOR%20Remembrance%20Report%20by%20NCTE_Nov%202022%20%281%29.pdf \r\n</li><li>Other stories from various Them articles: https://www.them.us/search?q=TRANS&amp;sort=score+desc \r\n</li><li>Bill statistics from: https://www.aclu.org/legislative-attacks-on-lgbtq-rights \r\n</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2023-04-18T00:02:16", "background_image": "https://media.rawg.io/media/screenshots/f0a/f0a4d36e07f7dd5b0438d26b976c5e4a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Ciarenn Hollis"], "genres": [], "publishers": [], "esrb_rating": null}