{"id": 959255, "slug": "fantastic-funghi", "name": "fantastic Funghi", "name_original": "fantastic Funghi", "description": "Experience mushroom growing on your PC like never before!\r\n\r\n<p>Fantastic Funghi is an application that allows you to observe and appreciate the diverse world of mushrooms as they grow. <br/></p>\n\n<p>You can explore a multitude of fascinating shapes, sizes, and colors of these charming fungi that thrive directly on your taskbar. While remaining productive, you can marvel at the beauty of these mushrooms growing before your eyes. <br/></p>\n<p>You can watch them vanish with a satisfying pop or plop to make room for new and exciting mushrooms at any time. <br/></p>\n\n<p>By installing Fantastic Funghi on your PC, you can add some vibrant colors to your workday.</p>\n\n\r\nFeatures:\r\n  \r\n<ul><li>in total over 100 different mushrooms and animations.\r\n</li><li>3 different colors are available for choice.\r\n</li><li>Everything is controlled by random:<ul><li>The  serendipitous placement of mushrooms along the taskbar, adding an   element of unpredictability and fun to the cultivation process.\r\n</li><li>Each mushroom is endowed with its own unique growth rate, generated at random by the software's advanced algorithm.\r\n</li><li>To  ensure a diverse and dynamic ecosystem of mushrooms, the software   employs a sophisticated randomization mechanism to determine the   lifespan of each organism.\r\n</li><li>All boundary conditions can be made via the settings menu.\r\n</li></ul>\n</li></ul>\n<p>\n</p>\n\n\r\n\r\nSystem requirements:\r\n  \r\n<ul><li>CPU /GPU = Yes\r\n</li><li>RAM = 500Mb\r\n</li><li>HDD = 200Mb\r\n</li><li>Display = FHD recommended\r\n</li></ul>\n<p>\n</p>", "metacritic": null, "released": null, "tba": false, "updated": "2023-04-17T23:49:01", "background_image": "https://media.rawg.io/media/screenshots/dca/dcab68b75f75c7f084445802621ea7e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["computer-knopf"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}