{"id": 959263, "slug": "netmaze", "name": "netMaze", "name_original": "netMaze", "description": "<p><strong>THE AWARD-WINNING GAME IS NOW AVAILABLE FOR EVERYONE!</strong></p>\r\n\r\nA new age of online fun is here!\r\n\n<p>netMaze allows you and up to 15 other players to explore different parts of Cyberspace together through the high-octane competitive Brawl mode or the creative Sandbox mode.<br/></p>\n<p>Take the maze by storm or build out your own virtual world using your very own Funnyman, a digital avatar that you can customize to your liking with different colors, weapons, and more!</p>\n\r\nBrawl\r\n<p>In netMaze Brawl, Funnymen from all over the World Wide Web gather and duke it out with whatever they can get their hands on! From weaponized pencil sharpeners to waffle-blasting toasters, and even their own hand as a finger gun! Choose from a variety of specially-designed maps and do your best before the timer runs out! Damage dealt adds to your netPower and <strong>the Funnyman who has the highest netPower is deemed the \"Funniest Netizen\".</strong> </p>\r\nSandbox\r\n<p>Rather deal with creative power instead of netPower? netMaze Sandbox lets you let your imagination run free with customizable worlds and unique gameplay mechanics not seen in Brawl. You can visit Funny City - the \"heart of the Net\" - and partake in a variety of activities and landmarks within it.  Have something cool in mind? You can create any structure you can think of in Funny City with the <strong>variety of different items within Build Mode</strong>; or start with a completely empty space in The Void. You can also save your creations in the menu and continue building and socializing into the future!</p>\n\n<p><em>Hear what our current playerbase loves about the game!</em><br/></p>\r\n[Our lawyer (some smart internet forum guy) has advised us to redact this part due to the illegality of faking customer testimonials. Don't use deceptive advertising, kids!]\r\n\n<p><strong>Log on to netMaze on April 6th and see what Cyberspace holds for you!</strong></p>", "metacritic": null, "released": null, "tba": false, "updated": "2023-04-17T23:53:22", "background_image": "https://media.rawg.io/media/screenshots/2b1/2b1f5981388935a2a9fa7db2d8e2a038.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Netware Interactive"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}