{"id": 959373, "slug": "a-dream-about-a-room-with-four-doors", "name": "A Dream About a Room With Four Doors", "name_original": "A Dream About a Room With Four Doors", "description": "<p>Ever wanted to be trapped in a recurring nightmare? Sure, we all do! Now here's your chance to plunge into a malevolent DrEaMScApE, and to try to find your way out. <br/>A Dream About a Room With 4 Doors puts you in the pajamas of a tormented soul who can't wake up until overcoming the challenges of their own nightmare. Something in the dream-realm wants to keep the sleeper asleep <em>forever </em>-- but now another force has arrived to help find a way out!<br/></p>\n<p>This game will be evolving over time, with new puzzles and challenges in future updates. Your support will help me have the time and resources to continue development. </p>\n<p><strong>CONTROLS:</strong></p>\n<p>WSAD - movement</p>\n<p>MOUSE - to look around<br/></p>\n<p>E - Interact with close highlighted objects (such as doorknobs)</p>\n<p>SPACE - jump</p>\n<p>ESC - Pause settings</p>\n<p><strong>SYSTEM REQUIREMENTS:<br/></strong></p>\n<p>Windows 64-bit</p>\n<p>Post 2016 GPU, Windows 7+ for best performance (Windows 10+ for super-best performance).<br/></p>\n<p>This game is primarily designed for a resolution of 1920x1080 or 2560x1440. It will attempt to match your resolution, but image and UI will suffer if the resolution is too low.</p>\n<p><strong>Be aware there are some flashing lights in this game!</strong><br/></p>\n<p>This game was made with Godot 4, an amazing game engine. As I learn more and the engine continues to improve, I will be polishing up and adding to this game accordingly! <br/></p>\n<p>If you would like to send me a personal tip on Ko-fi, thank you generous soul, here is the link:\r\n    </p>\n<p>https://ko-fi.com/mikeyh\r\n</p>", "metacritic": null, "released": null, "tba": false, "updated": "2023-04-18T00:52:27", "background_image": "https://media.rawg.io/media/screenshots/a1c/a1c319cef600d1cec5bd44f3c2947ccc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Matzerath"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}