{"id": 959309, "slug": "archimedes-shield", "name": "Archimedes' Shield", "name_original": "Archimedes' Shield", "description": "<p><em>\"We can easily forgive a child who is afraid of the dark; </em><em>the real tragedy is when men are afraid of the light.\"</em><br/><em> - Plato</em></p>\n<p><em><strong>Archimedes' Shield </strong></em>is a 7 day game jam project where you play with light to solve puzzles. This game follows the optional theme <em>The Dark Side</em> of Week Sauce (March 2023). <br/></p>\n<p>Although <em>Week Sauce</em> put very little to no restrictions on what you can do, this project is done with <em>no engine</em> and <em>no assets</em> (unless you count me hardcoding levels as assets). <br/></p>\n<p>Day 7 has been reached and the game is ready! For the original updates from day 1, continue reading... or just download it already.<br/></p>\n<p><strong>DAY 1</strong> (14 % done)<br/><em>A light bulb was lit</em> - the idea was born: <em>A level based single player real time puzzle game where you play with light and reflections to progress.</em> After finishing the very basic horizontal character movement, the rest of the day was spent doing the math to detect where light hits an edge.</p>\n<p><strong>DAY 2</strong> (29 % done)<br/><em>Let there be light!</em> After debugging the light calculations I got some very basic rendering of the lit areas. The shield also got implemented (oh and btw, Archimedes' shield reflects light) and a single light bounce partially implemented.<br/></p>\n<p><strong>DAY 3</strong> (43 % done)<br/><em>Look out for the apple!</em> Third day adds proper physics for the playable character. Shield reflection is now functional and some blocks can be destroyed when hit with light. Light calculation is still quite buggy but the game is playable with two levels.</p>\n<p><strong>DAY 4</strong> (57 % done)<br/><em>This room is green.</em> A new block. Previous block was sensitive to light - this one is sensitive to darkness. Also eight new levels have been added - adding content is the main focus at this time as the 50 % marker has already been passed.</p>\n<p><strong>DAY 5</strong> (71 % done)<br/><em>This room is green... and red and blue. </em>A new block has been added, glass. Let's you stand on it, and let's light pass through. Level count is now 19.</p>\n<p><strong>DAY 6</strong> (86 % done)<br/><em>Greeting executor. </em>With only two days left, bug fixing was in order. All game breaking bugs (and highly annoying ones) are now fixed. Also the last level (level 20) was added. So why not release the game already? Yea... So, there's a download link now, gl&amp;hf</p>\n<p><strong>DAY 7</strong> (100 % done)<br/><em>Job's done!</em> With little left to do most of the day was spent adding a main menu and tweaking a bit here and there. Also, made sure last level could be completed.<br/></p>\n<p>Have fun playing!<br/></p>", "metacritic": null, "released": null, "tba": false, "updated": "2023-04-18T00:18:12", "background_image": "https://media.rawg.io/media/screenshots/b0b/b0b228df44912bc53800bcb98b3b3f44.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GameLoom Studio"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}