{"id": 959364, "slug": "knakk", "name": "knakk", "name_original": "knakk", "description": "<p>Perfect your strategy and test your luck in knakk - the relaxed flip-and-write game that challenges you to master the art of card play and strategic slot-filling!</p><p>▶️ Play in your browser right now<br/></p><p>⚙️ Check out the source code to learn how it's made<br/></p>\n<p>💬 Join our discord channel to propose features, chat with other players and get news about the game</p>\n<p>🍎<strong> </strong><em>Running on Mac:</em> As an open source project, we don't have the funds for an Apple Developer Program membership. This means that the app  will be reported as \"damaged\". A workaround for this is described here.<br/></p>\n<p><strong>♠️ Pick a Suit and a Number</strong><br/></p>\n<p>Each turn, you pick two cards. The first card sets the suit you play in, and the second card sets the number to fill a slot. Filling a slot will give you points or a bonus action, which can help you earn even more points.</p>\n<p><strong>🎰 Match the Slots</strong><br/>\n</p>\n<p>Each slot  has a constraint, meaning that you can only fill it with a card that matches a certain number. Different suits have different rules for which numbers are allowed. For example, each number played in the clubs suit needs to be higher than the one you played before.</p>\n\n<p><strong>💥 Create Clever Combos</strong><br/></p>\n<p>Using bonuses can give you an advantage. For example, you can replace a card you don't like with a new one from the deck. With a clone bonus, you can play the same hand twice in the same turn.</p>\n<p><strong>🏆 Flip to the Top</strong><br/></p>\n<p>After five turns, a new round begins. After three rounds, the game is over. Make sure to fill the right slots with your cards and use your bonuses wisely to maximize your score and become the ultimate knakk champion.<br/></p>", "metacritic": null, "released": null, "tba": false, "updated": "2023-04-18T00:47:20", "background_image": "https://media.rawg.io/media/screenshots/159/15901706c324855a07e071996bc0263a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "Linux", "macOS", "PC"], "developers": ["raffomania"], "genres": [], "publishers": [], "esrb_rating": null}