{"id": 959439, "slug": "group22crownedcontrol", "name": "[Group22]CrownedControl", "name_original": "[Group22]CrownedControl", "description": "Welcome to Crowned Control!\r\n<p>This is a small game made for the class Game Projects by a group of students at <strong>Digital Arts and Entertainment</strong>, but if you've found us, you probably knew that already.</p>\n\r\nThe Game\r\n<p><strong>Crowned Control</strong> is a game about a group of knights, lured into an old dungeon by tales of legend. According to the stories, there's a legendary crown in there that grants ghostly powers to the one wearing it!</p>\n<p>Of course, every knight wants that crown for themself! Acquiring it will require teamwork, however.  They'll need to work together to get the crown off of the current wearer's head, and onto their own!<br/>This sudden, but inevitable betrayal then starts the whole loop again, with their former allies chasing this new wielder for the very same reason.</p>\n<p>Our knights are armed with their trusty sword, shining armor and whatever artifacts (or rubbish) they can scavenge from within the dungeon. Hit each other with swords, spill oil to slow the others down or taste some exquisite cuisine in the fine peppers of the underground, to give yourself a speed boost.</p>\n<p>Other than legendary artifacts, this dungeon also houses a myriad of traps. Our knights can choose to expertly avoid these, or cunningly use them against the one wearing the crown (or their friends, of course).</p>\n<p>At the end of the day, all that matters is who gets to wear the crown the longest, so employ whatever tactics you need to make sure that person is you!</p>\n\r\nThe Controls\r\n\r\n<br/>\r\nThe Team\r\nArtists:\r\n<ul><li>Abdullah Serbest</li><li>Quentin Dejaeghere</li><li>Dayell de Graaf</li></ul>\r\nProgrammers:\r\n<ul><li>Joren Dresselaers</li></ul>\r\nSound Designers:\r\n<ul><li>Gilduin Stevens</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2023-04-18T01:22:03", "background_image": "https://media.rawg.io/media/screenshots/e9f/e9f8552a533396629bfe30943a1c1aff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Joren Dresslaers", "Mortepoule", "dayellcolin", "gsteven", "Aserbest"], "genres": ["Action"], "publishers": [], "esrb_rating": null}