{"id": 959431, "slug": "the-girl-who-kicked-a-rabbit", "name": "The Girl Who Kicked a Rabbit (itch)", "name_original": "The Girl Who Kicked a Rabbit (itch)", "description": "<p>By takunomi<br/></p>\n<p>An ethereal, pulp spraying, contemplative stroll from one end of a city to the other.</p>\n<p>As the little combat wizard Lumi, you'll use the \"Arcana\" to fight a geyser of cute, and clever spirit bunnies.</p>\n<p>\n</p>\n<p><em>\"Lumi dabbles in the mystical arts: The knowledge of Arcana.\"</em>\n</p>\n<p><em>\"Like so many others, she patrols the city at night, fighting the ghostly rabbit monsters.\"\r\n</em></p>\n<p><em>\"Tonight is just like any other.\"</em></p>\n<p><em>\"Although.... there sure are a lot of rabbits.\"</em>\n</p>\n\n\n<p>Combat in \"The Girl Who Kicked a Rabbit\" is designed as an easy-going experience, with a whole basket of meticulously crafted mechanics to fiddle around with.\r\n</p>\n<p>Every element of the game is engineered to react in the fastest, most responsive way.\r\n</p>\n\n\n<p>Selecting one of your astral weapons and obliterating a long-eared bugger, is an interface delight. The bunnies will hold \"Catalysts\", that you'll need in order to win.\r\n</p>\n<p>Understanding which of these otherworldly baubles you need, and actually getting them before they disappear, will be half the battle.\r\n</p>\n\n\n<p>No reason to get all tricked out before the next hand-to-hand: Every battle gives you a different collection of mystical \"Arcana\" to wield. Some of them are good to go, and others you have to unlock on the job.\r\n</p>\n<p>Good thing every critter killed is a piñata of goo-covered treasure.\r\n</p>\n\n\n<p>Murdering doe-eyed bunny beasts isn't enough to win! Somehow, you'll need to get enough \"Gods' Wine\" to close the flaming portals that keep sending out more opponents.</p>\n<p>Sometimes the rabbits will drop this celestial nectar, and sometimes a more economic approach is required.\r\n</p>\n<p>If you've got a little chemist inside you somewhere, perhaps you'd prefer making your own divine kombucha.\r\n</p>\n\n<p>It runs on Windows and MacOS (and Debian soon!)</p>", "metacritic": null, "released": null, "tba": false, "updated": "2023-04-18T01:18:18", "background_image": "https://media.rawg.io/media/screenshots/d0f/d0f8dc4b74447a84efd7557d6a028899.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Jmaa", "takunomi"], "genres": ["RPG", "Puzzle"], "publishers": [], "esrb_rating": null}