{"id": 959584, "slug": "ricochet-ronin", "name": "Ricochet Ronin", "name_original": "Ricochet Ronin", "description": "<p>Inspired by Feudal Japan and the Wild West, the world of Ricochet Ronin features lush forests surrounded by sweeping deserts. Sometimes tumbleweeds make their way through the masses of sakura and ginkgo trees around the village. The resources of the desert and the resources of the forest are equally important to the villagers who make cactus fruit pies and dry ginkgo leaves to hang on the wall.</p>\n<p>Well camouflaged under the canopy of trees against the backdrop of thick patches of tree trunks, the Bandit Hideout at first appears unassuming. You may first see a stone wall before your eyes follow it upward to the spires at the top and you realize your mistake. A foreboding fortress, once you get this close it is already too late. At the center of the winding maze of stone halls and cells sits a guarded room with walls thicker than the rest. Here resides the leader, and housed with him are the many priceless artifacts stolen by the clan.\r\n</p>\n<p>\n</p>\n<p>Use the art of Yadomejutsu and retrieve the Omnijin.<br/></p>\n\n\n\n<p>After leaving the clan, the Ronin swore off violence. Traverse Ricochet Ronin's unique spin on the bullet hell genre using the art of Yadomejustu. With the remaining bits of his sword, the Ronin can strategically reflect enemy projectiles. </p>\n\n\n<p>Make use of the Ronin Wushu training, which gives him above average acrobatic ability, and mobility on the field.  Equipped with climbing spikes on his knuckles, knees, and feet, the Ronin can grip walls and propel himself off them with impressive agility.  <br/></p>\n\n<br/>\n<p>By digging his climbing spikes into the ground, and leveraging a large push, the ronin is able to close gaps and cover considerable amounts of distance in just seconds. Use this in combination with his other abilities,  to traverse the bullet hell like a lightning bolt.</p>\n\n\n<p>The Jins were an ancient order of Gods, wielding the powers of Earth, Fire, Wind, Water, Lightning, and more. Forged from their powers, the Omnijin, a powerful ring-like artifact was created.  Use the Omnijin when the bullets get overwhelming. This special ability gives you a temporary ring of reflection.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2023-04-18T02:18:12", "background_image": "https://media.rawg.io/media/screenshots/330/330e617085ea49879aff68077bfe39dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Team Ronin"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}