{"id": 959505, "slug": "alone-once-again", "name": "Alone Once Again", "name_original": "Alone Once Again", "description": "<p>Violet is a high school senior on the precipice of graduation. Having had an unstable childhood, she has grown dependent on her friends and parents for emotional support. However, now she has college to contend with, and the unfamiliarity that will bring. New location, no friends. As she walks home from school, she ruminates on how she’ll contend with these new changes, when suddenly, the world shifts, and she finds herself in an empty world devoid of life (seemingly). With ruined neighborhoods, abandoned buildings, and desolate parks as far as the eye can see, Violet begins to feel the horror of loneliness. Striving to escape being alone once again, she makes her way through this Abysmal world. But is she really alone?</p>\n<p>This is a 2D side-scroller where Violet (the protagonist) has to traverse the terrain of the ruined world while avoiding traps that may damage her health. The end goal is to reach the end of the map. Along her way, Violet can find items that either connect to the backstory of the world or serve a purpose in the field, be it for health recovery, enemy confrontation, or to aid in the traversal of the terrain.</p>\n<p><strong>Sanity</strong><br/></p>\n<p>The sanity of Violet slowly decrease over time. The player has to move fast in order to reach the end of the map without losing all of Violet sanity points.</p>\n<p><strong>Items</strong></p>\n<p>Throughout the map there are some items that relate to Violet's past. To understand who she is and where she is at, the player must follow them and see how they evoke certain moments from her life. The items can also be used as tools to destroy obstacles and reach difficult areas.</p>\n<p><strong>Authors:</strong></p>\n<ul><li>Jonas Costa\r\n</li><li>Gabriel Preciado\r\n</li><li>Juan Rios De La Rosa\r\n</li><li>Soulai Vang\r\n</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2023-04-18T01:44:28", "background_image": "https://media.rawg.io/media/screenshots/162/16218a7a021e8a496f1b319b48da0ceb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Meltlith"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}