{"id": 959658, "slug": "devils-night-party", "name": "Devils' Night Party", "name_original": "Devils' Night Party", "description": "<h3>◆Features</h3><br/>◇The HCGs range from being penetrated by humans and orcs to being violated by tentacles, plants and fleshy tails.<br/>◇Battle scenes will gradually change according to the enemy's attacks<br/>◇The main character, Natsuno Yamazakura (V.A.: Izumi Mikoshiba), is fully voiced during the battle! <br/>◇Easy to use system including fast forward animation<br/><br/><h3>◆Game Description</h3><br/>This is a typical RPG where you can level up, save money and buy new equipment. The system is very simple. You can use recovery items directly from the item bar on the map…etc.<br/>The enemies are stronger, and the game requires less fighting because the main enjoyment is the sex scenes when you lose.  <br/><br/>The game is designed to be very friendly, with enemies in a basic touch-and-fight mode, so you must touch them to start a fight, or you can avoid them carefully.  <br/>However, if you start a fight accidentally, there is a high chance that you will lose…And you will watch the great sex scenes!  <br/><br/>In battle, the target is constantly being sexually harassed and exhibits different stances.<br/>As the pleasure level increases with sex attacks, the damage taken increases and your HP drops more easily.<br/> <br/>When your HP hits 0, you will be penetrated and creampied, but your HP and NP will be restored.  <br/>The game will end when your womb is full of semen. <br/><br/>Come and enjoy a great battle show!<br/><br/><h3>◆Operation Instructions</h3><br/>◇Basic Operation:<br/>Arrows and character movement (can be diagonal): arrow keys, left click, WASD keys.<br/>Decision: Z key, Enter key, left click, space bar.<br/>Cancel: X key, right click.<br/><br/>◇Map:<br/>Display menus and status: X key or right click in the map scenes.<br/>You can also adjust the volume and select the difficulty level from the menu options.<br/><br/>You can use the crystals in the village and dungeon to set the sex scenes in battle and other related settings.<br/><br/>◇Story fast forward: Enter key, left click and hold.<br/><br/>◇Using items on the map:<br/>The order of the item icons displayed at the bottom left of the screen corresponds to the order of the numeric keys above the text keys, so you can use the items directly by clicking on the numeric keys.<br/>You can also use these items directly by clicking on them with your mouse.<br/><br/>If you are using the numeric keypad to move your character, please use the 2468 keys.<br/><br/>◇Conversation:<br/>To hide or show the conversation window: During a conversation, press the shift key or right-click.<br/>Please note that if you hide the window, the conversation will not continue until you click the conversation window open again. <br/><br/>Dialogue fast forward: Press and hold the Enter key, left click.<br/>Dialogue super fast forward: PageDown<br/><br/><br/><br/>◇Battle scenes:<br/>If you cancel immediately after entering a battle, you will get the enemy's icon and the escape button.<br/>To return to the battle, select 'Battle' at the top.<br/><br/>◇Select an attack target:<br/>Instead of selecting an enemy by clicking directly with the mouse, select the enemy's name displayed in the bottom left corner.<br/>Fast forward: During battle, press shift or click on the note symbol in the top left corner to fast forward the animation.<br/><br/>", "metacritic": null, "released": "2023-04-18", "tba": false, "updated": "2023-04-21T03:24:08", "background_image": "https://media.rawg.io/media/screenshots/298/298b9d849418eb6e4eacc457dcae2fbc.jpg", "website": "https://www.facebook.com/playmeowGame", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 464, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NAGATOUI"], "genres": ["Adventure", "RPG", "Simulation"], "publishers": ["Playmeow"], "esrb_rating": null}