{"id": 959664, "slug": "haunted-heye-apartment", "name": "Haunted Heye Apartment", "name_original": "Haunted Heye Apartment", "description": "<strong>Game Type</strong><br/><br/>Suspense Horror Adventure Visual Novel<br/><br/><strong>Story Synopsis</strong><br/><br/>Fresh out of college and with a tight budget, [you] moved into the [Heye Apartment], which had an unusually low rent. In the apartment, [you] met [Lin Ya], the cold and aloof girl next door. Through spending time with her, [you] discovered her sincere and passionate nature that belied her outward appearance.<br/><br/>However, as [your] feelings for her grew, [you] also gradually discovered that the apartment was anything but ordinary. Strange mourning rituals, rumors from years ago, strange occurrences in the rooms, and unseen \"neighbors\"... the seemingly mundane life was actually fraught with danger.<br/><br/>As tenants began to die one after another, the conspiracy hidden in the darkness gradually emerged... When the trumpet of death sounds, can [you] uncover the truth and find a glimmer of hope?<br/><br/><strong>Character Introduction</strong><br/><br/>[Jiang Xing]/[You] <br/>The protagonist of the story, a recent graduate who works as an office worker, is calm, rational, and occasionally sarcastic.<br/><br/><br/>[Lin Ya]  <br/>A pastry chef who works at a dessert shop. Though she appears cold and distant, she is actually just slow to warm up and doesn't know how to interact with people. Online chatting and in-person interactions are two completely different experiences for her.<br/><br/><br/>[Lu Shen] <br/>A person who likes to spray perfume and unconsciously behaves in a way that leans towards women. He has an outgoing personality and always wears a cheerful smile on his face, seeming to get along well with everyone.<br/><br/><br/>[Cao Ke]<br/>An unemployed wanderer who frequently drinks heavily and has a bad temper. He is only friendly towards children.<br/><br/><br/>[Ding Mianle] <br/>A complete thug who is lazy and often resorts to petty theft. He bullies the weak and fears the strong, making him a despicable character.<br/><br/><br/>[...]<br/><br/><strong>Game Features</strong><br/><br/>Plenty of storylines   <br/>A dozen characters are interspersed in the story, each with their own characteristics and different personalities, allowing you to feel the emotions of different characters and the background of the story.<br/><br/>Horror and Suspense  <br/>Layer upon layer of psychological horror, you will explore an environment full of horror and suspense and uncover the secrets hidden behind the story.<br/><br/>Variety of endings  <br/>Multiple endings are waiting for you to explore and experience different life episodes.", "metacritic": null, "released": "2023-04-18", "tba": false, "updated": "2023-04-21T03:32:57", "background_image": "https://media.rawg.io/media/screenshots/e55/e558276a676011a35bb787027eeaa248.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["V.N GAME STUDIO"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["V.N GAME STUDIO"], "esrb_rating": null}