{"id": 959643, "slug": "swirl-wtch", "name": "Swirl W@tch", "name_original": "Swirl W@tch", "description": "<strong>Context</strong><br/>Swirl W@tch takes stealth infiltration to a fresh new setting. In the dense atmosphere of Cloud 2, ships can only detect each other by laser light or by listening to engine noises and sonar echoes. The perfect environment for sneaking past security and sabotaging cloud-refineries, as a desperate final attempt to bring down your corporate oppressors.<br/><br/><br/><strong>Action</strong><br/>Play with your prey as you and the guards slip in and out of stealth. Tail ships, intercept communications, set traps and ambush unsuspecting vessels with precision strikes. Or incapacitate and board them to gain intel, funds and captives, to be exchange for new Swirl W@tch members. Counter and exploit complex guard behaviors, all generously telegraphed by your ships predictive tactics AI. Complete different objectives across multiple zones, but always watch your noise circles and lidar profile. Unlike you, CorPo doesn’t take prisoners.<br/><br/><br/><strong>Devices</strong><br/>Gain public support on Cloud 2 by capturing crews and freeing their servants from “mandatory internships” (indentured servitude). Grow the Swirl W@tch movement to unlock new weapons, gadgets, upgrades and ships. Spend your deployment budget on custom loadouts that can include any of the 100+ items you have available, or go in with less equipment and raid production facilities for cheaper, random gear.<br/>", "metacritic": null, "released": "2023-04-17", "tba": false, "updated": "2023-04-21T03:04:51", "background_image": "https://media.rawg.io/media/screenshots/fd4/fd451fdfbd6df32e643cc6655dbd93a0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Sleeper Games"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["Sleeper Games"], "esrb_rating": null}