{"id": 959699, "slug": "royal-jigsaw-4", "name": "Royal Jigsaw 4", "name_original": "Royal Jigsaw 4", "description": "10 centuries of history, the luxury interiors of ancient houses, and the most famous castles in the world in the new Royal Jigsaw 4!<br/>\n<br/>\r\n1000 images! Each image is still in high quality. The gameplay is still well designed. Useful tools and hints are still helpful. Optional game difficulty control makes your gameplay more interesting and comfortable. Special achievements and trophies give experts more fun! Save your progress and continue the game at any time! Choose your own settings for each puzzle, and play infinite!<br/>\n<br/>\r\nFive themed packages: castles of the world, interiors, antiques, costumes and day-to-day life, and fantasy. A real royal atmosphere, luxury decoration, beautiful landscapes, famous antiques, vintage jewelry and magnificent castles of all time... All the best for true king!<br/>\n<br/>\r\n- 1000 high quality unique images<br/>\r\n- well designed game-play: useful hints, sort tool and magnifying glass.<br/>\r\n- optional game difficulty control makes your gameplay infinite<br/>\r\n- custom styles of pieces with rotation<br/>\r\n- save game progress and continue to collect the puzzle at any time<br/>\r\n- tasks and colorful trophies for those who love excitement<br/>\r\n- ambient, relaxing sound<br/>\r\n- awesome royal art style<br/>\r\n- get 1000 puzzles for one purchase. It is beneficial!", "metacritic": null, "released": "2023-04-19", "tba": false, "updated": "2023-04-21T04:22:02", "background_image": "https://media.rawg.io/media/screenshots/a2a/a2a79e2f8477e4dfedd730a6576b5fdf.jpg", "website": "https://www.facebook.com/8FloorGames/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["8Floor"], "genres": ["Casual"], "publishers": ["8Floor"], "esrb_rating": null}