{"id": 959686, "slug": "24-solar-terms", "name": "24 Solar Terms", "name_original": "24 Solar Terms", "description": "<h3>Introduction</h3>24 Solar Terms is a seek and find puzzle game based on the traditional Chinese twenty-four solar terms. Our game connects the climate and farming of solar terms through farming proverbs, myths and fables. Use sharp eyes and quick wit to help local farmers solve various problems. You will be guided through your journey with proverbial prompts and cultural clues. Let's experience the story of 24 solar terms together! (China is huge and has many vast ethnic groups, the content of this game is limited. The inspiration of the puzzles only comes from some areas and ethnic groups.)<h3>Features</h3><br/><br/><ul><li>Use traditional agricultural proverbs, and principles of farming and climate to solve puzzles. Discover the tranquility and calm of Chinese farming life through a gentle learning experience.</li></ul><br/><br/><ul><li>Observe and find out what the farmers need. When you are stuck, try to think outside of the box - 24 Solar Terms rewards creativity.</li></ul><br/><br/><ul><li>As you solve puzzles, see the world around you change. Enjoy subtle references to traditional Chinese myths as your actions affect the lives of your people.</li></ul><br/><br/><ul><li>Play mini games to relax your mind and eyes. Moreover, hidden objects and side quests are waiting for you. Don’t miss them!</li></ul><br/><br/><ul><li>Our illustration shows the changing of the four seasons in detail. Find relaxation in our small, peaceful villages, and their gentle passage of time.</li></ul>", "metacritic": null, "released": "2023-04-19", "tba": false, "updated": "2023-04-21T04:05:08", "background_image": "https://media.rawg.io/media/screenshots/3d6/3d6d8c17a7c0446936db99886a648ef4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 411, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["闲者拾光"], "genres": ["Indie"], "publishers": ["Gamera Games"], "esrb_rating": null}