{"id": 959632, "slug": "picma-picture-enigmas", "name": "Picma - Picture Enigmas", "name_original": "Picma - Picture Enigmas", "description": "Uncover hidden pictures using your logic skills. With a library of over 100,000 community-created puzzles, distributed across multiple puzzle types, you are unlikely to run out of challenges. So, have a seat at the Moonberry Café, let Charlotte bring you a cup of your favorite drink, and relax as you sip and solve through Picma - Picture Enigmas.<h3>Main Features</h3><ul><li><strong>Much more than Nonograms</strong> - Find your favorite picture logic game from our selection of three puzzle types (more coming soon).<br/></li><li><strong>Quality despite quantity</strong> - Our user content is curated by the community and only a fraction of the submitted images become puzzles.<br/></li><li><strong>True logic puzzles</strong> - All of our puzzles are machine-verified to have a single logical solution.<br/></li><li><strong>Massive puzzles</strong> - Our puzzles range from the tiny 5x5 all the way to the gigantic 50x50.<br/></li><li><strong>True multi-color puzzles</strong> - What you solve is what you get, with up to 8 colors per puzzle.<br/></li><li><strong>Play for free daily</strong> - Create and rate images to earn Coins and play at no cost.</li></ul><h3>Picma Plus</h3><br/><strong>Use the numbers around the grid to discover a hidden picture!</strong><h3>Picma Squared</h3><br/><strong>Paint around each number to form a picture!</strong><h3>Picma Links</h3><br/><strong>Create paths between matching numbers to reveal a picture!</strong>", "metacritic": null, "released": "2023-04-17", "tba": false, "updated": "2023-04-21T02:49:10", "background_image": "https://media.rawg.io/media/screenshots/660/660f2ae6543b6a3cdd0fecc505a293ad.jpg", "website": "https://picture-enigmas.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Moonberry Arcade"], "genres": ["Casual", "Indie"], "publishers": ["Moonberry Arcade"], "esrb_rating": null}