{"id": 959703, "slug": "day-of-pixel", "name": "Day Of Pixel", "name_original": "Day Of Pixel", "description": "<strong>Your soul has been stolen!</strong><br/>El Diablo has tricked you, stolen your soul and is now requiring you to help him take over the world above!<br/>Fight and stomp your way through a pixel wild west/ day of the dead world taking on the forces of dead conquistadors and slimes with guns!<br/>It is up to you if the world will be saved or taken back into the days of darkness!<br/><br/><strong>Open world! </strong><br/>You can walk or horse your way through Mexico, Texas, New Mexico, Arizona and surrounding regions of Mexico! All set around the 1800's with day of the dead influence and great towns hand built and ready to be explored! From sprawling saloons to left behind mining towns find where you would like to call home! <br/>Gangs run certain territories and bandits are always on the look out for their next victim!<br/><br/><strong>Platformer!</strong> <br/>When you find yourself traveling to the underworld to fight hordes of undead and slimes with shotguns! It will transform from a open world pixel game to a sideview shoot em up platformer! Not just a platformer as it is a open world as well so if you choose to, go ahead and stay in the land of the unliving! your game your choice!<br/><br/><strong>Open Ended! </strong><br/>The opportunities are endless so why just stop and taking back your soul? Run a Cantina/Restaurant or set up a farm even go out and hunt bounties. Become a gang of your own and set out carving your territory from other gangs or make alcohol and try to get it across the border for even more profits! Poker tournaments pop up around the world that you can participate or just watch NPCs call each other out for cheating. Get caught cheating yourself and settle it at high noon in the middle of town. You can also watch NPCs get in disputes as well!<br/><br/><strong>Chocolate cow!?</strong><br/>Farming isn't just buy cow, feed cow and process cow. We have different animals in this universe, introducing the chocolate cow and strawberry cow!<br/>Yes we solved the age old problem why does the brown cow not give chocolate milk so stop there! We are also adding the strawberry cow and will give the proper milk and meat when you taken them to get serviced! Don't forget their will be wild animals to hunt down as well!<br/><br/><strong>Farming!</strong><br/>Farming is not a key need in the game but if you want to live out your fantasy of a working hard in the field tending to your crops and animals.<br/>On the other hand as a historic preference you will have to make cattle drives to towns that specialize in, Butchering, leather making, Animal services in general.<br/>That is perfect time to introduce Bob the Butcher, as your animals need butchering Bob will take them in his shack to take care of them out of sight and mind.<br/>If you prefer you can be a distiller and either be a booze peddler or use those stocks to run your cantina if you wish.<br/>There will be a full day and night system that will either help or hurt crops or certain production times.<br/><br/><strong>Empanadas! </strong><br/>Yes that is right Empanadas! no not a need to eat and drink every five minutes but featuring different sets of empanadas and other dishes from that region that will carry certain buffs to help on your travels. Choose to make chocolate milk from the chocolate cow and bring some Empanadas either spicy for cold protection or dessert empanadas for different buffs.<br/><br/><strong>Shoot Outs!</strong><br/>What is a western game without a shoot out or saloon brawl? Travel to different hand made towns experience the local \"culture\" or take on bandits while you just made a mass mining trip!", "metacritic": null, "released": "2023-04-19", "tba": false, "updated": "2023-04-21T04:26:59", "background_image": "https://media.rawg.io/media/screenshots/cc8/cc8f76e89db0af354784ee46a1d67fd1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AggressiveKiwi"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["AggressiveKiwi"], "esrb_rating": null}