{"id": 959722, "slug": "skader", "name": "Skader", "name_original": "Skader", "description": "Our Multiverse is collapsing, triggered by a catastrophic spacetime event. Many universes are already gone and just a handful left. Those who survived live in a constant universe incursion state and are about to collapse as well. There is an ancient artifact that can protect a single universe from collapsing and the multiverse sentinels, a pure energy intelligence without a body, decide to conduct an ultimate tournament. The winner will take the artifact home to save their universe. The sentinels pick the best warrior from each universe and invite them to the contest. <br/><br/>You represent one of these warriors, provided with a high-end skating device, a helmet, and a trail generator to compete. Each universe gives you a unique skill which distinguish you from the rest and gives advantage. The battle arena contains highly sophisticated features, power-ups, and the artifact. The player who holds it longer wins and takes the artifact home to decide their universe destiny.<h3>Game features</h3><ul><li> Unique ice-skating VR locomotion, easy to start but hard to master<br/></li><li> Singleplayer mode to play versus bots <br/></li><li> Multiplayer mode to play versus real players all over the world<br/></li><li> Voice chat during the game - use an open microphone to chat with other players in real-time to share your excitement<br/></li><li> Short sessions - long VR games can be tough, which is why you get the full experience even during short game sessions<br/></li><li> Trails, power-ups, weapons for dynamic gameplay<br/></li><li> Complete tutorial - learn controls and capabilities to get the most from your cyborg<br/></li><li> Every game gives you experience, virtual currency, and level-ups, and changes your position in the leaderboard, which is visible to all players</li></ul>", "metacritic": null, "released": "2023-04-20", "tba": false, "updated": "2023-04-21T04:53:26", "background_image": "https://media.rawg.io/media/screenshots/1cd/1cd313f2a345930de4ed4a26ccd38829.jpg", "website": "https://skader.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DreamTeam Mobile"], "genres": ["Action", "Sports", "Racing"], "publishers": ["DreamTeam Mobile"], "esrb_rating": null}