{"id": 959784, "slug": "toilet-rush-pee-master", "name": "Toilet Rush: Pee Master", "name_original": "Toilet Rush: Pee Master", "description": "Going to the toilet sometimes can be far more challenging than you expect. Fun draw puzzle game for everyone!<br/><br/>At least it's the situation of 2 cute kids.<br/>The poor little boy and girl are trying to go to the toilet as quickly as possible. Before it's too late, help them! Draw lines, slide to cut the land into bridges with different shapes or slice to dig, so that they can find the toilet in a rush <br/><br/>Can you guide them to the right path and find the toilet on time? Game on.<br/><br/>Playing \"Toilet Rush: Pee Master\", you will experience the feeling of rushing to pass each level, because the character you play will be cute cartoon characters who desperately need to go to the toilet but need to overcome different challenges.<br/><br/>\"Toilet Rush: Pee Master\" is a fun and challenging draw game. The mission is to guide your favorite characters to find the toilet. You have to overcome obstacles along the way. <br/><br/>Fun and addictive Toilet game:<br/>- Easy to Play: Draw to guide the character through the maze or to slice the land into bridges so that the cute characters can pee<br/>- Simple and Relaxing: Relax with simple gameplay. Try to pass more levels.<br/>- Cool skins to pick<br/>- Variety of levels: More than 100+ levels of increasing difficulty.<br/><br/>Play \"Toilet Rush: Pee Master\" now to help the couple go to the toilet quickly. Try to win this this entertaining &amp; simple puzzle game to relax and sharpen your brain!", "metacritic": null, "released": "2023-01-14", "tba": false, "updated": "2023-04-21T06:12:43", "background_image": "https://media.rawg.io/media/screenshots/e9b/e9b2f3540cc752f58be70da86428ff7f.jpg", "website": "https://adone.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ADONE PTE"], "genres": ["Casual", "Puzzle"], "publishers": ["ADONE PTE"], "esrb_rating": "Everyone 10+"}