{"id": 959717, "slug": "freedoms-twilight", "name": "Freedom's Twilight", "name_original": "Freedom's Twilight", "description": "<h3>Key Features:</h3><br/><strong>Exploration </strong><br/>Traverse through a beautifully atmospheric fantasy world that spans the most primitive and wild landscapes to an opulent and magical Victorian society.  Discover ancient secrets from deep within forests and forbidden knowledge hidden away in dark underground dungeons.  <br/><br/><br/><strong>Survival</strong><br/>Experience endless ways to make your way through this unforgiving world. What will your fate entail?  Will you be the one who lives off the land to survive living deep in the woods?  Will you be the one who finds themselves drunk in a tavern with only a few pieces of gold to their name?  Or will you be one of the few who will establish themselves as lords of their own land with vast farms and resources at their disposal? <br/><br/><br/><strong>Crafting</strong><br/>As you make your way through the foggy landscape of Amissus, you will find it necessary to craft various items to ensure your survival. Craft a wide range of supplies spanning across several categories including food, drink, weapons, tools, clothing, jewelry, medicine, potions, poisons, elixirs, magic scrolls, furniture, buildings, and many more...<br/><br/><br/><strong>Building</strong><br/>A weary traveler will need to find a safe place to settle down for the night.  Choose between erecting a premade structure or a custom built structure from the wide range of building supplies and complete buildings available.  Furnish your dwelling with craftable and collectable objects and items.    <br/><br/> <br/><strong>Farming</strong><br/>Interact with and forage over 200 different species of plants, trees, fungi, and otherworldly specimens.  Collect seeds and start your own farms and orchards.  Learn plants' unique characteristics, such as which plants are illuminant and which plants attract creatures.  Discover the effects different combinations of plants have on the environment.<br/><br/> <br/><strong>Pets </strong><br/>In the land of Amissus, pets come in various shapes, sizes, and species with various abilities.  Some pets may be more suitable for combat, while other pets may be more suitable for agriculture.  Some pets can dig up graves and various mounds, while others can be ridden over the terrain. <br/><br/><br/><strong>NPCS</strong><br/>Travelers will find the folks that inhabit this land tend to be gloomy and mysterious.  However, every so often a bright shining soul can be found. Will you attempt to befriend them, or will you journey through this world alone?<br/>", "metacritic": null, "released": "2023-04-19", "tba": false, "updated": "2023-04-21T04:47:22", "background_image": "https://media.rawg.io/media/screenshots/871/871c1b5f889dfc7c47b71aed70814df5.jpg", "website": "https://www.freedomstwilight.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 509, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kilian"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["KLH Studios"], "esrb_rating": null}