{"id": 959752, "slug": "factory-town-idle", "name": "Factory Town Idle", "name_original": "Factory Town Idle", "description": "Factory Town Idle is part town builder, part clicker, part idle game, and part management sim. It's great for people who like filling progress bars, optimizing supply chains, and maximizing all their numbers.<br/>\n<br/>\r\nStarting with nothing but some trees, you first chop some wood and build housing for some workers, who can then harvest resources for you. Use those resources to unlock new production buildings so you can craft your raw materials into better items, which can be sold for a profit. As towns grow they will need to cultivate their own crops and prospect for ores to keep your economy moving and your townspeople happily supplied with goods. <br/>\n<br/>\r\nOver time your town will grow bigger and bigger until you are managing a huge number of buildings, quests, recipes, research, and upgrades. With enough progress you'll be able to build additional towns in new biomes containing unique resources, and trade goods between them to maximize each region's specialties. Advanced steam-powered and even magical technology can be unlocked with enough research.<br/>\n<br/>\r\nThe game will not punish you for mistakes or cause your town to fail, so you take your time and play whenever you want for long or short sessions. Detailed feedback lets you know where the bottlenecks are so you can fix them and achieve maximum efficiency. And progress happens even when the game is closed, and your rewards will be waiting for you to collect the next time you visit. So sit back, relax, and enjoy your time in the world of Factory Town Idle.", "metacritic": null, "released": "2023-04-20", "tba": false, "updated": "2024-01-22T03:20:25", "background_image": "https://media.rawg.io/media/screenshots/44d/44daa56e8b9130fd7b80c51e3797d1c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "dropped": 1}, "playtime": 18, "achievements_count": 74, "ratings_count": 0, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["Erik Asmussen"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Erik Asmussen"], "esrb_rating": null}