{"id": 959737, "slug": "outer-terror", "name": "Outer Terror", "name_original": "Outer Terror", "description": "<strong>Outer Terror </strong>is a horde shooter where you hold out against massive quantities of otherworldly cosmic creatures. Assemble a ridiculous arsenal of weapons and blast apart seemingly endless waves of horrific creatures in this stylish roguelike that pays homage to the B-movies and Golden Age horror comics of the 80s and 90s. <br/><br/><strong>Don’t Die</strong> and stay alive for as long as you can while exploring overrun cities, attempting to assist the few survivors still around. Explore and survive in the varied settings of <strong>5 uniquely themed</strong> chapters featuring <strong>10 playable characters</strong> each with their own signature weapons forming an anthology of classic horror stories.<br/><br/>Each map is massive and through exploration players will discover other survivor hold outs and treasures. All cumulating with massive boss encounters, Elite Creatures from Beyond, ghouls, robots, and otherworldly abominations.<br/><br/><br/><strong><h3>Key Features</h3></strong><br/><strong>Battle, Loot and Explore</strong> - Discover other treasures and hidden items as you explore each massive map. This may lead to boss encounters and otherworldly abominations. <br/><br/><strong>Weapon Stacking</strong> - Each player will experience increasing difficulty as gameplay progresses, bringing the opportunity to upgrade and gain new weapons and powers. <br/><br/><strong>Co-Op Gameplay</strong> - Sit back and enjoy side by side expansive cooperative play!<br/><br/><strong>Unique Characters</strong> - Players can choose to play as one of the 10 survivors, each boasting unique weapons and skills that will help them in battle.  <br/><br/><strong>Nostalgic Art Style</strong> - Inspired by B-movies and classic comic books Outer Terror features art from renowned digital artist Joe Roman (Chito). <br/><br/><strong>Don’t Die!</strong> - Each volume of Outer Terror is packed with hordes of enemies set on ending your run, whether it be a vampiric polar bear, the mangled remains of a pet rabbit, or a pack of sentient toasters.<br/><br/>----------------------------------------------------------------<br/><br/>Developer <strong>Salt &amp; Pixel </strong>&amp; <strong>VoxPop Games</strong> present...<br/><br/>An enthralling anthology series of unearthed Cosmic Horror Comic Volumes spanning,<br/><br/><strong>Thrilling &amp; Chilling Tales of TERROR...</strong><br/><br/>Beginning with...Vol 1: \"<strong>REMNANT: BEYOND GRAY DEATH</strong>\"<br/><br/><br/><br/><strong>A cosmic evil known only as The Crying God has enveloped Earth's Moon. This eldritch Being has come to bring peace and justice to Earth. Those who have faith will be forever joined with it, and each other, for all eternity, in body and mind. Those who do not are turned into human meat fungus that must STRIVE to survive one more night...</strong><br/><br/><br/><br/>Enter Beyond the Gray Death!\"<br/><br/><br/><br/><br/><br/>FOLLOWED BY...Vol 2: \"<strong>DEATH CRAWL</strong>\"<br/><br/><br/><strong>A robotics company has created self-reproducing nanobots to combat climate change and help with everyday life. Unfortunately, the bots have become sentient, and the only information they have is aggregated from American social media postings. Now they enslave humanity and complain about fake news. Two lone exiles are hoping to hide and barricade themselves within the shipping containers of an abandoned Industrial New York Cityscape, while on a mission to rescue their loved ones.</strong><br/><br/><br/><br/>EXPLODING INTO...Vol 3: \"<strong>HUMANS are FOOD</strong>\"<br/><br/><strong>There are many delicacies on the planet, XNAOTNENVOW. Deep underground a processing plant, hidden within a city-sized bunker, is refining a very peculiar kind of meat. A gifted teenaged prisoner named Samad and Cassie, an ex-combat vet turned mercenary, are in for a fight on their way back to the surface.</strong><br/><br/><br/><br/>Pulverizing waves of UNENDING CHILLING &amp; VILE entities throughout the...Vol 4: \"<strong>SHROUD of TERROR</strong>\"<br/><br/><strong>In a small northern Alaskan town, the sun has set. Months of darkness follow. A research team uncovers a mysterious tomb and it looks like it's feeding time! With horrors of the dark over running the entire town a small group of survivors shelter in a secure research center, but it’s getting cold, and they are almost out of fuel.</strong><br/><br/><br/><br/>Culminating into the SHOCKING CONCLUSION...Vol 5: \"<strong>Gray HELL</strong>\"<br/><br/><strong>A Good 'ol country boy &amp; an insane Circus performer must contend with their broken down car after fleeing the horrors of the Las Vegas strip. These two unlikely partners must now head into the desert and enter THE DARK DIMENSION, but opening our world to this realm also welcomes its nightmares.</strong><br/><br/><br/>----------------------------------------------------------------<br/><strong>Be sure to click on the Wishlist &amp; Follow buttons above to keep updated about all the latest Outer Terror news &amp; info!</strong><br/><br/>", "metacritic": null, "released": "2023-04-20", "tba": false, "updated": "2023-04-21T05:10:50", "background_image": "https://media.rawg.io/media/screenshots/9d3/9d36f414fc512fbe29dfb0fc4fcc6661.jpg", "website": "https://www.voxpopgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 420, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Salt & Pixel"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["VoxPop Games"], "esrb_rating": null}