{"id": 95971, "slug": "hellbreaker-itch", "name": "Hellbreaker (itch)", "name_original": "Hellbreaker (itch)", "description": "Run. Dodge. Kill.\r\n<p>Hellbreaker is a fast-paced first person shooter that will pit you against hordes of monsters and push you to your limits. Blast your way through them while racing against the clock to finish the level in one piece.</p>\r\nGame Design\r\n<p>The scoring system in the game revolves around:</p>\n<ul><li> Time taken to finish the level</li><li> Monsters killed</li><li> Damage taken</li></ul>\n<p>The goal is to encourage fast, aggressive, and skillful play-style.  There's no recoil or reloading to slow down the action.</p>\n<p>Time taken to finish the level constraint encourages the player to play fast, and not pick off monsters one by one from a safe spot.\r\nMonsters killed constraint prevents the player from just rushing to the end of the level and skipping combat. Strategies can be created around it, like prioritizing low HP monsters to get more kills, which is risk/reward decision because low HP monsters are usually low threat while high HP monsters like rocketeers and chargers are higher threat so it's better to spend time to kill them first to stay safe. You have to make meaningful decisions about your play-style and how much risk you think you can handle.\r\nThe damage taken constraint comes in to prevent you from just being reckless and soak up tons of damage while picking up lots of health.\r\nYou have to dodge as much damage as you can, while taking as much risk as you can, and do it as fast as you can.</p>\n<p>If you want to take your time to explore the levels and perhaps search for secrets, you can go to the gameplay settings and disable \"Deadline Mode\" so you won't have a time limit.</p>\n\n<p>\n</p>\r\nModding support\r\n<ul><li>Easy to learn level editor.</li><li>Game editor, easily edit things like monsters and pickups without writing code. </li><li>Powerful scripting. Modify or make your own monsters, weapons, pickups, or something completely new.</li></ul>\n<p>Modding documentation</p>\r\nFollow\r\nTwitter DiscordTumblrRedditYouTube\r\n\r\nDefault Controls:\r\nW, S, A, DForward, backward, left, right0-9Select weaponSpaceJumpEUseLeft mouseFire weaponEscapeOpen menuMouse Wheel UpNext WeaponMouse Wheel DownPrevious WeaponF1Open console (type \"help\" for commands list)F2Show debug HUD\r\nRecommended Specs\r\n<ul><li>3.1 GHz quad core processor</li><li>1.5 GB available GPU memory</li></ul>\r\nMinimum Specs\r\n<ul><li>2.4GHz dual core processor</li><li>1GB hard disk space</li><li>OpenGL 3.2</li><li>600 MB available CPU memory</li><li>200 MB available GPU memory</li><li>Windows Vista or later</li></ul>", "metacritic": null, "released": "2017-10-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/dbc/dbc7ef03d5d11ee9d755661b4dcebd88.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 370, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Enhex"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}