{"id": 959728, "slug": "labyrinth-of-zangetsu", "name": "Labyrinth of Zangetsu", "name_original": "Labyrinth of Zangetsu", "description": "Set in the Ido period, the world has blackened under the disaster of the 'Ink of Ruin'. Conscript a team of skilled warriors to venture deep into the impure Labyrinths and conquer the Ink plaguing the land. Dangerous yokai await you inside! Will you return unscathed and free the land of this stain? <br/><br/>Labyrinth of Zangetsu's artwork is truly mesmerising; seamlessly blending traditional Japanese art with modern design elements. As you navigate through the game's various environments, the beauty and complexity of its artwork become even more apparent as landmarks such as torii gates start to build in around you...<br/><br/><br/>As you plunge deeper into winding labyrinths the line between reality and nightmare becomes blurred. The creatures you will encounter in Labyrinth of Zangetsu are not merely monsters, but entities steeped in traditional Japanese folklore and legend, whose very presence will fill players with an unshakeable sense of dread...<br/><br/><br/>The ink-ruined land of Ido is a place where only the strongest and most adaptable can hope to survive. To stand any chance against these malevolent spirits, players must customise their hero to the fullest extent, tailoring every stat and ability to their specific needs. In this brutal world, only the most cunning and ruthless heroes will emerge victorious, their journey fuelled by the unending quest for power and survival.<br/><br/><br/>Structure your team strategically with the unique 'front &amp; back' mechanic; positioning your strongest conscripts at the front for powerful attacks, and your more defence allies in the back to help defend against unrelenting attacks! <br/><br/><br/>In the desolate world of Labyrinth of Zangetsu, the Ink of Ruin has wrought unimaginable devastation, leaving a land shrouded in darkness and despair. To confront this abomination, a team of battle-hardened warriors must delve deep into the impure Labyrinths, where the very air is thick with the stench of death. But as they fight to reclaim what was lost, they will discover that the true horrors lie not just in the Ink, but in the twisted depths of the game's haunting lore, waiting to be uncovered through harrowing side quests.<br/>", "metacritic": null, "released": "2023-04-20", "tba": false, "updated": "2023-04-21T05:00:57", "background_image": "https://media.rawg.io/media/screenshots/3e5/3e55760c4a6a93c86e8958eb5c927421.jpg", "website": "https://www.acquire.co.jp/zangetsu/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 420, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Acquire", "KaeruPanda"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": ["PQube"], "esrb_rating": null}