{"id": 959763, "slug": "firmament-2", "name": "Firmament", "name_original": "Firmament", "description": "<p>ABOUT FIRMAMENT<br />\nFirmament is a new puzzle-adventure game by the legendary game studio behind<br />\nthe best-selling games Myst and Riven. Featuring deep storytelling and<br />\nworld-building, discover the story of this seemingly abandoned world as you explore.<br />\nUnlock the mysteries of 3 unique Realms… and beyond!<br />\nEXPLORE THE WORLD<br />\nFeaturing a unique steampunk aesthetic, Firmament invites you to explore the<br />\nlegendary deep world-building Cyan Worlds is known for. Firmament is a fantastic<br />\nvisual feast, with thrilling new sights to see around every corner. At the same time,<br />\nthe world of Firmament feels completely plausible; as though it were constructed with<br />\na bigger purpose in mind… A purpose you will be compelled to discover as you play.<br />\nSOLVE THE PUZZLES<br />\nYou carry with you a device called an “Adjunct” as you explore. This Adjunct is your<br />\ninterface as you interact with the various devices throughout the Realms of<br />\nFirmament. Employing the Adjunct to solve the puzzles you encounter will bring you<br />\never closer to unlocking the secrets this place holds.<br />\nDISCOVER THE STORY<br />\nYou are not entirely alone in Firmament. In addition to The Adjunct, you are joined by<br />\na mysterious apparition, who has a story of her own to share with you. As you<br />\nexplore you will be introduced to 3 Realms - each with secrets and mysteries to<br />\nreveal. What purpose do the Realms serve? Can the spirit who accompanies you be<br />\ntrusted?<br />\nREVEAL THE MYSTERY<br />\nAre the realms of Firmament abandoned? What are these giant, mysterious<br />\nmachines scattered throughout the world? What is their purpose? What part do you<br />\nplay in this grand mystery? Explore, Discover, Solve, and Reveal the mystery for<br />\nyourself!</p>", "metacritic": null, "released": "2023-05-17", "tba": false, "updated": "2023-12-23T00:35:19", "background_image": "https://media.rawg.io/media/screenshots/143/143996ecb3d277de8d6592ef34d8d563.jpg", "website": "https://cyan.com/firmament", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 4, "owned": 4, "beaten": 3, "toplay": 11, "dropped": 1, "playing": 1}, "playtime": 10, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 282, "game_series_count": 0, "reviews_count": 5, "platforms": ["macOS", "PC"], "developers": ["Cyan Worlds"], "genres": ["Adventure", "Indie", "Puzzle"], "publishers": ["Cyan Worlds"], "esrb_rating": null}