{"id": 959746, "slug": "start-over-2", "name": "Start Over", "name_original": "Start Over", "description": "Start Over is an exciting base defense survival game where you are sent to a deserted island to start a new life. Your objective is to build a base, craft tools, weapons and items, hunt animals, gather resources, trade items for money, and explore the island. As you progress in the game, you'll encounter challenges such as raiding bandit camps and military bases, defending yourself against waves of enemies and raiders.<br/><br/>Your survival instincts will be put to the test as you navigate through the island's environment and unpredictable weather conditions. You'll need to strategize and prioritize tasks to keep yourself and your base safe from harm.<br/><br/>With a vast array of tools, weapons, and items at your disposal, you can create a base that is unique to your playstyle. <br/><br/>In addition, Start Over can be played in multiplayer mode, allowing you to survive with your friends. Together, you can build a thriving community, explore the island, and fend off enemies. With the ability to collaborate, the game becomes even more immersive, as you work together to overcome challenges and create a new life for yourselves on the island.<br/><br/>The possibilities are endless, and your fate is in your hands. Whether you choose to build a thriving community, become a lone wolf, or join forces with other players, the game will adapt to your choices and present new challenges and opportunities accordingly.<br/><br/>Will you be able to survive and thrive on the island, or will you succumb to the harsh realities of the wilderness?<h3>Cut down trees to collect wood.</h3><br/>Wood is a versatile resource that can be used in various crafts and constructions. It can be <br/>processed into planks for building bases, and it is also used as fuel for campfires and furnaces.<h3>Mine different types of rocks for ore.</h3><br/>Ore can be smelted in furnaces to create various materials that are useful for crafting items.<h3>Cook food on the campfire.</h3><br/>Prepare a diverse range of mouth-watering dishes over the campfire, grill, or in a pot.<h3>Control the wave difficulty.</h3><br/>Changing the wave difficulty to peaceful will prevent the spawning of any enemy waves.<br/>Changing it to hard mode will make the waves three times longer than the default length.", "metacritic": null, "released": null, "tba": false, "updated": "2023-04-21T05:23:11", "background_image": "https://media.rawg.io/media/screenshots/d93/d93b6ff414cd53128be0622da9981092.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 437, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EY-Studio"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["EY-Studio"], "esrb_rating": null}