{"id": 959774, "slug": "bricks-royale", "name": "Bricks Royale", "name_original": "Bricks Royale", "description": "Welcome to Bricks Royale-Brick Balls Game! Helping the king decorate his castle. An exciting Brick Balls Game adventure is calling you!<br/><br/>If you like classic bricks breaking games, don't miss Bricks Royale-Brick Balls Game!<br/>In order to save the king and princess, you need to break the bricks in a variety of different levels. In this fun journey, you will solve exciting puzzles, earn coins to unlock new areas, decorate the royale castle, and get extra boosters to continue your saga.<br/>Jump into the bricks breaking adventure and play now! We've got plenty of sweet puzzle levels to enjoy. Each new episode comes with free coins, helpful boosters, amazing prizes, challenging tasks and exciting areas.<br/>Bricks Royale-Brick Balls Game is a very innovative 3D bricks balls game. In this bricks games, you can crush all the bricks. Bricks Royale is not only a casual game, but also a brain exercise game. Crushing all the bricks may not help you pass the levels. You need to focus on the level goal and solve all the puzzles and crush all the blocks that prevent you from reaching your goal. Detonating big bombs can help you complete levels quickly.<br/>Bricks Royale is a free Bricks Breaker games of 2023 with unique gameplay and storyline. In this 2023 new puzzle Bricks games, you will not only experience excellent Bricks puzzle levels, you will also enjoy fun mini games. Unique fun Bricks puzzles will be continuously added to this free game. This Bricks puzzle game is designed to get you away from getting bored! Besides, regular update is guaranteed in this new bricks games of 2023. Bricks Royale is ready to offer you an unforgettable experience. Try this 2023 free puzzle Bricks game now!<br/><br/>Introduction to Classic mode:<br/>►By touch, control the direction of the ball launch and it will fly towards your target bricks.<br/>►Move your finger around the screen to find the best position and angle to hit each brick.<br/>►The mission needs to be completed by breaking bricks.<br/>►After launching the ball and hitting the bricks, the bricks will all move down one frame.<br/>►Never let the bricks move to the bottom.<br/>Introduction to rescue mode:<br/>►In a tense and exciting rescue theme, the character is trapped in the middle of dangerous bricks and you have to break the bricks to help him escape.<br/>►Don't worry and be afraid because we have a lot of props that will help you get over the obstacles and break the bricks to get through the difficult levels.<br/>►You can try to use different shooting techniques and strategies to break the bricks as soon as possible to help the character get out of danger.<br/><br/><br/>Game Features:<br/>- ►Unlock and blast powerful boosters!<br/>- ►Explore new rooms, royal rock parties, gorgeous gardens and many more exciting areas in the princess's castle!<br/>- ►Decorate the areas, including the princess’s room, kitchen, garden, and many other amazing rooms!<br/>- ►Magical chests are in these exciting areas, with great rewards waiting to be discovered!<br/>- ►Thousands of puzzling levels - more added every 2 weeks!<br/>- ►Come to challenge your friends and hit the top of the leaderboard!<br/><br/>Download now! Pleasure easy to lose, enjoy endless fun just now! Bricks Royale is completely free to play but some of the in-game items require payment.<br/>Have fun playing Bricks Royale the new Bricks Breaker puzzle game around! Getting bored at home? Try this free game of 2023 to relax now! Tons of free Bricks puzzle levels are waiting for you to discover. Besides, you will experience lovely castle decoration in this 2023 free Bricks Breaker Games! Join us now, try to pass as many levels as you can! This Bricks Breaker game of 2023 will never disappoint you. Are you ready? Step on Bricks Breaker Ball Game adventure now!<br/><br/>Need some help? Visit our support page in the Bricks Royale app or send us a message at bricksroyale-support@polyversestudio.com", "metacritic": null, "released": "2022-09-20", "tba": false, "updated": "2023-04-21T06:02:06", "background_image": "https://media.rawg.io/media/screenshots/330/330d8754f4ffa7a84aed65b478c587b4_XhjdvNE.jpg", "website": "https://www.polyversestudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["POLYVERSE ENTERTAINMENT"], "genres": ["Casual", "Puzzle"], "publishers": ["POLYVERSE ENTERTAINMENT"], "esrb_rating": "Everyone 10+"}