{"id": 959879, "slug": "consortium-vr", "name": "CONSORTIUM VR", "name_original": "CONSORTIUM VR", "description": "CONSORTIUM VR is both a complete Unreal Engine remaster of Game One of the iDGi-1 Trilogy (CONSORTIUM 2014) and a full adaptation to what we’re calling <strong>VR Interactive Cinema</strong>. <br/> <br/>Use our interdimensional satellite, iDGi-1, to inhabit the mind of a newly commissioned officer of the Consortium: an unparalleled peacekeeping force tasked with maintaining global unity while protecting the Earth's environment.<br/><br/>As Consortium Bishop Six, players assume the role of an investigator tasked with solving a mysterious murder, unveiling concealed conspiracies, and skillfully navigating interpersonal relationships among the diverse crew. Consortium boasts a highly interactive narrative, empowering players to make choices that influence the story's trajectory. With its innovative branching dialogue system, an immersive storyline, and a richly detailed game world, Consortium offers players a unique and engaging experience that explores the consequences of their decisions and the nature of trust and loyalty.<br/><br/><br/><br/><ul><li>Introducing V.O.I.C.E: You may use your own voice to engage with a diverse cast of over 20 characters. Navigate a nuanced murder mystery with some potential action that makes up a deeply interactive, 6-10 hour campaign of Game One of the iDGi-1 Trilogy.<br/></li><li>Freely explore the Consortium Command vessel C-3800-D ZENLIL. Decide to embrace diplomacy and navigate the narrative without ever even raising a weapon, or choose more violent approaches and utilize assault weapons to kill or incapacitate your enemies. Choose to talk to everyone or choose to be a person of few words. <br/></li><li>Immerse yourself into a deeply realized alternate, bright future world where many of humanity's problems have been solved. Access an in-world Information Console containing over a hundred articles of history, back-story and world events. <br/></li><li>Control an array of weapons, protective gear, medical equipment and more entirely via interactive screens that line your virtual arms. <br/></li><li>Explore and play many different gameplay scenarios within the Virtual Trainer (VT) and even make your own VT levels with our built-for-VR VT editor! Share your levels with the world with built-in modding support.</li></ul><br/>Welcome to the Consortium.", "metacritic": null, "released": "2023-04-21", "tba": false, "updated": "2023-04-24T03:17:04", "background_image": "https://media.rawg.io/media/screenshots/c46/c46d7a9e115b768608c9fff8ef0036d3.jpg", "website": "https://www.idgi1.ca/idgi-vr", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Interdimensional Games"], "genres": ["Adventure", "RPG", "Simulation"], "publishers": ["Interdimensional Games"], "esrb_rating": null}