{"id": 959840, "slug": "it-belongs-in-a-museum-2", "name": "It Belongs in a Museum", "name_original": "It Belongs in a Museum", "description": "Run, don’t walk like an Egyptian to your nearest Steam store and check out It Belongs in a Museum!<br/>\r\nput on your virtual reality headset and join a secret organization that has been around for thousands of years, in a story that wouldn't sell out a block buster movie, but is JUST good enough for VR! Your task is simple: take your ample goddess companion into battle across five stages listening to her recall the story while destroying monsters with an array of weapons. Look for sparkly treasure strewn across large, small, and procedural dungeons to satisfy your need to buy much needed guns. Marvel at the lack of consistency in story telling as the plot unfolds leaving you with more questions than answers!<br/>\r\nAnd when all of that is finished, you can extend your gameplay experience by repeating the stages in a similar fashion to a hamster in a wheel for the sole purpose of buying virtual versions of REAL artifacts from the skeleton dealer to fill up your museum… to scratch that “I need to collect something….” Itch!<br/>\n<br/>\r\nSo, act now! Copies are limited…. Wait… digital games aren’t limited, are they? OK screw it I’m too old for this. <br/>\n<br/>\r\nFeatures:<br/>\r\n-\tMultiple weapons: pistols, SMGs, assault rifles, shotguns, grenades, bow and sniper!<br/>\r\n-\tEnough Unity store assets flipped you’ll think it’s a gymnastics tournament!<br/>\r\n-\tFoul mouthed NPCs that keep it PG-13! <br/>\r\n-\tA “story” written in the span of weeks when time allowed, loosely based on Akkadian/ Mesopotamian mythology with a large order of plot holes and logical fallacies!<br/>\r\n-\tSmooth motion with no teleporting!<br/>\r\n-\tslow time just to make shooting look cool!<br/>\r\n-\tCompanion fully voiced by a REAL actress and other NPCs voiced by REAL AI!<br/>\r\n-\tInconsistent pacing and level design because sometimes I just thought: “Not realistic, but it looks cool!”<br/>\r\n-\tVarious types of enemies from skeletons, zombies, and mummies… OH MY!<br/>\r\n-\tClimbing on various surfaces such as walls, pyramids, and …..stairs!<br/>\r\n-\tActive ragdolls on certain enemy types. Give them a punch and watch them fall down!<br/>\n<br/>\r\n(Achievements not yet included. Side effects may include headache, fever, runny nose, nausea, lack of ambition, weight gain, indigestion, and priapism. Consult your doctor if you have two or more of these symptoms lasting longer than 4 hours.)<br/>\n<br/>\r\nIn all seriousness, Thank you for reading to the end. I enjoyed putting this game together and I hope that you enjoy playing it. - CoffeeSerpent", "metacritic": null, "released": "2023-04-21", "tba": false, "updated": "2023-04-24T02:29:03", "background_image": "https://media.rawg.io/media/screenshots/488/4881cfa9c0cf770df2f3a34fb1b06f8b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 462, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CoffeeSerpent"], "genres": ["Action", "Adventure"], "publishers": ["CoffeeSerpent"], "esrb_rating": null}