{"id": 959857, "slug": "hopes-end", "name": "Hope's End", "name_original": "Hope's End", "description": "Communication across Earth has been disrupted. The end came, and with it, the Blighted - horrifying monstrosities mutated from the species that once existed across the planet. Despair did not arrive without hope, however, for psionic abilities appeared among humanity. You are now the last line of defense against the nearly endless waves of Blighted. Defeat the onslaught of monstrous forces and defend the last surviving human settlement: <strong>Hope's End.</strong><br/><br/><br/><br/>As the Supreme Psion, harness unique and powerful abilities across seven Specializations to eradicate those who seek humanity’s destruction. Will you express yourself with the incendiary inclinations of Fire? Perhaps the frigid fiendishness of Frost? Or maybe the brilliant bolts of Electricity are most to your liking? Grow in power and become an unstoppable force throughout your runs with customizable upgrades from your Armory. The Blighted are at your doorstep. Annihilate them how you see fit.<br/><br/><br/><br/>The enemy has powerful psions among them as well, and researching their remains can grant you additional abilities. As you defeat the strongest Blighted, you'll gradually unlock bonuses to give you a greater edge over the horde of mutants. If the Blighted seem to not pose much of a threat, increase the challenge through the No Hope Mutators of your choice. Every increased difficulty provided the opportunity for greater reward as you aim for the top score.<br/><br/><strong>Key Features:</strong><br/><br/><ul><li>Obliterate waves of monstrous foes in this wave defense roguelite<br/></li><li>Seven psionic Specializations to master, all with their own unique and powerful abilities<br/></li><li>Visit the Armory to upgrade Psionic abilities and gain a tactical advantage<br/></li><li>Gather valuable DNA from the Blighted and choose how to spend it in your Research tree<br/></li><li>Side objectives provide permanent progress towards unlockables<br/></li><li>Pick and choose how you would like to increase the difficulty through No Hope Mutators</li></ul>", "metacritic": null, "released": "2023-04-21", "tba": false, "updated": "2023-04-24T02:47:30", "background_image": "https://media.rawg.io/media/screenshots/f48/f481b23b9dbe340551f20407cf8dc877.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 391, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Explorers Guild Games"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Explorers Guild Games"], "esrb_rating": null}