{"id": 959878, "slug": "virgin-knight-is-my-onahole-tonight", "name": "Virgin Knight is my Onahole Tonight", "name_original": "Virgin Knight is my Onahole Tonight", "description": "You're the #2 Knight in the Royal Army, not by any particular merit or outstanding feat, but simply because you were born into the Royal Family. Your commander, however, is the opposite. She trained hard to get where she is and her skill with the sword and rippling muscles are testament to that fact.<br/><br/>While out on a mission you take the blame for a lower ranked knight's mistake saving her from being executed! Don't get it twisted, this wasn't out of the goodness of your heart or anything like that. The lower ranked knight who you are covering for just so happens to be Commander Hilda's <strong>girlfriend</strong>!<br/><br/>The deal is simple, Hilda becomes your on-call sex-toy for the next two months and you're even. Show her what she has been missing out on by plunging her into the rapturous depths of masochistic ecstasy. Have her kneel before you and beg for your cock and she'll be hooked on your cream long before the proposed two-month time limit is up! And so, the games begin.<br/><br/><br/><ul><li>Translated version of the original Japanese Visual Novel<br/></li><li>Hilda is fully voiced with original Japanese dialogue<br/></li><li>Original artwork HD upscaled with 16:9 and 4:3 variants<br/></li><li>Hours of story content<br/></li><li>Audio including music and special effects<br/></li><li>Enhanced with character sprite animations<br/></li><li>Gallery and Scene selections<br/></li><li>A Scene Studio to view all the beautifully drawn sprites and backgrounds<br/></li><li>17 sadistic scenarios to push Hilda to her masochistic limit.</li></ul><br/>Virgin Knight is my Onahole Tonight Is the English localization of a Visual Novel originally created by prolific Japanese developer Miel. We at Cherry Kiss aim to provide an authentic Japanese Visual Novel experience to gamers outside of Japan.<br/><br/>** PLEASE NOTE **<br/>All characters described and visually represented in this game are over 18 years of age, and no actual, nor identifiable minor was used in the production of this game.", "metacritic": null, "released": "2023-04-21", "tba": false, "updated": "2023-04-24T03:16:11", "background_image": "https://media.rawg.io/media/screenshots/3b9/3b9481a63001dbfc7588d55713b4bde4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 492, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["miel"], "genres": ["Casual"], "publishers": ["Cherry Kiss Games"], "esrb_rating": null}