{"id": 959864, "slug": "rally31", "name": "Rally31", "name_original": "Rally31", "description": "Rally31 is a small open-world racing game with 12 unique and experimental vehicles. The vehicles are physics-based with each one having a different setup to the suspension system. This adds variety to the difficulty level and driving experience of each machine.<br/>\n<br/>\r\nThe vehicles use a cell shader inspired by the anime Wangan Midnight and the rest of the environment is done in a cartoon style.<br/>\n<br/>\r\nThe level is a chain of islands that are built on a base that is 6 km long and 3 km wide. Each island is fully explorable.<br/>\n<br/>\r\nYou can buy more cars and access your inventory at the player’s house. You can earn money to buy cars by finishing stages. You can get a reward bonus by beating your best time or for completing a stage with a car that is difficult to drive.<br/>\n<br/>\r\nAll the controls are listed in the pause menu that is accessed with the escape key.<br/>\n<br/>\r\nYou can open and close the map with the “M” key. The map marks the start of stages with red flags and the player’s house with a blue house icon.<br/>\n<br/>\r\nIf you get stuck, you can rewind by holding “X” on the keyboard or ”Y” on a controller. If you cannot free yourself with the rewind, then press “R” on the keyboard to reset your position back to the start of the level.<br/>\n<br/>\r\nThe controller can be turned on in the options menu accessed via the pause menu, by clicking “CLICK TO USE A CONTROLLER”.<br/>\n<br/>\r\nThe options menu also allows you to adjust the volume and change the gearbox behaviour from automatic to manual.<br/>\n<br/>\r\nI plan on supporting and updating this game for the foreseeable future.", "metacritic": null, "released": "2023-04-21", "tba": false, "updated": "2023-04-24T02:56:07", "background_image": "https://media.rawg.io/media/screenshots/2dc/2dc3feafe7ccaf076478fec1eaa6af38.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dylan Sewell"], "genres": ["Adventure", "Racing", "Casual"], "publishers": ["Dylan Sewell"], "esrb_rating": null}