{"id": 959832, "slug": "my-best-friend-kouta", "name": "My Best Friend Kouta", "name_original": "My Best Friend Kouta", "description": "Consider yourself warned and prepare your psyche: This is a slice of life game <strong>heavily focused on Netorare</strong>. In \"My Best Friend Kouta\", you take on the role of Eisen, whose life could be perfect if not for one detail... His best friend, <strong>Kouta, is extremely perverted</strong>. That wasn't a problem as long as Eisen was single. But now Evie, his <strong>new girlfriend</strong>, finds it strange that Eisen puts off so much to introduce his best friend.<br/><br/>As you explore all that Middleriver Town has to offer, date Evie and even make plans for a future engagement, <strong>Kouta will slowly corrupt Evie's mind</strong>, causing her to venture farther and farther into<strong> sordid desires</strong>, but that always existed.<br/><br/><br/><br/>Evie's moans, breaths, giggles and all other expressions are voiced for a more pleasurable immersion.<br/><br/><br/><br/>Use your cell phone for many things. Access the town's perv forum, receive messages, or even call Evie. But watch out, she can be in for embarrassing moments.<br/><br/>\"E-Eisen? I... I can't talk right now, I'm with Kouta and...<br/>Hmm... My mouth is full!\"<br/><br/><br/><br/>Middleriver is an entire city to be explored. The cinema and Otaku Kingdom offer entertainment. You're part of the Scissor Corporation, but you can also make some extra money by working in the museum sometimes. Visit the Library to increase your Mental Energy or the Gym to increase your Physical Energy. Take your girlfriend out on dates at the restaurant or the park.<br/><br/>Furthermore, the city is populated by dozens and dozens of interactive NPCs. They provide secondary objectives, change dialogue depending on what's going on, give important information...<br/><br/>Last but not least, the city has a morning, afternoon, night and dawn system. Different things happen according to the time of day. Shops may or may not be open, NPCs may or may not be available.<br/><br/><br/><ul><li>Participate in the competition in the Chess Club<br/></li><li>Discover secret scenes<br/></li><li>Complete your game collection<br/></li><li>Help Kouta complete a manga collection<br/></li><li>Among many other quests and features</li></ul><br/>", "metacritic": null, "released": "2023-04-20", "tba": false, "updated": "2023-04-24T02:17:09", "background_image": "https://media.rawg.io/media/screenshots/c7c/c7cd46178cfbd72461da8b055848a651.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Graverobber AXDX"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Graverobber AXDX"], "esrb_rating": null}