{"id": 95989, "slug": "animation-studio-tycoon-final-delivery", "name": "Animation Studio Tycoon - Final Delivery", "name_original": "Animation Studio Tycoon - Final Delivery", "description": "<p><strong><em>Questionnaire</em></strong><br/></p>\n<p>ლ(ʘ̆ʘ̆)ლ</p>\n<p>In our subject 'Gamelab' at the University, we get an assignment in the start of each semester to pitch an idea and hopefully work that idea into a working 'game'.</p>\n<p>We (the team) is now at our final stages of our education. The project is handed in and the team is going their seperate ways. Because of this the production and development is put on hold for now and the updates will not be as frequent as they have used to be.</p>\n<p>In `Animation Studio Tycoon` you take on the role as a young, ambitious Animator during the birth-stages of the industry and into the golden age. Lead your studio, set industry standards by bringing forward pioneering new technologies, start with short comedies and go over to full-length adventures on the high seas! Are you ready to become the new Dalt Wisney?</p>\n<p>The age we've set is +7 years of age - however someone below 7 years would most likely rock this game. It's mainly the language (unknown words/strange words) and the actions/gameplay itself. But please do play together with kids and younglings! We wish feedback from all ages, genders and branches of the society!<br/></p>\n<p>The game should be playable from all browsers. If you get an error regarding memory, try closing your tabs and refresh.</p>\n<p>Thank you &amp; have fun:)</p>", "metacritic": null, "released": "2016-10-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7a9/7a9ae506814bcaac7a7d800880eaac9c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["E.J. Sandberg"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}