{"id": 959934, "slug": "commander-world-war-ii", "name": "Commander: World War II", "name_original": "Commander: World War II", "description": "<h3>Intro</h3><br/>Command your troops and conquer the battlefield in Commander: World War II, the ultimate turn-based tactical game. Choose to fight for either the Allies or the Axis, 3 different factions (USA, Germany, and the Soviet Union), and use your strategic skills to deploy your units and outmaneuver your opponents. Experience the thrill of World War II as you command infantry, tanks, planes, and naval units in intense, action-packed battles. Do you have what it takes to emerge victorious on the front lines of Commander: World War II?<h3>Description</h3><br/>The world is at war, and you must lead your faction to victory. Play the campaign with many different operations of world war 2, battle on skirmish maps, choose different parameters on the maps, and battle up to 7 other commanders.<br/><br/><ul><li>Battle with different factions for complete dominance of the battlefield<br/></li><li>Choose from 3 different factions with unique units, the USA, Germany and the Soviet Union<br/></li><li>Play historic battles from ww2<br/></li><li>Recruit infantry, tanks, planes, and naval units to help in your mission<br/></li><li>Capture different locations ensuring a steady income to recruit new units<br/></li><li>Use the terrain as cover to increase the odds of a favorable battle outcome<br/></li><li>Use specialized units to counter specific units, such as anti-aircraft guns to take down enemy planes<br/></li><li>Create and edit maps in the Map Editor to design your own battles</li></ul><br/>", "metacritic": null, "released": "2023-04-27", "tba": false, "updated": "2023-04-28T02:27:45", "background_image": "https://media.rawg.io/media/screenshots/bac/bacf5206bc62b0497e527027846238ba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 385, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["GoldenGod Games"], "genres": ["Strategy", "Indie"], "publishers": ["GoldenGod Games"], "esrb_rating": null}