{"id": 9599, "slug": "decksplash", "name": "Decksplash", "name_original": "Decksplash", "description": "The extreme world of skateboarding meets the intrepid art of painting in this six player competitive team game!<br/>Pick one of the daring deck designs, find a match and get ready to splash big, earning experience and loot boxes for dank skrilla to bedazzle your peers!<strong>Key Features</strong><br/><strong>Competitive 3 Vs. 3</strong> - Take part in fast AND furious matches which will pit your deck splashing abilities against others looking to prove their skills!<br/><br/><strong>Dank Skrilla</strong>- Earn yourself loot boxes with new board designs by taking on your opponents in incalculable fashion.<br/><br/><strong>Party Up</strong> - Nothing says BFF’s than the squad getting their decks out to splash with complete strangers!<br/><br/><strong>Getting TRIꓘT out!</strong> - As you flip and spin through the air, you’ll be accredited for each trick you pull off with its real world counterpart!<br/><br/><strong>2ManyBoardz #FirstWorldProblems</strong> - Play with any of the freaky fresh boards, each designed to have its own unique personality and flavour!<br/><br/><strong>Full 3D Controls</strong> - Become the master of dimensions as you spin your board in full rotation of the X, Y AND EVEN Z AXIS!.<br/><br/><strong>Shock the Competition</strong> - See the cool kid on the block, tryna prove themselves? Decimate them with a shockwave, throwing them through the air and destroying their combo.<br/><br/><strong>Nothing Confusing!</strong> - The Skateboards are neither kids nor squids, it’s easier to keep track of!<br/><br/><br/>This is just the beginning for Decksplash, we have big plans and want to deliver the best game we possibly can with your help.<br/>Follow the game on Steam or our social channels and be the first to be notified of updates and when the game is heading into Early Access<br/><br/><strong>Steam Forums</strong> - http://steamcommunity.com/app/499470/discussions/<br/><strong>Reddit </strong>- http://www.reddit.com/r/decksplash<br/><strong>Twitter</strong> - https://twitter.com/decksplash<br/><strong>Website</strong> - http://www.decksplash.com<br/><strong>Discord</strong> - https://discord.gg/pGZfpUh", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T12:12:52", "background_image": "https://media.rawg.io/media/screenshots/0ca/0ca1d4eae4a3a1df4737e13d1d74d76e.jpg", "website": "http://www.decksplashgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bossa Studios"], "genres": ["Action", "Sports", "Indie"], "publishers": ["Bossa Studios"], "esrb_rating": null}