{"id": 959981, "slug": "beat-banger", "name": "Beat Banger", "name_original": "Beat Banger", "description": "<strong>This game is incomplete and still in the early access phase. The content in the game is subject to change in future versions</strong><br/><br/><strong>Beat Banger is a mature furry rhythm game. You are the lone protagonist in a rags-to-bitches story. Work your way to the top of Beat Banger Studios, a small and rhythmic porn production company in desperate need of assistance. You apply for a simple production job, but the CEO has another position in mind for you. Jump in now. You won't want to miss a beat.</strong><h3>Gameplay</h3><strong>In the current version of the game, only two levels are available; \"Virgin Newbie\" and \"She Doesn't Like You.\" More levels will be added in future versions of the game.</strong> The Available stages in this version of Beat Banger are rhythm games, which reward timing, accuracy, and consistency. The beats within stages represent the “thrusts” your character performs. Doing well in specific sections of the level may reward you with alternate versions of the animations.<br/><br/><h3>Freeplay</h3>You can re-play any stages you've beaten on the level select screen. Try your best to get a high score and get more cash for the Shop!<br/><br/><h3>Modding</h3>Users can easily create mods for the game. These levels can be found by selecting the \"mods\" button on the main menu. This game will not include any mods natively. Mods can be found on our community discord. Download mods at your own risk!", "metacritic": null, "released": "2023-04-24", "tba": false, "updated": "2023-08-28T06:14:49", "background_image": "https://media.rawg.io/media/screenshots/6a7/6a7ce79096383278492e47c8951921b8.jpg", "website": "https://bunfan.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "beaten": 1, "toplay": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 2, "platforms": ["Linux", "PC"], "developers": ["BunFan Games"], "genres": ["Casual", "Indie"], "publishers": ["BunFan Games"], "esrb_rating": null}