{"id": 960034, "slug": "the-forgotten-concluder", "name": "The Forgotten Concluder", "name_original": "The Forgotten Concluder", "description": "\"A covenant for enternity, A sword to succeed.\"<br/><br/>In the high of Mount Taishan, there is a deep valley that never been known, isolated to the motral world. Time pass by without noticed, young Shen Zi-Jun wondering about the mortal world far away, never know the peaceful life will come to an end in a accident…<br/><br/><br/><br/>Being guided by the unseen destiny, he will take on a adventure to heaven and deep, to discover a great ancient secret , a dream to be forgotten long long ago , a promise cannot be keep, a sword to conceal too much mystery.<br/><br/><br/>Once the wheel of destiny begin to spin again ,he will be lead to the end of the lost legend, only in the deep of infinity high clouds, he will get back to his true self…<br/><br/>[The scenario]<br/>Being the most important core element of a classic RPG, the scenario of “The Forgotten Concluder” was written and plotted by famous Chinese fantasy game writer Quester Yeh that ever made the “Kalpa: The forbidden divines”, with over 400,000 words of carefully written dialog to spell out a detailed and amazing Chinese wu-xia fantasy world, to tell a great and fun story that base on ancient Chinese legend from heaven to earth.<br/><br/><br/><br/>[The battle mode]<br/><br/>The semi-realtime battle mode used in “Kalpa: The Forbidden Divines” has been renewaled and add more character elements to make the battle more dynamic and exciting. Player can command maximum 5 characters to fight against maximum 10 enemies in real time basis, making decision in seconds to gain victory over strong opponent by using Strategies wisely.<br/><br/><br/><br/>[The game World]<br/>A detailed and vivid world to explore is the essence of RPG, although limited by the 3D engine ability, the team contrived to remake the true looking in the time of  Song Dynasty by researching history and carefully modelling the building and characters, other game scenes will include wonders location that deep into the earth or high in the clouds, in additional to the marvellous looking that above the imaginations, there are a variety of puzzles and mechanism triggers that wait for players to solve.<br/><br/>", "metacritic": null, "released": "2023-04-26", "tba": false, "updated": "2023-04-28T04:35:54", "background_image": "https://media.rawg.io/media/screenshots/56b/56b63dae88efb652a6ec557ba27b4978.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 380, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kunpo Games"], "genres": ["RPG"], "publishers": ["Kunpo Games"], "esrb_rating": null}