{"id": 960029, "slug": "zhong-ji-gong-de-mo-ni-qi-zen-simulator", "name": "终极功德模拟器 | Zen Simulator", "name_original": "终极功德模拟器 | Zen Simulator", "description": "Congratulations! When you enter this page, you are the chosen one! You will save the world through practice.<br/><br/><br/><br/>Someone in the game killed tens of thousands of virtual humans, committing the Buddhist sin of killing life.<br/><br/>Some indulge in sex and lie, some drink alcohol and speak evil, some steal and divide, some are greedy.<br/><br/>The world seems to be shrouded in darkness and chaos.<br/><br/>Plague, war, poverty and injustice,<br/><br/>Evil and decay were so deep that there seemed to be no way out.<br/><br/>But people have to reap the consequences in the end, because heaven has a cycle.<br/><br/>You must cultivate yourself! Accumulate merit and virtue, let us benefit the world together!<br/><br/>You have to keep improving! To get transcendence! To purify the world! Make you and those around you happy.<br/><br/>Although the road ahead is long, but I believe, never give up!<br/><br/>For the sake of justice, you will become a Buddha, and the Gospel of mankind will be made by you.<br/><br/><br/><br/>Game description:<br/><br/>1, this is a real simulation of Buddhist meditation game, in the game you will play a meditation practitioner to complete their own practice. Your main goal is to accumulate merit. According to Buddhism, every time you accumulate merit, you and those around you will become happier and the world will become a better place.<br/><br/>2. The game has real meditation levels, which are divided into 42 collectible achievements. But collecting them all is very difficult and requires extraordinary patience and skill. But it is not an impossible challenge. When you reach the highest level, you will become a Buddha, and at the same time, you will gain insight into the true meaning of life and eternal happiness.<br/><br/>3. The way to gain merit value in the game: knocking wooden fish, ringing bells, burning incense, releasing live animals, or doing nothing in the game to understand life.<br/><br/>4. Due to certain factors such as spirituality, your merit sometimes triggers a multiplier stack that will allow you to complete your training faster.<br/><br/>5. Bell ringing, incense burning, and release of life can get a lot of merit at once, but there is a certain cooling time, you need to coordinate your time!<br/><br/>6. Due to the presence of spirit, the wooden fish can switch to automatic tapping after a certain time.<br/><br/>7, please attentively experience this game, you will gradually understand the Zen, wish you as soon as possible! Start the journey ~!", "metacritic": null, "released": "2023-04-27", "tba": false, "updated": "2023-04-28T04:29:04", "background_image": "https://media.rawg.io/media/screenshots/61c/61c8acf46e171938e469db7f7b859925.jpg", "website": "https://space.bilibili.com/235610073", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 348, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Archimedes Nicholas Xia"], "genres": ["RPG", "Simulation", "Casual", "Indie"], "publishers": ["阿基米德 尼古拉斯 夏"], "esrb_rating": null}