{"id": 960087, "slug": "we-the-refugees-ticket-to-europe", "name": "We. The Refugees: Ticket to Europe", "name_original": "We. The Refugees: Ticket to Europe", "description": "<ul><li><strong>20 NPCs</strong> to meet &amp; learn their stories<br/></li><li>5 countries to visit &amp; a sea to cross<br/></li><li>90 minutes of <strong>original soundtrack</strong><br/></li><li>Almost 100 <strong>hand-drawn illustrations</strong></li></ul><br/><strong>Story</strong><br/>It’s the beginning of the year 2020. You are a frustrated thirty-something wannabe writer from Warsaw who decides to make something out of himself. You will amaze the literary world with your earth-shattering book about refugees. It will inspire crowds and galvanize hearts, and expand minds, and change the world in all the right ways.<br/><br/>Before you prepare your Pulitzer Prize acceptance speech, there is only the trivial matter of actually travelling to Africa to gather some notes for the story. You have an ingenious plan to smuggle yourself onto one of the illegal boats that travel to Europe from the shores of Africa while pretending to be a refugee yourself. Surely nothing can go wrong and you are NOT completely out of your depth. Surely.<br/><br/><br/><br/><strong>Developers support the refugee cause</strong><br/><br/>5% of We. The Refugees: Ticket to Europe profits will be donated to charities helping refugees. The first 2.5% goes to the Hope Project  - Greek volunteers who helped us meet refugees in person during research. The other half will go to other humanitarian organisation we will choose together with our community. <br/><br/><strong>The uniqueness of We. The Refugees: Ticket to Europe</strong><br/><br/>A Modern, Relevant Setting<br/>The game concerns the refugee crisis at Europe’s southern borders, a very real problem we have been facing for several years.<br/><br/>A Richly Woven story<br/>The complex, multi-layered script comprises nearly 2 million characters, the equivalent of 3-4 novels. Meaningful choices and consequences split the plot into parallel paths, which enables players to meet new characters and discover new storylines during their second and third playthroughs.<br/><br/>A relatable perspective on a complex topic<br/>The protagonist is a European who tries to enter the world of the refugees as an outsider. The game deliberately plays on the cliché of “a white male’s journey to an exoticized world” and subverts it.<br/><br/>Multi-level, original narrative<br/>The game is metacontextual - it is not only a reportage about refugees, but also an interactive fiction game presenting the very process of creating a reportage. This way, the player discovers both the player discovers both the refugees’ journey and a writer’s challenges of exploring the subject.<br/><br/>Authenticity and Factuality<br/>Based on true events, the writing process was preceded by a series of interviews with refugees who were familiar with the concept for the game. To make this possible, the writers team visited the Moria refugee camp on the Greek island of Lesvos, where the prototype of the game was presented to refugees and volunteers. The script was also reviewed by experts from relevant NGOs.<br/><br/>", "metacritic": null, "released": "2023-04-30", "tba": false, "updated": "2023-05-05T02:48:40", "background_image": "https://media.rawg.io/media/screenshots/293/29333b523ce66ea5954a58bdd8ad1b97.jpg", "website": "https://actzerogames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 280, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "macOS"], "developers": ["Act Zero"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Polyslash"], "esrb_rating": null}