{"id": 96002, "slug": "super-lemonade-factory-part-two", "name": "Super Lemonade Factory Part Two", "name_original": "Super Lemonade Factory Part Two", "description": "<p>Usually when you see a description of a sequel that starts with &quot;The two main characters are back and bigger than ever&quot; it&#39;s a sure sign of a cash grab. Andre and Liselot are back, and this game is bigger than ever! Super Lemonade Factory Two has more of everything you loved about the first, more zany dialog, more gorgeous pixel art and more spikes. Taking place around the globe in Sydney Australia, New York City and a military base.<br />\nSINGLE-PLAYER CO-OPERATIVE PLAY Liselot can double jump, push small crates for Andre to climb on and talk to other characters. Andre can smash big crates and carry Liselot. Switch between the two characters to combine their abilities and get both of them to the exit.<br />\nSequel to the quirky 2012 game Super Lemonade Factory Rewritten from the ground up. Other sequels we enjoy include Wonder Boy In Monster Land and Portal 2. Sequels we did not enjoy include S. Darko and California Games II.<br />\nSydney Represent Definitely not the first game to feature the Sydney Harbour Bridge or the Sydney Opera House, as International Karate had those features 27 years ago.<br />\nTrampolines! Crates! Enemies... but are they bad people?<br />\nPremium pixel art by Miguelito.So what&#39;s the hook? This is an original IP, and that&#39;s not easy. In a world where nostalgia is sold as a commodity, launching an original series is tough. This is actually independent. The word indie has become overloaded and co-opted. We have no backers, sponsors or shareholders.Tech Specs: Microsoft XNA Framework Redistributable 4.0 Refresh required to play this game.For More Information:Official WebsitePresskitMusic By Go ExploringPraise for Super Lemonade Factory Part TwoTo paraphrase Ebert: I hated this game. Hated hated hated hated hated this game. Hated it. Hated every simpering stupid vacant audience-insulting moment of it. Hated the sensibility that thought anyone would like it. Hated the implied insult to the audience by its belief that anyone would be entertained by it.Fuck you buddy, you and your free &#39;game.&#39; I didn&#39;t understand it. It made me feel confused and old and carsick and tired all at once. I don&#39;t know if you&#39;re joking on us with the game or maybe I&#39;m losing my mind. I hate your game though, worse than I ever hated anything I&#39;ve ever played before. WHY? WHY? WHAT IS THE POINT? HOW CAN YOU DEFEND INFLICTING THIS ON PEOPLE? IS THIS SUPPOSED TO MAKE ME HAVE FUN? I DON&#39;T GET IT, BUT I HATE IT.I probably missed something. It&#39;s probably a decent little platform game and I missed something big like one of the buttons or how to make it fun. I pray it&#39;s a better game than I thought it was trying to play it, because I don&#39;t want to live in a world where people play games like this.</p>", "metacritic": null, "released": "2014-02-26", "tba": false, "updated": "2019-08-28T23:25:38", "background_image": "https://media.rawg.io/media/screenshots/526/5267ddaa172aa6976e15657566f08016.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "PC", "macOS"], "developers": ["initials"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}