{"id": 960030, "slug": "natural-disaster-a-butterflys-guide-to-mass-destru", "name": "Natural Disaster: A Butterfly's Guide to Mass Destruction", "name_original": "Natural Disaster: A Butterfly's Guide to Mass Destruction", "description": "“Does the flap of a butterfly’s wings in Brazil set off a tornado in Texas?” –Edward Lorenz, “The Butterfly Effect”<br/><br/>Natural Disaster: A Butterfly’s Guide to Mass Destruction is a slapstick puzzle game with inspiration from point-and-click classics of how one very evil butterfly can bring down an empire. Explore a world through a stereoscope, test your limits as a teeny butterfly in a human’s world, and start chains of cause-and-effect that ripple across the seven scenes to disastrous results.<br/><br/><strong>A SMALL WORLD OF SMALL PUZZLES</strong><br/>Investigate the environment to discover items you can carry, objects you can activate, and places you can land to find how to lead these people to their worst nightmares.<br/><br/><strong>PLAY THROUGH A STEREOSCOPE VIEWER</strong><br/>Explore seven rich 3D locations through the lens of a stereoscope. Follow the characters through paths with multiple endings as your actions in one scene continue in another.<br/><br/><strong>TIME LOOP TRIALS</strong><br/>Upon your death, you find yourself back at the beginning, and all of the humans’ peaceful lives restored. It’s a time loop trap…or an opportunity for new methods.<br/><br/><strong>A BUTTERFLY NEVER FORGETS</strong><br/>Your shenanigans are logged the Scrapbook. It journals everything you’ve learned about your targets across multiple trials and is a guide for what the butterfly might be curious to try next.<br/><br/><strong>HOLD ON…A WIZARD?</strong><br/>In all your exploits, no one seems to notice that it is a butterfly causing their misfortune. But what happens when somebody does?", "metacritic": null, "released": "2023-04-26", "tba": false, "updated": "2023-04-28T04:30:34", "background_image": "https://media.rawg.io/media/screenshots/964/9648d910074818dda59a706ae2ac8955.jpg", "website": "https://linktr.ee/naturaldisaster2023", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 311, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Burning Reel Studios"], "genres": ["Adventure", "Simulation", "Casual"], "publishers": ["Burning Reel Studios"], "esrb_rating": null}