{"id": 960000, "slug": "sky-division", "name": "Sky division", "name_original": "Sky division", "description": "Sky division is a visual novel, where the player plays the role of a human pilot fighting a war against an alien race to conquer their planet.<br/>\r\nDuring a reconnaissance mission the protagonist is shot down on a desert island and finds a wounded enemy pilot. The story focuses on the relationship between the two and the mutual understanding between two races that are in conflict.<br/>\n<br/>\r\nSky division is a visual novel set in a dystopian future in which humanity abandoned Terra for unknown reasons. After traveling 600 years through the inhospitable darkness of space in huge spaceships called \"arks\", governed with an iron fist by \"the federation\", a conglomerate of countries that united with the purpose of avoiding the extinction of the entire race.<br/>\r\nAfter 6 generations away from home, mankind forgot the languages they used in terra, the religions and even the feelings, to the point that love and sentimental relationships were left in the past. A few books were preserved but are considered forbidden to the general population.<br/>\n<br/>\r\nThe planet to which they were traveling was considered a paradise for the proliferation of the race, with no intelligent life and abundant resources.<br/>\r\nBut when they arrived they saw how wrong they were, there was intelligent life on the planet and the planet was immersed in a territorial war and for the survival of the different races that inhabited it.", "metacritic": null, "released": "2023-04-25", "tba": false, "updated": "2023-04-28T03:48:42", "background_image": "https://media.rawg.io/media/screenshots/b73/b73d47cd59f68dedc1f06a6cf73b88ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 361, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Marius Axe"], "genres": ["Adventure"], "publishers": ["Marius Axe"], "esrb_rating": "Adults Only"}