{"id": 960082, "slug": "puzzle-wizards", "name": "Puzzle Wizards", "name_original": "Puzzle Wizards", "description": "Puzzle Wizards is a cozy co-op cross-platform puzzle MMO from the creators of Puzzle Pirates. Master the harvest, mixing and battle puzzles to go on exciting adventures with friends in the wilds. Earn valuable resources and treasures to build and customize your village and home with furniture and decorations. Win funky familiars and craft fancy robes, hats, wands and more on your journey to Arch Wizard ascension. Team up and work together with your fellow Wizards to build Guilds and restore the world!<h3>The Puzzles</h3><br/>Puzzle Wizards is powered by three puzzles: Harvest, Mixing and Battle. Each have their purpose in the heartwood realms:<br/><br/><ul><li>Harvest: use your match-3 skills to gather resources from the world.<br/></li><li>Mixing: craft clothes, hats, wands, potions and other useful items with this line-drawing puzzle, whilst fending off the challenges of naughty ingredients.<br/></li><li>Battle: defeat the enemy spirits of the Wildwoods with the fast-paced battle puzzle, sliding to make four tile and larger matches and flipping attacks back to your foes. </li></ul><br/>You'll begin your Wizard's journey in the Heartwood Academy where each puzzle will be taught and your wizarding abilities proven.<h3>The Wildwoods</h3><br/>Voyage into the wildwoods on solo and co-operative adventures to gather resources, recipes and rare drops. Wilds are themed as Sun, Moon and Star with inner, middle and outer difficulties. Adventures are in quick, bite-sized chunks of around fifteen to thirty minutes of fun. Wildwood clearings can be chained together, increasing in difficulty as you progress. Difficulty is adapted to the number of players in your party -- it's possible to solo or play in a group of four or more -- and it's easy to drop in and drop out without stranding your team-mates.<h3>Restore your Village</h3><br/>The arch-wizard has entrusted you with your own village. The place has fallen on hard times! You'll need to clear the tangled woods with magical sparks from adventures, rescue lost villagers, rebuild theirs shops and redecorate with crafted items and loot from the wilds. Build, expand and customize your own house and fill it with a menagerie of magical familiars. The village is your personal space and a solo progression path, developing your access to cosmetics and empowering items like wands, charms and potions.<h3>Play with Friends</h3><br/>Puzzle Wizards has a full friend system and will add your Steam friends who are playing automatically. There is chat built-in to the game. You can also meet new friends adventuring and in Wizard Guilds. The game is friendly and co-operative: there's no place for negative behavior and bad language is filtered.<h3>Wizard Guilds</h3><br/>Wizards band together to form Guilds to bravely explore the dangerous middle and outer wilds, facing down scary monsters and other spirits. You'll need to help out with construction work to build the Guild Towers that will grant your guild access to the most challenging wilds and lairs. Relax in the Wizards Tavern after adventures and challenge each other wand duels. In the future we'll be adding more social 'parlor' games and tournaments, too!<h3>Seasonal Themes</h3><br/>Puzzle Wizards' content will expand with seasonal theme releases offering new adventures, loot and advanced gameplay challenges. <br/><br/>Our first theme will feature the 'Fairy Wilds'. The poor Fairies have been set about by nefarious 'SoloGro Bros' whose only goal is to profit by making mutated crops and monstrous machines. We've been testing the Fairy Wilds and expect to release this theme a month or so after early-access launch.", "metacritic": null, "released": "2022-06-29", "tba": false, "updated": "2023-08-14T04:09:21", "background_image": "https://media.rawg.io/media/screenshots/273/2735344a2affe72c6df007e045ae0e10.jpg", "website": "https://puzzlewizards.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Linux", "macOS", "PC"], "developers": ["GG Folks"], "genres": ["Adventure", "RPG", "Casual", "Massively Multiplayer", "Indie", "Puzzle"], "publishers": ["GG Folks", "tfw.dev"], "esrb_rating": "Teen"}