{"id": 960059, "slug": "kao-the-kangaroo-mystery-of-the-volcano", "name": "Kao the Kangaroo: Mystery of the Volcano (2005 re-release)", "name_original": "Kao the Kangaroo: Mystery of the Volcano (2005 re-release)", "description": "<p>Kao the Kangaroo: Mystery of the Volcano is a third installment of the epic Kao the Kangaroo 3D platformer series where the player takes control of a brave Kao, who embarks on a journey to save his homeland from an erupting volcano. Help him succeed!<br />\nMystery of Volcano is the third installment of the adventures of KAO the Kangaroo.<br />\nJoin the feisty marsupial as he bounces his way through challenging and interesting missions, whilst interacting with the inhabitants of this unique game world.<br />\nThe game features a vast and seamless game world, allowing players extensive freedom of movement and also the ability to replay favorite moments or go back to previously visited locations and finish incomplete tasks. Uncannily diverse gameplay also ensures there&#39;s never a dull moment in KAO&#39;s world. Whether it is sliding down jungle roots, parachuting into the unknown, flying a plane and fighting mid-air battles, or racing a virtual reality simulator build by one of KAO&#39;s friends - KAO takes adventure gaming to extreme new heights.<br />\nKey Features:<br />\n•   Third installment of KAO the Kangaroo 3D platforming game series<br />\n•   Bounce through challenging missions while interacting with unique game world inhabitants<br />\n•   Explore a variety of stunning environments, including lush forests, treacherous mountains, and ancient ruins<br />\n•   Vast and seamless game world with freedom of movement and ability to revisit locations and finish incomplete tasks<br />\n•   Diverse gameplay with a range of platforming mechanics, such as sliding down jungle roots, parachuting, flying a plane, and racing in virtual reality</p>", "metacritic": null, "released": "2023-04-27", "tba": false, "updated": "2023-09-18T08:25:49", "background_image": "https://media.rawg.io/media/screenshots/5e6/5e68b64dfad63e330799242ef0bd349e.jpg", "website": "https://kaokangaroo.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 15}, "playtime": 6, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tate Multimedia"], "genres": ["Action", "Adventure"], "publishers": ["Tate Multimedia"], "esrb_rating": null}