{"id": 960009, "slug": "solas-city-heroes", "name": "Solas City Heroes", "name_original": "Solas City Heroes", "description": "<strong>A Superhero Beat em’ up with a kinky twist! </strong><br/><br/>Solas City Heroes is a Beat 'em up that incorporates RPG elements and optional adult content. The gameplay consists of classic Beat em up action where you beat up endless hoards of (horny) enemies but when captured, the player can experience interactive sex encounters based on preferences made in the settings. Players can completely customize their appearance, their costumes and even their playstyle with the talents and specials.<br/><strong>The Setting</strong><br/>In a not so distant future, in a virtual world where their inhabitants can feel all the sensations going through their body, some of them have started developing superhuman powers! <br/>You are one of those, and have decided to join the Guardians, a group of heroes who always try to help others and save the city from chaos and mayhem!<br/>How will your journey go?<br/>Be warned, you are just a starting newbie with a set of very particular skills, and you may find some powerful, roguish or even sensual villains in your way!  <br/><br/><strong>Features:</strong><br/><ul><li>Mr Zed's classic Gender/Role systems that allows players to select what kind of sexual interactions they want to see. You will only see what you enjoy.<br/></li><li>Over a dozen adult content settings to enjoy your experience to the maximum!<br/></li><li>You can turn off any undesired adult content!<br/></li><li>Classic Beat em up gameplay enhanced with new RPG elements!<br/></li><li>A complete talent system so you can build your hero with your own fight style, including several different special powers!<br/></li><li>Ultra customizable character creation, including hundreds of cloth pieces, color pickers, and body sliders!<br/></li><li>Amazing original soundtrack to beat everyone in your way!<br/></li><li>Cookies and chocolate everywhere!<br/></li><li> 23 Different stages and over 40 different enemies!<br/></li><li>Over 120 different adult animations to experience in the game, including BDSM and threesome animations!!<br/></li><li>Free view camera during kinky encounters so you can watch from any angle!<br/></li><li>Have your erotic abilities, fetishes and desires influence your gameplay!</li></ul><br/>", "metacritic": null, "released": "2023-04-25", "tba": false, "updated": "2023-04-28T04:00:32", "background_image": "https://media.rawg.io/media/screenshots/5ca/5ca4efcbc583184cc1f4f6b80ebd42e7.jpg", "website": "https://skyflarestudios.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 384, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Skyflare Studios", "MrZGames"], "genres": ["Action"], "publishers": ["Skyflare Studios"], "esrb_rating": null}