{"id": 960147, "slug": "minabo-a-walk-through-life", "name": "Minabo - A walk through life", "name_original": "Minabo - A walk through life", "description": "<strong>Minabo - A walk through life</strong> is a social simulation game where you walk the path of life while your turnip grows and thrives (or not) in its social relationships.<br/><br/>Life starts when you sprout, time goes by with every step you take, and you can set your pace at any moment. You live and learn: surround yourself with other turnips and interact with them to forge your personality. Your acquired strengths and weaknesses will affect your future interactions.<br/><br/>Build your social circle by maintaining and caring for the relationships that matter the most to you, and run away from the ones that don't. You can adopt many radish-pets and spend your life with them, start a family and breed little turnips or live fast and die young. There are thousands of ways to live and none is correct! Just live as you wish! (and assume the consequences of your decisions when you rot).<br/><br/>Living and thriving in social relationships is not easy, so <strong>Minabo - A walk through life</strong> offers collectible hats that produce different effects when worn. Easily falling in love, making everyone hate you, getting an elegance plus or even changing your life expectancy...<br/><br/>In <strong>Minabo - A walk through life</strong>, no two lives are the same and when they end, every one of them will generate a summary that you can share with your friends.<br/><br/>What would you change from your past? What would life have been if you weren't rude to that one friend of your childhood? What if you spent more time with your family? <strong>Minabo - A walk through life</strong> will allow you to discover the answers if you decide to go back in time instead of starting a new life.<br/><br/><strong>Main features:</strong><br/><br/><ul><li>25 quests with dozens of goals to make every life a challenge.<br/></li><li>Free life mode: Each life and character is randomly generated. No two lives are the same!<br/></li><li>Explore interpersonal relationships and build your social circle. Realistic relationships counselled by psychologists!<br/></li><li>Surround yourself with other turnips and radish-pets!<br/></li><li>Appealing visuals for all audiences, charming characters with hundreds of animations and seasonal backgrounds.<br/></li><li>Share your life's summary with your friends.<br/></li><li>Start a new life or change your past. You can restart any life to change whatever you'd like (or at least try)</li></ul>", "metacritic": null, "released": "2023-04-28", "tba": false, "updated": "2023-09-30T20:29:16", "background_image": "https://media.rawg.io/media/screenshots/97f/97f5023e9460ace746d05b4e6225f326.jpg", "website": "https://www.devilishgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["DevilishGames"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["DevilishGames"], "esrb_rating": null}