{"id": 96019, "slug": "hyperskill-hard-but-fair", "name": "Hyperskill - Hard but fair", "name_original": "Hyperskill - Hard but fair", "description": "Hyperskill<br/> Hard but Fair<br/><p>(This is the free version. The full game is still in development.)<br/></p><p>Amberlight Hyperskill is a fast paced top-down shooter.<br/> A game about reflexes, split second decisions and advanced skills.<br/> Upgrade your various abilities, evade dangers and conquer the enemy.</p><p>This game is hard, but fair. It's not about luck, it's about skill.<br/> Enjoy the rush of battle and give your best to beat the challenges of Amberlight Hyperskill.<br/> <br/> Discover and use synergies of your abilities. Dash into a group of enemies, unleash your shockwave, destroy bases with your Fireflies and replenish your shield. Jump away from danger, release a barrage of rockets and clear the remains with your deadly beam weapon.<br/> You are an overwhelming force of destruction, but the enemies will test your limits.<br/> <br/> <strong>Story</strong><br/> Dive into the dark, cyberpunk space of the Hypernet and it's many dangers. Meet the denizens of this virtual world and the broken AI holding them captive. Uncover the rise and fall of this artificial intelligence and the hope and despair of humanity.<br/> You will face hard challenges and fail many times, but if you give your best, you can succeed.</p><p> <strong>WARNING</strong><br/> This game is not meant for casual players. The levels and enemies are designed to offer a real challenge for true gamers.<br/> </p><p>This is the free version of Amberlight Hyperskill. Only a part of the story is unlocked and you can not morph your abilities.</p><p>If you like the game, connect on Facebook to get informed about the latest news: http://facebook.com/Ravery.net/<br/></p><p>If you REALLY like this free game, consider a tip. ;-)<br/></p>", "metacritic": null, "released": "2017-03-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/554/5540206759a1bf8262e2696a8ac4cf77.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ravery"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}