{"id": 960128, "slug": "the-swordsmen-x-survival", "name": "The Swordsmen X: Survival", "name_original": "The Swordsmen X: Survival", "description": "The Swordsmen X: Survival is a martial art open world adventure game that combines survival and crafting. Developed with UE4, it creates a vivid world covering an area of 256 square kilometers. Cultivate yourself by collecting, crafting, exploring and other methods. Confront complex natural environment and challenges from other warriors. Build various ancient architectures of Chinese style and homes of your own. Create and master unique martial arts. Encounter numerous challenges and random events. Launch a new martial art career and eventually become a well-known hero in this world.<br/><br/><strong>A Well-Crafted Martial Art Open World </strong><br/>Developed with UE4, The Swordsmen X: Survival aims to present a vivid open world with high-quality lighting effects and a real martial art atmosphere. Classic scenes such as Honglian Temple, Jiangzhou City, and Niujia Village will appear in a new form. Enjoy every single scene in different atmospheres created by dynamic weather.<br/><br/><br/><strong>Survive in This Vivid World</strong><br/>Ruthlessness is the true color of this world. In order to cope with extreme heat and severe coldness, you need to store as much food as possible and make clothing by gathering and hunting. You also need to master skills such as forging, weaving, carpentry and cooking. In some cases, threats from natural environment are far more brutal than those from enemies. Bear it in mind that the only way to win is to survive.<br/><br/><br/><strong>Acquire and Combine Martial Arts</strong><br/>Wanna fly over the wall, control swords and use inner strength? Try to find the concerning scrolls scattered everywhere in this world, including those dangerous caves and temples. With help of these skills, you can survive and explore in a better way, but it depends on you how to use and combine them.<br/><br/><br/><strong>Create Martial Arts and Clans of Your Own</strong><br/>Already mastered some martial arts and wanna establish your own clan? No problem! Use what you learnt to carry out various combinations based on the rules and enjoy a changeable combat experience!<br/><br/><br/><strong>Utilize Weapons With Wisdom</strong><br/>Hand-to-hand combat is inevitable, while bow and arrow are also necessary. You can wield melee weapons to show your strength, but your enemy can use long-range weapons to suppress you. You may be able to repel the opponent by throwing objects in the last second, however, you're likely to get into a trap set by the enemy while chasing him in the next second. Your choice is the most powerful weapon!<br/><br/><br/><strong>Build Homes and Compete for Territories</strong><br/>No matter how many achievements you've got, you will still need a shelter. Use your creativity to build your home from zero. Beware of monsters intending to invade and enemies trying to occupy your home. Wisely choose the construction site, set up traps, and protect your territory!<br/><br/><br/><strong>Explore Ruins and Challenge Bosses</strong><br/>There are many mysterious underground palaces hidden in this world, such as the Loulan ruins in the northwest and the military base in the southeast. Discover what happened to these sites, defeat bosses guarding there and find the buried treasures.<br/>", "metacritic": null, "released": "2023-04-27", "tba": false, "updated": "2023-05-01T02:22:26", "background_image": "https://media.rawg.io/media/screenshots/d69/d699d77b7e459a512202496f2c882386.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 532, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["上海润梦网络科技有限公司"], "genres": ["Action", "Adventure", "RPG", "Massively Multiplayer"], "publishers": ["方块游戏(CubeGame)"], "esrb_rating": null}