{"id": 960184, "slug": "eternamine", "name": "EternaMine", "name_original": "EternaMine", "description": "EternaMine is a game focused around mining, mining will earn you various different currencies which can be used to upgrade your gear and unlock various things.<br/><br/> <br/>There's different mines to explore and tons of different ores to see. There's three different mine types in Eternamine:<br/><ul><li> <strong>Standard mine </strong> - A standard \"square\" mine that will refill once it's been mined out enough, good for beginner miners<br/></li><li> <strong>Deep mines</strong> - Strange mines that seems to go infinitely deep with better and better ores the further down you go. Some say there's treasure buried deep below...<br/></li><li> <strong>Dark mines</strong> - Magical mines that only open up every now and then, make sure you go in there when they do, because the treasures they hold are truly something else. Make sure your sword is in top shape though as you won't be alone in there...</li></ul><br/> <br/>Your pickaxe is your most important tool in this world. It can be upgraded with tons of upgrades, some that will increase it's strength, speed, reach as well as lots of \"power\" upgrades. Along with upgrading your pickaxe, it can also be pimped out with various skins and particle effect to make your mining adventure as flashy as possible<br/><br/> <br/>The dungeons are areas where you can gain massive wealth if you're brave enough. With a dungeon key, you can enter a dungeon and take on the enemies that reside there, each defeated enemy will give you some rewards and after you have defeated a certain amount, the king of that dungeon will spawn...<br/>Make sure you're ready to take on a dungeon before entering it, as a key for that dungeon will be consumed every time you enter.<br/><br/> <br/>Your sword is your most trusted companion alongside with your pickaxe. In order to defend yourself from the enemies in the dungeon and the dark mines, you will need a good and reliable sword. Your sword can be upgraded in various ways as well as pimped out with various skins and particle effects, everything to make your fighting as flashy as possible.<br/><br/> <br/>In the world of Eternamine, there's lots of help to get from the various npc's in the world. All npcs have unique personalities and all help out in different ways. There's the shopkeeper, the pickaxe master, the dungeon master, the crate master, the mine master and many many others.<br/><br/> <br/>The world of eternamine has lots and lots of different items to use and utilize to secure the biggest wealth you could imagine, items vary in rarity and can be obtained in various different ways. Some items can be opened for rewards, some will give you temporary buffs, others will help you clear out a mine quicker.<br/> <br/> <br/>Not only can you gain money and tokens in Eternamine, but the game has additional currencies.<br/>Gems are a more rare currency and can for example be used in the shop to buy rare items.<br/>For every level you gain in Eternamine, you gain a skill point which can be used in the game's skill tree for upgrades which are more powerful than the standard upgrades.", "metacritic": null, "released": "2023-04-28", "tba": false, "updated": "2023-05-01T03:34:24", "background_image": "https://media.rawg.io/media/screenshots/9be/9be6ec8ac2e755942a405d9676a68052.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Seyloj"], "genres": ["Action", "Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Seyloj"], "esrb_rating": null}