{"id": 960216, "slug": "sex-room-2-18", "name": "SEX Room 2 [18+]", "name_original": "SEX Room 2 [18+]", "description": "<strong>SEX Room 2 [18+]</strong> is a steamy and seductive casual clicker game. <br/><br/>That is an exciting game that allows you to immerse yourself in a world of limitless pleasure and luxurious sexual adventures. The game features a multitude of diverse sexual situations between two girls who use various devices and techniques to reach unimaginable heights of satisfaction.<br/><br/>In the game, you will watch two girls who enjoy each other's company and use a variety of tools to achieve ecstasy. The player interacts with the game through a clicker, where each click brings more pleasure to the girls and leads them to a more erotic mood. During the game, the player will have access to a variety of tools such as dildos, vibrators, and more, allowing you to control the erotic adventures.<br/><br/>SEX Room 2 [18+] offers unforgettable visual impressions thanks to its excellent graphics and intuitive interface. The game contains a large number of sexual situations that will provide a lot of pleasure and lift your mood for the whole day.<br/><br/>This game is created for those who are not afraid to experiment and seek new sexual experiences. SEX Room 2 [18+] offers plenty of opportunities for everyone to find what they really like. Collect the maximum number of points and unlock new sexual tools and possibilities.<br/><br/>Therefore, if you are looking for an exciting and erotic virtual game that will allow you to immerse yourself in a world of pleasure, then SEX Room 2 [18+] is the perfect choice.<br/><h3>Features:</h3><ul><li>Simple and engaging clicker gameplay mechanism<br/></li><li>Build your reputation and attract a large audience to increase your earnings<br/></li><li>Interact with fans and perform various sexual acts to earn virtual currency<br/></li><li>Fast-paced and intuitive gameplay<br/></li><li>A journey of sexual exploration, virtual stardom, and financial success.</li></ul><ul><li>Stunning graphics and animations that bring the world of webcam girls to life<br/></li><li>Explicit content and mature themes, suitable only for players 18 years and older</li></ul>", "metacritic": null, "released": "2023-04-29", "tba": false, "updated": "2024-03-28T07:32:57", "background_image": "https://media.rawg.io/media/screenshots/deb/debd65bf3652f2e1434ad3f09cf766ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "beaten": 1, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 366, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Pirates Of The Digital Sea"], "genres": ["Simulation", "Casual"], "publishers": ["Pirates Of The Digital Sea"], "esrb_rating": null}