{"id": 960204, "slug": "darkblood-gaiden", "name": "DarkBlood -Gaiden", "name_original": "DarkBlood -Gaiden", "description": "-The blood story is taken over again-<br/>\n<br/>\r\nAt the end of the world, there was a tower soaring high into the sky. <br/>\r\nThe tower was said to hold treasures that could grant wishes, attracting many adventurers, but none of them ever returned. <br/>\r\nEventually, the tower became known as the \"Tower of No Return,\" and the king sent a group of knights to investigate the tower.<br/>\r\nThe tale of DarkBlood takes over once again...<br/>\n<br/>\r\n【New battle system】<br/>\r\nBattles are command-selective. The skills that can be selected during battle depend on the weapon that is equipped. Combining weapons and magic that match the element of the enemy will give you an advantage in battle.<br/>\n<br/>\r\n【Beautiful graphics】<br/>\r\nThe graphic design this time is also by Ginoya, who has provided dot pictures throughout the series. The beautiful graphics, which have reached the realm of art, will enhance the adventure.<br/>\n<br/>\r\n【Free character build】<br/>\r\nDepending on how the character's status is assigned, the character can be an attack-oriented warrior, a magician who makes full use of magic, a well-balanced magic swordsman, and so on.<br/>\n<br/>\r\n【Various events】<br/>\r\nIn addition to vicious monsters, a variety of events await you as you explore the tower, including merchants who buy and sell items, hunters who try to kill you, and the release of traps in treasure chests.", "metacritic": null, "released": "2023-04-28", "tba": false, "updated": "2023-05-01T03:58:47", "background_image": "https://media.rawg.io/media/screenshots/231/2311e6cd3bac4e5372b1851f56e680c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 280, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["toihaus"], "genres": ["RPG"], "publishers": ["toihaus"], "esrb_rating": null}