{"id": 960290, "slug": "wu-qian-wu-shi-nipianowodan-ku", "name": "午前五時にピアノを弾く", "name_original": "午前五時にピアノを弾く", "description": "<h3>Introduction</h3>.<br/>In the early hours of the morning, around 5 a.m., there is sometimes a thick fog.<br/><br/>In addition, there is a story about people who went out on a foggy day and never came back.<br/>People are not sure if this is true or not. <br/>However, most people in this town do not go out on foggy mornings.<br/><br/>She, who lives in a log house in the mountains, loved such fog.<br/>On foggy mornings, she always goes for a walk.<br/>But she doesn't really know why she likes fog.<br/>So, although she likes fog, she does not like foggy mornings.　<br/><br/>She wanders around in the fog as if she is attracted and driven by something she does not understand.<h3>Character</h3>.<br/>The main character is a girl who likes fog.<br/>She lives with her family in a log cabin in the mountains.<br/>She loves this house and the fog, where she has lived since she was a child, as much as she loves the smell of the trees, the garden with its small flowers, and the forest she can see from her window.<br/><br/>But soon she will be moving out of this house.<br/>She doesn't want to forget the time she spent here - she thinks as she walks through the fog.<h3>System</h3>.<br/>Wandering through the fog until 8 a.m.<br/>\"Piano at 5 a.m.\" is a text adventure game.<br/><br/>A girl leaves her house at 5 a.m. and encounters various things in the fog, and she always chooses one of two options to proceed.<br/><br/>Depending on the choice, the four values of \"Drowsiness,\" \"Thirst,\" \"Madness,\" and \"Charge\" will be increased or decreased.<br/>If you can make a choice so that these four do not reach their maximum limit and reach 8:00 a.m., the story will progress.<h3>Staff</h3>.<br/>Planning, Production, Scenario :<br/>Kazuhide Oka<br/><br/>Event Planning :<br/>Aoki<br/><br/>Character Design / Main Visual :<br/>fina<br/><br/>Music :<br/>Kano", "metacritic": null, "released": "2023-05-01", "tba": false, "updated": "2023-05-05T02:55:57", "background_image": "https://media.rawg.io/media/screenshots/152/15219b1818defccfe6ba07fb26d0bfcf.jpg", "website": "https://kazuhideoka.net/game/piano5am/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Kazuhide Oka"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Kazuhide Oka"], "esrb_rating": null}