{"id": 960269, "slug": "vr-drums-ultimate-streamer", "name": "VR Drums Ultimate Streamer", "name_original": "VR Drums Ultimate Streamer", "description": "Not a perfect drum simulator well defined and you can do some pretty cool things with it, it also has MIDI support too.<br/><br/>Drum in multiple locations like a rock concert, overcome stage fright or just build a cool looking drum kit to play on. You will need to play your own music (MP3) to drum along while using this VR drum set, this is not a rhythm game, this is a VR drum kit, you can preform on, move around, add pieces, modify or just make a sick drum kit. Check out the Alien Cyber Coat YouTube page or just Google \"VR Drums Ultimate Streamer\" for drumming video demos showing this apps capability in action.<br/><br/><ul><li>Detail gone into creating realistic looking drums and cymbals.<br/></li><li>Functional bass drum &amp; hi-hat cymbal (Open and close with your VR controller, gamepad controller, keyboard keys or mouse buttons). Plenty of ways to get a pedal working or rig up your own.<br/></li><li>Midi output option. (Use a custom midi controller, add your own sounds to each drum effect)<br/></li><li>Drum builder tool. Add as much drums, cymbals, cowbells, splashes and china as you wish. Move them where you want.<br/></li><li>Customize your scene.<br/></li><li>Modify pitch and  volume of each drum.<br/></li><li>Free moving GrabCam camera. (Grab your camera yourself or use our camera man)<br/></li><li>Green screen mode (Put yourself in the game. External green screen software setup knowledge required, OBS, etc.)<br/></li><li>Realistic instrumental sounds</li></ul><br/>Open the hi-hat, close it, strike it open or closed, plus some extra goodies. Plenty of ways to get a pedal working or rig up your own.<br/><br/><br/><br/>Setup your drummer to fit your video and style. Choose from multiple avatars and options.<br/><br/><br/><br/>This program is in beta, please contact our support email with any problems or issues you may have.<br/><br/><strong>Question: When is this coming to the Vive?</strong><br/>Answer: Already built in XR. Vive XR launch option is in this current Steam build for testing only. Headset should work, hands not fully tested and may not track. An updated version with full support is planned soon. We have a couple keys for Vive testing, contact us if your are interested.<br/><br/><strong>Question: Are these drums pressure sensitive?</strong><br/>Answer: Not yet but on the way, some instruments play a different sound depending where it's striked. This is in beta and still being tested and built upon. <br/><br/>", "metacritic": null, "released": "2023-05-02", "tba": false, "updated": "2023-05-05T02:29:26", "background_image": "https://media.rawg.io/media/screenshots/e8e/e8e02c55284047f27c806f6696284842.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 347, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Alien Cyber Coat"], "genres": ["Simulation"], "publishers": ["Alien Cyber Coat"], "esrb_rating": null}