{"id": 960267, "slug": "knight-crawlers", "name": "Knight Crawlers", "name_original": "Knight Crawlers", "description": "You are a Crawler, struggling to survive the battles that unfold behind every dark portal. Your skill cards and weapons are your only bastions against the forces of the horde. In this physics-based ARPG, each crawl is made unique through the choices you make. Hunt for loot, craft powerful equipment, and head into arenas to battle against other crawlers.<br/><br/><br/><br/><br/><br/><strong>Dodge, Damage, and Defeat Unique Enemies</strong><br/>Fight your way through hordes of enemies with a physics-based combat system that keeps you on your toes. Dodge melee attacks, counter long-range magic, and avoid surprise explosions as you brawl your way through dungeons in ranged or close-quarters combat, with each battle giving more opportunities for powerups and customization. <br/><br/><br/><br/><strong>Control Your Battles</strong><br/>Whether your playstyle is a tactical takedown of a few choice combatants or the pure mayhem of battling a room full of warriors all at once, Knight Crawlers lets you control the way you play. Spawn enemies and create battles that complement your favorite strategies and make your advancement through the realms slow and steady or chaotic and heart-pounding… or a little bit of both! Just be prepared for a few curveballs along the way.<br/><br/><br/><br/><strong>Customize Endlessly</strong><br/>From altering you character’s style and appearance to choosing dominion points, skill cards, and weapons, each choice makes every crawl unique.<br/><br/><strong>Become a Powerful Crafter</strong><br/>Weapons choices vary from large, mighty hammers to long-handled flails and ranged options like wands, staves, and bows, so there is no limit to combat style or plan of attack. Pick your poison and start powering up as you defeat your enemies and gain skills and customizations to prepare you for battles against future foes.<br/><br/><br/><br/><strong>Crawl and Brawl Alone or Fight Against Friends</strong><br/>Crawling through the realms doesn't have to be a lonely affair. Enter PvP arenas to test your skills against other crawlers or team up to fight the horde together!<br/><br/>", "metacritic": null, "released": "2023-05-04", "tba": false, "updated": "2023-05-05T02:25:57", "background_image": "https://media.rawg.io/media/screenshots/aa6/aa6741885c8a5647b9b8c522533d0ba1.jpg", "website": "https://knightcrawlers.game/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 554, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Good Morning Games"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["The Iterative Collective"], "esrb_rating": null}