{"id": 9602, "slug": "a-house-of-many-doors", "name": "A House of Many Doors", "name_original": "A House of Many Doors", "description": "<strong>Welcome to the House. You are not welcome.</strong><br/><br/>Explore the House, a parasite dimension that steals from other worlds, in a train that scuttles on mechanical legs. <br/><br/>Uncover secrets. Open locked doors. Lead a crew of dysfunctional characters. Write procedurally-generated poems. Fight in turn-based combat. Explore a strange new setting, dripping with atmosphere, crusted with lore. Escape. Escape. Escape.<br/><br/>You are an explorer, poet and spy, launching yourself into the unknown in search of adventure. Rig an election in the city of the dead. Visit a village lit by the burning corpse of a god (careful not to inhale the holy smoke). Sell your teeth to skittering spider-things for a moment in their library. Over 90 bizarre locations await discovery in the dust and the dark.<br/><br/><strong>A House of Many Doors</strong> is a 2D exploration RPG that takes inspiration from Sunless Sea, China Mieville, Planescape: Torment and Italo Calvino's Invisible Cities. It features over 300,000 words of branching original story and over 770 trillion bad poems.WARNING.Please be aware that this game contains the following romance options:<br/><ul><li>Men.<br/></li><li>Women.<br/></li><li>Goatman.<br/></li><li>Ten million crows.<br/></li><li>An oil rig.</li></ul><br/><strong>A House of Many Doors</strong> has benefited from the kind support and partial funding of Failbetter Games, makers of Sunless Sea and Fallen London.", "metacritic": null, "released": "2017-02-03", "tba": false, "updated": "2019-08-28T22:14:52", "background_image": "https://media.rawg.io/media/screenshots/c79/c790125a561c0704401d4f4b2fc6b8ab.jpg", "website": "http://www.pixeltrickerygames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 7, "owned": 116, "toplay": 10, "dropped": 3}, "playtime": 4, "achievements_count": 33, "ratings_count": 4, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 4, "platforms": ["macOS", "PC"], "developers": ["Pixel Trickery", "pixeltrickery"], "genres": ["RPG", "Indie"], "publishers": ["Pixel Trickery"], "esrb_rating": null}