{"id": 960311, "slug": "as-cronicas-de-mar-ceu", "name": "As Crônicas de Mar Céu", "name_original": "As Crônicas de Mar Céu", "description": "Welcome to the world called The Chronicles of Sea Sky, an epic fantasy RPG that takes you on an exciting journey through a vast world full of danger, mystery and adventure. With detailed graphics, an immersive soundtrack and an epic story filled with exciting twists, The Chronicles of Sea Sky is an unforgettable experience for RPG fans.<br/><br/>Assuming the roles of several unusual characters, you embark on a quest to save the world from imminent destruction. Along the way, you'll meet interesting characters, face dangerous monsters, and discover ancient secrets that will change your life forever.<br/><br/>With a turn-based battle system, you'll have to use your tactical skills to overcome the toughest enemies. In addition, you will be able to customize your characters with unique abilities (all have a special ability at Lv. 35), powerful equipment and devastating spells.<br/><br/>Prepare to be lost in a fantasy world with The Chronicles of Sea Sky, where your courage and skill will be tested to the fullest in an unforgettable adventure.<br/><br/><br/><strong>CONTROLS:</strong><br/>Z / X<br/>Q - Map<br/>Shift - Run<br/>Arrows - Directional keys<br/><br/><br/>GAMEPLAY: <br/><br/>The game is based on the story of several characters from different Kingdoms that come together for the same goal. Bring peace to the world. However, in this period, the game tells stories of the past, presents how everything happened, explains the reason for the current war and the different ideologies of thoughts of the characters. While some fight for honor, others seize the moment for their inmates. From comic and fun characters to the most serious and dark ones.<br/><br/>The fights are done in turns and can have up to 4 characters in the battle arena. The game has Knight, Swordsman, Martial Artist, Mage, Druid, Archer, among others... The ideal is to level up with your characters. If the player leaves through the story, there are high chances of dying. A tip is to buy potions and antidotes throughout the game, always remember this. Focus on the level of the characters and save the game, in case you die you don't have to return, and be careful with the \"bosses\", some may even seem to be passive, but have some hidden ability.<br/><br/>The objective of this game is to stir true RPG fans, as the stories are connected, at the same time that romances, fights, funny and adventurous scenes arise. Being parts where you won't need to fight monsters to follow your path, but be smart to go through the challenges ahead of you. -- \"I won't give spoilers\"<br/><br/>And finally, fighting is good. But, fight all the time, you get tired. For this reason, he made a space of time between one fight and another, so the character can walk more before another fight appears. We've made improvements to gear and accessories so they make sense with every fighting style. So that the player can balance an archer's attack with a knight's defense or even take advantage of the martial artist's agility. The game is very complete and thought out, both in the battles and in the scenes, especially in the scenes where the player is involved.<br/><br/><br/><strong>Main features:</strong><br/><ul><li>Status<br/></li><li>Skills<br/></li><li>History<br/></li><li>Battles<br/></li><li>Missions<br/></li><li>Conversations</li></ul><br/>https://detonadoascronicasdemarceu.blogspot.com/2023/03/controles-z-comando-principal-x-menu.html", "metacritic": null, "released": "2023-05-01", "tba": false, "updated": "2023-05-05T03:22:32", "background_image": "https://media.rawg.io/media/screenshots/7d9/7d9ce153f947372002fa0abc175ea76c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Marcel Diogo Quadros Fernandes"], "genres": ["Adventure", "RPG"], "publishers": ["Marcel Diogo Quadros Fernandes"], "esrb_rating": null}