{"id": 960314, "slug": "criminal-archives-alphabetic-murders-collectors-ed", "name": "Criminal Archives: Alphabetic Murders Collector's Edition", "name_original": "Criminal Archives: Alphabetic Murders Collector's Edition", "description": "Sometimes there is far more than at first glance and accidents are not accidental at all. Enjoy thrilling police investigation “Alphabetic Murders” of “Criminal Archives” detective games series! The difference between a good detective and a bad detective is strength of character and the ability to act without thinking for more than 5 seconds. Do you possess these qualities? You are approached for help on a case by Melinda Watson, a local constable. You get to work on the case and quickly find new clues that link the three victims. They were acquaintances, or at least business associates. The further you go, the more it becomes apparent that these murders are far from random. You see a masked man break into the home of one of the victims to steal his documents. His wife Norma is shocked and says she didn't even know her husband had such important papers. Can you tell the truth from the lies? Gather your wits for an unforgettable detective story in this pulse-pounded new Hidden-Object Puzzle Adventure!<br/>\n<br/>\r\nThis Collector's Edition includes: <br/>\n<br/>\r\n🔍\t Bonus Chapter!<br/>\r\nAfter completing the main story, unlock another quest that will excite you and challenge your detective skills! You'll have to deal with a sudden allergy that occurred to a celebrity after trying on a dress, as well as save your friend from false accusations!<br/>\n<br/>\r\n🔍\t A variety of achievements!<br/>\r\nGet ready for exciting puzzles, tricky mini-games, and a variety of hidden objects! If you act like a true detective, you'll earn many achievements that will highlight your success!<br/>\n<br/>\r\n🔍\tIntriguing plot!<br/>\r\nSpend your time with pleasure, immersed in the detective world! Dynamically developing plot, atmosphere, puzzles and much more will not leave you indifferent!<br/>\n<br/>\r\n🔍\tCollectibles!<br/>\r\nLook for collectibles in each colorful location and find hidden items. Prove that your detective skills are invaluable!", "metacritic": null, "released": "2023-05-01", "tba": false, "updated": "2023-05-05T03:26:30", "background_image": "https://media.rawg.io/media/screenshots/b1a/b1abc8ff9bd691ee3c3f1862c025b274.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 305, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Do Games"], "genres": ["Adventure", "Casual"], "publishers": ["Do Games"], "esrb_rating": null}