{"id": 960372, "slug": "project-infogrid", "name": "Project: InfoGrid", "name_original": "Project: InfoGrid", "description": "In this thrilling 2.5D Rocket Game, players must navigate their rocket through a perilous obstacle course while avoiding moving hazards and obstacles. With precision timing and skillful maneuvering, players can blast through the obstacles and reach the other side of the screen unscathed.<br/><br/><br/><br/><strong>Finland 2106:</strong><br/>The year in 2106. The entirety of the moon's surface has finally been explored, now attempting to venture deeper into their celestial sibling they create Project: InfoGrid. Due to unknown reasons, InfoGrid was created due to on foot exploration being deemed \"Too dangerous.\" It's your job to take control of a remotely piloted rocket through various maze-like tests. Every test challenging you against the normal and \"paranormal.\" If all is well, you may be the reason why humanity can venture further into the stars.<br/><br/><br/><br/>As you progress through each test, the environment will slowly become more and more unfriendly and unfamiliar. You must act on your instincts well. Learn when to be patient or to be hasty as these tests will test you against any \"paranormal anomalies\".<br/><br/><br/><br/>Just remember, mistakes are unforgiving, for the king does not wait. Best of luck pilot, we wish you well during your testing. For if you succeed, humanity may be able to move to further horizons.", "metacritic": null, "released": "2023-05-03", "tba": false, "updated": "2023-05-05T04:41:57", "background_image": "https://media.rawg.io/media/screenshots/608/608229d35ed17abe8abf259080dc8e23.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cameron \"Kathryne\" Whitlock"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Cameron \"Kathryne\" Whitlock"], "esrb_rating": null}