{"id": 960334, "slug": "the-magic-world", "name": "The Magic World", "name_original": "The Magic World", "description": "You start in the dungeon of the Stone Castle. The castle is surrounded by the enemy army of King Livard. Your teacher, the Grand Magist of water Magic, Nikolai Theron, has ordered you to come to him to receive your first instructions...<h3>Destroy a lot of monsters</h3>The castle and the surrounding area are teeming with the most unimaginable monsters, generated by it is not clear what. Hordes of monsters can attack you from anywhere!<h3>Explore mysterious mazes</h3>Traps, mazes, riddles, the castle is filled with many dangers and treasures. And what happens if you pull this lever? Somewhere in the distance, the sounds of a stone slab rising can be heard...<h3> Save the kingdom!</h3>Only you can save the kingdom from the attack of the terrible King Livard and his army. The eastern city of Tilkenburg turned into ruins, leaving only the last monument of the kingdom - a Stone castle.<h3> This is a party RPG!</h3>You play as a young magician Egor, who is a student of the Grand Master of water magic Nikolai Theron. Assemble a team of fighters, develop their abilities and skills. A weak squad will die from a single blow of a dead frog, and a strong one is able to destroy several red dragons…<h3>Magic</h3>Learn magic, develop your magical powers! Ball lightning or fireball? Or maybe you are an adept of the world and want to develop protective and healing spells? The choice is yours. But remember, the monster that is a dead monster is good.<h3>Inventory</h3>Find or buy items, from weapons to magic potions. You can use rings, tools, armor, scrolls, potions. ingredients and many other useful items in the game. Keys open doors, letters contain important information, a magic potion restores magic, and a hammer breaks through the head.<h3>Visit shops, taverns, churches and residential buildings</h3>Trade, communicate, complete tasks and quests, study.<h3>Dolby Digital 5.1 / 7.1</h3>The game supports surround sound environment, be sure to try to play it using 5.1 speakers, then you will fully immerse yourself in the atmosphere of a scary dungeon...<h3>Controls</h3><ul><li>WASD or Keyboard arrows - party moving<br/></li><li>space or A - attack<br/></li><li>mouse - click everything<br/></li><li>ENTER - turn base battle<br/></li><li>1,2,3,4 or click on party head icon - choice party man to open door or chest</li></ul>", "metacritic": null, "released": "2023-05-02", "tba": false, "updated": "2023-05-05T03:51:44", "background_image": "https://media.rawg.io/media/screenshots/490/490fdee51060c8a7aaaa36988151b54e.jpg", "website": "http://flame-dragons.com/%d0%b2%d0%be%d0%bb%d1%88%d0%b5%d0%b1%d0%bd%d1%8b%d0%b9-%d0%bc%d0%b8%d1%80/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 405, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Flame-Dragons", "Dmitriy Belonovskiy"], "genres": ["Adventure", "RPG"], "publishers": ["Flame-Dragons"], "esrb_rating": null}