{"id": 960403, "slug": "hazard-hill-idle", "name": "Hazard Hill Idle", "name_original": "Hazard Hill Idle", "description": "Hazard Hill Idle is a small city builder, Buy, Sell and Expand to maintain your population from natural disasters that can strike at any time.<br/><br/>You are a new and upcome mare of a small town, you have been tasked on building a new city in a block of land between huge highways. After being sold this block of land you find out it is a very hot zone for extreme weather disasters. With the small amount of money, you have left you decide to stay and make the best of it. Grow and expand your city to new hights as you battle the extreme weather and other challenges that owning a city comes your way.  <br/><br/><strong>Game Play</strong><br/>Play God and treat your population the way you want, move your buildings around the map as you build your ideal world. As more and more people enter your city the more buildings you will have to build. Keep your population happy by building shops and airports, keep your city safe with a standing army and a base to help repair and keep people safe when the disasters hit.  <br/><br/><strong>Buildings</strong><br/>Buildings play a big role in Hazard Hill Idle as they are your main source of population and money. As you progress through the game you will be able to build more buildings.<br/><br/><strong>Disasters</strong><br/>Disasters can strike at any time, and it will damage your building, in some cases, kill or scare off some of your population.", "metacritic": null, "released": "2023-05-04", "tba": false, "updated": "2023-05-05T05:24:27", "background_image": "https://media.rawg.io/media/screenshots/b78/b7869d91be6da4805bc7874ca1f1275e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Disco Entertainment", "SlowSnailStudio"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Disco Entertainment"], "esrb_rating": null}