{"id": 960461, "slug": "psionic-awake", "name": "Psionic Awake", "name_original": "Psionic Awake", "description": "In the Psionic Awake, You can call company explore the wildland; By the way, you also provoking the powerful demon king. At night, the demon army that you played with will get more and more angry on their bed, they will attack your fortress to Release their anger!<h3>Double major with waifu  Shot million bullets</h3><ul><li>We currently has four beautiful girl; they can use both magic and physical way to fight. We will add more waifu in the future! <br/></li><li> Our game use the latest DOTS code, even the old, low spec; outdated computer can still maintain stable frame rates, no matter how many demons in the screen！Amazing！</li></ul> <br/><h3>Identify your bullet  Explore the wildland</h3><ul><li>You can upgrade your skills by killing demons and collecting resources in the wildland, and clearing nests can also get treasure. Any combination of skills can be stacked, and you can design the shape of the bullet freely. </li></ul><br/><h3>Multiple way to play  Summon the dragon</h3><ul><li>In the planet Gaia, you can make friends by visiting the tavern. You can bribe your friends to join you in dangerous adventures.。<br/></li><li>In the cute Pony planet, you can ride on magical ponies and become unstoppable in battles by accessing the \"stables\". <br/></li><li>You can summon the \"Workshop Guardian\" by using the \"Invention Workshop\" in the \"Awaken\" section.<br/></li><li>You can also choose \"Wishing Come True\" to collect all seven Dragon Balls and make a wish.</li></ul><br/><h3>Challenge the demon king  Fight against demon army</h3><ul><li>On the perilous map, there is also the \"Demon King Challenge\" feature, which allows you to defeat the Demon King and get precious treasure. Although that will be extremely hard, but the peerless beauty will never shrink from the challenge! <br/></li><li>At night, a strong soldier and defensive structures are essential in a battleground. The fortress feature in the game allows you to build and fortify your defenses, making it possible to face and even conquer a massive enemy army. With this feature, you can strategize and protect yourself even in the darkest hours of the night.</li></ul><br/><h3>Fight with pony  Kill them all</h3><ul><li>This game is far from lonely! You can count on the help of magical ponies and stallions to help battle and smash your opponents. Don't forget about the beloved WULI KUN horse, who is also available to ride and assist you in your battles. With so much support and company, you never have to venture into battle alone!</li></ul><br/>", "metacritic": null, "released": "2023-05-04", "tba": false, "updated": "2023-05-08T02:28:28", "background_image": "https://media.rawg.io/media/screenshots/fcf/fcf7bd297dd46ec734b7d4553912478d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mighty Cat"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["INDIECN"], "esrb_rating": null}