{"id": 960458, "slug": "hong-kong-obscure", "name": "Hong Kong Obscure", "name_original": "Hong Kong Obscure", "description": "TOP SECRET<br/>*REDACTED*<br/>DATE : *REDACTED*<br/>FROM : *REDACTED*<br/>TO : *REDACTED*<br/><br/>⚠️ TOP SECRET ⚠️<br/>🔒 SI-OBSCURE // TK-OBSCURE 🔒<br/><br/>███████ ██ █████████ █████████████ ████████ ████ █████████ ████████ █████████ ████████ ██ ██████████████ ██████ █ ██████-█████ ████████.<br/><br/>PROJECT: HONG KONG OBSCURE <br/><br/>The following document contains information from the *SI-OBSCURE* compartment and the *TK-OBSCURE* subcompartment. Access to this document is strictly limited to personnel with TOP SECRET clearance and a need-to-know basis.<br/><br/>This document describes the objectives, features, and requirements of a classified project codenamed \"Hong Kong Obscure\". This project is a covert operation to develop and deploy an atmospheric game with support for desktop play and virtual reality. The game is intended to test the psychological effects of exposure to a simulated environment that is devoid of plot, start, or ending, and that is filled with mysteries and secrets.<br/><br/>The game is set in an empty, gritty Hong Kong district called \"2nd Dust\" at night. The player is spawned in a random location and given a magic flashlight, a magic frisbee, and a projectile gun. The player has to use the magic flashlight to uncover and interact with the hidden elements that populate the surrounding streets, corners, dark alleyways. The atmosphere is painted with ambient drone music and psychedelic shader effects that create a hallucinatory and mind-bending experience.<br/><br/>The game is powered by [REDACTED] Engine 5.1 and utilizes cutting-edge technologies like Nanite, Lumen, Virtual Shadow Maps, Virtual Textures, and Signed Distance Fields. These technologies deliver an impressive visual fiesta that will blow the player's mind. However, they also demand a high level of hardware performance. The game can be played comfortably at 40fps in VR with Radeon 5700XT and with VR sub-frame interpolation it feels surprisingly smooth. The game can also be played 100% without any VR devices, as a regular PC game. There are graphical options available to help with performance.<br/><br/>The game does not have any explicit goals or objectives. The player is free to explore the environment at their own pace and discover *REDACTED*. The game is designed to induce a state of curiosity, wonder, and awe in the player, as well as a sense of isolation, loneliness, and mystery. The game is expected to have different effects on different players, depending on their personality, mood, and expectations.<br/><br/>Operatives within the game can uncover hidden *REDACTED* and *REDACTED* scattered throughout the game's environment. These *REDACTED* and *REDACTED* can only be revealed by shining the magic flashlight onto them, exposing their true nature. It is imperative that any such findings are immediately reported through the *REDACTED* provided in order to prevent *REDACTED*.<br/><br/>Players can also obtain missions from *REDACTED* throughout the game's environment. By speaking to the *REDACTED*, players can receive fetch assignments. These missions add another element of intrigue to the already enigmatic game, but also raise concerns regarding the potential exploitation of this feature by unauthorized parties. All personnel must exercise extreme caution when engaging with *REDACTED* and report any suspicious activity immediately.<br/><br/>The game is in constantly evolving phase and is available for download from a secure server (Steam). Only authorized personnel can access the server using a unique token generated by the purchasing transaction. The game must not be shared or distributed to anyone outside the secure channels. Any feedback or bug reports must be submitted through a secure channel called \"Discord\".<br/><br/>This document must be handled with utmost care and discretion. Any unauthorized disclosure of this document or its contents could cause exceptionally grave damage to the *REDACTED*.<br/><br/>⚠️ DO NOT COPY OR DISTRIBUTE ⚠️<br/>🔒 SI-OBSCURE // TK-OBSCURE 🔒<br/>DESTROY WHEN NO LONGER NEEDED<br/><br/>SIGNED : *REDACTED*<br/><br/>// END OF DOCUMENT", "metacritic": null, "released": "2023-05-04", "tba": false, "updated": "2023-05-08T02:24:06", "background_image": "https://media.rawg.io/media/screenshots/feb/feb105e0a418a11413b77c87aabac707.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 350, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FAXCORPunlimited"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Insert No Coins"], "esrb_rating": null}