{"id": 96044, "slug": "injection", "name": "INJECTION", "name_original": "INJECTION", "description": "<p>\r\n\tINJECTION is a programming puzzle game, much like Untrusted, Else Heart.Break(), or Zachtronics' SHENZEN-IO. It's written in Python and indeed that's the language you'll be using to solve the puzzles.\r\n</p>\n\n<p>\r\n\t\"<em>I had a blast! I played with my brother and I'm really hoping it sparked some interest in programming for him!</em>\" -<strong>bigv13899</strong></p>\n<p>\n</p>\n<p>\r\n\tThe aim of the game is to guide your @ to the ⌂, navigating treacherous and troublesome obstacles like aggressive automated missile launchers and deadly particle-beams while solving puzzles with gravity-altering gizmos and programmable robotic drones.\r\n</p>\n\n<p>\r\n\t\"<em>I loved INJECTION; it felt like I was actually cheating the game even if that's\r\n\twhat I was supposed to do!</em>\" <br/>\r\n\t-<strong>IAMA_dragon-AMA</strong></p>\n<p>\n</p>\n<p>\n<strong>\n</strong>You'll never make it without the use of the INJECTION CONSOLE, a command line that lets you run computer code directly against the game world itself, re-targeting launchers, re-programming hostile murder-machines, redirecting troublesome streams of deadly radiation, lighting up the path through a teleporter-maze, or... theoretically, anything!\r\n</p>\n\n<p>\r\n\t\"<em>This game is great. I hope you're still planning on adding levels to it.</em>\" -<strong>Quicksand-S</strong></p>\n<p>\n</p>\n<p>\r\n\tBut don't be afraid - you \r\n\tdon't have to be a career programmer to join in the game! INJECTION has built-in tutorials and hint systems to help you learn as you play; it's specifically designed to provide an engaging challenge to full-bearded code-slinging keyboard-jockeys while simultaneously being accessible to hunt-and-pecking neophytes.\r\n</p>\n\n<p>\n\"<em>I need validation to stop feeling like a clever bastard on level 6</em>\" -<strong>TPHRyan</strong></p>\n<p>\n</p>\n<p>\r\n\tThe game is currently unfinished, but already packs <em><strong>20</strong></em> level-loads of blended twitch-action gaming and mind-melting puzzling: an estimated three or four hours of continuous play. Updates come out every month or so, and the game will update itself when the time comes, so check back often and be sure to keep your skills honed!\r\n</p>\n\n<p>\r\n\t\"<em>damn this is cool.</em>\" -<strong>nugyflex</strong></p>\n<p>\n</p>\n<p>\r\n\tAnd please make sure to check out the INJECTION community on Reddit. \r\n</p>", "metacritic": null, "released": "2015-07-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0ec/0ec6b1edeee4f2670efff8fcbaba8bd6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["schilcote"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}