{"id": 960517, "slug": "brothel-simulator-ii", "name": "Brothel Simulator II 💋", "name_original": "Brothel Simulator II 💋", "description": "Welcome to <strong>Brothel Simulator II 💋</strong>, the ultimate game for those who love the thrill of the nightlife and the rush of making money! As the owner of a high-end club, your objective is to maximize profits by keeping customers entertained and coming back for more.<br/><br/><br/><br/>With a variety of options at your disposal, including flirting, dancing, and private VIP experiences, Nightlife Hustle will keep you on your toes as you try to beat the clock and earn as much money as possible. Can you handle the pressure of running a successful club while keeping your customers and girls happy? Put your skills to the test and find out in <strong>Brothel Simulator II 💋</strong>!<br/><br/><br/><br/>Do you have what it takes to run the hottest VIP Lounge in town?<br/><br/><br/><br/><ul> <h3>Features:</h3><li> <strong>Money-making objective</strong>: The player's main objective is to earn as much money as possible within the allotted time by serving drinks, dancing, flirting with customers, and providing VIP room services.<br/></li><li> <strong>Customer interaction</strong>: Customers will randomly choose seats at the establishment where the player can serve them drinks. The player needs to keep an eye on their \"Booze Resistance\" level and lure them to the sofa with a dance before they leave.<br/></li><li> <strong>Managing dancers</strong>: The player can quickly switch between the girls working for them and needs to keep an eye on their fatigue levels. Once a girl reaches maximum fatigue, the player will temporarily lose control over her.<br/></li><li> <strong>Fulfilling customer desires</strong>: The player needs to fulfill the customer's desires by selecting the appropriate actions from the menu on the left. The higher the cost of a girl's services, the harder it is for her to seduce a customer.<br/></li><li> <strong>VIP room profits</strong>: Once a customer has been seduced, the player can take them to the VIP room, where the girl can earn a lot of money. The amount of money earned depends on the girl's fatigue level, so the player must keep them happy and well-rested.</li></ul>", "metacritic": null, "released": "2023-05-06", "tba": false, "updated": "2023-05-08T03:49:35", "background_image": "https://media.rawg.io/media/screenshots/5ca/5ca4a2acc06f85ab00e52470f2272cea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 338, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Furry Tails"], "genres": ["Strategy", "Simulation", "Casual"], "publishers": ["Furry Tails"], "esrb_rating": null}