{"id": 960527, "slug": "nocturnal-2", "name": "Nocturnal", "name_original": "Nocturnal", "description": "After a difficult journey across a troubled sea, Ardeshir, soldier of the Enduring Flame, returns home to the island of Nahran, where everything is obscured by a peculiar Mist. To uncover the cause, you must wield the sacred flame of your ancestors and carve your way to the island’s center, where secret locations and powerful abilities await. <br/><strong><h3>Fight for your home island of Nahran </h3></strong> As a soldier of the Enduring Flame, you must uncover the mystery of what happened to your order, battling any who stand between you and your goal: to free the island from the Darkness. <br/><br/><strong><h3>A deadly Mist </h3></strong> Something sinister cloaks the island of Nahran, and whatever dwells within it devours everything in its path. To discover its source and bring an end to this chaos, you must fearlessly wade into the Mist’s depths. But be warned: one cannot survive in the Mist for long...<br/><br/><strong><h3>Awaken the guardian of the Enduring Flame that sleeps in you </h3></strong> As the Mist is your enemy, Fire will be your ally in your journey.  Flame can ward off the Mist, ignite the scenery, turn on machinery, and be used to burn beings of dark magic impervious to conventional weaponry. <br/><br/><strong><h3>Explore the island and its secret places</h3></strong> The Mist covers a vast expanse and hides powerful abilities for those willing to explore its mysteries. Gain ashes by killing enemies and exploring your environment and make an offering to the Phoenix statues to give you new abilities and stat boosts you need to survive. <br/><br/><strong><h3>Speed-run mode </h3></strong> Speed run options are available. You can select those to improve your speed-run time.<br/>", "metacritic": null, "released": "2023-06-07", "tba": false, "updated": "2024-03-19T02:46:09", "background_image": "https://media.rawg.io/media/screenshots/82c/82c5398c5e11b538f0bbec81e3221f1b.jpg", "website": "", "rating": 4.0, "rating_top": 5, "added_by_status": {"yet": 2, "owned": 4, "beaten": 4, "toplay": 9, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 341, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["Sunnyside Games"], "genres": ["Action", "Adventure"], "publishers": ["Dear Villagers"], "esrb_rating": null}