{"id": 960501, "slug": "sea-of-choices", "name": "Sea of Choices", "name_original": "Sea of Choices", "description": "Sea of Choices is a turn-based RPG game centered around the decisions you make effecting the game world and story. Taking place on the magical planet Nova, you can uncover the mysteries while living out your daily life as Aura, a young Lon Lon. With the help of the animal inhabitants known as Naturepeeps, take on the powers that be, or just focus on gardening and stuff. Whatever floats your boat...because this is your Sea of Choices!<br/><br/>Features in the game include:<br/><br/><strong>Time is Counting Down</strong><br/><ul><li>Each day spent in Sea of Choices, you make decisions as Aura. When making choices or witnessing events, the clock moves forward, pushing you closer to the end of the game. Each day begins at home and time passes from morning to dusk to night as you go out and explore. Every part of the day presents new choices to be made in a semi-open world. Ultimately, the limited time you have to spend in the game world makes your choices truly impactful.</li></ul><br/><strong>Turn Based Combat Centered on Exploration Instead of Grinding for EXP</strong><br/><ul><li>You can fight in combat alongside animal companions known as Naturepeeps. These companions are found throughout the game world and using their skills is essential when encountering enemies. While you could still technically grind away in combat to get stronger, you can also spend your time exploring and powering your party up in a variety of activities such as making recipes, reading books, meditating with magical deities or simply by spending time together.</li></ul><br/><strong>Farming &amp; Fishing</strong><br/><ul><li>Through visiting stores, finding and planting seeds, and scouring the game world, you can find a variety of fruits and vegetables. You can also spend time fishing. Gathering these items and making recipes with them takes time but truly helps give you and your Naturepeeps the boost you need to take on any threats. </li></ul><br/><strong>Vibing to Music</strong><br/><ul><li>There are activities to do in every area but there's also a unique collectable to be found throughout the game world. <strong>Music!</strong> Collecting floating vinyl records you find, enables them to be played anytime you're back in your house. Each record contains a unique piece of music either composed by the developers or their close friends. </li></ul>", "metacritic": null, "released": "2023-05-05", "tba": false, "updated": "2023-05-08T03:28:30", "background_image": "https://media.rawg.io/media/screenshots/6b8/6b8afab3b5eb1c109c6a2a0c7705cf62.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["swansoft"], "genres": ["RPG", "Indie"], "publishers": [], "esrb_rating": null}