{"id": 960608, "slug": "jennis-dong-has-got-it-goin-on-the-jenni-trilogy", "name": "Jenni's DONG has got it GOIN' ON: The Jenni Trilogy", "name_original": "Jenni's DONG has got it GOIN' ON: The Jenni Trilogy", "description": "Three remastered erotic classics, one big meaty package! Get a peek into the life of Jenni- a bodacious bimbo who knows how to have a good time. This intersex bombshell loves to tease her latest playthings, and it looks like she's got her sights locked onto you next! <br/><br/><strong>Revisiting your favorites- the Jenni trilogy features improvements and new features!</strong><br/><br/><strong>GALLERY MODE:</strong> Quickly access your favorite pics you've unlocked- again, again, and again!<br/><strong>UPDATED ART:</strong> Higher resolution exports alongside re-drawn and touched up illustrations!<br/><strong>NEW FUNCTIONALITY:</strong> Save states, full screen support, speed selector, music toggle!<br/><br/><br/><strong>Jenni Truth or Dare:</strong> You're bored one day and Jenni challenges you to a naughty variation of truth or dare. If you're able to keep her entertained, you will be rewarded for your efforts!<br/><br/><br/><strong>Jenni Wrong Number:</strong> New phone, who dis? After a case of mistaken identity, you're given an eyeful of texts and photos you will never forget. Can you keep the conversation going?<br/><br/><br/><strong>Jenni's New Friend:</strong> Always the heart of the party- Jenni has an easy time \"getting along\" with others, and she wants to show off her new friends! Help her enjoy her night out!", "metacritic": null, "released": "2023-05-06", "tba": false, "updated": "2023-05-12T05:01:31", "background_image": "https://media.rawg.io/media/screenshots/2ea/2ea64ca617c86faaec313a2263470451.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Poundry"], "genres": ["Casual", "Indie"], "publishers": ["TinyHat Studios"], "esrb_rating": null}