{"id": 96064, "slug": "witches-of-st-sayuri-demo", "name": "Witches of St. Sayuri (Demo)", "name_original": "Witches of St. Sayuri (Demo)", "description": "<p>Follow the lives of eight witches as they study, fight and fall in love. On an island overran by monsters, every day life becomes a struggle for life and death. To make things worse, there appears to be a group of witch elitists who want to kill anyone they deem \"inferior\".</p>\n<p>Witches of St. Sayuri is a strategy RPG with lgbt themes.</p>\n<p>Plans for next update:<br/>-Chapter 19<br/>-Solving any bugs/typos that crop up and tackling some of the older ones.<br/>-Populating the class rooms for visiting before chapter 10.<br/>-Populating the new Nola map. (Yeah I know I'm lazy. -_-')</p><p>Update(8/7/2018)<br/>-Fixed more bugs.<br/></p>\n<p>Update(8/4/2018)<br/>-Fixed some more bugs.</p>\n<p>Update(7/31/2018)<br/>-Fixed some more bugs.</p>\n<p>Update(7/29/2018) #2<br/>-Hopefully finally fixed the bugs.</p>\n<p>Update(7/29/2018)<br/>-Fixed more *bleep*ing bugs.  (Man I really suck at making games! Q.Q)</p>\n<p>Update(7/28/2018)<br/>-Fixed more bugs from  previous chapters.</p>\n<p>Update(7/27/2018)<br/>-Possible bug fix and typos fixed.</p>\n<p>Update(7/25/2018)<br/>-Fixed some bugs that appeared in chapter 8.</p>\n<p>Update (7/20/2018)<br/>-Fixed more bugs from previous chapters.</p>\n<p>Update (7/7/2018)<br/>-Fixed a \"fix\" to a previous bug in chapter 18.</p>\n<p>Update (7/3/2018)<br/>-Fixed some more bugs and typos in chapter 18.<br/></p>\n<p>Update (6/29/2018)<br/>-Fixed some bugs and typos in chapter 18.</p>\n<p>Update(6/18/2018)<br/>-Update to chapter 18.<br/>-Player and party members appearing in cut scenes will change to show their equipped outfits!</p>\n<p>Update(4/17/2018)<br/>-Fixed the last of the typos and bugs chapter 17 (hopefully).</p>\n<p>Update(4/13/2018)<br/>-More typos and bugs fixed for chapter 17.<br/>-Final battle of chapter 17 should now occur.<br/></p>\n<p>Update(4/11/2018)<br/>-Typos and Bugs fixed for chapter 17.</p>\n<p>Update(3/25/2018)<br/>-Chapter 17 added.</p>\n<p>Update(2/11/2018)<br/>-More (and hopefully final) bugs and typos fixed for chapter 16.</p>\n<p>Update(2/9/2018)<br/>-More bugs and typos fixed for chapter 16.</p>\n<p>Update(2/7/2018)<br/>-More bugs and typos fixed (hopefully) for chapter 16.</p>\n<p>Update(2/6/2018)<br/>-Bugs and typos fix for chapter 16. </p>\n<p>Update(2/4/2018)<br/>-Update to chapter 16<br/>-Fixed bugs and typos in chapter 15</p>\n<p>Update (1/16/2018)<br/>-FINALLY figured out the circus map problem and fixed it! -_-'</p>\n<p>Update (1/9/2018)<br/>-Fixed bugs/typos in chapter 15.</p>\n<p>Update (12/27/2017)<br/>-Fixed bugs/typos in chapter 15.</p>\n<p>Update (12/26/2017)<br/>-Fixed more bugs/typos in chapter 14.<br/>-Progression from chapter 14 to chapter 15 should be available.</p>\n<p>Warning: A couple maps in chapter 15 (those covered in snow) be hard to determine the range for movement, attacks, skills and items. I apologize and I know not how to fix this since I very little knowledge of Ruby.</p>\n<p>Update (12/24/2017)<br/>-Fixed bugs from chapter 14.<br/>-Update to chapter 15.<br/></p>\n<p>Update (12/16/2017)<br/>-Fixed more bugs in chapter 13.</p>\n<p>Update (12/6/2017)<br/>-Fixed bugs in chapter 13.<br/>-Added the remaining destination topics in the teleporter list in chapter 14.</p>\n<p>Update (12/3/2017)<br/>-Fixed more bugs from chapter 12 (hopefully the last....)</p>\n<p>Update (12/2/2017)<br/>-Finally fixed the bugs from chapter 12 (I was wrong. TT_TT)</p>\n<p>Update (11/30/2017)<br/>-Update to chapter 14.</p>\n<p>Update (10/31/2017)<br/>-Update to chapter 13.<br/>-Fixed typos and bugs (hopefully) in chapter 12.</p>\n<p>Update (9/26/2017)<br/>-Update to chapter 12.<br/>-Added a monster arena mini game.</p>\n<p>Update (9/5/2017)<br/>-More bugs and updates.<br/></p>\n<p>Update (9/4/2017)<br/>-Bugs and typo update.</p>\n<p>Update (9/2/2017)<br/>-Fixed some major bugs left over from chapter 10.<br/>Note: There is currently a bug related to the Mind Control skill resulting in enemies going places where other characters can't. I'll try fix it once I figure out what's causing it, but until then use Mind Control at your own risk.<br/></p>\n<p>Update (9/1/2017)<br/>-Update to chapter 11.<br/>-Added teachers to the classrooms.<br/>-Bugs and typos fixes from previous updates(?)</p>\n<p>Update (7/30/2017)<br/>-Fixed more typos and bugs.</p>\n<p>Update (7/29/2017)<br/>-Fixed typos and bugs.</p>\n<p>Update (7/25/2017)<br/>-Realized the download was set to hidden and fixed that problem. Sorry. -_-'<br/></p>\n<p>Update (7/24/2017)<br/>-Some more bug/typo fixes.<br/>-Update to Chapter 10.<br/>-Floors 3-6 of St. Sayuri are now accessible.<br/>-Special guest characters.<br/></p>\n<p>Update (5/20/2017)<br/>-Bug and typo fixes.</p>\n<p>Update (5/19/2017) #2<br/>-Hermina is now visible.<br/>-Minor typo fix.</p>\n<p>Update (5/19/2017)<br/>-Fixed some crucial bugs.<br/>Forgot fix chapter 8 end credits \"bug\" will post the new upload whenever I can.<br/>Okay, it should be fixed now!</p>\n<p>Update (5/17/2017)<br/>-Update to chapter 9.<br/>-The debut of Hermina's surprised sprite!!!</p>\n<p>Update (5/5/2017)<br/>-Bugs, typos and French fixed.<br/>-Added a request sign to the ruins town hub map.<br/></p>\n<p>Update (4/30/2017)<br/>-Update to chapter 8.<br/>-Changes to skills of certain characters (Shizuka, Arthur, Amara) to make their abilities a little more useful.<br/>Warning: The French used in this chapter is machine translated and may likely be inaccurate or grammatically incorrect. I apologize in advance.<br/></p>\n<p>Update (4/10/2017)<br/>-Fixed bugs and typos.</p>\n<p>Update (4/9/2017)<br/>-Update to chapter 7</p>\n<p>Update (3/22/2017)<br/>-Bug and typo fixes.<br/>-Yuki Musume in chapter 6 powered up to increase damage output.<br/></p>\n<p>Update (3/20/2017)<br/>-Update to chapter 6.<br/>-A new locale to visit!<br/>-Bug and typo fixes!<br/>-Finally a tutorial! *GASP*!<br/></p>\n<p>Update (2/8/2017)<br/>-Updated to chapter 5.<br/>-Added stat raising items and collectible cards purchasable in the cafeteria.<br/>-Added multi-target scrolls to book merchant in library.<br/>-Updated the amount of bronze stars earned in chapter two. (Though I admit they aren't any more items to trade them in for yet. -_-')<br/>-Added more characters to the first floor of st. sayuri and added characters to the courtyard.<br/></p>\n<p>Update (1/9/2017) v2.0<br/>-Gave Hermina the ability to use magic skills (which means she will have a magic tab as SRPG just allows characters to use any skills they have without checking if they can actually use them.)<br/>-Created a \"disappearing tab\" for Arthur in the dorms so that he won't be visible after he's in the party.<br/>-Fixed Maddening Gibberish (both in name and range.)<br/>-Bloody bandages should permit characters to wield brief cases and frying pans.<br/>-Healing skills (that can at least target Aika) are given the appropriate element so that they will interact with Aika's Hairpin.</p>\n<p>Notes: The impress cosplay should be visible by combining Demon Wings with Casual clothes. If it isn't then I will scrutinize the Cosplay common event and test play it until I can get a solution from my end.<br/>  I've changed how Alma determines the cost of healing. Instead of actually calculating according to the amount of HP/MP characters lost, she combines the level of each character. I did this to make healing in the early game much cheaper as well as I had apparently forgotten to update it to account for party members other than Aika and Shizuka and the amount of healing require me to sell off the looted weapons from monsters just to be healed (this was before I implemented the assignment board.) Upon request, I can revert her to its original method (updated to account for characters other than Aika and Shizuka) seeing as the assignment board makes earning lots of money a tad too easy.<br/></p>\n<p>Update (1/9/2017)<br/>-More typos fixed.</p>\n<p>Update (1/8/2017) 2.0<br/>-Hermina's movement issues should be fixed. (Hopefully)<br/>-Uploaded the script that was causing the \"Counter Bug\" for the purpose of figuring out a solution. (Posted script in the forum.)</p>\n<p>I've created a forum: http://witchesofstsayuri.freeforums.net/. I've already posted a bug report thread so please post any and all future bugs in that thread. I plan adding some other topics in the future (whenever I get around to it.)</p>\n<p>Update (1/8/2017)<br/>-Fixed more bugs (including the one I accidentally created trying to fix the \"counter bug\".)</p>\n<p>Note: Due to the fact the bug where the game will crash when a player character attacks a paralyzed/sleeping/frozen enemy is due to the battle script trying to process the chance of a counter attack when the enemy can't do anything resulting in the game crashing. Without actually learning ruby text and writing a patch to fix this issue, I fear I may have to remove the chance to paralyze/freeze enemies from skills and items. I'm sorry. Hopefully in the future I can find a means to fix this.</p>\n<p>Update (1/7/2017)<br/>-Fixed more typos and bugs.<br/></p>\n<p>Update (1/6/2017)<br/>-Fixed known typos and bugs (including a minor bug I discovered where replaying maps characters can move onto the square occupied by enemies. Woops!)</p>\n<p>Note: I've yet to replicate the hospital crash bug so I'm not sure what's causing it. To apologize for this I will give a little hint (something I discovered in the last test play): By collecting rewards from the assignments, you can easily earn enough money to stock pile on healing items, making using the hospital nearly pointless.<br/></p>\n<p>Update (12/30/2016)<br/>-Complete chapter 4.<br/>-Added \"Miyuki's Cosplay Guide\" to the list items that you can trade bronze stars for.<br/>-Added an assignment sheet on the wall in hall leading to the teleporter.<br/></p>\n<p>Update (12/18/2016)<br/>-Fixed the Kumako event.<br/>-Made Bianca and Amara interactive.<br/>-Added some smaller events.<br/></p>\n<p>Update (12/17/2016)<br/>-Fixed the mixing image issues with Kumako and Mahoko's diary.<br/>-Fixed the issue with characters that are only supposed to be visible during cutscenes sticking around and not being interactive. (I will add some more NPCs later to interact with.)<br/>-Certain battle maps like the Mausoleum and Underground Lake no longer being tinted by the evening light.<br/>-The non-interactive stairs up in the dorms are non-properly blocked off.</p>\n<p>Note: I've poured through the common event page I use for the grimoires, but I can't find where I messed up. Please endure until I can figure the problem.<br/></p>\n<p>Update (12/16/2016)<br/>-Fixed the support magic grimoire.<br/>-Demon Wings and Hellhound Ears should allow you to equip the correct weapons.<br/></p>\n<p>Update (12/15/2016)<br/>-Fixed typos.<br/>-Raised the stats on Bianca's and Amara's weapons.<br/>-Corrected Support Magic grimoire's common event.<br/>-Bestiary should now be able to cancel out of entries back to table of contents.<br/>-Added body warmers to item shop.<br/>-Chapter 2 choice at teleporter should be available after chapter 1.</p>\n<p>Update (12/14/2016)<br/>-Completed Chapter 3.<br/>-Added another grimoire and scrolls to the shop.<br/>-Fixed some recent bugs.</p>\n<p>Update (12/9/2016)<br/>-Tackled more issues brought up by Crowthorne.<br/>-Changed how outfits work. Instead combining an armor item, a weapon and a misc item, you simply equip a costume and an accessory outfit (such as school uniform and bloody bandages) and bam, the character's image will be change. I also changed the misc items the monster dropped into armor items. Outfits no longer increase stats, but provide special benefits.<br/>-Enemies have been re-statted since outfits no longer raising their stats.<br/>-Added some grimoires to the book store (will add some more).<br/>-Figured out why the game over music plays instead of the victory music when you win and corrected it.<br/></p>\n\n<p> Update (11/28/2016)<br/>-Tackled most of the additional issues Crowthorne brought up.<br/>-Returned the ability to skip cut scenes. (Had disabled it to test play it and forgotten to re-enable it.)</p>\n<p>Update (11/12/2016)<br/>-Tackled most (if not all) the issues Crowthorne brought up.<br/>-Updated Demo to chapter 2.</p>\n<p>I'm currently working on chapter 3, but can go back fix any bugs that are found. Please notify me via the comments here or at my blog: https://yuritactics.wordpress.com/. I will probably open a forum soon for the purpose of reporting bugs, making suggestions, discussing game play and story. Please stay tuned! -_^<br/></p>", "metacritic": null, "released": "2016-10-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b3b/b3b25c0713e8b7ec948ce918938c57cf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Elkat"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}