{"id": 960656, "slug": "gunsmith-simulator-prologue", "name": "Gunsmith Simulator: Prologue", "name_original": "Gunsmith Simulator: Prologue", "description": "Gunsmith Simulator: Prologue is one of the most addictive simulation games in which you become a real gunsmith. Don't wait any longer - open your own gunsmith workshop and show the world you profession and passion in making, repairing and modifying three popular models of weapons: a shotgun, an old school revolver and an automatic rifle.<br/><br/><br/>As an entry-level gunsmith, start your business with repairing and modifying weapons. Register on the GunStock platform and complete <strong>three different jobs</strong> in order to develop your skills and gain valuable experience.<br/><br/><br/>Now that you've decided to take on a repair job, it's time to act! Start with a thorough inspection of your weapon, clean it thoroughly, then proceed with the <strong>analysis and determine which components need repair or replacement</strong>. You can order the appropriate parts or try to create them yourself using specialized tools.<br/><br/><br/>Are you ready to take on the challenge and create something unique? Modify your weapon by replacing <strong>plastic parts with unique and beautifully crafted wood parts</strong>. Your craft skills let you create original elements that perfectly match the customer's needs and enrich the weapon aesthetic with an elegant and unique style.<br/><br/><br/>Do you fancy personalizing your weapons? Now you can use your imagination to the fullest and give your weapon a unique style by <strong>adding the right accessories and painting it in your favorite colors</strong>. In our store you will find various designs and colors as well as accessories - three optical sights, a laser and two foregrips - all you need to customize your weapon the way you like!<br/><br/><br/>Relax after the long day and test the newly self-made weapons. Pack your guns in the car and <strong>head to our forest shooting range to test your guns in action!</strong> Complete tasks like trap shooting or free shooting, and after you've done them all, end our prologue and get ready for the release of the main game! Do not put it off - book your time for an unforgettable experience today!<h3>GAME FEATURES:</h3><ul><li>open your own workshop and learn gunsmithing skills<br/></li><li>complete three different orders<br/></li><li>personalize your weapons by painting and adding accessories<br/></li><li>test your weapons at the forest shooting range by completing three different shooting tasks</li></ul><br/>We hear you, as a <strong>team open to dialogue and suggestions</strong>. We are looking forward to hearing your ideas, opinions and thoughts, and we are open to constructive criticism!<h3>We invite you to our server on Discord. Join us:</h3>", "metacritic": null, "released": "2023-05-10", "tba": false, "updated": "2023-12-03T09:55:33", "background_image": "https://media.rawg.io/media/screenshots/83f/83fa38b1a52f3238d5d357d980dd34b9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 41, "beaten": 1, "playing": 2}, "playtime": 3, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 365, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["GameHunters"], "genres": ["Simulation"], "publishers": ["PlayWay"], "esrb_rating": null}