{"id": 960601, "slug": "mommy-simulator-2", "name": "Mommy Simulator", "name_original": "Mommy Simulator", "description": "Mommy Simulator is a unique and engaging game that simulates the experience of being a mother. As the player, you take on the role of a mother who must take care of her child, ensuring that they are well-fed, rested, and happy.<br/>\n<br/>\r\nThe game challenges you to perform various tasks and duties of a mother, such as feeding the baby, changing diapers, putting the baby to bed, and taking them for a walk. You must manage your time and resources effectively to ensure that your child is healthy and happy. <br/>\n<br/>\r\nThe game includes various levels and challenges, each with its unique set of objectives and requirements. As you progress through the game, you will face increasingly difficult challenges and situations, requiring you to develop your skills and knowledge as a parent. The game aims to help players understand the challenges and responsibilities of being a parent and to appreciate the hard work that goes into raising a child.<br/>\n<br/>\r\nOverall, Mommy Simulator is a fun and challenging game that provides an engaging and realistic simulation of being a mother. It offers a unique and insightful perspective on parenthood and is a great game for anyone looking for an immersive and educational experience.<br/>\n<br/>\r\nGame Features:<br/>\r\n- Parental responsibilities<br/>\r\n- 2 Modes ( Story / Learning)<br/>\r\n- 20 levels", "metacritic": null, "released": "2023-05-08", "tba": false, "updated": "2024-03-03T14:48:10", "background_image": "https://media.rawg.io/media/screenshots/e1b/e1ba633ce4a709c2a6869d4e326cf4e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Atomic Fabrik"], "genres": ["Adventure", "Simulation", "Sports", "Casual", "Indie"], "publishers": ["Atomic Fabrik"], "esrb_rating": null}