{"id": 960682, "slug": "the-unfallens-awakening", "name": "The Unfallens: Awakening", "name_original": "The Unfallens: Awakening", "description": "\"The Unfallens: Awakening\" is a soul-like action-packed boss battle game where you play as a surviving member of the \"Unfallens\" civilization using a ghost scythe to challenge the merciless guardians BOSS.<h3>Narrative Background</h3>A shattered world awaits you as you return home from your exile in the underground. The once-thriving civilization of the Unfallens now lies in ruins, with only ruthless guardians left to attack you. Journey through the remains of this fallen civilization, using your skills to overcome intense boss battles and uncover the truth behind the devastation. Awaken your true power, and reclaim what was lost.<h3>Challenging Action Combat</h3>The game's action combat is challenging, requiring you to master the distance of different attack movements, use dodges to correctly respond to the rich moves of the boss, and survive under the formidable enemy.<h3>Satisfying Combat Feel</h3>Feel the solid sense of the soul scythe hitting the enemy, and participate in intense combat through smooth animations, realistic sound effects, visual effects, screen shaking, and other methods.<h3>Full Support for Controllers and Keyboard and Mouse</h3>You can choose any control method suitable for you to play. Whether you prefer a keyboard and mouse or a controller, you can find your play style.<h3>Gorgeous Game Graphics</h3>The game uses high-quality graphics effects to create a unique atmosphere and characters full of details.<h3>Abuot the developers</h3>Floatonic Studio, a team of talented student developers, created \"The Unfallens: Awakening\" over six months. Three students from the University of Utah led the development effort, while two students from the Berklee College of Music contributed to the game's immersive audio experience. Despite its compact content, the developers aimed to provide players with the best quality game featuring a unique and challenging boss battle experience. Through their hard work and collaboration, the team has brought this action-packed game to life for players to enjoy.", "metacritic": null, "released": "2023-05-11", "tba": false, "updated": "2023-05-12T04:33:01", "background_image": "https://media.rawg.io/media/screenshots/d77/d77e6134ecb5dc63db4481c6e53a4b67.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 384, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Floatonic Studio"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Floatonic Studio"], "esrb_rating": null}