{"id": 960605, "slug": "darkest-dungeon-ii", "name": "Darkest Dungeon II", "name_original": "Darkest Dungeon II", "description": "Darkest Dungeon II is a roguelike road trip of the damned. Form a party, equip your stagecoach, and set off across the decaying landscape on a last gasp quest to avert the apocalypse. The greatest dangers you face, however, may come from within...<br/><br/><strong>Gather your courage and ride out into the chaos of a world undone.</strong><br/>Four heroes and a stagecoach are all that stand between darkness and salvation.<br/><br/><br/><br/><strong>Tried and True Turn-based Combat, Improved</strong><br/>The ground-breaking genre-defining combat from Darkest Dungeon returns, but everything from stats to rules has been refined and improved. The all new Token System helps make your decisions impactful while adding even more depth of play.<br/><br/><br/><br/><strong>Unforgettable Heroes</strong><br/>Uncover and experience the tragic origin stories of each hero. Unlock their full potential via new skills, paths, items, and more.<br/><br/><br/><br/><strong>Roguelike Runs, Each With Its Own Emerging Story</strong><br/>Each expedition lasts from 30 minutes to several hours. Even an untimely end will arm you with resources that can be spent to improve your next journey.<br/><br/><strong>The Altar of Hope</strong><br/>Engage with a massive system of upgrades and boons that opens up new strategies for each expedition. Choose what’s important to you as you formulate your assaults on the Mountain.<br/><br/><br/><br/><strong>The Affinity System</strong><br/>As travels progress, heroes bond with each other or grate on each others’ nerves, leading to desperately needed combat synergies or journey-ending dysfunction. Manage their stress and interaction to keep the team together until the bitter end.<br/><br/><br/><br/><strong>Nightmarish Environs</strong><br/>From the burning Sprawl to the diseased Foetor, the long road to the Mountain will challenge your strategies and your endurance. <br/><br/>Explore five distinct regions, each with their own unique creatures and challenges.<br/><br/><br/><br/><strong>A Moment’s Peace</strong><br/>Rest your weary, shell-shocked heroes at the Inn, where you can relieve their stress and try to improve their relationships with a variety of diversions and delights.<br/><br/><br/><br/><strong>Face Your Failures</strong><br/>Journey to the Mountain and face down five terrifying manifestations of your weaknesses.<br/><br/><br/><br/><strong>Signature Art Style, Evolved</strong><br/>Darkest Dungeon’s genre-defining art now improved with no expense spared on 3D visuals, animation, and visual FX.<br/><br/><br/><br/><strong>A Feast for the Ears</strong><br/>The audio team from Darkest Dungeon is back. Revel in an all new narration performance by voice actor Wayne June, a brand new expansive score by Stuart Chatwood, and bone-crunching sound effects from Power Up Audio.<br/><br/><h3>Play the game that started it all! </h3>https://store.steampowered.com/app/262060/", "metacritic": null, "released": "2023-05-08", "tba": false, "updated": "2024-02-11T18:02:27", "background_image": "https://media.rawg.io/media/screenshots/d1c/d1cba2479752332e5d8950bd1b00538a.jpg", "website": "https://www.darkestdungeon.com/", "rating": 3.71, "rating_top": 4, "added_by_status": {"yet": 9, "owned": 46, "beaten": 6, "toplay": 19, "dropped": 7, "playing": 6}, "playtime": 13, "achievements_count": 66, "ratings_count": 16, "suggestions_count": 479, "game_series_count": 0, "reviews_count": 17, "platforms": ["PC"], "developers": ["Red Hook Studios"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Red Hook Studios"], "esrb_rating": null}