{"id": 960691, "slug": "tennis-manager-2023", "name": "Tennis Manager 2023", "name_original": "Tennis Manager 2023", "description": "Put on your coach's suit and step into the exhilarating world of tennis management in TM23! Immerse yourself in the ultimate tennis simulation, where your decisions both on and off the court will shape the destiny of your academy. Be the number 1 manager and become a national Team Captain to lead your team to greatness!<h3> Game description </h3>Take the helm of your academy and navigate through a vast array of tournaments, with over 2,000 competitions spanning from the junior circuit to the professional stage. Among the 5,000 players at your disposal, discover the talented individuals who will propel your academy to glory.<br/>In Tennis Manager 2023, strategic management is key to your success. Ensure financial stability, negotiate contracts, and make structural investments wisely to achieve both short-term and long-term goals. Impress your demanding board of directors with your astute decision-making and become the reference with your own coaching and managing style.<br/>Demonstrate to your Federation that you are the right person for the captain job. Take new responsibilities and lead the national team to the supreme title: the World Cup of Tennis.<br/>With the cutting-edge 3D engine, immerse yourself in the heart of the action and coach your player in real-time during matches.<h3> World Cup </h3><br/><br/><br/>Serve your country with pride and lead your team to victory in the Team World Cup! From qualifiers to the group stage and finals, navigate through each step by strategically selecting up to 5 players, preparing for 4 days, and choosing the lineup for singles and doubles matches. Your tactical skills will be challenged like never before!<h3> Play Doubles! </h3><br/><br/><br/>Experience the long-awaited addition of doubles matches to the game. Engage in decisive doubles matches during the World Cup of Tennis. Employ specific game plans, tactics, and pre-match talks to reach a new level of gameplay and test your strategic acumen.<h3> Olympic Games </h3>Aim for the gold medal and add a prestigious title to your player's record in the Olympic Games. Participate in this iconic tournament, available every four years starting from 2024. It's time to make history and etch your name among the legends of tennis.<h3> Player Customization </h3><br/><br/><br/>Unleash your creativity with even more options for player customization. Choose from a wider variety of faces, hairstyles, accessories, and gear to make your player truly unique. Enhanced player models provide a more realistic representation of your athletes on the court.<h3> 3D Animation and Simulation </h3><br/><br/><br/>Witness the thrilling action on the court like never before. The improved animation engine and new 3D models bring your players' skills to life with stunning detail. Coach your players in real-time during matches and enjoy immersive 3D cinematics that put you right in the middle of the action. New tactical choices and player’s behaviors will challenge your mind.<h3> New 2023 Database </h3>Thanks to the help of a lot of customizing tools, create your very own tennis academy! Start from scratch with the budget of your choice (easy or hard), recruit or create your players, train your teams, participate in matches and triumph over all your challenges! It's up to you to fight your way to victory and become the best manager!<h3> Tennis Academy Creation </h3>Utilize a range of customization tools to create your very own tennis academy from scratch. Begin with a budget of your choice, recruit or create players, train your teams, participate in matches, and overcome all challenges on your path to victory. It's your chance to prove your managerial prowess and become the best in the business!<br/><br/>Step into the role of a tennis manager and embark on a thrilling journey. Take charge of your destiny in the dynamic world of tennis management!", "metacritic": null, "released": "2023-05-24", "tba": false, "updated": "2023-08-15T00:31:40", "background_image": "https://media.rawg.io/media/screenshots/803/803e9ca7b7c6a3f9a97d3d524cf43ffc.jpg", "website": "https://www.tennismanager.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["Rebound CG"], "genres": ["Strategy", "Simulation", "Sports", "Indie"], "publishers": ["Rebound CG"], "esrb_rating": null}