{"id": 960687, "slug": "mechabellum", "name": "Mechabellum", "name_original": "Mechabellum", "description": "Mechabellum is an epic auto-battler taking place on the newly colonized planet of Far-Away. You’re the Commander of an army of mechs fighting it out in massive PvP battles. Customize and level up your units before the fight, strategically place them on the battlefield and watch them destroy your enemies without mercy.<br/><br/><br/>From the nimble Wasp light aircraft to the massive Vulcan, learn the strengths and weaknesses of a large number of unique mechs. Customize them and their abilities before you go to war to maximize their destructive power. <br/><br/><br/>Anticipate your enemy and strategically place your mechs on the battlefield. Counter your opponent’s moves by choosing the perfect unit combination as the battle unfolds. <br/><br/><br/>Turn a losing battle into a winning one by calling down the perfectly placed airstrike, or spread chaos by calling in a horde of crawler bots in the midst of your enemy’s army. <br/><br/><br/><br/><br/>Watch shrapnel, incendiary bombs and huge lasers cut through the air as battles between massive armies of mechs unfold in front of your eyes. <br/><br/><br/>Fight against advanced AI before you challenge players in PvP combat. Try different unit combinations and abilities without the pressure of facing real players.<br/><br/>", "metacritic": null, "released": "2023-05-11", "tba": false, "updated": "2024-03-02T21:02:50", "background_image": "https://media.rawg.io/media/screenshots/725/725138717c2cc7425cf7375a2277841b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 25, "beaten": 2, "toplay": 4, "dropped": 2, "playing": 1}, "playtime": 3, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 535, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Game River"], "genres": ["Action", "Strategy", "Simulation", "Massively Multiplayer"], "publishers": ["Paradox Arc"], "esrb_rating": null}