{"id": 960776, "slug": "solitary-paperplane", "name": "Solitary PaperPlane", "name_original": "Solitary PaperPlane", "description": "Solitary PaperPlane is a perfect game for the lonely ones to address their loneliness.<br/>A game that takes players on an adventure to find their perfect companion... There is no companion, just the player and their plane on an endless flight. \"Haha-haha... *sniff* Someone is cutting the onion again...\" - Tea <br/><br/>Solitary PaperPlane is a fun and addictive arcade-style game where players control a plane as it navigates through various obstacles in the sky. The goal is to fly as far as possible while collecting coins. <br/>With simple controls and challenging gameplay, Solitary PaperPlane is a great way to pass the time and have fun, and people of all ages can enjoy it. It is also a good option for players looking for a more relaxed, low-stress gaming experience (with added music) or a thrilling, stressful gaming experience (with added music).<h3>Modes:</h3><br/><ul><li><strong> Chill Mode - Players take on the role of a paper airplane navigating various environments with no obstacles.</strong> (A relaxing and immersive experience that players can enjoy at their own pace.) [Relaxing Music] <br/><br/></li><li><strong> Thrill Mode - Players must also navigate obstacles and collect coins; as time passes, it will steadily get faster in this mode.</strong> (A hyper experience for those who like the fast pace with added obstacles.) [Hyper Music] </li></ul><h3>Controls:</h3>Choose one of the three controls you feel comfortable playing with.<br/><br/><ul><strong>+ Click and hold LEFT MOUSE to move around.</strong></ul><h3>Extras:</h3><br/><strong>Achievements:</strong><br/>Players can earn achievements for completing specific tasks or reaching certain milestones within the game. These achievements add a layer of challenge to the game.<br/><br/><strong>Leaderboard:</strong><br/>Additionally, the game features a leaderboard where players can compete with each other for high scores. The leaderboard displays the top players globally, allowing players to showcase their skills and compete for the top spot.<br/><br/><strong>Store:</strong><br/>For those looking to customize their gameplay experience, \"Solitary PaperPlane\" also features a store where players can purchase different planes and music tracks. These items can enhance the gameplay experience and make it more enjoyable and personalized.<br/><br/><br/><br/>Solitary Paperplane is sure to provide hours of entertainment.<br/>With simple and intuitive controls, anyone can play Paperplane and experience the excitement of flying a paper plane to new heights!<br/>With stunning graphics and smooth gameplay, players will be transported to a world of adventure and excitement as they fly through breathtaking landscapes and different environments.<br/><br/><strong>As a game developer, we are always looking for feedback from our players. We want to know what you like about the game and what could be improved. Reviews are an essential way for us to receive feedback and improve the game for our players.<br/>We welcome all positive or negative feedback, which helps us understand what players seek in a game. It also allows us to make changes and improvements to the game based on what our players want.<br/>Regarding future updates, we always look for ways to improve the game and add new features that our players will enjoy. Some things we might consider adding in the future include levels, additional obstacles and challenges, more planes and music tracks in the store, and new gameplay mechanics.<br/>We also value our players' opinions and ideas, so we encourage you to share your thoughts through reviews or social media. We are excited to continue developing \"Solitary PaperPlane\" and making it a game that our players will love to play.</strong>", "metacritic": null, "released": "2023-05-12", "tba": false, "updated": "2023-05-15T03:15:08", "background_image": "https://media.rawg.io/media/screenshots/6c1/6c1bdcea5abf465a22ab20efe6e34039.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tecshield", "a Dum Cup of Tea"], "genres": ["Casual"], "publishers": ["a Dum Cup of Tea"], "esrb_rating": null}