{"id": 960796, "slug": "hidden-objects-neon-secrets", "name": "Hidden Objects - Neon Secrets", "name_original": "Hidden Objects - Neon Secrets", "description": "Start your hunt for hidden objects!<br/><br/>Hidden Objects - Neon Secrets is a hidden object puzzle adventure game in which you will find hidden objects in pictures!<br/>Get ready for a big hidden object Journey in the mystery neon world! At each level you will have to find ten hidden objects. Each level represents a new location – manor, hotel, swimming pool, house, beach, shop, museum and much more. Enjoy the neon atmosphere of the hidden object puzzle game!<br/>In Hidden Objects - Neon Secrets Game you have to find various hidden objects - the objects to be found will be displayed at the bottom of the screen and your task is to find them all on a big picture. Hidden items can be anywhere. Seek and find all items and complete hidden object challenges.<br/><br/>Why you will love “Hidden Objects - Neon Secrets” - find the objects adventure game:<br/>- The game is completely free.<br/>- Unusual author's drawings in a special, neon style.<br/>- Offline mode - enjoy the Hidden Object game wherever you are!<br/>- The game is not difficult. Just relax and have fun!<br/>- There are no timers or time limits in the game. No need to hurry. <br/>- Incredible seek-and-find adventure that adults and kids will love.<br/>- 10 mysterious items in each level.<br/>- Hints is available and will help if you get stuck<br/><br/>If you are looking for an amazing hidden object puzzle adventure, Hidden Objects - Neon Secrets game is what you need for fun and relax!<br/><br/>So what are you waiting for? Download Hidden Objects - Neon Secrets game and enjoy!", "metacritic": null, "released": "2022-08-27", "tba": false, "updated": "2023-05-15T03:50:13", "background_image": "https://media.rawg.io/media/screenshots/a92/a929b3be10aa39a52c33b0e8f116b99a_x5JJ83h.jpg", "website": "https://skydungeongames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alexey Romanov"], "genres": ["Puzzle"], "publishers": ["Alexey Romanov"], "esrb_rating": "Everyone 10+"}