{"id": 960794, "slug": "playboy-match-resort", "name": "Playboy Match Resort", "name_original": "Playboy Match Resort", "description": "Get ready for an amazing match with 3 or more jewels and a dating adventure in Playboy Match Resort! Enjoy a luxurious life at the resort! Solve matching puzzles by connecting jewels and unlocking new locations &amp; features in the resort. The more you progress, the more models you will be able to meet, which model will you end up dating? <br/><br/>By completing match 3 or more jewel puzzles by connecting jewels, you will be able to flirt with models to gain their love, play different games, gift presents to the models, and customize their clothes! Also, don’t miss out on a great variety of mini-games!<br/><br/>FEATURES<br/><br/>MATCH, CONNECT &amp; PROGRESS THE STORYLINE<br/>Immerse yourself in an interactive match &amp; connect puzzle story. You will arrive to a luxurious resort full of epic parties, cool cars, and models. Every matching level will reward you with an enjoyable fun experience of matching with models &amp; connecting 3 or more jewels on the screen, the more you match, the higher the rewards! Sorting, connecting, and matching will give you cool rewards which can be used to flirt with the models, buy outfits, and unlock new zones among many more!<br/><br/>UNLOCK NEW LOCATIONS AND MODELS<br/>The fun never stops! You will be able to unlock new resort locations such as the pool, and other apartments, among many others. In these places you will meet a wide variety of models for you to chat with and possibly make them fall in love with you.<br/>Every model will have a different personality, so you will have to play it smart. Once the model likes you more, you will be able to change their outfits as well as gift them presents to increase your bonding.<br/><br/>COMPETE<br/>There will be hosted weekly \"Resort Battles\". They are a competition for the title of Party King/Queen - the goal is to throw the coolest party to attract the maximum number of guests. Can you prove you can throw the best party?<br/>The number of guests depends on your activity and performance during the event and on the level of the resort and models. <br/><br/>Don’t miss out on an amazing interactive match puzzle adventure in Playboy Match Resort! Lots of fun puzzle mini-games and sorting puzzles await you!", "metacritic": null, "released": "2023-04-20", "tba": false, "updated": "2023-05-15T03:47:57", "background_image": "https://media.rawg.io/media/screenshots/524/524a897f8b17893af20f921b066ea2f2.jpg", "website": "https://playboymatchresort.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["TP Kiki"], "genres": ["Simulation", "Puzzle"], "publishers": ["TP Kiki"], "esrb_rating": "Mature"}