{"id": 960784, "slug": "xenosis", "name": "Xenosis", "name_original": "Xenosis", "description": "Xenosis is a thrilling metroidvania where you traverse an ancient temple that has been overrun by alien creatures.<br/><br/>Your only hope for survival is to explore the temple and find a way to escape. Armed with your blaster, you must combat a variety of challenging enemies and upgrade your weapon along the way!<br/><br/><br/><br/><strong>EXPLORE AN ANCIENT TEMPLE FORGOTTEN BY TIME</strong><br/>Explore an ancient temple forgotten by time. With non-linear exploration, multiple paths, and hidden secrets to uncover, Xenosis offers a personalized experience that allows players to choose their own path and play at their own pace.<br/><br/><br/><strong>COMBAT AN UNFORGIVING ALIEN INFESTATION</strong><br/>Throughout the temple, you will combat alien insectoids, mechanical defense golems and automatic temple defense systems. Xenosis has challenging enemies, platforming puzzles, and a variety of weapon upgrades to discover.<br/><br/><br/><strong>EXPERIENCE A COSMIC ATMOSPHERE WITH CLASSIC METROIDVANIA GRAPHICS</strong><br/>Immerse yourself in a cosmic temple atmosphere with brooding instrumental music and classic metroidvania graphics that capture the nostalgia of retro gaming.<br/><br/><br/>Xenosis was created independently by students in the University of Southern California’s games program. The game was developed by Noah Lee, Luke Todaro, Simon Burdick, Ryan Wilson, Emily Jiang, and Hudson Nguyen. For more information, please visit our publisher page. To learn more about the USC Games program, the #1 Games Program in the world, check out the USC Games website.", "metacritic": null, "released": null, "tba": false, "updated": "2023-05-15T03:33:45", "background_image": "https://media.rawg.io/media/screenshots/fa8/fa8d8533813cdfb7d48dd252e03ad480.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Noah Lee"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["USC Games"], "esrb_rating": null}