{"id": 960760, "slug": "the-ranch-of-rivershine", "name": "The Ranch of Rivershine", "name_original": "The Ranch of Rivershine", "description": "<strong>Build your own horse ranch!</strong><br/>Settle into a new town and learn the ropes of running your own ranch! Repair your stable and add new stalls, expand your pasture or build new obstacle courses for your arena. Make the ranch your own as you care for your horses and grow your herd!<br/><br/><strong>Train your horses and compete in cross country!</strong><br/>Saddle up and improve your horse's skills in multiple disciplines such as speed, endurance and flexibility! Equip your horse with the best tack and participate in different cross country courses to become your town's champion!<br/><br/><strong>Grow your herd and raise your own foals!</strong><br/>Build a herd of up to a dozen horses by breeding them or trading them at the auction house! Pick which horses to breed wisely and pass onto the foal rare coat colors and good personality traits. Earn your foals' trust, train them with unique activities and care for them as they grow up!<br/><br/><strong>Cultivate crops and fruits on your ranch!</strong><br/>Plant a variety of grains and hay in your fields! Expand your ranch with an orchard and grow fruit trees to gather snacks such as apples and pears. Feed your horses a healthy diet to boost their energy and gain their affection!<br/><br/><strong>Explore the western wilderness on horseback!</strong><br/>Trot along on different trails such as the meadow path, along the coast range or up on a rocky mountain hike. Bond with your horse and enjoy nature... You might even encounter wild horses during your ride!<br/><br/><strong>Befriend the townsfolk of your frontier town!</strong><br/>Meet the lively villagers who'll help you along your journey in Rivershine! Get to know the auctioneer who'll manage the auction house, the carpenter who'll renovate your stable and the ranger who'll clear new forest trails for you to explore!", "metacritic": null, "released": "2023-05-12", "tba": false, "updated": "2023-05-15T02:54:12", "background_image": "https://media.rawg.io/media/screenshots/fe9/fe961ad14ab4e2c0dca4d669562be3f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 435, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cozy Bee Games"], "genres": ["Simulation"], "publishers": ["Cozy Bee Games"], "esrb_rating": null}