{"id": 960828, "slug": "street-brawlers-tower-defense", "name": "Street Brawlers: Tower Defense", "name_original": "Street Brawlers: Tower Defense", "description": "Welcome to the world of superhero action and defense games! Fight on the streets of Flux City, whose fate hangs in the balance! Gather a deck of heavy hitters and get ready for PvP fights, horde defense, gripping escapades, and endless fun in Street Brawlers!<br/><br/>Get ready for adventures, exploration, and epic clash showdowns!  There are so many fighters to choose from, including masters of martial arts, tech experts, and genius scientists! Randomness and tactics will win the day! Leaders play a key role, their powerful abilities can turn the tide of battle! Assemble your team and control the most important resource: Mutagen. Think at scale to develop a strategy that leverages your deck’s strengths and covers for its weaknesses!<br/><br/>This is better than castle defense! See how good you are at tower defense in PvP battles. Conquer your opponents and keep moving forward to earn more trophies! Challenge the world’s best players in defense games and show them who’s in charge! But remember that TD games are won with cunning and strategy. Stick to your plan and overwhelm enemies with quantity and quality, cutting right through their defenses! Randomness is on your side...but don’t just count on it, or you’ll find yourself watching as the enemy knocks all your towers down!<br/><br/>Fight in PvP mode or set out on TD quests with your friends! Keep fearsome bosses and their minions away from your tower gate. Base defense games are even more fun when you’re fighting together! Win tower defense games with friends to earn unique loot!<br/><br/>Energy is generated by mini gadgets, crazy inventions, and even supermutations. That’s just fantastic! No two fighters are the same, each having their own role and strengths! Gather, unite, and upgrade your heroes to stand alone as champion!<br/><br/>Street Brawlers is a tower defense clash game that doesn’t back down. Conquer and rule Flux City!<br/><br/>Follow us on Facebook:<br/><br/>https://www.facebook.com/StreetBrawlersOfficial/<br/><br/><br/><br/><br/><br/><br/><br/><br/><br/>Join our Discord:<br/>https://discord.gg/xryXdrhwpT", "metacritic": null, "released": "2023-03-20", "tba": false, "updated": "2023-05-15T04:28:59", "background_image": "https://media.rawg.io/media/screenshots/afb/afb3272977f828a0ed0a630abb9e7acf_L7zfPvg.jpg", "website": "https://sb.my.games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MY.GAMES"], "genres": ["Strategy", "Card"], "publishers": ["MY.GAMES"], "esrb_rating": "Everyone 10+"}