{"id": 960842, "slug": "lotr-heroes-of-middle-earth", "name": "LotR: Heroes of Middle-earth", "name_original": "LotR: Heroes of Middle-earth", "description": "Fantasy and adventure come together in Lord of the Rings: Heroes of Middle-earth, a strategy RPG game based on the trilogy of books by J.R.R. Tolkien. A New Ring has been discovered in Middle-earth that has the power to rewrite history. How the power is used is up to you. Will you wield it for good or will you succumb to evil?<br/><br/>Elves, wizards, and hobbits join together in a fresh visualization of a classic franchise. Build teams with your favorite fantasy characters from Lord of the Rings including Frodo Baggins and Samwise Gamgee. Explore factions of Middle-earth never seen before and collect an assortment of characters ready for battle.<br/><br/>PvP or Story - pave the way for legendary battles and social competition in an epic turn-based strategy game. Adventure across Middle-earth and form a guild to help battle your foes. Squad battles can be used to tackle the warfront or challenge other rival guilds for glory.<br/><br/>Join the Fellowship and take your squad on adventures across Middle-earth. Legendary combat, new stories and the power of the New Ring. Download today and discover your alternate ending!<br/><br/>ENTER THE WORLD OF LoTR<br/>- Battle in legendary wars for Middle-earth in an epic fantasy RPG<br/>- Dwarves, elves, wizards, hobbits and men await to take up arms <br/>- Adventure across Middle-earth &amp; experience an alternate telling of Tolkien characters<br/><br/>COLLECT CHARACTERS<br/>- Classic heroes from the Lord of the Rings universe are yours to collect in this RPG game<br/>- Role play as your favorite characters including Frodo, Sam, Éowyn and more<br/>- Legends and characters can be upgraded through a deep, long-term progression system<br/>- Explore factions of Middle-earth never before seen: Haradrim, additional Dúnedain and more<br/><br/>TURN BASED STRATEGY<br/>- PvP, Story, PvE games and more - Hone your skills across multiple game modes<br/>- Heroes with unique combat skills and abilities join forces in guilds<br/>- Play to character relationships and personalities to advance your squad<br/>- Strategy is required to unlock team-up attacks and synergy bonuses<br/><br/>LEGENDARY COMBAT<br/>- Squad battles determine success or failure in PvP games and more<br/>- Heroes of Middle-earth are yours to command in turn based wars<br/>- Battle in the warfront or defeat other rival guilds to level up your characters<br/><br/>Seize the power of the New Ring and rewrite history. Good or evil - the choice is yours. Download LoTR: Heroes of Middle-earth today.<br/><br/><br/><br/>This app: Requires acceptance of EA’s Privacy &amp; Cookie Policy and User Agreement. Requires an Internet connection (network fees may apply). Contains direct links to the Internet and social networking sites intended for an audience over 13. Allows players to communicate. Includes optional in-game purchases of virtual currency that can be used to acquire virtual in-game items, including a random selection of virtual in-game items. The app uses Google Play Games Services. Log out of Google Play Games Services before installation if you don’t want to share your game play with friends. <br/><br/>User Agreement: terms.ea.com <br/>Privacy and Cookie Policy: privacy.ea.com <br/>Visit help.ea.com for assistance or inquiries.<br/><br/>Do Not Sell My Personal Information: https://tos.ea.com/legalapp/WEBPRIVACYCA/US/en/PC/<br/><br/>EA may retire online features after 30 days’ notice posted on ea.com/service-updates.", "metacritic": null, "released": "2023-05-10", "tba": false, "updated": "2023-05-19T05:53:51", "background_image": "https://media.rawg.io/media/screenshots/923/923480b1c78c77deeb3f9beb55633f58.jpg", "website": "http://www.ea.com/iphone", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 260, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Electronic Arts"], "genres": ["Adventure", "RPG"], "publishers": ["EA Swiss"], "esrb_rating": null}