{"id": 960967, "slug": "bricks-crusher-breaker-ball", "name": "Bricks Crusher Breaker Ball", "name_original": "Bricks Crusher Breaker Ball", "description": "Welcome to “Bricks Crusher Breaker Ball”! Bricks Crusher Breaker Ball is a classic brick game popular all over the world.<br/>\n<br/>\r\nAs the world's top brick games, Bricks Crusher Breaker Ball will provide you with infinite fun. The game contains hundreds of well-designed levels, many skill blocks, and skill balls for you to explore, and different challenge modes, such as \"duel mode\". What are you waiting for? Try to use the powerful skill ball to aim at and shoot bricks, to experience the magical elimination world.<br/>\n<br/>\r\nIn the process of playing Bricks Crusher Breaker Ball, you can unlock various mysterious skill balls with levels upgrading, discover more hidden playing methods, and even participate in the unique duel levels. If you need a casual game to kill time and relieve pressure, come to Bricks Crusher Breaker Ball to eliminate troubles and create happiness!<br/>\n<br/>\r\nIntroduction to classic mode:<br/>\r\n-The ball will fly in any direction you touch<br/>\r\n-Find the best position and angle to hit each brick<br/>\r\n-Complete the mission by breaking bricks on the screen<br/>\r\n-When breaking bricks, never let them touch the bottom<br/>\n<br/>\r\nIntroduction to pong mode:<br/>\r\nIn the interesting and challenging pong theme, you and your opponent are competing in a classic game of pong. Try to use different shooting skills and strategies to win!<br/>\n<br/>\r\nFeatures:<br/>\r\n-Smooth and accurate aiming<br/>\r\n-100 + levels<br/>\r\n-Superb physical playing method experience<br/>\r\n-Many skill balls and skill blocks", "metacritic": null, "released": "2023-05-17", "tba": false, "updated": "2023-05-19T04:32:46", "background_image": "https://media.rawg.io/media/screenshots/55e/55e88852678ff9dde684604ac4b01794.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Brave Giant"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Brave Giant"], "esrb_rating": null}