{"id": 960958, "slug": "tavern-of-empire", "name": "Tavern of Empire", "name_original": "Tavern of Empire", "description": "As a spy of the Winterland Sultanate, you and your team infiltrate a town on Imperial territory. You say that you have come to fight enemies from a different dimension who haunt the dreams of the residents of Honeybull Town at night, plundering their resources unnoticed. Your main goal is to gather the supporters of the Winterland Sultanate on Imperial lands for a possible war. So, will you be able to defeat enemies of all dimensions and save the town, or will you stop fighting and fail the Winterland Sultanate?<br/><br/><strong>Features</strong><br/><br/><strong>- Fight Enemies:</strong> With the turn-based and party-based battle system, attack the enemy you want with the features you want with the hero you want. Even if one of your heroes is defeated, your other heroes will still continue to fight and avenge your defeated hero! Of course, each of your heroes has different characteristics. Sorcerer, assassin, warrior or leader?<br/><br/><strong>- Hunt Bounties in Mazes:</strong> Tired of fighting or think you have little money? Then calmly go to the maze guard in the tavern and she will teleport you into a challenging maze. If you can find the right exit without getting annoyed and bored, a nice reward could be yours in the end!<br/><br/><strong>- Gamble!:</strong> For people who like to take risks, this might be the most fun. If you have a lot of money and want more, visit the tavern and double your money! But I can't guarantee that, the Empire needs money too.<br/><br/><strong>- Talk to NPCs:</strong> While spending time in the peaceful environment of the town, you can establish a dialogue with the residents of the town. While some don't like to talk much, some have really sad stories!<br/><br/><strong>- Enter the Atmosphere with Music:</strong> These soundtracks will make you feel like you are wherever you are walking around town! Players who like a light medieval atmosphere, you will find peace!<br/><br/><strong>- Buy Rare Items:</strong> If getting armor and swords no longer takes you far in combat, you can buy rare items and get different bonuses. That's why it's absolutely essential that you stop by the \"Dealer\" in the tavern!", "metacritic": null, "released": "2023-05-17", "tba": false, "updated": "2023-05-19T04:19:56", "background_image": "https://media.rawg.io/media/screenshots/347/34793dd98ca99b64cafa928fc66f001d.jpg", "website": "https://twitter.com/gamesalid", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ali Irfan Dogan"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["ALID Games"], "esrb_rating": null}