{"id": 960941, "slug": "turbotron-2", "name": "Turbotron", "name_original": "Turbotron", "description": "Turbotron is an action puzzle game where you play as a robot trying to escape from an abandoned industrial complex. The game features 60 levels of increasing difficulty, each with unique obstacles and puzzles to solve. To progress through each level, you must collect all the gems while avoiding traps and hazards that stand in your way. You control the robot by directing it through various mechanisms that move it in the desired direction, including conveyor belts, portals, and switches.<br/><br/>As you progress through the game, the puzzles become increasingly challenging, requiring quick reflexes and careful planning to overcome. Some levels require precise timing, while others require you to use logic and problem-solving skills to find the solution. The game also features a time trial mode, where you can test your skills against the clock and compete for the fastest time on each level. With its unique blend of action and puzzles, Turbotron offers a challenging and rewarding experience for players of all skill levels.<br/><br/><strong>Features:</strong><br/><ul><li>Action-packed gameplay: Turbotron offers fast-paced, action-packed gameplay that will keep you on the edge of your seat.<br/></li><li>Challenging puzzles: With 60 levels of increasing difficulty, the game features a wide range of challenging puzzles that will test your problem-solving skills and reflexes.<br/></li><li>Unique game mechanics: The game features unique game mechanics, including portals, switches, and conveyor belts, that add an extra layer of complexity to the puzzles.<br/></li><li>Time trial mode: The game features a time trial mode that challenges you to complete each level as quickly as possible, adding an extra level of challenge and replayability.<br/></li><li>Engaging visuals and sound: With its vibrant graphics and immersive sound design, Turbotron creates a captivating gaming experience that will keep you coming back for more.</li></ul>", "metacritic": null, "released": "2023-05-16", "tba": false, "updated": "2023-05-19T03:57:24", "background_image": "https://media.rawg.io/media/screenshots/a45/a453d10eca7269e87ad07e081adfef3c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["galesoozka"], "genres": ["Indie"], "publishers": ["galesoozka"], "esrb_rating": null}