{"id": 960982, "slug": "love-on-leave", "name": "Love on Leave", "name_original": "Love on Leave", "description": "※All characters involved in sexual content are over the age of 18.<h3>＜About＞</h3>With the exception of event screens, you side-scroll through the world around you. <br/>Your goal is to enjoy your time off surrounded by nature as you nurture a hearty romance with the Amakusa sisters!<h3>＜SYSTEM＞</h3>■You have 14 days of paid leave.Use it to cultivate your budding romance with the Amakusa sisters!<br/><br/>You have 14 days of paid leave to spend in the countryside where you were born and raised. There, romance awaits! Use your time to reconnect with the tsundere middle sister, the downbeat youngest sister, and the motherly eldest sister, all of whom you grew up with. Will you choose one...or maybe even all of them? A variety of endings await based on the choices you make!<br/><br/><br/>■Get wrapped up in a myriad of special events with the Amakusa sisters!<br/><br/>Special events occur as you get to know the sisters. <br/>Play and see what sorts of unforgettable moments await!<br/><br/><br/>■Enjoy each slow country day to the fullest!<br/><br/>You can move freely around the map of the countryside.<br/>Fish, tend the field, and enjoy all the uniquely rural fun available to you.<br/>Caught fish and harvested vegetables can be used to fulfill certain Favors, but they are also potential gifts for the sisters.<br/>Keep an eye out for any number of lost items scattered around the map as well! Don't forget to take in the beauty around you as you explore to collect them all.<h3>CHARACTER</h3>・Amane Amakusa　(Voice:Ayaka Suwa）<br/><br/>・Hibiki Amakusa  (Voice:Nichika Omori）<br/>・Kanami Amakusa  (Voice: Asuka Nishi）<h3>STAFF</h3>・Character Design:Waon Inui<br/><br/>・Scenario:Takayoshi Muto(Synthese)<br/>・Planner/Producer:Yujiro Usuda", "metacritic": null, "released": "2023-05-16", "tba": false, "updated": "2023-06-02T06:05:38", "background_image": "https://media.rawg.io/media/screenshots/3fb/3fb4813edbdaf5c49eb5fac37e003eae.jpg", "website": "https://qureate.co.jp/loveonleave/en/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 478, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["qureate", "Orgesta"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["qureate", "MediBang"], "esrb_rating": null}