{"id": 961017, "slug": "whale-rock-all-games-bundle", "name": "Whale Rock All Games Bundle", "name_original": "Whale Rock All Games Bundle", "description": "<p>Save more with Whale Rock Games Bundle!</p><br/>\nWhale Rock Games Bundle brings you exciting games for a great price!<br/>Titles included in the bundle:\n\n\n\nThe Wraith of the Galaxy is a third-person space combat game. Aliens have taken over outer space in order to conduct experiments on entire planets. Destroy them or they will destroy you.\n\n\n\nPolyClassic: Wild is an action game that combines elements of the classic retro shooter and low poly styling. The player's task is to destroy all enemies that come across on the way. \n\n\n\nDofamine - You must explore the labyrinth of riddles and investigate the apocalyptic event at the research facility following the experiments with the Higgs boson, or “the God particle”. \n\n\n\nSynthwave Burnout - The lost highway awaits you to take you beyond the horizon. Relax and let the sounds of synthwave open the way into the realm of neon - a world of revived imagination and fantasy, more real than reality itself. \n\n\n\nNeuraGun - is a third-person science fiction puzzle game. The player will have to go through a maze of mysteries that will lead him out of the tangled scientific complex. \n\n\n\nTime Lock VR 2 - You have to free the soul of the ancestor imprisoned by the sorcerer in a magic stone. To solve riddles, you will need to move in time. Be careful, at the time of moving something may go wrong.\n\n\n\nCybernetic Fault - Prove your ability to read names next to the big red buttons! Show your ability to fight for life in a science center that is falling apart from the consequences of an insane scientific experiment! \n\n\n\nEuphoria: Supreme Mechanics - The ability to discern hidden connections is both a gift and a curse. The covert mechanisms of reality do not reveal themselves to any and all, and there is a price to pay for this knowledge… \n\n\n\nCyberpunk SFX - What can be more spectacular than a girl armed with rockets and a sense of humor? Yes, she is about to start solving the problems of the 21st century. And if you want to make sure she doesn’t create a few new ones, you’ll have to show her the way.  \n\n\n\nInquisitor’s Heart and Soul - Summon demonic invasions, punish heretical enclaves, punish traitors and renegades. Do not deny yourself anything - after all, you are the hand and anger of the highest good. Give the apostates darkness, so that they learn to appreciate the light! \n\n\n\nThe Divine Invasion - Strange events occur in the cyberpunk age: a mysterious criminal steals museum pieces, historical documents in order to make certain corrections and then puts everything back. Someone is trying to prove that Good and Evil have swapped places in the past… But why? \n\n\n\nNeverSynth - is a 3rd person game that is a rhythm driving simulator. This game is a dynamic action game in which you have to drive a car to rhythmic music and collect beats. The more beats you collect, the more game points you earn. \n\n\n\nHell Division -  is a game from the 3rd person, which is a battle of combat drones. This game is a dynamic action game where the main character is a military drone equipped with small arms. You have to plunge into the atmosphere of cyberpunk and confrontation between two powerful corporations.\n\n\n\nSPACE ACCIDENT - Your hero is Andy Freeman, a technical engineer of the Zeus-M700 spacecraft, sent on an expedition to the satellite of Jupiter to colonize it. However, what is conceived does not always go according to plan… \n\n\n\n\nWe are the Dwarves - is a real-time tactical adventure where you take control of three Dwarven astronauts and lead them through the hordes of enemies in the depths of their Universe. \n<br/>\n<br/>\n<p>In-game features, languages and system requirements may vary between titles. <br/>Please check particular game cards for more precise information.</p>", "metacritic": null, "released": "2023-05-14", "tba": false, "updated": "2023-05-19T05:40:53", "background_image": "https://media.rawg.io/media/screenshots/4cd/4cd36267f5597b3fa97dddc606019f9a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 460, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Whale Rock Games"], "genres": [], "publishers": ["Whale Rock Games"], "esrb_rating": null}