{"id": 96104, "slug": "soniscape", "name": "Soniscape", "name_original": "Soniscape", "description": "<p><strong>Overview</strong></p><p><em>  Soniscape</em> is an experimental project employing audio and music as a game mechanic. It is a rhythm-influenced god game which demands fast-paced real-time user interactions with a deforming voxel environment. </p><p> <em>Soniscape</em> is a gameplay-focused experience. An in depth narrative is pushed to the side in lieu of achievement and player skill progression. The Player must gather villagers to a central location (the party house) while combating music beats which emanate from this location, deforming the terrain and pushing the villagers away. Players must use the tools at their disposal to corral the villagers through this transforming environment. </p><p>  You play as the god of the beat who influences NPCs and objects of the small town/environment that is your domain. The Player controls influence via an in-game god hand that interacts with the villagers and in-world objects, directing them as the Player sees fit. </p><p><strong>How to Play</strong></p><ul><li>Click and drag with the mouse to push villagers toward the central location (could be a house, a historical landmark, etc.)<ul><li>The power bar will increase when a villager is pushed into the central location, and decrease when a villager falls off the edge of the map. If the power bar runs out, the level ends in failure. </li></ul></li><li>Click on power-up icons to activate them when they are not on cool down</li><li>Power ups: <ul><li><strong>Mute</strong> - Silences the current track, stopping the villagers from moving for a short time</li><li><strong>Boost</strong> - Increases power bar gain from pushing villagers into the central location and also decreases losses from losing villagers over the edge of the map for a short time</li><li><strong>Amp</strong> - Pulls all villagers towards the central location for a short time</li></ul></li></ul><p><strong>Developed by Rhythm Interactive Studios:</strong></p><p>Kris Holguin - Producer</p><p>Mitchell Zelik - Technical Lead/Programmer</p><p>Bryan Engle - Artist</p><p> Brad Weeks - UI</p><p>Isaac Mendoza - Sound Designer</p><p>Gabriel Thorn - Artist</p><p>Nicholas Hansen - Programmer</p><p> Josh Hirst - Artist</p><p>Daniel Specian - Artist</p><p> Jamal Stewart - Artist<br/></p><p><strong>Music</strong></p><p>If you enjoyed the music in the game, check out HabitualCloud and Johammad on Soundcloud. Thanks to both of them for letting us use their music for our game.</p><p>https://soundcloud.com/habitualcloud<br/></p><p>https://soundcloud.com/johammad<br/></p><p>Note: </p><p>The \"loading\" screen may appear to freeze at times, don't close the application (even if it says it's not responding), because it is actually still loading in the background.</p>", "metacritic": null, "released": "2016-12-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/474/4742f6c894adb85c9f6087bd79bd8364.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RhythmInteractiveStudios"], "genres": [], "publishers": [], "esrb_rating": null}