{"id": 961019, "slug": "the-smurfs-2-the-prisoner-of-the-green-stone", "name": "The Smurfs 2 - The Prisoner of the Green Stone", "name_original": "The Smurfs 2 - The Prisoner of the Green Stone", "description": "Handy Smurf has created a revolutionary invention: SmurfoMix! However, it's missing a key ingredient, the Green Stone, which is in the greedy clutches of Gargamel. So Handy Smurf and his team set off on a mission to retrieve the famous stone from Gargamel's laboratory, but a fatal misstep causes it to explode, its fragments scattering throughout the Cursed Land.<br/><br/>In addition to unleashing into the wild its incredible powers to copy and decompose matter, the Green Stone has set free the evil Stolas, a new order bent on creating a reign of terror.<br/><br/>A crack team of 4 Smurfs must then adventure through various teleporters to find the fragments of the Green Stone and piece them back together before it plunges the world into chaos. Well equipped, the Smurfs can count on the SmurfoMix and an unexpected ally... Gargamel!<br/><br/><strong><h3>GENERAL INFORMATION</h3></strong><br/><ul><li>Meet the team of iconic Smurfs: Handy Smurf, Brainy Smurf, Dimwitty Smurf, and Smurfstorm!<br/></li><li>For the first time in a video game, collaborate with Gargamel to save the Smurf Village! Use teleporters to travel through the Cursed Land and discover 3 new, unexplored regions.<br/></li><li>Enjoy dynamic gameplay with exploration, platforming, and even more intense combat thanks to the SmurfoMix!<br/></li><li>Collect various resources to acquire the BoostiBoom and upgrade the Smurfomix throughout the adventure!<br/></li><li>Embark on the adventure with a partner, friends or family in co-op mode.</li></ul><br/><strong><h3>GAME HIGHLIGHTS</h3></strong><br/><ul><li>A new story which respects the license, set in a beautiful, well-crafted game world.<br/></li><li>Accessible and intuitive gameplay that will delight both Smurf fans and action/platforming fans.</li></ul>", "metacritic": null, "released": "2023-11-02", "tba": false, "updated": "2024-01-09T19:17:57", "background_image": "https://media.rawg.io/media/screenshots/3a0/3a0335217aeec5a0ba8772d301167d70.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 1, "beaten": 1, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["OSome Studio"], "genres": ["Action", "Adventure"], "publishers": ["Microids"], "esrb_rating": null}