{"id": 961105, "slug": "old-coin-pusher-friends-2", "name": "Old Coin Pusher Friends 2", "name_original": "Old Coin Pusher Friends 2", "description": "<strong>For video creators and streamers</strong><br/>STP WORKS permits the use of our games for video distribution to YouTube and other sites, and monetization through video distribution platform partner programs.<br/><br/><strong>Game Overview</strong><br/>This is the second in a series of online cooperative coin pusher games, \"Old Coin Pusher Friends,\" set in the Edo period. Work together with other players to defeat yokai, repel groups of skulls, or aim for the jackpot. As you progress through the game, you can increase your abilities through various upgrades and equipment.<br/><br/><strong>Multiplayer</strong><br/>There are two types of multiplayer modes: random matchmaking and friend matchmaking. Whether you want to experience one-time encounters with random players or play with your friends, the game can be played in various styles. You can play with up to four people at once.<br/><br/><strong>Cooperative Events</strong><br/>There are events to defeat yokai and a barrel game where you throw coins into a bucket. Yokai become stronger as the player's strength increases, and stronger yokai result in higher rewards.<br/><br/><strong>Prize Collection</strong><br/>You can collect various prizes that fit the Edo period theme. Prize points are awarded based on the acquired prizes, and once you accumulate enough points, magatama appears.<br/><br/><strong>Ability Enhancement &amp; Equipment</strong><br/>There are various upgrade features such as the secondary coin shooter, flags, and coin attack power and firing speed upgrades. Coins are used to purchase equipment, and gradient beads are consumed to enhance abilities.", "metacritic": null, "released": "2023-05-18", "tba": false, "updated": "2023-05-22T02:39:39", "background_image": "https://media.rawg.io/media/screenshots/767/767d97f66c2eec87d70c86486881c51c.jpg", "website": "https://www.stp.works/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 17, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["STP WORKS"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["STP WORKS"], "esrb_rating": null}