{"id": 961130, "slug": "tim-climpys-warfair", "name": "Tim Climpy's Warfair", "name_original": "Tim Climpy's Warfair", "description": "<h3>A word from Tim Climpy</h3><br/>Hi, I'm Tim Climpy and welcome to my PvP FPS Warfair game.  As an expert in military warfare, i decided to collaborate with Common Blob on a first person shooter.  I was thrilled to lend my expertise to them. Unfortunately, they seemed to have ignored a lot of what I said, which is disappointing. I dont recall ever using a flamethrower with a grappling hook while parachuting ever. Not in my approximately 40 years experience! Anyway, i digress, I did lend my knowledge, whether they used it or not.<br/><br/><br/><br/>Battle your friends (and enemies?) on 8 maps across the world to see who comes top of the leader board.<br/><br/>Featuring<br/><br/><ul><li>Over 250 character customisation options<br/><br/></li><li>25+ Weapons - Assault Rifles, Pistols, Snipers, SMGs, Minigun, Shotguns, Grenades<br/></li><li>Modify your weapons to include different Muzzles, Scopes, Grips, Camos<br/><br/><br/></li><li>8 Maps<br/></li><li>Limb removal!<br/></li><li>Set the time and weather for night time conflict, or in the middle of a thunderstorm<br/><br/></li><li>An audio engine to model geometry to calculate audio occlusion, reverb and dampening effects, creating a more realistic audio experience<br/></li><li>A cape with cloth physics so you can look super cool when you run around the maps!<br/></li><li>Many Gamemodes<br/><ul><li>Classic Free-For-All mode<br/></li><li>Another classic Team Deathmatch<br/></li><li>Yet another classic Capture the Flag<br/></li><li>HODL mode where you need to hold the point<br/></li><li>Gunrace, get a kill with a gun to move onto the next weapon. <br/></li><li>Kill Confirmed - pickup the bag to confirm the kill and gain the point<br/></li><li>And coming soon: Escort the Payload - escort the payload to the destination to win, or defend against the other team</li></ul><br/></li><li>Modify each game mode with game mods:<br/><ul> <li>Chunk - After every kill you get bigger and stronger, there is no end to how much you can grow<br/> </li><li>Big Head Mode - Big heads all round. Surely more headshots?<br/> </li><li>Bouncy-Bouncy - Bouncing platforms are scattered across the maps<br/> </li><li>Hardcore - Lose the minimap, health bars and ammo count and rely on your instincts</li></ul></li><li>Drivable vehicles<br/><ul><li>Cars<br/></li><li>Tanks<br/></li><li>Planes<br/></li><li>Helicopters</li></ul></li><li>Bots, for when you have no friends!<br/></li><li>Level up and unlock new items, skins, weapons, attachments, camos<br/></li><li>No in game purchases, ever!<br/></li><li>Some destructible environments</li></ul>", "metacritic": null, "released": "2023-05-19", "tba": false, "updated": "2023-05-22T03:16:09", "background_image": "https://media.rawg.io/media/screenshots/97a/97a00ecab284c76137dc4022ec6548cf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 326, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Common Blob"], "genres": ["Action"], "publishers": ["Common Blob"], "esrb_rating": null}