{"id": 961154, "slug": "country-bumpkin-yutaka", "name": "Country Bumpkin Yutaka", "name_original": "Country Bumpkin Yutaka", "description": "Yutaka just spent a good chunk of her summer in the countryside at her grandmother's house, and she's looking forward to meeting her friends again after a month away. Besides, Keiko is coming home from the city to visit. But it quickly becomes apparent that things won't go so smoothly. First Keiko gets sick, then the priest at the local shrine tells Yutaka that something evil is spreading across town. And when their mother finally returns, she seems to be acting kind of weird.<br/><br/>Well, never mind all that! Yutaka is a brave woman with energy to spare, and she'll take any problem in stride! Accompany her on her wacky adventures to save the town with the help of her sister Keiko!<br/><br/><br/>Guide Yutaka through the town of Cocco, exploring every nook and cranny to solve its many mysteries. Where is the evil coming from, and what can be done to stop it? Why is her mother acting so weird? And what are the little shrines that seem to be scattered everywhere, just out of sight?<br/><br/>Talk to the townsfolk, solve their problems as well as your family's, and play with your friends! And whenever a wall seems insurmountable, Yutaka's sister Keiko will step in, using her knowledge and experience to solve any problem Yutaka can't tackle on her own!<br/><br/><br/><br/><br/><br/><br/><br/><strong>A Great Mystery</strong><br/>Something's definitely wrong in Cocco, and the local priest decides Yutaka is just the person to right that wrong. Complete your mission and discover what lies at the root of all evil. There may even be a special reward waiting for you at the end, one tied to a time long past...<br/><br/><strong>Dual Protagonists</strong><br/>Take control of both Yutaka and Keiko as you make your way through the story. All of the dialogue with the townsfolk will change depending on which sister talks to them, and some roadblocks can only be overcome by a specific sister.<br/><br/><strong>Hundreds of Interactions</strong><br/>Cocco is positively bursting with people who are willing to have a chat and maybe even hang out with Yutaka and Keiko for a bit. Encounter dozens of eccentric characters through the eyes of the even more eccentric Keiko and Yutaka.", "metacritic": null, "released": "2023-05-19", "tba": false, "updated": "2023-05-26T05:51:16", "background_image": "https://media.rawg.io/media/screenshots/d4c/d4caa5ac0ee942955a08275ba53f8567.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ota Guchi Field"], "genres": ["RPG", "Indie"], "publishers": ["Kagura Games"], "esrb_rating": null}