{"id": 961163, "slug": "flocity", "name": "FloCity", "name_original": "FloCity", "description": "<strong>FloCity</strong> is about energy, mass and time.<br/><br/>FloCity provides a unique experience of building using run-time AI cargo ships. Dig freeform canal networks, reform shorelines, smooth AI traffic flow, develop lands around the busy ports. Roam in your cities like a citizen via yacht, airship, and space capsule.<br/><br/><br/><h3>Start canal puzzle...</h3>Digging canal network is like solving puzzles. AI ships transport resources from the sinking Plantation Island to the hungry cities. Efficient logistic networks will spread energy flow to various ports while also allowing cities to grow.<br/><br/><br/><h3>Build adventure...</h3>Urban-scale valves interact with energy flow, including transformable architectures, changeable corridors, falling sculptures, and more!<br/><br/><br/><h3>Driving economy by AI cargo ships...</h3>Your digging will precisely reform the shoreline and guide every AI cargo ship's movement. Urban planning creates a run-time energy loop for growing cities: AI navigating - accelerating energy flow - traffic jams - canal digging - busy ports – boosting land value around the ports – rising skylines.<br/><br/><br/><h3>From citizens’ perspective...</h3>A variety of minimalist architectures can be generated, from Mediterranean to Kyoto, from Soviet cities to space. FloCity also provides relaxing experiences between levels, where you can roam like a citizen in your masterpieces on a yacht, an airship, or a space capsule.<br/><br/><br/><br/><br/>", "metacritic": null, "released": "2023-05-20", "tba": false, "updated": "2023-06-08T02:01:55", "background_image": "https://media.rawg.io/media/screenshots/fdd/fdd2ca70921605f656a4b9099e51244f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 392, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Naughty Engineering"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Naughty Engineering"], "esrb_rating": null}