{"id": 961131, "slug": "the-seven-awakenings-i-randall", "name": "The Seven Awakenings: I Randall", "name_original": "The Seven Awakenings: I Randall", "description": "You cannot repent without faith, and you cannot have faith without repentance. This is a dilemma. To be able to see the future, the past must first be created. The creation of the past is dependent on the future being lived.<br/><br/><strong>CHAPTER ONE... New Life...</strong><br/>Your name is Randall. You were born in Great Britain. You wandered in the fields. You fell into the hands of bandits. You fought. You were captured. You were whipped. Now, you will engage in trade in the promising town of Cheshire.<br/><br/>In the Middle Ages, start your business from an empty shop and expand it. Keep your product stock up to date to serve your customers well. Visit the fortuneteller to hear prophecies that include the present day. Collect various objects all over the city and learn about your own past.<br/><br/>-A city in England...<br/>-Dozens of products that can be sold at the player's shop.<br/>-Royal Taxes and Rent (Make sure to pay your royal taxes and shop rent on time!)<br/>-Thieves and Bandits...<br/>-Supplying goods to sell from the ship that docks in the harbor<br/>-Tavern for relaxation<br/>-Free roaming<br/>-Customizing your own home with furniture<br/>-Customizing your own shop with stands<br/>-Day and night cycle with real-time clock<br/>-Dynamic weather conditions (Clear, Overcast, Rainy)<br/>-Unique city views<br/>-Bookkeeping<br/>-Visiting the seer to learn various prophecies that include the present day<br/>-Books with interesting stories<br/>-Crafting. Collecting and combining various elements<br/>-Storage and use of weapons such as swords, bows, arrows, and axes <br/>-Lord's reception hall and receiving tasks from the Lord.<br/>-Health and hunger status<br/>-and much more...<br/>-Don't forget to pay your royal taxes on time. Otherwise, you will be exiled!<br/><br/><strong>Dealing with prophecies can be dangerous</strong><br/><br/><br/><br/><strong>Fight against bandits</strong><br/><br/><br/><br/><strong>Read books for knowledge...</strong><br/><br/>", "metacritic": null, "released": "2023-05-19", "tba": false, "updated": "2023-05-22T03:17:42", "background_image": "https://media.rawg.io/media/screenshots/1b5/1b53e34d7e153bb92e1bd0a8430f6db1.jpg", "website": "https://www.catsoulstudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 542, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cat Soul Studios"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["Cat Soul Studios"], "esrb_rating": null}