{"id": 961132, "slug": "dead-city-2", "name": "Dead City", "name_original": "Dead City", "description": "You have survived another invasion of the infected in a Dead City. Feel the horror and adrenaline of the process of real survival in a harsh environment! Get to know the world where hordes of zombies want to kill you, along with thirst and hunger. Immerse yourself in the atmosphere of survival now!<br/>\n<br/>\r\n■ All the streets of your city are packed to the brim with zombies, bosses, raiders and other random characters. From the resources extracted here, you can craft everything you need for survival. Always be ready to use force and skill. In the matter of survival, all means are good!<br/>\n<br/>\r\n■ Survivor, an arsenal of cold weapons and firearms is available to you, which even a sophisticated hardcore player will envy: bats, machetes, katana, good old AK-47, shotguns, submachine guns, as well as chemical grenades, Molotov cocktails, C-4 and other useful combat consumables. You can enumerate endlessly, but it's better to see with your own eyes.<br/>\n<br/>\r\n■ To improve your survival rate, find different types of armor and helmets that have unique characteristics and additional properties.<br/>\n<br/>\r\n■ Dozens of useful recipes and drawings are available. Upgrade your equipment and weapons in the forge.<br/>\n<br/>\r\nNow you are a survivor. It doesn't matter who you are, where you came from and who you were before. Welcome to the Dead City…", "metacritic": null, "released": "2023-05-19", "tba": false, "updated": "2023-05-22T03:19:19", "background_image": "https://media.rawg.io/media/screenshots/d71/d7100c177acecd939cb10f73dec0036d.jpg", "website": "https://deadcity.novalink.games/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 355, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Novalink"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Novalink"], "esrb_rating": null}