{"id": 961121, "slug": "feet-sweeper", "name": "Feet Sweeper", "name_original": "Feet Sweeper", "description": "Feet Sweeper is a variant of minesweeper with a beautiful and sexy images unlocked by solving levels. Oh and they feature feet, of course!<br/>\n<br/>\r\nFeatures:<br/>\n<br/>\r\n- Unique minesweeper-like gameplay.<br/>\r\n- Infinite replayability with generated puzzles.<br/>\r\n- 25 sexy images to unlock - with feet!<br/>\r\n- Colorful backgrounds and girl companions to unlock.<br/>\r\n- Gallery for all unlocked images.<br/>\r\n- Can be played with one hand.<br/>\n<br/>\n<br/>\r\nGameplay:<br/>\r\nEach puzzle helps you progress in the game. Solving the puzzle earns you currency which you can use to play more difficult levels. The more expensive the level, the bigger chance in unlocking one of the reward renders! The last difficulty level has a 100% chance for unlock. You need to choose your own strategy how to unlock all images and how to manage your currency. You can also spend your money in the shop, where you can unlock bonus backgrounds and girls.<br/>\n<br/>\r\nThe puzzle is a variant on classic minesweeper, where you need to find all the hidden mines in the board. If you click on the mine, you lose the level without earning any money. If you click on a tile, you uncover a number which tells you how many mines are in the neighbourhood of that tile. The first few clicks are \"safe\" preventing you from randomly losing when the board hasn't been uncovered yet.<br/>\n<br/>\r\nYou can right click on an empty tile to mark it as mine and if you are correct, it can help you to uncover the board quicker, as left clicking on an uncovered block will safely uncover all its neighbours if the appropriate number has been marked. For example, left-clicking on a 1 will uncover all neighbours when exactly one of them has been marked.", "metacritic": null, "released": "2023-05-19", "tba": false, "updated": "2023-05-22T02:59:47", "background_image": "https://media.rawg.io/media/screenshots/398/3989024702cb7600f840519ff41f415a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cute Pen Games"], "genres": ["Casual"], "publishers": ["Cute Pen Games"], "esrb_rating": null}