{"id": 961139, "slug": "emiline-the-ghost-of-white-willow", "name": "Emiline: The Ghost of White Willow", "name_original": "Emiline: The Ghost of White Willow", "description": "It's 1945, D-Day a section of British paratroopers assault a gun emplacement on the German occupied island of Jersey. But when the paratroopers take refuge in an old manor house, the horrors of its past begin to haunt the new occupants within its walls.<br/><br/><br/><br/>You play as Alfred Stuart a sergeant in the British Parachute regiment. Take part in an immersive story as Stuart and his brothers in arms take on the German axis forces.<br/>Stuart has access to a sten gun, a fully automatic machine gun. Follow your squad into combat in the early hours of the morning.<br/><br/><br/><br/>When the players are forced to occupy a nearby medieval manor house, something is not quite right; shadows start to appear and things continue to tumble out of the ordinary.<br/>Embrace the dark and figure a way out of the house as a difficult situation is placed on your section.<br/>Navigate a large number of rooms and find clues to the house's dark past, as ghostly apparitions begin to chill you to your core.<br/>Created by myself, this has been an enlightening experience and I hope you enjoy it.<br/><br/><br/><br/>So grab your weapon turn out the lights and take on White Willow Manor Hall and see if you can find your way out and navigate it's evil predecessors.<br/><br/>", "metacritic": null, "released": "2023-05-19", "tba": false, "updated": "2023-05-22T03:26:19", "background_image": "https://media.rawg.io/media/screenshots/311/3113da722b137844f0e10bfcc094c964.jpg", "website": "https://emiline.got-bacon.co.uk/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 269, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["White Willow Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Got Bacon Games"], "esrb_rating": null}