{"id": 961271, "slug": "spherum-volumetric-player", "name": "Spherum Volumetric Player", "name_original": "Spherum Volumetric Player", "description": "A whole VR-city, Volumetric avatars, free movement, interactive live objects,  and more…<br/><br/>Spherum Volumetric Player enables users to discover connections that was not possible before. Thanks to STEAM and Spherum Volumetric Player technology, you can Join us in \"exploring\" this exciting new era of VR!<br/><br/>Spherum Volumetric Player Metaverse is a Next-Gen Web3 Metaverse with Volumetric avatars to become the first metaverse that truly combines the best of VR and Volumetric technology worlds using for communication and interaction.  Spherum Volumetric Player users are able to to walk and explore a new three-dimensional world and its inhabitants, view and respond new content appearing on the platform and explore new features of Volumetric video.<br/><br/>Spherum Volumetric Player metaverse enable users to curate, discover, and explore meaningful interactions on the metaverse in a way that was not possible before.<br/><br/>We do volumetric video or volumetric capture. We’ve captured athletes, musicians, and public figures. We pride ourselves on extremely high-quality, high-resolution capture—the closest thing to the real thing of standing next to or sitting across from or observing that person. Looking to the future, there are also aspects of live volumetric video on the horizon where we’re live broadcasting musicians or performances into the metaverse as well.<h3>Join Our Community! Welcome to the Metaverse!</h3>", "metacritic": null, "released": "2023-05-23", "tba": false, "updated": "2023-05-26T03:29:30", "background_image": "https://media.rawg.io/media/screenshots/4f9/4f93ffd752c34ec878dad7aeb8501382.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Spherum LLP"], "genres": [], "publishers": ["Spherum LLP"], "esrb_rating": null}