{"id": 961228, "slug": "paranormal-hunter", "name": "Paranormal Hunter", "name_original": "Paranormal Hunter", "description": "Explore eerie haunted houses and abandoned ruins alone or with up to four friends and search for mysterious “symbols of grudges.” <br/><br/>Never let down your guard, as grudges manifesting as evil spirits destroy all in their path. Use UV lights to push back against the grudges in the darkness to buy precious moments to escape with your life and sanity.<br/><br/>Collect the sigils and bring them to magic summoning circles to banish the otherworldly evil.<h3>Cross-platform:</h3>Paranormal Hunter supports standard keyboard and mouse inputs as well as Oculus Rift VR devices. Controller and gamepad support are also available via Xinput.<h3>Online co-op multiplayer:</h3>Join forces with up to four other players and track down the grudge symbols before facing supernatural challenges!<h3>Variations:</h3>Experience untold horrors with dynamically changing stages,ensuring no two sessions are the same.<br/><ul><li>“symbols of grudges.” don't always fall in the same place.<br/></li><li>The debris blocking the road may not be blocking the same part of the road every time.<br/></li><li> magic summoning circles don't always appear in the same place.</li></ul><h3>Repeated Play:</h3>Earn rewards by banishing evil and purchase useful items to aid your future expeditions. But be warned, failing to survive means losing your extra items!<h3>Items:</h3><ul><li>Ghost sensor</li></ul>It will show you the presence of evil spirits.<br/><br/><br/><ul><li>Incense</li></ul>It gives off a scent that evil spirits do not like.<br/><br/><br/><ul><li>Amulet</li></ul>It will hide you from the sight of evil spirits.<br/>", "metacritic": null, "released": "2023-05-21", "tba": false, "updated": "2023-05-26T02:35:17", "background_image": "https://media.rawg.io/media/screenshots/e2c/e2c5557e5f0c679cfb2b7cd2eedcc674.jpg", "website": "https://paranormalhunter.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EALoGAMES"], "genres": ["Action", "Casual", "Indie"], "publishers": ["EALoGAMES"], "esrb_rating": null}