{"id": 961259, "slug": "dark-desire-mute-5", "name": "Dark Desire Mute 5", "name_original": "Dark Desire Mute 5", "description": "<h3>Dark Desire Mute 5</h3><br/>This <strong>VISUAL NOVEL</strong> continues the life of the girls in the Cindy universe, even at different ages. This way you can explore all kind of kinks and pleasures and topics. This complex story includes also the life of Stephanie, Michelle, Monica, etc.<br/><br/>There are critical decisions and different paths to take, as well as the outfits options. Choose different outfits where possible.<br/>Sound effects have been added: door open, door close, air conditioning, slap, spank. ambient music or ambient sounds, etc.<br/><br/>The visual novel has the following episodes:<br/>Episode 01 --- Taking Down Jeff<br/>- contains Smart Break (personality types) and different positions for the \"hot action\"<br/>Episode 02 --- Return to SOFI<br/>- contains path for \"Cindy goes back to SOFI\" and \"Cindy will try on her own\" with the Smart Break (assertiveness)<br/>Episode 03 --- Stephanie Gets Suspicious ------ more content to come / in production<br/>Episode 04 --- Steph's Revenge ------ more content to come / in production<br/><br/>Episode 01 - “I’ll send you all the details and I’ll pay you for your time of course. If you ever get too nervous, or you’re worried, we can call Cindy to back you up.” --- Stephanie to Addison<br/>Episode 02 - “What IS the loyalty test?” Cindy tries to demand.<br/>Episode 03 - \"When she wants something she gets it. It’s always been hat simple. Say the right things, bat her eyelashes, maybe flash some cleavage or ass. So why is it backfiring right now?\" - Stephanie to herself<br/><br/>We want to make this the best visual novel ever and we're focused on quality, quantity and value. On content we have a lot for 1 month of work - if you love this VN we'll give frequent updates. For the quality we'll improve the paths and decisions, to add more meaning and more real life scenarios (assertiveness, negotiation, how to talk with different type of people, etc.)<br/>Quality commitment:<br/>- add as many <strong>fine details</strong> as possible (paintings, furniture, props, earings, necklace, make-up, etc.)<br/>- add real-life scenario <strong>logic </strong>to paths and dialog<br/>- add <strong>sounds effects</strong> where possible (door closing, car starting, ambience sounds)<br/>- create more background places, like house, park, fashion stage, etc.<br/><br/>Superior real life logic includes:<br/>- Personality types<br/>- Assertiveness", "metacritic": null, "released": "2023-05-23", "tba": false, "updated": "2023-05-26T03:12:16", "background_image": "https://media.rawg.io/media/screenshots/f95/f95d1b76bb4922f9683eb00f08f7a99d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 386, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["coderenderx"], "genres": ["Casual"], "publishers": ["coderenderx"], "esrb_rating": null}