{"id": 961242, "slug": "flying-carpets-over-shark-infested-waters", "name": "Flying Carpets Over Shark Infested Waters", "name_original": "Flying Carpets Over Shark Infested Waters", "description": "This is a game focused on combat and survival. You have pistols, shotguns, flamethrowers and sometimes a Gatling gun. You travel by foot, by motor boat and when possible by flying carpet. Everyone and everything is trying to kill you. Pirates, sharks, rats, snakes, werewolves, eagles, carnivorous plants, crocodiles, mad rabbits and above all your arch enemy the parrots. There are four levels.  <br/>\r\nLevel One - The Training Room. This is where you learn to acquire and use weapons and fly the carpet. The pirates, sharks and rats are passive. But there are traps and many ways to die in training. Watch out for the carnivorous plants and do NOT go out of bounds. When you are ready you can activate all enemies and attempt to find the exit key and get out alive. You will be assessed. If you fail you will be fed to the snakes. No exceptions.<br/>\r\nLevel Two - The Gatling Gun Practice Range. You will enter a deadly maze full of rats, werewolves and snakes and all you have is a Gatling Gun with 5000 rounds and only five minutes to find the exit. Don't get too close to the mad rabbits. They're all crazy. And easily provoked. Beware the  Dark Room. If you enter you will never leave.<br/>\r\nLevel Three - Flight Combat School. This is a fight to the death against pirates also on flying carpets and a bunch of very angry eagles. In practice mode none of them can see you but in all-in mode they can and they really, really don't like you. The sharks are swimming in the sea below.  Always eager and always hungry.<br/>\r\nLevel Four - Escape From Rat Island. This is where you get to use all of your skills and experience to attempt an escape from the Island. Everything is out to get you. The crocodiles lie in wait. Be wary of Siren Island. Not everything is as it seems. Board the Pirate Ship .. carefully. Don't go into the water if you want to go on living. There are sharks everywhere. To use the exit portal you will need the exit key and sufficient gold to cover the exit fee. You will also need to have found and terminated the parrots.", "metacritic": null, "released": "2023-05-22", "tba": false, "updated": "2023-05-26T02:52:00", "background_image": "https://media.rawg.io/media/screenshots/2cf/2cf4118e78b6e77d7b46d26f8db5085a.jpg", "website": "https://madmagpies-studio.com.au", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mad Magpies Studio"], "genres": ["Action", "Adventure"], "publishers": ["Mad Magpies Studio"], "esrb_rating": null}