{"id": 961261, "slug": "kingmaker-academy-warriors-duels", "name": "Kingmaker Academy: Warrior's Duels", "name_original": "Kingmaker Academy: Warrior's Duels", "description": "Kingmaker Academy is excited to announce the start of its most anticipated tournament! And this time, the focus is on our brave warriors, who will face their colleagues in intense roguelike deckbuilder duels.<br/><br/><br/><br/>You won't want to miss the action to come! Our valiant warriors will put aside conventional monster battles to duel in 1v1 with their colleagues, who have unique and powerful abilities.<br/><br/><br/><br/>Winning each duel gives you the opportunity to upgrade your card battles, learning new techniques and creating your own fighting style! Get ready to see the most amazing skills and cunning strategies in action! <br/><br/><br/><ul><li><strong>Replayability</strong> upgrading different cards to <strong>evolve your character</strong> and <strong>earn achievements</strong>;<br/></li><li>Roguelike with <strong>perma-death</strong>;<br/></li><li><strong>Fine</strong> and <strong>tuned</strong> card duel gameplay to make you feel like a <strong>true duelist warrior</strong>;<br/></li><li>Stylized <strong>anime</strong> art-style;<br/></li><li><strong>Metal</strong> Music OST to enhance your warrior duelist skills.</li></ul>Oh! If you're new and haven't heard about this tournament, let me explain: the Kingmaker Academy tournament is responsible for deciding the next king who will defend our nation. Young people from all over the kingdom train and fight daily, to be able not only to defend our country, but also to have the chance to lead it someday.", "metacritic": null, "released": "2023-05-23", "tba": false, "updated": "2023-05-26T03:17:06", "background_image": "https://media.rawg.io/media/screenshots/391/3916c31b905da77a6797986b8492938f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["2dragontails"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["2dragontails"], "esrb_rating": null}