{"id": 961268, "slug": "turbo-shell", "name": "Turbo Shell", "name_original": "Turbo Shell", "description": "<strong>Turbo Shell</strong> is a fast-paced precision platformer with a unique movement mechanic: instead of running and jumping, you push and pull yourself through levels as Craig the Egg with the help of the EPS (Egg Propulsion System).<h3>Pick up the EPS and get going</h3> <br/><br/>The EPS allows you to glide through the five worlds of Turbo Shell: push yourself off surfaces using the blue ray, or pull yourself towards walls and ceilings using the orange ray.<br/><br/>Using the EPS is easy to learn. By perfecting your moves, you'll find even faster and more efficient ways to complete levels. Enjoy the rewarding feeling of skillfully flying through the different worlds and climb up the ranks on the leaderboard.<h3>Overcome obstacles and avoid hazards</h3><br/><br/>Sizzling laser barriers, flying buzzsaws and hazardous corridors are littered along your path. Avoid them to make sure you don’t get scrambled!<br/><br/>Completing levels without getting smashed will become more and more difficult as you progress. Instant respawns and checkpoints will help you stay motivated and reach your goal.<h3>Collect all Targets</h3> <br/><br/><br/>The universe as we know it is in danger at the hands of the malicious Evil Egg, but, as Craig, you can save it by collecting targets that are scattered throughout each level. Make sure to reach them all in high-speed to get rewarded with a spot on the leaderboard!<br/><br/><br/><br/><ul><li><strong>Unique movement mechanic:</strong><br/>Push and pull to get ahead - in the first game that's both repulsive and attractive at the same time.<br/></li><li><strong>Fast-paced precision platformer:</strong><br/>Collect all targets as fast as you can - but beware of the deadly hazards.<br/></li><li><strong>Challenging and rewarding:</strong><br/>Prepare to crash. A lot. Instant respawns will get you going again in no time and a hard-earned victory tastes all the sweeter!<br/></li><li><strong>Test your skills in different settings:</strong><br/>From an abandoned space station to the icy worlds of the Frost Empire, discover new mechanics and hazards in the first 4 worlds before unlocking the hidden 5th world and its 18 additional levels!<br/></li><li><strong>Survive epic Boss Battles:</strong><br/>Evil Egg will hunt you in extra challenging, dynamic boss levels at the end of each world. Defeat him to move along!<br/></li><li><strong>There is no easy mode in Turbo Shell</strong><br/>… but if Normal and Hard mode aren’t enough, why not unlock Nightmare mode to get the full eggsperience!<br/></li><li><strong>Feel the rhythm:</strong><br/>Enjoy the arcadey retro experience with a driving synthwave soundtrack by Pete Frogs.<br/></li><li><strong>Gotta hatch ‘em all!</strong><br/>They need your help! Find and unlock a colorful roster of characters to play as.<br/></li><li><strong>Climb global Leaderboards:</strong><br/>Place a rank in the global leaderboards. Watch runs from the world's best players and beat their ghosts head-to-head.</li></ul><br/>", "metacritic": null, "released": "2023-05-23", "tba": false, "updated": "2023-05-26T03:25:38", "background_image": "https://media.rawg.io/media/screenshots/27f/27f0cb1b84a95a7703a33be247f35ad6.jpg", "website": "http://radioactivedreams.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Radioactive Dreams"], "genres": ["Action", "Indie"], "publishers": ["Radioactive Dreams"], "esrb_rating": null}