{"id": 961349, "slug": "dynopunk", "name": "Dynopunk", "name_original": "Dynopunk", "description": "<strong>Dynopunk </strong>is an ironic adventure set in a cyberpunk world where dinosaurkind has replaced humanity. Run a repair shop, fix gadgets, find a personalized approach to every customer by offering them beverages and having deep heart-to-heart conversations. All to sort out your private life and chase your ultimate dream!<br/><br/>Imagine that a meteor had never struck the Earth, so the dinosaurs did not go extinct but continued to evolve. Now, millions of years later, they inhabit high-tech megalopolises. One such dino is Chris, a repair shop owner who dreams of building a Time Machine to travel to the past and find true love, because he is the last remaining T-Rex on the planet!<br/><br/><strong>Meet Cyberpunk Dinosaurs</strong><br/>Enjoy pixel art that pays homage to 1990s retro games. Meet a cast of memorable characters from an alternative future where predatory, carnivorous dinosaurs have come to rule the world. Relax to the sound of a Lo-fi soundtrack as you progress through the story and make plot-altering decisions.<br/><br/><br/><strong>Fix Gadgets</strong><br/>Elicit relevant information from your clients to find the source of the problem and fix their gadgets. Perform your work neatly and carefully — your income depends on it.<br/><br/><br/><strong>Chat up the Customers</strong><br/>Strike up heart-to-heart conversations with customers and offer them a beverage to their liking. A glass of cool fizz or a cup of hot coffee increases your chances of getting tips.<br/><br/><br/><strong>Follow the Dream</strong><br/>You play as the last surviving T-Rex on Earth, trying to build a Time Machine and travel to the past to find true love. Will this dream ever come true?<br/><br/><br/>Features:<br/><ul><li>A branching story, driven by conversations with the customers and the quality of your repairs.<br/></li><li>Great opportunity to exchange pleasantries with a quirky assistant — a talking printer that enjoys teasing Chris about his little arms and likes to give questionable business advice.<br/></li><li>Drink-serving simulator, which affects not only the customers' mood but also the size of your tip.<br/></li><li>Original, 1980s-inspired Lo-fi soundtrack! Pour yourself a cup of hot tea, then sit back, relax, and get immersed in the story.<br/></li><li>A variety of interesting characters that will pay a visit to your repair shop. Each of them comes with unique traits, dreams, and a personal story that can be influenced by player choice.<br/></li><li>Dialogues full of irony, jokes, references, and Easter eggs to cheer you up!<br/></li><li>Pixelated graphics inspired by 1990s retro gaming.</li></ul>", "metacritic": null, "released": "2023-05-25", "tba": false, "updated": "2023-09-20T21:56:01", "background_image": "https://media.rawg.io/media/screenshots/b9b/b9b727689587b9681e78eec670f06fd8.jpg", "website": "https://store.101xp.com/en/games/dynopunk", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 8, "beaten": 2, "toplay": 4, "dropped": 3}, "playtime": 11, "achievements_count": 50, "ratings_count": 3, "suggestions_count": 434, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Tomato Fantasy Games"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["101XP"], "esrb_rating": null}