{"id": 961327, "slug": "hit-the-bit", "name": "Hit the Bit", "name_original": "Hit the Bit", "description": "Hit the Bit is a PvP game where players can create their very own unique character from scratch. The game offers complete customization of each statistic, including the character's special ability. Players can create their very own character from a variety of statistics and abilities for a unique experience each fight.<br/>Once players have created their character, they enter a virtual arena to duke it out in an intense action packed battle. Winning games earns players money, which they can use to buy more characters.<br/>Hit the Bit also includes a trophy system, where players earn trophies for winning games. These trophies can be used to unlock things like money or adorable buddies from the battlepass(that's completely free). Buddies follow the player and provide moral support during intense battles.<br/><br/><br/><ul><li> Online PvP either 1v1 or 4 player free for all</li></ul><ul><li> Solo practice mode or online sandbox mode</li></ul><ul><li> Buddies</li></ul><ul><li> Character customization</li></ul><ul><li> 15+ unique abilities</li></ul><ul><li>Online leaderboard</li></ul><ul><li> Intense flopping action</li></ul><br/><br/>Hit the Bit has 3 different game modes currently with more to come. With the amount of character variety matchups can result in crazy battles, each being unique. For example:<br/>John could have spinner as his special ability, it is a triangle that deals damage and knocks over any player that comes in contact with it<br/><br/><br/><br/>Whereas Ernest could have vortex as his which draws in all things including him and his spinner's.<br/><br/><br/><br/>The result of this battle will most likely end poorly for John.<br/><br/>", "metacritic": null, "released": "2023-05-24", "tba": false, "updated": "2023-05-26T04:48:23", "background_image": "https://media.rawg.io/media/screenshots/914/914759f7d60bfc8f230b2d2a9a80530e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dog Dog Studios"], "genres": ["Action", "Indie"], "publishers": ["Dog Dog Studios"], "esrb_rating": null}