{"id": 961464, "slug": "heroes-of-spyria", "name": "Heroes of Spyria", "name_original": "Heroes of Spyria", "description": "\"Heroes of Spyria\" is a classic JRPG-style game that will take you on an epic adventure across the world of Spyria. Join the brave trio of Madilyn, Hiro, Winter and a colorful cast of supporting characters as they embark on a dangerous journey to save the world from the evil organization known as LEGION. Using turn-based combat mechanics reminiscent of classic Final Fantasy games, you'll engage in exciting battles against hordes of enemies as you level up your characters and unlock powerful new abilities.<br/><br/>Drawing inspiration from classic NES/SNES games like Chrono Trigger, Final Fantasy, Lunar Silver Star and Legend of Zelda, \"Heroes of Spyria\" is a nostalgic trip down memory lane for any fan of retro gaming. Featuring 5 chapters, over 20 hours of game-play, side-quests, achievements and hidden secrets, you'll be immersed in a world filled with magic, adventure, and peril. As you level up and progress through the game, you'll uncover more of the lore and secrets of Spyria and discover LEGION's true agenda.<br/><br/>Set in the fictional land of Spyria, the game features three unique kingdoms and a host of colorful characters to meet along the way. From the bustling streets of the eternal city of Ivalace to the dark depths of abandoned ruins lost to antiquity, the world of Spyria is waiting for you to explore. It's a journey that is sure to capture the hearts of classic JRPG fans everywhere!<br/>", "metacritic": null, "released": "2023-05-25", "tba": false, "updated": "2023-09-15T06:03:17", "background_image": "https://media.rawg.io/media/screenshots/6fb/6fbde6503f90cb8ba515159fbcbde126.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vesper Studios"], "genres": ["RPG", "Indie"], "publishers": ["Vesper Studios"], "esrb_rating": null}