{"id": 961413, "slug": "vr-tai-yang-xi", "name": "VR-太阳系", "name_original": "VR-太阳系", "description": "<ul><li>Welcome to our unique space exploration journey! Here, you will personally experience the realistic space environment, feel the free floating without gravity and the stunning scenery of the starry sky. Be prepared to release yourself, move freely in the universe, and explore the mysterious objects around you.<br/>As soon as you step into our space amusement park, you will be ushered into a brand new universe world. Experience the charming charm of weightlessness, floating freely like an astronaut. You can explore interstellar ships, planetary surfaces, and space stations, and observe the wonders of the universe up close, as if you are in person.<br/>In our space simulator, you will personally experience thrilling spacewalks and space flights. Challenge your balance and courage to become a true explorer in the universe. At the same time, looking up at the beauty of the starry sky, immersed in the mystery and infinite possibilities of the universe.<br/>Whether you are a science fiction enthusiast, space exploration enthusiast, or an adventurer full of curiosity about the unknown, our space exploration journey will definitely captivate you. Bring your curiosity and courage to explore this realistic and beautiful space world together!</li></ul><br/><ul><li>When I stepped into this unparalleled solar system simulator, I was immediately attracted by the charming scenery of the universe. I feel the freedom without gravity, like an astronaut floating freely in virtual space. I gazed at every planet in the solar system, witnessing their movements and trajectories firsthand.<br/>First of all, I quietly watched Mars, shining red like a flame, with an elegant orbit revolving around the sun. Then, I witnessed the charm of Venus, emitting a bright light in the sky, dazzling like a gem.<br/>I gazed at Saturn's magnificent halo, spinning around itself like an elegant dancer. Jupiter, on the other hand, showcases its massive gas atmosphere and mysterious red spots, which fills me with awe.<br/>I continued to walk and observe Mercury, Pluto, and other planets, each with unique characteristics and ways of movement. I couldn't help but be deeply attracted by the magnificent scenery of the universe, as if integrating into it through time and space.<br/>This journey to the solar system is so unforgettable that I feel the mystery and infinite possibilities of the universe. I witnessed the motion of planets firsthand, as if I had become a part of the universe myself. Whether you are an astronomy enthusiast or someone curious about the mysteries of the universe, this solar system stroll will bring you a lifetime unforgettable experience!<br/>First person experience walking in the solar system to observe how the eight planets move!</li></ul><br/><ul><li>Wearing a VR helmet, you will instantly be taken into a realistic space world. Walking immersively between the stars, experiencing the infinite vastness and mystery of the universe. You will witness the elegant movements of the eight planets with your own eyes, and observe their beauty and uniqueness up close.<br/>With the guidance of virtual reality technology, you will personally control spacecraft, fly freely in the universe, and explore unknown galaxies and planets. Experience free movement in a gravity free environment, appreciate the brilliance of the starry sky and the magnificent scenery of galaxies.<br/>In this VR space tour, you can truly experience the excitement and fun of space exploration. Join us now and embark on your space journey! </li></ul>", "metacritic": null, "released": "2023-05-27", "tba": false, "updated": "2023-05-29T02:14:31", "background_image": "https://media.rawg.io/media/screenshots/8bc/8bc406aecf85f2dcc11168684ace0961.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["001"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["001"], "esrb_rating": null}