{"id": 961491, "slug": "need-for-drifting", "name": "Need for Drifting", "name_original": "Need for Drifting", "description": "\"Need for Drifting\" is an adrenaline-fueled game that is perfect for anyone who loves the thrill of drifting and the excitement of competition. In this game, your mission is to become the number one drifter in your city. You will compete against other participants in various drifting competitions to see who can earn the most points and come out on top.<br/>\n<br/>\r\nTo achieve your goal, you will need to master the art of drifting. You'll need to learn how to control your car's speed and direction while maintaining a controlled slide. You'll also need to use your skills to rack up points by performing spectacular drifts, burnouts, and other impressive stunts.<br/>\r\nThe game features a variety of different drifting competitions, each with its own set of challenges and rewards. You'll compete in races, time trials, and freestyle competitions, each with its own unique set of rules and requirements. You'll also be able to customize your car with a range of upgrades and modifications to help you achieve maximum performance and dominate the competition.<br/>\n<br/>\r\nAs you progress through the game, you'll face increasingly difficult opponents, each with their own unique driving styles and strategies. You'll need to stay focused and determined if you want to come out on top and claim the title of the ultimate drifter.<br/>\r\n\"Need for Drifting\" is a thrilling and exciting game that will keep you on the edge of your seat as you compete against other skilled drifters. Get ready to experience the thrill of the drift and the rush of competition in this high-speed racing game.<br/>\n<br/>\r\nGame Features:<br/>\r\n- 60 levels<br/>\r\n- Daily reward<br/>\r\n- 25 drift cars", "metacritic": null, "released": "2023-05-27", "tba": false, "updated": "2023-05-29T04:00:40", "background_image": "https://media.rawg.io/media/screenshots/30b/30bc387c3f83d9c6f83ee3320c855aac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 243, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Atomic Fabrik"], "genres": ["Adventure", "Simulation", "Sports", "Racing", "Casual", "Indie"], "publishers": ["Atomic Fabrik"], "esrb_rating": null}