{"id": 961473, "slug": "retro-rocket-raiders", "name": "Retro Rocket Raiders", "name_original": "Retro Rocket Raiders", "description": "<strong>GOAL</strong>To get to Ukraine ASAP, us$1000 will do it<br/><br/><strong>BACKGROUND</strong>Very long and complicated story (involving myself in holland and not doing the right thing in the late 90s), Now relevant to this goal. as soon as russia invaded I had to go, thus went last year in the start of the war, but only for 2 weeks (I helped out with the redcross FWIW) but it still left an emptyness though because of a promise I returned back to catalunya/spain.<br/><br/><strong>REASONS why Im qualified to go</strong>I have lived a full life, more than most, (humble brag) yeah .. my body is starting to give out, yet we ask 20 year olds to sacrifice themselves for (on the russian side), nothing for some old geriatric wankers dream in the kremlin of getting the old gang back together, literally W ... T ... F ...<br/> now for me that I must say, personally saddens me. If someone has to die, better me (Im 0 percent suicidal btw .. yes honestly really, I do abhor suicide, so much I want to see ppl return to the moon and go to mars .. but one has to stand for your beliefs, and logically in a fight I'll pick this grizzled ol ' twat over some 20 yr old not to panic when all hell breaks lose ) <br/>and if its a case of capturing prisoners, you know I will treat them right and stand up for them, cause I have no hatred for Russians, I love that country .. yes that land has gone down a bad path but dont punish everyone FFS, they are people and related to other people who will be sad with their needless deaths.<br/><br/>$1000us its not much to ask is it? If I can replace some kid from Sumy, then thats a life saved<br/><br/>The game? Glad you stuck around well its ....<br/>A Twin Stick fast Shmup where you can equip your Spaceship with various weapons at once. Be warned even though there are different difficulty levels this game is not easy. You have 2 extra abilities to help you survive. The standard Smartbomb but also the duck function, which puts your spaceship down on the ground, so you can duck under enemies or their bullets, or use it to shoot ground based enemies. <br/>At the end of each stage (which usually take between 30 seconds and 2 minutes) you can use the various gems you've collected to buy weapons or upgrade your ship.<br/><br/>Showing the Duck ability<br/><br/><br/><ul><li>Lots of different powerups<br/></li><li>&gt;20 different weapons you can attach to your ship<br/></li><li>Various ways to upgrade your ship<br/></li><li>&gt;30 different enemies, including Boss battles, challenging stages</li></ul>", "metacritic": null, "released": "2023-05-26", "tba": false, "updated": "2023-05-29T03:39:01", "background_image": "https://media.rawg.io/media/screenshots/0a0/0a0ec0e1f4c655afcb6adff9a3ce23aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 243, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zed Zeek"], "genres": ["Action"], "publishers": ["Zed Zeek"], "esrb_rating": null}