{"id": 961428, "slug": "grimm-of-the-dome", "name": "Grimm of the Dome", "name_original": "Grimm of the Dome", "description": "In this non-linear adventure game made by only one jobless poet, your choices and dices will lead people in this Utopia or Distopia to different endings.<h3>Wander in the last city of human civilization as Agent Grimm</h3><ul><li>Roll the dice to stop at a random point of the daily patrol as an Archival Division agent.<br/></li><li>Drop pins on the map to stop at a designated point and advance the investigation.<br/></li><li>Meet with various people and witness/influence their unique lives.</li></ul><h3>Help the \"super magistrate AI\" to investigate the mystery cases</h3><ul><li>Investigate the sudden suicide of the most influential religion leader of the city, with neither omen or last words, but wired manner of death destroying the implant chips, and an unknown intruder at the scene.<br/></li><li>Investigate the returnal of dead people, and their possible connections to the illicit psychotropic substances and uncontrolled AI.<br/></li><li>Investigate the religious group which has over 1/4 of human population as their adherents and their dangerous scientific research projects.</li></ul><h3>Meet with the Ai-worship religion, the gangs, those who are challenging the distinction between humans and androids, and other residents of the Dome City.</h3><ul><li>Wander in the city constructed by an over 200,000-word parable of science and politics.<br/></li><li>Play through tens of side stories, and encounter people of unique characteristics and history.<br/></li><li>Unlock all 4 different endings, leading the city to its utopia or distopia future.</li></ul><h3>**The English translation is currently based on machine translation. A manually-verified translation will soon be updated in the patch v1.01. **</h3>", "metacritic": null, "released": "2023-05-25", "tba": false, "updated": "2023-05-29T02:33:26", "background_image": "https://media.rawg.io/media/screenshots/e22/e2222406ff18d59f4de2663fbe8877cd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["Adventure", "Indie"], "publishers": ["S.L."], "esrb_rating": null}