{"id": 961417, "slug": "knight-trail", "name": "Knight Trail", "name_original": "Knight Trail", "description": "In this game, you are tasked to explore a retro, but vast world. You'll have to keep track of your stats and supplies. You'll encounter many text-based events, which will often ask you to make difficult and not-so-difficult decisions.<br/><br/>Be sure to check out the website and printable manual too! Without a map, you might get lost. This game is a simplified version of a retro JRPG. Anyone can play, as long as they don't mind dying so much.<br/><br/><br/><br/><br/><strong>The Story</strong><br/>You are Sir Knick, an honorable knight sworn to protect the kingdom of Faraway. Thus far, your days have been spent helping the people. Finding lost cats, chasing away rodents, and banishing lost souls back to the darkness from which they came. Quite the knightly life.<br/><br/>One night, when listening in on a group of traveling merchants, you heard a worrying rumor. It seems that, after marrying a Warlcok's muse, your brother got cursed! The evil Warlock transformed him into a raging dragon.<br/><br/>Now it is on you to defeat the Warlock and lift the curse before your brother sets the kingdom ablaze.<br/><br/>However, it would be unwise to walk into their lair unprepared. They say a Warlock can only be killed by the blade they carried as a mortal. It must still be in one of their 4 castles.<br/><br/>Good luck, Knight.", "metacritic": null, "released": "2023-05-25", "tba": false, "updated": "2023-05-29T02:19:17", "background_image": "https://media.rawg.io/media/screenshots/c87/c87e6cf007e4e9cf8d1b255c7fda26d6.jpg", "website": "http://knighttrail.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Studio Bearvibes"], "genres": ["RPG"], "publishers": ["Studio Bearvibes"], "esrb_rating": null}