{"id": 961433, "slug": "kortstrid", "name": "Kortstrid", "name_original": "Kortstrid", "description": "Kortstrid is an enthralling trading card game (TCG) set in a vast and immersive fantasy world, blending elements of MMOs and strategic battles to provide players with a truly unique gaming experience. At its core, Kortstrid features a diverse cast of heroes, enemies, bosses, gods, NPCs, and companions, each possessing their own distinct abilities and roles within the game. One of the most remarkable aspects of Kortstrid is that the cards are uniquely created for every player, ensuring that more often than not, no two cards are the same.<br/>\n<br/>\r\nAs players collect beautifully illustrated cards, they can level up, hone their skills, and engage in a variety of cooperative and competitive challenges. In Kortstrid, players will find an engaging in-game economy, numerous game modes, and card rarities that cater to various playstyles. The game emphasizes strategic gameplay and encourages players to form alliances, creating a dynamic and exciting experience for both casual and hardcore gamers. As part of its ongoing commitment to expanding the Kortstrid universe, the development team actively hosts tournaments and community-driven events, fostering a vibrant and active player community.<br/>\n<br/>\r\nThe game is available across multiple platforms, ensuring that players can enjoy Kortstrid whenever and wherever they want. In future development plans, Kortstrid aims to transcend the digital realm by offering real-life cards, further enriching the gameplay experience and providing players with new opportunities for exploration and adventure. So gather your cards, assemble your ultimate deck, and join the ever-growing Kortstrid community as you embark on a thrilling journey filled with camaraderie, breathtaking landscapes, and exhilarating battles.", "metacritic": null, "released": "2023-05-26", "tba": false, "updated": "2023-05-29T02:39:54", "background_image": "https://media.rawg.io/media/screenshots/8a3/8a31aaef6855d89023bf62d7df6d8225.jpg", "website": "https://www.kortstrid.io/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 503, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wicked Studios"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Casual"], "publishers": ["Wicked Studios"], "esrb_rating": null}