{"id": 961408, "slug": "vikings-hnefatafl-kings-of-the-dark-age", "name": "Vikings Hnefatafl: Kings of the Dark Age", "name_original": "Vikings Hnefatafl: Kings of the Dark Age", "description": "<strong>Vikings Hnefatafl: Kings of the Dark Age</strong> is a historical turn-based strategy game, based on the ancient hnefatafl board game played by Vikings.<br/><br/>The game itself has a very simple structure, albeit having been slightly altered from its original medieval form into a more computer game-esque format. The idea is to kill the enemy King, while simultaneously protecting your own at all costs. Compose your army, chart the map, and move wisely.<br/><br/>The game is set at the onset of the Viking invasions of Britain in the early Middle Ages. The Campaign follows the advance of the Vikings into the Anglo-Saxon kingdoms, facing powerful kings such as the legendary Alfred the Great.<br/><br/>You will be leading either the Vikings or the Saxons into victory - or defeat - in this highly tactical yet calmly paced strategy game where every move counts.<br/><br/>FEATURES<br/><ul><li>Single-player Campaign and Custom Battles against Computer<br/></li><li>Two-player Custom Battles in hotseat, or online over Remote Play<br/></li><li>Highly customizable: choose board size, personal banner, Computer difficulty, etc.<br/></li><li>A massive number of Custom maps (board types) generated for both Small and Large sizes<br/></li><li>Large list of different types of game pieces, or ''units'' each with their own strengths or weaknesses<br/></li><li>Different terrain types affect gameplay</li></ul>", "metacritic": null, "released": "2023-05-27", "tba": false, "updated": "2023-05-29T02:09:01", "background_image": "https://media.rawg.io/media/screenshots/907/907c2f2bbc78bb572464deda597c57a4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AcroGames"], "genres": ["Strategy"], "publishers": ["AcroGames"], "esrb_rating": null}