{"id": 961424, "slug": "dead-town-tales", "name": "Dead Town Tales", "name_original": "Dead Town Tales", "description": "<strong>Welcome to Dead Town.<br/><br/> Dead Town Tales is a single-player game with a strong ancient Chinese style that focuses on strategy card building and plot exploration as its core Roguelike gameplay. In this game, you will fight and explore to uncover the truth behind the sleeping case in this romantic and mysterious world covered by mist.<br/><br/>Don’t worry, people, ghosts, spirits, and monsters in ‘Lanruo Town’ are all very friendly, at least it seems so…</strong><br/><br/><strong>People and Ghosts on Different Paths</strong><br/><br/><br/>The current version offers two career paths: human and ghost, corresponding to completely different decks and stories. Please choose according to your heart to start your ink-and-wash ancient style weird talk journey. Future plans to unlock more careers with data chapters.<br/><br/><strong>Choose carefully and build a deck that is exclusive to you</strong><br/><br/><br/>Expand your exclusive dynamic deck as the plot progresses. Strategy moves freely combined, amulets weapons for you to match. Just don’t forget to ask yourself when faced with a choice: are you sure you don’t want to think about it again?<br/><br/><strong>High-divergence plot, ending never written</strong><br/><br/><br/>There will always be an ending to the story, but there are dozens of possibilities here. Why does the thousand-year-old goddess statue in the Taoist temple have her eyes low and cover her pity, and where will the fate point to by the three copper coins in front of her? All you can do is choose.<br/><br/><strong>The end is also the beginning, new challenges in multiple rounds</strong><br/><br/><br/>Time turns, strange things happen. The game requires multiple rounds of exploration to discover more truths. To avoid you feeling bored, here are some randomly generated game content. Every start is a new unknown journey!<br/><br/>The game currently only supports Chinese", "metacritic": null, "released": "2023-05-25", "tba": false, "updated": "2023-05-29T02:28:08", "background_image": "https://media.rawg.io/media/screenshots/248/24860a044fe44cf42fb3788fa8ee76e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 255, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["拾遗工作室"], "genres": ["Indie"], "publishers": ["拾遗工作室"], "esrb_rating": null}