{"id": 961469, "slug": "ballooni-driven-by-madness", "name": "Ballooni - driven by madness", "name_original": "Ballooni - driven by madness", "description": "Wander in the Tower of Bats, the Flooding Pyramid, the Labyrinth of Madness and other stations and watch out for the portals. Collect letters in the right order and get rewarded in the process. <br/>Ballooni is a classic 2D jump run game with maze sequences. Explore different stations and collect the yellow coins to open the door to the next station. <br/>Hop on conveyor belts and floating platforms. Shoot your spell and make your opponents sleep for a few seconds. This will give you more freedom in the game. <br/>Collect letters in the right order and get rewarded in the process. Wander in the Tower of Bats, the Flooding Pyramid, the Labyrinth of Madness and other stations and watch out for the portals.<br/>After playing through all the stations, the next round begins with a slightly increased difficulty level with partly more and new enemies. DRIBYMA.COM will make more stations available in new releases.<br/>Play Ballooni and have fun.<br/><br/><br/>Prefer to play with a gamepad. Otherwise, note the following:<br/><br/>KEYBOARD SUPPORT IN THE MENU<br/>Navigate: Arrow keys<br/>Trigger button: Return/Enter, Spacebar<br/>Exit game: ESC<br/><br/>KEYBOARD SUPPORT FOR THE GAMEPLAY<br/>left, right: arrow keys, a, d<br/>Climb ladder: arrow keys, w, s<br/>jumping: left or right shift key<br/>Shoot spell: The key next to the left or right shift key/Shift<br/>Cancel game: ESC<br/><br/>", "metacritic": null, "released": "2023-05-28", "tba": false, "updated": "2023-05-29T03:31:37", "background_image": "https://media.rawg.io/media/screenshots/184/184ec5a6434ef78de2ff16bdbce91825.jpg", "website": "https://www.dribyma.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Driven by Madness Games GbR"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Driven by Madness Games GbR"], "esrb_rating": null}