{"id": 961466, "slug": "infinadeck-stonehenge", "name": "Infinadeck Stonehenge", "name_original": "Infinadeck Stonehenge", "description": "Stonehenge, one of the greatest wonders of the world- and now you can explore it in VR! Optimized for use with the Infinadeck treadmill, moving around this space really establishes the shocking scale of these massive stones. Enjoy this simple example of Infinadeck Experience Platform™ software at your leisure.<br/><br/>This experience was developed in collaboration with M3DVR.<br/><br/>Useful desktop keybinds:<br/>General:<br/>Escape to Exit Game<br/>Equal to Hide GUI<br/>Ctrl+I to Toggle Infinadeck Plugin<br/>LeftShift to Reload Current Level<br/>Space to Stop Treadmill<br/>RightShift to Start Treadmill<br/>Backslash to Import General/Timer Preferences<br/>Backspace to Reset General/Timer Preferences<br/><br/>Reference Objects:<br/>Q to Toggle Deck Ring<br/>W to Toggle Deck Edge<br/>E to Toggle Deck Center<br/>R to Toggle Reference Panel<br/>T to Toggle In-Engine Deck<br/>Y to Toggle Heading<br/>U to Toggle Colorblind<br/>I to Cycle Panel Theme<br/>O to Cycle Deck Center<br/><br/>Timers:<br/>Alpha1 to Set Timer to 1 Minute<br/>Alpha2 to Set Timer to 2 Minute<br/>Alpha3 to Set Timer to 3 Minute<br/>Alpha4 to Set Timer to 4 Minute<br/>Alpha5 to Set Timer to 5 Minute<br/>Alpha6 to Set Timer to 6 Minute<br/>Alpha7 to Set Timer to 7 Minute<br/>Alpha8 to Set Timer to 8 Minute<br/>Alpha9 to Set Timer to 9 Minute<br/>Alpha0 to Set Timer to 10 Minute<br/>Minus to Toggle Demo Mode", "metacritic": null, "released": "2023-05-26", "tba": false, "updated": "2023-05-29T03:25:34", "background_image": "https://media.rawg.io/media/screenshots/7ca/7cac0dc413f82c3d444d940ede186312.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["M3DVR Enterprises"], "genres": ["Casual"], "publishers": ["Infinadeck Studios"], "esrb_rating": null}