{"id": 961592, "slug": "our-adventurer-guild", "name": "Our Adventurer Guild", "name_original": "Our Adventurer Guild", "description": "Your friend, the former Guild Master of the declining Adventurer Guild, has died and named you his successor. Will you lead the Guild to fame and glory? Or will it finally disband under your leadership?<br/><br/>Our Adventurer Guild is a game about managing an Adventurer Guild. Accept quests to raise the reputation of your Guild. Lead your adventurers in quests to explore and battle foes in turnbased tactical combat. Keep an eye on the mood and relationships of your adventurers. Raise and grow them and watch as they make a name for themselves.<h3>Features</h3><strong>Become the Guild Master of the Adventurer Guild</strong><br/>Manage your Guild and your adventurers. Do not let the Guild fall to ruin and lead your adventurers to a better future.<br/><br/><br/><strong>Turnbased tactical battles</strong><br/>Fight in deadly gridbased tactical battles against dozens of different enemies with their own unique skills. Take advantage of the Bravery System to push your adventurers to their limit. Will they overcome the odds and turn the tide of battle or will they break under the pressure?<br/><br/><br/><strong>Memorable Characters</strong><br/>Your adventurers have their own traits and characteristics. Watch them grow and develop relationships with each other. Will they stay the way they are or will the life of an adventurer mark them?<br/><br/><br/><strong>Build your Adventurer</strong><br/>Train your adventurers to become legends. Choose from a variety of different classes each with their own skill trees to explore. Customize their appearances and create a party to your liking.<br/><br/><br/><strong>Crafting</strong><br/>Use the materials your adventurers find on their quests and craft them items that will help them on their next adventure.<br/><br/><br/><strong>Meet the Cast</strong><br/>Meet several Characters who will help you on you path to restore the Adventurer Guild. Each one with their own personal stories and personalities.<br/>", "metacritic": null, "released": "2023-05-30", "tba": false, "updated": "2024-04-19T14:07:04", "background_image": "https://media.rawg.io/media/screenshots/108/1089bd50370c7f12aa0b0e4a97f75bee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 320, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["GreenGuy"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["GreenGuy"], "esrb_rating": null}