{"id": 961527, "slug": "dragons-hoard-3", "name": "Dragon's Hoard", "name_original": "Dragon's Hoard", "description": "<h3>Grow Big or Go Home!</h3> Hunt down dangerous enemies and hoard loot to help your pet dragon grow. Once fully matured, take to the skies and ride your dragon to guide it back home! Go solo or join others in this Online Multiplayer Action-Adventure game.<h3>Multiplayer Madness</h3> Sometimes it's scary to go alone, but be careful what you wish for. Difficulty scales with the number of players so nothing will ever feel too easy. Have your friends, frenemies, or complete strangers join in and take on the hordes of monsters together. There is no limit to the amount of players that can join in.<h3>Choose your Adventure</h3>Kill mindlessly or help the residents. While fetch quests and tracking hunts are the basic asks from the locals, you can explore the world to discover additional quests and hidden secrets.<br/><br/><br/><br/><br/><br/><br/><h3>Dragons Hoard</h3>Dragon's Hoard is a Peer-to-Peer Online Multiplayer 3rd-person Action-Adventure Game about helping your adopted Dragon get to their home in the sky. <br/>Use the weapons and equipment you loot, to hoard your way to a fortune.<br/>You'll need all the loot you can find, because in this world a Dragon doesn't get bigger with age but with the size of its hoard!<h3>My Mission</h3><ul><li>No NFTs<br/></li><li>No Block Chain<br/></li><li>No Pay to win<br/></li><li>No microtransactions<br/></li><li>Just a box price and a game.</li></ul><br/><br/><br/><h3>Unlimited Multiplayer</h3>Difficulty will scale with number of players. <br/>The only limit to how many players will be the host (The game may be stable with 2 players but no limit will be set).<br/>Current test was 18 people with no signs of performance loss. (I need more friends join the discord for testing!).<br/><br/><br/><br/><h3>Quest</h3>Explore the world and discover Quests and hidden secrets, <br/>Some quests are simple kill quests or go to location quests,<br/>Others are secret and must be discovered.<br/><br/><br/><br/><h3>Dungeons</h3>Explore dungeons and Fight bosses. <br/>There are many unique Bosses each with their own mechanics.<br/><br/><br/><br/><h3>Loot</h3>Lets be honest its what we're all here for<br/>There's the common, rare, epic and legendary loot.<br/>Each with different Statistics for your style of play.<br/><br/><br/><br/><h3>Mount</h3>Ride your Dragon if your hoard is big enough!<br/>Once you reach the required Hoard size youll be able to ride your dragon into the sky where a secret awaits.<br/><br/>", "metacritic": null, "released": "2023-06-01", "tba": false, "updated": "2023-06-02T02:23:41", "background_image": "https://media.rawg.io/media/screenshots/042/042ec8544da79bd352d440035eace393.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 359, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kreg"], "genres": ["Action", "Adventure", "RPG", "Massively Multiplayer", "Indie"], "publishers": ["Kreg"], "esrb_rating": null}