{"id": 961574, "slug": "sex-simulator-bdsm-2", "name": "Sex Simulator - BDSM 2", "name_original": "Sex Simulator - BDSM 2", "description": "An interactive sex simulation game with visual novel elements, featuring high definition graphics and videos, with realistic-looking characters set in a beautiful decor. You continue to play the role of an experienced Dom who initiates three curious women into the world of BDSM sex, in this sequel.<br/><strong>Game description</strong><br/><br/><strong>Features</strong><br/><br/>If you enjoyed our Sex Simulator - BDSM series, you’ll absolutely love this one. <br/>With new girls, added props, and more inciting dialogue, Sex Simulator - BDSM 2 will stir your blood and fulfill your dirtiest fantasies.<br/><br/>The story continues with another hot and experienced Dom who will do just about anything to satisfy his Sub’s needs, in the privacy of his own luxurious apartment.<br/>Step into his shoes, and choose between 3 different ladies with 3 different personalities.<br/>Help them conquer their fears, and test their limits by using your kinky new sex machines and various props on their bodies. <br/>Make them come and scream your name in pleasure so they will return for more.<br/><br/>Don’t worry if you're not a great talker, we got this part covered for you. <br/>All you need to do is flex those finger muscles to control the sex motion and make the ladies come before you run out of stamina.<br/>Choose between 3 types of sex and positions to satisfy their needs, and feel free to swap between the various camera angles we set up for you so that you won’t miss any of the hot details happening on screen.<br/><br/>You didn’t get it right on the first try? Well…it happens to the best of us. <br/>The good part is you can always try again, and again, and again…until you leave the girls satisfied.<br/><br/>90+ HD quality renders<br/>HD animations", "metacritic": null, "released": "2023-05-30", "tba": false, "updated": "2023-06-02T03:24:08", "background_image": "https://media.rawg.io/media/screenshots/e8b/e8b9d49ead66d95ad9760ea1362797aa.jpg", "website": "http://www.exosyphen.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 1, "achievements_count": 3, "ratings_count": 0, "suggestions_count": 243, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["EroticGamesClub"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["EroticGamesClub"], "esrb_rating": null}