{"id": 961596, "slug": "poly-bridge-3", "name": "Poly Bridge 3", "name_original": "Poly Bridge 3", "description": "<strong>Poly Bridge 3</strong> is a puzzle game where building bridges is key. Get vehicles to their destination by testing your engineering and problem solving skills. Suspension bridges, draw-bridges, multi-level bridges, crazy almost-bridges, bridges, bridges, <strong>bridges</strong>!<br/><br/><h3>Campaign</h3>Explore the new <strong>Open World Campaign</strong> with a dozen worlds and 100+ new levels. Jumps, Hydraulics, ‘Normal’ Bridges, and more giving you hours of gameplay to enjoy! Take a flying leap in Vaulting Towers or flex those hydraulic muscles in Bifrost Bend!<h3>Sandbox</h3>Let your engineering creativity flow with no restrictions in Sandbox mode, allowing you to push your bridge building skills to the limit. Challenge your friends and the community by designing intricate levels and publish them online for everyone to enjoy.<h3>Community</h3>Explore virtually infinite content and challenges designed by the community in the Steam Workshop. See what bridge designs other players come up with and show off your own in the Gallery. Challenge yourself and others by competing for the top spots in the cut-throat leaderboards and histograms.<br/><br/><br/><h3>Custom Physics</h3>Our custom physics engine gives total control, reliability, and accuracy to your bridges. Sleep easy at night knowing your bridges will perform consistently every time!<h3>Customization</h3><ul><li><strong>Mods</strong><br/>Mods allow you to customize your game to suit your tastes. Modify the game’s settings, include new options, change vehicle or material defaults, translate your game with player supported language packs, and more!<br/></li><li><strong>Decorate</strong><br/>Add visual flair to your level with a whole range of decor objects. Alongside generic items (traffic cone, rocks, hot air balloons, etc.), each new biome comes with a set of themed decorations as well. Paint a happy little scene, there are no limits here.<br/></li><li><strong>User Generated Content</strong><br/>Create your own vehicles, boats, planes, decorations, and textured custom shapes to add to workshop levels. Let your imagination soar! Share them with the community and download things made by other players.</li></ul><h3>Loads of new features</h3><ul><li><strong>Build Zones</strong><br/>It’s time to think inside the box! You can only build within their borders, like a reverse boat or plane. Are you up to the challenge?<br/></li><li><strong>Pre-Built Materials</strong><br/>Showing is much more effective than telling. Pre-Built materials can be included with a level on loading, giving you a helping hand or another obstacle to overcome. Work around them or incorporate them into your bridge designs.<br/></li><li><strong>New Material: Foundation</strong><br/>Support long bridges with a strong foundation, or two! Expensive yet very effective at reducing stress in key positions.<br/><br/></li></ul>", "metacritic": null, "released": "2023-05-30", "tba": false, "updated": "2023-08-06T15:18:54", "background_image": "https://media.rawg.io/media/screenshots/8bb/8bb0b99ab4e9da2fc6b3f1e8f89e8af5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 7, "toplay": 2}, "playtime": 4, "achievements_count": 25, "ratings_count": 1, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "macOS", "PC"], "developers": ["Dry Cactus"], "genres": ["Simulation"], "publishers": ["Dry Cactus"], "esrb_rating": null}