{"id": 961575, "slug": "all-is-fair-in-love-and-vore-the-tavorion-collecti", "name": "All is Fair in Love and Vore: The Tavorion Collection", "name_original": "All is Fair in Love and Vore: The Tavorion Collection", "description": "<strong>Vore. It is the lifeblood of this world!</strong><br/><br/>Experience the experience all your work colleagues have been talking about, and finally get around to playing Tavorion's classic games! The collection includes three never-before-seen short stories hidden throughout the games, and a complete unlockable Gallery. Not to mention, the entire thing is in both English and Spanish!<br/><br/>Expect walking, talking, and the occasional poorly-made minigame. The stories will take you through thrills, chills, and... so much more! You literally cannot afford to miss out on this free artistic experience!<br/><br/><br/><br/><strong>The Beast of Tier 4</strong><br/>Play as Rana, a stunningly beautiful woman with a horrifying secret: she devours human beings alive! Seduce and deceive prey to lure them away from safety, and into your stomach...<br/><br/><strong>Voyage to Satiety</strong><br/>Stephen is trapped on the ship of the enigmatic former-celebrity Olivia Ashdown, and forced to fight to avoid being devoured alive! Will he survive? Does he care about the lives of his fellow captives? Who will he grow close to? Find out!<br/><br/><strong>Voyage to Satiety 2</strong><br/>Given a second chance, will Liv finally learn to live a life she's happy with?<br/><br/>No!<br/><br/><strong>Mission 74</strong><br/>Vore assassin! Avoid the stylishly-designed robots, devour the target! Epic!<br/><br/><strong>Hunger of the Fifth Sunset</strong><br/>Ex-soldier Alexandria Twain is on a journey through war-torn Guantemana to find her cousin, and decides to stay a few nights at a welcoming hostel. But behind the welcoming smiles, warm food and vibrant colours, there are rumbling stomachs yearning for live human flesh...<br/><br/><strong>All is Fair in Love and Vore</strong><br/>In the thrilling conclusion to this game saga, the characters fight the other characters and some of them die and there's vore (+ kind of vore) and it's allegory for important stuff.", "metacritic": null, "released": "2023-05-30", "tba": false, "updated": "2023-06-02T03:25:30", "background_image": "https://media.rawg.io/media/screenshots/0e8/0e8dd021ac81ab8a15fc2261083e97c0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Tavorion"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Tavorion"], "esrb_rating": null}