{"id": 961559, "slug": "tower-of-chaos", "name": "Tower of Chaos", "name_original": "Tower of Chaos", "description": "Tower of Chaos combines the depth of tactical auto battlers, captivating exploration with rogue-lite elements, and an immersive story with multiple characters sharing an ambiguous past.<br/><br/><br/><h3>Build up your army</h3>As a commander, you have the freedom of recruiting your units, setting the most effective formation on the battlefield, forging powerful items and acquiring the mighty Patron’s blessings.<br/><br/><br/>Using special potions can turn the tide of the battle into your favor, but only true leaders are capable of engaging in a fight at the right moment. Combining powers from all sources grants you endless possibilities for perfecting your build.<br/><br/><br/><h3>Control the Chaos</h3>Your actions at the tower will not remain unnoticed. Conquering it empowers its guardians, making exploration more dangerous. You have countless opportunities of acquiring precious loot, but choosing the greedy path will make your fall imminent. <br/><br/><br/>Acquiring blueprints opens up a possibility to shape floors of the tower to your liking, by placing buildings that alter your exploration and battle scenarios. The Gate of Challenges awaits the bravest commanders, unleashing the full destructive potential of the tower.<br/><br/><br/><h3>Unfold the origins</h3>Every conquer attempt starts at Guardian's Quarters. Here you will meet the inhabitants willing to share the glimpse of their powers to support your cause. Show them your gratitude by upgrading and improving the base for your fellow Patrons. <br/><br/><br/>Meet a set of fully voiced-over characters and look for the answers hidden in the origins of your allies. But keep your head down, even with a legendary chaos octopus jumping on your forehead! <br/><br/><br/>", "metacritic": null, "released": "2023-05-29", "tba": false, "updated": "2023-07-29T04:06:17", "background_image": "https://media.rawg.io/media/screenshots/fef/fef635da1f0f40304b23c1b11f00354d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 289, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Laughing fox games"], "genres": ["Action", "Strategy"], "publishers": ["Laughing fox games"], "esrb_rating": null}