{"id": 961573, "slug": "disaster-area", "name": "Disaster Area", "name_original": "Disaster Area", "description": "<h3>Online Mode - PVP</h3>In the multiplayer online game, you will carry your best weapons and teammates to compete in various maps and modes. PVP mode includes traditional team dead fighting, scuffle, etc., as well as characteristic offensive and defensive warfare. You can also obtain high scores by continuously killing enemies, such as heavy armor, automatic turret and other scoring rewards.<h3>Online Mode - PVE</h3>In the cooperation mode, you will fight against a large number of unknown biological entities (Rama) with your teammates, and choose to build a defense against wave after wave of attacks; Or carry the machine gun and kill into Rama's lair, and return triumphantly. In the defense mode, supplies can be used to lay defense fortifications such as mines and boards on all possible offensive routes of Rama, so as to find the commanding heights and deal with the growing stronger enemies. In the attack mode, supplies are very limited, so it is very important to save equipment and use each bullet well, and beware of enemies who are dormant in the dark.<h3>Campaign Mode</h3>In the campaign mode, players will be brought into an unknown disaster. You will fight with your teammates to break out of the encirclement of horrible unknow creatures and explore the source of the disaster.<h3>Campaign Mode - Weapon and Equipment</h3>There are more than 50 kinds of weapons and equipment, ranging from defensive daggers to the M82A1 with 12.7mm caliber, including basic types of weapons to various modified types, more than 12 kinds of different reagents and tactical equipment, as well as light fiber armor to heavy ceramic armor, and the types are constantly updated.<h3>Campaign Mode - Map</h3>Whether it is the desert with yellow sand under the scorching sun, or the long night under the Arctic aurora, or the once brightly lit city center, it will be your battlefield in the Campaign Mode!<h3>Campaign Mode - Sneak</h3>Sometimes, facing a large number of Ramas, the risk of direct attack is very high, and it is very important to choose to carry silencing weapons, lower your body and move slowly to assassinate the enemy.<h3>Campaign Mode - Dark</h3>The disaster area is not always in the daytime or with bright lights. In some cases, players need to go deep into the disaster area in the dark at night. At this time, the information available will become very limited, and every step needs to be more careful.<h3>Campaign Mode - Support</h3>You are not fighting alone. Behind you is a whole I.S.R.C Armed Department. It is more important to save your life! In a crisis, don't forget to call for support from the headquarters, such as ammunition supply, reconnaissance drones and even expensive bombers. But it is better than getting lost in the disaster area and deducting a lot of reputation. It is always profitable to come back alive.<h3>Campaign Mode - Mission</h3>There are a lot of things to deal with in the disaster area. The simple things are covered by the standing staff. Only elite team like players can be competent for high-risk tasks, such as annihilation, escort, rescue, sample capture, etc.", "metacritic": null, "released": "2023-05-30", "tba": false, "updated": "2023-06-02T03:21:37", "background_image": "https://media.rawg.io/media/screenshots/a33/a338c93b8b9a212173bd0660654268d9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 298, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Alaska"], "genres": ["Action", "Indie"], "publishers": ["Alaska"], "esrb_rating": null}