{"id": 961649, "slug": "vr-animal-kids-rumble", "name": "VR Animal Kids Rumble", "name_original": "VR Animal Kids Rumble", "description": "This is a VR -type animal fighting mini -game that allows players to be in a dense forest to explore and challenge various small animals.<br/><br/><br/> <br/>In the game, you need to find small animals hidden in the forest. These animals include the extinct primitive dinosaurs, rhinos, eagles, bears, and so on. Each animal has different attributes and characteristics, and players need to choose the object of the battle according to their game strategy. Looking for them and fighting with them, you can unlock the right to use the animal after winning.<br/>With your game process, you can unlock more and more animals, and you can also choose your target from the animals that have been unlocked. Each battle is a thrilling duel, allowing players to enjoy more game fun.<br/><br/><br/> <br/>The VR experience of this game is very realistic. Players can feel the existence of various animals in the forest in their background. Their shapes and actions are very natural. Players can control the control of the hand, such as attack, jumping, etc. to make the battle more realistic.<br/>In general, this is a VR animal fighting game full of challenges and exciting, which will bring players unprecedented gaming experience. Come and try to unlock more animals!<br/> <br/><h3>Operation method:</h3>Left handle/lower/left/right -walk<br/>Left handle side keys -resetting position<br/>Right handle left/right -turning<br/>Menu -display menu<h3>During the battle:</h3>Left handle up -jump jump<br/>Left handle left/right -walking<br/>Right handle trigger -attack", "metacritic": null, "released": "2023-05-31", "tba": false, "updated": "2023-06-02T04:59:20", "background_image": "https://media.rawg.io/media/screenshots/a97/a973d1b0132b9d3fdc3043c82bf886ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 396, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dinosaur workshop"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Casual"], "publishers": ["Dinosaur workshop"], "esrb_rating": null}