{"id": 961688, "slug": "no-more-rainbows", "name": "No More Rainbows", "name_original": "No More Rainbows", "description": "In No More Rainbows, you are The Beast, who must spring forth into a fantastical virtual reality world to reclaim your home. Use arm-based locomotion mechanics to run, jump, claw, and climb using only your hands and arms to engage with tight platformer mechanics.<br/><br/><br/><br/>As the Warden of the Underworld, you’ve been awoken from your eternal slumber by the sound of horribly joyful melodies piercing the warm darkness. The ashen air now reeks of tulip perfume. The once burning magma floor tiles now feel lush and fresh under your claws. Beings of infinite happiness have infested the Underworld! Bizou and their merry band of minions plan to take over your sanctuary of screams and turn it into a bountiful paradise where cries of pain and torment are replaced by kisses and rainbows...what a nightmare!<h3>Run across several unique worlds:</h3> Explore 4 different worlds with 28 levels full of mini-games. Rampage across green fields, through the dead of night, frozen lakes, and more!<br/><br/><h3>Jump into a secrets-filled setting:</h3> Discover the lore of how the world became infested with beings of infinite happiness through environmental storytelling and unforgettable boss encounters against your nemesis.<h3>Claw your friends’ faces off or join them:</h3> Play an exciting 3v3 multiplayer mode with or against friends and show off your skills in 12 different battle arenas. Gather accolades and collect cosmetics to stand out from the crowd!<h3>Climb the speedrun ranks:</h3> Become the world's best speed demon through local and worldwide leaderboards for each level.<br/>Dress for joy-killing success: Personalize your Beast with cosmetics and skins, with over one million possible combinations!<br/><br/>", "metacritic": null, "released": "2023-06-01", "tba": false, "updated": "2023-06-02T05:44:27", "background_image": "https://media.rawg.io/media/screenshots/ae5/ae5d4dbd46c521019122fba7c273ff3b.jpg", "website": "https://www.nomorerainbows.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 392, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Robot Teddy", "Squido Studio"], "genres": ["Action", "Adventure", "Casual"], "publishers": ["Squido Studio"], "esrb_rating": null}