{"id": 961695, "slug": "fireball-wizard", "name": "Fireball Wizard", "name_original": "Fireball Wizard", "description": "Explore Wizardonia, a magical world filled with danger and wonder in Fireball Wizard! As a powerful wizard, you'll explore a pixelated landscape filled with treacherous enemies and obstacles. Use your unique abilities to launch deadly fireballs, defeat fearsome bosses, and uncover secrets hidden in mysterious forests, caves, and castles.<br/>Fireball Wizard offers a unique blend of action, adventure, and puzzle solving, making it the perfect game for anyone looking for an authentic gaming experience. <br/><br/><br/><br/>With a variety of challenging enemies and multiple environments to explore, Fireball Wizard offers a magical and intense gameplay experience that will keep you on your toes for hours. Master your skills, upgrade your equipment and become the ultimate fireball wizard as you progress through the game's many levels.<br/>As you travel through the game world, you will encounter a variety of puzzles and obstacles that will test your skills and push you to the limit. But never fear, as you progress, you'll unlock new abilities and spells to aid you in your quest.<br/><br/>Put on your wizard's robe, grab your staff and get ready to become the ultimate fireball wizard!<br/><br/><h3>Key features:</h3><br/>• Intense action-adventure gameplay: Experience thrilling combat and explore a pixelated world filled with danger and wonder.<br/>• Powerful wizard abilities: Use your magic to launch deadly fireballs and defeat fearsome bosses.<br/>• Challenging puzzles: Test your skills with a variety of brain-teasing puzzles and obstacles.<br/>• Hidden secrets to uncover: Explore every corner of the world to uncover hidden secrets.<br/>• Unique blend of genres: Enjoy a mix of action, adventure, and puzzle-solving that will keep you engaged for hours.<br/><br/>", "metacritic": null, "released": "2023-06-20", "tba": false, "updated": "2023-07-14T05:44:22", "background_image": "https://media.rawg.io/media/screenshots/85c/85ceed70eb14e0d88b75733d4fafff79.jpg", "website": "http://gintronic.io/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "macOS", "PC"], "developers": ["Plug In Digital", "ginTronic"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Plug In Digital", "PID Games"], "esrb_rating": "Everyone 10+"}