{"id": 961687, "slug": "eye-4-eye-2", "name": "Eye 4 Eye", "name_original": "Eye 4 Eye", "description": "<strong>Eye 4 Eye is a first-person detective adventure puzzle game with retro graphics.</strong> <br/><br/><br/><br/>It takes place in a futuristic dystopia where everyone has a brain chip installed for the betterment of society. You play as Hazel, a struggling detective, tasked with solving a mysterious missing daughter case in a Victorian mansion inside of a high-tech company complex.<br/><br/>Employ your cutting-edge bionic eye and use tools like the search engine, history vision, and item examination to journey down your investigative path. Engage your inner sleuth and challenge yourself with thought-provoking puzzles and enigmatic mysteries as you uncover the truth behind the missing girl.<br/><br/>As you unveil the company's dark secrets, experience the thrill of piecing together an intricate mystery in a futuristic world brought to life in a captivating 90s retro aesthetic.<h3>Features:</h3><ul><li><strong>High-Tech Detective Tools</strong> - Utilize the search engine to gather clues and piece together the mystery at hand. </li></ul><ul><li><strong>Puzzle Packed</strong> - Put your problem-solving skills to the test as you work to unravel the truth. Can you solve the mystery on your own? </li></ul><ul><li><strong>Unravel a Dark Conspiracy</strong> - Embark on a journey to uncover the truth behind the mysterious disappearance of a young girl. </li></ul><ul><li><strong>Step into the Future</strong> - Immerse yourself in the world of 2073 and unravel the wrongdoing of the powerful high-tech company TempleTech. </li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2023-06-02T05:43:21", "background_image": "https://media.rawg.io/media/screenshots/7ec/7ec94f82c44a3999d37644c473b50264.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Team Eye 4 Eye"], "genres": ["Adventure", "Indie"], "publishers": ["Yi Dai"], "esrb_rating": null}