{"id": 961624, "slug": "quasimorph-end-of-dream", "name": "Quasimorph: End of Dream", "name_original": "Quasimorph: End of Dream", "description": "Every mercenary is looking for that one job that will allow them to retire. And it seems that you've just stumbled upon it: the AnCom corporation is asking you to retrieve the intellectual assets of the Fresco corporation.<br/><br/>Gather your gear, prepare your clones, and get ready for the start of a story that will forever change the Solar System.<h3>Level the Playing Field. At Any Cost.</h3>Become the boss of your own Private Military Company: carry out orders from corporations, and earn a reputation with your blood and sweat. Explore planetary bases, secret labs, and the wreckage of spaceships to find new technologies, abilities, and other items that will help you level the playing field during operations.<br/><br/><h3>Make mistakes. Overcome and become better.</h3>Remember that you have an advantage: clone the best employees and send them to certain death to probe the weaknesses of your opponents. There is no need to risk valuable human assets and expose your PMC to unnecessary legal risks, for nobody cares about the fate of a clones.<br/><br/><h3>Don't Bury Yourself Under the Crossfire.</h3>Corporations hire ruthless mercenaries to carry out their shadow operations. Demons distort human nature and pervert human evolution. <br/>Gather a team of professionals, count your ammo, and keep track of your equipment to be prepared for any perversions of this space slaughter.<br/><br/>", "metacritic": null, "released": "2023-05-31", "tba": false, "updated": "2024-04-09T09:03:30", "background_image": "https://media.rawg.io/media/screenshots/6af/6af93574b59fbcb412c8ce636ef63941.jpg", "website": "", "rating": 2.67, "rating_top": 4, "added_by_status": {"yet": 5, "owned": 111, "toplay": 8, "dropped": 3, "playing": 2}, "playtime": 1, "achievements_count": 2, "ratings_count": 9, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 9, "platforms": ["PC"], "developers": ["Magnum Scriptum"], "genres": ["Action", "RPG", "Strategy", "Simulation", "Indie"], "publishers": ["HypeTrain Digital"], "esrb_rating": null}