{"id": 961633, "slug": "runelight-2", "name": "RuneLight", "name_original": "RuneLight", "description": "Choose your spells and blast through waves of enemies. Level up and choose between a handful of upgrades and modifiers. Become stronger and stronger against the ever increasing horde. Take down 4 of the titans and bring back the stolen light.<br/><ul><li>8 base spells with distinct behaviors and effects<br/></li><li>8 unique enemy types, each with their own strengths and weaknesses. <br/></li><li>8 Elite boss fights <br/></li><li>Over a dozen weapon and player stats to modify and enhance<br/></li><li>Fusion system that brings your spells and modifiers to new heights</li></ul><h3>Modify Or Die</h3><br/><br/>Attach up to 4 modifiers to each spell, greatly improving it's stats and power. However, power comes at a cost and each modifier will decrease another stat in turn. Strike balance between the positives and negatives to become stronger or die trying. Turn your Ice Bolt into a shotgun or give your boulder devastating damage, the spells are yours to master. <br/><br/><ul><li>7 different weapon stats to modify<br/></li><li>8 different player stats to modify<br/></li><li>over 100 different modifier permutations<br/></li><li>build your spells and play your way</li></ul><h3>Fuse Or Lose</h3><br/><br/>Against the ever-increasing horde of monsters your base spells and modifiers just won't be enough, so to survive the worst and bring down the titans you'll need to fuse. Fuse 3 spells of the same type to unlock new and powerful upgrades, or fuse your modifiers to reach new heights. Balance your downsides or go for absolute power, the decisions are yours.<br/><br/><ul><li>over a dozen unique spell upgrades<br/></li><li>Modifier fusion allows you to pick and choose to best fit your needs</li></ul><h3>Survive and Thrive</h3><br/><br/>While you scale in power over time, so do the enemies! Fight against 8 unique enemies, each with their own strengths and weaknesses. There is no one spell kills all defense, and you'll have to adapt to survive. Every 5 minutes, a Titan will spawn. Taking them down is crucial to prolonged your survival and necessary to bring back the light.<br/><ul><li>8 unique enemies<br/></li><li>4 of the 8 unique titan minibosses  spawn each game</li></ul>", "metacritic": null, "released": "2023-05-31", "tba": false, "updated": "2023-06-02T04:41:50", "background_image": "https://media.rawg.io/media/screenshots/340/34085cab4c8465dc093aa9ced52a006f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Elmok"], "genres": ["Action"], "publishers": ["Elmok"], "esrb_rating": null}