{"id": 961683, "slug": "big-byz-wars", "name": "Big Byz Wars", "name_original": "Big Byz Wars", "description": "Welcome to the captivating world of Big Byz Wars, an electrifying sci-fi 2.5D side-scroller set in a dystopian Eastern European cyberpunk landscape. Prepare to embark on a thrilling adventure where flying cities dominate the skies and mercenaries hold the key to power and survival.<br/>\n<br/>\r\nIn this alternate future, humanity has sought refuge in massive flying cities, soaring high above the chaos of the world below. Amidst the towering skyscrapers and neon-lit alleyways of Eastern Europe, a secretive organization of mercenaries has emerged, commanding influence and shaping the destiny of nations.<br/>\n<br/>\r\nAs a skilled mercenary in this captivating universe, you will don a powerful combat suit and navigate the labyrinthine streets of the city-states. Engage in heart-pounding battles against rival factions, unravel the mysteries of this cyberpunk metropolis, and discover the truth behind the flying cities' origins.<br/>\n<br/>\r\nImmerse yourself in the intricate web of alliances and betrayals, where every decision you make carries consequences. Will you uphold the interests of the highest bidder or fight for a greater cause? The choices you make will determine the fate of not only the flying cities but also your own destiny.<br/>\n<br/>\r\nWith its mesmerizing blend of Eastern European cyberpunk aesthetics, thrilling gameplay, and an enthralling narrative, Big Byz Wars offers an unparalleled gaming experience. Prepare to soar through the skies, navigate treacherous alleys, and engage in intense combat as you carve your path in this dystopian world ruled by flying cities and mercenaries.<br/>\n<br/>\r\nAnd the best part? A demo version of the game is already available, so you can experience the excitement for yourself. Add Big Byz Wars to your wishlist today and be the first to know when the full version is released. Or better yet, buy it now and start your journey through this incredible world. With endless possibilities and endless fun, Big Byz Wars is the ultimate gaming adventure you won't want to miss.", "metacritic": null, "released": "2023-06-01", "tba": false, "updated": "2023-06-02T05:38:58", "background_image": "https://media.rawg.io/media/screenshots/c94/c946ffc72c1d805b02e72e3258dd907e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tommy Gun Walrus"], "genres": ["Action", "Indie"], "publishers": ["Tommy Gun Walrus Studio"], "esrb_rating": null}