{"id": 961621, "slug": "pirate101", "name": "Pirate101", "name_original": "Pirate101", "description": "An army of clockwork soldiers called the Armada have troubling plans for the Spiral. Recently broken out of their prison and determined to thwart their evil plot, you and your ragtag crew of companions need to locate all pieces of the legendary map to El Dorado before it’s too late. Can you stay ahead of the Armada and find the map before they do?<br/><br/><br/><br/>Determine your piratin’ style and pick one of five different classes: Musketeer, Swashbuckler, Buccaneer, Privateer, and Witchdoctor. Each class comes with different strengths and weaknesses to learn and conquer. <br/><br/><br/><br/>Recruit hundreds of companions along your journey to prepare for the hard battles ahead of you. Use their skills wisely to trigger crushing combos and defeat enemies in exciting turn-based tactics combat.<br/><br/><br/><br/>Customize and upgrade your ship as you navigate the dangerous skyways. Unleash powerful ship abilities and board nearby enemies in a show of nautical force!<br/> <br/><br/><br/>Solve mysteries, unlock secrets, and meet hundreds of fully voice-acted characters on your quest to recover the legendary map of El Dorado! Explore and fight your way through the wild west, haunted caverns, clockwork hideouts, and more!<br/><br/><br/><br/>Sharpen your skills and prove your might in PvP against other pirates! Develop and refine your strategy to stay in ship-shape and climb the ranks.<br/><br/><br/><br/>Take a break from your quest to engage in numerous side systems! Venture to Bestia to morph and train a new trusty pet or deck out your bunkhouse to make it uniquely you. <br/><br/><br/><br/>Strategize and team up with fellow pirates to take down tough bosses in this vast MMORPG. Once you’ve conquered your enemies, socialize with friends and engage with the community to learn and expand your knowledge.", "metacritic": null, "released": "2023-05-31", "tba": false, "updated": "2023-06-02T04:25:42", "background_image": "https://media.rawg.io/media/screenshots/672/672e2693ae456fb48348f19f2d67a3bf.jpg", "website": "https://www.pirate101.com/free_game", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 50}, "playtime": 3, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 541, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KingsIsle Entertainment"], "genres": ["Adventure", "RPG", "Strategy", "Massively Multiplayer"], "publishers": ["KingsIsle Entertainment"], "esrb_rating": null}