{"id": 961605, "slug": "locuras-en-el-banaverso", "name": "Locuras en el Banaverso", "name_original": "Locuras en el Banaverso", "description": "Madness in the Banaverse is an adventure game featuring El Bananero as the main character, who will go through several levels full of puzzles, opponents and other challenges, and to solve them he will use his abilities, the objects he finds in the level, or the help of allies and skills you'll gain as you progress.<br/><br/>The game in Early Access stage includes the following content:<br/><br/><ul><li>5 Game levels in various environments: Street, drain, factory, water and castle (more locations coming soon)<br/>[*As a player you will use a character based on the well-known youtuber El Bananero, who throughout the game levels will use his skills to hit and throw things out of his...pockets, and that will allow him to overcome the various obstacles present in the game.<br/></li><li>You will have guest characters from the Banaverse, recognized by the Youtuber videos, such as Andrés, Isabel, and enemies such as the Gorilla and the Santa Claus impersonator<br/></li><li>In addition, as a team we have added to the game a series of opponents that although they are not part of the Banaverse, their characteristics and appearance pay homage to the parodies created by the Youtuber, among them are the \"Poronguines\" who will be the constants minions to face in each level.<br/></li><li>The game includes the use of items that can restore the life of the character, or be weapons against different opponents<br/></li><li>Each level presents simple and intuitive challenges that do not require the use of text, and that are mostly accompanied by the presence of cinematics that provide all the visual support as a clue to understand what should be done.<br/></li><li>Each level has a series of secrets that are based on the madness of the universe created by the youtuber, and that add more comedy to the experience</li></ul><br/>It is a unique experience that promises to captivate you as a result of the countless number of puzzles and challenges that you will have to face as a player, without neglecting that touch of black humor and insults typical of the Youtuber.<br/><br/>Warning, this is a game recommended for an adult audience, all the characters present here are fictional and any resemblance to reality is pure and mere coincidence", "metacritic": null, "released": "2023-05-30", "tba": false, "updated": "2023-06-02T04:04:08", "background_image": "https://media.rawg.io/media/screenshots/f0f/f0f1d0b878136e24030ad01e0ff9f508.jpg", "website": "https://www.instagram.com/newvicon_ltd/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Newvicon"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Newvicon"], "esrb_rating": null}