{"id": 961740, "slug": "astride", "name": "Astride", "name_original": "Astride", "description": "<h3>Astride In Early Access</h3><strong>Be a part of the early development of Astride by joining the early access program. As our team continues to work on the game, we will be releasing frequent updates and collaborating with our community to shape the ultimate horse-riding experience. Be sure to read up on the currently available game features before purchasing, so you know exactly what to expect from the game. Astride is currently in a pre-alpha state.</strong><br/><br/>As an early access title, Astride is still in development, but you can play and test out the features and game mechanics that have been implemented so far. You can expect limited features as the game is still a work in progress. However, this presents an excellent opportunity for you to provide feedback and help shape the game's development. With each update, the game will become more polished and packed with new content, providing players an exciting and evolving experience.<br/><br/>The game's development team welcomes your feedback and suggestions as they work to refine and perfect the game. Your participation in shaping Astride's future is essential. To give feedback regarding Astride, please head over to the Steam discussion forums or join our official Discord server and use the respected channels and forums.<br/><br/><strong>Read more about Early Access here.</strong><br/><br/><h3>Features Currently Available</h3><ul><li><strong>Realistic horse customization -</strong> The Astride horse creator offers an array of horse coat color options for you to discover. Select base colors, face markings (full-face, upper, and lower-face), leg markings, and tobiano patterns to customize your horse's appearance. Observe how various genes influence the coat and bring your dream horse to life!<br/><br/></li><li><strong>Multiplayer -</strong> Whether you prefer playing with friends or embarking on solo adventures, Astride offers a fully functional multiplayer feature. Explore the indoor and outdoor arenas, engage in exciting activities, and create unforgettable memories. You have the flexibility to host private servers for intimate gatherings or join public servers to meet fellow players from around the world. <br/><br/></li><li><strong>Show jumping prototype -</strong> The initial iteration of the show jumping system is now available for testing! Observe how strides impact the horse's jumping capabilities and master the art of creating the ideal lineup for jumping. Stay tuned for additional updates to the jumping prototype in the near future.<br/><br/><h3>Key Features Planned For Full Release (2026-2027)</h3></li><li><strong>Ride together -</strong> With the option to invite friends to your world or visit their worlds, you can create a unique and memorable experience as you ride together. Bring your trusty steed or try out your friend's horse for a different riding experience. Collaborate with your friends on stable chores and horse care, working together to ensure that your horses are healthy and happy. Take on the challenges of the equestrian lifestyle as a team, and build lasting memories in the process.<br/><br/></li><li><strong>Horse personalities and traits -</strong> Discover your horses' unique personalities in Astride and see how they affect their behavior when riding and caring for them. Some horses may be easily spooked, while others are highly energetic. Learn to anticipate and respond to their traits to develop a special bond and achieve your goals.<br/><br/></li><li><strong>Breeding and genetics -</strong> Carefully select horses with desirable traits, including their stats, personality, and genetic colors and patterns, to produce the best offspring possible. Use your studs, borrow them from friends, or visit the local stud farms in Eldheim to find the perfect match for your mare. With some luck and careful planning, you can create a new generation of horses that surpasses their parents in every way.<br/><br/></li><li><strong>Customization -</strong> Tailor your experience with a wide range of customization options! Personalize your equestrian adventure with a wealth of customization options. Customize your character and your first horse, and design your dream stable with plenty of possibilities to choose from. Make your experience truly unique by exploring all the customization options available!<br/><br/></li><li><strong>Quests -</strong> Explore Eldheim and uncover secrets and mysteries along the way. Immerse yourself in the main storyline or take on smaller sidequests to discover more about the world. Who knows what hidden treasures await you?<br/><br/></li></ul>", "metacritic": null, "released": "2023-06-02", "tba": false, "updated": "2023-06-05T02:42:33", "background_image": "https://media.rawg.io/media/screenshots/e47/e4734f014815e8ac5b42aac2cb587c54.jpg", "website": "https://www.astride.no", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 354, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Raidho Games"], "genres": ["Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["Raidho Games"], "esrb_rating": null}