{"id": 961761, "slug": "pixiescape", "name": "Pixiescape", "name_original": "Pixiescape", "description": "<strong>Pixiescape is an asymmetrical multiplayer game, inspired by games like hide and seek or cops and robbers, where you play as a Fairy (hiding team) or a Robot (seeking team).</strong> <br/><br/><br/><br/>While playing as a fairy, the player will be able to build enchanted mushrooms (each with their own special effects), shoot magical orbs, or use their spells to evade getting captured. <br/><br/><br/><br/><br/><br/>Should the fairies get caught, they will be teleported to a jail where they can be rescued by remaining ally fairies. <br/><br/><br/><br/>While playing as a robot, the player's objective is to capture all fairies as quickly as possible. Robots can choose to equip skills from a completely different set of abilities such as a grapple hook, energy orbs that smash mushrooms, a scanner to detect hidden fairies, and many others.<br/><br/><br/><br/>Once all fairies are captured, a 2nd round will begin where the players will switch roles. (Robots become fairies, fairies become robots)<br/>The second team to play as fairies must outlast the first team's time to claim victory.<br/><br/>Team sizes can vary:<br/><ul><li>1v1<br/></li><li>2v2<br/></li><li>3v3</li></ul><br/><br/><br/><ul><li>Both <strong>single-player</strong> and <strong>multiplayer</strong> modes are available (however, we strongly recommend playing with friends, as this tends to enhance the experience). You can also fill any remaining spots with AI.<br/><br/></li><li>Take advantage of our extensive <strong>customization options</strong> to create a unique look that suits you. All items are unlockable with the in-game currency acquired from playing.</li></ul><br/> <br/><br/><ul> <li>21 unique abilities between the two characters<br/><br/></li><li>6 diversified arenas to play on</li></ul>", "metacritic": null, "released": "2023-06-02", "tba": false, "updated": "2023-06-05T03:58:18", "background_image": "https://media.rawg.io/media/screenshots/07f/07fdd11e65456604b93a260056a73011.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 331, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ethereal Force"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Ethereal Force"], "esrb_rating": null}