{"id": 961780, "slug": "ms-holmes-the-case-of-the-dancing-men-collectors-e", "name": "Ms Holmes: The Case of the Dancing Men Collector's Edition", "name_original": "Ms Holmes: The Case of the Dancing Men Collector's Edition", "description": "Elephant Games invites you to take on the newest spine-tingling mystery in the Ms. Holmes series! <br/>\n<br/>\r\nWhen heiress Olivia Cubitt disappears just before her wedding, your friend Oscar Watson knows just who to call! Everyone close to Olivia has received strange letters with encryptions of dancing figures. Your Uncle Sherlock once dealt with a similar case, and when you discover his case files have been stolen, it’s clear foul work is at play! Can you discover what ties your case to your famous ancestors and stop those behind the dancing men once and for all? Find out in this gripping Hidden-Object Puzzle Adventure!<br/>\n<br/>\r\nThis is a special Collector's Edition release full of exclusive extras you won’t find in the standard version!<br/>\n<br/>\r\nThis is a Hidden Object Puzzle Adventure game, meaning a specific genre of story-driven, point &amp; click adventures. Throughout the game, players are tasked to find a list of objects hidden within a particular scene, and to occasionally complete various mini-games/puzzles.  <br/>\n<br/>\r\nThe Collector’s Edition includes:<br/>\n<br/>\r\n•\tInvestigate a string of mysterious illnesses in the Bonus Chapter!<br/>\r\n•\tReplay your favorite HOPs and mini-games and earn achievements! <br/>\r\n•\tFind tons of collectibles and search for magnifiers to unlock the Secret Room!<br/>\r\n•\tEnjoy exclusive wallpapers, screensavers, music, and more!<br/>\r\n•\tNever get lost with the strategy guide!", "metacritic": null, "released": "2023-06-02", "tba": false, "updated": "2023-06-05T05:10:27", "background_image": "https://media.rawg.io/media/screenshots/ea3/ea322b491a4e87ffc8056fe720f65788.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 379, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Elephant Ar"], "genres": ["Adventure", "Casual"], "publishers": ["Big Fish Games"], "esrb_rating": null}