{"id": 961775, "slug": "aery-the-lost-hero", "name": "Aery - The Lost Hero", "name_original": "Aery - The Lost Hero", "description": "In Aery - The Lost Hero you play as a little bird and search for a hero that is able to save your village. <br/><br/>On your journey you will discover unknown, giant and beautiful environments and you will be able to enjoy the feeling of flying while exploring a whole world filled with beauty and little secrets. <br/><br/>Within every area of the world, you have to find a certain amount of memory shards to remember the path that leads to your final destination and advance with the story. Once you have found all memory shards you are free to explore the next area. <br/><br/>What else? <br/><ul><li> Experience the feeling of flying with fluid and responsive flight controls<br/></li><li> See the world with the eyes of a bird with intuitive and relaxing gameplay<br/></li><li> Experience the speed of a bird without enemies or other threats<br/></li><li> Explore 10 vast landscapes with a different themes, style, and mood<br/></li><li> Follow the story of the protagonist<br/></li><li> Collect the memory shards to unlock the next area<br/></li><li> Immerse into the atmosphere with a vibrant minimalistic yet sometimes even surreal art style<br/></li><li> Enjoy the beautiful bright colors with interesting and different color themes in every area<br/></li><li> Discover hidden areas and many little surprises on your way</li></ul>", "metacritic": null, "released": "2023-06-02", "tba": false, "updated": "2023-06-05T04:52:37", "background_image": "https://media.rawg.io/media/screenshots/f26/f2653d18fc305ff68848eefed1f15add.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 415, "game_series_count": 15, "reviews_count": 0, "platforms": ["PC"], "developers": ["EpiXR Games UG"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["EpiXR Games UG"], "esrb_rating": null}