{"id": 961759, "slug": "cell-machine-indev", "name": "Cell Machine Indev", "name_original": "Cell Machine Indev", "description": "Get ready for the ultimate 2D  sandbox puzzle game experience with <strong>Cell Machine: Indev! </strong><br/><br/>An official successor to the popular Mystic Mod, Indev offers new levels, cell types, QOL and visuals, as well as a host of a community features like mod support!<br/><br/><br/><br/>Cell Machine: Indev comes jampacked with 30 levels out the box so you can jump right into the puzzle solving action! The game is played on a grid, with 10 usable cell types. Each cell type has a unique function and special interactions with other cells! In classic Puzzle Mode, drag cells onto the placement area in order to make a machine capable of clearing out enemy cells. Once you're ready to test it out, press play and see your creation at work! <br/><br/>Wanna shake it up? Try out the brand new Vault Mode. In vault mode you  have the entire grid and all cell types at your disposal, so you can let your creativity free. Sound simple enough? Vaults will offer a complex challenge to new and old players alike as they anything they can to break open the vault and destroy the enemies!<br/><br/>Ready for more? With the level editor the possibilities are endless. Indevs level editor lets you create campaign quality levels, simple as can be! When you're ready to share your creation export is a simple as a few clicks. Backwards compatibility with mystic mod gives you thousands of community created levels already at your fingertips! (Check out the discord below for a great place to share levels!)<br/><br/><br/><br/>Cell Machine: Indev is packed to the brim with new features. By playing today you can enjoy:<br/><br/><ul><li>New cells types<br/></li><li>New levels<br/></li><li>Improved editor<br/></li><li>Daily QOL updates<br/></li><li>Modding support<br/></li><li>Themes... (coming soon)<br/></li><li>Improved logic<br/></li><li>Faster load times<br/></li><li>User suggested content<br/></li><li>AND LOTS MORE TO COME...</li></ul><br/><br/><br/>Indev was built from the ground up for the community. This labor of love includes native modding support with documentation and a console. Load times are faster than ever before allowing you to expand your imagination and  create bigger contraptions than ever before! Explore our modding community: get connected today with our developer tools and our friendly community ready to help with modding questions by joining our discord.", "metacritic": null, "released": "2023-06-02", "tba": false, "updated": "2023-06-05T03:52:13", "background_image": "https://media.rawg.io/media/screenshots/5bf/5bf2c582eb506e0bc976585871389ed5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Kaiden Howard"], "genres": ["Strategy", "Simulation"], "publishers": ["Kaiden Howard"], "esrb_rating": null}