{"id": 961701, "slug": "hauma-a-detective-noir-story-demo", "name": "Hauma - A Detective Noir Story Demo", "name_original": "Hauma - A Detective Noir Story Demo", "description": "The full version of Hauma - A Detective Noir Story is coming soon! You can wishlist it here\n<br/><br/>\nHauma is a noir deduction visual novel set in the heart of Munich. Step into the shoes of Judith, a former detective with a sharp wit and a knack for getting things done, as she uncovers a conspiracy amongst the city's upper echelons of society. Explore real locations in a unique art style, immersing you in the world of Bavaria's capital. From the historic House of Art to other unexpected locations, discover pieces of hidden history that shed light on the city's past.\n<br/>\n<br/>\n<br/>\n<br/>\nCollect items, solve puzzles, and overcome dialogue riddles as you make your own investigative deductions using the mindboard, the heart of the game which functions like an inventory containing items and thoughts.\n<br/>\n<br/>\nFeaturing a diverse cast, Hauma is a fully voiced cinematic adventure with an intriguing story. Embark on a journey of deduction and intrigue, uncover the secrets of Munich's society and piece together the puzzle of the conspiracy that lies within.\n<br/>\n<br/>\n<br/>\n<br/>\n<ul>[❖] A thrilling noir-inspired journey through Munich</ul><ul>[❖] The mindboard, an innovative inventory of interconnected items and thoughts</ul><ul>[❖] Engaging investigation mechanics, including a variety of puzzles and challenging dialogue riddles</ul><ul>[❖] A visually unique art style</ul><ul>[❖] Fully voiced cinematic adventure, featuring a diverse cast</ul>\n<br/>", "metacritic": null, "released": "2023-05-18", "tba": false, "updated": "2023-06-02T06:05:32", "background_image": "https://media.rawg.io/media/screenshots/590/59091fc09dcbe6a7f4b2816f5499fdbc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 292, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SenAm Games"], "genres": [], "publishers": ["Assemble Entertainment"], "esrb_rating": null}