{"id": 961897, "slug": "liberation-2", "name": "Liberation", "name_original": "Liberation", "description": "In Liberation, you pilot an elite stealth ship as you take your revenge against the evil Galactic Federation (GalFed).<br/><br/>Upgrade your ship with a variety of weapons and systems. Engage in high-stakes dogfights, dock with space stations and planet spaceports, and work with heroes and villains to destroy GalFed.<br/><br/>Liberation is a lovingly crafted single-player open-universe RPG, inspired by classic science fiction such as Blake's 7 and the original 1984 BBC Micro version of Elite.<br/><br/><br/><br/><br/><br/>In Liberation, there are 24 unique systems to explore, ranging from Khalidir, a desert planet so harsh the residents never leave their domed city, to the Vantis Clouds, a nebula so dense that scanners are useless and hunters become prey.<br/><br/>GalFed is a living, breathing empire where thinking machines are banned, the rich and powerful amuse themselves with political intrigue, and regular citizens are treated like cattle.<br/><br/>It's up to you to lead the rebellion and liberate each system one-by-one.<br/><br/><br/><br/><br/><br/>Liberation is a action space combat sim stripped back to its core. Less trading, tighter combat, more story, and a rich lore-filled universe. <br/><br/>It is a low polygon game powered by the latest engine -- dynamic lighting, volumetric fog, physics and hundreds of ships.<br/><br/><br/><br/>We love scifi such as Blake's 7, The Tripods, Space:1999, Star Cops, Judge Dredd and Doctor Who! We wanted to pour all that rich story-telling, satirical humour and awesome but frankly wobbly special effects into one game.<br/><br/>So if you play only one space game this year, play Starfield. But if you play two space games, play Liberation.<br/><br/>", "metacritic": null, "released": "2023-06-05", "tba": false, "updated": "2023-09-22T05:36:44", "background_image": "https://media.rawg.io/media/screenshots/e2c/e2c8f5e7fb4d97577512b0c5a1b5b1de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["WINTERS", "Classyk Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["WINTERS", "Classyk Games"], "esrb_rating": null}