{"id": 961878, "slug": "if-walls-could-answer", "name": "IF: Walls could answer", "name_original": "IF: Walls could answer", "description": "<strong>\"IF: Walls could answer\" is a walking simulator exploration-puzzle game where you can discover surreal worlds, interact with strange individuals, and resolve puzzles.</strong><br/><br/><br/><ul><li> Walking simulator with four surreal worlds to explore.</li></ul><ul><li> Secret story objects to find.</li></ul><ul><li> Four endings and one secret ending.</li></ul><ul><li> Seven puzzles to solve.</li></ul><br/><br/>In this walking simulator, you can listen to different characters talking about their thoughts and problems. You will use this information to solve certain puzzles and progress throughout the story.<br/>Interact with objects left behind by some mysterious people that may be useful for the lore of the game.<br/>Gather different endings that could lead you to something else.<h3>Exploration</h3><strong>Explore</strong> four worlds with a different ending in each of them.<br/><strong>Find</strong> objects from past outsiders to learn about the whole reality. Several of these objects are hidden throughout the game.<br/><br/><strong>Listen</strong> to the clues the villagers may give you and understand their true feelings in these strange worlds.<br/><h3>Puzzles</h3>Resolve <strong>puzzles</strong> for each world and the hidden one that could lead the story to different endings.<br/>Each puzzle has its own way of solving it, so you must pay attention to the story that is told in each world and the clues that the characters can give you.<br/><br/><br/><br/>What do I do wrong? Can I do it again? Whatever, walls could answer.<br/>The invention of a scientist led him to recall parts of his past, along with his greatest regrets.<br/>The scientist's memories return in a way that is unexpected for him. Because of this, his thoughts become repetitive and he is trapped in a loop within his own subconscious.<br/>Maybe today is the day his thoughts will end? Or is the scientist doomed to blame himself forever?<br/>By the way, this is the story of a little green flame solving puzzles. But... What is the flame supposed to be?", "metacritic": null, "released": "2023-06-06", "tba": false, "updated": "2023-06-09T02:38:47", "background_image": "https://media.rawg.io/media/screenshots/0ab/0aba715fc1d5228e61b914f4949b3348.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Todist"], "genres": ["Adventure", "Indie"], "publishers": ["Todist"], "esrb_rating": null}