{"id": 961892, "slug": "striker-zone-gun-games-online", "name": "Striker Zone: Gun Games Online", "name_original": "Striker Zone: Gun Games Online", "description": "Welcome to the best shooting game and as well as gun games for free<br/>\n<br/>\r\nStriker Zone is the best 3D shooter, one of the best online multiplayer games. Shoot and win in one of the best online multiplayer games where you create your own rules!<br/>\n<br/>\r\nYou left to survive in the striker zone. Become an in the best PvP shooter, come to the world of the most dynamic PVP first person shooting games online.<br/>\r\nFeel the power of PVP online with players from all over the world. Challenge your skills in team battles.<br/>\n<br/>\r\nAdvance your fighter's rank, upgrade weapons and armor. Become the best in online games, a shooting game!<br/>\r\nFight with friends in one team battle, or destroy an avalanche of enemies by your own in deathmatch mode. Be the best and stay on the top of the rating table in the best of online action!<br/>\r\nJoin clans of other and play with friends, ABSOLUTELY GUN GAMES FOR FREE!<br/>\n<br/>\r\nFEATURES of Striker zone game. <br/>\n<br/>\r\n• Participate in the world tournaments, take the first place in rating!<br/>\r\n• Modern and outstanding 3D graphics first person<br/>\r\n• Huge choice of weapons, equipments and upgrades to your soldier. Choose a suitable gun and go to PVP battles!<br/>\r\n• Try a variety of camouflage and decals. Full Squad customization<br/>\r\n• Various battle zones<br/>\r\n• User-friendly controls that will be enjoyed both by newbie shooter players and hardcore gamers.<br/>\r\n• Be brave, shoot, advance in rank, upgrade your soldier, receive awards, and daily bonuses.<br/>\r\n• Common chat that lets you communicate with of your country<br/>\r\n• Dynamic battles around the world and crazy nonstop PVP shooter game.<br/>\r\n• You can choose any game mode: team battle or single battle. And all this is absolutely FREE!<br/>\r\n• World tournaments, fight for the of your country!<br/>\n<br/>\r\nTry Different Maps. Train map, Aztec temple, secret city and more. Survive on the military. Try shooting mode or tank rush. Choose tactics and find your enemy's weak spots!<br/>\r\nUse More than 30 types of guns, rifles, grenades, landmines, body armors, and weapon skins! Face the war in a complete set of weapons and protection. Play and unlock incredible gun weapons and gadgets.<br/>\n<br/>\r\nTry a perfect optimization, even on weak devices helps you to take control of the battle, deal with the conflict as a real machine. High FPS helps you to become the best sniper in this action!<br/>\n<br/>\r\nBeautiful graphics! You have never seen so realistic guns in a multiplayer shooter. Do you have a low-performing device? Don't worry - in this, you can choose different types of graphics for a comfort action.<br/>\r\nUse Easy and intuitive modern control. Try comfort controls and becomes the best sniper!<br/>\n<br/>\r\nBE THE BEST PLAYER IN GUN GAMES WHEN YOU LEFT TO SURVIVE! <br/>\n<br/>\r\nBrighten your life with adrenaline buzz, start your own fight! Play download fun gun games!", "metacritic": null, "released": "2023-06-04", "tba": false, "updated": "2023-06-09T02:55:42", "background_image": "https://media.rawg.io/media/screenshots/5e1/5e1bac437636593c9256091c38f80657.jpg", "website": "https://xdevs.ltd/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 34}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["XDEVS"], "genres": ["Action", "Simulation", "Casual", "Massively Multiplayer"], "publishers": ["XDEVS"], "esrb_rating": null}