{"id": 961886, "slug": "cadence-cuties", "name": "Cadence Cuties", "name_original": "Cadence Cuties", "description": "<h3>Rock Out with One Hand</h3><br/>‘Cadence Cuties’ boasts a simple yet enjoyable mechanic that lets you hit every note with one hand. With a diverse selection of songs to choose from, you’ll find yourself effortlessly swaying to the beat in no time. Using exciting mechanics such as ‘Climax time’ and ‘Combos’, both beginners and pros can rack up scores and revel in the thrill of hitting every beat.<h3>Feast Your Eyes on Exquisite Girls</h3><br/>Immerse yourself in our visually stunning game, featuring a variety of exquisite characters that will capture your heart. Each character has her own unique style and personality, beautifully rendered with vibrant colors and intricate details. From the gorgeous girls to the mesmerizing animations, the game is a feast for the eyes that will leave you spellbound.<h3>Groove to Your Own Beat</h3><br/>Experience the rush of our exciting pop songs that make you groove in your seat. Our music selection features an array of catchy J-pop songs that will cater to all tastes. What’s more, our game allows you to import and play your own custom songs, providing you with the freedom to dance to your own beat. Whether you’re a fan of pop, rock, or electronic dance music, our game has it all. So turn up the volume and let the music transport you to another world.", "metacritic": null, "released": "2023-06-04", "tba": false, "updated": "2023-06-09T02:48:55", "background_image": "https://media.rawg.io/media/screenshots/84e/84ed3d35f8e7a053ef373b07fce08afd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 354, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Minami chan"], "genres": ["Casual", "Indie"], "publishers": ["Minami chan"], "esrb_rating": null}