{"id": 961982, "slug": "quest-master", "name": "Quest Master", "name_original": "Quest Master", "description": "MAKE YOUR OWN DUNGEONS\n\n\n  \n<br/>\nWith dozens of parts, both classic and new, at your disposal, the possibilities are endless! Combine different ones to create entirely new mechanics and complex puzzles!<br/>\nCycle between unique themes with the click of a button to give your dungeon a fresh coat of paint.\nCHOOSE YOUR THEME\n\n  \n<br/>\nCycle between unique dungeon themes with the click of a button to give your dungeon a fresh coat of paint. Set your dungeon in a sand temple, a fiery cavern or in a lush forest. All components of the dungeon swap on the fly -- you're never locked into just one.\nA ROBUST EVENT SYSTEM\n\n  \n<br/>\nLink different dungeon components together with an intuitive drag-and-drop system to create events in your dungeon. Make keys and items appear when all enemies are slain, or rig a devious trap to an innocuous switch -- these are the most basic examples. Experiment and find out what else is possible!\nIT’S DANGEROUS TO BUILD ALONE\n\n\n  \n<br/>\nHave some inventive friends? Round them up and work together to build and explore in local co-op with up to 3 friends.\nSHARE YOUR CREATIONS\n\n\n  \n<br/>\nBuilt the perfect dungeon? Upload it for other players to test their mettle. Need a new challenge? Dive into another dungeon from the ever-growing list of community-uploaded creations.", "metacritic": null, "released": null, "tba": false, "updated": "2023-06-09T04:58:36", "background_image": "https://media.rawg.io/media/screenshots/3a6/3a6768169a7d9b00f7dc78af9ac90f3a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 360, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["skydevilpalm"], "genres": [], "publishers": ["Apogee Entertainment"], "esrb_rating": null}