{"id": 961917, "slug": "their-land", "name": "Their Land", "name_original": "Their Land", "description": "<h3>IMPORTANT NOTICE!</h3><strong>There are viral videos spreading FALSE information about this game. This is a single developer product still studying at university! There is no multiplayer, just a single player story mode and a coop wave based game mode.</strong><br/><br/><br/><br/>Their Land is an indie game developed and produced by one individual. In the story-mode you can find artefacts with exciting nano-stories and explore the island. The story-mode lasts about 3 hours.<h3>This Island should have never been found</h3><br/>The sea holds a secret that no one has dared to uncover – yet. A mysterious, unexplored island shrouded in mystery. It beckons to a group of intrepid adventurers, seasoned in the art of danger and the thrill of exploration.<br/><br/>Their mission: to uncover new riches of raw materials to fuel a burgeoning mining industry, and to scout potential sites for the construction of entire towns and cities on this untouched terrain. But what lies beneath the surface of this island and why has it never been entered?<br/><br/>... or left?<br/><br/><br/><br/>You are Jeremy, an inexperienced 19-year-old. The island’s secrets call to all fearless men, drawing them ever deeper into a world of danger. Will you uncover the hidden treasures of this fabled land, or will you fall victim to its many perils?<h3>You Can’t Save Everyone. But You Can Try…</h3><br/>Their Land is a 1st person puzzle game and shooter with an exciting story. You will need to help your friends and survive on your own from never before seen creatures.<br/><br/><h3>Play wave-based coop with your friends online!</h3>The game also offers an online co-op wave-based gamemode with friends or other players with a global leaderboard! Prove your strength and fighting skills you learned in the story mode!", "metacritic": null, "released": "2023-06-06", "tba": false, "updated": "2023-06-09T03:33:05", "background_image": "https://media.rawg.io/media/screenshots/9e3/9e3c631018667fcb858b4198b56887a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 481, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Thomas"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Thomas"], "esrb_rating": null}