{"id": 961933, "slug": "tamagoneko", "name": "Tamagoneko", "name_original": "Tamagoneko", "description": "<strong>Mischievous kitten eggs have escaped from the home nest! </strong><br/>As a small white Cat, it's up to you to find and return all of them back to safety, because the world is not friendly out there! Spikes, saws and bottomless pits are just a small part of what the Cat has to face on the journey to save the kitten eggs.<br/><br/><br/><br/><br/><br/><ul><li><strong>A huge world to go through:</strong><br/>The kitten eggs have scattered all around the world! You will jump and climb through 160+ unique hand-crafted levels in 7 worlds in order to rescue them. Wild plains, thorny deserts, crystal caverns: each world comes with different design, distinctive levels and new gameplay mechanics.<br/></li><li><strong>Complex level design:</strong><br/>Created with inspiration from Super Meat Boy, Celeste and Kaizo Mario, these fast-paced levels challenge your understanding of the Cat's movement and game mechanics. Some of them also require good execution, so it won't be easy, but won't be boring either!<br/></li><li><strong>Dozen of interactive elements:</strong><br/>Balloons can bounce you up, platforms fall down (usually), stompers will squish you and coins always show the right way. Learn how to make them all helpful!<br/></li><li><strong>Refined character movement:</strong><br/>Jumping is not the only thing cats are good at! Crawl through narrow passages, climb on steep walls and even double jump your way to new heights. Utilize these moves in combination with different level elements to overcome even the toughest obstacles!<br/></li><li><strong>Achievements and Cat customization:</strong><br/>Spend your hard-earned coins and complete achievements to get colorful upgrades for the Cat! You can unlock more than 50 various skins, trails and effects and combine them to create your own stylish character.<br/></li><li><strong>Friendly for speedrunners:</strong><br/>Tamagoneko tracks individual level times and total time spent completing the game. Can you beat it faster than anyone in the world? <br/></li><li><strong>Secret stuff:</strong><br/>Each level contains a secret fruit for additional challenge. You get something cool after collecting enough of them, but don't dig too deep...</li></ul><br/><br/><br/>", "metacritic": null, "released": "2023-06-06", "tba": false, "updated": "2023-06-09T03:52:01", "background_image": "https://media.rawg.io/media/screenshots/ae4/ae4a151a902acf1e8f4661086acb06c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["GDFET"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["GDFET"], "esrb_rating": null}