{"id": 961915, "slug": "vegan-rebellion", "name": "Vegan Rebellion", "name_original": "Vegan Rebellion", "description": "Vegan Rebellion is a fast-paced 2D horde shooter game where players fight against enemies to survive as long as possible. By levelling up and equipping better gear, players can increase their chances of surviving for longer periods.<h3>Story</h3>Somewhere off in a distant land, there lies a peaceful countryside town named Huckleberry Village... But this town holds a deep, dark, dirty secret! The local Huckleberians have been butchering the village animals, stealing their babies, and drinking their milk for centuries.<br/><br/>But an uprising is beginning. Four brave farm heroes, Porky the Pig, T-bone the Cow, Lambchop the Sheep, along with their friend Murder Mittens—who has given up eating tasty barn rats to help his friends—have decided that it's time to fight back! Join the gang as they take down one Huckleberian at a time using an array of weapons and hidden superpowers yet to be discovered, which were given to them by a strange visitor from another planet.<br/><br/>Will they be able to take down the meat-eating locals, restore peace in the land, and save their families? Come with us. This is a call for an uprising!Features<ul><li>Fast-paced game play<br/></li><li>Multiple unique characters to play<br/></li><li>Collect experience points to level up and select a unique perk<br/></li><li>Purchase and sell items<br/></li><li>Manage your inventory<br/></li><li>Equip better gear to survive longer<br/></li><li>Compete for a high score.</li></ul>", "metacritic": null, "released": "2023-06-05", "tba": false, "updated": "2023-06-09T03:29:43", "background_image": "https://media.rawg.io/media/screenshots/5c4/5c43827f95c32ffb90a08a05802377bc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["roKKi"], "genres": ["Action", "Casual", "Indie"], "publishers": ["roKKi"], "esrb_rating": null}