{"id": 961947, "slug": "brain-show", "name": "Brain Show", "name_original": "Brain Show", "description": "<strong>Brain Show: Who is the smartest one in your crew?</strong><br/><br/><br/><br/><strong>Brain Show</strong> is a quiz game spiced with some mean, but harmless humor. Immerse in the world of classic game shows: choose your categories, answer questions, eliminate rivals in various challenges, and prove yourself to be the smartest one in the pack!<br/><br/><br/><br/><ul><li>Up to 8 players in single game<br/></li><li>Over 5 000 questions in 41 categories<br/></li><li>13 competitions with entirely different rules<br/></li><li>Charismatic, funny (and a little cringy) host commenting your actions<br/></li><li>Unique opportunity to turn your best friend into sworn enemy for the rest of your life!<br/></li><li>Possibility of online multiplayer play via Remote Play</li></ul><br/><br/><br/>Controls in <strong>Brain Show</strong> were designed on a test group consisting of my chihuahua and a blind, 22 years old cat. So don’t worry if some of your friends have never played any game in their lives or if someone drank one too many. You just hand out pads, launch the game and have fun from the get-go. No manual or explanation needed!<br/><br/>Take part in a TV show for people who are ashamed to admit that they have always dreamt about participating in one! Stand on a stage, take part in various challenges, such as the <strong>Stealing Points</strong> Round or <strong>Eliminations</strong>, play for a stake, and get annoyed by the weird host!<br/><br/>Get <strong>Brain Show</strong> and join the fun!", "metacritic": null, "released": "2023-06-07", "tba": false, "updated": "2023-06-09T04:12:52", "background_image": "https://media.rawg.io/media/screenshots/425/42536b2487e9ee57d7486871dd3ab2b4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Simplicity Games"], "genres": ["Casual", "Indie"], "publishers": ["Simplicity Games"], "esrb_rating": null}