{"id": 961936, "slug": "tokyo-pinball", "name": "Tokyo Pinball", "name_original": "Tokyo Pinball", "description": "A game designed to introduce the fun of pinball.<br/>Whether you have never played pinball before or not, I hope you will enjoy playing it!<h3>🔰 Let's Play Pinball</h3>To make it easier for beginners to play, automatic slow motion, stamina-based kickback, and nudging are implemented. Tokyo Pinball is a good place to start if you have never played pinball.<h3>🎲 Features</h3>The game implements the following features that are familiar to pinball players. <br/>Such as Jackpot, Nudging, Kickback, Extra Ball, Hold Bonus, Hurry Up, Score Multipliers, Ball Saver and Game End Bonus<h3>🙋 FAQ</h3><br/><strong>Do you have multi-balls?</strong><br/>No. I have tested multiball several times and decided that it is not suitable for this game for the following reasons:<br/><ul><li>the incompatibility of top view 2D pixel art and multiball.<br/></li><li>frequently switch display layers (inside buildings) in the playfield.<br/></li><li>slow motion and pauses occur when the player does not intend to.<br/></li><li>narrow margins of the playfield designed for speedy single-ball play.</li></ul><br/><strong>Are there multiple levels?</strong><br/>No. I believe it is more important for players to play one level repeatedly and feel that their play improves than having multiple levels in this game. If additional levels are implemented, they will be sequels.<br/><br/><strong>My controller is not responding!</strong><br/>Only XInput controllers are supported; you can play with other controllers by emulating keyboard input with a Steam client or other software.<br/><br/><strong>Do you have any information about the game rules or terms of use?</strong><br/>Please check the \"README\" and \"GAMERULE\" files in the installation folder, or refer to the \"View the quick reference\" and \"View the manual\" on the store page.", "metacritic": null, "released": "2023-06-07", "tba": false, "updated": "2023-06-09T03:54:52", "background_image": "https://media.rawg.io/media/screenshots/7ff/7ff6da90e36cde46544ded4721a323fa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rikiya Minami"], "genres": ["Action"], "publishers": ["Rikiya Minami"], "esrb_rating": null}