{"id": 961924, "slug": "death-roads-tournament-prologue", "name": "Death Roads: Tournament Prologue", "name_original": "Death Roads: Tournament Prologue", "description": "You'll take control of Maggie \"Liberty\" Murdock and her car, navigating through two different routes filled with a variety of enemies. You'll also have access to numerous car components and cards, providing you with the resources to upgrade and enhance your vehicle's performance. Experience road events and utilize an arsenal of gadgets to gain the upper hand. This is just the start of your journey into the world of Death Roads: Tournament.<br/><br/><br/><br/>Prior to embarking on your destructive spree, carefully select your driver and their vehicle. Your initial card set will accompany your chosen ride. Next, opt for a sponsor who will dictate your initial location on the map. Exercise caution when making this decision, as alterations will not be possible once chosen!<br/><br/><br/>Cards serve a purpose beyond merely unleashing gunfire upon fellow vehicles. Utilize them to navigate the game board strategically and secure advantageous positions. Employ clever tactics to evade obstacles and steer clear of being forcefully displaced. Alternatively, adopt a more aggressive approach by intentionally colliding with your opponents!<br/><br/><br/><br/><br/>Don't forget to adjust your gears as you drive. The higher the gear, the more potent your cards become, but the risk of skidding also intensifies. Master the art of leveraging this mechanic to your benefit. Through practice, you can skillfully skid your way to victory!<br/><br/><br/><br/>Acquire car components from defeated adversaries and incorporate them into your vehicle to acquire diverse cards! Experiment with fresh weaponry, engines, and wheels to catch your rivals off guard and enhance your chances of victory. Assemble a complete deck to unleash lethal combinations.<br/><br/><br/><br/><br/>Every battle pushes you nearer to triumph in the relentless race of Death Roads. Maintain momentum and surge ahead, for victory, can swiftly slip away. In the event of failure, be prepared to embark on your journey anew. However, take solace in that any accomplishments and rewards earned along the way remain permanently yours.<br/><br/><br/><ul><li><strong>Master</strong> turn-based battles with road events.<br/></li><li><strong>Unlock</strong> various cars and characters with special weapons.<br/></li><li><strong>Build</strong> card decks based on swapping around car parts.<br/></li><li><strong>Progress</strong> across a nonlinear world map.<br/></li><li><strong>Vibe</strong> with stylized graphics reflecting a thrilling race.</li></ul>", "metacritic": null, "released": "2023-06-06", "tba": false, "updated": "2023-06-09T03:41:56", "background_image": "https://media.rawg.io/media/screenshots/bef/bef61acb81a81d9532b7b0b543fb8502.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 25}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 342, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Knights of Unity"], "genres": ["Strategy", "Racing", "Indie"], "publishers": ["The Knights of Unity"], "esrb_rating": null}