{"id": 962062, "slug": "greyhill-incident", "name": "Greyhill Incident", "name_original": "Greyhill Incident", "description": "This story-driven Survival-Horror game is about a classic Alien-Invasion which takes place during the early 90s. As Ryan Baker, equipped with a baseball bat and a few bullets in his revolver, the story takes you across the atmospheric neighborhood of Greyhill which is invaded by UFOs &amp; Grey Aliens. <br/><br/><br/><strong>EXPERIENCE A CLASSIC ALIEN INVASION STORY</strong><br/>It's the early 90s in the US, the media talks about weather balloons and conspiracy theories. But residents of the small neighborhood soon realise! <br/>THE GOVERNMENT IS LYING.<br/>The recent increase paranormal activities over the last few days have convinced the scared and now paranoid residents of Greyhill, that the Government are somehow involved. <br/>They trust no one. The small neighborhood of Greyhill are afraid to speak up and fearing being sent to the psychiatric ward, they avoid calling the police. <br/>Alone, they prepare by boarding up their windows and founding a neighborhood watch.<br/><br/><br/><strong>GET ACROSS THE NEIGHBORHOOD AS AN AVERAGE GUY</strong><br/>As Ryan Baker,\"an average guy\" equipped with a baseball bat and a few bullets in his revolver, your path is to get across the atmospheric neighborhood of Greyhill to save a neighbor who is in serious trouble. Find useful items, solve puzzles and you meet other neighbors as you fight to survive the invasion and guide Ryan through the Neighborhood.<br/><br/><br/><strong>INVESTIGATE AND UNCOVER THE TRUTH</strong><br/>Sneak through the open areas of the atmospheric US Neighborhood which has been invaded by Aliens &amp; UFOs. Investigate houses &amp; barns and search for ammo while you work up your way through the village and uncover the Alien Conspiracy.<br/><br/><br/><strong>AND BE AWARE OF THE SMALL GREEN MEN</strong><br/>A constant threat which invaded the village with their flying saucers.\"They\" are trying to abduct everyone in the village, taking samples of everything, making experiments and probing people. Sneak, Run or fight to get through Greyhill and beware of \"The Greys\".<br/><br/><strong>Feel free to add Greyhill Incident to your Wishlist.</strong>", "metacritic": null, "released": "2023-06-09", "tba": false, "updated": "2023-11-23T06:59:38", "background_image": "https://media.rawg.io/media/screenshots/62e/62e83cd17924607e52391b98b34f88ce.jpg", "website": "", "rating": 2.29, "rating_top": 3, "added_by_status": {"yet": 1, "owned": 3, "beaten": 2, "toplay": 4, "dropped": 8}, "playtime": 0, "achievements_count": 26, "ratings_count": 7, "suggestions_count": 466, "game_series_count": 0, "reviews_count": 7, "platforms": ["PC"], "developers": ["Refugium Games"], "genres": ["Adventure", "Indie"], "publishers": ["Refugium Games"], "esrb_rating": null}