{"id": 962042, "slug": "yggdrasill", "name": "YGGDRASILL", "name_original": "YGGDRASILL", "description": "<strong><h3>What is \"YGGDRASILL\"</h3></strong><br/>In a decaying world, the life of all the Holy Spirits, including the World Tree, has been lost, and a certain goddess entrusted you with the last seed of the World Tree in order to revive the world!<br/>Plant the World Tree, synthesize Stella, revive the Holy Spirits, and bring the world back to life again!<br/><br/> <h3>◆Game system</h3><strong>・About “World Tree”</strong><br/>Click on the world tree to synthesize \"Stella\", \"Stella\" can strengthen the world tree and the Holy Spirit!<br/>We assume approximately 300+ hours to experience all of the implemented systems!<br/><br/><strong>・About “Holy Spirit”</strong><br/>Consuming Stella, the Holy Spirit can be released and strengthened, and depending on the level of strengthening, the Holy Spirit can be released and strengthened further.<br/>You can release new functions, gain special skills, and increase the rate of stellar synthesis.<br/><br/><strong>・About “day and night”</strong><br/>A day/night system linked to real time, the visible landscape and music will also change with progress,<br/>The scenery also changes with the time of day, and as the roots of the World Tree are strengthened, the tree becomes more and more lively, allowing you to enjoy your time at leisure.<br/><br/><strong>・About “Ragnarok”</strong><br/>\"Ragnarok\" is a function that destroys the current world and rebuilds a new world.<br/>The stelae acquired up to now are converted into \"Yggdrasil seeds,\" which are strengthened with the roots of the world tree found in every world,<br/>The stelae acquired so far are converted into \"Yggdrasil Seeds,\" which are strengthened with the roots of the World Tree in every world, and become an aid to the new world.<br/><br/><strong>・About “Mini Event”</strong><br/>You can experience a number of mini-events inspired by Norse mythology.<br/>For example, you can boost the synthesis rate of Stella by collecting pieces of Bifrost,<br/>Gungnir to automatically click for a certain period of time, etc,<br/>You can get Stella with a variety of abilities!<br/><br/><strong>・About “Music Player”</strong><br/>More than 50 music tracks are available depending on the progress of the game, you can leave it in the background and still enjoy the atmosphere of the World Tree.<br/><br/><strong>・About “Achievements”</strong><br/>There are 100 unlockable achievements! Clear various conditions and increase your collection!", "metacritic": null, "released": "2023-06-08", "tba": false, "updated": "2023-06-12T02:31:27", "background_image": "https://media.rawg.io/media/screenshots/d6b/d6bbf80222e1a34bfc0fdb1e4584d2c2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 352, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NEOLAVI"], "genres": ["Simulation", "Indie"], "publishers": ["indiegamesjapan"], "esrb_rating": null}