{"id": 962094, "slug": "cyber-dose", "name": "Cyber Dose", "name_original": "Cyber Dose", "description": "Part puzzler, part farm-sim, part cyberpunk, part serious game. An addictive VR experience that requires a constant need for in-game “Booster” tabs in order to gain more knowledge about potentially addictive real world substances.<h3>SETTING AND GAMEPLAY</h3><br/>Cyber Dose puts the player in the place of an AI databot located in the central node of a newly created neural network within the HeXR Cloud System.<br/>Your role is to analyse and gather data on digital twins of illicit substance samples beamed in by AI health bots positioned on Earth.<br/><br/>You will gain knowledge about each sample's molecular structure, manufacture and usage effects. This data must then be packaged and beamed back within a limited time frame to assist and educate humans about what the makeup of substances are before they consume them.<br/>Continue to collect data and learn in order to expand the neural network and increase the speed of data package delivery. <br/><br/>Be sure to stay BOOSTED while completing tasks or you run the risk of crashing and entering bot rehab,  and still while human drug related harm around the world continues to increase.<br/>If too many countries reach extreme harm levels, you will be summoned by the Bot Integrity Unit, or even worse, deregistered and shut down...<h3>FEATURES</h3><br/><ul><li>The only “hands on” game to discover more about the chemistry, manufacture, use and health implications of real world illicit substances.<br/></li><li>Endless gameplay with randomized drug samples and unlimited construction of in-game neural network.<br/></li><li>Digi vibes, neon environment and haptics to tingle the senses.</li></ul>", "metacritic": null, "released": "2023-06-09", "tba": false, "updated": "2023-06-12T03:43:16", "background_image": "https://media.rawg.io/media/screenshots/8dd/8dd6ba46aa46bc23fea2ca84f1f9e29b.jpg", "website": "https://usagixr.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Usagi XR"], "genres": ["Simulation", "Indie"], "publishers": ["Usagi XR"], "esrb_rating": null}