{"id": 962193, "slug": "heist-kitty-multiplayer-cat-simulator-game", "name": "Heist Kitty: Multiplayer Cat Simulator Game", "name_original": "Heist Kitty: Multiplayer Cat Simulator Game", "description": "What do cats think about while blinking serenely in the sunlight? Fish skeletons? Balls of wool? Nope, it’s carnage. Utter carnage. Human friends, it’s time to choose your kitty, tickle the tummy of chaos and watch the fur fly in Heist Kitty: Cats Go a Stray. <br/><br/><h3>Multiplayer Cat Chaos</h3>What’s crazier than a sack of cats*? A city full of ‘em. See life through the eyes of a mischievous kitty as you wreak havoc in this open-world multiplayer litter tray sandbox. Go solo or go feral with your friends, strutting your stuff on the dance floor, posting high scores at the arcade and speeding through the city streets in hijacked cars. <br/>*No cats were harmed in this analogy. <br/><br/><h3>Whose Side are You On?</h3>Welcome to Kitty City, where Chief Hairris’ Purrlice force wages an ongoing battle to stay one pounce ahead of Tawny Catatelli’s cunning Meowfia. Unfortunately for the Chief, keeping crooked cats behind bars is like herding...you know. Hit the streets and work as a kitty cop or take on jobs for the mob. Whichever side of the law you land on, you can be sure of a life of moggy mayhem.<br/><br/><br/><h3>Become the Ultimate Cat Nuisance</h3>If you’re a cat and you’re following the rules, you’re doing it wrong. Wherever you travel, make sure you leave mischief in your wake. Knock glasses off tables, lay waste to grocery shops, zap humans with unfeasibly intricate weapons that can’t possibly have been built without the help of opposable thumbs. And don’t worry about the fallout, cats don’t have a word for “consequences”.<br/><br/><br/>", "metacritic": null, "released": "2023-06-13", "tba": false, "updated": "2023-06-16T03:22:31", "background_image": "https://media.rawg.io/media/screenshots/944/944a050d3740db69af369758f98a9391.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 365, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LetMeowt Games"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Racing", "Casual", "Indie"], "publishers": ["Excalibur Games"], "esrb_rating": null}