{"id": 962179, "slug": "pure-sniper", "name": "Pure Sniper", "name_original": "Pure Sniper", "description": "Pure sniper is an exciting and realistic sniper shooting game with a massive campaign mode that can be played offline and a realtime multiplayer PvP combat mode.<br/>\n<br/>\r\nArm yourself with various powerful sniper rifles, machine guns, shotguns, and pistols to complete modern combat missions deep inside enemy territory.<br/>\n<br/>\r\nWhy Pure Sniper is Epic?<br/>\n<br/>\r\nSniper Main Campaign: In this mode, you will be able to eliminate targets in many cities around the world. Complete these sniping missions and explore new virtual reality space with interactive sights!<br/>\n<br/>\r\nGun Range Competition: Take this challenge if you have gun shooting skills to kill your target from any range.<br/>\n<br/>\r\nHostage Rescues: Missions where you will use your sniper skills to help helpless hostages escape dangerous criminals.<br/>\n<br/>\r\nHelp The Police in A Gun Fight: In this mode, you will be able to assist the police in a firefight to take out gun carrying criminals.<br/>\n<br/>\r\nTake out Manhunt Targets: You will be shooting a wanted target, sometimes it can be an armed criminal, sometimes it can be a thief, or maybe a dangerous criminal. <br/>\n<br/>\r\nHelicopter Assault: In this mode, you will be using your epic sniper skills to shoot &amp; stop criminals while riding a helicopter.<br/>\n<br/>\n<br/>\r\nPure Sniper Game Features:<br/>\r\n- This FPS Gun Simulator game has a thrilling 3D design and sound. The graphics are breath-taking, with slow-motion shots that will leave your heart racing!<br/>\r\n- Many fun &amp; exciting sniping guns, pistols, bullets, and grenades.<br/>\r\n- The battle simulator game is totally free to play. Available in offline solo and online multiplayer modes. You can join the battle and start playing the free game even when you are offline<br/>\r\n- Play in multiple battlegrounds<br/>\r\n- Simple &amp; smooth gun shooting control<br/>\r\n- Interactive &amp; action-packed environment<br/>\r\n- Connect with the FPS snipers around the world to beat other teams.<br/>\n<br/>\r\nStep into the ultimate 3D FPS action adventure! One of many games in the free sniper shooting games genre, which offers an immersive, competitive experience for endless hours with your friends.", "metacritic": null, "released": "2023-06-12", "tba": false, "updated": "2023-06-16T03:03:34", "background_image": "https://media.rawg.io/media/screenshots/787/78732f5fed6a3b7610f01f6b10550242.jpg", "website": "https://support.puresniper.miniclip.com/hc/en-us", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 402, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Miniclip Derby"], "genres": ["Action"], "publishers": ["Miniclip Derby"], "esrb_rating": null}