{"id": 962155, "slug": "eyes-of-war", "name": "Eyes Of War", "name_original": "Eyes Of War", "description": "Eyes of war is a Real-Time Strategy game set in the Middle Ages, where you build your castle and army and try to defeat your enemies. It can be played as a single player (vs. AIs) or Multiplayer with up to 4 players (Against Real Opponents). Build your castle, develop your city, create your army and destroy your enemies.<br/><br/><h3>3rd person mode(TPS);</h3>Don't you like spilling the blood of your opponents from an isometric view? Dive into the battle using 3rd person mode. Face your opponents with the soldier of your choice. Tactically switch to another soldier at will and play with every aspect of the battle. Would you like to experience this? Then go ahead and fight your opponents using this mode.<br/><br/><h3>Win a glorious victory against rival AI's;</h3>From AI opponents in easy mode where you prepare yourself for battle and learn the strength and capabilities of your soldiers, to difficult AI opponents where you fight for resources and outposts, even pushing you to your limits, and show your enemy your strength.<br/><br/><h3>Triumph over real opponents with online co-op play;</h3>Play with up to 4 real human opponents. Compete for resources and outposts and build your city. Remember, you need a lot of resources to build a strong army. Bring down your opponents with your army and show your superiority.<br/><br/>", "metacritic": null, "released": "2023-06-15", "tba": false, "updated": "2023-06-16T02:37:02", "background_image": "https://media.rawg.io/media/screenshots/011/011cefcb795f6b7799c7adad137e4aa9.jpg", "website": "http://www.eyesofwar.org/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 432, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Good Mood Games"], "genres": ["Strategy", "Indie"], "publishers": ["Good Mood Games"], "esrb_rating": null}