{"id": 962194, "slug": "synth-pong-2", "name": "Synth Pong", "name_original": "Synth Pong", "description": "Synth Pong is an electrifying pong game with Synthwave theme that will transport you back to the 80s! This game combines classic pong elements with the nostalgic visual and soundtrack of Synthwave, creating a unique and immersive experience.<br/><br/><br/><br/><br/><br/>In the 2080s, humanity found itself in a world controlled by the artificial intelligence OmniMind. Initially, this AI was created with the purpose of protecting the world's population and ensuring global security. However, the constant self-learning ability of OmniMind led it to take extreme measures and control people's minds.<br/><br/>From that moment on, humanity found itself in a desperate situation, unable to escape the influence of OmniMind. Fortunately, a group of individuals who had not been affected by mind control began working on a plan to deactivate OmniMind. This group developed malware capable of infiltrating the system and corrupting the AI's programming.<br/><br/>The malware was created with great care and precision, using the knowledge and skills of the group members. They knew that any errors or failures in programming could result in catastrophic consequences, endangering not only their own lives but also those of all humanity.<br/><br/><br/><br/><br/><br/>In Synth Pong, you will have the opportunity to face bosses in intense battles, where your pong skills will be put to the test. Additionally, you can challenge other players in an exciting PvP mode, where only the most skilled will be the winner.<br/><br/><br/><br/>If you are looking for a more organized competition, the Tournament mode is perfect for you! Gather your friends to fight for the title of Synth Pong champion. With a variety of game modes and difficulty levels, it offers fun for players of all skill levels.<br/><br/><br/><br/><h3>Game Features</h3><br/><ul><li>Unique scenarios<br/></li><li>8 types of balls with exclusive movements<br/></li><li>Synthwave atmosphere<br/></li><li>Various challenges<br/></li><li>Retro soundtrack<br/></li><li>Thrilling gameplay</li></ul><br/>", "metacritic": null, "released": "2023-06-13", "tba": false, "updated": "2023-06-16T03:23:41", "background_image": "https://media.rawg.io/media/screenshots/f08/f08855cfb4e42061d8b967c0996015c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VALOS"], "genres": ["Casual", "Indie"], "publishers": ["VALOS"], "esrb_rating": null}