{"id": 962269, "slug": "nova-lands", "name": "Nova Lands", "name_original": "Nova Lands", "description": "<h3>JOIN OUR DISCORD</h3><br/><h3>Sobre o jogo</h3><h3>Construção de Base</h3><br/>Sua tarefa é construir um novo lar num planeta distante usando todos os tipos de recursos, como madeira e rochas e minerais raros desconhecidos. Cada nova construção desbloqueada abre novas possibilidades. Comece pequeno e descubra como elas podem trabalhar com mais eficiência e facilitar sua vida.<br/><br/><h3>Automação</h3><br/>Uma grande parte do jogo é transformar 'trabalho duro' em 'trabalho inteligente'. Você começa criando tudo à mão e desbloqueia mais e mais níveis de automação. Seus bots são uma das principais ferramentas para isso!<br/><h3>O que são os bots?</h3><br/>São máquinas autossuficientes construídas para trabalhar duro, são simples de gerenciar e formam cadeias de produção complexas. Ao configurar seus bots, você pode decidir como cada ilha será usada e como os recursos serão movidos entre elas com base em suas necessidades de produção.<br/><br/><h3>As ilhas e exploração</h3><br/>Conforme você progride, você logo perceberá que pode desbloquear várias ilhas. Elas têm diferentes biomas, criaturas, marcos, cavernas e NPCs para você ajudar e conversar.<br/><br/><h3>Combate</h3><br/>O combate é algo que você pode fazer com frequência neste jogo, ou pode evitar.<br/><br/>As criaturas do planeta são passivas, agressivas ou reagem agressivamente se atacadas. Matá-las também possibilita extrair materiais de seus corpos, que podem fazer parte de sua produção.<br/><br/>Os chefes podem ser encontrados em áreas ocultas completando missões ou explorando. Eles são projetados para serem um desafio difícil, mas também existe um método pacifista para superar cada chefe através de ações como fazer uma oferenda mais cara ou resolver um quebra-cabeça nos lugares onde habitam.<br/><br/>", "metacritic": null, "released": "2023-06-21", "tba": false, "updated": "2023-12-30T18:02:21", "background_image": "https://media.rawg.io/media/screenshots/edd/eddaff35c105642c41f8b82b6150000b.jpg", "website": "https://novalandsgame.com/", "rating": 4.3, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 20, "beaten": 4, "toplay": 8, "dropped": 2, "playing": 1}, "playtime": 14, "achievements_count": 21, "ratings_count": 10, "suggestions_count": 362, "game_series_count": 0, "reviews_count": 10, "platforms": ["PC"], "developers": ["BEHEMUTT"], "genres": ["Indie"], "publishers": ["HypeTrain Digital"], "esrb_rating": null}