{"id": 962245, "slug": "genting-party", "name": "Genting Party", "name_original": "Genting Party", "description": "This is an eye-catching VR social network game. There are various mini-games and game centers in the social hall. Players can interact with other players in the social hall, and the game center is the aggregation of games. , contains a variety of games that can provide a good gaming experience for a variety of different gameplays. The game includes: friends, chat, avatar, settings, backpack, mall and other systems.<br/><br/>You are a traveler. During your travels, you heard that there is such an island, which is surrounded by clouds and has a pleasant scenery. Life there is carefree, full of peace and tranquility. But this island has another identity, which is the hub of another world.<h3>Central Hall</h3>In the game lobby, you can interact and chat with other players; you can also try the props and mini-games in the lobby; you can also purchase the required props in the lobby to get a different game experience.<br/>Interactive props include: fly swatters, basketballs, darts, bottles, etc.<br/>Small games include: cosmic slingshot, ballooning, hoop, hoop maze, basketball machine, and whack-a-mole.<h3>Transfer area</h3>Through the transfer area, you can transfer to various game areas, such as: Virus War, Zuma.<br/><br/><strong>Virus War</strong>: A casual shooting game, players use bows and arrows to shoot viruses to keep the viruses away from themselves. After the game is successful, they can get a lot of gold coins.<br/><strong>Zombie Cave</strong>: A unique zombie-themed action game, the player will play a survivor and survive in a horror cave full of zombies. There are all kinds of scary monsters and traps in the game, players need to use wisdom and courage to survive.<br/><strong>Zuma</strong>: This is a puzzle elimination game. The panda’s pump in space will generate balloons of different colors, and the balloons of various colors will slide forward along the track. You must prevent the beads from rolling into the hole at the end of the track inside.<h3>home</h3>Players build their own homes on islands in different worlds, where they can arrange their own room decorations.<h3>Avatar</h3>In the Avatar system, players can change the appearance of their characters, including clothing, hairstyles, face shapes, expressions, etc.", "metacritic": null, "released": "2023-06-15", "tba": false, "updated": "2023-06-16T04:31:03", "background_image": "https://media.rawg.io/media/screenshots/691/691eb804158d7b2bb7a16cd0634f6ee5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PolarOwl Studio"], "genres": ["Adventure", "Casual", "Massively Multiplayer"], "publishers": ["PolarOwl Studio"], "esrb_rating": null}