{"id": 962298, "slug": "redline-royale", "name": "Redline Royale", "name_original": "Redline Royale", "description": "You’ve been dropped into a vibrant biome with only one goal – be the last racer to survive. Speed from zone to zone and snag Power-Ups as you work to outlast the onslaught.<br/><br/>A DYNAMIC BATTLE ROYALE RACER<br/><br/>Redline Royale is a multiplayer Battle Royale with up to 20 players online. Fight your way through an engaging environment &amp; online opponents. You better stay sharp as you move from zone to zone with one goal in mind – be the last racer standing. Join the full-throttle fun today!<br/><br/>TEAR THROUGH YOUR OPPONENTS WITH TASTE<br/><br/>Dive into a world of fearless racers with a delicious, destructive arsenal at your disposal. Speed your way into the battle zone and unleash carnage as you dismantle opponents with a variety of Power-Ups – from hot dog rockets to donut mines &amp; even a pizza shield! But you better act quick, your opponents are gunning for them as well.<br/><br/>SHARPEN YOUR SKILLS<br/><br/>Invite your friends, play new opponents online, and eliminate all your rivals to top the leaderboards. Jump into the game and climb your way in the leaderboards and take on the best of the best. Bragging rights never felt so good.<br/><br/>Are you ready to crash and burn your way to victory? Download Redline Royale, the ultimate Battle Royale racer, and earn your reputation today.\u2028<br/><br/>KEY FEATURES<br/>• Build your garage with every match and see your vehicle collection grow<br/>• Unlock new skins for your vehicles &amp; customize your racer to fit your personality<br/>• Experiment with vehicle classes &amp; choose from over 20 different cars to find your perfect ride<br/>• Upgrade your cars and apply perks to overcome your opponents<br/><br/>• Grab the Battle Pass (Star Pass) to equip you with the tools you need to dominate season after season<br/>• Snag Weapons &amp; Power-Ups to attack foes or defend yourself<br/>• Complete Daily Quests to earn in-game rewards<br/><br/>• Complete achievements in-game to earn even more rewards<br/>• High Octane action, collisions, and carnage<br/>• Live Battle Royale multiplayer<br/><br/>Hit the gas and power your way to glory. Welcome to Redline Royale!<br/><br/>TOS Section<br/><br/>CUSTOMER SUPPORT<br/><br/>If you encounter a problem running the game, please contact us at https://vmlyr.helpshift.com/hc/en/3-my-app/contact-us/?p=ios . Be sure to include the device you're using, OS version, and a detailed description of your problem. If we can't fix a purchasing problem we'll give you a refund. But we can't help you if you just leave your problem in a review. <br/><br/>Redline Royale is free-to-play and contains optional in-app purchases.<br/><br/>For more information on advertising, please see our Privacy Policy:<br/>https://redlineroyale.com/npg-digital-privacy-policy", "metacritic": null, "released": "2023-05-15", "tba": false, "updated": "2023-06-16T05:35:49", "background_image": "https://media.rawg.io/media/screenshots/ae1/ae18a34e5bee873f0e70f64fc3a28666_grxoGbp.jpg", "website": "https://redlineroyale.com/npg-digital-privacy-policy/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["National Product Group"], "genres": ["Action", "Racing"], "publishers": ["National Product Group"], "esrb_rating": "Mature"}