{"id": 962216, "slug": "dubium", "name": "DUBIUM", "name_original": "DUBIUM", "description": " Five brave Frontiers hired by the notorious Space Frontier company head off to an unstable space station at an unofficial request from Shadd Enterprise. They need to destruct four Energy Cubes and stop the space station from exploding by any means necessary. Little do they know, there is a Traitor amidst them. Secretly working for an antagonist group called Blamane who are hostile toward Shadd’s plans, the Traitor will stop at nothing to seize the mysterious Keystones scattered throughout the doomed station.. <br/>- from DUBIUM lore <br/><h3>Survive In Space</h3>Survive In Space An incident from an undisclosed terrorist attack has damaged the space station and it is now an unstable area filled with danger. You must restore life support systems, collect oxygen canisters to breathe, repair solar power generators as quickly as possible, and escape before the space station explodes.<h3>You are a Frontier</h3>You are a Frontier Your mission is to search the space station and destruct all the Energy Cubes left over from the restricted space station. During your expedition, you’ll come across valuable Keystones. Don’t forget to collect them, as they have great value and can make you rich!<h3>You are the Traitor</h3>As a Traitor, you secretly work for the Shadd's biggest antagonist group, Blamane, on a mission to collect 10 Keystones and escape before the Frontiers notice you aren’t on their side. The other players are nothing more than mere tools for the success of your mission. Act like an innocent Frontier to gain their trust, then approach them at the right moment to take them down and steal their precious Keystones. Be stealthy or bold – the choice is yours.<h3>Escape from the Space Station</h3>Dying means you get to keep nothing. You must come out alive with Keystones to become rich. In the best-case scenario, you may collaborate on the mission and escape as a team. However, a solo escape is always an option when things are looking grim… Your own survival is the top priority after all.<h3>Trust No One</h3>One of you is bound to be the Traitor. Even after the Traitor dies, there’s always a chance of a fellow Frontier being bought over by Blamane and becoming the new Traitor. Watch your back and trust no one. Trust No One", "metacritic": null, "released": "2023-06-14", "tba": false, "updated": "2023-06-16T03:55:37", "background_image": "https://media.rawg.io/media/screenshots/227/2273d1f7f7541cab3ab785fc3b2fdfda.jpg", "website": "http://www.dubium.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 30}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 290, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MUMO STUDIO"], "genres": ["Action", "Adventure", "Strategy", "Casual", "Indie"], "publishers": ["MUMO STUDIO"], "esrb_rating": null}