{"id": 962398, "slug": "puppetmaster-movie-viewer", "name": "Puppetmaster Movie-Viewer", "name_original": "Puppetmaster Movie-Viewer", "description": "<strong>Puppetmaster - Movie Viewer lets you complete your Puppetmaster collection with previous Episodes!<br/><br/>Please note: this product is interactive only to a minimum, not more. It only serves the purpose that you can enjoy the pre-rendered Episodes as well. This one is for the collectors amongst you 😉</strong><br/><br/>Included:<br/><br/><strong> BONUS MOVIE - Brittany's Joy Ride:</strong><br/>Watch Brittany as she strokes her massive cock while enjoying her favourite dildo deep in her hot ass. She gets more and more excited until she finally releases a huge load of cum!<br/><br/><strong>Sensual Adventures - Episode 1: The Reunion</strong><br/>At the end of Brittany’s Joy Ride, Brittany was startled by something off camera… Turns out it was the sound of someone unexpectedly entering her apartment. When Brittany goes to investigate she finds her ex, Trinity, sitting on the couch looking to make amends. Brittany has had it with Trinity, but Trinity hasn’t forgotten how to get Brittany excited. In Sensual Adventures: Episode 1, The Reunion you’ll enjoy Brittany’s cock getting licked, stroked, and sucked, while her pussy and ass are teased. When the girls can’t take it anymore, Brittany invites Trinity to fuck her ass, which she’s more than happy to oblige. Trinity takes the lead in this episode, taking Brittany to the height of ecstasy before the two finish with a sensational cum shot and anal cream pie. <br/><br/><strong>Sensual Adventures - Episode 2: The Confession</strong><br/>When Brittany’s ex-girlfriend Trinity showed up unannounced, Brittany didn’t plan on fucking her… But now that she has, she’s eager to enjoy having someone around who knows exactly how she likes to fuck. The sparks continue to fly between these former dickgirl lovers, but what will happen when Brittany learns why Trinity is really here? In Sensual Adventures: Episode 2, The Confession, Brittany and Trinity continue their unexpected tryst with four new positions and a mind-blowing creampie + cumshot. Watch these two futanari bombshells suck cock as they 69 on the floor, then later enjoy a rare sight: a futanari girl getting fucked in her pussy! Don’t miss this episode of Puppetmaster’s Sensual Adventures!<br/><br/><strong>Sensual Adventures - Episode 3: The Exhibition</strong><br/>For years, Brittany and Trinity searched for a missing fragment of an ancient Egyptian scroll. The girls believe the relic is a coded map leading to an undiscovered treasure, but without the missing piece, the code cannot be deciphered. When the lost fragment finally turns up as the feature artefact in an upcoming exhibition at the Museum of Cairo, the girls are too impatient to wait for the display to open to the public, so they decide to break in. Before Brittany can translate the inscription, however, the excitement gets the best of them and they end up fucking in the middle of the museum. Puppetmaster’s 3DX Futanari series, Sensual Adventures, continues with Sensual Adventures: Episode 3, The Exhibition! In Episode 3, you’ll enjoy Brittany and Trinity fucking, sucking, and licking one another in new positions and new outfits. Brittany’s pussy, ass, and mouth get penetrated from a number of positions, while Trinity licks pussy, sucks dick, and rides her ex-girlfriend's hard, futa cock. Before it's all over, both girls cum all over one another in two separate cumshot sequences...The museum staff are going to have a lot of cum to clean up after this.<br/><br/><strong>Sensual Adventures - Episode 4: The Expedition</strong><br/>Sensual Adventures: Episode 4, The Expedition marks the conclusion of the first Sensual Adventures story arc. Brittany and Trinity continue their adventure in Egypt, this time journeying to a lost ruin where they discover unexpected pleasure... in the form of an Egyptian princess with an insatiable lust. Do the two futanari girls have enough cum to keep her entertained? Watch and find out!", "metacritic": null, "released": "2023-06-15", "tba": false, "updated": "2023-06-19T02:38:43", "background_image": "https://media.rawg.io/media/screenshots/d66/d665d0058eb16a4f7d2e6fdd3f1e500e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Puppetmaster3dx"], "genres": ["Casual"], "publishers": ["Puppetmaster3dx"], "esrb_rating": null}