{"id": 962340, "slug": "ultimate-mastermind-hd", "name": "Ultimate Mastermind HD", "name_original": "Ultimate Mastermind HD", "description": "Yes, there are lots of free versions of Mastermind in the App Store - but here is why we believe that Ultimate Mastermind HD is worth paying for:<br/><br/>Ultimate Mastermind HD is the universal version of the classic color code-breaking board game that runs on the iPad, iPhone, and iPod Touch.<br/><br/>Ultimate Mastermind HD is completely unlocked and provides Code Sizes of 3 - 8 on the iPhone/iPod Touch and Code Sizes of 3 - 10 on the iPad.<br/><br/>Ultimate Mastermind is designed to provide maximum playability and to let your mind focus on solving the puzzle without annoying palettes that jump in and out of the screen.<br/><br/>Ultimate Mastermind provides the following design elements:<br/>- an innovative floating color palette that is always available right where you need it just above your current guess<br/>- a simple and concise layout so previous guesses are always visible without scrolling<br/>- aesthetically pleasing colors<br/>- no distracting sounds<br/><br/>Ultimate Mastermind supports simple and intuitive gestures such as: <br/>- one tap on the palette to place a peg<br/>- drag and drop from any color peg anywhere to add to your guess<br/>- drag and drop to swap two guess pegs<br/>- drag and poof to remove a guess peg<br/><br/>Ultimate Mastermind also supports very simple but powerful features that let you easily do more complex things such as:<br/>- one tap to move all of a previous guess to your current guess when you only want to make a small change.<br/>- one tap to lock a peg into position when you know that peg is correct.<br/>- one tap to clear your current guess.<br/><br/>And Ultimate Mastermind has increasing levels of difficulty to keep you coming back to play again and again:<br/>- you can increase the size of the code from 3 to 8 pegs (3 to 10 on the iPad) as you become more proficient.<br/>- the number of colors to choose from is increased from 5 to 10 (5 to 12 on the iPad) as the size of the code increases.<br/>- 10,000,000 possible code combinations on the iPhone/iPod Touch (10^8).<br/>- 62,000,000,000 possible code combinations on the iPad (12^10).<br/><br/><br/>An exclusive feature of Ultimate Mastermind is iPhone Replay. You can ask the iPhone to show you the steps it would take to crack the Secret Code you just attempted. This is fascinating to watch and allows you to compare your abilities to a smart computer algorithm. It also allows you to learn new and improved code cracking techniques from the iPhone.<br/><br/>And finally to keep things interesting Ultimate Mastermind keeps the following statistics for each different code size:<br/>- rating - to compare your skill to others<br/>- number of games won and win percentage<br/>- number of games played<br/>- fewest number of guesses to solve<br/>- average number of guesses per game<br/><br/>So if you just have a few minutes to kill or want to enjoy an extended session of brain challenging fun then Ultimate Mastermind is the game for you.", "metacritic": null, "released": "2010-05-13", "tba": false, "updated": "2023-06-16T06:16:40", "background_image": "https://media.rawg.io/media/screenshots/251/251a7ac96f4d00668c2533b1e817df8e.jpg", "website": "http://logicaldeductiongames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Logical Deduction Games"], "genres": ["Board Games", "Puzzle"], "publishers": ["David Neal"], "esrb_rating": "Everyone 10+"}