{"id": 962391, "slug": "oome", "name": "oOme", "name_original": "oOme", "description": "<h3>oOme - An Interstellar Ballet</h3><br/>Discover <strong>oOme</strong>, a unique solo experience that blends arcade and meditation. A game where your concentration is the key to survival, and where every movement triggers the flow of time and the motion of the celestial bodies.<br/><br/>In this interstellar ballet, you are at the center of the Universe. With a simple mouse movement, you control time itself, activating celestial bodies to dance at your rhythm and follow you in a cosmic choreography.<br/><br/>But be careful, each dance is a challenge: you must feed the black hole with the celestial bodies that follow you, while avoiding getting touched by them. Each successful stellar encounter will increase your score, but the slightest mistake could mean your loss.<br/><br/>At the heart of this experience, concentration is paramount. Only true mastery of your movements will allow you to survive in this celestial ballet.<br/><br/>Add to this a soothing soundtrack and hypnotic aesthetic to create a truly immersive gaming experience \"Composition by LYLIAN KLATA\". You will find yourself absorbed by the ebb and flow of the game, as you strive to reach the top of the leaderboard and unlock numerous achievements.<br/><br/><strong>oOme</strong> is not just a game, it's a dance with the stars. So, are you ready to take the reins of the Universe and lead the dance of celestial bodies? Join us in this intergalactic journey and leave your mark among the stars.", "metacritic": null, "released": "2023-06-18", "tba": false, "updated": "2023-06-19T02:29:20", "background_image": "https://media.rawg.io/media/screenshots/2a8/2a885a4b32602df584579bc038c4eee3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tezkatoz Productions"], "genres": ["Indie"], "publishers": ["Tezkatoz Productions"], "esrb_rating": null}