{"id": 962304, "slug": "dr-taxi-driving", "name": "Dr. Taxi Driving", "name_original": "Dr. Taxi Driving", "description": "City taxi driving games 3d is the real cab driving: car simulator games. Experience the city cab driving in crazy car driving simulator: city taxi games. Do you love to drive 3d taxi with realistic city environment in taxi car driving cab games? if yes, then you are in the right place because we specially introduce our modern crazy taxi driving simulator: 3d taxi games for you to enjoy with lot of fun.<br/><br/>City taxi driver car parking simulator games, perform your pick and drop duty with your modern cab within a time limit. A lot of passengers are waiting for you and this city cab driving simulator taxi games give you opportunity to drive yellow cab and pick up these passengers. In City taxi driving car simulator games, as a city taxi driver your job is very tough because you have to perform your duties at night shift especially on drifty tracks.<br/><br/>This cab driving simulator: city taxi games will give you the great experience. Show your car driving skills and passenger of New York city will send you the locations and you can see the detailed maps with cab driving in city taxi games and you can also buy new cars by earning scores in city taxi driver crazy car driving simulator games. Just play modern cab driving simulator car games, complete pick and drop mission, receive passenger message and feel like a city taxi driver.<br/><br/>City Taxi Car Driving<br/><br/>In city taxi driving simulator games experience the life of a crazy city driver in our latest car driving games: city taxi games and completely different types of taxi driving missions as private city taxi driver. Play taxi car driving cab games and drive yellow cab as fast as you can because you have to reach the given location in time. Cab driving simulator taxi games is the most addictive and adventures car games and we hope you can get lot of fun while playing this city cab driving games.<br/><br/>City Car Driving Taxi Game<br/><br/>Modern crazy taxi driving simulator: 3d taxi games here you will get a realistic environment 3d animation, HD graphics, easy and smooth controls of crazy taxi cab driving games. Driving a crazy car in realistic city environments is the final test of your cab driving games skill. This crazy 3d car driving simulator: city taxi games is a kind of new experience made just for you. In taxi driving simulator car parking games as a city taxi driver your responsibility to pick up passengers and drop them off at their given location in cab simulator games.<br/><br/>Taxi Game 3D: City Car Driving<br/><br/>City taxi car driving cab games providing brilliant service and timely pickup will win you amazing rewards. This real car taxi simulator games will help you learn to drive with its various combination of real car driving simulator games and multiplayer taxi simulator games. Crazy taxi driving games &amp; car driving games is one of the adventures games available on the play store.<br/>Don’t waste your time download this crazy 3d car driving: city taxi games get lot of fun.<br/><br/>Crazy Cab Driving Simulator - City Taxi Games Features:<br/><br/>* Realistic city environment<br/>* Interesting pick &amp; drop missions<br/>* 3d animation with cool sound<br/>* Easy and Smooth controls<br/>* Modern 3d taxi collection<br/>* Stunning weather conditions<br/>* Wonderful engine sounds<br/>* Realistic views of streets and buildings", "metacritic": null, "released": "2022-08-31", "tba": false, "updated": "2023-06-16T05:41:41", "background_image": "https://media.rawg.io/media/screenshots/33e/33e3e845a5d048002e211420af276d41_317U3kh.jpg", "website": "https://nibgios.web.app/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tariq Manzoor"], "genres": ["Simulation", "Racing"], "publishers": ["Tariq Manzoor"], "esrb_rating": "Everyone 10+"}