{"id": 962326, "slug": "dungeon-boss-respawned", "name": "Dungeon Boss: Respawned", "name_original": "Dungeon Boss: Respawned", "description": "Available exclusively for Netflix members.<br/><br/>Battle. Explore. Defend. Summon a crew of mighty heroes to guard your dungeons, steal treasure and fight foes. Ready to prove who's boss?<br/><br/>Assemble a team of warriors, goblins and other mighty heroes to embark on an epic adventure across fantasy lands in this turn-based strategy RPG. <br/><br/>Features:<br/><br/>• Explore a fantasy world full of battlegrounds and treachery in your quest to defeat the toughest enemies in the land!<br/>• Call upon warriors, goblins, ninja assassins, majestic knights and enchanted beasts to create the ultimate battle squad.<br/>• Swap out skins and weapons to give your heroes fresh styles and skills.<br/>• Collect heroes and assemble your dream team to guard against epic boss battles!<br/>• Dive into the storylines of your favorite heroes and collect tokens to summon new heroes!<br/>• Boost your battles by summoning a friend’s best hero to help crush your enemies.<br/>• Reap riches in evolving daily quests! <br/>• Earn rare loot and hone your skills in the Tower of Pwnage.<br/>• Learn new strategies by watching replays of PvP dungeon arena battles. <br/>• Band together in Guild play to conquer the biggest of event challenges!<br/><br/>- Developed by Boss Fight, a Netflix Game Studio.", "metacritic": null, "released": "2023-05-31", "tba": false, "updated": "2023-06-16T06:03:23", "background_image": "https://media.rawg.io/media/screenshots/b43/b43387a8780733f6e6fe6bc630acc04b_1VBy0dY.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 386, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Netflix"], "genres": ["Action", "RPG"], "publishers": ["Netflix"], "esrb_rating": "Everyone 10+"}