{"id": 962325, "slug": "stickman-sniper-western-gun", "name": "Stickman sniper: western gun", "name_original": "Stickman sniper: western gun", "description": "Welcome to the Wild West! Immerse in the atmosphere of western shooter games with a variety of weapons: rifles, pistols and other guns you can get your hands on. Incredible survival action shootout against cruel bandits and other dangerous enemies! Load up your gun and get ready to shoot in this exploding action FPS!<br/><br/>Epic western story with the true hero - a brave cowboy gunslinger who protects the Wild West from criminal gangs, roaming bandits and mafia clans. To survive this dangerous environment, you must be one step ahead of your enemy. Challenge most wanted bandits, survive Wild West heat and complete your adventure as a true bounty hunter!<br/><br/>Brigands led by their bosses set out to seize western land. They are cruel and merciless and armed to the teeth with weapons and bullets. Just the Stickman Sniper is able to push them back from his lands. Take the gun and fight! <br/><br/> The game is full of chases, shooting, fights and gunfights. Your weapon is your best friend and the only way to win in a tough fight!  Aim, shoot and hit a target. The gun is the best tool in the fight for justice. You should be a sharpshooter to save your life. FPS in the Wild West! Bang, bang, bang...<br/><br/>Stickman sniper: western gun features:<br/>- Nonstop action FPS with shooting and chases<br/>- Western atmosphere in Wild West setting<br/>- Charismatic hero - a brave cowboy Stickman Sniper<br/>- Variety of weapons: rifles, pistols and other powerful guns<br/>- The simple vital rule - shoot, shoot and shoot<br/>- Immersive sounds effects<br/><br/>Stickman sniper: western gun  - exciting game with cool ragdoll graphics, clear mission and charismatic main character. It’s a new generation mobile shooter which you can play anywhere you like, online or offline - it’s up to you. Explore various locations and be ready to shoot down the bandits! Feel the spirit of the Wild West and come to realise that only you - the brave cowboy - could secure this land even if you need to confront the endless gangs. Sometimes Shooting is the only way to get justice and survive.<br/><br/><br/>Privacy Policy: https://www.gamegears.online/privacy-policy <br/>Terms of Use: https://www.gamegears.online/term-of-use", "metacritic": null, "released": "2023-05-30", "tba": false, "updated": "2023-06-16T06:02:15", "background_image": "https://media.rawg.io/media/screenshots/0c3/0c37e3aad42812868c31c7453f43e9e1.jpg", "website": "https://www.gamegears.online/privacy-policy", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Win Change"], "genres": ["Action", "Casual"], "publishers": ["Winchange"], "esrb_rating": "Teen"}