{"id": 96234, "slug": "this-grand-life-itch", "name": "This Grand Life (itch)", "name_original": "This Grand Life (itch)", "description": "<p><strong>This Grand Life </strong>is a personal finance simulator where you create a character,  manage their money and help them achieve their life goals. Cruise your way through life with a <strong>silver spoon</strong>, or struggle endlessly to find employment as a <strong>convicted felon</strong>. You cannot control your past, but you can change your future. <strong>What choices will you make?</strong><br/>\n</p>\n<p>\r\n\tYou make decisions on where to work, what to study, to invest your money or spend it all getting happy. Pay your bills, take care of your needs and maintain good work performance to achieve your life goals.\r\n</p>\r\nCurrent Features:\r\n<ul>\n<li><strong>Balancing Needs</strong> - Core game loop of balancing short-term needs such as hunger, fun, hygiene and health with long-term goals like happiness, wealth and education.</li>\n<li><strong>Stylised City Maps</strong> - The game map is based on a real major city, thanks to satellite imagery from the European Space Agency!</li>\n<li><strong>Education System</strong> - Study for degrees, diplomas and PHDs, required for some higher level occupations.</li>\n<li><strong>Careers and Employment</strong> - Prestigious career paths like Banking and Chef, plus lower level occupations like Janitor and Salesperson.</li>\n<li><strong>Progressive Taxation System</strong> - The more you earn, the higher your tax bracket.</li>\n<li><strong>Possessions</strong> - Fridges, TVs and Computers which help with your short-term needs.</li><li><strong>Collectibles</strong> - Collect stamps, coins and other rare items to achieve your long-term goals.</li><li><strong>Subscription Services</strong> - Sign up for services that make life easier, like grocery delivery or cable TV.</li>\n<li><strong>Special Events</strong> - Home Robbery, Hotdog Eating Competition, Steam Sales and more.</li><li><strong>Detailed Economic Simulation</strong> - Inflation, interest rates and economic growth influence your investments and job competition.</li>\n<li><strong>Investment and Debt</strong> - Borrow money to achieve your goals or invest for a future where you won't have to work. Minimum repayments and interest rates calculated realistically.</li>\n<li><strong>Real Estate </strong>- Buy properties through an auction system. Live in it yourself or rent out your properties to tenants.</li><li><strong>Stock Market</strong> - Buy and sell shares on the stock market. Watch out for poor corporate management.</li><li><strong>Freelance/Contractor Business </strong>- Hire employees, advertise your brand, complete jobs and grow your reputation.</li><li><strong>Traits/Privilege System</strong> - Begin life with advantages like rich parents, or disadvantages like alcoholism.</li><li><strong>Tutorial</strong> - An interactive tutorial where your mother tells you to get a job.</li></ul>\n<p><strong>DRM-Free version + Steam key included with your purchase!</strong></p>", "metacritic": null, "released": "2017-01-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ae2/ae232d059d515726637559e48de7cc0c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PokingWaterGames"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}