{"id": 96248, "slug": "cocaine-mcbain-a-farm-rush-adventure", "name": "Cocaine McBain - A Farm Rush Adventure", "name_original": "Cocaine McBain - A Farm Rush Adventure", "description": "I did everything myself from scratch except all of the audio! \r\nTLDR; \r\n<ul><li>Farming Sim x Platform Runner</li><li>Farmer takes cocaine to get all her farming done in time for the food truck.</li><li>3 Levels/days. Get all 40 crops and 40 animals.</li><li>Star rating out of 5 at the end.</li><li>If you hit a crate, you get sent back to the start of level one! Yes it’s harsh, sorry!</li><li>If you don’t care about star rating and just focus on avoiding crates it’s much easier.</li></ul>\n\r\nTHEME \r\n<p>For LD41’s theme of combining two incompatible genres, I thought I’d try to make a platform runner x farming simulator.</p>\n<p>Farming sims are usually slow and relaxed and top-down, so I thought it would be funny if the farmer needed to rush around doing their farming in a different game style to the norm. I don’t think I quite got the “farming simulator” part of it clear though, mostly just the platform runner. But hopefully you enjoy it anyway!</p>\n\r\nGAME \r\n<p>You play as Tabitha McBain, who has been too lazy playing videogames and has only 3 days left until she needs to fill the produce truck to sell her goods! While making coffee, she notices next to the sugar a conveniently placed jar of cocaine. She puts it in her coffee instead of sugar to give her the extra “buzz” needed to get all her work done in time!</p>\n\r\nGOAL \r\n<p>This game is super easy if you don’t care about what score you get at the end. You can complete the game to the end without collecting a single item, so long as you don’t hit a crate and get rekt. But…you’ll only get 1/5 stars!</p>\n<p>If you hit a crate - you get sent all the way back to the beginning of level one! Harsh, but I think it makes for a fun challenge. Also this was just easier to code in the short time frame so that I could spend more time on the art!</p>\n<p><em>Can you get 5 stars?? Show me a screencap if you do!</em> </p>\n\r\nTOOLS \r\n<ul><li>Game Maker Studio 2 Pro</li><li>Photoshop CC</li><li>Pyxel Edit</li><li>Coffee (<em>NOT cocaine!</em>)</li></ul>\r\nBUG FIXES \r\n<ul><li>Accidentally deleted one of the crops, resulting in nobody being able to get 5 stars. Oops! FIXED.</li><li>Fixed problem with score not resetting after the game ends.</li><li>Fixed grass parallax issue.</li><li>Fixed jump issue A BIT.</li><li>Quickly added credits to menu, whoops. Forgot those!</li><li>Improved tutorial image to make the controls clearer.</li></ul>\r\nKNOWN ISSUES \r\n<ul><li>I have improved the jump in comparison to when I first submitted (where it was impossibly hard), but it seems to still be very hard and I need to work on my jump physics and timing in the future.</li><li>I am aware that I should have checkpoints for each level instead of going back to day one, but I ran out of time to code this and I think it would be unfair for me to go back in and add this now.</li></ul>\n<p>But thankyou all for the feedback on these issues! </p>\r\n https://www.goattoastergames.com/\r\n <p>https://twitter.com/Goat_Toaster</p>", "metacritic": null, "released": "2018-04-24", "tba": false, "updated": "2019-08-28T23:25:37", "background_image": "https://media.rawg.io/media/screenshots/5c9/5c9f9a0b8270aae18aa9bec132cbe15e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Goat Toaster Games"], "genres": ["Simulation", "Platformer"], "publishers": [], "esrb_rating": null}