{"id": 962460, "slug": "sex-simulator-locker-room", "name": "Sex Simulator - Locker Room", "name_original": "Sex Simulator - Locker Room", "description": "An interactive sex simulation game featuring visual novel elements, high definition graphics and videos, and realistic-looking characters set in a beautiful decor. You play the role of a guy who has to share the locker room with other hot women.<br/><br/><strong>Game description</strong><br/><br/>If you enjoyed our Sex Simulator series, you’ll definitely like this one. <br/>With new girls, fresh stories, and more inciting dialogue, Sex Simulator - Locker Room will turn on your senses and fulfill your dirty fantasies.<br/><br/>This story features a young, attractive man who, due to some strange circumstances, is forced to use the women's locker room instead of the men's.<br/>Things get crazy when the ladies start changing in front of him, and he has to hide the reaction in his pants.<br/>Meet and choose between 3 different women with 3 different personalities.<br/>Make them cum and scream your name in pleasure, so they will ask for a second date!!<br/><br/>Don’t worry if you're not a great talker, we got this part covered for you. <br/>All you need to do is flex those finger muscles to control the sex motion and make the women achieve orgasm before you run out of stamina.<br/>Pick between 3 different types of sex and feel free to swap between the various camera angles we set up for you so that you won’t miss any of the hot details happening on screen.<br/><br/>You didn’t get it right on the first try? Well…it happens to the best of us. <br/>The good part is you can always try again, and again, and again…until everybody’s satisfied. <br/><br/><strong>Features:</strong><br/><br/>90+ HD quality renders<br/>HD animations", "metacritic": null, "released": "2023-06-18", "tba": false, "updated": "2023-06-19T04:02:38", "background_image": "https://media.rawg.io/media/screenshots/a87/a8704efd7c3adb95c2b8040e482b174c.jpg", "website": "http://www.exosyphen.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 1, "achievements_count": 3, "ratings_count": 0, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["EroticGamesClub"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["EroticGamesClub"], "esrb_rating": null}