{"id": 962400, "slug": "senpai-arena", "name": "Senpai Arena", "name_original": "Senpai Arena", "description": "<strong>Welcome to the arena! Create your character and go battle against zombies for a place of honor on the Steam leaderboard!</strong><br/><br/><h3>Create your character!</h3><br/>You can change the color of your skin, eyes, nails, choose clothing to your liking and paint it, as well you can wear a variety of accessories!<br/><br/><h3>Features of the arena</h3><ul><li> - Survive as many waves as possible to make it to the top among friends or other Arena participants!<br/></li><li> - Earn money by damaging zombies. <br/></li><li> - Clear the arena! to clear the route and find new weapons and perks!<br/></li><li> - Buy weapons or try your luck at the \"Senpai Box\". You can buy weapons that are sold in the arena or find the \"Senpai Box\" where legendary weapons may fall out!<br/></li><li> - Listen to music in the arena via the \"Senpai Boombox\". When you power the arena, music will play, this \"Senpai Boombox\" will play. You can change the music if you want, or switch it off altogether. <br/></li><li> - Buy perks to enhance your character. For example perk Dexterity, will give you fast reload and change weapons, as well as you can quickly build up barricade.<br/></li><li> - Use traps in the arena to strengthen your rear. You can, for example, activate a turret in the courtyard or drop logs on a ladder on a zombie's head! </li></ul><br/>", "metacritic": null, "released": "2023-06-16", "tba": false, "updated": "2023-06-19T02:40:58", "background_image": "https://media.rawg.io/media/screenshots/776/776cf3fccd27768ef46948fbbe475d60.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 393, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["boomboxSenpai"], "genres": ["Action"], "publishers": ["boomboxSenpai"], "esrb_rating": null}