{"id": 962410, "slug": "stack-island-survival-card-game", "name": "Stack Island - Survival card game", "name_original": "Stack Island - Survival card game", "description": "After waking on a seemingly deserted Island, you’ll need to piece together the clues to survive and remember what happened. Exploring the island will unlock new recipes and cards, which can be used to craft tools to explore new areas.<h3>Survive The Elements</h3>The most crucial thing in Stack Island is to survive. The island can be a very punishing place. From blistering hot days to dangerous creature-lurking nights, you’ll always need to be one step ahead of the island. <br/><br/><br/>You'll need to manage four main survival elements: health, stamina, condition, and contamination level. Eating off the land, growing your own crops, drinking clean water, and avoiding wildlife are all luxuries on Stack Island. <br/><br/><h3>Survival Card Crafting</h3>Stack Island is full of natural ingredients, materials, and wildlife that can help you survive. Exploring new locations will unlock new recipes for you to craft. From stone knives for cutting and hunting to make-shift hideouts to survive the night. <br/><br/><br/>However, not all items or interactions in Stack Island have a recipe. You’ll need to put on your Bear Grill hat and think outside the box to create some of the tools you’ll need to uncover all the secrets of Stack Island.<br/><br/><h3>Features</h3>-<strong>Over 250 cards</strong> to discover and combine to help you survive<br/>-<strong>Survive the elements</strong> by managing your resources, hunting the wildlife, and discovering new recipes<br/>-<strong>Explore the Island</strong> to uncover new areas and find hidden blueprints<br/>-<strong>Uncover the secrets</strong> of Stack Island. First of all, are you even alone on the island?", "metacritic": null, "released": "2023-06-16", "tba": false, "updated": "2023-06-19T02:53:47", "background_image": "https://media.rawg.io/media/screenshots/bf0/bf0fbf72d2a49c2ee0d4e10cbc008d30.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["interestick"], "genres": ["Adventure", "Strategy", "Simulation", "Indie"], "publishers": ["Interestick"], "esrb_rating": null}