{"id": 962461, "slug": "miwa-the-sacred-fox", "name": "Miwa: The Sacred Fox", "name_original": "Miwa: The Sacred Fox", "description": "<h3>Tarnished Village Kamijima</h3>Miwa: The Sacred Fox is a 2D styled adventure game which takes place in the dark magical Japanese world during Kanaloa festival. Every evening, when the last glimmer of the falling sun fades, night marchers are rising up from the ocean with the sounds of blown conch shell tones and they are  marching in a large groups to the tarnished sacred places of Japan. This time they are marching into your tarnished village. The only thing you remember are the screams of dying people and friends. As one of the few survivors, you decides to sanctify yours village again and you are ready to explore the dark deep caverns, ruins of ancient cities and magical landscapes of Japan with a strange sacred fox called Miwa.<h3> </h3><h3>Game Features &amp; Mechanics</h3><ul><li>Classic 2D platformer game with advanced 2D controls. Double jump, charge, dash and slash your way through the mystical world of Japan. </li></ul><ul><li>Play as two characters with specific mechanics - Shima Nobu &amp; fox Miwa and solve puzzles together to get forward.</li></ul><ul><li>Level up during adventure &amp; trade souls for experiences and upgrade your character with more health orbs </li></ul><ul><li>Over 15 different enemies which you will face through adventure.</li></ul><ul><li>Over 15 different levels with unique mechanics &amp; epilogue and prologue.</li></ul><ul><li>Beautiful hand-drawn landscapes of Japan.</li></ul>", "metacritic": null, "released": "2023-06-18", "tba": false, "updated": "2023-06-19T04:04:46", "background_image": "https://media.rawg.io/media/screenshots/1bd/1bdd250d967511f275e8ed1ab5138810.jpg", "website": "https://bakistudio.webnode.sk/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Baki Studio"], "genres": ["Adventure"], "publishers": ["Baki Studio"], "esrb_rating": null}