{"id": 962448, "slug": "burger-zombies", "name": "Burger Zombies", "name_original": "Burger Zombies", "description": "Step into a thrilling world of chaos and survival in this top-down, free-roaming shooter. Take on the role of a courageous burger delivery man, braving the zombie apocalypse to complete your orders. But this isn't your ordinary delivery gig—this is a fight for survival!<br/><br/>As you navigate through the city streets, your mission is twofold: pick up and deliver orders while fending off an ever-growing horde of ravenous zombies. Strap in for heart-pounding action as you skilfully shoot and drive your way through the relentless undead.<br/><br/>Experience the adrenaline rush as you balance the need for speed with precision marksmanship. Each delivery becomes a high-stakes race against time, where the fate of your customers and your own survival hangs in the balance. Can you keep your cool under pressure and make it through the chaos?<br/><br/><strong>Current features:</strong><br/><br/><strong>Endless Free Roam</strong><br/>Test your survival skills in this mode where you must deliver packages against an ever-growing horde of zombies. See how many deliveries you can complete before becoming their next meal.<br/><br/><strong>Tutorial</strong><br/>Dive into a short but comprehensive tutorial that introduces you to the game mechanics. Learn the ins and outs of burger delivery, combat, and navigation. Master the essential skills needed to navigate the zombie-infested world and increase your chances of survival.<br/><br/><strong>Customize</strong><br/>Express your personal style with a range of customization options. Change colors, swap skins, and select from a variety of hats. Utilize your hard-earned cash to unlock and purchase new customization items, allowing you to stand out in the apocalyptic chaos and showcase your unique character.<br/><br/><br/>Are you up for the challenge? The fate of the burgers—and the world—rests in your hands. Grab your keys, load your weapons, and prepare to take on the undead in \"Burger Zombies\"!", "metacritic": null, "released": "2023-06-17", "tba": false, "updated": "2023-06-19T03:47:42", "background_image": "https://media.rawg.io/media/screenshots/1ce/1ce5cab454fd6fcb23e4ad2adbe3a547.jpg", "website": "https://burgerzombies.netlify.app/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["7 Spoons"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Danger Rat"], "esrb_rating": null}