{"id": 962548, "slug": "shards-of-her", "name": "Shards of Her", "name_original": "Shards of Her", "description": "<strong><h3>Step into a world full of magic and where once the gods reigned supreme, but now hunted and on the brink of oblivion.</h3></strong><br/>Hundreds of years ago, <strong>Michael</strong>, a demigod with a heart full of love, experienced the profound loss of his beloved. She disappeared, leaving no trace behind. Whether she perished or merely vanished remains a mystery. Despite his tireless search, she remained elusive. Eventually, he resigned himself to her absence, though he held her dear in his heart.<br/><br/>But <strong>Michael</strong>'s world was turned upside down when <strong>Hemera</strong>, a once-beautiful goddess with unmatched beauty, cast him out of their sanctuary with a whisper. It was a place where light once thrived but grew dim when she vanished. <strong>Hemera</strong>'s actions stirred something within him, reigniting his quest for answers about her fate...<br/><br/>As he embarks on a new quest for truth, he finds himself caught in the middle of an upcoming war against humans and the remaining gods. Stories tell of a sorceress with the power to manipulate time and bend the gods to her will. <br/><br/>The answer to her disappearance might be somewhere in between...<br/><br/>Experience the first <strong>ACT 1 - Awakening</strong> of <strong>Shards of Her</strong> to find out more, encounter intriguing characters, and navigate the temptations that surround you or avoid it on your path as you seek for answers, it's up to you, but keep in mind that each decision you make, ultimately shapes of the end of your journey. <br/><br/><ul><li> <strong>Single-Player</strong> - Venture on a captivating odyssey where magic intertwines with treachery, desire, and divine intervention. Your choices will shape the very destiny that awaits you.<br/></li><li> <strong>Characters Menu</strong> - Unveil the enigmatic personas that dwell within the realms of the game and find more about them, for with each twilight, new revelations shall emerge.<br/></li><li> <strong>Timeline Frame</strong> - Explore the sacred tapestry of time and behold the monumental events that shaped the world. Delve into the depths of history and tracing the footsteps of heroes and villains alike, as you discover the precise moments when destiny unfolded its grand design.</li></ul><br/>", "metacritic": null, "released": "2023-06-19", "tba": false, "updated": "2023-06-23T03:18:07", "background_image": "https://media.rawg.io/media/screenshots/bd7/bd720bde2efd35e00286b464839e89c0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 498, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Soul Persona"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Soul Persona"], "esrb_rating": null}