{"id": 962568, "slug": "magis-dream", "name": "Magi's Dream", "name_original": "Magi's Dream", "description": "Enter the world of the Magi's Dream, a reverse bullet-hell game where your one goal is to fight and to survive endless waves of enemies!<h3>Features</h3><ul><li>OVER 100 BILLION POSSIBLE UNIQUE LOADOUTS<br/></li><li>5 PLAYABLE CHARACTERS WITH DIVERSE PLAY STYLES<br/></li><li>VARIETY OF CHALLENGING MAPS<br/></li><li>RELENTLESS BOSSES<br/></li><li>MULTIPLE CHALLENGING ENEMY TYPES<br/></li><li>REWARDING LEVELLING SYSTEM TO IMPROVE CHARACTERS<br/></li><li>10 DISTINCT MAGI WITH FAVOUR SYSTEM AND QUESTLINES<br/></li><li>MANA SYSTEM WITH AUTO ATTACKS AND SKILL CASTING<br/></li><li>CHOOSE ITEM UPGRADES AND EVOLUTIONS<br/></li><li>CHALLENGE MODIFIERS<br/></li><li>ENDLESS GAMEPLAY, ENDLESS POSSIBILITIES</li></ul><h3>Gameplay</h3>As you survive, the Magi will sponsor you with powerful new spells, weapons and armours which you can equip to aid you in your battle and help you become the ultimate fighter. Collect gold and upgrade your items at the merchant to get even stronger! Start off with nothing and choose loadouts which can either lead to your demise or take you to victory. Survive, get sponsored, slay the arena bosses and escape the dream (or die trying).<br/>Each wave provides a new set of sponsorships. Choose one sponsor and accept an item they have offered you to build your loadout. Build and replace your loadout as you see fit, catering to any style of play!<h3>Dreamers</h3>With FIVE unique characters to choose from, each with their own playstyle and perks, the choice is yours as to how you fight. Level up your characters by gaining EXP from surviving the endless hordes. Choose sponsorships from TEN unique Magi, each with their own traits. Earn their favour by completing quests for them to help push yourself to victory.<h3>A Crumbling World</h3>Immerse yourself in a rich world. A dream run by powerful Magi, each with their own desires for the shape of the sleeping dimension. Learn more about the dream as you continue fighting through it, and unravel the machinations of the ruthless beings in power.", "metacritic": null, "released": "2023-06-20", "tba": false, "updated": "2023-06-23T03:43:25", "background_image": "https://media.rawg.io/media/screenshots/994/99404eeacfeecc0e67f62b0526e0de72.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Asura Studios"], "genres": ["Action"], "publishers": ["Asura Studios"], "esrb_rating": null}