{"id": 962510, "slug": "run-on-3", "name": "RUN ON", "name_original": "RUN ON", "description": "Supports both single mode and multi mode.<br/><br/>Do not support an automatic save system.<br/><br/>Single Mode: Clear the map by using checkpoint items to avoid various traps.<br/><br/>Multi Mode: Clear the map with friends by using various items.<br/><br/>The goal of this game is for the player to reach the goal while avoiding obstacles. Throughout the game, various obstacles appear, and the player's agility and strategic judgment play a crucial role. The game becomes easier for a limited amount of time whenever you obtain certain randomly generated items. Items provide various functions such as , jetpack, speed-up, etc., enhancing the excitement of the game.<br/><br/><br/>The game offers SINGLE and MULTI Modes for up to 10 players.<br/>In MULTI mode, you can compete with other players and aim for a higher rank. Additionally, the time taken from the starting point to the goal is displayed, allowing for comparison between personal current records and best records. <br/>These competitive elements enhance the game's challenge and enjoyment.<br/><br/><br/>The game's maps can be played at three different levels: EASY, NORMAL, and HARD. This allows players to enjoy the game at a level that matches their skills and gradually become familiar with higher levels. The quantity and pattern of obstacles change according to the level, increasing the game's replay value and providing a sense of achievement for players.<br/><br/><br/>We give players a chance to have fun and face challenges by combining different game modes, items, and levels of difficulty.", "metacritic": null, "released": "2023-06-22", "tba": false, "updated": "2023-06-23T02:29:08", "background_image": "https://media.rawg.io/media/screenshots/086/08646a03348cef9ae7f5d189ae657266.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["511GAMES", "PONY ENT"], "genres": ["Sports", "Massively Multiplayer", "Indie"], "publishers": ["511GAMES", "PONY ENT"], "esrb_rating": null}