{"id": 962571, "slug": "synesthesia-2", "name": "SYNESTHESIA", "name_original": "SYNESTHESIA", "description": "If only those easy, carefree days could have gone on forever...<h3>SETTING &amp; CHARACTERS:</h3><strong>The year is 2029</strong>. Around the world are those awakening to new cognitive abilities, estimated to be about 0.016% of the next generation. The Huntley Scientific Research Institute has opened its doors to these young people to take on as students, to research their gifts and aid them in harnessing their strange abilities.<br/><br/>Ziek is a college level student at the institute. His ability is a unique form of synesthesia, whereby he can detect the significance of objects by splashes of colour that appear in his vision. He seeks to continue his easy and comfortable life alongside his friends, but soon discovers they may be caught up in something much larger than they realise.<h3>A CHARACTER-DRIVEN STORY WITH OCCASIONAL GAMEPLAY ELEMENTS</h3>SYNESTHESIA is character-driven and plot focussed, with occasional interactive elements to immerse you into the journey of the spiral.<br/><h3>FEATURES LIST:</h3><ul><li> A character-driven visual novel, interposed with occasional exploratory point and click / puzzle sections; as you partner to unravel the mysteries.<br/></li><li> Multi-route mystery structure with multiple heroine endings, including one unlockable 'True Route' / 'True Ending'.<br/></li><li> Impacting character moments with psychological / philosophical themes.<br/></li><li> Flowchart that unlocks as you progress, with jumpable tiles for ease of navigating character routes.<br/></li><li> A clean visual style influenced by the simple aesthetics of the classic visual novel era (2000's / early 2010's), all at full HD quality.<br/></li><li> Voiced option that utilises a combination of voice acting and speech synthesis (Full voice with MC unvoiced).<br/></li><li> Features a full tips list with in-game text hyperlinks.<br/></li><li> Fully original soundtrack with 20+ songs from composer 'Caleb Coles'.<br/></li><li> Reading Times: 20+ hours [all endings, methodical read] || 15-20 hours [normal read time] || 10-15 hours [speed reader]</li></ul>Join Ziek and his friends as they hunt down the clues that lead to the end of the vortex in this psychological mystery.<br/> <h3>WILL YOU ESCAPE THE SPIRAL? WISHLIST NOW!</h3>", "metacritic": null, "released": "2023-06-20", "tba": false, "updated": "2023-06-23T03:47:06", "background_image": "https://media.rawg.io/media/screenshots/788/78898159ee804aec0512dc9cb5841108.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 396, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Spire Games"], "genres": ["Adventure"], "publishers": ["Spire Games"], "esrb_rating": null}