{"id": 962596, "slug": "eco-friendly-car-vr-maintenance-training", "name": "Eco-friendly Car VR Maintenance Training", "name_original": "Eco-friendly Car VR Maintenance Training", "description": "It is a self-directed experiential virtual reality technology education and training platform for future eco-friendly vehicle education and training based on HMD (Head-Mounted Display).<br/>\n<br/>\r\nImmersive VR training ensures high voltage isolation and safety against various risks. Cost savings can be achieved by maintaining a low-cost training center.<br/>\n<br/>\r\nEducate and train on understanding and problem solving of complex and diverse automotive structures, and train experienced professionals.<br/>\n<br/>\r\nStart the game and on the main screen, you can click on the subject for car maintenance with your right-handed controller.<br/>\n<br/>\r\nMoving to the learning scene allows the player to move to the left-hand controller as a first-person point of view, and to hold and control car parts with the right-hand controller.<br/>\n<br/>\r\nAfter the instruction of the study precautions, select the tools and put them in the toolbox to start maintaining the car according to the narration. The related objects will be glowing in fluorescent colors to allow you to act like 'holding the handle of the car door open, etc.'<br/>\n<br/>\r\nAfter completing the correct step-by-step action, the parts associated with the next step will glow in fluorescent colors, allowing you to continue learning with narration.", "metacritic": null, "released": "2023-06-21", "tba": false, "updated": "2023-06-23T04:20:52", "background_image": "https://media.rawg.io/media/screenshots/3b9/3b98a754c82e5c4bd07b3a684a70b6ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KIM SUNG DEOK"], "genres": ["Simulation"], "publishers": ["PARK SEOK SOON"], "esrb_rating": null}