{"id": 962570, "slug": "liminal-lands", "name": "Liminal Lands", "name_original": "Liminal Lands", "description": "You are about to enter Liminal Lands - an experience documenting changes to the soil, weather and energies of the Camargue wetlands over the course of a year.<br/><br/>Move through rocks, trees and surfaces, which will open up and react to you. Your movement influences the sounds of the work.<br/><br/>Explore, relax and let yourself be immersed.<br/><br/><strong>Key Features</strong><br/><br/><strong>VR</strong>: Liminal Lands is VR-only. Players physically move through the environment as shapes, textures and sounds respond. You can explore inside and outside of elements.<br/><br/><strong>Perspective</strong>: The viewer begins at human scale, on the salt marshes of Salin de Giraud in Southern France. As players explore the 3D environment, perspectives slowly shift and mutate across plant, animal, and bacterial scales. The artwork meditates on the psychological connection to landscapes.<br/><br/><strong>Sound Design</strong>: The generative sound design responds to players' movements, and combines an artistic soundscape with natural recorded material from the local environment.<br/><br/><strong>Fieldwork</strong>: Every sound, form and texture in Liminal Lands has been digitized from material gathered by artist Jakob Kudsk Steensen during a year of fieldwork in the Camargue region of southern France in 2021.<br/><br/><strong>Ritualistic Experience</strong>: Players can explore morphing elements of the world that are otherwise unexplored, and meditate on the differences in scale between human and geological time as well as the landscape’s biodiversity. The 3D reconstructive technology becomes a sensory tool for a ritualistic environmental experience.<br/><br/>Liminal Lands is one of artist Jakob Kudsk Steensen’s trilogy of immersive works on wetlands and remembering their natural histories. Liminal Lands brings a new, slow sensibility to these otherwise overlooked environments, encouraging players to re-examine their relationship to the ecosystems beneath their feet, and explore the otherwise unseen macro- and microscopic environments of the wetlands.<br/><br/>Liminal Lands was originally commissioned in by the Luma Foundation for the 'Prelude' Exhibition at Luma Arles in 2021. It has been additionally shown at Geneva International Film Festival (2021), the British Film Institute Festival (2021), South by South West (2022), STRP Festival (2023), Doc Aviv (2023), VRHAM (2022), Sonar Festival (2022), Reference Festival x Selfridges (2022) and Strasbourg Festival (2022). The exhibition has shown at Outernet Arts (2023), FMAV Modena (2023), Today Art Museum (2023), SODA Gallery (2022), Nahmad Contemporary (2022), Kornhausforum Bern (2022), and Cube Art Museum (2022).", "metacritic": null, "released": "2023-06-20", "tba": false, "updated": "2023-06-23T03:45:46", "background_image": "https://media.rawg.io/media/screenshots/6e9/6e913a730cf982e7b2ae66fce2cdf0a1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 480, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Erratic Animist"], "genres": ["Casual", "Indie"], "publishers": ["Erratic Animist"], "esrb_rating": null}