{"id": 962502, "slug": "never-meet-your-heroes", "name": "Never Meet Your Heroes", "name_original": "Never Meet Your Heroes", "description": "You are transported to a strange world where men are slaves and biologically weaker than women.<br/>The world is ruled by seven powerful super heroes each with unique powers to help them rule with an iron fist.<br/>With the help of your new found friends you take up the mantle to become the most dangerous vigilante the city has ever seen. <br/><br/><br/><br/><br/>Never Meet Your Heroes is a choice-driven adult RPG.<br/><br/><br/>By day.. explore the large city of Massia solving any problems that may come your way. <br/>Study at the university and take a shot at the slave test to win your freedom or discover deadly secrets that have plagued the city for years.<br/><br/><br/><br/><br/>By night take on the mantle of the city's newest vigilante. Enhanced with a powerful serum which makes your body reach the peak of human capability... you now have a fighting chance against the heroes.<br/><br/><br/><br/><br/>When you aren't raiding criminal bases or taking down evil heroes you can choose to spend your time with many women of your choice. <br/><br/>Be sure to not let them get too close and give away your secret identity, or perhaps you trust them enough to reveal it yourself?<br/><br/><br/><br/>Enjoy hundreds of personal first person animations.<br/><br/>It's time to equip your suit and jump into the new world.", "metacritic": null, "released": "2023-06-22", "tba": false, "updated": "2023-06-23T02:20:34", "background_image": "https://media.rawg.io/media/screenshots/792/792893336a8f4f5e53336853bc012c5b.jpg", "website": "https://twitter.com/cityofnsfw", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 428, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Itk"], "genres": ["Adventure", "RPG", "Casual"], "publishers": ["ITK"], "esrb_rating": null}