{"id": 962520, "slug": "castle-crafter", "name": "Castle Crafter", "name_original": "Castle Crafter", "description": "Get ready for an online epic warfare game in blocks' and cube men's world!<br/><br/>It's a live pocket game that you can battle with real people that you can always carry on with you. Control your pixel hero character in a pixel designed pleasant world environments.<br/><br/>Castle Crafter game will be your best friend in your spare time. Fight against real people as a team or single in well designed castles. Try to defend your castle or conquer enemies' castle with using your weapons like, sword, pickaxe, bow and arrow. Moreover, you can dig tunnels, open secret gates, build bridges and ladders, construct shelters and make shields by using crafted stones, rocks and dirts from real world. You can also bring your insidious plans with scuba diving under water.<br/><br/><br/><br/>Share your tactics with your team friends during the game by using voice chat. The game is optimized for high performance for your best game play experience.<br/><br/>There are 4 game modes in the game:<br/><br/>First game mode is Flag Capture. Players choose a team to themselves. Defenders or Attackers. Regarding to the selected team, players prevent and stop enemies to intrude their castles and fight against attackers to keep their flags in safe. Otherwise attack to the castle and try to capture the flag. Moreover they can use common weapons like Catapult, ballista and fire arrows during the game. If blue team can take the red flag and bring it near blue flag before the time runs out, blue team wins.<br/><br/><br/><br/>Second mode is Team Deathmatch. Player choose a team first at the beginning first. Reds or Blues. The most enemy killer team wins at the en of the time.<br/><br/>Third game mode is Deatchmatch. In this game mode, every player fight for himself only. The most enemy killer player wins the game.<br/><br/>Fourth mode is World Exploration. Players explore battlefields and castles offline. Players are free to play and make strategies in the world as long as they desired. There is no winning or losing in this game mode. There is no any internet connection required in this mode.<br/><br/>In this war game, you are going to struggle to survive against real players for hours without any restraint. You will be witness to the battle and survival techniques in the time of Steve's ancestors with a different game mechanics and graphics from other common craft games.<br/><br/><br/><br/>What are you waiting for? Download and play.<br/><br/>GAME FEATURES:<br/><br/>- 4 different game modes: Capture The Flag, Team Deathmatch, Deatchmatch, Offline World Explore.<br/>- Play with real people<br/>- Voice chat<br/>- 5 different weapons<br/>- 6 different environment and castle<br/>- Simple and Plain interface<br/>- HD graphics and high performance", "metacritic": null, "released": "2023-06-20", "tba": false, "updated": "2023-06-23T02:41:36", "background_image": "https://media.rawg.io/media/screenshots/d80/d80e98b7a42d6e39f859f5cc853ae183.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 374, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Dodisoft"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Dodisoft"], "esrb_rating": null}