{"id": 962686, "slug": "bad-dream-purgatory", "name": "Bad Dream: Purgatory", "name_original": "Bad Dream: Purgatory", "description": "Welcome to the world of Bad Dream, where nothing is as it seems. In the latest addition to the series, Bad Dream: Purgatory, you'll explore a hauntingly surreal landscape filled with unused characters from a cancelled project. These characters are trapped in a state of limbo, suspended in nothingness without any purpose or direction. It's up to you, the player, to decide their fate and give them the meaning they so desperately crave.<br/><br/>Unlike previous Bad Dream games, Purgatory is presented in a 2.5D format with a first-person camera, giving players a more immersive and personal experience. The artstyle is simplistic yet striking, with hand-drawn illustrations that perfectly capture the game's dark and disturbing atmosphere.<br/><br/><br/><br/>As you journey through the purgatory, you'll encounter an array of surreal and creative puzzles. These challenges will test your wits and critical thinking skills, but there's no right or wrong way to solve them. You'll have the freedom to choose your own path and determine the fate of the unused characters.<br/><br/>But be warned: not all choices have a happy ending. Some characters may exist only to suffer and be the victim of your decisions. With alternative paths and multiple endings, your choices will shape the ultimate outcome of the game.<br/><br/>Are you ready to explore the purgatory and uncover the secrets of the unused characters? Play Bad Dream: Purgatory now and give them the purpose they so desperately crave.<br/><br/>", "metacritic": null, "released": "2023-06-23", "tba": false, "updated": "2024-01-06T02:44:04", "background_image": "https://media.rawg.io/media/screenshots/0d7/0d7816d38c8fc82e4562537692580750.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 17, "ratings_count": 1, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Desert Fox"], "genres": ["Adventure", "Indie"], "publishers": ["Desert Fox"], "esrb_rating": null}