{"id": 962695, "slug": "sugarcreek", "name": "Sugarcreek", "name_original": "Sugarcreek", "description": "<strong>Sugarcreek</strong> is a story-based adventure game focused on characters, exploration, and emotion!<br/><br/>You play as <strong>Eddie</strong> - a goat, a high school student, an over-thinker, and a good friend. To the eyes of most, he leads a normal, average life in the small, average town of Sugarcreek. But as he will soon find out, there's a lot more boiling beneath the surface.<br/><br/>In <strong>Sugarcreek</strong>, you'll meet plenty of interesting characters, play minigames based on story moments, participate in turn-based battles, and learn more about Eddie and his friends as they're faced with tough challenges and difficult realizations while navigating their lives as teenagers.<br/><br/><br/><br/><br/><br/>Eddie the goat is a shy and reserved high school senior who's just about ready to graduate, along with his small group of friends: Felix the fox, Darby the cat, and Charlotte the rat. After an eventful and stressful Monday at school, Eddie wakes up the very next day to the realization that his step-sister, Hazel, has gone missing, and nobody has seen or heard from her since the night before. In a panic, Eddie gathers his friends and asks them to join him in a ragtag mission across town to find Hazel. Throughout this search, however, Eddie and his friends might find out that there is more than one person who needs to be saved.<br/><br/><br/><br/><br/><br/>A Lively, Non-Linear World<br/>You can choose where to go, what to do, and when to do it! Explore the town of Sugarcreek, visit unique places to look for Hazel, and discover new aspects of the world and its characters!<br/><br/>Charming, Deep Characters and Stories<br/>There's more than meets the eye when it comes to Sugarcreek's diverse cast of characters! You'll learn about the lives, troubles, and personalities of Sugarcreek's residents, especially Eddie and his friends as they search the town for Eddie's missing step-sister!<br/><br/>Hidden Collectibles and Secrets<br/>Sugarcreek has many secrets and mysteries to uncover! There are collectible cards and coins scattered throughout the world, lost items to obtain and return to their respective owners, hidden conversations to unlock, and more!<br/><br/>Plenty of Replay Value<br/>With six endings to get, Steam Achievements to unlock, collectibles to grab, eight distinct locations to explore, and plenty of extra conversations and content, Sugarcreek is packed with replay value!<br/><br/>", "metacritic": null, "released": "2023-06-22", "tba": false, "updated": "2023-06-26T02:26:59", "background_image": "https://media.rawg.io/media/screenshots/dba/dba4f0c8e617c4312d76d0f9f2fd2f42.jpg", "website": "https://tekkoustudios.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Tekkou Studios"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Tekkou Studios"], "esrb_rating": null}