{"id": 962629, "slug": "i-the-forgotten-one", "name": "I, the Forgotten One", "name_original": "I, the Forgotten One", "description": "The king is dead. The country is wracked by rebellion. And an old comrade from your past has returned to claim the crown for himself.<br/><br/>I, the Forgotten One is a 450,000-word interactive novel by John Louis. It's entirely text-based, without graphics or sound effects, and fueled by the vast, unstoppable power of your imagination.<br/><br/>You are the late king's eldest child and royal bastard. Disinherited and tossed aside, you were sent off as a child to fight in the distant frontier of the kingdom, to die forgotten and unknown.<br/><br/>You, however, survived, and have been shaped into an instrument of war.<br/><br/>With the realm now in turmoil, you have been called upon to once more bloody your blade.<br/><br/>You must restore peace, by any means necessary.<br/><br/>Even as you feel yourself slipping, deeper and deeper into a pit of despair.<br/><br/><ul><li>Play as a man or woman; straight, gay, or aromantic<br/></li><li>Immerse yourself in a world whose perceptions change based on your chosen physicality<br/></li><li>Specialize in three separate aspects of medieval war<br/></li><li>Choose from three different fighting styles which are further influenced by your physical attributes<br/></li><li>Meet a wide cast of characters, from the mother that disowned you to your surrogate father<br/></li><li>Fall down three separate mental paths<br/></li><li>Sustain your relationship with your family, or let it collapse all together<br/></li><li>Experience the brutal realities of war and its consequences on the mind</li></ul><br/>Above all, find purpose and hope, before you shatter for good.", "metacritic": null, "released": "2023-06-22", "tba": false, "updated": "2023-06-23T05:02:27", "background_image": "https://media.rawg.io/media/screenshots/f1d/f1da086d85cda34dcde7c775d5ed5373.jpg", "website": "https://www.choiceofgames.com/user-contributed/i-the-forgotten-one/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Hosted Games"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Hosted Games"], "esrb_rating": null}