{"id": 962682, "slug": "biplane-baron-2-flying-ace", "name": "Biplane Baron 2: Flying Ace", "name_original": "Biplane Baron 2: Flying Ace", "description": "<strong>Biplane Baron 2 : Flying Ace</strong> is a 2D Casual Shoot ’Em Up  Game which brings the player into a World War I atmosphere in the early age of aircrafts used for war. In this game you play as pilot of a biplane fighter, use the WASD key or the keyboard arrow keys for movement and the mouse button for atacks and looping.<br/><br/>Like in other games, the initial stages will be easy and they will get more and more difficult, therefore, calculate carefully, because every bonus icon you catch will add honour and status.<br/><br/>The remainder of our Lives at the end of the stage adds to your rejuvenation status.<br/><br/>The many enemies we kill add points to the Destroy status.<br/><br/>Meanwhile, if we can complete the map before a certain time, your on Time Status will increase.<br/>When these status indicators reach certain values, they will provide permanent game achievements, which of course make our pilots more badass ;-)<br/><h3>Story Mode</h3><br/>You will play one of six of the deadliest fighter pilots in history, starting with Andrew Beauchamp Proctor and of course ending with the legendary Red Baron. Each pilot has three to five maps, each map having different achievement targets. Total maps in the game to complete is 21.<br/><br/>Thus ends the description of this game.<br/>Please enjoy the tense but exciting atmosphere. With small surprises that might trigger your emotions, as well as increase your knowledge about the History of fighter aircrafts during the first world war", "metacritic": null, "released": "2023-06-25", "tba": false, "updated": "2023-06-26T02:10:43", "background_image": "https://media.rawg.io/media/screenshots/ab0/ab090bf60df8818294505c98b0911ea2.jpg", "website": "http://www.crxentertainment.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CRX Entertainment Pte"], "genres": ["Action", "Casual", "Indie"], "publishers": ["CRX Entertainment"], "esrb_rating": null}