{"id": 962697, "slug": "tyrannis-co-prosperity", "name": "Tyrannis: Co-Prosperity", "name_original": "Tyrannis: Co-Prosperity", "description": "Tyrannis: Co-Prosperity shifts the fight of rebels against mercenaries to East Asia, where units of Freelancers fight to weaken the grip of the Security Division of the Kirihara Group. <br/><br/>Outnumbered and outgunned, their greatest strength is guerrilla tactics against the world's largest megacorporation and their allies. <br/><br/>Create your own faction and bring the fight to the corpos... or create your own security force and replace them as top dog in East Asia.<h3>Gameplay</h3><br/>Tyrannis' turn-based strategic gameplay pits armies of overstretched Security Forces against outnumbered Freelancers. <br/><br/>Through asymmetric gameplay, the Security Forces will run Search and Destroy missions to hopefully root out the Freelancers, while the Freelancers work to raid their enemies and liberate the country from the Security Forces' control.<h3>Features</h3><br/><ul><li>40 Unique Maps<br/></li><li>Expanded Custom Faction Creator<br/></li><li>Campaign With 3 Branching Paths<br/></li><li>Earn Loot By Conquering &amp; Raiding Districts Across Asiia<br/></li><li>Campaign and Skirmish Integration </li></ul><h3>Campaign Mode</h3>Create your own character and faction to fight against an army of mercenaries in a roguelike campaign across East Asia. <br/><br/>As you liberate more regions, you can further develop your own faction into a stronger, unique fighting force that can go toe-to-toe against Kirihara's Security Division.<br/><br/>There are 40 maps for you to liberate from corpo control, and the fate of East Asia is in your hands.<br/><br/>Will you burn the world's largest zaibatsu to the ground?<br/><br/>Would you take it over and rule over its corporate empire?<br/><br/>Or will you create a new balance in East Asia?<br/><br/><strong>The choice is yours, Freelancer</strong>", "metacritic": null, "released": "2023-06-22", "tba": false, "updated": "2023-06-26T02:29:09", "background_image": "https://media.rawg.io/media/screenshots/525/52594864a0d128a06bf33baf16e28b58.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["cGh ONE"], "genres": ["Strategy"], "publishers": ["cGh ONE"], "esrb_rating": null}