{"id": 962728, "slug": "nukitashi", "name": "NUKITASHI", "name_original": "NUKITASHI", "description": "A visual novel about a brother and sister who return to an island after losing their parents and confront a huge force that lurks in the sun.<h3>FEATURES</h3><ul><li>2+ hours of story<br/></li><li>Full Japanese voice acting by seasoned professionals</li></ul><h3>SUMMARY</h3>Seiran Island. Even here in paradise, there are those who work in the shadows to bring it down...<br/><br/><br/><br/>United, these misfits stand side by side as the secret society NLNS.<br/>As their founder and head honcho, I, Junnosuke Tachibana,<br/>won’t stop until we’ve crushed this crazy law once and for all!<br/><br/>I’ve even found a benefactor in this crusty old rich guy, name unknown...<br/>He’s hooked us up with a secret base and a buttload of cash already.<br/>In return, he wants us to find someone and “protect her at all costs.”<br/>Apparently, she holds the key to our mission’s success...?<br/><br/>In which case, there’s only one thing to do: locate this mystery girl.<br/>And all while keeping the SHO off our scent, too...<br/><br/>Make no mistake! I’ll stop that law in its tracks, just wait and see!<h3>CHARACTERS</h3><br/><strong>Nanase Katagiri (Voice: Hitomi Yanagi)</strong><br/>The campus’s resident baddie, rumored to be up to constant miscellaneous mischief by the student body at large.<br/>The reality is that she’s still very much a good girl at heart, but uses these rumors to her and Junnosuke’s advantage to get out of unwanted sticky situations.<br/><br/><strong>Hinami Watarai (Voice: Shino Amekawa)</strong><br/>Petite upperclassman who’s actually in her third and final year. Despite appearances,<br/>her short stature belies a big heart and a motherly knack for doting on others.<br/><br/><strong>Asane Tachibana (Voice: Soramame)</strong><br/>Junnosuke’s younger sister and most sympathetic supporter. Although somewhat of a recluse, she has a wild side to her, too.<br/><br/><strong>Junnosuke Tachibana</strong><br/>The game’s protagonist.", "metacritic": null, "released": "2018-10-04", "tba": false, "updated": "2024-04-04T14:35:34", "background_image": "https://media.rawg.io/media/screenshots/59b/59b79d8137bb4fbc9c514afd35c83db6.jpg", "website": "https://shiravune.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Qruppo"], "genres": ["Adventure"], "publishers": ["Shiravune"], "esrb_rating": null}