{"id": 962713, "slug": "the-hunted-witch", "name": "The Hunted Witch", "name_original": "The Hunted Witch", "description": "The Hunted Witch is a flight combat game where you play as a witch who has been found and is being hunted by the US army in the year 2058.<br/>\r\n     The witch is capable of flight, allowing you to quickly move around and to more easily dodge enemy attacks. You also have access to and can unlock a variety of magical spells and upgrades to let you better fight and survive against increasingly dangerous enemy attacks.<br/>\r\nThe enemy is a variety of futuristic military hardware. Swarms of cheap drones that pose little threat on their own, main battle tanks, surface to air platforms, artillery systems, cruise missiles, fighters, attack helicopters, transports, and much more. <br/>\r\n     In addition there are bosses, large enemies with considerable amounts of health, and vast offensive power. All bosses except the first one can potentially one shot the player, so don't take them lightly. To defeat them you'll need to use careful positioning and counter them with the right types of magic, getting your hits in when and where you can. Each boss has it's own unique mechanics and nature you'll need to learn to defeat them. This game can be fairly challenging at some parts, and should not be thought of as a cakewalk, though with full upgrades and all spells most people should manage without too much difficulty given a few tries.<br/>\n<br/>\r\n      There are currently 15 missions in addition to the tutorial, consisting of 9 standard missions, and then 3 missions each for the two paths of the stories ending. Pick your ending by choosing weather or not to kill humans throughout the earlier missions. Eliminating humans may be the easier and quicker option, but you can be sure the generals and others in charge will not look favorably upon that.<br/>\n<br/>\r\n     Overall, this game is a solo development project I've been working on on and off for the past few years, given my love of flight combat games and the relative lack of them these days (especially on PC), I decided to try and make my own. The graphics and everything aren't all they could be, but still up to the task of telling the story and allowing you to get drawn into the combat, that is the core of this game. The game is also fully voiced, though be warned by me as well, so some of the voices will sound a bit... similar, at times. And cheesy.<br/>\r\nIf you want to give it a try, you can get the demo. It contains the first four levels plus tutorial, and after the first two that teach you some basics on psuedo easy mode the fighting finally starts to get a bit more serious on levels 3 and 4, the first boss, and the first real battle. Performance wise, if you do okay with level 4 of the demo, you'll probably be fine for the rest of the game.", "metacritic": null, "released": "2023-06-23", "tba": false, "updated": "2023-06-26T02:49:43", "background_image": "https://media.rawg.io/media/screenshots/b02/b027eeecb0d022b78da536e95bacdf62.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 320, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pineconedemon Studio"], "genres": ["Action", "Indie"], "publishers": ["Pineconedemon Studio"], "esrb_rating": null}