{"id": 962740, "slug": "trauma-squad", "name": "Trauma Squad", "name_original": "Trauma Squad", "description": "\"Join the Trauma Squad and get rid off client's trauma deep inside!\" <br/>\n<br/>\r\nYou will be the junior of the trauma care company. Meeting client's and talk with them, when you find out their trauma, you will get into their mind to release them from trauma! Be careful not to be eaten by the monsters in map. Find the items, and weapons to protect yourself and go forward. Learn the boss pattern and try to make through! There are two stages you can enjoy. Remember, try not make yourself eaten by client's trauma.<br/>\n<br/>\r\nThere are two basic modes in game, which start from office room. In the office room, you may controll your character with third person view, and press F to communicate with your seniors and clients. The answers you chose during the conversation, will affect the attitude of others. After you finish the conversation, the client will automatically move to the machine in your office and move to the real combat stage.<br/>\n<br/>\r\nIn the real combat stage, the game view will turn into top bottom view which help you to recognize enemies location. Before each of the combat part, cinemachine will be activated and reveals the enemies you have to fight with. In order to win against the combat, find the weapons on floor or may dropped by certain enemies. the later weapon you get in stage, the higher damage that weapons have. Not only the weapons, try to get the higher level by getting the reward experience, it may increase player's heatlh points and basic damage. In the real last, there would be a powerful boss in each stage waiting for you. It's the real time you can prove yourself.", "metacritic": null, "released": "2023-06-23", "tba": false, "updated": "2023-06-26T03:25:14", "background_image": "https://media.rawg.io/media/screenshots/17c/17cfb54c518b3a3a812936d5bc845b48.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lee Kangsan", "Kwak Jiho", "Son Yeaen", "Yang Hanji", "Lee Songwook"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["The Generalists"], "esrb_rating": null}