{"id": 962700, "slug": "survival-revelation-end-of-days", "name": "Survival Revelation: End of Days", "name_original": "Survival Revelation: End of Days", "description": "Welcome to the multiplayer Survival sandbox -- Apocalypse of Survival: Day of the End! This is a challenging and creative game where you explore endless natural environments, interact with other players, and build your own world.<br/>\n<br/>\r\nIn the Apocalypse of Survival: The Final Days, you will be dropped on a desert island and you will have to build your own survival base from scratch. From gathering materials and making tools, to hunting and fishing, you need to use natural resources to survive. In the face of danger and difficulty, you need to learn to cooperate with other players and solve problems together.<br/>\n<br/>\r\nIn addition to survival bases, you can build towns, make weapons, explore adventures, and more. In this world, you will have unlimited creativity and freedom, and control your destiny.<br/>\n<br/>\r\nIn addition, there is a rich social element to the game, where you can team up with other players and live together, as well as trade and trade. Different players bring different skills and experiences to the table, and you need to learn to work together to meet the challenges of survival.<br/>\n<br/>\r\nFinally, we update the game regularly to add new gameplay and challenges. Whether you are a new player or an old player, you will find your fun and challenge in Survival Apocalypse: The Day of the End. Join us and start your journey of survival!", "metacritic": null, "released": "2023-06-25", "tba": false, "updated": "2023-06-26T02:32:59", "background_image": "https://media.rawg.io/media/screenshots/e12/e122855dbfb9aaa18395f84c5210261b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["诸葛孔明"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["诸葛孔明"], "esrb_rating": null}