{"id": 962885, "slug": "dinosaur-land-aerial-photograph", "name": "Dinosaur Land Aerial Photograph", "name_original": "Dinosaur Land Aerial Photograph", "description": "This is a very interesting leisure game. In this game, you will manipulate a small drone, walk freely in the dense forest, and come to a primitive dinosaur world. Players can explore various landscapes in the vast forests and contact dinosaurs intimately. Through this small drone, you can observe each dinosaur at close range, and even accompany them to fly in the air.<br/><br/><br/> <br/>The forests in the game have colorful vegetation and animal ecosystems. You can see tall trees and various strange plants. In this world, dinosaurs are aboriginals. You can see a variety of dinosaurs by controlling drones, grass dragons, meat foods, and pterosaurs flying in the sky.<br/>In this game, you only need to use the handle in your hand to control the flight of small drones. You can fly to any place where any dinosaurs are available for better observation.<br/><br/><br/> <br/>In general, this is a very interesting and fascinating game, especially suitable for those who like to explore and adventure. The operation in the game is very simple, and it can be completely immersed in the natural beauty of forests and dinosaurs. If you want to try to observe dinosaurs in the air and explore the fun of virgin forests, this game is definitely worth trying!<br/><br/><br/><br/>Operation method:<br/>Left/right to the left handle to the left/to the right<br/>Flying forward/backward left handle up/downward/downward<br/>Bost up/down the right handle up/downward/downward<br/>Left left handle trigger<br/>Right -right handle trigger<br/>Reset the VR left handle handle<br/>Menu menu key", "metacritic": null, "released": "2023-06-27", "tba": false, "updated": "2023-06-30T04:28:50", "background_image": "https://media.rawg.io/media/screenshots/677/677b26a7ff94bbc18242f62cadefb965.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 301, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rocky Studio"], "genres": ["Adventure", "Simulation", "Casual"], "publishers": ["Rocky Studio"], "esrb_rating": null}