{"id": 962869, "slug": "salty-hounds", "name": "Salty Hounds", "name_original": "Salty Hounds", "description": "<h3>Manage a security agency and romance its handsome bodyguards!</h3><strong>SALTY HOUNDS</strong> is a special kind of dating sim / RPG that respects the player's freedom and just wants to set the stage for your own romantic adventure!<h3>GAMEPLAY</h3>You are the new manager of Salty Hounds, a bodyguard agency in need of new leadership. <br/>Explore the city at your own leisure, pursue a variety of different activities and grow your skills.<br/><br/><br/><br/><br/><br/>Lead the company to success and win the hearts of the many handsome love interests!<br/>Enjoy a dynamic life in a living and breathing open-world city featuring a fully realized night / day cycle.<h3>LOVE INTERESTS</h3>The love interests have their own daily schedule, preferences and secrets that wait to be unraveled.<br/>Go talk to the love interests, hit them up and visit them where they work.<br/><br/><br/><br/>Choose your words and plan your daily schedule carefully to win the hearts of the love interests!<br/>As you make friends with them and gain their trust, you will unlock new events and dynamic dialogues.<br/><br/><br/><br/><h3>VOICED PHONE CALLS &amp; TEXT MESSAGES</h3>From time to time, you will receive text messages and voiced phone calls from your lovers, that start out casual but become more and more intimate over time.  If you're close enough, you can even call them first.<br/><br/>", "metacritic": null, "released": "2023-06-27", "tba": false, "updated": "2023-06-30T04:07:30", "background_image": "https://media.rawg.io/media/screenshots/c60/c60f4580281b6c611b274b2a7a8b1c1a.jpg", "website": "http://saltyhounds.com/en", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Topping Palette"], "genres": ["Adventure", "RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Topping Palette"], "esrb_rating": null}