{"id": 962849, "slug": "other-world-survivors", "name": "Other World Survivors", "name_original": "Other World Survivors", "description": "Surviving in the endless coming monster tide for 15 minutes, you'll be the survivor. Only survivors are eligible to challenge the Dominator of each map, so as to unlock the right to use the powerful Relics, and become the new Dominator of this world.<br/>Each game is a new start. What you need to do is to keep getting stronger by killing monsters and picking up experience gems.<br/><br/><br/>Each game is only a short 12 minutes, does not include the development of external attributes, saves the boring process of collecting resources, and pursues pure happiness.<br/><br/><br/><br/>Each hero has its own background story, and they come from different worlds with their own unique accompanying skills, nirvana and attribute characteristics.<br/><br/><br/><br/>In each upgrade decision, each skill has several upgrade options. You can try different upgrade directions in each round, and finally combine and match the ideal skills in your mind.<br/><br/><br/><br/>In each upgrade decision, each skill has several upgrade options. You can try different upgrade directions in each round, and finally combine and match the ideal skills in your mind.<br/><br/><br/><br/>By matching skills, abilities, and relics reasonably, chain reactions and chemical reactions may be triggered between skills, and a snowball effect can be achieved, waiting for you to discover by yourself.<br/>", "metacritic": null, "released": "2023-06-27", "tba": false, "updated": "2023-06-30T03:41:40", "background_image": "https://media.rawg.io/media/screenshots/741/741af8e7aa395f17339dfbad38dea86c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 299, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rolling Studio"], "genres": ["Action", "RPG", "Casual", "Indie"], "publishers": ["BD Games"], "esrb_rating": null}