{"id": 962870, "slug": "worlds-align-beginning-collectors-edition", "name": "Worlds Align: Beginning Collector's Edition", "name_original": "Worlds Align: Beginning Collector's Edition", "description": "AMAX Interactive presents Worlds Align: Beginning – a groundbreaking new adventure through the worlds of Haunted Legends, Redemption Cemetery, and more!<br/>\n<br/>\r\nWhen the worlds of Haunted Legends, PuppetShow, and others begin to fuse, some familiar faces come together to bring someone from the real world into the game world to help. You! Meet old friends, and even older enemies, face-to-face while you work alongside representatives of several classic series to save their worlds and determine the cause of the calamity that threatens to destroy them all. Can you rescue the game worlds from the brink of destruction and uncover the truth behind their collapse?<br/>\n<br/>\r\nThis is a Hidden Object Puzzle Adventure game, meaning a specific genre of story-driven, point &amp; click adventures. Throughout the game, players are tasked to find a list of objects hidden within a particular scene, and to occasionally complete various mini-games/puzzles.<br/>\n<br/>\r\no\tSave a Watcher's homeworld once more in the Bonus Chapter!<br/>\r\no\tRevisit the hidden corners of multiple game worlds in replayable HOPs and mini-games and earn achievements! <br/>\r\no\tTons of collectible coins and morphing objects to find! <br/>\r\no\tEnjoy exclusive concept art, music, videos, and more! <br/>\r\no\tNever get lost with the strategy guide!", "metacritic": null, "released": "2023-06-27", "tba": false, "updated": "2023-06-30T04:08:55", "background_image": "https://media.rawg.io/media/screenshots/3cd/3cde5ff1b3c10471a267422163d170e0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 607, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Amax"], "genres": ["Adventure", "Casual"], "publishers": ["Big Fish Games"], "esrb_rating": null}