{"id": 962863, "slug": "hide-n-explode", "name": "Hide n' Explode", "name_original": "Hide n' Explode", "description": "Get ready for \"Hide and Explode,\" a multiplayer sensation that will make you question your own intellectual capabilities! Gather your friends for a game of hide-and-seek that even a preschooler could conquer.<br/><br/>In this brainless adventure, seekers showcase their \"remarkable\" intellect by, hold your breath, blowing stuff up. Their grand mission? Turn the battlefield into a fireworks display using the hider's body parts. <br/><br/>Meanwhile, the hiders, who apparently need a clear goal in life: survival, Will desperately attempt to blend in with decoys that are about as convincing as a blindfolded squirrel's detective skills. Every corner reveals the hiders' unparalleled mastery of common sense. Can you sense the overwhelming thrill?<br/><br/>But wait, there's more! As if the painfully obvious decoys weren't enough, you might stumble upon power-ups that could prevent you from face planting into a wall of shame. Fool seekers with the \"Houdini Cloak,\" making them believe you possess the IQ of a jellyfish. Or use a well-timed shield to protect your fragile ego from their feeble attempts to dismantle your alpha mentality.<br/><br/>So, gather your equally bewildered companions, don your dunce caps, and prepare to dive headfirst into the mind-numbing absurdity of \"Hide and Explode.\" It's a game where even the intellectually challenged can feel like rocket scientists, where laughter accompanies your magnificent failures, and where the concept of strategy remains as elusive as deciphering ancient hieroglyphics. Are you ready to embark on this mesmerizing journey of mediocrity? Well, the countdown to your inevitable facepalm begins now!<h3>Features</h3><ul><li> Online Multiplayer<br/></li><li> Public and Private Rooms<br/></li><li> Quick Join<br/></li><li> Integrated Voice Chat</li></ul>", "metacritic": null, "released": "2023-06-29", "tba": false, "updated": "2023-06-30T03:59:11", "background_image": "https://media.rawg.io/media/screenshots/e59/e59ef7d0c3dd4beb6fd277e0c9bf41b0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nate"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Nate"], "esrb_rating": null}