{"id": 962843, "slug": "super-world-run-bosses", "name": "super world run - bosses", "name_original": "super world run - bosses", "description": "<strong>Super World Run - bosses </strong> game one of the best classic old school adventure platformer games inspired by the old Super Mario bros game , will impress you with a brand new and wonderful adventure  that lead you step back in time to your childhood with the legendary mission: Princess Rescue. Joe hero can running and jumping to collect coins and can shoot (flame,laser,bomb and more..) to kill enemies its classic retro adventure platform with 4 worlds many levels ,enemies and bosses ( stunning Graphics | smart Ai ) that perfectly designed to give you the classic arcade games feeling with modern controllers .<h3>Meet Our Angry Unhappy Nervous Enemies </h3><h3>A Hard Monster For Each World </h3><h3>Gameplay/features (quality over quantity) </h3>+  the gameplay is mix of arcade and modern engine/art/music , At the first level you start facing different type of enemies to take a look on the characters (quality and AI)  but don't worry you start also with strong charged weapons ,at the end of level you meet the first boss REBOT (in his robotic room)  that designed and developed to prevent you from escape the level as the next bosses will absolutely do ,they are strong , aggressive and become stronger over levels  like every arcade retro game (the final boss may make your mission even harder by his 3 transformations  ) but you have the Joe Hero armed with powerful weapons and ready to jump high and higher in addition to his stick that can be used all the time ,you also have very smooth controller that help you use all of your skills effectively, but keep eyes on the Countdown-timer that may be one of your enemies if you're not fast enough.<br/><br/>+<strong> 4 Worlds </strong>(wonder land, crazy forest, Egypt world and cave land) - 37 levels <br/>+ <strong>25 Enemies </strong> (attractive characters &amp; special attack for each enemy)  <br/>+<strong>5 Bosses</strong> with :<br/>-Smart Ai.<br/>-Private Arena (the boss battles take place in a dedicated/exclusive area &amp; Unique background music ) ,<br/>-Special Fight Skills (unique abilities and techniques that make the battles more challenging and interesting).<br/>+ <strong>4 powerful weapons</strong> :<br/>-Bullet,Flame,Laser,Bomb<br/>-each weapon designed to affect enemies with different effects (limited supply but can be reloaded or recharged by discovering hidden/destroyable  blocks.<h3>the Joe &amp;Fenrir Story :</h3><br/>In the vibrant kingdom of Lumina, where magic and adventure intertwine, a brave ,agile and black beard hero named Joe embarks on a daring mission. Joe possesses an extraordinary ability to leap to great heights, defying gravity with each bound. Armed with a formidable arsenal of weapons including bullets, bombs, lasers, and flames, he is determined to rescue the beloved Princess Emilia from the Fenrir, the Shapeshifter. (a mythical wolf from Norse mythology, known for his immense strength and cunning. with the a ability of transform into three different forms )<br/><br/>The tale begins as Joe learns of Princess Emilia's tragic fate—captured and imprisoned by the malevolent wolve , Fenrir. Driven by a sense of duty and heroism, Joe sets out on a perilous journey through five treacherous realms teeming with wicked creatures, sinister traps, and formidable guardians.<br/><br/>His first step takes him to the Haunted Forest, where ghostly apparitions and lurking shadows test his agility and courage. Joe nimbly leaps over bottomless pits, utilizing his incredible jumping prowess to evade dangers and reach new heights. Along the way, he encounters fearsome enemies seeking to obstruct his path, but with his trusty weapons, Joe dispatches them with skill and precision.<br/><br/>As Joe ventures deeper into the kingdom, he faces increasingly powerful adversaries. Each realm presents a unique challenge, from the scorching deserts of Inferno Sands to the frozen peaks of Frostbite Mountains. He battles hordes of minions, including vile goblins, deadly mechanical contraptions, and even enchanted creatures corrupted by Lord Malicus' dark magic.<br/><br/>With each triumph over the realm's minions, Joe confronts a mighty boss standing in his way. The first boss is Iron-Boss, an evil robot with immense strength and an arsenal of powerful attacks. Iron-Boss utilizes his powerful hand, laser flames, and bombs to try and overpower Joe, testing his agility and quick thinking.<br/><br/>Moving on, Joe faces the fiery wrath of FireGhost, a humanoid entity made of fire. FireGhost rains down flames upon Joe, shooting fire bullets that Joe must dodge and counter with his own arsenal. The intense battle against FireGhost pushes Joe's limits of agility and precision.<br/><br/>Continuing his quest, Joe encounters the colossal GiantTroll, wielding a massive stave. With each thunderous swing, GiantTroll aims to crush Joe. The hero must leap and dodge the powerful strikes, finding the perfect moments to strike back and topple the mighty GiantTroll.<br/><br/>As Joe ventures deeper into the unknown, he confronts the mysterious AlienGhost, an otherworldly apparition armed with small but deadly missiles. AlienGhost's spectral attacks and evasive maneuvers challenge Joe's reflexes and accuracy. Joe must leap through the ethereal assaults, countering with his own arsenal to defeat this spectral foe.<br/><br/>Finally, the climactic battle arrives as Joe faces the ultimate challenge—Fenrir, the malevolent wolf. Fenrir possesses the ability to transform into three distinct forms, each more formidable than the last. In his first form, Fenrir attacks with incredible speed and aggression, lunging at Joe with fierce attacks. His second form manifests as a mass of writhing tentacles, striking from all directions, testing Joe's reflexes and adaptability. In his final form, Fenrir combines his previous forms' powers, becoming an unstoppable force of nature. Joe must leap, dodge, and unleash his full arsenal to overcome Fenrir's relentless assault and save the princess.<br/><br/>With unwavering determination and his remarkable leaping abilities, Joe triumphs over the five bosses, gaining strength, upgrades, and invaluable experience along the way. The rescue of Princess Emilia draws near as he reaches Lord Malicus' fortress, the epicenter of darkness.<br/><br/>In a climactic battle, Joe's bravery and agile maneuvers prevail<h3> ARE YOU READY !  </h3>Get ready and Join one of the most fascinating adventures ever and even the hard Monsters (especially the last boss) that have 3 transformation we are sure that you have enough time and skills to defeat them all just be smart ,fast and Gamer :D  have fun  !", "metacritic": null, "released": "2023-06-26", "tba": false, "updated": "2023-06-30T03:33:16", "background_image": "https://media.rawg.io/media/screenshots/8f4/8f4af97cf318caeca8441abfe28a47e6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["UNIDEVSTUDIO"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["UNIDEVSTUDIO"], "esrb_rating": "Everyone 10+"}