{"id": 962832, "slug": "mythical-agent", "name": "Mythical Agent", "name_original": "Mythical Agent", "description": "You play as Agent Urassik, a secret agent who was fighting his arch rival, General Lei, when the end of the world occurred. You wake up in Diyu, the realm of the dead, where you meet Lord Yama, the king of hell. He recruits you as the leader of Unit 7, an anti-terrorist organization that fights against demons and other threats in the capital city of Youdu and beyond. You will have to use your skills and tactics to survive and complete your missions. You will also have to manage your team of misfits, each with their own personality and backstory. You can bond with them during free time events, learn more about them, and influence their behavior and loyalty. Your choices will matter and change the game in subtle or major ways. You will also face Lord Zepar, a powerful and mysterious enemy who has a sinister plan for Diyu. Will you be able to stop him and find a way back to the living world? Will you discover the truth behind the apocalypse and your destiny? Will you find love or betrayal in the underworld? The choice is yours in Mythical Agent, the strategy role-playing game that has 12 main endings!<br/><br/>Explore the lives and personalities of your companions. In this game, you fight in a variety of missions that will test your tactical skills and strategic thinking. But the action doesn't end there. After each mission, you can also enjoy some free time with the characters you have met and befriended along the way. You can hang out with them and chat with them. You can learn more about their backgrounds, motivations, secrets, and dreams. You can also influence how they view you and how they behave in future missions. Your choices will also affect how the random NPCs in the game world react to you and your team. Will they respect you, fear you, love you, or hate you? Will they help you, hinder you, or ignore you?<br/><br/>In this game, you are not just a passive observer of a predefined story, but an active participant who can influence and change the course of events. Every decision you make, every dialogue option you choose, every battle you win or lose, every ally you recruit or betray, every item you use or discard, every skill you learn or ignore, every secret you discover or hide, will have an impact on the story, the cast, and the path you follow. You will face realistic and meaningful consequences for your actions, both positive and negative. Some may be immediate and obvious, while others may be delayed and subtle. Some may be minor and personal, while others may be major and global. You will never know what to expect in Mythical Agent, the strategy role-playing game that adapts to your choices!<br/><br/>Mythical Agent is a strategy role-playing game that offers you unparalleled freedom and replayability. In this game, you can choose from nine different main paths, each with their own missions chosen from your actions with Urassik. Everything you do is counted and will impact the story, characters and the world is subtle or massive ways! Each path will lead you to different locations, quests, allies, enemies, and endings. No two playthroughs will be the same in Mythical Agent, the strategy role-playing game that lets you shape your own destiny!<br/><br/>But the missions are not linear or predetermined. They have multiple outcomes, depending on what you choose to do. You can complete the missions in different ways, such as stealth, combat, diplomacy, sabotage, or deception. You can also make moral choices that will affect the lives of the people involved. Your choices will have consequences, both immediate and long-term. They will also impact what options you have in future missions. You may unlock new paths, gain new allies, lose old ones, or face new enemies. You may also change the political and social landscape of the world. Nothing is set in stone. There are 100 Achievements to collect, meaning there are 50-100 hours worth of content. <br/><br/>But with great freedom comes great responsibility. How will you use your freedom? Will you be a hero or a villain? Will you save the world or destroy it? Will you make friends or enemies? Will you follow the rules or break them? The choice is yours: what will you do?", "metacritic": null, "released": "2023-06-26", "tba": false, "updated": "2023-06-30T03:17:38", "background_image": "https://media.rawg.io/media/screenshots/b65/b6553a9708cc77f6c14b13a8514908de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Michael Richard Lannon"], "genres": ["RPG", "Strategy"], "publishers": ["Michael Richard Lannon"], "esrb_rating": null}