{"id": 962882, "slug": "spiritle", "name": "Spiritle", "name_original": "Spiritle", "description": "Spiritle is a 4 players turn-based strategic battle digital board game. You incarnate a Spirit among  the 4 elements: Nature, Earth, Water and Fire. At the rhythm of the 4 seasons, the fallen Souls challenge each other to regain their place in the World Tree.<br/>In this enchanting cross-platform pairing game, open and pair similar lands to Attack and defeat other Players to win the party.<br/><br/><h3>CLASSIC MODE</h3>A 4 players party game mode.<br/>After selection of Spirit and its skills, the 4 players can deploy their characters and move on the board. Open and uncover the tiles. If you pair identical tiles you can attack the other players. However, each Spirits have many unique skills and other way to attack. Pick them and use them skillfully at the right time to counter your opponents' strategies.<h3>COOPERATIVE MODE</h3>A team mode for 2 or single person.<br/>Challenge and outplay your friends in Custom mode. Create a private room and share his code to allow them to join it. Between alliances and betrayals, this mode is a treat to play with friends.<h3>CUSTOM MODE</h3>Play with friends.<br/>Challenge and outplay your friends in Custom mode. Create a private room and share his code to allow them to join it. Between alliances and betrayals, this mode is a treat to play with friends.<h3>4 SEASONS</h3>4 Seasons based on Elements: Nature, Water, Earth and Fire.  Each season, a new World Tree grows with an ability that affect the board and ranked games. Players challenge each other during Events for leaderboard, Golden Nuts and seasonal rewards to customize their Avatars.<br/><br/>", "metacritic": null, "released": "2023-06-27", "tba": false, "updated": "2023-07-24T20:07:49", "background_image": "https://media.rawg.io/media/screenshots/233/233f28f02fe42299ec71d5dc02a02829.jpg", "website": "https://fabledgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Fabled Game"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Fabled Game"], "esrb_rating": null}