{"id": 962880, "slug": "my-neighbors-lonely-wife-2", "name": "My Neighbor's Lonely Wife 2", "name_original": "My Neighbor's Lonely Wife 2", "description": "💟Lonely Wife: Haruka Aoi💟　VA: 森野めぐむ<br/>After moving to a new house, you are quickly greeted by your stunningly beautiful <br/>neighbor: Haruka Aoi. She’s 28, and lives together with her husband of six years. <br/>On top of her graceful beauty, she also has a very charming personality. <br/>However, she doesn’t seem to have any friends here in the neighborhood….<br/><br/>Chat with Haruka and slowly deepen your relationship. <br/>There will be no force, hypnotism, or anything of the sort involved as <br/>you befriend her and seduce your way into her lonely heart.<br/><br/><br/><br/>💟Intimate Caressing💟<br/>Tease, stroke, and fondle Haruka as she whispers sweet nothings into your ears. <br/>Listen to her pant and moan as she succumbs to your charms.<br/>Explore her sexuality and make her yours.<br/><br/><br/><br/>💟Infidelity Album💟<br/>Save the underwear pictures Haruka sends you and keep snapshots of your lovemaking <br/>to view at your convenience.<br/><br/><br/><br/>💟Scenes of Lust, Passion, and Betrayal💟<br/>Enjoy a variety of special H-events on top of all your day-to-day intimacy including:<br/>- Lovingly washing your erection as you shower together!<br/>- Masturbating to each other in an intense video call!<br/>- Meeting up in a public bathroom for a naughty quickie!<br/>- Going wild at a steamy hot springs resort!<br/>- Making love right next to her sleeping husband!<br/>- …and much much more!<br/><br/><br/>*No mosaics in the full game.<br/><br/>💟A Convenient and Customizable System💟<br/>\"- Change Haruka’s outfits to your liking and trigger outfit-specific events! <br/>- Customize details like her wedding ring and pubic hair. (Conditional) <br/>- Specific story routes will even feature a pregnant Haruka! <br/>- Experience an immersive story system with five different endings.<br/>- Your progress is saved automatically. How convenient!\"<br/><br/>", "metacritic": null, "released": "2023-06-27", "tba": false, "updated": "2023-06-30T04:22:44", "background_image": "https://media.rawg.io/media/screenshots/c15/c1514a671377e1587e88fd0f34ae2955.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["やさにき"], "genres": ["Simulation", "Indie"], "publishers": ["Mango Party"], "esrb_rating": null}