{"id": 962859, "slug": "xi-bu-huan-xiang-westfantasy", "name": "西部幻想 WestFantasy", "name_original": "西部幻想 WestFantasy", "description": "Introduction: [/b] [/h2]<br/>Want to experience Pixel RedDead again? In an elevated world called the Western Continent, embark on a fantastic adventure!<br/>let's sand sculpture together, hahaha!<br/><br/>Almost all NPCs can be killed or become comrades to conquer and discover powerful NPCs.<br/><br/>Original cowboy duel system, experiencing the glory of the principle of drawing a gun and the pleasure of instant killing!<br/><br/>Super rich game content: 30+hours of mainline flow, 18 scenes of open world map,<br/><br/>Hundreds of NPCs, dozens of side quests, dozens of puzzle solving+mini games, and multi line endings.<br/><br/>12 distinctive weapons and master skills, flexibly matched and showcased in operation~<br/><br/>Western Fantasy is an abnormal open world pixel sand sculpture RPG game that focuses on \"free exploration\" and \"spiritual confrontation\" in gameplay.<br/>You can choose the clearance method according to your own preferences, including but not limited to: collecting powerful weapons, treasure hunting, dueling, gambling, engaging in intrigues with NPCs, looting, and even card bugs.<br/>After passing through the teaching level, the game will open up the entire western continent for players to explore, and you can choose your own development path.", "metacritic": null, "released": "2023-06-27", "tba": false, "updated": "2023-06-30T03:53:56", "background_image": "https://media.rawg.io/media/screenshots/a33/a339ee12364fe6b781e5f28bc8ecfaf8.jpg", "website": "https://space.bilibili.com/34580335", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CHEN HONG SHU"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["SiriusStudio"], "esrb_rating": null}