{"id": 962923, "slug": "displaced-defense", "name": "Displaced Defense", "name_original": "Displaced Defense", "description": "Thank you for coming to my page! My name is Austin and I solely developed this game. I hope to improve my skills and make better games.  I appreciate you giving my game interest!<br/>\n<br/>\r\nDisplaced Defense is a traditional, open-world, turn-based RPG. The combat is not meant to be easy and sometimes normal enemies may seem challenging. Use your strategy of enemy weaknesses, classes, and skills to get back home!<br/>\n<br/>\r\nFeatures:<br/>\n<br/>\r\n12 Classes and Multiclassing: All classes are available at the beginning of the game. Your character will change appearance based on your primary class. Equip <br/>\r\n a secondary class to gain stats and access to their skills!<br/>\n<br/>\r\nA combination of leveling up and battles will gain you resources to purchase skills in any order you choose. Build your characters to withstand the hard battles <br/>\r\n ahead!<br/>\n<br/>\r\nOpen World: The enemies scale with your level and you are free to explore the world to find the story of this new land. <br/>\n<br/>\r\nCrafting: There is no one waiting to sell you gear here! Materials will drop off enemies that you can use to craft equipmen**t. The materials scale depending on party level. There is a vendor in the Beginner’s Hall to purchase older materials in case you out level them!<br/>\n<br/>\r\nGood luck to you and thank you for exploring my world!", "metacritic": null, "released": "2023-06-29", "tba": false, "updated": "2023-06-30T05:16:31", "background_image": "https://media.rawg.io/media/screenshots/271/271ca6901d4817ae6c7fee0a92bdd36e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Austin Middleton"], "genres": ["RPG"], "publishers": ["Austiny Studios"], "esrb_rating": null}