{"id": 962944, "slug": "attack-of-the-petscii-robots-dos", "name": "Attack of the PETSCII Robots (DOS)", "name_original": "Attack of the PETSCII Robots (DOS)", "description": "<h3>HOW TO PLAY</h3>Your goal is to infiltrate these settlements and destroy all of the robots. To do this, you’ll need to locate weapons and other tools.<br/><br/><br/><br/><br/><strong>Brains or Brawns?</strong><br/><br/><br/>At first glance, Attack of the PETSCII Robots might look like an action shooter game.<br/>However, it’s really not. Think of it more of a strategy and exploration game. While you<br/>are given weapons to fight with, you will never win if you try to fight the robots head<br/>on in battle. The way to victory is by examining each robot situation as a strategy.<br/>In most cases there will be a way to defeat every robot without engaging with them<br/>in a head on battle. The trick is finding all of the right tools, and learning how<br/>to use them.<br/><br/><strong>When can you exit the level?</strong><br/><br/><br/><br/>There is a transporter room in every settlement.<br/>However, to prevent unauthorized robots from leaving the settlements, the<br/>transporter systems have been remotely programmed not to activate until<br/>all robots have been destroyed. Once you have destroyed all robots, you will see the<br/>transporter pad activate, then you can step onto it to complete the level.<h3>USING THE MAP</h3><br/>Activating the map is handy not only to see where you are, but to find the remaining<br/>robots.<br/><br/><br/><br/><br/><strong>Things to know about the map:</strong><br/><ul><li>Activate map by pressing TAB on the keyboard or using the Gamepad.<br/></li><li>When using the gamepad, it toggles between Playfield, Map with Player, and Map with Robots.<br/></li><li>SHIFT-TAB will toggle between flashing the player or flashing the remaining robots.<br/></li><li>You can still walk around and do things while the map is on screen.</li></ul>", "metacritic": null, "released": "2023-06-29", "tba": false, "updated": "2023-06-30T05:37:59", "background_image": "https://media.rawg.io/media/screenshots/669/669945c438e0f175ffffb524e21a2376.jpg", "website": "https://www.the8bitguy.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["8-Bit Productions"], "genres": ["Strategy"], "publishers": ["NMSE & Co"], "esrb_rating": null}