{"id": 96299, "slug": "lost-girls-diary-itch", "name": "Lost girl`s [diary] (itch)", "name_original": "Lost girl`s [diary] (itch)", "description": "<p>Cinematic visual novel «Lost girl's diary»</p><p><strong>Description</strong></p><p>In a snowed hotel, far-far away from city hustle, a group of girls are having their vocation, alone. What would a group of girls do on a dark Christmas night? Of course, fortunetelling! Unfortunately for them, their boyfriends are not about to leave them alone and their sudden visit totally ruins their plans for fortune telling, turning it into a scary story contest.</p><p>Genre: </p><p>Horror. These stories could only scare children.</p><p>Playthrough time: About an hour</p><p>Characters:</p><p>Sasha.</p><p>A group leader, a beauty and a real sweetheart. Her responsibility and care about others, especially about Nastya, distinguishes her among the others. She lost her little sister in an accident several years ago, which significantly shaped Sasha's life.</p><p>Vera:</p><p>A tough gal. She is never slow of resorting to violence with her fists or her words. Playing sports and doing sambo, including Stas and Styopa. Despite first impressions, Vera has a big heart. Secretly in love with Stas, which is not a hard thing to notice for anyone except Stas himself.</p><p>Olya:</p><p>A bookworm, a loner and extremely knowledgeable girl. Despite the outward dominance and snobbish manners, she enjoys spending her time among people. Her secret passion is writing poems about philosophical matters, such as life and death, human relationships, etc.</p><p>Lisa:</p><p> She just joined the group not long ago, and still feels a little uncomfortable. Nevertheless, the attention, her appearance attracts, disguises this little flaw of hers. It takes a lot to make her shut her mouth.</p><p>Nastya:</p><p>The youngest of the girls. Eleonora Andreevna's daughter. She loves sugar, scary stories and Sasha.</p><p>Stas:</p><p>Don't let his fancy eyeglasses confuse you; this pal is not a geek at all. To books and studies, Stas prefers attending sport classes, the same ones Styopa and Vera do. He is a rather active young man, never used to hold his opinion back. However, in the presence of opposite gender he quickly loses his mind.</p><p>Styopa:</p><p>Quite and calm Styopa, unlike Stas, avoids loud parties. But if you are looking for a reliable and willful friend, then Styopa is the guy you need. He hangs out with Stas because \"you never get bored with him\".</p><p>Eleonora Andreevna:</p><p>A teacher and the leader of the girls' group. Nastya's mother. Enjoys making fun of her students. Her summer work as a camp leader was one of the most terrible experiences she has ever had.<br/></p>", "metacritic": null, "released": "2016-03-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b3e/b3e7519e5c8cf030272ff64f8211e159.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["SmoleVN"], "genres": [], "publishers": [], "esrb_rating": null}