{"id": 962943, "slug": "magicshop2", "name": "MagicShop2", "name_original": "MagicShop2", "description": "An 18+ game that features a unique combat system mixed with adult activity that is never before seen in any other game.<br/><br/>Magic Shop 2 builds upon the success of its predecessor with even more intriguing characters and a deeper storyline. As you journey through the magical realm, you'll encounter mystical creatures that will test your magical abilities and navigate the challenges ahead.<br/><br/>In Magic Shop 2, the focus is on mastering magical spells rather than relying on weapons. You'll have a variety of spells at your disposal, each with its own unique properties and effects. You'll need to strategize carefully and choose the right spells to use in each situation to overcome obstacles and progress through the game.<br/><br/>With your own skill and determination, you'll learn to harness your magical abilities and unravel the mysteries of the magical world.<br/><br/>So why not enter the sensual world of Magic Shop 2 today and explore a truly unique gaming experience? With mature themes and challenges, this 18+ game will push your skills and your senses to the limit. Whether you're a veteran of the series or a curious newcomer, now is the perfect time to embark on this magical journey and discover all the pleasures and mysteries it has to offer.<h3>FEATURES</h3><ul><li>Fully Animated.<br/></li><li>Various Mini-games.<br/></li><li>A Huge Variety Of Characters.<br/></li><li>Rich Character Customization.</li></ul>", "metacritic": null, "released": "2023-06-29", "tba": false, "updated": "2023-06-30T05:36:46", "background_image": "https://media.rawg.io/media/screenshots/71e/71e098f83461709ab9732ca9b3b2adb6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 380, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FireArmGames"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["FireArmGames"], "esrb_rating": null}