{"id": 962945, "slug": "quizfizz", "name": "QuizFizz", "name_original": "QuizFizz", "description": "QuizFizz is an entertaining game designed to help you get to know the people around you better. With over 195 carefully selected questions and dilemmas, the game offers you interesting questions on various topics. You and your friends can participate by answering these questions prepared by the game itself.<br/>\n<br/>\r\nOnce everyone has answered, the responses are available in real time, allowing you to see the thoughts of other players. Discover their opinions, preferences, and experiences, and enjoy lively and stimulating discussions. But that's not all!<br/>\n<br/>\r\nQuizFizz also offers a built-in chat system that allows you to converse with your friends about the answers. You can engage in exciting conversations, share your perspectives, and deepen mutual understanding. The chat system facilitates dynamic exchanges and allows you to create even stronger connections with other players.<br/>\n<br/>\r\nAdditionally, you can add friends in the game and see the percentage of shared answers you have with them. This provides you with a unique perspective on the similarities and differences between your preferences and those of your friends, further strengthening your bonds and mutual understanding.<br/>\n<br/>\r\nGet ready for moments of laughter, reflection, and deeper connections in this new and exciting experience! Whether you want to learn more about your loved ones or form connections with new people, QuizFizz is here to help you discover the multiple facets of those around you.", "metacritic": null, "released": "2023-06-29", "tba": false, "updated": "2023-06-30T05:38:45", "background_image": "https://media.rawg.io/media/screenshots/cd3/cd38b10c6cadeedeba3e30fabe79d6ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["O.T Development"], "genres": ["Casual", "Indie"], "publishers": ["O.T Development"], "esrb_rating": null}