{"id": 962996, "slug": "infinitum-vitas", "name": "Infinitum Vitas", "name_original": "Infinitum Vitas", "description": "In the land of <strong>Solace</strong>, a legend tells of powerful individuals known as the \"Soul Bound\". Able to perform feats no mortal man or woman could achieve they existed thousands of years ago, developed technology of remarkable and magical ability, and in the blink of an eye in the Decimation they were gone.<br/><br/>You'll start the game and fairly quickly become Soul Bound, as you traverse the world new abilities and technology come to life as your powers manifest and your destiny unfolds.<br/><br/>Solve the riddle of the Decimation, bring peace or destruction!<br/><br/>Infinitum Vitas is primarily a SINGLEPLAYER ACTION RPG with optional MULTIPLAYER aspects, you can invite people to participate in your instance of the game and they can tag along with you for multiplayer experience, you can interact with all other players at shared areas such as TOWNS or you can choose to play the game in it's entirety as a SINGLE PLAYER game with <strong>60 to 100 hours</strong> of content.<br/><br/><strong>Exploring Solace</strong><br/>Travel over 150 unique and diverse maps as you travel between Town and other exotic locations, completing quests, exploring the world and having fun.<br/><br/><br/><strong>Items and Loot</strong><br/>Kill monsters to gain loot, gather resources, craft items or complete quests to obtain items!<br/><br/><br/><strong>Bosses and Monsters</strong><br/>You'll encounter a whole array of monsters, varied spawning systems and of course mean looking bosses.<br/><br/><br/><strong>Pets</strong><br/>Unlock various pets, some are merely for looks while others have unique tasks to perform.<br/><br/><br/><strong>Skill Points</strong><br/>You'll earn skill points as you level up and use those to unlock new combat abilities, powers, skills and crafting plans (if you decide to craft items).<br/><br/><br/><strong>Features</strong><br/><ul><li>Level 1 to 100</li><li>Deep Lore and Well Crafted Story and World</li><li>Combat, using weapons and/or Magic</li><li>Diverse and Rich Monsters</li><li>Reactive and Passive Pets</li><li>Player Housing</li><li>Many Dungeons, Cities and other places to explore</li><li>Crafting</li><li>Resource Gathering</li><li>Ventures (our take on Guilds)</li><li>Private Instances or Multiplayer Experience</li><li>Realtime Gameplay</li><li>Vehicles</li><li>Hundreds of hours of content</li></ul><br/><strong>Playable Races </strong><br/><ul><li>Solacian (Human)</li><li>Furkin</li><li>Trog</li><li>Remnant</li></ul><br/>Additional ways are available in game to change your appearance further.", "metacritic": null, "released": "2023-07-01", "tba": false, "updated": "2023-07-03T02:14:19", "background_image": "https://media.rawg.io/media/screenshots/a62/a6247987b1404d5deb06be197db394d1.jpg", "website": "https://infinitumvitas.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 377, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Regal Computer Services"], "genres": ["Action", "RPG", "Massively Multiplayer", "Indie"], "publishers": ["Regal Computer Services"], "esrb_rating": null}