{"id": 963029, "slug": "secret-summoner", "name": "Secret Summoner", "name_original": "Secret Summoner", "description": "<strong>- Story -</strong><br/>Little Hero has set out on a journey to teach misbehaving monsters a lesson. Worried for his safety, his mother and trusty canine secretly tag along. But can Little Hero and his clandestine companions truly restore peace to their land? An adventure of mother and child⁠—and pooch⁠—begins...<br/><br/><br/><br/><strong>- Overview -</strong><br/>・Play Time per Stage: approx. 5-20 minutes<br/>・Time to Complete Game: approx. 15 hours\"<br/><br/><strong>- Who Will Enjoy This Game - </strong><br/>・Those who enjoy thought-intensive strategy<br/><br/><strong>- How to Play -</strong><br/>Various monsters stand in the way, but Little Hero is much too young to handle them all himself. Support him in being victorious by first weakening the monsters with your summoning powers. Little Hero will gain Confidence to defeat more monsters and grow stronger. Help Little Hero increase his level and prepare for the final boss showdown!\"<br/><br/><strong>- System -</strong><br/>◆Partnership Chance<br/>This event increases your chances of landing a contract with a defeated boss, with any remaining HP increasing your chance of success. Here's your opportunity to twist boss monsters' arms into signing away!<br/><br/>◆Contract System<br/>When luck is on your side, you'll get a chance to offer a contract to the monsters that Little Hero defeats at the end of the stage. Monsters who sign can be set in the Grimoire, allowing you to summon them. You'll be able to handle monsters more easily the more contracts you land.<br/><br/>◆Confidence System<br/>Little Hero has a Confidence parameter that increases when he defeats enemies and that amplifies XP. Gain more Confidence to increase the speed at which you level up. The amount of Confidence you earn will depend on how you defeat enemies, so try to gain the most whenever you get the chance.<br/><br/>◆Digest Attack<br/>An offensive method that can be activated when the gauge on the upper right of the screen is full. If you defeat the enemy, you'll earn Confidence according to how many combos you get. When activated, however, you cannot summon or use items to provide support, so be sure to weaken the enemy first to get combos.", "metacritic": null, "released": "2023-07-02", "tba": false, "updated": "2023-07-03T02:52:58", "background_image": "https://media.rawg.io/media/screenshots/032/032252b308bb2e9f4658faa7253e271a.jpg", "website": "https://www.wakuwakugames.com/secretsummoner", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jiro's App"], "genres": ["Strategy", "Indie"], "publishers": ["Waku Waku Games"], "esrb_rating": null}