{"id": 963096, "slug": "trepang2-demo", "name": "Trepang2 Demo", "name_original": "Trepang2 Demo", "description": "The full version of Trepang2 is available on GOG.COM. You can purchase it here\n<br/><br/>\nBE THE ULTIMATE BADASS\n<br/>\n\nYou play as an escaped soldier, who has no memories of their past life, but is infused with supernatural abilities. Revenge is on your mind, and you’ll stop at nothing to get what you want. Deliver devastating punches, sneak around in the shadows, wield explosive weapons, and give the bad guys a taste of their own medicine.\n<br/>\n\nFEATURES:\nEXPLOSIVE SINGLE-PLAYER STORY CAMPAIGN\n\n  \n<br/>\nA mysterious group breaks you out from a heavily guarded blacksite. Your memories are gone but your combat abilities are enhanced far beyond human limits. Fight back, find the truth and face a threat even deadlier than yourself.\nNEXT LEVEL SUPER-POWERS\n\n  \n<br/>\nMaster your superhuman strength and speed to knock waves of heavily armed mercenaries into next week. Slow down time to dodge rapid-fire bullets and use cloaking to become invisible and snap your enemies' necks when they least expect it.\n<br/>\n<br/>\n\n  \nBRUTAL MELEE COMBAT\n\n  \n<br/>\nSquare up to your enemies in close quarters melee combat and go full throttle in rapid fire gunfights. Punch, kick, slide and deliver hardcore combos that reduce your foes to dust.END NOTEFollow, join the community and chat with the devs. Join our Twitter, Youtube and Discord. We're always listening!", "metacritic": null, "released": "2023-06-20", "tba": false, "updated": "2023-07-07T02:01:14", "background_image": "https://media.rawg.io/media/screenshots/221/221a47c0d77a693e5f7f600ab977465e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 5}, "playtime": 0, "achievements_count": 1, "ratings_count": 0, "suggestions_count": 576, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Trepang Studios"], "genres": [], "publishers": ["Team17 Digital"], "esrb_rating": null}