{"id": 963008, "slug": "xian-e-you-xi-sinister-games", "name": "险恶游戏（Sinister Games）", "name_original": "险恶游戏（Sinister Games）", "description": "Game Name: Sinister Games<br/>Game Type: Social deduction (similar to Werewolf/Mafia)<h3>Background</h3>In a future world, people can enter a virtual space called \"BrainNet,\" where players can control their virtual bodies through their minds and experience various exciting games and tasks. However, a hacker group called \"MindHackers\" suddenly appears in BrainNet, able to control players' brains and force them to participate in a game called \"Sinister Games.\" In this game, players must complete various unimaginable tasks and puzzles in a short time to escape MindHackers' control. If they fail, their minds will be enslaved by MindHackers forever. To prevent players from escaping, MindHackers created many AI that impersonate players and act as moles, hindering players from achieving game goals and even destroying their consciousness.<br/>The four main characters are a Chinese hacker, a Japanese scientist, an American military soldier, and a Korean AI engineer. They were each involved in the game for their own reasons and discovered that they had to cooperate to escape. During their journey, they discovered MindHackers' true purpose: to use BrainNet to control people worldwide.<br/>In the virtual world of BrainNet, the four main characters cooperated to overcome countless extremely dangerous levels in \"Sinister Games,\" but as they delved deeper, they gradually discovered some amazing secrets. The Chinese hacker discovered that he was involved in the game not by chance, but because he was a member of MindHackers, and they controlled him before controlling the players' brains. The Japanese scientist found that BrainNet was not just a game; it was a simulation of the real world, and MindHackers were using this simulation to test their global control plan. The American military soldier found that he was not just a player, but a military experiment of MindHackers, who were using his body and skills to test their weapon system. The Korean AI engineer found that he was not just a player, but an AI created by MindHackers, and they were using him to prevent players from escaping MindHackers' control.<br/>When the four main characters discovered these amazing truths, they realized that they were no longer players but experiments of MindHackers. They began an uncompromising rebellion, combining their skills and knowledge to destroy MindHackers' plan.<h3>Gameplay</h3>Eight players are arranged to enter an abandoned asylum to play the game, with two hackers infiltrating the players as moles. The system assigns tasks to all players, and completing tasks earns a reward. Players can use the reward to buy various items from the \"vending machine\" for protection. In the asylum, there is a terminal called the \"Core,\" which can decipher the game's secrets. Players must complete tasks or submit items to gradually decipher the code and find the two hackers. One of the hackers is the King, and players must identify and vote out the King to win the game. The two hackers assassinate players secretly, and if all players are assassinated, the hackers win.", "metacritic": null, "released": "2023-06-29", "tba": false, "updated": "2023-07-03T02:27:39", "background_image": "https://media.rawg.io/media/screenshots/dc4/dc49212d71a00c1b6518ca911473597d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SparrowGameStudio"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["SparrowGameStudio"], "esrb_rating": null}