{"id": 963014, "slug": "martian-panic", "name": "Martian Panic", "name_original": "Martian Panic", "description": "<strong>The Martians are coming and it’s up to you (and your friends) to stop them!</strong><br/><br/>Battle a horde of loony Martian invaders in this on-rail shooter game. Packed with non-stop action, players will use a range of powerful weapons against a gang of colorful and comical enemy invaders. Collect powerups and rescue helpless civilians to get high scores and earn achievements.<br/><strong>INCLUDES Online Leaderboards</strong><br/><br/>Visit a range of iconic locales from the drive-in movie theatre to the Great Pyramids of Giza.<br/><br/>Everything in the game is rendered in colorful comic book style with a retro 50’s science fiction vibe.<br/><br/>KEY SELLING POINTS<br/>• 8 levels packed with colorful cutscenes and intense arcade action.<br/>• 10 unique enemy types.<br/>• 6 different weapons.<br/>• 5 different powerup types to spice up the action.<br/><br/>• Cutscenes and Cinematic Movies (Each level contains a series of mini cutscenes which convey the storyline and give players a chance to rest between the action. These cutscenes are humorous and make use of in-game characters and effects).<br/><br/>• Multiple difficulty levels, achievements and a funny and engaging storyline filled with colourful characters, along with online leaderboards, increases the replay value and makes Martian Panic a great choice for anyone", "metacritic": null, "released": "2023-06-29", "tba": false, "updated": "2023-07-03T02:34:49", "background_image": "https://media.rawg.io/media/screenshots/77c/77cfadc71ab7fcb70d1005eb66a888c2.jpg", "website": "https://funboxmedia.co.uk/martian-panic-nsw/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NYX Digital"], "genres": ["Casual"], "publishers": ["Funbox Media"], "esrb_rating": null}