{"id": 963030, "slug": "strashno-i-tochka", "name": "СТРАШНО И ТОЧКА", "name_original": "СТРАШНО И ТОЧКА", "description": "<strong>Story:</strong><br/>You are the lucky resident of a five-story panel house located on the very outskirts of the town. One gray evening, a feeling of hunger has forced you to leave your cozy one-room apartment and walk to the nearest grocery store. However, it seems that the store closed early today for some reason… What a good thing that the new diner that recently opened near your house is open 24 hours a day…<br/><br/><br/><br/><strong>Gameplay:</strong><br/>This is a classic first person horror game. The main thing you will be doing in this game is exploring the location, looking for items needed for the passage. But you need to be careful, because you are not the only one, who wanders among the rusty garages and shabby panel houses in this dark night… If you hear eerie, heartbreaking laughter or see flickering red eyes somewhere in the darkness, you better run, because it probably saw you too! You don't have any weapons, so when faced with danger, all you have to do is run and hide.  <br/>At the beginning of the game, you appear in the canonical post-soviet courtyard. Your task is to find the key to the gate to get to the fast food restaurant. After that, 10 burgers will appear on the level. You need to collect them all to successfully complete the game. However, the owner of this place will interfere with you. At the level you will also find special lockers that will allow you to hide from him for a while.<br/><br/><br/><br/><strong>Atmosphere:</strong><br/>This game briefly transports you to a canonical post-Soviet courtyard. The broken asphalt, the rusted-out cars that have been parked here forever, and the paneled five-story buildings propping up the dark night sky with their roofs.<br/><br/><br/><br/><strong>Features and Content</strong><br/>In the game menu, you can choose what time of day the action will take place. You can choose from 3 times of the day: Night, Sunset and Twilight. These locations have visual differences, but the gameplay is always unchanged.<br/>In terms of gameplay, this is Hide and Seek horror about a scary clown. You are not able to fight back against him. All you can do is run and hide. Your goal is to collect the necessary amount of money, get to the fast food cafe and order food. However, you will not get food so easily, you will have to find it yourself.<br/><br/><strong>List of features:</strong><br/>- Immersive gameplay<br/>- Simple and convenient control<br/>- Realistic graphics<br/>- Scary clown!", "metacritic": null, "released": "2023-06-30", "tba": false, "updated": "2023-07-03T02:54:42", "background_image": "https://media.rawg.io/media/screenshots/0e1/0e1584c3fbafd11133c85aa76a0cfccc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 398, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wombat Games"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["wombat games"], "esrb_rating": null}