{"id": 963168, "slug": "octane-remix", "name": "Octane Remix", "name_original": "Octane Remix", "description": "Entertainment in the year 2085 is holographic. Outside of Stockholm, Sweden, there exists a piece of technology that is captivating the world’s imagination, a dome that can simulate any environment one could envision! <br/><br/>As a result of its flexibility, the dome has become the setting for numerous competitions, the most prestigious of which are the World Simulation Race Championships. <br/>These Championships that showcase neck-breaking, car-shattering, endless races are highly anticipated entertainment events. World-renowned racers enter the dome to prove, once and for all, who is the best of the best. <br/><br/><br/><br/><ul><li> Race through several treacherous tracks, filled to the brim with obstacles, from sawblades to missile launchers. <br/></li><li> Experience curated procedural generation, making each playthrough different! <br/></li><li> Choose from any of 3 unique characters, each with their own playstyle!<br/></li><li> Race your way through randomly generated campaigns! </li></ul><br/><br/>The Simulation Dome creates ever-changing racetracks. Get temporary upgrades, learn how to navigate each challenge, and experience curated semi-procedural level generation, making each playthrough different!  <br/><br/><br/><br/>Octane Remix is a fast-paced, non-stop Obstacle Hell Roguelike Racing Game! Choose your racer, choose your playstyle, and put your skills to the test! <br/><br/><br/><br/>Michishige, alias \"The Demon\", is an anonymous Simulation Driver from Japan. While her face might be concealed behind her mask, her eyes are on the track with unparalleled focus. Drifting is the name of the game, and nobody in the world can beat her at it!<br/><br/><br/>Akash is a world-renowned driver from Zimbabwe, decorated with countless championship victories.  With his humble, nurturing personality, he’s famous as a role model for new racers. Together with his sturdy car, he has the option to drive through obstacles rather than around them!<br/><br/><br/>Ludwig, from Germany, is a former pop star turned Simulation Driver. He used the money from his previous career to purchase a now iconic car made of gold. Despite the weight making it hard to handle, his extremely powerful engines provide him with superior speed! <br/>", "metacritic": null, "released": "2023-07-07", "tba": false, "updated": "2023-07-10T02:43:42", "background_image": "https://media.rawg.io/media/screenshots/087/0872357f23a148bddc827da793873dbb.jpg", "website": "https://teamvelocita.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Team Velocita"], "genres": ["Action", "Racing", "Indie"], "publishers": ["Team Velocita"], "esrb_rating": null}