{"id": 963165, "slug": "crazy-flasher-7-mercenary-empirestand-alone-versio", "name": "Crazy Flasher 7 Mercenary Empire(stand-alone Version)", "name_original": "Crazy Flasher 7 Mercenary Empire(stand-alone Version)", "description": "This game is a non-network stand-alone version of the classic flash web game \"闪客快打7佣兵帝国\" led by AndyLaw. This game is a small size game running in the form of 800X480. Because the development time was in 2010, the game screen is relatively retro, please understand.<br/>\r\nThis version mainly updates the multilingual system and complete local storage. And coexist with the online version of the original \"闪客快打7佣兵帝国\". Please choose the corresponding version by yourself.<br/>\n<br/>\r\nThis game is an adventure based on the theme of survival in the last days. The enemies in the early stage are mainly zombies, and later you will gradually encounter other gangs in the last days, such as the bandit \"Rock Park\", warlords, the assassination organization \"Black Iron Club\", etc. The gang \"A Corps\" triggered a series of stories and battles...<br/>\n<br/>\r\nThis game is a horizontal combat game, mainly using firearms, cold weapons and bare hands. There are many kinds of long guns and pistols in the firearms, and the original dual gun system can control different pistols for left and right hands separately. When using firearms, remember that there are corresponding magazines in the backpack. There are a variety of cold weapons, and you can learn various combat skills. Most of the equipment will change the shape of the character, which is rare in 2010 flash games.<br/>\r\nOne of the features of this game is that you can hire other characters to fight together. In the later stage of the game, you can also use the monsters in the game to become pets and fight together.<br/>\r\nThis game started in 2010 and has been in operation until 2023. During this period, it has undergone many updates. The current content is also very long, which makes it very difficult for developers to test from beginning to end. Please forgive me if you encounter bugs .<br/>\n<br/>\r\nThis game is more difficult, if you want to relax, please pay attention to the DLC that will be released later.", "metacritic": null, "released": "2023-07-08", "tba": false, "updated": "2023-07-10T02:40:09", "background_image": "https://media.rawg.io/media/screenshots/8e8/8e8c5c5fff2a2d59d46e7256e7c9fe2a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 231, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AndyLaw"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["AndyLaw"], "esrb_rating": null}