{"id": 963158, "slug": "new-heights-realistic-climbing-and-bouldering", "name": "New Heights: Realistic Climbing and Bouldering", "name_original": "New Heights: Realistic Climbing and Bouldering", "description": "Get ready to experience the ultimate climbing and bouldering game with New Heights. Made by real climbers, New Heights offers a realistic and immersive climbing and bouldering experience that will put your skills to the test. Ascending higher and higher on real-world locations, you'll feel that you are really there, tackling the toughest climbing and bouldering challenges.<br/><br/><br/><strong>EXPERIENCE THE THRILL OF THE CLIMB</strong><br/>Featuring realistic, physics-based climbing mechanics that will put your balance and grip to the test as you approach climbing and bouldering problems just as you would in real life. Feel the adrenaline rush as you make your way up the cliffs, and the sense of accomplishment as you reach the top. <br/><br/><br/><strong>ELEVATE YOUR SKILLS</strong><br/>New Heights offers a realistic and immersive climbing and bouldering experience that will transport you to beautiful and treacherous locations that you might never have the opportunity to visit in real life. Become a professional climber, and reach the top of the leaderboards.<br/><br/><br/><strong>CLIMB THE UNATTAINABLE</strong><br/>Push the boundaries of what's possible in climbing and bouldering. With the ability to try out free solo climbing and bouldering from the safety of your computer and to tackle routes that are inaccessible in real life.<br/><br/><strong>KEY FEATURES:</strong><br/><ul><li>Realistic, physics-based climbing mechanics that test your balance and grip<br/></li><li>Real cliffs and structures made possible by photogrammetry and drones<br/></li><li>Climb in locations you might never have the opportunity to visit in real life<br/></li><li>Try out free solo climbing and bouldering from the safety of your computer<br/></li><li>Climb where it's not allowed in real life<br/></li><li>Leaderboards to compete with other players<br/></li><li>Elevate your climbing skills<br/></li><li>Conquer fear of heights in a virtual setting</li></ul><br/>New Heights is the ultimate climbing and bouldering game for anyone who loves the thrill of climbing, and wants to experience it in the most realistic and immersive way possible. Get ready to reach new heights!", "metacritic": null, "released": "2023-07-07", "tba": false, "updated": "2023-07-24T20:07:02", "background_image": "https://media.rawg.io/media/screenshots/119/119b9f5fae0ad92fa27f9ebf253e2a86.jpg", "website": "https://newheightsgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2, "dropped": 1}, "playtime": 15, "achievements_count": 25, "ratings_count": 2, "suggestions_count": 480, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Wikkl Works"], "genres": ["Simulation", "Sports", "Indie"], "publishers": ["WhisperGames", "Wikkl Works"], "esrb_rating": null}