{"id": 963173, "slug": "terracodex-the-stolen-relics", "name": "TerraCodex: The Stolen Relics", "name_original": "TerraCodex: The Stolen Relics", "description": "<strong>The plot</strong><br/>The year is 1935. In the opulent city of Monte Carlo, the TerraCodex foundation is robbed of its powerful relics. All signs point to the infamous criminal group known as the 40 Thieves. Now, it's up to you to assemble a team of unique agents and track down these criminals to recover the stolen relics.<br/><br/><strong>The player, agents and thieves</strong><br/>As the mastermind of the operation, you direct agents around the globe, hunting for clues about the relics' whereabouts. Along your journey, you'll encounter diverse characters and unique scenarios. Challenges present themselves as engaging mini-games, each tied to different attributes. The thieves, each equipped with unique evasion skills, will not be caught easily. But rest assured, your agents have their own set of abilities too.<br/><br/><strong>The game board</strong><br/>Experience a first-person, single-player modern board game brought to life in VR. The game board, components, and miniatures come alive as you engage with them, collecting scattered clues to progress in your investigation.<br/><br/><strong>The experience</strong><br/>\"TerraCodex: The Stolen Relics\" stands out in the VR market with its unique approach to the board game genre. It offers a comfortable, accessible, and visually appealing strategy game experience. As the game constantly evolves to enhance the player's journey, you'll get to travel around the world of the mid-30s, visiting 60 unique venues across 20 different iconic cities, and interact with a dynamic array of characters.", "metacritic": null, "released": "2023-07-07", "tba": false, "updated": "2023-07-10T02:49:59", "background_image": "https://media.rawg.io/media/screenshots/1a3/1a3e451ff049fdd11a3630da120f47dd.jpg", "website": "https://www.terracodex.org/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Webcore Games"], "genres": ["Adventure", "Strategy"], "publishers": ["Webcore Games"], "esrb_rating": null}