{"id": 963178, "slug": "dunia-the-north-wood", "name": "Dunia: The North Wood", "name_original": "Dunia: The North Wood", "description": "In this action-adventure RPG, take on the role of cybernetic former Freedom Fighter, turned Secret Police Officer, Aeydrien Mason-Northwood. Your goal is to bring stability to the dystopian city-state island of the North Wood and thwart the hybridized, former Secret Police Captain turned Terrorist, Daxter Daemon-Northwood, while keeping your Sanity in check and your Reputation intact.<br/><br/><h3>Sword Of A Villain, Fists Of A Hero</h3>Killing is relatively easy in the North Wood, but it's even harder to just knock someone out for awhile, or talk them out of fighting completely. Ready your sword, fists, or words and combat a variety of enemies, whose death could destroy Aeydrien's Reputation with their Organization, cause far reaching changes to the North Wood as a whole, or even make more enemies appear later on.<h3>You're Made By The Shoes You Wear</h3>Whether it's the pants she wears, or sword piece she upgrades, Aeydrien's attire and equipment will tell the world a lot about her. A strange, naked human wandering the streets is nothing to be worried over, but someone donning the telltale attire of a North Wood Secret Police Officer is another story.<h3>The Unlimiter System</h3>Through the power of advanced cybernetics have Aeydrien break free from her body's natural limitations making her stronger, more durable, and even allowing her to slow down her perception of time. Be warned, however, pushing Aeydrien's body too far might result in injuries that even she can't heal from.<h3>What A Strange And Bizarre Ultra Future</h3>In the far flung future, there are only Nyims. Cocoons have allowed people to shed their humanity and become Animal-Human hybrids, Cybernetics keep alive that which should be dead, and the left over biomass is converted into a worker Amalgam, while all being watched over by the North Wood Government and their Representatives. Law and order kept by the Secret Police, with you as one of their Captains.<h3>Every Death Makes You Weaker</h3>Death is something that Aeydrien has started to grow intimately familiar with in her older age. Though, lucky for her, the medical bills are covered by the state, and with so little meat left on her bones maintenance is mostly mechanical. Unluckily for her, and you, death is not the end.<h3>Awkward To A Fault</h3>A woman of few words, or perhaps someone who just doesn't like to speak, Aeydrien is limited in how many Interactions she's able to have in a single sitting, with a single person. Interaction Points are few and far between, so choose your words wisely.<h3>Talk To God</h3>From a young age Aeydrien has had a special relationship with the capital G, God, or the Waandishi as they refer to themselves, providing her aid when she needed it most, or maybe just pushing her down the path He wanted her down. Such wisdom taking form as her own voice speaking to her, at first, but now appearing as glowing marks that only she can see.<h3>The Life Of An Addict</h3>Each life you take, takes its toll on Aeydrien's dwindling Sanity forcing her to self medicate through the herbal remedy known as Blue Leaf or deceptively addictive and stimulating Java. Or, perhaps, for a short time you'll let Aeydrien tap into her inner maniac and inject Red Salt, blinding you to her health, but allowing her to attack at nearly double her strength.<h3>Actions Have Consequences</h3>Whether it be stealing the light from a lantern, choosing to leave your sword behind for more peaceful solutions to conflict, or deciding you'd rather heal than buy that fancy new armor, every decision you choose to make, big or small, will have an impact on gameplay and the story.", "metacritic": null, "released": "2023-07-07", "tba": false, "updated": "2023-07-10T02:57:17", "background_image": "https://media.rawg.io/media/screenshots/418/41816fb0b8ce982ea4d4fb238eeb2d58.jpg", "website": "https://www.teamwoodblock.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 304, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Team Wood Block"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Team Wood Block"], "esrb_rating": null}