{"id": 963268, "slug": "elseworld", "name": "Elseworld", "name_original": "Elseworld", "description": "<p>An alternate world full of Goblins and other fictional creatures. You are the 1st male goblin in over 100 years and have been hidden from the world for 23 years. The story starts on the day that all changed. Don&#39;t read on if you don&#39;t want any kind of spoolers. Also, this game will have consistent monthly updates with new content and the continuation of the story. A typical update is around 200 videos. You will always get the additional content free of charge.<br />\nIt is starting on a day in the main characters life.<br />\nThe world:<br />\nConsists of Goblins, Orcs, Ogres, Half-Orcs, Fairies, Hobgoblins,  and Half-Kitsune. The Goblins,  Orcs and Half-Orcs are the dominant races. The others sometimes coexists but usually keep to themselves. There are two goblin factions who will fight for possession of the only male goblin in existence.<br />\nWhat will you be doing?:<br />\nBuilding relationships and each character has Love, Lust, Bond and Hate stats. Your decisions will affect your relationships. Sometimes one door may close while another may open.<br />\nSome light fighting. There are some creatures which don&#39;t want goblins to procreate and will actively want you to die.<br />\nSome role playing - Building basic stats like Strength, Stamina, Agility.<br />\nSex...Oh yea and lots of it.<br />\nYou will also manifest powers. You will need to play to find out what they will be.<br />\nIn future updates you will be:<br />\nHunting animals.<br />\nDungeon crawling.<br />\nGoing to new places<br />\nMeeting tons of new creatures (some nice and some not so nice)<br />\nMeet some of the characters (Play the game to meet the rest):<br />\nEco - You and the only male goblin<br />\nKeico - Your mom<br />\nNim - Your guardian Pixie and narrator<br />\nMeet the sisters - Two pairs of triplets (Who they are? Play the game):<br />\nNori, Nymi and Nezi - three triplet 23 year old sisters<br />\nNiki, Nari and Nuri - three triplet 18 years old sisters<br />\nIzi, Iki and Suri - your roommates<br />\nThe rest you will just have to learn about in the game.</p>", "metacritic": null, "released": "2023-07-11", "tba": false, "updated": "2023-09-08T16:03:45", "background_image": "https://media.rawg.io/media/games/7b6/7b6a8dd371e69d2bebaffbd90f4206b8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 439, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "macOS", "PC"], "developers": ["Icefired 3D"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Icefired 3D"], "esrb_rating": null}