{"id": 963232, "slug": "gnomes-garden-lifeseeds-collectors-edition", "name": "Gnomes Garden Lifeseeds Collector's Edition", "name_original": "Gnomes Garden Lifeseeds Collector's Edition", "description": "The subjects came to the Gnomes Queen with alarming news. All gardens, forests and meadows began to fade. And so throughout the gnomes land!<br/>\r\nThe court sorceress is sure that this is all due to the fact that recently they began to develop too many mines and pay little attention to magic trees, which has deteriorated the ecology.<br/>\n<br/>\r\nCan goodness prevail? Will the Queen of the Dwarfs be able to save the environment and her country and the whole world?<br/>\n<br/>\r\nIn this strategy, you must intelligently manage dwarves and resources, clearing the way for buildings and characters. You have to choose the right sequence of actions that will lead you to success!  Functional controls and understandable instructions will help you easily understand the basics of the game.<br/>\n<br/>\r\nIn this game you will see:<br/>\n<br/>\r\n- An unusual magical world, the source of the magic of which is the ancient gardens.<br/>\r\n- Hilarious storyline, colorful comics and colorful characters!<br/>\r\n- Many different tasks that the queen has not yet faced.<br/>\r\n- Over 40 unique levels.<br/>\r\n- Unusual enemies: evil gremlins, mischievous raccoons, angry bears, and ... chthonic monsters.<br/>\r\n- 4 unique locations: the land of the gnomes, the elven forests, the wasteland of the wolf riders and the mountain kingdom.<br/>\r\n- Useful bonuses: cornucopia, fun radio, magic ax and others ...<br/>\r\n- Simple controls and intuitive training.<br/>\r\n- Over 20 hours of addictive gameplay for all ages.<br/>\r\n- Nice themed music.", "metacritic": null, "released": "2023-07-09", "tba": false, "updated": "2023-07-14T02:46:56", "background_image": "https://media.rawg.io/media/screenshots/466/4666c33d6b36c8ddc69a8c3fdb2f3e4e.jpg", "website": "https://www.facebook.com/8FloorGames/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Toyman"], "genres": ["Strategy", "Casual"], "publishers": ["8Floor"], "esrb_rating": null}