{"id": 963290, "slug": "hell-denizen", "name": "Hell Denizen", "name_original": "Hell Denizen", "description": "Earth has been invaded by demons many years ago. The demon rulers have slaved, tortured and killed everyone who resisted. You decide to fight back! The demons found out you were plotting a rebellion against them and the demons are now hunting you as an enemy of the state. Your goal is to start a rebellion and overthrow the evil demon rulers and their minions.<h3>Features:</h3><ul><li>10 weapons with alternate firing modes. You have weapons like automatic Magnum Pistols, double barreled Shotgun, rapid fire Machinegun, accurate Sniper Rifle, guided Rocket Launcher and high tech Plasmagun.<br/><br/></li><li>Over 10 enemies ranging from easy cannon fodder Troopers to dangerous Demon Knights, blood thirsty Brute Butchers, strange Dimensional Shamblers and cybernetic Alien Hunters.<br/><br/></li><li>Your journey takes you through industrial complexes, cityscapes and decayed forgotten places. Plenty of secrets to discover.<br/><br/></li><li>There's also a survival mode where you fight against the ever-growing army of the demons in the deathmatch levels until they overwhelm you.<br/><br/></li><li>Play up to 4 player local split screen multiplayer in co-op, deathmatch and survival modes. XInput compatible controllers/gamepads needed for split screen multiplayer. There is an auto aim setting that can be used when playing with gamepads.<br/><br/></li><li>Optional 256 color palette shader for a more retro look.</li></ul>", "metacritic": null, "released": "2023-07-13", "tba": false, "updated": "2023-07-14T03:58:39", "background_image": "https://media.rawg.io/media/screenshots/b00/b0099920d940cbec60474230917fd335.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SusaDeBeast"], "genres": ["Action", "Indie"], "publishers": ["SusaDeBeast"], "esrb_rating": null}