{"id": 963282, "slug": "tides-of-dominion", "name": "Tides of Dominion", "name_original": "Tides of Dominion", "description": "In Tides of Dominion, step into the role of a daring privateer. Choose from one of two factions locked in a ceaseless struggle for control of a persistent, ever-evolving maritime world. Participate in naval battles, conquer strategic islands, and gather loot to fortify your ship. In these unpredictable seas, the survival of the craftiest is assured - steer your fate in the world of Tides of Dominion!<br/><br/><h3>From Humble Beginnings to Mighty Captain!</h3><br/>Begin with a modest vessel and strategically work your way to commanding grand and fearsome ships.<h3>Clash and Repair!</h3><br/>Engage in naval battles, cause havoc to enemy ships, and remember - maintaining and repairing your own vessel is key.<h3>Close-Quarters or Long-Range!</h3><br/>Choose your fighting style: participate in thrilling sword duels or take down opponents from a distance with your trusty sidearm.<br/><br/><h3>Strategic Dominance in a Dynamic World!</h3><br/>In an ever-changing, persistent world, seize control of vital islands. Utilize their resources to your advantage and erect steadfast defenses to deter rival incursions.<h3>Win the War!</h3><br/>Once all islands are under your faction's control, lead a decisive invasion of the enemy's homebase. With victory comes a world reset, providing a fresh start and new allegiances.", "metacritic": null, "released": "2023-07-12", "tba": false, "updated": "2023-07-14T03:48:10", "background_image": "https://media.rawg.io/media/screenshots/b8e/b8ead6ae025fdbe49bf8fa003a80504c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 309, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Arctic Theory ehf."], "genres": ["Action", "Adventure", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["Arctic Theory ehf."], "esrb_rating": null}