{"id": 963222, "slug": "police-car-suv-simulator", "name": "Police Car SUV Simulator", "name_original": "Police Car SUV Simulator", "description": "Welcome, brave police officer candidates! Police Car SUV Simulator aims to reach the top of police car simulations with its realistic graphics and impressive gameplay. In this exciting game, you will hunt for criminals using your police car and ensure justice in every corner of the city. Be prepared because this adventure will make you feel like a police officer!<br/>\n<br/>\r\nIn Police Car SUV Simulator, you aim to complete missions in certain city parts successfully. There are seven exciting missions in total in the game. In these missions, you must safely transport the criminals caught on the streets to the police station. When you accept the task, the time starts, and you must take the criminals to the police station within the specified time. If you successfully get the criminals to the target before the time runs out, you will get rewards for your success. Using these rewards, you can customize your vehicle and make it more impressive. You can choose the car color as you wish, adjust the camber of the wheels, choose between different wheel models, add spoilers to the vehicle, reflect your style with various decals, and adjust the suspension. Build your unique police car and enjoy your job while on duty in the city.<br/>\n<br/>\r\nPolice Car SUV Simulator has a realistic traffic system that gives a real traffic experience while playing. It would help if you were careful when interacting with other street vehicles. Also, on long missions, you will have to stop by gas stations to refill your car that has run out of gas. If your vehicle has been damaged as a result of collisions or accidents, you can repair your vehicle using the repair station. These features will give you more empathy, making the gaming experience more realistic and immersive.<br/>\n<br/>\r\nPolice Car SUV Simulator brings together many features that will meet the demands of you police game lovers. The Minimap feature in the game will help you reach the place you want faster and easier. Using the map, you can navigate toward the regions where the missions are located and follow your target better.<br/>\n<br/>\r\nStep into the realistic and adrenaline-filled world of police car driving with Police Car SUV Simulator! Catch criminals on the city streets, complete missions, and take pride in being a police officer. Drive fast, safely, and boldly in your own customized police car.", "metacritic": null, "released": "2023-07-13", "tba": false, "updated": "2023-07-14T02:34:43", "background_image": "https://media.rawg.io/media/screenshots/daf/daf0ca5fdfa67d9fde7f9863011444db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Samet Acar"], "genres": ["Action", "RPG", "Simulation", "Racing", "Indie"], "publishers": ["UPCELL TELEKOMUNIKASYON LIMITED SIRKETI"], "esrb_rating": null}