{"id": 963224, "slug": "school-of-gods", "name": "School of Gods", "name_original": "School of Gods", "description": "We want you! We are taking on new recruits for the position of Planetary Governors.<br/><br/>Applicants must have good decision-making skills, calm in pressurised situations, quick thinking, and a creative approach. You will be guiding a civilisation from scratch to become the Governor of an entire star system.<br/><br/><br/><br/>All new gods must be trained and educated before they can be left to guide a new-born civilisation on one of the millions of inhabited planets in the galaxy.<br/>Journey to the world that has been developed to train new recruits in the intricacies and mysteries of successful civilisation development. The entire planet has been separated into self-contained, completely controlled training areas. One of these will be assigned to you to develop.<br/><br/>The game is centred around the command altar, which is where all of your decisions are made. This complex piece of technology allows you to transmit from your ship in orbit directly to the citizens of your new civilisation. These will affect all aspects of your boundary area and so caution should be exercised when using the device.<br/><br/><br/><br/>From tiny villages to bustling metropolis, guide your fledging civilisation through eight technological ages and a series of different decisions.<br/>•\tExperience 8 distinct ages throughout the development of your civilisation.<br/>•\tGuide your civilisations through dozens of decisions with hundreds of possible outcomes.<br/>•\tOutperform rival civilisations and unite your boundary areas.<br/>•\tDefeat the final challenges and take your place amongst the stars.<br/><br/>Are you ready to join our team?<br/><br/>", "metacritic": null, "released": "2023-07-13", "tba": false, "updated": "2023-07-14T02:37:00", "background_image": "https://media.rawg.io/media/screenshots/f85/f8521bd9f251153fcc4ff82a6c4c6350.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rampere"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Rampere"], "esrb_rating": null}