{"id": 963369, "slug": "tiny-shop", "name": "Tiny Shop", "name_original": "Tiny Shop", "description": "YOU are a brand new member of the trading guild just stepping into this fantasy world. Personalize and design your own store, attract customers and sell magical and epic goods!<br/><br/>Research, craft, trade, negotiate, buy and sell fantasy items and products from all over the world in this RPG simulation game and learn to manage your store to become the city’s best shop!<br/><br/>Build, design and customize your very own cute fantasy shop with dozens of options! Making your store as outstanding as it can be will upgrade customers' satisfaction and boost your shop! Fortune awaits!<br/><br/>With the help of your cute little assistant, discover a RPG world crafted with love. Meet mages and knights and send your heroes on epic adventures! Earn money and XP without doing anything as your assistant will sell your items for you while you are offline! Just fill your warehouse to the brim with goods and items and let the cash flow!<br/><br/>Complete quests and missions for the trading guild and your customers and become the most beloved and reliable shopkeeper in town!<br/><br/>Follow a cute and funny story, discover characters from your town and outside, build and upgrade your city to unlock more items and quests! <br/><br/>Expand and upgrade your shop tile by tile. Buy beautiful and cute furniture and decoration to make your shop truly yours. Upgrade your shop’s statistics to boost your gold and xp! <br/><br/>Plant and harvest exotic plants to craft powerful potions and other magic alchemy goods. From beautiful flowers to leafy vines you can become the best gardener around! Visit the botanist in the city center to buy new seeds and expand your garden. <br/><br/>In this RPG fantasy shop adventure you will:<br/><br/>RESEARCH, DISCOVER and CRAFT dozens of different items and goods to trade<br/>DESIGN and CUSTOMISE your tiny shop to improve your sales!<br/>COMPLETE STORY MISSIONS and QUESTS to help your city become prosperous<br/>EXPLORE and BUILD your city and world<br/>GROW and HARVEST cute plants and flowers<br/>ENJOY CUTE and CHARMING hand painted visuals<br/>HAVE A GOOD and RELAXING time<br/><br/>Tiny Shop is a RPG store simulation game that will let you customize and design your own shop within a cute fantasy world. You can research, craft and sell: armor, potions, magic books, all kinds of gear and equipment as well as crafting materials such as plants, metals and gems. With your hard earned money you can expand and personalize your cute fantasy shop and explore the world to become the most prosperous shopkeeper in town!<br/><br/>Install Tiny Shop for free NOW! Craft, trade, buy, sell, quest and customize in this fantasy RPG game!<br/><br/>Music in our game is made by Kevin MacLeod at https://incompetech.com/<br/>We're using the following tunes: <br/>* Carpe Diem<br/>* Porch Swing Days (slower) <br/>* Montauk Point<br/>Licensed under Creative Commons: By Attribution 3.0<br/>http://creativecommons.org/licenses/by/3.0/", "metacritic": null, "released": "2023-04-29", "tba": false, "updated": "2024-01-07T21:21:20", "background_image": "https://media.rawg.io/media/screenshots/a98/a98cf856f707343d0245a5c9b847232e_tBavnvJ.jpg", "website": "https://www.tinycloud.games", "rating": 0.0, "rating_top": 0, "added_by_status": {"playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Mateusz Lesinski"], "genres": ["RPG", "Simulation"], "publishers": ["Mateusz Lesinski"], "esrb_rating": "Everyone 10+"}