{"id": 963336, "slug": "tilez-fun-family-game", "name": "Tilez - Fun Family Game", "name_original": "Tilez - Fun Family Game", "description": "We are introducing Tilez - the exciting new tiles game to hit the Play Store! Play your way through various levels, each featuring unique rewards and challenges!<br/><br/><br/><br/>With a simple, easy-to-learn rule set, anyone can jump in and start playing. Plus, the game is casual and fun, perfect for a few minutes of downtime or when you need a break from the everyday.<br/><br/><br/><br/>Tilez is a fast-paced game that will test your strategic skills and keep you on your toes. The goal is to be the first to get rid of all your tiles by melding, laying off, and discarding them. With colorful tiles and easy-to-learn rules, Tilez is a game everyone can enjoy.  <br/>Have a blast with Tilez and sharpen your strategic skills!<br/><br/><br/><br/>Play together with people from all around the world. Whether you’re an experienced player or a total beginner, in Tilez you’ll find the perfect opponents to play with. Join the fun and become a part of the Tilez club today!<br/><br/><br/><br/>If you're a fan of classic tile games like rummy cube, Mahjong, Phase 10 and Okey, you'll love the strategic gameplay and addictive mechanics of Tilez.<br/><br/><br/><br/>How to Play?<br/><br/><br/><br/>In Tilez, you and your opponents take turns picking from the table and discarding tiles to form valid melds. The first player to meld all their tiles wins the game. Enjoy an exciting, strategic battle as you attempt to be the first one to go out and win the game!<br/><br/><br/><br/>Compete with others to become a champion Tilez player. Are you ready to take on the challenge? <br/>Download Tilez now and get a fantastic online multiplayer game experience!<br/>Try Tilez today and see if you have what it takes to become the star!<br/><br/><br/><br/>Like Rummy Rush, Backgammon Lord of the Board, Spades Royale, Gin Rummy Stars, and Domino Go - Tilez is a fun and exciting mobile game developed and distributed free of charge by Beach Bum, the makers of leading online, multiplayer, social, and casual games.", "metacritic": null, "released": "2023-04-11", "tba": false, "updated": "2023-07-14T05:02:13", "background_image": "https://media.rawg.io/media/screenshots/67a/67aa8215b162a4167f2901d461b1aa9b_PQCl2fv.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Beach Bum"], "genres": ["Board Games", "Casual"], "publishers": ["Beach Bum"], "esrb_rating": "Everyone 10+"}