{"id": 963361, "slug": "truck-simulator-truck-games-2", "name": "Truck Simulator: Truck Games", "name_original": "Truck Simulator: Truck Games", "description": "Truck wali game with the combination of Truck driving simulator and driving game is finally here for drivers out there who love to drive and simulate Heavy Duty Cargo Trucks. Pick up the cargo from different places and start your journey by transporting cargo from one point to another in this Truck game. Transportation of cargo has never been so fun before this American Truck Driving game. Cargo Transport Truck Game Offline comes with new features among other Simulation games. Play this ultimate simulator and become a Professional truck driver of Transport duty truck games and Lorry Games.<br/><br/>Heavy Truck Simulation - Ultimate Offroad Truck Simulator Games 3D<br/><br/>Drive UD and Semi-trucks with Big Lorry and Trailers at Offroad Mountains, Uphill Tracks, and City highways in this new free truck games 2022. Truck games is one of our popular games like other new free games. Transport wood logs at different points going through the uphill mountain tracks in our offline games. Be careful in hill climbing while going on off-road tracks and show your American truck driving 3d skills in Trailer truck wali game. Drive like a professional off road truck driver, be a hill climber and leave that dirt behind in our truck game. Lorry game adventures made more fun with our popular games that is highly recommended to Big truck games 2020 lovers.<br/><br/>Big Trucks and Lorries for Goods Delivery<br/><br/>Our American Truck Simulator - Driving Games 3D has a variety of trucks to drive on Offroad tracks. Enjoy driving Truck Simulator Games and Transport Oil barrels in this transport duty games 2022. Play each game level of truck games 3d 2020 to unlock the next level like other new free game and Pak Truck Driving Games Simulator. Our popular games will change your views regarding lorrey games and trucks free game.<br/><br/>PK Truck Driver Truck Simulator - Free Truck Driving Games for Ultimate driving experience<br/><br/>Truck simulator games gives you the ultimate simulation experience among other new games &amp; Free driving games. Buckle up for a Truck game simulator in a truck simulator 2022 arena. Forget about truck parking games, it’s time for truck wali game. Moreover, you will enjoy our truck game 2022 and truck simulator europe than any car racing and car parking games.<br/><br/>Big Vehicles Driving Simulator - Indian Truck Simulator and Euro Truck Simulator Game<br/><br/>Drive the Pickup Truck on Indian offroad tracks to begin the fun of Cargo Truck Driving Games . Our truck game 2021 is a Heavy Truck Simulation Game with Multi Truck Driver. Enjoy Trailer Truck Driving just like in Euro Truck Simulator and Indian Truck Simulator Games. Be a truck games 3d 2019 new driver.<br/><br/>Features:<br/>&gt; Free truck drive games<br/>&gt; 3D Environment with high-quality graphics<br/>&gt; Smooth Gameplay<br/>&gt; Variety of Pakistani &amp; Indian trailer trucks<br/>&gt; Truck Simulator Non-stop action just like in Multiplayer games<br/>&gt; Indian euro truck is among New &amp; updated games 2022", "metacritic": null, "released": "2022-12-23", "tba": false, "updated": "2023-07-14T05:29:33", "background_image": "https://media.rawg.io/media/screenshots/554/554c64c97c8aa95144f6ec99886f169f_4EHA4g6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Hussain"], "genres": ["RPG", "Simulation"], "publishers": ["Muhammad Hussain"], "esrb_rating": "Everyone 10+"}