{"id": 963347, "slug": "food-truck-chef-cooking-games", "name": "Food Truck Chef Cooking Games", "name_original": "Food Truck Chef Cooking Games", "description": "Travel around the world with Victoria, Flo &amp; Emily in your very own restaurant on wheels cooking delicious dishes and desserts playing Food Truck Chef™. Become a true culinary chef as you play with a variety of ingredients to cook amazing food from dozens of different cultures. From pasta to pizza, sushi to cakes, there’s no limits to what you can dream up, cook up and serve up in your very own food truck.<br/><br/>Why Food Truck Chef™?<br/>•Cook 700+ appetizing dishes from across the globe<br/>•Visit 17 exotic locations<br/>•Master 680 fun levels<br/>•Battle it out against other chefs at the food truck carnival<br/>•Build your very own restaurant empire<br/><br/>LEARN TO COOK<br/>Learn new techniques cooking anything from nachos, falafel, kebabs, desserts and Asmr foods, to breads, pasta, noodles and hot dogs.<br/><br/>TRAVEL<br/>Visit exotic locations like Pasta street, Pizza St, BBQ St, Waffle St, Oriental St, Bakers St, Sandwich St, Sushi St and Tasty town.<br/><br/>STYLE YOUR TRUCK<br/>Add some bling to your truck to earn more tips and reduce customer waiting times. Build your own fully customized food truck experience complete with furniture, decorations, menu-boards and even bookracks. Start with a pasta truck, before buying your own BBQ truck, pizza truck, Tex-Mex truck, bakery truck and more.<br/><br/>FOOD WARS<br/>Battle it out against other chefs at the Food Street Carnival.<br/><br/>PARTY<br/>Earn gems by sending your truck out to gigs to feed hungry partygoers.<br/><br/>UP YOUR GAME<br/>Chase whacky achievements or upgrade your kitchen to add more time, cook faster and serve more customers.  <br/><br/>TO THE STARS &amp; BEYOND<br/>Collect stars and earn gems in the weekly Star Haul event with new themes every week.<br/><br/>Follow us on social for all the latest offers:<br/>Facebook @foodtruckchefgame<br/>Instagram @foodtruck.chef<br/>Twitter @myfoodtruckchef<br/><br/>So what are you waiting for? Expand your kitchen empire as you unlock more and more cuisines, create culinary masterpieces and unleash your inner chef.  The world is yours for the taking, so let’s fire up the grill!", "metacritic": null, "released": "2017-07-25", "tba": false, "updated": "2023-07-14T05:13:10", "background_image": "https://media.rawg.io/media/screenshots/488/4886d58b725d979dc5aaab3b233a3d39_PC9nNpK.jpg", "website": "http://nukeboxstudios.com/foodtruckchefgame", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Avant Grade Technologies Pte"], "genres": ["Strategy", "Casual"], "publishers": ["Avant Grade Technologies Pte"], "esrb_rating": "Everyone 10+"}