{"id": 963350, "slug": "kards-the-ww2-card-game", "name": "KARDS - The WW2 Card Game", "name_original": "KARDS - The WW2 Card Game", "description": "Card Game meets World War II<br/><br/>KARDS, The WW2 Card Game, combines traditional CCG gameplay with innovative mechanics inspired by classic strategy games and real battlefield tactics. Take command and challenge other players in grand-scale warfare on the ground, air, or seas.<br/><br/>KARDS is completely free to play with all features available from the start. You can earn all cards through regular gameplay, daily missions and an extensive achievement system. <br/><br/>KARDS blends familiar trading card gameplay that make it easy to learn and are combined with innovative mechanics that provide strategic depth and tactical diversity. Innovative frontline mechanics allows you to better protect your support assets and take the battle to your enemy. Rush your enemies with Blitzkrieg tactics, gain air superiority or dig in for bitter defensive warfare until you outproduce and outgun your enemies<br/><br/>WW2 nations in KARDS:<br/>BRITAIN - Lords of the skies and the oceans <br/>The vast empire was caught off guard when the WW2 broke out, but adapted quickly to new types of warfare. With their formidable fleet, advanced aircraft and incredible stubbornness, the British forces never gave an inch without a fight. <br/><br/>USA - Outproduce, outgun and bring hell from the skies<br/>Although joining the WW2 later than the other major powers, the USA had been preparing  their production lines and supporting their allies for years. Completely outproducing their Axis enemies, the Americans were eventually able to launch offensive operations of epic proportions in all theaters.<br/><br/>THE SOVIET UNION - The mighty red army<br/>At the outbreak of WW2, although large on paper, the forces of the Soviet Union were badly equipped, trained and organized. This would change fast. Forged through fire and blood during the Great Patriotic War, the Red Army would soon become the mightiest war machine the world had ever seen. <br/><br/>JAPAN - Sunrise in the east<br/>Completely underestimated by the Allies in the WW2, the Japanese Imperial Army and Navy swept across South-Asia and the Pacific in a lightning war of their own. Initially the Japanese had complete air superiority in the area and a fearsome navy which included the heaviest battleships ever constructed. <br/><br/>GERMANY - Pioneers of blitzkrieg<br/>Crushing their enemies with Blitzkrieg tactics, hard pressing armoured units and mechanised formations, the German Wehrmacht was at its best on the offensive in WW2. Battle of annihilation would be their favourite doctrine. Compared to the Allies, Germany did not have a lot of ships but in the depths of the oceans roamed fearsome packs of wolves... ready to strike at the their prey.<br/><br/>FRANCE / The flame of the French resistance <br/>Before WW2 many believed that the French had the most powerful military in Europe, but they were not prepared for the German Blitzkrieg advance. Although defeated, they did not give up the fight. The Free French Forces continued the fight against the Axis on foreign soil while The French Resistance disrupted and demoralised the German occupation forces at home. <br/><br/>ITALY - Restoration of the Roman empire<br/>While not ready for a long lasting conflict at the outbreak of the WW2, Italy tried to seize the opportunity believing that the British Empire was about to collapse from the German offensive.  With ambitions to restore Italy to the status of the old Roman Empire, the Italian forces were concentrated on major offensives in the Africa and the Middle East. <br/><br/>POLAND - Fight from exile!<br/>Before and during WW2, Polish intelligence gathering and crypto-analysis experts contributed significantly to cracking the famous Enigma code. Their exiled forces fought fiercely during the Battle of Britain and other campaigns alongside their allies in WW2-Europe.", "metacritic": null, "released": "2023-06-06", "tba": false, "updated": "2023-07-14T05:16:01", "background_image": "https://media.rawg.io/media/screenshots/89a/89a276f75d56d4bd496ab3fde2190c91_Ogzvpqk.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["1939 Games ehf"], "genres": ["Strategy", "Card"], "publishers": ["1939 Games ehf"], "esrb_rating": "Teen"}