{"id": 963366, "slug": "bloons-td-6-netflix", "name": "Bloons TD 6 NETFLIX", "name_original": "Bloons TD 6 NETFLIX", "description": "Available exclusively for Netflix members.<br/><br/>Sharpen those darts! Defend Monkey Towers from an ever-flowing stream of colorful invading balloons. As you pop, more new abilities and heroes unlock.<br/><br/>Join millions of other players who enjoy our massive and ever-expanding features — including new upgrades, heroes and abilities — that deliver endless hours of fun tower defense strategy. Can you pop every last Bloon?<br/><br/>New content updates:<br/><br/>• 4 Player Co-op: Play every map and mode with up to 3 other players in public or private games.<br/>• Boss Events: Fearsome Boss Bloons will challenge even the strongest defenses.<br/>• Odysseys: Battle through a series of maps connected by their theme, rules and rewards!<br/>• Trophy Store: Earn trophies to unlock dozens of cosmetic items that let you customize your monkeys, Bloons, animations, music and much more!<br/>• Content Browser: Create your own Challenges and Odysseys, then share them with other players and play the most liked community content!<br/><br/>Epic Monkey Towers and heroes: <br/><br/>• More than 20 powerful Monkey Towers, each with three upgrade paths and unique activated abilities<br/>• Explore the incredible power of the new Paragon upgrades, especially against Boss Bloons!<br/>• Play with more than a dozen diverse heroes with multiple signature upgrades and special abilities, plus unlockable skins and voiceovers<br/><br/>More features:<br/><br/>• Play Anywhere: Single-player offline works even when your wifi doesn't!<br/>• Powers and Insta Monkeys: Earned through gameplay, events and achievements, these are fun to collect and boost your popping power when you need it!<br/>• More than 60 handcrafted maps make every game a different tactical challenge<br/>• More than 100 meta-upgrades add power where you need it to tackle difficult maps and higher freeplay rounds<br/><br/>- Created by Ninja Kiwi.", "metacritic": null, "released": "2023-06-20", "tba": false, "updated": "2023-07-14T05:34:20", "background_image": "https://media.rawg.io/media/screenshots/11e/11e360e14e571c5440399a06b8099fc9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Netflix"], "genres": ["Strategy"], "publishers": ["Netflix"], "esrb_rating": "Everyone 10+"}