{"id": 963354, "slug": "tile-push", "name": "Tile Push!", "name_original": "Tile Push!", "description": "Are you ready to conquer the world of tiles and emerge victorious in this captivating tile match puzzle game? Download \"Tile Push!\" now and unleash the tile master within!<br/><br/>In \"Tile Push!\", you'll find yourself locked in a duel against another player, each trying to be the first to flip their deck and claim victory. With the option to choose from an array of themed decks or classic mahjong decks, the game offers endless possibilities and keeps you engaged. <br/><br/>\"Tile Push!\" is a casual game that knows no age restrictions. It combines elements of tile mastery, match skills, tile match, color sorting, mahjong, and the thrill of tapping away at puzzles. Unleash your inner tile master as you immerse yourself in the world of colorful tiles, connecting them, sorting them, and solving intricate match puzzles. With each move, you are inch closer to victory, displaying your superior sorting abilities and strategy.<br/><br/>Prepare to be mesmerized and captivated by its seamless blend of strategy and entertainment and pave your way to becoming the ultimate match master.<br/><br/>Become a tile master as you connect, match, and color sort tiles to solve the colorful block puzzle.<br/><br/>To opt out of CrazyLabs sales of personal information as a California resident, please visit our Privacy Policy: https://crazylabs.com/app", "metacritic": null, "released": "2023-02-13", "tba": false, "updated": "2023-07-14T05:20:03", "background_image": "https://media.rawg.io/media/screenshots/514/514ce5cba7f11e5bb3940a10230c7137_dl0HhH3.jpg", "website": "https://www.crazylabs.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Crazy Labs"], "genres": ["Casual", "Puzzle"], "publishers": ["CRAZY LABS BY TABTALE , G.P."], "esrb_rating": "Teen"}