{"id": 963300, "slug": "the-customer-is-always-right", "name": "The Customer is Always Right!", "name_original": "The Customer is Always Right!", "description": "<strong>It's your first day at the job, just like any other week!</strong><br/><br/>Enter the immersive town known as Neverquit, as you follow your protagonist (and optional feline companion!) through a journey as a customer service cashier at the local Shop n' Stuff! <br/> <br/><br/><br/><strong>Features:</strong><br/><ul><li> Dynamic gameplay of various elements involving action/quick-time events!<br/></li><li> Old-school style RPG elements, to give you that nostalgic feeling!<br/></li><li> With special gear, you can make the game into a resettable rogue-like that \"remembers\" your previous reset!<br/></li><li> Unique RPG classes, such as \"Schrodinger\" -- a class that learns new abilities on game resets, and \"Tactician,\" requiring stance changes for techniques!<br/></li><li> Events and scenes in the game feel like it's old school goodness, complete with retro sound effects and music!<br/></li><li> An incredible soundtrack, awesome pixel-style graphics and animations!<br/></li><li> A story that blossoms every time you reset or get an ending in the game, with a dynamic day-to-day system!<br/></li><li> ... And <strong>more</strong>!</li></ul> <br/><br/><br/>Hurry up, clock on in, what do you have to <strong>lose</strong>?! Maybe you'll learn a thing or two about the trick of the trade. Buy The Customer Is Always Right! today!", "metacritic": null, "released": "2023-07-13", "tba": false, "updated": "2023-07-14T04:13:49", "background_image": "https://media.rawg.io/media/screenshots/c83/c839831f3718cb46d0f6f7b78478940f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Denatsu Games"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Indie"], "publishers": ["Denatsu Games"], "esrb_rating": null}