{"id": 9633, "slug": "klepto", "name": "Klepto", "name_original": "Klepto", "description": "Welcome to Klepto where there's no place like a burglarized home. In this burglary simulation you'll explore, terrorize and loot your way to success in a variety of open-world sandbox neighborhoods. <br/><br/>Build your reputation in the criminal world by taking on contracts or team up with your fellow criminals for some online multiplayer shenanigans. Hate the idea of burglarizing? Play online as one of Klepto's finest to serve and protect the neighborhoods in the Cops &amp; Robbers multiplayer game mode.<br/><br/>**VR is NOT required for this game.<br/><br/><br/><ul><li>Sandbox Mode (Single Player)<br/></li><li>Multiplayer Co-Op<br/></li><li>2 Open-world neighborhoods<br/></li><li>Full VR Support<br/></li><li>Lockpicking &amp; Safe Cracking<br/></li><li>Powered by Unreal Engine</li></ul><br/><br/><ul><li>Story Mode (Single Player)<br/></li><li>4 New Neighborhoods<br/></li><li>Residential Hacking featuring popular tools like NMAP and the Aircrack-ng Suite<br/></li><li>Disguise System<br/></li><li>Additional Multiplayer Game Modes<br/></li><li>Multiplayer Enhancements including Progression and Reputation Systems<br/></li><li>More gadgets, tools and hacks</li></ul><br/><br/><br/>Purchase Klepto during Early Access and receive the following in-game items:<br/><br/><br/><br/>Show off your early support of the game by sporting the exclusive skin, the prison stripe Founder's backpack in Klepto's online multiplayer.<br/><br/>Delivery Details: This cosmetic item will be wearable by players online in a future content update bringing multiplayer customization and reward unlocks to the online gameplay. <br/><br/><br/><br/>Kick off your hacking career in style with the Founder's Edition Zeus 2000f Laptop featuring LED color selection and a 10% speed upgrade*<br/><br/>Delivery Details: This in-game item will be available to players in a future content update bringing new hacking equipment and vehicle customization.<br/><br/>* 10% speed is in comparison to default starting laptop.", "metacritic": null, "released": "2016-06-30", "tba": false, "updated": "2019-08-28T22:14:52", "background_image": "https://media.rawg.io/media/screenshots/db2/db2ceb8bdcd2dc60dd7e258d104d09ea.jpg", "website": "http://kleptogame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "dropped": 1}, "playtime": 3, "achievements_count": 30, "ratings_count": 1, "suggestions_count": 416, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Meerkat Gaming"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["Meerkat Gaming"], "esrb_rating": null}