{"id": 963325, "slug": "inspector-gadget-mad-time-party", "name": "Inspector Gadget - MAD Time Party", "name_original": "Inspector Gadget - MAD Time Party", "description": "Metro City has fallen into the hands of the evil Dr. Claw and his M.A.D. agents. To save the city, Inspector Gadget must travel into the past using a time machine. Unfortunately, it breaks down and his ancestors find themselves teleported to the present.<br/><br/>Your mission: Explore Metro City and compete with your ancestors to collect the time machine's missing parts. You will need to complete mini-games to unlock the bolts needed to repair the machine. Play against three Gadget's ancestors to earn the bolts. <br/><br/>Visit iconic places from the famous original series, meet characters such as Chef Quimby, Penny, and the M.A.D. agents, and use the inspector's various gadgets to fight back against the M.A.D. forces.<h3>Features </h3><ul><li>Embark on a thrilling adventure where you play as the legendary Inspector Gadget and save Metro City from the grip of Dr. Claw!<br/></li><li>Explore the iconic Metro City and complete quests and challenges in Solo mode. <br/></li><li>Discover 16 fun mini-games inspired by the Inspector Gadget universe!<br/></li><li>Have fun with family and friends in Multiplayer mode.<br/></li><li>Enjoy the superb soundtrack from Tanis Chalopin, the daughter of Inspector Gadget's creator, Jean Chalopin.</li></ul>", "metacritic": null, "released": "2023-09-15", "tba": false, "updated": "2023-09-18T03:09:44", "background_image": "https://media.rawg.io/media/screenshots/bfc/bfc264d7525237af1fbdb7b5f0c7fdbe.jpg", "website": "https://www.microids.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 324, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Smart Tale"], "genres": ["Action", "Adventure", "Simulation", "Casual"], "publishers": ["Microids"], "esrb_rating": null}