{"id": 963373, "slug": "story-of-alcana-match-3", "name": "Story of Alcana: Match 3", "name_original": "Story of Alcana: Match 3", "description": "Welcome to the amazing world of Alcana! Play this Match-3 game with unsurpassed graphics and an exciting storyline; restore magical forests and castles; upgrade your fairy-tale creatures and look for ancient artifacts that will help you solve puzzles!<br/><br/>Your journey will be full of various locations inhabited by fairy-tale creatures and teeming with dangerous mysteries: Enchanted Forest, Burning Lands, Floating Islands, Underwater World, Snow Peaks, Charmed Garden, Forgotten Caves, Other Worlds and many others...<br/><br/>You will be confronted by witches, werewolves, trolls, krakens, dragons... But! Don’t worry! You can strike the right note with everyone, and you can even make friends with them!<br/>A young dragon, a snow yeti, a time keeper and many other characters will take your side, and their help will be indispensable for you while you are completing the game tasks!<br/><br/>Game features:<br/>● Unsurpassed graphics and an exciting story with many twists and turns!<br/>● Unique playable characters, each with their own ability. Young Sparky will help you with his fiery breath, wise Marvin will give you extra moves, and mysterious Forest Spirit will enchant the game field...<br/>● Ability to upgrade characters in exchange for the coins found. The stronger the hero – the more effective their ability!<br/>● Many chapters made in different styles: from the Burning Lands – to the abandoned land of dragons and to the Flying Islands.<br/>● Solve ancient puzzles to find powerful artifacts! Each artifact will provide you with invaluable assistance in completing Match-3 game levels.<br/>● Complete weekly challenges, participate in tournaments, compete with other players in PvP, and discover many other game modes!<br/><br/>Story of Alcana is a free game, but some in-game elements can also be purchased for real money.", "metacritic": null, "released": "2020-05-02", "tba": false, "updated": "2023-07-14T05:41:38", "background_image": "https://media.rawg.io/media/screenshots/cd5/cd586c6711a9bfafe0748bfa84281087_v1HoKtI.jpg", "website": "https://ym4games.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["YM 4 GAMES"], "genres": ["Adventure", "Puzzle"], "publishers": ["YM 4 GAMES"], "esrb_rating": "Mature"}