{"id": 963305, "slug": "testament-the-order-of-high-human-2", "name": "Testament: The Order of High Human", "name_original": "Testament: The Order of High Human", "description": "Testament is an action-adventure game with bits of RPG and Metroidvania elements set in the fantasy world of Tessara. <br/>After the betrayal of your brother Arva, madness has descended upon the realm. Playing as the immortal king of High Humans, you have to thread a path of survival for the realm. <br/>In a crazy journey through the lands of an ancient civilization, facing deranged followers of a mad dictator, fighting against worshippers of a blood god and dangers to come, you must reclaim your lost power and much more to confront your brother Arva. <br/>Will you be the guardian of the realm as the chosen of the order?<br/><br/><br/><br/>Experience a new form of swordplay in a first-person camera with innovative combos. unlock diverse magical spells to trap, paralyze and burn your enemies. Use your bow to hit the enemy’s weak spot. Learn it all and see for yourself, just how versatile and deep Testament’s combat is.<br/><br/><br/><br/>Solve mechanical puzzles and test your platforming skills. By overcoming these trials, gain powers and learn the truth of the world. <br/><br/><br/><br/>The world is filled with the eyes of darkness. Blocker eyes bar your path, leech eyes possess other creatures granting them invincibility and the night bringers cause darkness descension and make everything harder for you. Use your bow of light to destroy these eyes of darkness.<br/><br/><br/><br/>Use the consumables from the in-game wheel and see the effects of these magical items in your play style. They are not some buffs and passive numbers, use them to see how cool and different their effects are. Don’t be stingy with them, you can craft these items in your wheel. <br/><br/><br/>Be a part of the story of two High-Human brothers Aran and Arva. One has lost everything but stands by his conviction to fight for his realm while the other is on the verge of devouring the realm he discarded. The one who prevails will decide the fate of the world.", "metacritic": null, "released": "2023-07-13", "tba": false, "updated": "2023-07-14T04:19:59", "background_image": "https://media.rawg.io/media/screenshots/b46/b467c83e6347b49f5641b90e014a5cf6.jpg", "website": "https://testamentseries.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1}, "playtime": 2, "achievements_count": 41, "ratings_count": 0, "suggestions_count": 565, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fairyship Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Fairyship Games"], "esrb_rating": null}