{"id": 96336, "slug": "swing-time", "name": "Swing Time", "name_original": "Swing Time", "description": "<p>You are just an innocent little girl, trying to enjoy her swing, but all the other kids in the park are trying to knock you off! </p><p>You must swing as high as you can, swing-kicking other kids as they pass beneath you, knocking them into oblivion. But you have a special gift...</p><p><em>You can slow down time!</em></p><p>Slowing time decreases the speed of everything around you except your own accumulation of speed. This means that you can super-charge your swing and deliver a swinging kick of utter destruction! </p><p>Now you must stay on your swing as long as possible, defending your rightful place!</p><p><strong>FEATURES:</strong></p><ul><li>Awesome totally realistic swinging</li><li>Super amazing physics-breaking time manipulation</li><li>Utterly destructive swing kicking</li><li>GameJolt online high scores so you can compete against the world</li></ul><p><strong>GAME PLAY TIPS:</strong></p><ul><li>When swinging, press the screen as if you were pumping your legs on a swing. So, when you are swinging down towards the ground, you will want to press, and when you are swinging away from the ground, you will want to release.</li><li>Slowing down time will slow down everything except the rate at which your velocity increases or decreases, so the best time to use your power is when you are swinging towards the ground (while pressing the screen).</li><li>Do a loop!</li></ul>", "metacritic": null, "released": "2015-07-22", "tba": false, "updated": "2019-08-28T23:25:36", "background_image": "https://media.rawg.io/media/screenshots/9ff/9ff7f5cadee910dedff635496b27d95f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["jahndis"], "genres": [], "publishers": [], "esrb_rating": null}