{"id": 963338, "slug": "piggy-kingdom", "name": "Piggy Kingdom", "name_original": "Piggy Kingdom", "description": "Jingle-jingle, get your Piggy Kingdom ready - time to solve puzzles and get rewards. Match 3 games will leave happy emotions afterward. Piggy Kingdom will take you on an exciting journey where you will:<br/>• Solve puzzles<br/>• Match, swap and crush colors<br/>• Get tons of unique boosters<br/>• Rich rewards - earn coins and exchange them for in-game goods<br/>• Hundreds of challenging, chilling, and funny levels<br/>• Beautiful animations, cheerful music<br/>• Lots of ways to kill time with fun and joy<br/>• Easy to play and win! Here is where we all feel fine!<br/><br/><br/>IT IS NOT A WASTE OF TIME. Challenging yet enjoyable match 3 puzzle games where you need to train your brain by swiping colorful objects in shapes of three or more. It just sounds to be so easy. Ha-ha-ha.<br/><br/><br/>SMILE AS YOU WATCH YOUR BOOSTERS DOING MAGIC. Every time you wisely move sweet colorful pieces together – the puzzle game will give you unique powerful boosters.<br/><br/><br/>EVERY ATTEMPT IS APPRECIATED. Get rewards. Use accumulated boosters to finish a hard puzzle-solving game or keep them for the updated levels ahead.<br/><br/><br/>EYE CANDY GRAPHICS + VISUALS. Your Piggy Kingdom game has never been so real. Hahaha. Boosters, puzzles, characters, surroundings, everything in this game looks so delightful.<br/> <br/>When you see the board which you need to clear – things look so real. Some of them you even may find at home around you in real life. The best puzzle solving &amp; color swiping match 3 game is here for you! Piggy Kingdom is waiting for you!<br/><br/><br/>PIGGY KING AND THE CASTLE. The character's reactions are so funny to look at, and the castle has so many details to give a closer look at.<br/><br/><br/>FROM BEGINNERS TO PROS! Your level of playing and solving match three puzzle games can be different, but be sure, you will enjoy this match 3 game.<br/><br/><br/>This application offers a free-to-play experience with the option for in-game purchases.<br/><br/><br/>Privacy Policy: https://www.olleyo.com/piggymatch/home/Privacy_Policy.html<br/>Terms of Service: https://www.olleyo.com/piggymatch/home/Terms.html", "metacritic": null, "released": "2022-09-19", "tba": false, "updated": "2023-07-14T05:04:21", "background_image": "https://media.rawg.io/media/screenshots/d52/d52099dfb214d60a49b67911a7c0cad4_ZeuXazG.jpg", "website": "https://olleyo.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Olleyo"], "genres": ["Puzzle"], "publishers": ["Code Dish"], "esrb_rating": "Everyone 10+"}