{"id": 963349, "slug": "alien-world-dbd-alien-games", "name": "Alien World - dbd alien games", "name_original": "Alien World - dbd alien games", "description": "Greetings to all the fans of action-packed games. in our 3D Sci-Fi war games FPS offline, play unlimited sniper and Sci-Fi war games FPS offline missions with lots of fun. Fan of commando gun shooting games FPS offline? Wait no more, your favorite action game &amp; Sci-Fi war games FPS offline 2022 is finally here. For finishing our advanced gun games, complete all missions to transform into the number one commando in the best action game of the adventure shooting games genre. you can play our gun games 3d gameplay of the sniper offline game without Wi-fi and experience the Sci-Fi war games FPS offline 2022 for free.<br/><br/>Team Deathmatch feature of Sci-Fi war games FPS offline:<br/>The gun game 2022 has impressive graphics and a handy campaign mode which will turn your game time much more entertaining in our free shooting game. Playing our game is on a new shooting level of fun in the Sci-Fi offline fps shooting game 2022. In our latest 3d gun shooting game you play as a secret commando of offline game 2022. In our advanced gun games become a super soldier and defeat the foes in our army game which is one of the best offline shooting games. become an army soldier and rule the battlefield in our offline sniper game. These New gun games have multiple secret missions in the best shooting offline games for free.<br/><br/><br/>What you will find in our Sci-Fi war games FPS offline:<br/>- shoot to kill feature of best FPS Offline shooting game.<br/>- intelligent enemies in team deathmatch.<br/>- Offline Sniper Shooting Game Mode.<br/>- Assault mission gameplay in action game category.<br/>- Free for all gun shooting game modes.<br/><br/>3d gameplay in Gun Shooting Games - Recommended for you<br/>play great offline games with non-stop entertainment. In this fps shooting game, play offline shooting game levels for 3D shooting fun. Gun games offline are great offline shooting games in which you can compete with friends. While playing the gun games offline enjoy a 3D perspective of offline shooting games. recommended games include this shooting game as it is very entertaining among players of all ages.", "metacritic": null, "released": "2022-09-06", "tba": false, "updated": "2023-07-14T05:15:05", "background_image": "https://media.rawg.io/media/screenshots/f0b/f0b160f3109d20217ea6624f914b1e6e.jpg", "website": "http://www.gunshooting.games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 376, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Iram Shehzad"], "genres": ["RPG", "Strategy", "Sports"], "publishers": ["Iram Shehzad"], "esrb_rating": "Teen"}