{"id": 963486, "slug": "planet-x2-c64", "name": "Planet X2 (C64)", "name_original": "Planet X2 (C64)", "description": "<h3>HOW TO PLAY</h3>In order to better understand how to complete your mission,you will need to familiarize<br/>yourself with the basic controls. Planet X2 is controlled entirely by keyboard.<br/><br/><br/><br/>Planet X2 gives you control over a maximum of 10 driveable units, and 54 structures.<br/>The driveable units have a special view at the bottom of the screen showing which<br/>ones exist. If the number is highlighted in white, then that unit exists.The blue pointer<br/>points at the one you are currently controlling.<br/><br/><strong>The Game Screen</strong><br/><br/><br/><br/><strong>Switching between units</strong><br/><br/>You will need to switch between units during gameplay. There are several ways to<br/>accomplish this.<br/><br/><ul><li>If you see the unit or building you want to control, simply press <strong>RETURN</strong> and browse over<br/>to the unit you wish to control, then press <strong>RETURN</strong> again.<br/><br/></li><li>If the unit is not on the screen then you will need to use one of the other methods. If the<br/>unit can be driven around, you can select it using the number keys <strong>0</strong> through <strong>9</strong>, as each<br/>drivable unit will be assigned one of these keys.<br/><br/></li><li>If the unit is a building, you can use the <strong>PLUS</strong> and <strong>MINUS</strong> keys to alternate between all of<br/>the different buildings you have. You may need to press the keys several times to cycle to<br/>the correct one.</li></ul><br/>You can move your units around using the <strong>CURSOR</strong> keys or <strong>WASD</strong> keys, whichever<br/>you prefer. The function keys to your right are what you typically use to manipulate<br/>your units, except for when firing your tank, which you use <strong>SPACE BAR.</strong><br/><br/><h3>RESOURCES</h3><br/>One of the first things you will need to do is search for resources. You will need three<br/>different types of resources – Minerals, Gas and Energy:<br/><br/><strong>Minerals</strong><br/>On Planet X2, minerals tend to form in large outcroppings and come in different<br/>forms.<br/><br/><br/><br/>Once you have located the minerals, you will need to pick them up with your builder.<br/>That means you will have to get very close to the minerals. If something is in the<br/>way you will need to move it or destroy it. Once you have picked up the minerals,<br/>drop them on the “X” spot next to your factory. Then select the factory and use F5 to<br/>“process minerals”. It may be helpful to build an additional factory next to the supply<br/>of minerals to speed things up.<br/><br/><strong>NOTE:</strong> When you start the game you will be given an initial supply of resources to get<br/>you started, but this amount depends on which difficulty level you select. See chart<br/>below.<br/><br/>", "metacritic": null, "released": "2023-07-14", "tba": false, "updated": "2023-07-17T03:52:18", "background_image": "https://media.rawg.io/media/screenshots/7a7/7a7e38e7c794bb165564ef2afe514f13.jpg", "website": "https://www.the8bitguy.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["8-Bit Productions"], "genres": ["Strategy"], "publishers": ["NMSE & Co"], "esrb_rating": null}