{"id": 963484, "slug": "gimmicks-gadgets", "name": "Gimmick's Gadgets", "name_original": "Gimmick's Gadgets", "description": "FINALLY! THE STORY OF HOW GIMMICK PREPARED FOR THE HIT NEZOOM GAME \"GIMMICK IN THE CHAOS DIMENSION\"... TOLD IN IDLE GAME FORM! <br/><br/>GENERATE RESEARCH AND FOCUS, SLOWLY GETTING MORE COMPLEX IN THE GADGETS YOU MAKE, TO UNLOCK EVEN MORE COMPLEXITY AND STORY IN THE RELENTLESS PURSUIT OF INCREASING YOUR NUMBERS! <br/><br/>GENERATE RESEARCH AND FOCUS BY PLACING NODES IN YOUR GADGETS, USING THE RESOURCES TO UNLOCK MORE AND MORE WAYS TO GENERATE MORE RESEARCH AND FOCUS! RESEARCH UNLOCKS THE STORY OF THE GAME, EACH TIME UNLOCKING A NEW GADGET AS A NEW MAP TO BUILD AROUND! AS THE GADGETS GET MORE COMPLEX, HOW WILL YOU CREATE EACH GADGET TO MAKE THE BEST USE OF THE SPACE AND RESTRICTIONS? <br/><br/>USE FOCUS TO UNLOCK NEW TYPES OF NODES FOR YOUR GADGETS! TURN ELECTRICITY INTO AETHER INTO CHAOS AS YOU WORK TO OPTIMIZE EACH MAP AND ITS RESOURCES! EACH UPGRADE CHANGES WHAT YOU CAN DO... AND WHAT THE BEST OPTION CAN BE. DO YOU FORSAKE EVERYTHING TO GENERATE HUGE FOCUS? HOW DO YOU DEAL WITH THAT CHAOS PORTAL THAT BLOCKS AETHER GENERATION? EACH GADGET IS ITS OWN PUZZLE FOR YOU TO UNRAVEL!<h3>FEATURES INCLUDE:</h3><ul><li>AN INCREDIBLE 64 COLORS MINIMUM <br/></li><li>USING YOUR GAINED 'FOCUS' AND 'RESEARCH' TO MAKE YOURSELF GAIN MORE 'FOCUS' AND 'RESEARCH'<br/></li><li>UNLOCKABLE TECH TREE WITH UPGRADES THAT CHANGE HOW YOU PLAY<br/></li><li>AT LEAST NINE MAPS TO PUZZLE AND OPTIMIZE<br/></li><li>CUTSCENES BETWEEN GIMMICK AND HER PARTNER, SYNC<br/></li><li>A COMPLETELY ORIGINAL MUSICAL SOUNDTRACK<br/></li><li>ACHIEVEMENTS THAT YOU CAN ACCOMPLISH AND BRAG ABOUT<br/></li><li>RELAXING YET THOUGHT-PROVOKING PUZZLE-IDLE GAMEPLAY<br/></li><li>MAKING NUMBERS GO UP IN EVER INCREASING RATES<br/></li><li>MANY COSMETIC OPTIONS<br/></li><li>OFFLINE PROGRESS SO YOU NEVER MISS A MOMENT OF NUMBERS INCREASING</li></ul>", "metacritic": null, "released": "2023-07-14", "tba": false, "updated": "2023-07-17T03:50:10", "background_image": "https://media.rawg.io/media/screenshots/42a/42a64f719cdb8c19b8566fa58fa8b912.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 331, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Space Mouse"], "genres": ["Casual"], "publishers": ["Space Mouse"], "esrb_rating": null}