{"id": 963436, "slug": "vapor-dash", "name": "VAPOR dash", "name_original": "VAPOR dash", "description": "VAPOR Dash is an exhilarating and challenging hardcore action platformer that thrusts players into a relentless and high-speed adventure. Set in a mesmerizing world drenched in the vibrant aesthetics of vaporwave, the game demands split-second decision-making, lightning-fast reflexes, and skillful combat.<br/><br/>Immerse yourself in a cloud-filled vaporwave city, where the only way to traverse its treacherous terrain is by leaping from one platform to another. Every movement must be precise and calculated, as a single misstep can send you hurtling down into oblivion, sealing your fate.<br/><br/><strong>Features</strong><br/><ul><li>High-speed and intense gameplay: VAPOR Dash offers a thrilling experience with its fast-paced and relentless action. Players must constantly stay in motion, making split-second decisions while battling enemies and navigating challenging platforms.<br/></li><li>Precise platforming mechanics: The game requires precise timing and skillful platforming maneuvers. Players must carefully calculate their jumps and movements to avoid falling into the void and progress through the vaporwave city.<br/></li><li>Strategic combat encounters: Engage in intense battles with formidable enemies scattered throughout the city. Players must employ strategic thinking and utilize their skills and weapons effectively to overcome these adversaries while evading their attacks.<br/></li><li>Surreal vaporwave aesthetic: Immerse yourself in a visually stunning world infused with the mesmerizing aesthetics of vaporwave. The neon landscapes, vibrant colors, and synthwave soundtracks create a unique and captivating atmosphere that enhances the overall gaming experience.<br/></li><li>Challenging levels and obstacles: VAPOR Dash presents a series of meticulously designed levels that test players' agility, reflexes, and problem-solving skills. From complex platforming sections to intricate puzzles, each level offers a new and exciting challenge that keeps players engaged and motivated to conquer the cityscape.</li></ul>", "metacritic": null, "released": "2023-07-13", "tba": false, "updated": "2023-07-17T02:48:37", "background_image": "https://media.rawg.io/media/screenshots/a43/a43a1302d3b207cd0c3328572ee59b15.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["galesoozka"], "genres": ["Indie"], "publishers": ["galesoozka"], "esrb_rating": null}