{"id": 963490, "slug": "wtf-platformer", "name": "WTF platformer", "name_original": "WTF platformer", "description": "<strong>WTF platformer</strong> is a hardcore platformer with many unique levels, various references and memes. You have to not just run through the next blank, but find a unique approach to each new track. You will not see another inscription or picture with a reference, you will have to flee from them or dodge them with the help of your finger dexterity and skill. In addition to setting your ass on fire due to the complexity, you will see funny thumbnails with simple animations and hear many funny sounds and melodies. The game is crammed with a lot of funny and funny moments. Each game level will differ from each other by 90%.<br/><br/><br/><ul><li> Lots of references<br/></li><li> Lots of memes<br/></li><li> Difficulty<br/></li><li> Author's soundtracks from the developer<br/></li><li> Original voice acting and effects<br/></li><li> There is physics (in moderation)</li></ul><h3>Mr.R says welcome to \"WTF platformer\" game and have fun. :)</h3><br/><br/><br/><br/><br/><ul><li>Non-standard control of the main character \"Mr.R\" (this does not apply to the keys on the keyboard).<br/></li><li>No air movement. The ballerina cannot jump in one direction, and in flight make a U-turn returning to the same point. <strong>WILL NOT BE CHANGED.</strong><br/></li><li>The game is very hard, <strong>AND THE DIFFICULTY WILL NOT BE CHANGED</strong> (for those who are always whining about the complexity of games).<br/></li><li>The developer is not responsible for the nerves spent (reminder, there are no difficulty levels in the game, the game itself is hardcore and will continue to develop in this direction).<br/></li><li>The developer is not responsible for the broken psyche, and the standard idea of platformers <strong>with plush unicorns.</strong></li></ul><h3>* No assets *</h3>", "metacritic": null, "released": "2023-07-14", "tba": false, "updated": "2023-07-17T03:56:48", "background_image": "https://media.rawg.io/media/screenshots/10d/10dc233e2e1f5ca99a17890c2e4c622e.jpg", "website": "https://www.instagram.com/deilrox.entertainment/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DeilRoXEntertainment"], "genres": ["Indie"], "publishers": ["DeilRoXEntertainment"], "esrb_rating": null}