{"id": 963474, "slug": "abandonware-the-horror-collection", "name": "Abandonware: The Horror Collection", "name_original": "Abandonware: The Horror Collection", "description": "In early 2023, whilst walking our dogs, we found an internal 3.5\" Hard Drive partially uncovered. After cleaning it up as best we can and plugging it in we found an almost entirely custom operating system with what look to be horror mini games. It was only when we started completing these games did we see new options appear and we began to get a little concerned. Reporting it to the authorities has yielded no results and so we're turning to you to help us uncover what on earth this is ...<br/><br/>Be warned, however, for these games may seem ordinary on the surface, but they hold a grip on your imagination. We're asking you to work with us to extract the full contents of the hard drive ...<br/><br/><br/><br/>So far we have extracted four games from the contents of the drive and as we complete them we've noticed other options appearing quickly and then disappearing before we get a chance to do anything else...<br/><br/><br/><br/>What looks to be a stalker game based on the Red Riding Hood story, you're tasked with finding a few items whilst the Wolf is stalking around the map. Whoever made this must have some rudimentary understanding of procedural generation as the map is different every time. We've also noticed the numbers that appear on the forest floor too but as yet, we have no idea how to use them.<br/><br/><br/><br/>Hansel we think is an upgrade to Red Riding Hood and works in two stages. First off, you're Hansel and you're tasked with finding the witches house. Then you become Gretel in order to rescue your brother. All the time, the Witch is teleporting around the map to find you. Again, we've spotted some unusual glitches during this game and again haven't found a use for them.<br/><br/><br/><br/>Mr Gnome goes Skating is probably the weirdest one out of the bunch. The game is, on first impressions, very simple but gradually becomes more and more complex and you're tasked with saving the animals. The glitches and out of bounds errors we've seen here tell us that there's something else going on, but again we need your help in finding this stuff out.<br/><br/><br/><br/>This is where we need your help ... as we have played through these games we've noticed new menu options appearing that seem to disappear before we're able to extract them. Will you help us uncover what on earth we've found ... as we have a feeling it's going to be a wild ride.", "metacritic": null, "released": "2023-07-14", "tba": false, "updated": "2023-07-17T03:37:08", "background_image": "https://media.rawg.io/media/screenshots/f9d/f9d652f78490a561d8d60bde9c6ed153.jpg", "website": "https://www.fossilgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Fossil Games"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Hound Picked Games"], "esrb_rating": null}