{"id": 963454, "slug": "goosey-guess", "name": "Goosey Guess", "name_original": "Goosey Guess", "description": "<h3>Guess Simulator</h3><br/>Welcome to Goosey Guess, the ultimate guessing game with a delightful goosey twist! Immerse yourself in a captivating 3D environment where dozens, and even hundreds of items materialize before your eyes. Get ready for an addictive and challenging experience that is easy to play but difficult to master. Your challenge? To accurately guess the number of items inside each container and compete on the leaderboard. Are you ready to put your estimation skills to the test? <br/><br/><h3>Notable Features</h3><br/><ul><li>Realistic guessing simulator<br/></li><li>19 Items (more to come)<br/></li><li>21 Containers (more to come)<br/></li><li>4 Planned phases with new features<br/></li><li>All future content will be free! no DLC besides the soundtrack<br/></li><li>Interactive leaderboard and stats tracking<br/></li><li>Multiple difficulties, settings, and controls<br/></li><li>Over 40 minutes of specially composed music<br/></li><li>Crisp sound effects and visuals<br/></li><li>Lots of geese<br/></li><li>Indie developer that will listen to feedback</li></ul><br/><h3>Future Enhancements</h3><br/>With regular updates and 4 planned phases after release, Goosey Guess keeps evolving. Get ready for an ever-expanding collection of items, containers, and exciting improvements that ensure the geese and guesses stay fresh and fun. We value community feedback and are committed to implementing improvements and changes based on player input.<br/><br/><h3>Interactive Leaderboard</h3><br/>Prepare to showcase your guessing prowess with the help of our dedicated server and webpage, where leaderboards, user profiles, and guesses are meticulously tracked. Refine your abilities in practice mode, allowing you to sharpen your guessing skills beforehand. For those who prefer a more personalized experience, free play mode offers the flexibility to choose your own settings. Tailor the game to suit your preferences, creating the perfect environment to test your estimation skills.<br/><br/><h3>Original Soundtrack</h3><br/>Goosey Guess features an original soundtrack composed exclusively for the game. Renowned composer Kevin Namikata has crafted over 40 minutes of \"classical story\" music that harmoniously blends with the gameplay, bringing the world of geese and guessing to life. The crisp sound effects and beautiful music work in harmony to create an immersive audio experience that complements the gameplay perfectly.<br/><br/><br/><br/>Join our Discord server for the latest news, to make suggestions, report any problems or ask questions.", "metacritic": null, "released": "2023-07-14", "tba": false, "updated": "2023-07-17T03:10:00", "background_image": "https://media.rawg.io/media/screenshots/956/9560e8aff6eab6873086c30d2b174ac0.jpg", "website": "https://gooseyguess.gaslanterngames.com/s/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gas Lantern Games"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Gas Lantern Games"], "esrb_rating": null}