{"id": 963426, "slug": "escape-from-demon-island", "name": "Escape from Demon Island", "name_original": "Escape from Demon Island", "description": "This is a vampire survivor game, including tower defense, survival, and light meat pigeon gameplay. Through a variety of weapons and skills, avoid and eliminate beasts and monsters, and finally eliminate the abyssal demons and escape. Enjoy yourself!<h3>Enemy introduction</h3>1. Randomly generated monsters, the monsters are different during the day and night!<br/>2. Bosses are randomly generated. There are many types of bosses, each with their own skills. New bosses will be gradually added as the version changes!<br/> <br/> <h3>Character introduction</h3>1. Multiple characters can be selected, and each character has a unique skill. Using this skill well can increase your chances of survival! New characters will be gradually added as the version changes!<br/>2. Players can destroy enemies by creating attack methods such as rotating knife towers, arrow towers, and magic towers, and gain experience to upgrade these weapons!<br/> <br/> <h3>How to play</h3>1. Obtain experience points by destroying monsters, 3 skill cards will appear randomly, choose one of them to enhance your character!<br/>2. There are a variety of skill cards, such as upgrading the rotating knife tower, arrow tower, magic tower, etc., as well as its own attack auxiliary skills!<br/>3. The boss will be different every time you encounter it, and the level will be cleared only by destroying all the bosses!<br/><br/>", "metacritic": null, "released": "2023-07-14", "tba": false, "updated": "2023-07-17T02:37:05", "background_image": "https://media.rawg.io/media/screenshots/0dc/0dc50ef9bac5cb15c51f530d3ba6f5dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 259, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["川流游戏"], "genres": ["Strategy", "Indie"], "publishers": ["川流游戏"], "esrb_rating": null}