{"id": 963593, "slug": "maska", "name": "MASKA", "name_original": "MASKA", "description": "<h3>What to do in the virtual world MASKA?</h3><br/>What to do in your free time? Whatever you want! Dance, meet new people or joke with friends. Hot parties every day and you don’t need an excuse to show your moves on the dance floor!  Getting bored from all the fun? Start a business, earn game currency and become successful. What’s your ideal world like? Explore Maska! Bonuses, promos, gifts, and, of course, positive emotions!<h3>Your persona</h3>Male or female, brunette or blond. Express your taste and creativity! Come up with your unique look and personality with the help of our advanced editor. Simple but powerful, it allows a quick-and-easy creation or detailed, elaborate appearance, that can impress even experienced lovers or life sims.<h3>Time to party!</h3>You don’t need an excuse to show your skills on the dance floor! Hot parties, cool music and a great mood are waiting for you every day. Learn new moves and impress the crowd!<h3>Relationships</h3>Find a special someone. What will your first date be like? In a club, out for a walk, or maybe at work? How will your story develop? Everything depends on you! Fall in love or even create a family.<h3>Transportation</h3>The virtual word has transportation to support your virtual freedom. Regular cars? Boring! Show your style: gather a full collection from a spacecraft to a magical unicorn!<h3>Interactive objects</h3>Get immersed the help of interactive objects. Unique effects and animations are waiting at the store and around countless virtual environments. Discover them all and have fun on a new level!<h3>Adventures</h3>Every day - new things to do. Finish quests and earn game currency. More adventures - more money earned to check out all the awesome things at the store.<h3>Express emotions</h3>Are you angry, happy or maybe amused? MASKA is a world where everyone can freely express their feelings. With the use of actions and avatar’s facial expressions, of course :) A full spectrum of human emotions is available to choose from.<h3>Real estate</h3>Set up your dream home, whether it’s an apartment or a house. Our intuitive editor has everything you need for building and decor. Unleash your creativity and invite friends to check it out!<h3>Work</h3>Have you always wanted to start a business? Practice in the virtual world! Just decide on the idea and get started. Would it be a furniture store, clothing boutique or a real estate company? Earn game currency, develop your brand and build a loyal customer base.<h3>Shopping</h3>Earned enough - have fun with your money. Explore stores and get what your heart desires: transport, effects, decor and much much more! You can create and sell things too, by the way!", "metacritic": null, "released": "2023-07-20", "tba": false, "updated": "2023-11-02T02:47:37", "background_image": "https://media.rawg.io/media/screenshots/450/4507c2a1067df296a7d31c5f257eebd6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 484, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WEALTHBIRD"], "genres": ["Simulation", "Casual", "Massively Multiplayer"], "publishers": ["WEALTHBIRD"], "esrb_rating": null}