{"id": 963538, "slug": "dice-of-olympus", "name": "Dice Of Olympus", "name_original": "Dice Of Olympus", "description": "Dice of Olympus is a strategy game that uses customizable dice as game mechanics to defeat online players or monsters in a rich adventure mode. The game dive the player into the world of Greek myths and all its great epics. Play as the Olympian gods in battles against monsters from the prison of Tartarus or other players via multiplayer mode !<br/><br/><br/>The Temple is the place where you can customize your dice decks. Take your time to read the descriptions of the many faces at your disposal, and distribute them wisely among your dice to create synergies and really great combo.<br/><br/><br/><br/><br/>Choose your god with his unique spells, customize your 5 dice with the many faces available (~100), playing with all the game mechanics to build an unfailing strategy. Put in your deck all the spells that you need to thwart your opponent's strategy and get you out of badest situations.<br/><br/>Once in combat, do everything in your power to get the best possible draws, don’t be too greedy, and choose wisely the dice you reroll and the spells you launch and their targets. Turn by turn, setup your plans and anticipate the best and worst scenarios to bring your opponent's health points down to zero. In Dice Of Olympus you can :<br/><br/><ul><li>Attack the health points<br/></li><li>Blocking dices of your opponent<br/></li><li>Increase your roll to be sure to have what you want<br/></li><li>Increase your favor to get unique bonuses<br/></li><li>Invoke magic crystals and deal bonus or curses<br/></li><li>Gain mana for launching bigger spells<br/></li><li>And lots of other spell mechanics to discover...</li></ul><br/><br/>When you arrive in combat the game will propose you only 3 of the 5 dices that you customized, among the 3 dice, you will be able to change only one if you don't want to start the game with this, once the phase of Mulligan finished, the real combat can begin !<br/><br/><br/><br/>Each turn will start by the roll phase, it's in this phase that you will be able to select your dices and roll them if you desire. Don't forget that Dice Of Olympus doesn't contain a fog of war and you can look the dices of your opponent ! With that in mind, try to anticipate what will do your opponent to counter him.<br/><br/><br/><br/>Once you're ready you will be able to launch your spells to your opponent, to determine which player can play and which player had to wait we created a incantation score, each spell has a mana cost and a incantation value, when your incantation score is smaller then your opponent you can launch spell until you overtake his incantation score.<br/><br/><br/>Every 3 rounds, you will have the choice between unlocking an extra die or gaining a mana point for the rest of the game, so choose wisely which bonus will make the difference for you in the game<br/><br/><br/><br/>The game is based on dice rolls, and therefore, is subject to <strong>randomness</strong>.<br/>However, uncontrolled randomness can generate strong frustration and a feeling of injustice and helplessness among players.<br/>To counter this aspect we decided that when you roll a dice, you are guaranteed to draw a different face then the previous one<br/>With this little twist, you can create strategy based on Milling for exemple<br/><br/><br/>In Dice Of Olympus, you will be able to <strong>play 2 game modes</strong>. The <strong>Adventure</strong> mode that will propose you to fight monsters that escaped from the Tartarus prison. A <strong>multiplayer</strong> mode in 1 v 1 to play against your friends or players from around the world.", "metacritic": null, "released": "2023-07-15", "tba": false, "updated": "2023-07-17T05:01:04", "background_image": "https://media.rawg.io/media/screenshots/1a2/1a2b5ca112c40d1f0f286b013e281612.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bathyscaphe Studio"], "genres": ["Strategy", "Indie"], "publishers": ["Bathyscaphe Studio"], "esrb_rating": null}