{"id": 963548, "slug": "epic-rush-idle-pixel-rpg", "name": "Epic Rush - Idle Pixel RPG", "name_original": "Epic Rush - Idle Pixel RPG", "description": "Commander, congratulations on your appointment!<br/><br/>After the great war of antiquity, heroes destroyed the horde of monsters, and a long peace came.<br/>But the long peace became poison, and even if the monsters rise again, we only could fall back!<br/>Human, Orc, Dark Elf, Undead!<br/>Recruit heroes from all races and build an army<br/>Once again, please save this world with your strategy!<br/><br/>▶ Combine and Upgrade<br/>- There is no complicated growth process! Merge growth that becomes stronger by combining easily!<br/><br/>▶ Auto-battler game with Autochess style<br/>- Enjoy the Large scale battle with Easy one click.<br/>This game combines Autochess and Large scale battles.<br/><br/>▶ Various races and classes<br/>- Human, Orc, Dark Elf, Undead! Various classes of unique races!<br/><br/>▶ Enjoy as an IDLE<br/>With an auto-battle feature, enjoy as an IDLE and be easy to stronger!<br/><br/>▷Human- \"Maintain the battle line! Stop it with all your might!\"<br/>- The Human race has a barrier and is proud of its solid stamina.<br/><br/>▷Orc - \"Ancestors are with us! Charge!\"<br/>- The Orc race specializes in critical strikes and provides powerful attacks.<br/><br/>▷ Dark Elf - \"Show the savages a taste of mana!\"<br/>- The dark elf race can play flexibly with a fast mana supply.<br/><br/>▷ Undead - \"Let's give the living the fear of the dead!\"<br/>- Undead races have tenacious vitality and unique gimmicks.<br/><br/><br/>■ Community<br/>- Discord<br/>https://discord.gg/fajTPPqST8", "metacritic": null, "released": "2022-09-15", "tba": false, "updated": "2023-07-17T05:14:38", "background_image": "https://media.rawg.io/media/screenshots/533/5339021e8ac91f470c2c08073ed8373e_fTylZIA.jpg", "website": "http://www.kikike.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["kikike"], "genres": ["RPG", "Casual"], "publishers": ["kikike"], "esrb_rating": "Teen"}