{"id": 963517, "slug": "dragonspire", "name": "Dragonspire", "name_original": "Dragonspire", "description": "<strong>Dragonspire</strong> is an anime action roguelike where you can team up with friends to take on ever-evolving challenges. Prepare to enter the world of Asteria, slash your way through hordes of mobs, collect legendary loot, unlock new and incredible powers, challenge raid-like bosses, and so much more!<h3>Pick Your Hero</h3><strong>Choose</strong> your favorite playable character from a <strong>diverse arsenal</strong> of heroes! Breeze, Serena, and Naomi are just a few of the many heroes you will encounter (with more to come), each with their own unique personality, elemental affinity, and combat style.<br/><br/><br/><h3>Discover Powerful Crests</h3>With more than <strong>150 elemental crests</strong>, every run will introduce you to new <strong>destructive combinations</strong>. Coordinate with your allies to select complimentary crests and progress even further! Depending on which crests you possess, you may even encounter special, unique crests...<br/><br/><h3>Hatch Unique Companions</h3><strong>Uncover</strong> and hatch miracle eggs during your adventures. What's inside? <strong>Billions</strong> of possible pets! Each pet will provide different benefits to your heroes, as well as accompany you on the road ahead! Who knows? Maybe you'll hatch a mythical pet...<br/><br/><h3>Explore an Evolving World</h3>Across the map, players will be able to explore <strong>numerous different regions</strong>. Each one will have unique mobs and bosses that will offer players new and exhilarating experiences. After defeating each region’s boss, players will then be able to take on the ultimate challenge.<br/><br/><h3>Challenge Mighty Foes</h3><strong>Conquer</strong> the deepest reaches of Asteria where the <strong>enigmatic dragons</strong> reside. These beasts have a few tricks up their sleeves. Leave their trial victorious and receive <strong>magnificent rewards</strong>. Be careful though... One wrong move and you won't be coming back (oh, wait a moment... it's a roguelike, you will definitely be coming back).<br/><br/><br/><br/><br/>Thanks for supporting our first game as an indie studio! Please <strong>follow</strong> us on Twitter (<strong>@playdragonspire</strong>) for regular updates, and don't forget to tell your friends. ❤️", "metacritic": null, "released": "2023-07-14", "tba": false, "updated": "2023-07-17T04:35:40", "background_image": "https://media.rawg.io/media/screenshots/bb9/bb97b67df33059fa152e0c7f07cd8202.jpg", "website": "https://playdragonspire.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 295, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Starmi"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Starmi"], "esrb_rating": null}