{"id": 963529, "slug": "chemistris", "name": "chemistris", "name_original": "chemistris", "description": "<strong> CHEMISTRIS is a tetris-like game based on Chemistry equations, designed for geeks and science zealots like Sheldon Lee Cooper in all ages. </strong><br/><br/><strong> CHEMISTRIS is a hardcore game, and might be the hardest tetris-like game ever. Just remember the goal is to carefully arrange reactants and reaction conditions to generate specific products. </strong><h3> FUN BEYOND THE GREATEST COMPUTER GAME </h3><br/>Fun of arranging and destroying tetrominoes-like molecules with:<br/><br/><ul><li> A careful consideration not only about the stack of tetromino-like molecules but also the balance of chemistry equations. </li></ul><br/><ul><li> Modifications on rule of level to create completely different experience with same chemistry equations.  </li></ul><h3> REAL-WORLD KNOWLEDGE ARCHITECTURE OF CHEMISTRY</h3><br/>We humbling embrace the knowledge architecture of chemistry with:  <br/><br/><ul><li> Periodic-table-of-elements-like nonlinear level select system. </li></ul><br/><ul><li> An universal reaction algorithm equals chemistry equation itself. </li></ul><h3> STYLISH PIXEL ARTS </h3><br/>Simple, clear and elegant pixel style arts with: <br/><br/><ul><li> Brutalism pixel arts with KISS principle. </li></ul><br/><ul><li> Bravely new designed chemistris.font to display element clearly in tetrominoes. </li></ul><br/><h3>DISCOUNT STATEMENT</h3>CHEMISTRIS will NEVER discount more than 20% off.<h3>LANGUAGE STATEMENT</h3>CHEMISTRIS is guided entirely by graphics, and except from universally recognized element symbols and chemical equations, it does not include any text. Therefore, the game supports all languages.<h3>POGRESS STATEMENT</h3>CHEMISTRIS early access version is currently with 18 levels in 6 chapters.<h3>PERFORMANCE STATEMENT</h3>Due to the internal mathematical complexity, reaction algorithm might be very slow when molecules arranged badly.", "metacritic": null, "released": "2023-07-16", "tba": false, "updated": "2023-07-17T04:49:38", "background_image": "https://media.rawg.io/media/screenshots/f8e/f8ecc43eb017b6c896d17f1a6200056f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gamearning Studio"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Gamearning Studio"], "esrb_rating": null}