{"id": 963670, "slug": "build-and-drive-racing", "name": "Build and Drive Racing", "name_original": "Build and Drive Racing", "description": "Get ready for <strong>a new experience on Windows desktop and VR</strong>, <br/>where you get to build your ultimate racing machine, tailored to your driving style and optimized for performance, or race to the finish line with a monster what <strong>makes you smile.</strong><br/><br/><br/><br/><br/>Take on thrilling <strong>challenges to unlock</strong> a wide range of tracks, cars, and wheels. <br/>And here's the best part: this is just the beginning! As the very <strong>first early access</strong> version, you can <strong>expect regular updates</strong> featuring fresh challenges, exciting tracks, and cool cars. <br/><br/><br/><br/>Don't miss out on the <strong>special early access price</strong> as the game continues to grow and evolve!<br/><br/>With <strong>stylised graphics and arcade-like physics</strong>, every turn, straightway and ramp will put your skills to the test. <br/><strong>Feel the thrill of the race like never before in VR</strong>, as you immerse yourself counting the seconds on the home stretch.<br/><br/><br/><br/>So what are you waiting for? Get behind the wheel and start building your car today. <br/><strong>The race is on!</strong><br/><br/><strong>The game features:</strong><br/>- Challenge unlock system: complete challenges to unlock cars, wheels, levels<br/>- Game modes: race against your ghost and beat your best lap or race against AI opponents<br/>- Garage: customize your car<br/><br/><strong>Coming soon:</strong><br/>- UX improvements<br/>- New level and challenges<br/>- New cars and addons<br/>- New game modes", "metacritic": null, "released": "2023-07-18", "tba": false, "updated": "2023-07-21T04:18:04", "background_image": "https://media.rawg.io/media/screenshots/c6a/c6a470df7921a4514d08a115a53e9d28.jpg", "website": "https://buildanddriveracing.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 251, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VRdevelopment"], "genres": ["Sports", "Racing", "Casual"], "publishers": ["Phone Software"], "esrb_rating": null}