{"id": 963678, "slug": "my-lust-wish", "name": "My Lust Wish", "name_original": "My Lust Wish", "description": "My Lust Wish is an erotic role playing game, where you control Ashley, an innocent new student at Creamy Ridge College of Humanities. Step into her shoes, as she uncovers the mysteries of her succubus bloodline and her blossoming lust for sex.<br/><br/>Meet various NPCs around town, take on different part-time jobs, study, and learn local history. Learn new skills and abilities, try out different outfits and looks, lift weights, gain or loose weight, and explore different sexual fetishes and kinks. Evolve from an inexperienced virgin to a hardcore sex addict.<br/><br/><br/><br/><br/><ul><li>Several unique NPCs to talk to and have sex with.<br/></li><li>Multiple different questlines to undertake.<br/></li><li>Sexual content such as exhibitionism, group sex, bondage, and tentacle sex.<br/></li><li>Different outfits to wear and hairstyles to try out.<br/></li><li>Take care of Ashley's needs.</li></ul><br/><br/><br/><ul><li>Privacy system - Where you are and what you're wearing will have a difference! But beware, being gawked at and wearing as little as possible all the time might turn you into an exhibitionist...<br/></li><li>Temptation mechanics - Being aroused or constantly lustful might have some unexpected downsides (or upsides).<br/></li><li>Skill trees - Different abilities might give you different ways to solve some quests, whether it's by magic or by friction.<br/></li><li>Upcoming sexual content includes acts such as public use, humiliation, domination and submission, more sexual acts, futa, watersports, and more!</li></ul><br/>Mature Content:<br/>All characters depicted in this game are over 18. This game portrays various types of sexual acts and aspects of BDSM. All sexual acts within the game are consensual but some can't be skipped by the player.", "metacritic": null, "released": "2023-07-18", "tba": false, "updated": "2023-07-21T04:29:01", "background_image": "https://media.rawg.io/media/screenshots/fce/fce36c2651ed5f0864e022d152c7450a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["My Lust Wish"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Indie"], "publishers": ["My Lust Wish"], "esrb_rating": null}