{"id": 963680, "slug": "coreborn-nations-of-the-ultracore", "name": "Coreborn: Nations of the Ultracore", "name_original": "Coreborn: Nations of the Ultracore", "description": "Step into the world of Tormentosia, where long-standing tensions between the various races have led to unending conflict. The situation reached a fever pitch when Sorgoth the Devourer invaded the land, causing near-total destruction. <br/><br/>In a last-ditch effort to save what remains, the six remaining kingdoms united their power and resources to create a groundbreaking new technology - the Ultracore. <br/><br/>But don't be deceived, as darkness seeps into the edges of the seemingly safe lands. Your generation inherited this world. You're all Coreborn. Your goal? Reclaim. Rebuild. Restore.<br/><br/><br/><br/><br/><br/><br/>Claim the Land as Your Own: Create a thriving home for yourself and your friends. Repel the evil forces and defend your town. Survive against Sorgoth’s minions and never let your guard down.<br/><br/>Become a Valued Member of the Community: Learn a variety of professions and train to become an expert. Help out all those that you can and become an important and valued member of your community.<br/><br/><br/><br/><br/><br/><br/><br/>Get ready for Challenging Adventures: Cooperate with other adventurers in PvE online play to claim back the land from Sorgoth’s forces. Gather loot and use it to create new armor and weapons. The strongest will survive to take on the land's many challenges including exciting adventures with valuable prizes!<br/><br/>Gather Resources and Build Up Your Defenses: Gathering resources is key to defending yourself in Coreborn. Utilize hundreds of individual recipes and build up structures to withstand the endless waves of Sorgoth’s minions. Gather with your friends to yield even higher resources and rewards.<br/><br/><br/><br/><br/><br/><br/><br/>Cooperate With Players All Over the World: Travel to Coreheim and meet players from all over the world. Trade items, get resources, find new companions for adventures or simply enjoy their company during seasonal events and festivities. <br/><br/>Uncover the Lore of Tormentosia: The more you explore, the more you’ll uncover about this diverse land. Discover hidden lore sights with special enemies and resources and piece together all you can about the history of Tormentosia.<br/><br/><br/><br/><h3>Discover even more:</h3><br/><ul><li>Build relationships with friends from other nations to use synergies in combat. <br/></li><li>Discover hidden lore sights with special enemies and resources.<br/></li><li>Face the elements and shield yourself from the external influences of the harsh environment.<br/></li><li>Evolve in your trained profession and become a valued member of your town community.</li></ul>", "metacritic": null, "released": "2023-07-18", "tba": false, "updated": "2023-07-21T04:32:13", "background_image": "https://media.rawg.io/media/screenshots/d35/d3525cd97d1f3a6797a5c71e87d913e8.jpg", "website": "https://coreborn.gg", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 497, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blankhans"], "genres": ["Action", "Adventure", "RPG", "Massively Multiplayer", "Indie"], "publishers": ["Blankhans"], "esrb_rating": null}