{"id": 963618, "slug": "west-ride", "name": "West Ride", "name_original": "West Ride", "description": "<strong>Embark on a thrilling journey in West Ride </strong><strong>An open-world sandbox driving game</strong><br/><strong>Description</strong><br/>      The year is 2199, and an immense energy source has been discovered near planet \"Haucury-A709\". You've been assigned the critical task of locating and gathering valuable data on this energy. However, as you approach the source in your spaceship, a powerful energy surge disrupts your radar and scanners, causing a disastrous collision with an asteroid. Your ship's engine is destroyed, forcing an emergency crash landing on a mysterious planet. With your ship and cargo lost, only one vehicle remains intact. It's up to you to drive through this strange world, find a safe haven, and unravel the secrets that lie within.<br/><br/><strong>Gameplay</strong><br/>      In West Ride, you'll start on sandbox missions to earn gears, which can be used to purchase new vehicles and upgrade them. Each mission will test your driving skills as you navigate through diverse and challenging landscapes. However, be prepared to face a variety of anomalies that hinder your progress. These anomalies possess unique effects, some may damage your vehicle or toss you off-course, while others can teleport you to different locations or provide an exhilarating nitro boost. Along your journey, explore the vast world to uncover hidden treasures, adding another layer of excitement and discovery.<br/><strong>Key Features</strong><br/><ul> <li>Immerse yourself in the captivating anime-style graphics that bring West Ride's world to life.<br/> </li><li>Enjoy over 40 diverse and dynamic background music tracks that will enhance your anime-inspired gameplay experience.<br/> </li><li>Traverse a wide range of stunning environments, from desert dunes and wastelands to lunar landscapes and towering mountains.<br/> </li><li>Take on a multitude of sandbox missions, each offering unique challenges and rewards.<br/> </li><li>Purchase a variety of vehicles and upgrade them to unleash their full potential.<br/> </li><li>Brace yourself for radioactive storms that intensify the danger and excitement of your journey.<br/> </li><li>Encounter anomalies that both impede and aid your progress. be strategic in navigating their unpredictable effects.<br/> </li><li>Unearth hidden treasures scattered across the lands, rewarding those with a keen eye for exploration</li></ul> <br/>", "metacritic": null, "released": "2023-07-17", "tba": false, "updated": "2023-07-21T03:03:04", "background_image": "https://media.rawg.io/media/screenshots/325/3250d9ce9e135bcced7385e7efb82d3e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sunil Sutariya"], "genres": ["Adventure", "Simulation", "Racing", "Casual", "Indie"], "publishers": ["Sutariya Studios"], "esrb_rating": null}