{"id": 963650, "slug": "quan-shen-deihuendazu-soul-dog-td", "name": "犬神ディフェンダーズ / Soul Dog TD", "name_original": "犬神ディフェンダーズ / Soul Dog TD", "description": "<h3>\"One More Game\" will Turn into a Hundred!</h3><h3>Game Overview</h3>Fight off hoards of foes with the titular Soul Dog and six units in this tower defense game.<br/>Defeat enemies before they reach your leader and collect the souls they drop.<br/>Use those souls to upgrade your units and take down all 30 waves!<br/><br/><h3>The Soul Dog, a.k.a. \"Inugami\"</h3>The Soul Dog possesses the unique ability to collect spirits that appear when you defeat enemies.<br/>Make sure to collect every last soul, as they can be used to strengthen your army!<br/>However, while you collect souls, your army will be left defenseless. Timing is key!<h3>Soul Boons</h3>When picking up a soul, you will get to choose one of three random items known as Soul Boons.<br/>Choose the items best suited to your units and make your army a force to be reckoned with!<h3>Know When to Strike</h3>Your army consists of six units, each of whom can switch between <strong>attacking</strong> and <strong>training</strong>.<br/><br/><br/><br/><br/><br/><strong>Attack Mode</strong><br/>Units will attack automatically.<br/><br/><strong>Training Mode</strong><br/>Units will gain EXP and level up. However, they cannot attack while training.<br/><br/>Learn to attack with exactly the right number of units to defeat the enemy while the rest train and level up. Striking the right balance between attacking and training will be vital to your victory!<h3>The Skill Tree</h3>Money earned from battle can be used to increase your army's strength via the skill tree.<br/>Acquire useful and powerful skills to buff up your units!<br/><br/><h3>Survive 30 waves of enemies by learning the ins and outs of battle, training your units, and collecting souls!</h3>", "metacritic": null, "released": "2023-07-17", "tba": false, "updated": "2023-07-21T03:49:22", "background_image": "https://media.rawg.io/media/screenshots/428/428ed018ec407d006989e094458dbe0e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Libragames"], "genres": ["Strategy"], "publishers": ["Libragames"], "esrb_rating": null}