{"id": 963602, "slug": "gluua", "name": "Gluua", "name_original": "Gluua", "description": "Every place has a story.<br/>   Gluua is a first-person 1-4 multiplayer horror game. The game will allow players to take on the role of a spirit liberator who will be able to choose missions according to the difficulty and readiness that they like or want to do freely. Players will encounter various stories and find the truth in that place. And the supernatural that will chase, harass and injure the player requires you to find a way to survive in that mission.<br/><br/><br/> <br/>• Players take on the role of a detective about horror stories and strange things that happen in that place. In each location, each mission, players will be immersed in the atmosphere and being chased by the threat of the supernatural. The goal is to solve the case and defeat the evil in the locality.<br/><br/><br/><br/>• Players can customize the equipment to their own preferences to enhance their abilities and enhance their playstyle. Being prepared is important, so you need to constantly check yourself and your friends how prepared you are for the chosen mission.<br/><br/><br/><br/>• Various missions and stories are ready for you to experience. Every place has a story, but it's up to you to decide what kind of story it takes.<br/><br/><br/><br/>• Gives players the freedom to explore and decide on missions. You can choose how much is enough or finish the mission at any time according to your ability.<br/><br/><br/><br/>", "metacritic": null, "released": "2023-07-18", "tba": false, "updated": "2023-07-21T02:43:01", "background_image": "https://media.rawg.io/media/screenshots/7bf/7bfe765fe0bc97a644e197542cee8948.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 469, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Knarl Studio"], "genres": ["Simulation", "Indie"], "publishers": ["Knarl Studio"], "esrb_rating": null}