{"id": 963622, "slug": "moving-down", "name": "Moving Down", "name_original": "Moving Down", "description": "The game tells the story of a young couple who recently married and started living together. It would seem that nothing should interfere with family happiness, but life circumstances and surrounding people will gradually push the wife of the main character to the idea of non-standard relationships in marriage, where she tries on the role of a dominant, the role of a Mistress ...<br/><br/>In this game, you will encounter horrible things, and you will have to make a choice between \"bad\" and \"very bad.\" The protagonist in you will have to go through some unpleasant moments, which will surely leave a mark on your memories.<br/><br/>The game touches the basest of human feelings, and not everyone can survive it to the end. The story focuses on vices that are not commonly discussed in modern society and that may seem unacceptable. Still, something will keep you coming back there if you are a true connoisseur of such perversions.<br/><br/><strong>The fetishes and kinks that are presented in the game:</strong><br/>BDSM<br/>Female domination<br/>Lesbian<br/>Blackmail<br/>Footjob<br/>Foot fetish<br/>Humiliation<br/>Sexual harassment<br/>Slave<br/>Sex toys<br/>Spanking<br/><strong>The following tags are optional and you can skip this content:</strong><br/>Pegging<br/>Cuckold<br/>Urination<br/>Gay<br/>Scat<br/>The game is all about female domination over a man, and as the story progresses, this theme becomes increasingly overplayed. The protagonist will face real violence and enslavement by his wife, and the player, that is you, will have to experience it together with him.<br/>", "metacritic": null, "released": "2023-07-17", "tba": false, "updated": "2023-07-21T03:09:48", "background_image": "https://media.rawg.io/media/screenshots/a7e/a7e6cdb2e63078f1ce8df0876a3ade70.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 466, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Hard Femdom Games"], "genres": ["Indie"], "publishers": ["Hard Femdom Games"], "esrb_rating": null}