{"id": 963765, "slug": "v-art-vr-painting-studio", "name": "V-Art- VR Painting Studio", "name_original": "V-Art- VR Painting Studio", "description": "I made this game as spin-off of another project that unfortunately got canned, but I thought the painting aspect was pretty cool so I decided to release it as its own standalone game. It's a simple lighthearted painting simulation with several different brushes all with their own physics-based behavior, so you can really mess around with them and see what kind of cool effects you can create.<br/><br/>Really, there's no pressure to create anything 'good' or 'professional'. It's just a fun way to mess around with different colors and textures. Plus, there's an optional DLC if you want to support me that lets you paint on a 3D character model. I'll just say, it's pretty fun to see your creations come to life on a more tangible canvas.<br/><br/>But again, just to be clear, this game isn't meant to be a professional tool for artists, there are better tools for that.<br/>Still, though it's not a professional tool, I think you'll be able to create some amazing pieces of art.<br/><br/>It's not the most advanced painting game out there, but it's free and it's a fun way to explore your creativity. Give it a try and see what you can come up with.<br/><br/>Some notable features:<br/>-Physically controlled arms and objects really connect you to the canvas, or, mess you up when your hand wibbles, you choose<br/>-Dynamic paint wetness that dries over time<br/>-Simulated brush texture gives your strokes character<br/>-Spray paints and blobs that drip when they pool up<br/>-Mix paints on your palette so you can pretend like you aren't already living in a simulation<br/>-Some of the paint dried up, so we recycled it into goo. By this, I mean for some reason you can drip goo onto your canvas. Or just play with it like slime, everyone loves slime<br/>-Paint all the walls and floor to give your studio a personal touch<br/>-Display your created works upon the walls like your own miniature art gallery<br/>-An inexplicable cellular device that allows you to capture stereoscopic renders of your work<br/>-Import your own brush textures for unique styles<br/>-Add custom stencils so you can follow along with that one Bob tutorial where he starts with a perfect circle for the sun<br/>-An ancient flatscreen television from the past that has been retrofitted with the latest YouTube playing capabilities, so you can watch Mr. Ross paint faster than you while you try to keep up<br/>-Menus<br/>-Paint inside the safety of your studio that you'll notice, has no doors. This is intentional and not cause for concern. Alternatively, drop the walls (literally) and behold a lush grassy field powered by the future technology of GrassFlow™. Do note, you will still be trapped inside the studio despite it appearing as if you may actually walk into the wilderness, we apologize if the simulation appears too real.<br/>-Seamless autosave relieves you of the stress caused by imminent data loss. Or overwrite your work so you can live with all your happy little accidents<br/>-A mysterious <strong>orb</strong><br/>-Strange dystopian future where painting supplies are dispensed out of thin air from manually operated vending machines powered by lever action<br/>-Am I talking the features up too much? Probably.", "metacritic": null, "released": "2023-07-20", "tba": false, "updated": "2023-07-21T06:35:55", "background_image": "https://media.rawg.io/media/screenshots/eaa/eaa18e668fda02a0321d7d7a55dcfad2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bolt-Scripts"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Bolt-Scripts"], "esrb_rating": null}