{"id": 963725, "slug": "crystal-tower-defense", "name": "Crystal Tower Defense", "name_original": "Crystal Tower Defense", "description": "In Crystal Tower Defense you stop an endless amount of crystal-type enemies from reaching the portal to Earth. To achieve this goal you can build your own labyrinth using turrets and walls as well as selling obstacles on the map. You will need to stay alert since the enemies grow stronger the longer you defend the portal. Upgrade your turrets and alter the labyrinths layout to adapt to the new challenges.<br/><br/><br/><br/><br/>Enemies will follow the path YOU create! This challenges you to experiment with different labyrinth layouts. The map, with its randomly generated obstacles, will tickle your strategic thinking every time you jump into a run. Remove map obstacles to open up new possibilities during a run and restructure your labyrinth to use each of your turrets to its full potential.<br/><br/><br/><br/><br/>As you progress through the stages, you can <strong>unlock 10 turrets</strong>.<br/>You can upgrade each turret's main stats in a run. The required gold is earned through destroying the enemies.<br/><br/><ul><li>Range</li><li>Damage</li><li>Reload Time</li></ul><br/><br/><br/><br/>Use <strong>6 different abilities</strong> to support the turrets in your labyrinth and fend off the enmies.<br/><br/><br/><br/><br/>Each enemy has a chance to drop crystals! These crystals are your primary currency and are used to unlock new and different turrets, as well as permanently upgrade them. Completing a stage rewards you with a big crystal that holds permanent upgrades for your turrets! You can equip these upgrades in the armory. <br/>These big crystals can only be obtained playing the game. After each stage you get rewarded one big crystal. To claim them, you need to end your run manually, if you run out of lifes, you lose all your gathered rewards.<br/>The higher the cleared stage is, the better are the rewards. The drop chance of each rarity, per stage, can be found in the menu.<br/><br/><br/><br/><br/>The forge gives you the possibility of merging your hard-earned upgrades, to achieve bigger and better bonuses. Combine a multitude of possible items and find the best possible upgrade path!<br/>Combining your upgrades always results in a better bonus. Combine multiple of the same, to decided the result type.<br/><br/><ul><li>Range</li><li>Damage</li><li>Reload Time</li><li>Cost Reduction</li></ul>", "metacritic": null, "released": "2023-07-19", "tba": false, "updated": "2023-07-21T05:39:56", "background_image": "https://media.rawg.io/media/screenshots/437/437511ae143ec4ce1ffbfbdbcca2b5e6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 317, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hot Roof Studios"], "genres": ["Strategy", "Casual"], "publishers": ["Hot Roof Studios"], "esrb_rating": null}