{"id": 963763, "slug": "lost-crystals-2", "name": "Lost Crystals", "name_original": "Lost Crystals", "description": "Welcome to the enchanting world of <strong>Lost Crystals</strong>, a mesmerizing and relaxing item hunt game that will take you on a captivating journey through a foggy valley. Embark on an adventure of serenity as you explore the mystical fog and traverse overgrown paths in search of precious gemstones.<h3>Key Features</h3><br/>🔍<strong> Immersive Gemstone Hunt:</strong> Seek out a plethora of exquisite treasures, including dazzling gemstones like Sapphire, Jade, Ruby, Amethyst, Moonstone, and more. Uncover hidden crystals to unravel the secrets of this mysterious realm.<br/><br/>🌄 <strong>Breathtaking Visuals:</strong> Get lost in the stunning beauty of the fog-shrouded valley, with ethereal fog effects and meticulously crafted environments that immerse you in a captivating atmosphere.<br/><br/>🎶 <strong>Soothing Atmosphere:</strong> Experience tranquility with the soft sounds of nature and a soothing musical score that enhance the relaxing gameplay. Let the stress melt away as you lose yourself in the serene world of Lost Crystals.<br/><br/>🗺️ <strong>Mystical Exploration:</strong> Navigate through overgrown paths, dense foliage, hidden alcoves, and ancient ruins. Each location tells a story and adds layers of intrigue to your journey.<br/><br/><strong>Embark on a Serene Adventure</strong>", "metacritic": null, "released": "2023-07-20", "tba": false, "updated": "2023-07-21T06:32:45", "background_image": "https://media.rawg.io/media/screenshots/ee2/ee2840571c65f56d7c67a22e3a9d15d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Morning Shift Studios"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Morning Shift Studios"], "esrb_rating": null}