{"id": 963744, "slug": "homeseek", "name": "Homeseek", "name_original": "Homeseek", "description": "Overpopulation, environmental exploitation, and a complete disregard for nature has resulted in the depletion of drinkable water, leading to the collapse of civilization as we know it. It’s up to you to lead a group of survivors to a place where they can rebuild, but it won’t be easy. In a dried-up wasteland where water has become the new gold, every choice becomes life or death. With your guidance, survival just might be within reach.<br/><br/>Homeseek features <strong>2 Campaigns spanning over 9 scenarios</strong>, each of which can be played in <strong>Story Mode, Endless Mode, and Survival Mode</strong> providing dozens of hours of gameplay. On top of that, <strong>Online Multiplayer</strong> mode will offer you the chance to compete against other players to determine who is the ultimate survivor.<br/><br/><br/><br/>Expanding your settlement has to be done judiciously, lest you outpace the production of scarce resources in the area. The location of your buildings in relation to these valuable reserves plays a crucial role in the settlement’s efficiency.<br/><br/><br/><br/>Improve your settlers’ knowledge and machinery in order to make the most of what little resources they have. Research carefully, choosing the most important advancements to chase for your settlers’ needs, and take that knowledge with you.<br/><br/><br/><br/>Uncover meaningful stories through expeditions, events, and quests. You’ll be faced with difficult dilemmas and dangerous foes, but what you bring back could mean life or death for your settlement. Each in-game choice brings with it consequences that can make or break the success of your settlers in their quest for survival.<br/><br/><br/><br/>Compete against other players in a survival scenario where you do what you have to succeed in this harsh and unforgiving world. Sabotage their buildings, steal their resources, and force them into starvation before they do the same to you.", "metacritic": null, "released": "2023-07-19", "tba": false, "updated": "2024-03-09T18:51:58", "background_image": "https://media.rawg.io/media/screenshots/bec/becc8aefff655f65ed8fffab2bbd5de0.jpg", "website": "https://homeseekgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "beaten": 1, "toplay": 1, "dropped": 2}, "playtime": 2, "achievements_count": 54, "ratings_count": 3, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Traptics"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["The Iterative Collective"], "esrb_rating": null}