{"id": 963770, "slug": "solar-systems-for-kids", "name": "Solar Systems For Kids", "name_original": "Solar Systems For Kids", "description": "<h3>Overview</h3><br/>A family friendly casual game that teaches children about the Solar System. Your child, or yourself as an adult if you like the Sun and our planets, can load up the Solar System diagram which displays the main elements of the solar system such as the Sun, Earth, the Asteroid and Kuiper belts, and some of the lesser known elements such as the Solar System's dwarf planets. The more advanced system has a more realistic touch! The planets are to scale and so is their distance and orbit, albeit the orbits lay on a flat plane.<br/><br/>Your child will also be able to create their own Solar Systems! They have a choice between an Orange, Blue or Green star, as well as a more advanced version of star creation where they can choose their own colors. Depending on the age of the child, adult assistance may be needed. The creation of planets consists of choosing a size for the planet, distance from the star, speed of orbit, and particular attributes depending on the type of planet you or your child want to create.<h3>Gameplay</h3>Enjoy learning about the Solar System visually and with full English voice acting.<br/>Create your own Solar Systems for fun to experience a visually stimulating outer space simulation!<h3>Features</h3><ul><li> HD graphics of our Solar System that can be played on almost any computer<br/></li><li> Attractive graphics that you or your child will enjoy<br/></li><li> Unlimited creation of new Solar Systems<br/></li><li> Customizable stars and planets<br/></li><li> Multiple types of planets to choose from<br/></li><li> Multiple soundtracks to choose from<br/></li><li> Steam cloud support</li></ul><h3>Playability</h3>Please see the FPS table below to get a sense of gameplay smoothness you may experience.<br/><br/><br/><strong>FPS Table</strong><br/><br/><br/>Note 1:<br/><ul><li> GLT: Game Loading Time. Format is  First value (t1) indicates the time it takes for screen to display the game minus the logo. The second value (t2) indicates the loading time plus logo display; that is when you have control.<br/></li><li> N/P: Non Playable. RAM is too low for a smooth play experience with GFX quality of Medium+ (freezes or sluggish performance would result). GFX setting of Low / Very Low is recommended. Virtual memory increase is also recommended to at least 8,192MB.<br/></li><li> All Win 11 OSs are played on 1080p while all Win 10 OSs are played on a 1680 x 1050 resolution.</li></ul><br/>Note 2:<br/>All settings that can drain FPS have been turned on (Anti-aliasing and Bloom). FPS should increase if these features are turned off.<br/><br/>Note 3:<br/>No hardware has been overclocked. All hardware settings are stock / original. All machines have the latest OS update and drivers installed as of the date of testing (June 30, 2023).", "metacritic": null, "released": "2023-07-20", "tba": false, "updated": "2023-07-21T06:45:07", "background_image": "https://media.rawg.io/media/screenshots/1c5/1c5ebf4ffaa3ee40a32ccd54bf6aa779.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 357, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SRM Games"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["SRM Games"], "esrb_rating": null}