{"id": 963706, "slug": "lovely-links", "name": "Lovely Links", "name_original": "Lovely Links", "description": "This is a classic puzzle game where the goal is to eliminate all blocks within the given time and unlock beautiful CG images. In the game, there are three power-ups available: Bomb, Hint, and Refresh. Let's learn about the gameplay together!<h3>Gameplay Rules:</h3><br/>  Within the game area, there are blocks arranged in a grid, each with different patterns or symbols.<br/>  You need to find blocks with the same pattern or symbol within the grid and eliminate them to clear the entire game area.<br/>  You can connect two identical patterns or symbols by drawing a straight line, with turns only allowed in horizontal and vertical directions and without crossing other blocks.<br/>  Once two matching patterns or symbols are connected, they will disappear, and the corresponding blocks will be removed, leaving an empty space.<br/>  By eliminating all blocks within the given time, you can unlock a beautiful CG image and receive a random power-up as a bonus.<h3>Power-up Introduction:</h3><br/>  Bomb Power-up: Use the bomb power-up to eliminate all blocks of the same kind at once, helping you quickly clear challenging-to-connect blocks.<br/>  Hint Power-up: Use the hint power-up to receive a clue on connecting blocks, guiding you to find matching patterns.<br/>  Refresh Power-up: Use the refresh power-up to rearrange the positions of the blocks, providing you with new elimination possibilities.<br/><br/>  Utilize the power-ups strategically during the game, eliminate all blocks within the given time, unlock beautiful CG images, and receive additional power-up rewards. Come and challenge your Connect Link skills! Enjoy the game!", "metacritic": null, "released": "2023-07-19", "tba": false, "updated": "2023-07-21T05:11:49", "background_image": "https://media.rawg.io/media/screenshots/7be/7be52a5a42aa03a1ad89feefeefb51ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LL Games"], "genres": ["Racing", "Casual", "Indie"], "publishers": ["LL Games"], "esrb_rating": null}