{"id": 963730, "slug": "magical-girl-dash", "name": "Magical Girl Dash", "name_original": "Magical Girl Dash", "description": "<h3>Magical Girl Dash</h3><br/><br/><br/>Magical Girl Dash is a retro arcade where you control Sophie, a normal student, but secretly she is also a magical girl fighting against evil forces that threaten the world! Defeat alien cats swarming throughout the city in a runner style game. Sophie have 2 special moves, a long range magical attack and a powerful short distance klck. Watch out as some enemies may only be defeat if one of the two types of attack!<h3>Features</h3><br/><ul><li>Run and Shoot - run and jump, dodge and shoot. Keep running and increasing your score for the longer time you can manage while you shoot evil alien cats with your magical powers. <br/></li><li>Cute Magical Girl Game - Style inspired on the classic genre of Magical Girl. Do you have a never ending passion of Sailor Moon, Precure, Card Captors Sakura and other magical girl related media? If yes you will definitely enjoy Magical Girl Dash!<br/><br/></li><li>Save the Bakery - Evil aliens stole all the recipes from Sophie's favorite bakery. This is a great disaster! Help her finding all recipes and protect the bakery from bankruptcy at all costs!<br/><br/></li><li>Retro Art - Charming and beautiful 16-bit pixel art style.<br/><br/></li><li>Online and Local Highscore - Defeat enemies, collect stars and find sweets to increase your score. Try to beat your personal score and aim for the global highscore.<br/><br/></li><li>Multiple powerups - find powerups that makes the magical attacks more powerful! Triple shot, homing bullet, large shot. Find as many as you can to increase your firepower and chances of survival!<br/></li></ul><br/>", "metacritic": null, "released": "2023-07-19", "tba": false, "updated": "2023-07-21T05:47:25", "background_image": "https://media.rawg.io/media/screenshots/823/823f495d4951604135485342445ff9c2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Synnergy Circle Games"], "genres": ["Racing", "Casual", "Indie"], "publishers": ["Synnergy Circle Games"], "esrb_rating": null}