{"id": 963727, "slug": "knightmares", "name": "Knightmares", "name_original": "Knightmares", "description": "<h3>Knightmares, the Ultimate Deckbuilding Adventure! </h3>Prepare to embark on an epic journey into a world filled with darkness, strategy, and the power of fusion. In this groundbreaking deckbuilding game, you'll have the opportunity to create the most formidable combinations imaginable, all while battling against the relentless nightmares that haunt the land.<br/><br/>Knightmares offers a vast array of cards, each with its own unique abilities and strengths. As you progress through the game, you'll discover new cards to add to your ever-growing deck, allowing for endless possibilities and customization. The strategic choices you make during deck construction will determine your chances of success as you face off against the nightmares.<br/><br/>One of the most exciting features of Knightmares is the fusion system. By combining specific cards in your deck, you can unlock even more powerful combinations and abilities. Experiment with different fusions to find the perfect synergy and unleash devastating attacks upon your enemies.<br/><br/>But be warned: the nightmares you'll encounter are not to be taken lightly. Each nightmare possesses its own set of challenges and requires careful planning to overcome. Your deckbuilding skills will be put to the test as you strategize your way through intense battles and unlock new levels of power.<h3>Features:</h3><ul><li> More than 100 cards to fuse.<br/></li><li> More than 80 fusions to discover.<br/></li><li> A wide variety of decks.</li></ul><br/>Project made for the B.A. in Interactive Product Design degree of U-tad, University of Technology, Arts and Design.<br/><br/>", "metacritic": null, "released": "2023-07-20", "tba": false, "updated": "2023-07-21T05:42:27", "background_image": "https://media.rawg.io/media/screenshots/9cf/9cff49ef041ca0935d8e355678e355d4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["64 Lightning Games"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Casual", "Indie"], "publishers": ["U-tad", "64 Lightning Games"], "esrb_rating": null}