{"id": 963867, "slug": "chester-into-the-light", "name": "Chester: Into The Light", "name_original": "Chester: Into The Light", "description": "<h3>Your once favorite toy \"Chester\" has begun hunting your dreams. Find a way to wake up each night before you're found.</h3><br/><br/><br/><h3>Every nightmare has a way out. Complete puzzles, avoid Chester, and get the red door open without getting caught.</h3><br/><br/><br/><h3>Always be alert! Explore your dreams and find useful items, contraptions, hiding spots, and toys to help keep you safe.</h3><br/><br/><br/><h3>Chester dwells in the darkness. Use the light to keep him away, and to guide your way out of the nightmares.</h3><h3>Gameplay Info:</h3><br/><strong>Chester: Into The Light is a full length story driven horror game about fear, and prison of the mind many of us struggle to escape from. Step into the shoes of James, a young child who's tormented by a horrific monster. James' severe fear of his once favorite plush toy named \"Chester\" has bled into his dreams, and is rapidly feeding off of his misery. Endure through the terror and uncover the truth about Chester, and what really lies within yourself.</strong><br/><br/>EPILEPSY WARNING: Chester: Into The Light features flashing screens, bright lights, and disorienting visual effects. Please consult your doctor before playing if you have a history of epilepsy.<br/>COLOR BLINDNESS WARNING: Some areas of the game require the player to differentiate between colors to proceed.", "metacritic": null, "released": "2023-07-21", "tba": false, "updated": "2023-07-24T03:12:00", "background_image": "https://media.rawg.io/media/screenshots/8cb/8cbfb57ebcd3e59826c59f8b05aaf66b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Daniel George"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Daniel George"], "esrb_rating": null}