{"id": 963824, "slug": "sex-dating-on-mars", "name": "Sex Dating On Mars", "name_original": "Sex Dating On Mars", "description": "Welcome to Mars, the red planet, where <strong>love and desire </strong>is the ultimate frontier. In <strong>\"Sex Dating On Mars\"</strong> embark on an extraordinary journey as an intrepid adventurer in search of love and desire in the vast expanse of humanity's new home. This thrilling PC game combines the challenges of Martian survival with the excitement of dating in an immersive sci-fi setting.<br/>As a lone explorer on Mars, you find yourself in a bustling city brimming with unique personalities, each with their own dreams, secrets, and desires. Your objective? <br/>To find female friends, build relationships and uncover the secrets that are found under the clothes of the pretty Martian women.<br/><h3>But be warned: </h3>Will you be able to handle the intense sexuality of the beautiful and strong women on Mars?<br/>The path to love on Mars is not too easy. You'll need to navigate short conversations, make simple choices, and solve easy puzzles to win the hearts of your potential partners. <br/><br/>With your charm and charisma, you are sure to attract your dream women and embark on intimate adventures together.<br/><br/>Prepare yourself for an unparalleled experience on the Red Planet. Will you discover love and desire amidst the stars, or will the harsh realities of Mars prove insurmountable? The future of romance and intimacy lies in your hands.<br/><br/><strong><h3>This game contains the following features:</h3></strong><h3>An easy-to-learn Sex Dating Game!</h3><br/><ul><li> Skill Upgrades and exciting Extras!<br/></li><li> Four levels of Sex Dating (Normal Date, Private Date, Foreplay Date, Sex Date)<br/></li><li> When you reach the ultimate thrill in your Sex Date, a unique sex scene will unfold!</li></ul><h3>A Shooter Game where you defend Mars against enemy Monsters!</h3><br/><ul><li> Defeat enemy Monsters to earn Reputation (Steam Trophies)<br/></li><li> Collect Info Crystals to exchange for Upgrades.<br/></li><li> Utilize the credits dropped by enemies in the City to purchase Gifts for your Girlfriends or visit one of the establishments!</li></ul><h3>Embark on a Romantic and Sensual Adventure:</h3><br/><ul><li> Indulge in the company of up to 12 captivating Martian Girls, following all the sensuous rules of erotic art. From tender embraces to erotic encounters!<br/></li><li> Acquire lifelike sex robots and enticing cyborgs. Once purchased, they will be eagerly waiting in your bedroom to satisfy your desires.<br/></li><li> Explore the \"Cyberpunk City\" on Mars in search of new erotic acquaintances!</li></ul><br/>### Attention ###<br/>- This Game is only for Adults!<br/>- Naked adult people are shown in this game! <br/>- Masturbation and sexual intercourse is shown!<br/><br/>", "metacritic": null, "released": "2023-07-22", "tba": false, "updated": "2023-07-24T02:12:20", "background_image": "https://media.rawg.io/media/screenshots/09b/09b2ee5000a018aef38cd56164391b0b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 525, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CritoGames"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["CritoGames"], "esrb_rating": null}