{"id": 963891, "slug": "my-hypnotized-family", "name": "My Hypnotized Family", "name_original": "My Hypnotized Family", "description": "<h3>“My Hypnotized Family”</h3> <br/>“My Hypnotized Family” is an adult choose-your-own-adventure hand-drawn visual novel, where nothing is off limits.<br/><br/>You play as a young psychology major, who manages to lose his job, his girlfriend, and a place to live. You are forced to go back to live with your family: your mom, hot curvy MILF nurse in her 40s and your two very different sisters. Your older sister Helen hates your guts, dresses in gothic style and has the roundest sexiest big ass you've ever seen. Your younger sister Lucy is much more naïve, sweet, and kind. She is very close to you and loves candy, stuffed animals, and pink. Her perky breasts constantly distract you from helping her do her college homework. <br/><br/>Mom introduces you to her friend Stella, a local hypnotherapist, and being a psychology graduate, you are hired as her assistant. Every day you observe how she hypnotizes her patients. The more you see her do it, the more tempting it becomes to hypnotize the women in your family to become yours and yours only...<br/><br/>Will you use the power of hypnosis to turn family love into sexual passion?<br/><br/>Will you make them your willing passionate lovers or your mind-broken slaves?<br/><br/>Will you unleash their repressed desires unleashed in a tale of incest, corruption and mind control?<br/><br/>Only you choose what happens with every girl: from sensual lovemaking to pregnant fetish-filled orgies.<br/><br/>This is not just about sex and power - it's about emotions and choices.<br/><br/>The art, the story and code are all created by humans (no AI was used while making the game)<br/><br/>You're not just playing, you're shaping the story, by making choices along the way.<br/><br/><strong>Warning! This is very heavily adult content, full of sexual fantasies!</strong><br/><br/>Fetishes in the game include:<br/>Incest, Mind control, Milf, Vaginal sex, Handjob, Voyeurism, Corruption, Male protagonist, Big ass, Big tits, Oral sex, Male domination, Masturbation, Pregnancy, Slave, Sex toys, Squirting, Lesbian, Harem<br/><br/>P.S. The game will not have NTR (only some optional lesbian stuff, easily avoided), and there are love routes for all characters, where they are happy and retain their personality and agency. Dad is not in the picture since mom divorced him years ago, got the house and small alimony in a difficult legal battle, and there is no communication with him.", "metacritic": null, "released": "2023-07-23", "tba": false, "updated": "2023-07-24T03:37:04", "background_image": "https://media.rawg.io/media/screenshots/443/443a5d6b4f0e4dedbffe0fac3955537d.jpg", "website": "https://www.MyHypnotizedFamily.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 406, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["The Naughty Three"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["The Naughty Three"], "esrb_rating": null}