{"id": 963864, "slug": "ren-jian-mu-chang-residence", "name": "人間牧場 Residence", "name_original": "人間牧場 Residence", "description": "===Game Intro===<br/>Kailin does her yoga training every day to stay fit for her upcoming sexfights.<br/>However today Yanmei took a place on Kailin’s spot….and it was a mistake.<br/>Girls start to argue who is the best here and whose body is more fit.<br/><br/>Residence is a 2D adult action, narrative game. Get ready for:<br/>* 5 battles<br/>* 15 storylines<br/>* 15 sex scenes<br/>* 45 sex CG<br/>* Full Chinese voice acting<br/><br/><br/>===Storyline===<br/>When Kailin tells her stepbrother Allen that she’s interested in dating his friend, he lets her know that he’s only interested in slutty girls but Kailin is a goody-two-shoes so he doesn’t think it would work out...<br/>Yanmei is in dire straits and needs help with her English homework if she wants to pass...<br/>Allens little stepsister Riko keeps messing up like getting home late and totaling the family car, so in order to get out of trouble, Allen asks for a few sexual favors in exchange for his help...<br/>Jin-Ae loves teasing her stepbrother Allen but when she finds out that he got dumped by his girlfriend she wants to make things better for him...<br/>Xiaoye learns that her stepbrother Conor is trying to prove to his ex and everybody that he’s not a sex addict by abstaining from having sex and masturbating for 40 days...<br/><br/>===The Babes===<br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/>", "metacritic": null, "released": "2023-07-21", "tba": false, "updated": "2023-07-24T03:05:06", "background_image": "https://media.rawg.io/media/screenshots/460/46097ec2125c1dd5fe8b1ccd1de5b347.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ASOBI"], "genres": ["Indie"], "publishers": ["ASOBI"], "esrb_rating": null}