{"id": 963865, "slug": "my-klutzy-cupid", "name": "My Klutzy Cupid", "name_original": "My Klutzy Cupid", "description": "My Klutzy Cupid is a Japanese-style visual novel produced by Hulotte, a Japanese developer of romance VNs. <br/>The game won awards in the year of its release in Japan for its colorful art, story, and comedic setting.<br/><br/><br/><strong>Story</strong><br/><br/>In the midst of leading an ordinary life, I began to feel the urge to find myself a girlfriend. Yet somehow, I couldn't bring myself to take the first step. But one day...<br/><br/>\"What's this...?\"<br/><br/>A single notebook had fallen right in front of me.<br/><br/>\"Hey, you! Yes, you! Why aren't you picking it up?\"<br/><br/>Before my eyes appeared a strange young woman. Seemingly human, yet seemingly not.<br/><br/>\"I'm an angel of love! Tell me, is there someone that you have a crush on?\"<br/><br/>She couldn't sound more sketchy if she tried.<br/><br/>When I decided to ignore her, the girl thrust the notebook angrily toward me.<br/><br/>\"This is the Love Note, you know. The Love Note! With this, you're sure to find romance with any girl you like!\"<br/><br/>Apparently, by writing the name of the person you're interested in, the notebook will tell you your current level of \"fatedness\" with said person, as well as what to do in order to raise it.<br/><br/>\"What's more, I'll lend you my assistance too!\"<br/><br/>However...<br/>If the owner of the Love Note is unable to find the bride of his dreams within 90 days, he will be rendered impotent. Forevermore.<br/><br/>\"So there you have it. Do your best, 'kay?\"<br/><br/>And so, with the help of this angel of love, I began putting this so-called Love Note to use in order to fulfill my romantic endeavors.<br/><br/>", "metacritic": null, "released": "2023-07-21", "tba": false, "updated": "2023-07-24T03:06:33", "background_image": "https://media.rawg.io/media/screenshots/e27/e272bad29929cfab56f419108f773397.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 538, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HULOTTE"], "genres": ["Adventure", "Casual"], "publishers": ["NekoNyan"], "esrb_rating": null}