{"id": 963946, "slug": "idle-worlds", "name": "Idle Worlds", "name_original": "Idle Worlds", "description": "<strong>Idle Worlds</strong> is a simple but at the same time complex idle game with various gameplay possibilities. Travel between 8 different worlds and upgrade local generators to increase your profit. Use unique upgrades system to boost your stats or discover even more interesting prestige system to maximize your profit.<h3>ADDICTIVE GAMEPLAY</h3>Build your own idle farm across the worlds! Unlock dozens of generators and maximize your profit with endless upgrades.<h3>UPGRADES AND PRESTIGE SYSTEM</h3>Purchase various upgrades to boost your profit. Discover the complex prestige system with 92 unique upgrades and create your own playthrough.<h3>UNIQUE EVOLUTION SYSTEM</h3>Evolve your generators into something really powerful. Сomplete all conditions to get incredible game changer bonuses!<h3>EXTRA FEATURES</h3>Use the interest system to get an extra passive income. And don't forget to collect free rewards with time! Can you also unlock all the collectibles?<h3>GAME COMPLETION</h3>Unlike other idle games <strong>Idle Worlds</strong> can be completed. Are you ready for the challenge?<h3>LEADERBOARD AND ACHIEVEMENTS</h3>Unlock all 100 achievements and take the first place at the global ranking system. But don't imagine it will be easy!<h3>PIXEL GRAPHICS AND MINIMALISTIC UI</h3>Cute and fancy pixel tiles and backgrounds. High quality mode is also available for your choice. <br/><br/><br/><strong>Idle Worlds</strong> is a game worth trying. Get it now and receive hours of fun and joy with tough and interesting challenges!", "metacritic": null, "released": "2023-07-24", "tba": false, "updated": "2023-07-28T02:38:41", "background_image": "https://media.rawg.io/media/screenshots/ebf/ebfacce5a31cfe3c17208ff24424e4ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pixel Fox"], "genres": ["Simulation", "Indie"], "publishers": ["Pixel Fox"], "esrb_rating": null}