{"id": 96394, "slug": "echoplex-demo", "name": "ECHOPLEX (Demo)", "name_original": "ECHOPLEX (Demo)", "description": "<p><strong>Echoplex is a mind-bending first-person puzzle game. </strong></p>\n<p>If you enjoyed Portal and Antichamber, this game is for you!</p>\n<p>This free download is a small demo with 5 levels. </p>\n<p>Like the demo?  ECHOPLEX Full version is now available on Steam<br/></p>\n<p>中国翻译<br/></p>\n\n\n<p>In the Echoplex, you're followed by an echo of yourself who repeats everything you do.  Activate a switch to unlock a door, and your Echo will activate the same switch a few seconds later, locking the door again. </p>\n<p>Your Echo is always getting closer - and if it catches up to you, the game is over.   You must use strategy and timing to outsmart your Echo and escape the Echoplex.</p>\n\n\n<p>The controls are look, walk and run.  The aim is to get to the exit of each level.</p>\n<p>Although the controls are simple, the real challenge of the game is learning to work with your Echo.</p>\n<p>To succeed, you will need to think ahead and use precise timing.  Each level has a theme - pay attention to the level titles, as they may provide clues.</p>\n\n\n<p>Based on player feedback so far, we are working on adding these features to the game:</p>\n<ul>\n<li>Greater range of movement, e.g. jumping and sliding</li>\n<li>Impossible objects / Euclidean space</li>\n<li>Multi-storey levels</li>\n<li>Transference ability, i.e. swap places with your Echo for a limited time</li>\n<li>Weapons that can freeze, slow down or obliterate the Echo</li>\n</ul>\n<p>What else should we consider? Please let us know in the comments/discussions.</p>\n\n\n<p><strong>How many levels will the finished game have?</strong></p>\n<p>We're planning 27 levels, divided into 3 chapters.</p>\n<p><strong>How do the doors and switches work?</strong></p>\n<p>The switches are the pulsating fields you see in the corridors.  You activate a switch by walking through it.  Your Echo also activates the switches.  The switches come in 3 colours - blue, yellow and purple - and they are connected to doors of the corresponding colour. Walking through a blue switch, for example, toggles all the blue doors in the level, i.e. if a door is locked, it will unlock, and vice versa.</p>\n<p><strong>How long before before my Echo appears?</strong></p>\n<p>It varies from level to level, but usually between 6 and 12 seconds.</p>\n<p><strong>My echo just walked through a locked door! Is that a bug?</strong></p>\n<p>No.  In the Echoplex, doors can lock from one side, but be open from the other side.  (It helps to remember that blue switches lock doors to blue rooms, but if you are going the other way you may be approaching a yellow room, which could be be open.) We are aware that this mechanic is not yet clear in terms of visual design - it is a design challenge we are working on solving.</p>\n<p><strong>Can I design levels?</strong></p>\n<p>Sure, just not yet!   After the game is released, we definitely want to make a level editor for you guys to try.  But we are a tiny indie team, so we need to focus on finishing the game first.</p>\n<p><strong>Who are you guys?</strong></p>\n<p>We are a small indie team based in Johannesburg, South Africa.  There are mainly three of us working on the game - we originally met doing client work.  This is our first game together.  You can read more about us and see our handsome photos at http://echoplexgame.com</p>\n<p>Twitter: https://twitter.com/echoplexgame</p>\n<p>Facebook: https://www.facebook.com/echoplexgame/</p>\n<p><strong>DEMO CREDITS</strong></p>\n<p><em>Game Director</em><em>: </em>Tyron Janse van Vuuren (typhvs)</p>\n<p><em>Developer/Art Director</em><em>: </em>Henk Scheepers (donderbos)</p>\n<p><em>Animation/Modelling</em><em>: </em>Ronnie Wong Ho Hip (crimsonZA)</p>\n<p><em>In-game Translation:</em> Zhuofeng Wu (Your Mom)</p>\n<p><strong>MUSIC</strong></p>\n<p>\"Thibetaurus\" by Salakapakka Sound System (http://ikuinen-kaamos.blogspot.com)</p>\n<p>\"Reflections - antipop consortium (karash nikol remix)\" by Karash Nikol (https://karashnikolsound.wordpress.com)</p>", "metacritic": null, "released": "2016-10-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/65b/65bd758a75512673b191e905d5ad9f67.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Output Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}