{"id": 963927, "slug": "polylithic", "name": "Polylithic", "name_original": "Polylithic", "description": "Polylithic is a third-person crafting survival game set in the Paleolithic/Neolithic era with a dash of sci-fi plot and bursting with colors and beautiful low-poly graphics. Become your tribe’s new leader. Start slowly by gathering resources, crafting items, unlocking technology, discovering the world, and building bases to eventually grow your tribe and command the settlement<h3>Gather, craft, and hunt</h3>Your goal is to gather primary resources to provide the basic means to survive. Collecting various resources and advancing the tech tree lets you set your eyes on the big prize. From rabbits to the mammoths inhabiting the prehistoric wilderness, every animal provides a different challenge to overcome.<br/><br/><br/><h3>Grow and manage your tribe</h3>There is strength in numbers. Grow your tribe, take care of its needs, and keep your tribe members happy. You can then manage your people and give them tasks in return, leading to them getting better and eventually becoming elders of the tribe.<br/><br/><br/><h3>Explore the wilderness</h3>There are more than valuable resources in the forests, snow-covered hills, and rivers. Discover the remnants of past tribes and take inspiration to build your own monuments to their memory.\t<br/><br/><br/><h3>Discover the true origin of your tribe</h3>Not everything in this prehistoric wilderness is as it seems. There are secrets to find and stories to piece together, starting with discovering the roots of the disease that plagues your people and ending with your tribe’s history.\t<br/><br/><br/><h3>Immerse yourself in this colorful, low-poly world filled with atmospheric music</h3>The Polylithic universe is unlike anything you’ve seen before and is waiting for you to explore its richness and discover all of its secrets.", "metacritic": null, "released": null, "tba": true, "updated": "2023-11-10T08:12:36", "background_image": "https://media.rawg.io/media/screenshots/7b2/7b248d43478e99b653c0cf7d59d7b96a.jpeg", "website": "https://www.polyperfect.com/polylithic", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["polyperfect"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Indie"], "publishers": ["polyperfect"], "esrb_rating": null}