{"id": 963979, "slug": "prostitute-simulator-2", "name": "Prostitute Simulator 2", "name_original": "Prostitute Simulator 2", "description": "Welcome to the second entry of the best prostitute simulator. In this game you will be able to give free rein to your hottest desires.<br/>Work as a prostitute, get clients and enjoy amazing high quality porn scenes.<br/><br/>Choose your favorite mode: Anime or realistic (All adult content is created with stylized 3D models.)<br/><br/>Experience firsthand a deep story, where you will know the motivations and desires of the protagonists.<br/><br/><br/><br/>⚫︎Modo censorship for streamers. With this mode you can play the game live or upload videos to Youtube without worrying about watching any adult content.<br/><br/>⚫︎ Beware! Prostitution is illegal in some countries, so the police are on the prowl - don't let them catch you or it's game over!<br/><br/>⚫︎ Improve your sexual performance with different mini-games to get extra money while experiencing mayhem in three different cities around the world thanks to a random event system.<br/><br/>⚫︎ An exciting story that will take you around the world for 30 days with the prostitute of your choice.<br/><br/>⚫︎ Travel to three cities around the world: Japan, Middle East and Brazil.<br/><br/>⚫︎ Random events cause chaos in the cities so that every day is different.<br/><br/>⚫︎ Earn extra money as a photographer by selling the pictures you have taken around the cities.<br/><br/>⚫︎ Use the money you earn to unlock porn scenes in the gallery.", "metacritic": null, "released": "2023-07-25", "tba": false, "updated": "2023-07-28T03:23:27", "background_image": "https://media.rawg.io/media/screenshots/a04/a047c160647c7bb8df2fef518cdbf9f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 404, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Doky", "CapturedLeek27"], "genres": ["Simulation"], "publishers": ["Doky"], "esrb_rating": null}