{"id": 964077, "slug": "witchs-rhythm-puzzle", "name": "Witch's Rhythm Puzzle", "name_original": "Witch's Rhythm Puzzle", "description": "<h3>Overview</h3>It's a puzzle game meets rhythm game combined into a lighthearted ecchi romp!<br/>Battle as cute sexy witches as you drop blocks to the beat to clear rows your side of the puzzle stage.<br/><br/>Send blocks to your opponent's side to throw them off rhythm and tear their clothes asunder!<br/>Each stage contains a new kind of catchy rhythm and a new puzzle element for ever increasing challenge!<h3>Story</h3>In a world where magic developed in place of technology, ten lovely witches live together in a grand tower to study and grow their mystical knowledge.<br/>However, trouble emerges when a mysterious force takes control of their bodies and makes them try to strip one another! <br/>Thought at first to be some kind of prank, these antics arouse the attention of an unexpected guest, <br/>and it soon becomes clear there are far more powerful forces at work.<br/><br/><strong>Can these witches learn to cooperate in order to save their tower, and their wardrobes from complete destruction?</strong><br/><br/><h3>Characters</h3><strong>Ibis</strong>, the Self Proclaimed Natural Born Witch.<br/><br/><strong>Entail</strong>, the Gruff Magical Warrior<br/><br/><strong>Tariff</strong>, Resident of Fairy Tail Land<br/><br/><strong>Droff</strong>, the Witch Doctor from Another Land<br/><br/><strong>Forge</strong>, the Impish Temptress<br/><br/><strong>Virgule</strong>, Keeper of the Tower<br/><br/><strong>Yew</strong>, the Suave Cross Dressing Ladies Woman<br/><br/><strong>Sleek</strong>, The Astrologer From Another Land<br/><br/><strong>Minnow</strong>, the One and Only Glasses Wearer<br/><br/><strong>Boggart</strong>, The Great and Powerful<h3>Features</h3><ul><li>15 different stages of variable difficulty + hidden bonus stages.<br/></li><li>An Unlock all stages option for a more arcade style game experience.<br/></li><li>Click the timing calibration tool in the settings menu to ensure comfortable input on any setup.<br/></li><li>Non-stop survival mode to test your skills and endurance from one stage after another.<br/></li><li>Dressing Room mode to view colorful detailed character artwork, read bios, and even toggle clothing layers for ecchi fun!</li></ul>", "metacritic": null, "released": "2023-07-27", "tba": false, "updated": "2023-11-27T06:42:11", "background_image": "https://media.rawg.io/media/screenshots/ed0/ed0533e9a0632cedfd96846fe9f8e85d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 361, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Forgime"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Eroge Japan"], "esrb_rating": null}