{"id": 964093, "slug": "komorebi-2", "name": "Komorebi", "name_original": "Komorebi", "description": "<strong>Click the image above to join the Discord server!</strong><br/>Or use this link: https://www.discord.gg/klace<br/><br/><br/><br/><br/><strong>The characters in Komorebi are brought to life by amazing talent!</strong><br/><br/><strong>- Sean Chiplock</strong> (Revali, Breath of the Wild) as Isaac<br/><strong>- Jonah Scott </strong> (Legoshi, Beastars) as Zero<br/><strong>- Casey Mongillo</strong> (Shinji, Neon Genesis Evangelion) as Klace<br/><strong>- Michael Kovach</strong> (Angel Dust, Hazbin Hotel) as Taylor<br/><strong>- Jesse Inocalla</strong> (Soren, The Dragon Prince) as Dante<br/><br/><br/><br/><br/>Komorebi is a fully voice acted dystopic story taking place in 2041. Set against the backdrop of social revolt, you move to Toronto to start a brand new chapter in your life. Make friends, party, and form bonds and romances that will last a lifetime! While pages turn in your life however, they also turn in the world. As your morals clash with those in power, you and your group may walk an irreversible path in the name of equality and a brighter future. <br/><br/>Enjoy your new life...<br/><br/>Please note that Komorebi deals with mental health issues that some may find distressing.<br/><br/><br/><br/><br/>- A lengthy story, several full novels in length.<br/>- Approx. 18,000 lines over 150,000 words of dialogue.<br/>- Over 10 hours of voiceover audio delivered by an incredible cast.<br/>- Romance a varied cast of characters with no limitations or restrictions. Romance one, or all.<br/>- Experience the story in your own unique order, through the Fragment Map system.<br/>- Gain more insight into the world through diary entries and counselor sessions.<br/>- Several tracks from Klace's debut pop album \"Triple Threat\" are included in the game.<br/>(Purchase Triple Threat Here: https://klace.bandcamp.com/album/triple-threat)", "metacritic": null, "released": "2023-07-27", "tba": false, "updated": "2023-07-28T05:54:36", "background_image": "https://media.rawg.io/media/screenshots/791/791c9b31beef309e16553ef1f2b63cd8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 332, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Klace"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Klace"], "esrb_rating": null}