{"id": 964064, "slug": "nova-strike", "name": "Nova Strike", "name_original": "Nova Strike", "description": "Nova Strike is a retro shoot 'em up that transports you to a distant galaxy where you face waves of increasingly powerful enemies. Because it is easy to pick up and play, has addictive gameplay, and generates different levels with each new game, you can enjoy hours of challenging fun. Every time you take off is a chance to unlock new upgrades and improve your ship. Try to beat your high score!<br/><br/><h3>FIGHT FORMIDABLE FOES</h3><br/>Destroy as many enemy ships as possible while skilfully dodging their attacking fire. After defeating mighty armadas, a formidable boss stands in your way. You need to watch, learn and anticipate the attacks of each boss to stand a chance of defeating them. Push yourself to your limits to complete the perfect run and beat the high score.<br/><br/><h3>CUSTOMIZE YOUR WEAPON LOADOUT</h3><br/>Your ship has nine secondary weapons to unlock and equip as well as some 40 defensive and attacking skills. From missiles to grenades to electric forcefields, every upgrade creates a different game experience. Build a ship to suit your style and refine it between each level during your stops at the spaceport. Every customization radically changes the tactics you need for annihilating enemy squadrons. Choose carefully and find the best configurations to suit your play style.<br/><br/><h3>EACH GAME IS DIFFERENT</h3><br/>Play and play again: every Game Over is the start of a new adventure. Using the persistent points you earn with each run, unlock new weapons and skills, then start a new game to explore a fresh procedurally generated map. Come back stronger and stronger until you can confront the final boss and save the galaxy!", "metacritic": null, "released": "2023-07-27", "tba": false, "updated": "2023-07-28T05:13:43", "background_image": "https://media.rawg.io/media/screenshots/b75/b75cb196d0b2190835f3e6e449fc427d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sanuk Games"], "genres": ["Action"], "publishers": ["Nacon"], "esrb_rating": null}