{"id": 96400, "slug": "concerned-joe-early-access", "name": "Concerned Joe Early Access", "name_original": "Concerned Joe Early Access", "description": "<p><strong>[Warning: Don't buy this game if you don't have an account on concernedjoe.com]</strong></p><p>A puzzle platformer about Joe, who is concerned about his life. If he stops moving he will explode, so he has be in constant motion - ALL - the time!</p><p>That's because of a disease called \"I have to move or I'll die\", I.H.T.M.O.I.D. for short, inflicted upon him by his creator, the evil, mysterious and sarcastic programmer.</p><p>His identity remains unknown but one thing is for sure...He is a d*#k! He created a virtual underground facility in his video game universe just so he could fill it with cruel puzzles awaiting to be solved by poor little Joe. All this while fiddling around with the code, changing the environment around Joe in real time as he tries not to internally combust.</p><p>Will Joe escape the programmer's evil clutches or will he be forever trapped in this video game universe?</p><p>Find out the answer to this cheesy question and many more once the game is released!</p><p>This is what you get with early access:</p><ul><li>Instant access to the game as it's developed.</li><li>Full game once it's released. (Steam)</li><li>Unlock secret \"Early Access\" forum section.</li><li>Constant updates as the game is developed.</li><li>Real time chat with the developers.</li><li>Be part of the development process.</li><li>That fuzzy feeling of helping a small indie team.</li></ul><p><strong>Keep in mind, this is NOT a finished product!</strong></p><p>We highly suggest you take a look at the state of the game and FAQ page before going on.</p><p>More info on - http://concernedjoe.com/</p>", "metacritic": null, "released": "2014-03-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/229/2298fe9cc744f0a23fd99e2e06721077.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nicolae Berbece"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}