{"id": 964005, "slug": "whispers-in-the-west-co-op-murder-mystery", "name": "Whispers in the West - Co-op Murder Mystery", "name_original": "Whispers in the West - Co-op Murder Mystery", "description": "<h3>Solve mysteries with friends</h3>Whispers in the West is a point-and-click murder mystery game with a twist - it supports <strong>online co-op for 1-4 players</strong>. <br/><br/>The game sets in the far reaches of the Old West.  A series of crimes have shaken the Wild West - eluding even the most expert investigators. There are six cases in the initial release. Each story is a unique and intriguing hour-long mystery waiting to be solved. To succeed, the players can either go on a solo adventure or work as a team.<br/><br/>The base game includes a Tutorial, a mini-mystery, The Portrait, and a full case, The Break-in. And each DLC add-on offers a different case.<h3>Friends play for free</h3><br/>💡In Whispers in the West, your friends don't need to buy the game to join a room. As long as the host owns the case, anyone invited can join for free using the Steam demo.<h3>Twitch integration</h3>How to set up Twitch Integration<h3>Demo available</h3>Head to the top of this page to try out Whispers In The West! Our free demo contains a tutorial and a 15-minute mini mystery case. <br/>You can also use the demo to join games hosted by other players.<h3>Gamplay</h3><br/><br/><ul><li><strong>Online co-op mode</strong> <br/>Whispers in the West is best played in the company of friends. You can either use in-game voice chat or your preferred tool, such as Discord or Zoom.<br/><br/></li><li><strong>Four Unique Playable Characters</strong><br/>The four playable characters each offer a unique skill, which leads to different interactions with the town's residents. You and your friends need to collaborate, look for clues and finally piece the puzzle together. <br/><br/></li><li><strong>Explore a stylized game world</strong><br/>Being a side-scrolling RPG, the game features classic point &amp; click gameplay. While this is a well-tested formula, our non-linear story engine and the multiplayer feature make it stand apart from similar games.<br/><br/></li><li><strong> Fast travel to locations</strong><br/>Meet the various characters around the town and question them to gain further insight into the town's history, characters and lore.<br/> <br/></li><li><strong> Interrogate the residents</strong><br/>Who knows what shady past or hidden romance may have occurred behind the scenes! The further you investigate a character, the closer you’ll come to bringing to light secrets they may withhold about other residents.<br/> <br/></li><li><strong> Inspect the clues</strong><br/>A bloody murder weapon is a sure bet to lead you to the truth, or could it be a red herring to throw you off the scent? No doubt a discarded wanted poster holds a hot lead on a potential suspect. However you investigate, a keen eye and quick wit is essential when diving into the rabbit hole.<br/> <br/></li><li><strong> Utilize your unique skill</strong><br/>Using all the tools at your team's disposal is essential to solving the mystery within the time limit. Don’t be a lone wolf. <br/><br/></li><li><strong> Be aware of the time limit</strong><br/>Keep an eye on the clock as you’ll only have a short time to investigate, and allocate tasks amongst your party wisely.<br/> <br/></li><li><strong>Review the investigation</strong><br/>Scrutinize the findings in your case file and determine the truth amongst the lies with your team. In the end, you can only settle on one culprit... Be warned, things may get heated!</li></ul>", "metacritic": null, "released": "2023-07-25", "tba": false, "updated": "2023-08-18T02:25:59", "background_image": "https://media.rawg.io/media/screenshots/f47/f4749434eb4a25cc4ba3d6608754a3ff.jpg", "website": "https://whispersinthewest.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 14, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 301, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["Infinite Whys"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Wings", "Infinite Whys"], "esrb_rating": null}