{"id": 964075, "slug": "the-future-project", "name": "The Future Project", "name_original": "The Future Project", "description": "We rose to the challenge, and pushed ourselves to greater heights. The Future Project, humanity’s latest achievement in space exploration, will allow us to journey the stars safely and effectively. As the player, you are finalizing the functionality of an AI technology that will relieve humanity of the dangers of exploring new planets. Pilot the AI, exploring planets and combating threats in fast paced combat as it journeys through distinct worlds. Obtain new weapons and abilities to enhance your capabilities and become the ultimate explorer and fighter.<br/><br/>Continuing the narrative started in Infinite Level's Impressions, The Future Project expands on the story by showing the aftermath of alien contact and the current progress of the titular Future Project. The story of The Future Project is presented in a way that allows players to interpret the game's events in their own way, at their own pace. Integrated naturally into The Future Project's digital world, piece together the development history of The Future Project, the thoughts of its creators, and the hopes of humanity. But beware, for there are those who believe the project will bring ruin to humanity. They will stop at nothing to destroy the project, ending humanity's hope to reconnect with the aliens.<br/><br/><br/><br/>Played from a first person perspective, players will navigate six uniquely themed environments, discovering the secrets each world has to offer. Use your various abilities for exploration, platforming, and fast paced combat. Abilities come in many forms, from extra movement options to entirely new elemental projectiles. As your abilities grow, so too do your options. Perform impressive platforming feats to acquire upgrades to health and ammo, or use your powers for flashy, skillful combat. As the simulation progresses, players will acquire new abilities which will open previously unexplored areas, allowing the discovery of hidden secrets and upgrades as you explore.<br/><br/>Though the AI is engineered for exploration first and foremost, there will undoubtedly be hostile creatures that must be defended against. The Future Project aims to create a fast paced, compelling combat system that has the player use their abilities in creative, efficient ways. Burn enemies to apply extra damage over time, create an ice shield to block attacks, elevate yourself with the very ground you stand on to defeat enemies, or simply unload all your missiles. Bring your combat prowess to intense boss fights that challenge your knowledge of current abilities. Man eating plants, robotic forces, and creatures from the deep await you!<br/><br/><br/><br/><strong>FEATURES</strong><br/><ul><li>Six distinct, 3D worlds filled with unique enemies, obstacles, and items</li></ul><ul><li>Fast paced combat mechanics designed for skillful play and player creativity</li></ul><ul><li>Metroidvania-like progression, where collecting new items allows further exploration into previous areas</li></ul><ul><li>Wield the elements as you burn, freeze, bury, and electrify opponents</li></ul><ul><li>Continuation of the story seen in Impressions, with humanity nearing the completion of The Future Project</li></ul><ul><li>Atmospheric environments to immerse yourself in</li></ul><ul><li>Futuristic, immersive musical score complimenting the tone of every scene</li></ul>", "metacritic": null, "released": "2023-07-27", "tba": false, "updated": "2023-07-28T05:30:21", "background_image": "https://media.rawg.io/media/screenshots/e36/e361dbea264464bbf10a867a5d50d097.jpg", "website": "https://www.infinitelevel.net/the-future-project", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Infinite Level"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Infinite Level"], "esrb_rating": null}