{"id": 964061, "slug": "makabaka", "name": "MAKABAKA", "name_original": "MAKABAKA", "description": "<h3>Game Introduction</h3><ul><li>Overall, this game is a magical girl themed game set in the autumn forest.</li></ul><br/><ul><li>Players need to manipulate the magical girl and use various magical skills to defeat the ghoul. Protect forests and maximize Time to live, facing increasing challenges</li></ul><h3>Featured Content</h3><br/><ul><li>Magical girls are naturally proficient in various types of magic, and they don't need to wait until later to release many magical skills!</li></ul><br/><ul><li>The game provides rich skill combinations and upgrade strategies.</li></ul><br/><ul><li>Paired with different skills, each game can experience different challenges and fun.</li></ul><br/><ul><li>Reasonably choose to upgrade skills based on the situation and fully utilize your strategies.</li></ul><h3>Featured Content</h3>Diversified magical skills: The magical girl is naturally proficient in various types of magic in the game, and players can experience the fun of releasing various magical skills from the beginning of the game. The rich magic of fireballs, ice cones, and lightning chains will make players feel the powerful power of becoming a true magical girl.<br/>Skill matching and upgrade strategy: The game provides a rich range of skill matching and upgrade strategies, allowing players to choose appropriate skills for combination and upgrade based on their preferences and game progress. This allows each game to bring different challenges and fun, increasing the playability and strategy of the game.<br/>Strategic gameplay: Players need to choose the upgraded skills based on the situation, and use the correct magic skills to defeat different types and numbers of ghouls when facing them. Only by giving full play to their own strategies can they survive in the forest and constantly refresh their maximum Time to live.<br/>Exquisite Autumn Forest Scene: The game scene is set in the autumn forest, using exquisite art design and sound effects to create a mysterious and magical atmosphere. Players will experience the beauty and danger of the forest firsthand, adding more immersive experiences to the game.", "metacritic": null, "released": "2023-07-27", "tba": false, "updated": "2023-07-28T05:10:15", "background_image": "https://media.rawg.io/media/screenshots/b6d/b6d9df2b33bdff23377ff94362c2da25.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 524, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aba"], "genres": ["Casual", "Indie"], "publishers": ["Aba"], "esrb_rating": null}