{"id": 964079, "slug": "edge-of-dead-prologue", "name": "Edge Of Dead Prologue", "name_original": "Edge Of Dead Prologue", "description": "This is the prologue for the action roguelike game 'Edge Of Dead: Under A Uranium Sky'. It includes the first full level of the full game with a newly generated map every run, lots of enemy encounters, a shop and lots of loot to find. The game is set in a distant star system and pits the player against an alien invasion.<h3>How it plays</h3>You will start by choosing a crew member, then move from one randomly generated level to another fighting numerous enemies in each level. You’ll need to clear the level of enemies before proceeding to the next. The game involves finding weapons, loot and money from various caches scattered around the level and from vanquished enemies. You can use these found items to power up your character before moving on to the next battle. There is an inventory system which allows you to see an items attributes and decide how and when to best use it. If your character dies during a run the game starts from the beginning and you will have to choose a new character and begin a new run. Choose a crew member, grab a weapon, and prepare for chaos in the Edge Of Dead prologue!<h3>Dorado System</h3>From a small mining colony in the Dorado star system you and your crew mates listen to chaotic reports of a giant alien invasion. Armies of creatures and machines descend from orbiting alien carriers to the unsuspecting worlds below. One after another the worlds of the Dorado system fall silent. Who is this enemy?<h3>Weapons and Loot</h3><ul><li>There are lots of weapons waiting to be found. Take out bunkers with an RPG, cause chaos with crossbow bolts, or go old school with a revolver. Crush bone spiders with a skull club, or bash robots with a wrench. Shotgun your way through infected insects. Snipe from a distance or get in close with a chain saw.<br/></li><li>Block and deflect incoming projectiles with a riot shield. Lob explosives at attackers. Power up your weapon and more.<br/></li><li>Pickup food and medical supplies along your journey. Activate cybernetic implants. Desperate for health? Take a chance on rancid meat, or a radioactive pepper. Increase your health but decrease your accuracy with Wild Fire Wine. Tons of backpack items lay scattered throughout the area.</li></ul><br/>", "metacritic": null, "released": "2023-07-27", "tba": false, "updated": "2023-07-28T05:35:55", "background_image": "https://media.rawg.io/media/screenshots/330/330c2d7d85f81b44a4fe805ca0bdfc61.jpg", "website": "http://infernomuse.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 258, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Inferno Muse Interactive"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Inferno Muse Interactive"], "esrb_rating": null}