{"id": 964091, "slug": "the-karters-2-turbo-charged-prologue", "name": "The Karters 2: Turbo Charged - Prologue", "name_original": "The Karters 2: Turbo Charged - Prologue", "description": "The Karters 2: Turbo Charged brings together the best features of Mario Kart and Crash Team Racing, and adds a multitude of unique and new elements for an unforgettable racing experience on Steam and Steam Deck!<h3>What can you expect from Prologue</h3>Prologue provides <strong>hours of gameplay</strong> and offers a glimpse into the full version, allowing you to experience the game in a concentrated form! <br/><br/><h3>Split-Screen</h3>Compete against your friends in head-to-head intense Split-Screen races!<br/><br/><br/>(controller is required for local multiplayer)<br/>*Disable X-Input in settings to support more than 4 controllers.<h3>Single-Player Campaign</h3>Embark on a thrilling single-player campaign featuring 20 challenges across 4 exciting difficulty levels!<br/><br/><br/><h3>Duels &amp; Time Trial Mode </h3>Experience Asynchronous Time-Trial races with your friends! Compete against your opponent's ghost and put your skills to the test, where it's all about pure skill and precision!<br/><br/><br/><h3>Global Leaderboards</h3>Compete against other players' ghosts on the global ranking, showcasing your skills in worldwide competition!<br/><br/><br/><br/><br/><br/><br/><br/>We are a small indie studio of 8 from Poland with a goal to create the best racing game on the platform!", "metacritic": null, "released": "2023-07-27", "tba": false, "updated": "2023-07-28T05:52:01", "background_image": "https://media.rawg.io/media/screenshots/5f9/5f91e1d2f4fe1a8025fc7e113d401d2e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pixel Edge Games"], "genres": ["Action", "Adventure", "Simulation", "Sports", "Racing", "Casual", "Indie"], "publishers": ["Pixel Edge Games"], "esrb_rating": null}