{"id": 964195, "slug": "snapback-2", "name": "Snapback", "name_original": "Snapback", "description": "Snapback is the ultimate speedrunning puzzle platformer. It takes place in a dystopian world ruled by an authoritarian regime. You are a robotic citizen presented with the opportunity to fight against the oppressive system. A mysterious hacker gives you missions to rebel against the regime you live under. Each level presents a different challenge. Gameplay features a unique ability that allows you to traverse levels with careful teleports, only to be pulled back to that location after a set period. Every second counts. Speed is the puzzle.<h3>Features:  </h3><strong>Teleport</strong> - You have the ability to teleport instantly to any point you can see within range, but only for a period of time before you trigger a SnapBack.<br/><br/><strong>Snapback</strong> - After teleporting, you will return to your previous location after a set period, traveling through space and colliding with everything between your current location and where you teleported from.  This can also be triggered manually.<br/><br/><strong>Punch</strong> - You can break objects, including, but not limited to, doors, windows, and enemies.<br/><br/><strong>Movement</strong> - As a robot, you have an increased ability to move quickly through space and advanced servos to increase your ability to jump and traverse large distances.<br/><br/><strong>Reset </strong>– To help facilitate speed runs and stumped puzzlers, you have the ability to reset a level at will to help get the best time possible.<br/><br/><strong>Tier System</strong> – Our tier system scores the player based on performance while playing any given level. Try to reach S Tier in everything to achieve true mastery of the game.", "metacritic": null, "released": "2023-07-28", "tba": false, "updated": "2023-07-31T03:13:16", "background_image": "https://media.rawg.io/media/screenshots/7d0/7d00c3d4bd347f03aba8467cd58f7934.jpg", "website": "https://shadowlightgaming.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shadowlight Gaming Company"], "genres": ["Action", "Indie"], "publishers": ["Shadowlight Gaming Company"], "esrb_rating": null}