{"id": 964197, "slug": "zhi-chang-shang-sheng-ji", "name": "职场上升记", "name_original": "职场上升记", "description": "<h3>【 Game Introduction 】</h3>      Finally out of college and into the real world of work.With a good vision of life, start to experience a wonderful life and all kinds of people and things in the workplace.There will be colorful scenes waiting for you. Let you quickly improve and growth in a variety of scenes .What kind of people and things will you encounter in your upcoming career.Look forward to their arrival......<br/><br/>  We yearn for the sun, desire to grow up, grow up as a social responsibility.<br/>  No matter what kind of situation we encounter in the workplace, we will face it with a positive attitude and let things grow in a bright direction.<br/>  In a variety of occasions continue to absorb nutrients to thrive.<br/>  We will face life with a stronger side. I hope you do the same, make a dazzling career.<h3>【 Game Features 】</h3>   This is a game that is played in daily work life.<br/> <strong>QQ Group：335449305</strong><br/> <strong>game + patch  It will have more flavor！！！！</strong><br/>   So be sure to join the group！！！！<br/> <br/>   In this game, you play the protagonist in the workplace and every corner.<h3>Office story</h3>​\tYou have to clock in to the office every day with a positive attitude. <br/>        You have to work positively so that you can earn little gifts for your cute friends.<br/>        In this way, we can harvest the love of little sister faster, so as to continuously experience and make life colorful;<br/><br/>​\tThere are many lovely little sisters in the office, they have a different mood every day. <br/>        You can chat and interact with them from time to time, so that you can have more love for you;<h3>Simple gameplay introduction</h3>​\t1. If you do not have much income at the beginning, you should actively report to the office, and your income will increase after the report;<br/><br/>       2. You can talk to your younger sister more often. <br/>          After you've had a few conversations, your little sister will give you some simple tasks to do. <br/>          When there are conditions to complete the work released by the little sister, return to the little sister, complete a task, and so on...<br/><br/>       3. In the game there will be a lot of items to buy, these items, according to the category of flower shop, property, shop, hotel, physiotherapy shop... <br/>          Friends can delve deeper into......    <br/><br/>       4.Grow in constant communication with people and constant completion of tasks...<br/><br/> <br/><br/>Whether to work hard at the office to get the attention of a lover or help out your colleagues with little things.<br/><br/>How exactly to choose is in your hands.Different choices will bring different scenery. I hope you can bring more beautiful scenery......<br/><br/><br/><br/>There are vast warehouses to explore,<br/><br/>There are beautiful villas to discover,<br/><br/>There are so many good things in life to look forward to...<br/>......", "metacritic": null, "released": "2023-07-28", "tba": false, "updated": "2023-07-31T03:21:05", "background_image": "https://media.rawg.io/media/screenshots/d1b/d1b61c45ed7f34c2974f499fa8e11a93.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MARL"], "genres": ["RPG", "Casual"], "publishers": ["MARL"], "esrb_rating": null}