{"id": 964179, "slug": "my-sexual-hospitalization", "name": "My Sexual Hospitalization", "name_original": "My Sexual Hospitalization", "description": "<strong>All text in this game is translated by machine translation.</strong><h3>【Story】</h3><br/>The main character, Souma Takehaya, was on his way to college when he was involved in a traffic accident and lost consciousness. When he came to, he found himself in a hospital bed with a stranger standing beside him.<br/><br/>I'm Isami, your doctor. Takehaya Souma: ...... Do you know who you are?\"<br/><br/>Apparently, I had caused a collision with the car driven by Dr. Isami while I was in a hurry.<br/>When I tried to get up, I felt pain in my left leg.<br/><br/>I'll probably be in the hospital for a few weeks with a broken leg,\" he said. Although it was your carelessness, I am the one who caused the accident.<br/>I am the one who caused the accident, so I will do what I can.<br/><br/>What can I do? Well, I don't know if this is the right thing to say at our first meeting. .......<br/><br/>\"Yes. What is it? If there is something I can do, please don't hesitate to tell me.<br/><br/>Please show me your boobs! And touch and suck them. ...... And other things too...\"<br/><br/>Takehaya-kun... It seems you need a special examination.\"<br/><br/>Dr. Isami looks down at Souma with eyes like she is looking at trash.<br/><br/>Thus began Souma's Wonderful Life, in which he asked the domineering female doctor to do all sorts of things for him.<br/><br/><br/>※Japanese voice is included.<h3>【Highlights】</h3><br/>The relationship between the two gradually changes during their \"boobie days\" with the teacher, and their relationship escalates little by little.<br/>There are days of happiness when they enjoy Shujo's over 100cm tits!<br/><br/>The naughty medical examinations that take place in the hospital!<br/><br/>Friction of the doctor's tits in the hospital room<br/>After-hours medical examinations using her tits (titty-slapping)<br/>Reverse examination of a doctor wearing an eye mask!<br/>After-hours examination using her pussy (cowgirl position)!<br/>Pussy massage to relieve daily fatigue<br/>Punishment for getting carried away! Fainting in agony from the anus!<br/>Bathing by the doctor.<br/>Pampering nursing hand job<br/>... And so on!<br/><br/><br/><br/>Not only being attacked by the teacher who became your lover, but also<br/><br/>You can also enjoy the \"play of being attacked by an older sister\"!<br/><br/>You can also enjoy \"being attacked by an older sister\"!<h3>【Character introductions】</h3><br/>[CHARACTER]<br/><br/>Name: Isami Moe<br/>Height: 167 cm<br/>Age: 29 (virgin)<br/>Three sizes: B102 (I cup) / W58 / H91<br/>Blood type: A type<br/>Her hobbies: listening to music, swimming<br/>Occupation: doctor<br/><br/>CV: Tokio Aoi<br/><br/><br/>She is a doctor at Shiratose General Hospital and the main character's doctor.<br/>She is a cool woman with a grim face, and her nickname in the hospital is \"Onna-tei\" (\"Empress\").<br/>She is also feared by old patients who say, \"She looks good, but...\" She is also known as the \"Empress\" of the hospital. She is also feared by the old patients.<br/><br/>However, the main character, who loves tits, can't resist her big tits.<br/>He can't resist her big tits, so he makes an outrageous request, which she reluctantly agrees to, partly out of guilt for having injured him.<br/>As the days go by, he gradually loses control of his emotions and begins to feel confused.<h3>【Voice Cast】</h3><br/>Moe Isami: Tokio Aoi<h3>◆Gameplay Instructions◆</h3><br/>This is a POV first-person visual novel.<br/><br/>The player becomes a male protagonist who is hospitalized after an accident and tries his best to become a lover with the heroine he met at the hospital.<br/><br/>Make naughty requests to the heroine as a treatment to deepen your relationship with her.<br/><br/>Even after becoming a lover, the future will change depending on your choices.<br/><br/>The future with the heroine always depends on your choice.<h3>◆Features of the game◆</h3>Includes 19 basic CG + 4 cut-ins and more than 400 differences.<br/>Game ending: 2 types.<br/>Full Japanese voice by experienced voice actors.<h3>【Description of adult content】</h3>This game contains content that is not appropriate for all ages or for viewing in the workplace.<br/>This game contains content that is not appropriate for all ages or for viewing in the workplace. Nudity or sexual content, general adult content.<br/>The game contains expressions and scenes of consensual SM play.<br/>Scenes include pregnant characters engaging in sexual acts.<br/><br/>All characters in sexual content are 20 years of age or older.", "metacritic": null, "released": "2023-07-28", "tba": false, "updated": "2023-07-31T02:54:14", "background_image": "https://media.rawg.io/media/screenshots/07f/07fafac7689a4f0d93b993ddefb17e09.jpg", "website": "http://www.pajamas.ne.jp/pjex/project/bs/index.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PAJAMAS EX"], "genres": ["Adventure"], "publishers": ["PRODUCTION PENCIL"], "esrb_rating": null}