{"id": 964177, "slug": "paradise-cleaning-sister-x-slaves", "name": "PARADISE CLEANING - Sister X Slaves", "name_original": "PARADISE CLEANING - Sister X Slaves", "description": "Paradise Cleaning!- Sister X Slaves - is super-casual action game.<br/>All you have to do is just cleaning out all dirty icons by dragging over them within the time limit.<br/>There are 5+1 dirty icons and each of them can be cleaned by the corresponding Cleaning tools.<br/><br/><br/>[CHARACTER]<br/>.<br/>Name: Mao Segasaki<br/>Height: 174cm<br/>Three sizes：B126 (P cup)/W65/H98<br/>Characteristics: Theater appreciation, nail art, beauty treatments<br/><br/>　The president of a design firm who is strong-willed, fastidious, and demanding of others, but is also extremely good at his job. He is the president of a design firm. In order to cover up the traffic accident caused by his sister Mio, he hid her in his house without calling an ambulance after the accident. He hid her at his own home instead of calling an ambulance after the accident to cover up the car accident that his sister Mio caused. In doing so, he planned to hide the accident from the public. His selfish and one-sided argument touches the main character, and he is He resists at first, but At first, he resists, but fearing the loss of his social status<br/>the protagonist for fear of losing his position in society.<br/><br/><br/><br/><br/>.<br/>Name: Mio Segasaki<br/>Height: 159cm<br/>Three sizes：B103 (I cup)/W57/H88<br/>Characteristics: Attracting attention, traveling, eating out<br/><br/>　He is the one who pulled the protagonist in his car at the beginning of the story. In fact, he has received a job offer as a TV announcer, In order to cover it up, he hides the protagonist in the apartment where they live with the help of his sister Mao. However, he is the perpetrator of the accident, but he is still a victim of the accident. However, even though she is the perpetrator of the accident, she has a blatant dislike for the protagonist, and is uncomfortable with him. She repeatedly makes him feel uncomfortable, and this brings him to his senses.<br/>He sees his sister being humiliated by the protagonist and asks him about it. ......<br/><br/><br/><br/><br/><br/>Features<br/>Easy-to-play design<br/>20 stages<br/>20 adult CGs<br/>11 Achievements", "metacritic": null, "released": "2023-07-28", "tba": false, "updated": "2023-07-31T02:51:58", "background_image": "https://media.rawg.io/media/screenshots/5c4/5c4f85fef13be0ded15f7a28c01c7dc4.jpg", "website": "https://www.facebook.com/Production-Pencil%E3%83%97%E3%83%AD%E3%83%80%E3%82%AF%E3%82%B7%E3%83%A7%E3%83%B3%E3%83%9A%E3%83%B3%E3%82%B7%E3%83%AB-108569011966415", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["POISON"], "genres": ["Action", "Casual"], "publishers": ["PRODUCTION PENCIL"], "esrb_rating": null}