{"id": 964108, "slug": "murder-mystery-bundle", "name": "Murder Mystery Bundle", "name_original": "Murder Mystery Bundle", "description": "Murder Mystery Bundle includes:\n<ul>\n<li>Murder Is Game Over </li>\n<li>Murder Is Game Over: Streaming Death </li>\n</ul>\n<br/>\n\nMurder Is Game Over\nMurder! A fabulously wealthy game designer is found dead outside a castle in rural Vermont, and soon evidence shows that this was not merely a freak accident attributed to local superstition. Now it's up to you to investigate and apprehend the guilty. Play as unlikely partners -- ace sleuth Detective Guy and Cleo the clue-sniffing dog to explore the castle grounds, search for clues, and question suspects. Can you solve the case?\n<br/>\n<br/>\nFeaturing:\n<br/>\n<ul><li>Murder mystery whodunit\n<br/>\n</li><li>Play as a detective and dog crime-solving team\n<br/>\n</li><li>Explore the area and look for clues\n<br/>\n</li><li>Interview suspects and make deductions\n<br/>\n</li><li>Solve the case and apprehend the guilty </li></ul>\n<br/>\n\nMurder Is Game Over: Streaming Death\nAce detective Guy and Cleo, the clue-sniffing dog, return for a spooky new mystery! On an isolated Massachusetts peninsula, a social media starlet is found murdered at the historical site of a Puritan-era witch hanging. While most superstitious residents attribute her death to a local ghost legend, our detective duo is determined to solve the case before another murder happens. Is a supernatural curse bewitching the area, or is a human criminal responsible? Search for clues, interview suspects, explore a village with a dark past, and catch the killer.\n<br/>\n<br/>\n<br/>\n<br/>\nFeaturing:\n<br/>\n<ul><li>Solve a gripping murder mystery\n<br/>\n</li><li>Play as a detective and a clue-sniffing dog duo\n<br/>\n</li><li>Investigate a creepy seaside village\n<br/>\n</li><li>Interrogate suspects and piece together the evidence\n<br/>\n</li><li>Crack the case and bring the culprit to justice</li></ul>\n<br/>\n<p>System requirements, languages, bonus goodies and features may vary between games - please check individual product pages for details.</p>", "metacritic": null, "released": "2023-07-24", "tba": false, "updated": "2023-07-28T06:14:42", "background_image": "https://media.rawg.io/media/screenshots/442/442a54184e00f44929e425883b9e48ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HitherYon Games"], "genres": [], "publishers": ["Meridian4"], "esrb_rating": null}