{"id": 964180, "slug": "dino-world-2", "name": "Dino World", "name_original": "Dino World", "description": "Embark on an exhilarating journey into a world where the heavens themselves tremble under the majestic wings of mythical beasts. \"Dino World\" is an immersive gaming experience that thrusts you into a timeless battle of good versus evil. Set against a backdrop of uncharted lands, once teeming with life but now ravaged by nefarious creatures, you must rise as a valiant dinosaur warrior, the epitome of justice, to vanquish the looming threat that seeks to plunge this realm into eternal chaos.<br/>\n<br/>\r\nIn this captivating adventure, you shall harness the elemental power of fire, channeling it through your very being, as you take a stand against the malevolent forces that infest these untamed territories. Armed with unwavering determination and an arsenal of fiery attacks, your mission is clear: to purge this world of every abomination that threatens its fragile existence. Prepare yourself, for the trials ahead will test your resilience and challenge your mettle, pitting you against hordes of sinister adversaries with only your courage as your shield.<br/>\n<br/>\r\nWithin this thrilling gameplay, you will not be alone in your valiant quest. Companions of diminutive stature, affectionately known as mini dinos, shall lend you their aid, enhancing your strength and fortitude in battle. These loyal allies will stand by your side, fighting alongside you, as you engage in heart-pounding encounters against the ever-increasing tide of darkness.<br/>\n<br/>\r\nDino World also offers a competitive edge, with a dynamic points ranking system that rewards your valor and skill. Rise through the ranks, cementing your status as an indomitable warrior, and inspire awe in your fellow players with your prowess and achievements. Each day brings a new and thrilling event, injecting even more excitement into your quest, ensuring that no two days are the same and that your journey remains as enthralling as the first time you set foot in this treacherous realm.<br/>\n<br/>\r\nPrepare to be captivated by the breathtaking world of \"Dino World,\" where the clash between legendary creatures and unwavering heroes will push the boundaries of your imagination. As the sky ignites with the fury of dragon wings, your destiny awaits. Will you rise to the challenge and become the savior this world so desperately needs? The answer lies within you.", "metacritic": null, "released": "2023-07-28", "tba": false, "updated": "2023-07-31T02:55:42", "background_image": "https://media.rawg.io/media/screenshots/fde/fdecb0094a1c6e511a6e5e85729e5509.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Atomic Fabrik"], "genres": ["Adventure", "Simulation", "Sports", "Casual", "Indie"], "publishers": ["Atomic Fabrik"], "esrb_rating": null}