{"id": 9641, "slug": "archery", "name": "#Archery", "name_original": "#Archery", "description": "Imagine waking up one day and having to do basically everything with a bow and arrow. Crazy right? Well, that is what happened to you and now you need to live your life accordingly. Play your way through your various work days where you sell ice cream to kids, make vegetarian pizzas, deliver newspapers, chop wood, catch fish, destroy someones lawnmower and various other shenanigans. We don’t judge, but we certainly encourage you to destroy EVERYTHING! After all - you’re the master of #Archery in VR. Don’t try this IRL. <br/><br/>After playing this game you can add the following job titles to your CV:<br/><br/>Pizza Baker<br/>Paper Deliver<br/>Wood Chopper<br/>Fisherman <br/>Ice Cream Seller<br/>Hot Dog Eater<br/>Florist<br/>Balloon Smasher<br/>Gunslinger<br/>Basketball Player<br/>Whack-A-Moler<br/>Airplane Crasher<br/>Fluffy Unicorn Creator<br/><br/>&amp; more to come…<br/><br/>Link to press kit: http://www.vrunicorns.com/archery<br/><br/>VRUnicorns is a bunch of game jammers from Europe. We fancy making quirky semi-realistic room scale VR sports games with a touch of grotesque humor.<br/><br/><strong>A bit of our #Archery story</strong><br/>Jakob and Max have known each other since many years. Like since waaaaay......back. Julie and Max first met each other at Shayla Games in Spring 2015. Max and Julie organized a Vive Jam in Stockholm in Autumn 2015 and Max had invited Jakob, who mainly sat in a room for himself being grumpy. <br/><br/>Julie organized a Vive Jam in Copenhagen in early 2016 and Max brought Jakob to Copenhagen. Jakob was still grumpy, but very productive and PizzaHood was the very first version of what we now call #Archery. Here’s a video of Julie playing that very first version of #Archery: <br/><br/>Video from Vive Jam Copenhagen: https://youtu.be/DFQbeYHluXk<br/><br/>Jakob and Max continued working on so-called Pizzahood and then became part of VRUnicorns early Summer 2016 (talks about it started in Amsterdam...go figure) and Julie joined the dev team as what we call #IdeaGuy (which means all talk - no talk...testing&amp;giving feedback an such). She forced the name #Archery on the game. For reasons only she knows. Julie was finally allowed to join the dev team for real early 2017 (she was kicked out of version control many times before that) and Horatiu is also working on #Archery now in between #SelfieTennis &amp; #Utopia.", "metacritic": null, "released": "2017-03-30", "tba": false, "updated": "2019-08-28T22:14:51", "background_image": "https://media.rawg.io/media/screenshots/91a/91aadd030d546dafef55ac0b94cc70ab.jpg", "website": "http://www.vrunicorns.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 10, "beaten": 1}, "playtime": 2, "achievements_count": 9, "ratings_count": 1, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["VRUnicorns"], "genres": ["Sports", "Indie"], "publishers": ["Bandello"], "esrb_rating": null}