{"id": 964172, "slug": "tricky-tracks-early-access", "name": "Tricky Tracks - Early Access", "name_original": "Tricky Tracks - Early Access", "description": "Tricky Tracks is a multiplayer hide &amp; seek game with a twist: Footprints!<br/><strong>SEEKER</strong> track them, <strong>RUNNER</strong> leave them and both teams have to cleverly use them to their advantage<br/><br/><br/><br/><h3>Various different maps &amp; unique Heroes</h3><br/>Play with different Heroes each with their own unique look and individual abilities. Are you more of a nimble and stealthy cucumber, or rather a strong and persistent robot or are you the smartest Detective in Old London?<br/><br/>The maps are also brimming with diversity:<br/><ul><li>Play in a cartoony looking Kitchen Map, that is frozen in time <br/></li><li>Roam the dark, misty alleys of Old London <br/></li><li>Take advantage of the vastness of the Industrial Map<br/></li><li>Explore the undergrounds of a Dwarven Dungeon</li></ul><br/>These and more exciting maps are waiting to be explored and ensure a high replay value.<br/><br/><br/><br/><h3>Confuse all your chasers as a RUNNER</h3><br/>Each team has unique and fun skills! As a RUNNER it is all about confusing the other team. You can lay fake tracks, rewind back in time to choose a different path and hide in props that are scattered around the map. It is up to you how you turn the footprints you leave behind into your strongest weapon against the SEEKER!<br/><br/><br/><br/><h3>Play tactical and ice-cold as a SEEKER</h3>As a SEEKER you have to keep a clear mind! Don't let the opposing team fool you. See through the tricks they are playing on you and hunt them down as fast as possible. When playing as a SEEKER, Tricky Tracks offers you special abilities which the other team does not have. With them, you have tactical advantage and together with your team mates you have all it needs.<h3>Feature Overview</h3><ul><li>Two different teams: RUNNER and SEEKER <br/></li><li>RUNNER can hide in props, lay fake tracks and rewind in time<br/></li><li>SEEKER can scan the entire map, shoot markers, lay traps and have small aids to give them tactical advantage<br/></li><li>Each character is a Hero with different traits, style, abilities and also their own little backstory<br/></li><li>Cartoony Kitchen Map: Chef \"Gaston\" VS Cucumber \"Benedict\" <br/></li><li>Spacious Industrial Map: Mechanic Girl \"Sarah\" VS Robot \"Adam\"<br/></li><li>Spooky Old London Map: Detective \"Sir Locke\" VS Evildoer \"Jacky\"</li></ul>", "metacritic": null, "released": "2023-07-28", "tba": false, "updated": "2023-07-31T02:45:36", "background_image": "https://media.rawg.io/media/screenshots/16a/16a473178e3190d27650fab7e265a93b.jpg", "website": "https://playtrickytracks.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RainLight"], "genres": ["Action", "Casual", "Indie"], "publishers": ["RainLight"], "esrb_rating": null}