{"id": 964196, "slug": "uptown-outbreak", "name": "Uptown Outbreak", "name_original": "Uptown Outbreak", "description": "The game takes place in a cyber city called Digital Haven, where the player takes on the role of a skilled player who logs in from the real world to fight against a group of rogue AI-controlled cars, known as \"bots,\" that have taken over the Uptown area. The bots are spreading a dangerous virus throughout the city and it's the player's goal to stop the spread of the virus and take down the bots.<br/><br/>The player starts in the downtown area, where they can use the currency earned from fighting the bots in uptown to buy upgrades, such as new weapons, hacking tools, and vehicles. The player can then use these upgrades to fight more effectively against the bots in uptown and earn more currency.<br/><br/>The game loop is simple, the player will be fighting the bots in uptown, earn currency, and then use that currency to buy upgrades downtown before returning to uptown again to fight more bots. The game does not feature a backstory for the player, they are simply a skilled hacker who logs in from the real world to help the NPCs in the game.<br/><br/>The game offers exciting and fast-paced gameplay, where players use their skills and upgrades to take down the bots and save the cyber city from destruction.<h3>Features</h3>Digital Haven serves as the main setting. Within Digital Haven, there are two distinct areas: Downtown and Uptown.<br/><br/><br/>Downtown is a bustling hub filled with various shops and serves as a convenient location for players to meet up with each other online. Additionally, Downtown offers a range of customization shops, allowing players to personalize their vehicles to their liking.<br/><br/>On the other hand, Uptown is where the intense battles take place. To engage in these thrilling showdowns, players need to collect items that will enhance their cars' combat capabilities.<br/><br/>As players progress through the game, they will uncover an intriguing story they can follow and participate in. This narrative element adds depth and immersion to the overall gaming experience.<h3>Online Meetup</h3><strong>The Downtown map supports online meetups,</strong> where players can gather to showcase their customized vehicles and admire each other's creations. It's a virtual space that encourages players to display their unique cars.<h3>Drift Mode</h3>Players have the option to choose between drift handling or max grip handling for their vehicles. This choice allows players to tailor their driving style to their preferences, enhancing their control and enjoyment during the battles.<h3>Roadmap</h3>The updates are on the way including new powerups, new maps, new modes, and an online PVP system. Please note that many updates will be released later on.<h3>Developer Note</h3>This game was created by a solo developer.<br/><br/>I hope you enjoyed playing as much as I enjoyed creating this game.<br/><br/><h3>Gameplay Trailer Music Credit</h3>Night Sky (ft. Julia Mihevc) by Leonell Cassio<br/><br/>Creative Commons — Attribution-ShareAlike 3.0 Unported — CC BY-SA 3.0", "metacritic": null, "released": "2023-07-28", "tba": false, "updated": "2023-07-31T03:20:25", "background_image": "https://media.rawg.io/media/screenshots/444/4448d764367b25bd0dff578e5f1e5528.jpg", "website": "https://www.printmov.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 282, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PRINTmov"], "genres": ["Action", "Racing"], "publishers": ["PRINTmov"], "esrb_rating": null}