{"id": 964171, "slug": "the-masters-pupil", "name": "The Master's Pupil", "name_original": "The Master's Pupil", "description": "Explore the eye of master artist Claude Monet and experience a unique biographical adventure! Test your skills and perseverance as you overcome the progressive disease that threatened Monet’s eyesight and solve puzzles to help the painter complete some of his greatest masterpieces!<br/><br/><br/><br/>The Master’s Pupil is a puzzle adventure game where you will travel across the iris of Claude Monet and help him complete his masterpieces. <br/><br/>Throughout the game, you will encounter and overcome increasing challenges as Monet experiences loss, like the passing of his wife Camille, and struggles with the cataracts that threatened his artistic skill. Consider color, space, and timing as you traverse the world of his eye - as one wrong color combination or move can end your journey.<br/><br/><br/><br/><br/><br/><ul><li> <strong>Hand Painted and expertly crafted</strong> - almost every part of this game has been painstakingly made using a real paintbrush in real life before being imported to the world. The results are unique visuals reminiscent of Monet’s work and imbued with the personality of the developer.<br/></li><li> <strong>Biographical Adventure </strong>- you will experience the life of Claude Monet in a way that has never been done before. Navigate intricate 3D locations, learn more about the painter’s life, and dive through a rich soundscape produced by indie composer Steven W Schouten.<br/></li><li> <strong>Calm and Relaxed</strong> - An artist doesn’t rush but takes their time when completing their work. The Master’s Pupil gives you time to consider each puzzle, with tests that will challenge your brain and not your reflexes.</li></ul><br/><br/><br/><strong>Follow the game's progress!</strong><br/><br/>Twitter: @patnaoumgames<br/>Instagram: @patnaoumgames", "metacritic": null, "released": "2023-07-28", "tba": false, "updated": "2023-07-31T02:44:10", "background_image": "https://media.rawg.io/media/screenshots/df8/df8fded3f836a4393886a74c1d7403b4.jpg", "website": "https://www.themasterspupil.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 7, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Pat Naoum"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Pat Naoum Games"], "esrb_rating": null}