{"id": 964211, "slug": "undaunted-normandy", "name": "Undaunted Normandy", "name_original": "Undaunted Normandy", "description": "<strong>The critically acclaimed, multi-award-winning World War II deck-building strategy game.</strong><br/><br/>June, 1944. Through the D-Day landings, the Allies have seized a foothold on the beaches of Normandy. Now you must lead your troops forward as you push deeper into France and drive the German forces back. You will face intense resistance, machine gun fire, and mortar bombardment, but a great commander can turn the situation to their advantage!<br/><br/>Undaunted: Normandy is the best-selling World War II deck-building game, placing you and your opponent in command of American or German forces fighting through a series of missions critical to the outcome of the war. Use your cards to seize the initiative, bolster your forces, or control your troops on the battlefield. Strong leadership can turn the tide of battle in your favour, but reckless decisions could prove catastrophic, as every casualty you take removes a card from your deck. Take charge amidst the chaos of battle, hold fast in the face of opposition, and remain undaunted.<h3>Features include:</h3><ul><li> A full recreation of the original board game.<br/></li><li> An original card and dice driven mechanic making the game highly replayable.<br/></li><li> All scenarios from the original boardgame plus two additional scenarios.<br/></li><li> Play individual scenarios or a full campaign (on Full Release).<br/></li><li> Play solo against three different levels of difficulty.<br/></li><li> Cross platform online multiplayer or local hotseat.<br/></li><li> Learn the game through a quick and engaging tutorial.<br/></li><li> Scenarios rendered in beautiful 3D maps with animated units.</li></ul><br/>", "metacritic": null, "released": "2023-07-28", "tba": false, "updated": "2023-07-31T03:40:13", "background_image": "https://media.rawg.io/media/screenshots/465/465a1b302c51922cd8ed31a3035611cf.jpg", "website": "https://www.bookmarkgames.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Bookmark Games"], "genres": ["Strategy"], "publishers": ["Bookmark Games"], "esrb_rating": null}