{"id": 964219, "slug": "elysium-trials", "name": "Elysium Trials", "name_original": "Elysium Trials", "description": "You have been chosen, prepare to be tested! Complete the trials and extract the essence from the dishonored legions by giving them a beautiful death resulting from performing combos with speed and precision!<br/>\n<br/>\r\nEarn your way to a champion difficulty where only the best warriors will compete against each other for glory.<br/>\n<br/>\r\nOh...and uh....Beware of Dragons.<br/>\n<br/>\r\nGame Features<br/>\r\nA skill-based shooter - With speed and precision, execute specific combos on each unique enemy for example by doing a quick double tap 1 shot to the body then finish with a beautiful headshot on an archer or Exploit weaknesses with timing like snapping quickly to blast a heavily armored Dragon Knight right when it's mouth opens for bonus essence. <br/>\n<br/>\r\nUse your intellect - Equipped with powerful lighting magic,  aim true and use this wisely on your enemies or unleash it when charged. Your Strategy wielding this power will come in handy, especially in champion mode difficulty. <br/>\n<br/>\r\nThe Tested Warrior: YOU. Take on unique trials that take you to entirely different worlds while battling 8 unique enemies each with their own unique attacks and ways to defeat them...also dragons..beware of dragons. Each trial comes with its own epic fantasy rock/metal music that will leave you feeling like a warrior that has gone to....Elysium.  <br/>\n<br/>\r\nRewarding Progression - Earn it! <br/>\r\n   - Racking up your score in each trial unlocks tons of new weapon models/skins getting more epic as you progress! <br/>\r\n   - Unlock a higher difficulty tier... Champion difficulty! Which has 4 more additional stronger unique enemies to deal with on top of new rules to how your lightning weapon charges. This tier has its own leaderboard bracket separate from the Warrior tier. <br/>\r\n   - Unlock the final trial for an epic battle that will remind you of some of video games' most epic boss encounters, leaving you with the true feeling of glory if and when you're victorious. <br/>\n<br/>\r\nA difficulty for everyone - With 3 unique difficulty modes and a forgiving tutorial anyone can enjoy and learn how to play Elysium Trials without getting overwhelmed by difficulty, the more you focus on the score the harder it gets, so don't be greedy or it might not end well for you! Lastly, beware that our highest-difficulty champion mode is fit to challenge the best of the best gamers in the world. <br/>\n<br/>\r\nCompete on Leaderboards - With our simple and elegant scoring system, you will know exactly how you're doing making it easy for gamers competing at the highest tier to make the decision to restart the trial or keep going for a new high score. We can't tell you how excited we are to see who the best in the world will be and what scores they will accomplish. Remember how you defeat enemies matter, and how fast you defeat bosses!", "metacritic": null, "released": "2023-07-28", "tba": false, "updated": "2023-07-31T03:49:56", "background_image": "https://media.rawg.io/media/screenshots/27d/27dda9d6652533578c455cb2499f99e1.jpg", "website": "https://www.elysiumtrials.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 527, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Filotimo Innovations"], "genres": ["Action", "Indie"], "publishers": ["Filotimo Innovations"], "esrb_rating": null}