{"id": 964203, "slug": "sinned", "name": "Sinned", "name_original": "Sinned", "description": "<strong>Sinned</strong> is a fast-paced retro FPS game situated within the darkest depths of hell where you will fight demonic legions and Pandemonius, Lord of Hell himself!<h3>FEATURES</h3>The game features 9 campaign levels with 3 boss fights. 7 customizable weapons and many different upgradable character items to give you sense of progression and ability to customize your build.<h3>MODULAR UPGRADES</h3>Throughout the game, you are collecting all sorts of weapon relics and character relics. Weapon relics serves as a way to make your weapons more powerful or even change their functionality entirely while character relics are giving you cool bonuses to your character or upgrading your base stats. There are many different relics for each weapon and your character but you can have only 3 character relics and 6 weapons relics equipped at the time. So its entirely up to you to assemble a build, that fits your playstyle.<h3>HELLFORGE</h3>Hellforge is a mechanic that allows you to upgrade each relic further more. Every relic can be upgraded multiple times but each time you are doing the upgrade, the chance for successful upgrade is decreasing. When the upgrade fails, your relic is turned into broken state and you have to repair it.<h3>PURGATORY DIFFICULTY</h3>Once you are done with the campaign, the Purgatory difficulty is unlocked where you can attempt to beat the campaign once again but on higher difficulty. Make sure to get yourself little bit upgraded before going in!<h3>THE HOODED ONE</h3>Everytime a level is completed, you can be greeted by a hooded figure who will offer you interesting deals but be aware, you'll have to sacrifice something in return.", "metacritic": null, "released": "2023-07-28", "tba": false, "updated": "2023-07-31T03:30:00", "background_image": "https://media.rawg.io/media/screenshots/1ff/1ff7d837006fd02f84a569b76d890086.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 318, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["xDenny"], "genres": ["Action", "Indie"], "publishers": ["xDenny"], "esrb_rating": null}