{"id": 964246, "slug": "every-hue-of-you", "name": "Every Hue of You", "name_original": "Every Hue of You", "description": "Every Hue of You sees Twyla struggle to take over her late mother's famed jewellery shop. One fortunate night, Twyla discovers she is a conduit - allowing her to take on the emotional energy of others, and transfer it. <br/><br/>Suddenly, Twyla is enchanting jewellery with her customers' emotions; helping them <strong>create the perfect sentimental gifts</strong> for their loved ones! Delve into <strong>deep conversation with memorable characters</strong>, and embrace them in their every hue to <strong>coax out their true feelings</strong>.<br/><br/><h3>A UNIQUE WORLD</h3>In the world of Every Hue of You, emotions have possessed a special energy for as long as we remember - <strong>Paeos</strong>. If we don't keep our Paeos under control, anything could happen. An overwhelming joy could cause a field of flowers to bloom!  ...But an intense anger could burn down forests.<br/><br/>So, in Twyla's city of Zenoa, people regulate their emotions so cautiously that emotional expression has become stigmatised. And <strong>those who struggle to control their feelings are shamed</strong> by the community.<br/><br/><h3>A COMING-OF-AGE STORY</h3>Twyla finds herself at the wrong end of society, unable to keep her emotions in line after her mother's passing has left her lost, lonely and confused. Until suddenly, a mysterious hooded man barges into her store, with a stern look in his eyes. But even he knows nothing of how her jewellery will flip their lives upside down.<br/><br/>Play as Twyla in this fantastical coming-of-age adventure as she revitalises her store and herself, working to decipher the emotional plight of her people, one customer at a time.", "metacritic": null, "released": "2023-07-30", "tba": false, "updated": "2023-07-31T04:27:58", "background_image": "https://media.rawg.io/media/screenshots/1e3/1e3c00138a4aa58bf8e2988ecfcf7527.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 304, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Cactus Jam Games"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Cactus Jam Games"], "esrb_rating": null}