{"id": 964217, "slug": "autumn-hike-2", "name": "Autumn Hike", "name_original": "Autumn Hike", "description": "<h3>Autumn Hike</h3>Embark on a breathtaking adventure through the vibrant colors of the autumn forest in this enchanting exploration game! Immerse yourself in a world filled with tranquility, wonder, and hidden treasures. Grab your backpack, lace up your boots, and get ready for an unforgettable journey!<h3>Features</h3><ul><li>🗺️ Explore a Stunning World: Traverse through picturesque landscapes adorned with a stunning palette of autumn hues. From majestic mountains to serene groves, every step reveals a new breathtaking vista.<br/></li><li>🌳 Discover Hidden Secrets: Uncover hidden paths, ancient ruins, and mysterious landmarks as you wander deeper into the wilderness. What treasures and surprises lie beyond the next bend?<br/></li><li>🎵 Serene Soundtrack: Immerse yourself in the tranquility of nature with a captivating soundtrack that perfectly complements the beauty of the autumn landscape. Let the soothing melodies transport you to a world of peace and serenity.<br/></li><li>🔍 Immersive Location Hunt: Seek out a plethora of exquisite locations, including Pine forests, camping sites, giant plants, stone monuments like Sapphire and more. Uncover hidden locations to unravel the secrets of this mysterious forest.</li></ul><br/>Prepare to be captivated by the magic of nature as you embark on an unforgettable autumn journey. Are you ready to experience the beauty and serenity of the autumn forest in Autumn Hike? Lace up your boots and step into the adventure today!<br/><br/>Note: 🍂 Autumn Hike 🌲 is best experienced with a cup of warm tea and a cozy blanket.", "metacritic": null, "released": "2023-07-28", "tba": false, "updated": "2023-07-31T03:47:41", "background_image": "https://media.rawg.io/media/screenshots/367/3679cd271a402ba6eabfcb3bf337b6c9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Morning Shift Studios"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Morning Shift Studios"], "esrb_rating": null}