{"id": 964382, "slug": "borderwatch-dark-armada", "name": "Borderwatch: Dark Armada", "name_original": "Borderwatch: Dark Armada", "description": "Borderwatch is a 3rd person co-op zombie survival game. The world is invaded by infected creatures. As <br/>a result of this invasion, the union of nations has decided to leave the world. After the decision to leave <br/>Earth, a final call has been made for the survivors. Helicopters will take off from all capitals in the world <br/>every 10 days. The people who catch up with this helicopter will survive.<h3>Build your team, Loot and Survive!</h3>The world has been under the influence of infected creatures. The United Nations has recognized that the world has become unlivable. To catch the last call, it is necessary to go to the nearest capital and get on the escape helicopter. It is a very tough fight against this infected virus that is getting stronger day by day.<h3>Attention!</h3>Infected creatures carry the characteristics of the regions they are in. The United Nations has so far performed autopsies on 2 infected creatures. As a result of the autopsy, it was determined that one of the infected creatures was pregnant and could reproduce. As a result of research on the creature that was born, it was determined that it was much stronger than its previous generation.<h3>Build Your Team</h3>Team of 4 with surrounding survivors.<br/>Organize, act strategically and be the one to increase your chances of survival in the apocalypse.<h3>Loot</h3>The only way to get rid of the infected creatures is to get on the helicopter 10 days later. In the process, use everything you find around to stay alive. Weapons, ammo, traps, medical equipment, food and water. Volunteer pilots regularly deliver supplies to the area, showing them a sign of survival.<h3>Listen to Other Survivors.</h3>Listen to radio signals from other survivors for information on the area and cooperate with them to stop the epidemic. The United Nations stated that time is running out for survivors.<br/>Note:<br/>It's the only device in the area that provides the generator radio link. Make sure the generator is running. Caution, it's unclear where the radio signals are coming from. Try to survive by making the right decisions.<h3>Survive</h3>Use limited consumables carefully, count your ammo, and be fast to survive the zombie raids that are getting harder every day!<h3>Features</h3><ul><li>Realistic post-apocalyptic graphics<br/></li><li>Strategy based 3rd person gameplay<br/></li><li>Co-op Multiplayer for up to 4 players<br/></li><li>immersive game<br/></li><li>Game mechanics improvement.<br/></li><li>3 maps: İstanbul, Abu Dhabi, Moscow and more capitals</li></ul>", "metacritic": null, "released": "2023-08-01", "tba": false, "updated": "2023-08-04T04:32:05", "background_image": "https://media.rawg.io/media/screenshots/d5b/d5b5c19d6d78905c86198f7af1120269.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 485, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blackburne Games Yazılım A.Ş."], "genres": ["Action", "Strategy"], "publishers": ["Blackburne Games Yazılım A.Ş."], "esrb_rating": null}