{"id": 964343, "slug": "battle-craft-2", "name": "Battle Craft", "name_original": "Battle Craft", "description": "<strong>Battle Craft</strong> is an online real-time strategy game where each player owns their own town. Players gather resources (gold and mana) and use them to develop their settlement, construct defensive structures, recruit and train unique heroes, with whom they embark on raids against other players' settlements. A successful raid rewards the player with resources, hero experience, and also increases their ranking among other players.<br/><br/><strong>Game Features:</strong><br/>• Beautiful graphics and special effects.<br/>• Strategy elements: it is necessary to strategically position defenses in the settlement and tactically deploy heroes during raids.<br/>• Ranking points, leaderboard, and player leagues.<br/><br/>The game features heroes such as barbarians, elves, dragons, and as players progress, they will transition to more modern and technological eras.<br/><br/>During battles, each hero's hits to different body parts, total damage, number of enemies killed, number of critical hits, and even decapitations are tracked. Heroes gain experience from battles.<br/><br/>The game incorporates various realistic mechanics:<br/><br/><strong>Battlecraft Patrolling Mechanic:</strong> <br/>In our settlement, we can set patrol points for each hero. There is a dashed line between these points, indicating the patrol path, and each point has a numbered marker. A hero can have 2 to 5 patrol points. The hero walks along these points, guarding our settlement. They have a line of sight, and if they spot an enemy during an attack, they sound the alarm, and all heroes attack the enemy. Heroes assigned to towers, crossbows, or cannons do not have patrol points. If we manage to infiltrate the enemy territory without being noticed, we can perform a silent kill and continue the attack.<br/><br/><strong>Transition to Melee Combat in Battlecraft:</strong> <br/>All heroes with ranged weapons also have additional melee weapons, such as a bow and dagger. Usually, ranged heroes maintain distance and attack the enemy using their ranged weapons.<br/>When an enemy approaches a ranged hero, they switch to melee combat, hiding their ranged weapon and drawing their melee weapon. After winning in melee combat and if there are no other enemies nearby, the hero hides the melee weapon and returns to ranged combat. Archery Towers: Towers in the Battlecraft game are buildings that we construct on the battlefield. On a tower, we can place a ranged hero by selecting the hero on the battlefield and giving them the command to go to the tower. The hero approaches the tower, takes a position on it, and their shooting range and visibility area increase by 10%.<br/><br/><strong>Cannons:</strong> <br/>Cannons themselves do not fire. Cannons are buildings that we construct on the battlefield. To make a cannon fire, we need to assign a character with the special ability to shoot from a cannon. This ability is one of the additional abilities that can be developed in the training camp. The \"artilleryman\" ability can be trained by selecting the corresponding level to improve the accuracy of cannon shooting and reloading. The cannon fires according to the character's skill level. To make a cannon shot, the character first loads it with a projectile, then takes the fuse, lights it, aims, and performs the cannon shot. When making a shot from a cannon, the character aims at the enemy with the cannon and takes into account the target's movement speed.<br/><br/><strong>Transition to Melee Combat While Firing from a Cannon:</strong> <br/>Once one of the enemies approaches the character, the character leaves the cannon and switches to melee combat, drawing the melee weapon intended for them. After defeating the enemy in melee combat, if there are no other enemies nearby, the character returns to the cannon and continues firing. Shooting at ranged heroes is done from the cannon, and the character does not switch to melee combat.<br/><br/><strong>Riding Skill in Battlecraft:</strong> <br/>Riding skill is one of the unique abilities that can be developed for a hero. Even a riding camp is a special place for training this skill. In this camp, heroes that we assign learn to ride different mounts. If a hero is training in the riding camp, they cannot simultaneously train in the combat skills training camp. Battlecraft features various mounts, and all of them require a rider to be usable in combat or for defense. If a mounted animal is killed during battle, but the hero remains alive, the hero dismounts and continues to fight. Both the rider and the mount can be attacked by enemies. When a rider is mounted, the mount does not engage in melee combat but makes lunges.<br/><br/><strong>Maiming Skill in Battlecraft:</strong> <br/>Maiming is a unique skill that allows a melee hero to sever their opponent's limbs or even split them in half. The maiming skill can be upgraded in the training camp, and it has 10 levels. With each new level, the chance of using the maiming skill in battle increases. The maiming skill is only available to heroes with corresponding weapons, such as two-handed swords, katanas, etc. Heroes with daggers cannot train in the maiming skill. When the maiming skill triggers during a battle, the hero has the opportunity to sever the opponent's hand, leg, head, or even split them in half with a single strike. If the opponent loses their head or is split in half, the hero dies instantly.<br/><br/>The game features many other realistic mechanics that await you and will pleasantly surprise you!", "metacritic": null, "released": "2023-07-31", "tba": false, "updated": "2023-08-04T03:42:57", "background_image": "https://media.rawg.io/media/screenshots/662/662c0e6b1af9e5b460e0b8731c162789.jpg", "website": "https://www.battlecraft.site/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yaremchuk"], "genres": ["Strategy"], "publishers": ["Yaremchuk"], "esrb_rating": null}