{"id": 964313, "slug": "cornucopia-2", "name": "Cornucopia", "name_original": "Cornucopia", "description": "Cornucopia - an immersive 2.5D farming sim with 50+ NPCs, innovative compost system, unique card system, 200+ recipes. Befriend, date, marry, and have children with 31 NPCs. Attend festivals, auction animals, fish, craft, and play mini-games. In-depth gardening, pet-assisted interactions, and more!<br/><br/><h3>🎉🕹️ Delight in Cornucopia's Unique Features 🕹️🎉</h3><br/><br/><br/>💖 <strong>Love &amp; Family:</strong> Embark on a journey of love, foster a warm family, and cultivate a flourishing home.<br/>🌳 <strong>Master of Agriculture:</strong> Nurture a variety of crops and trees, making your farm the envy of all.<br/>👥 <strong>Unforgettable NPCs:</strong> Build lasting relationships through thoughtful gifting and engaging encounters.<br/>🐄 <strong>Pet Power:</strong> Harness your pet's power in gathering and combat to face thrilling challenges.<br/>🌽 <strong>Bountiful Harvest:</strong> Cultivate and trade an array of crops to grow your wealth.<br/>⚒️ <strong>Skill Mastery:</strong> Hone your skills across various trades, from mining to foraging.<br/>🍳 <strong>Culinary Artistry:</strong> Whip up delightful recipes to please friends and family.<br/>🎣 <strong>Fishing &amp; Festivities:</strong> Hook various fish species, delve into immersive mini-games, and revel in festive occasions.<br/>🃏 <strong>Strategist's Deck:</strong> Collect and strategize with a diverse deck of 326 unique cards.<br/>🏡 <strong>Dream Sanctuaries:</strong> Personalize your refuge with a variety of properties, from coastal villas to tranquil mountain getaways.<br/>🐎 <strong>Thrilling Animal Racing &amp; Breeding:</strong> Unlock unique genetics and colors for the ultimate breed and race.<br/>⚔️ <strong>Heart-pounding Combat:</strong> Battle 12 distinctive enemy types and overcome 5 monumental bosses.<br/>🎁 <strong>Shopping Spree:</strong> Procure the finest items, furniture, and a diverse array of 24 powerful bombs for your adventurous journey.<br/>🖼️ <strong>Creative Freedom:</strong> Craft and unlock new furniture and decorations for your idyllic home.<br/>🌐 <strong>Rich Exploration:</strong> Explore a world teeming with hidden treasures and awe-inspiring secrets.<br/>🍁 <strong>Seasonal Experiences:</strong> Witness the beauty of changing seasons and distinct annual events.<br/>👫 <strong>Building Relationships:</strong> Foster relationships with NPCs, earning their trust and revealing unique story arcs.<br/>🏆 <strong>Achievement Hunter:</strong> Accomplish 97+ achievements for bragging rights and rewards.<br/>🔧 <strong>Home Upgrades:</strong> Amplify your home with numerous options to create your dream living space.<br/>📚 <strong>Rich Lore &amp; History:</strong> Immerse yourself in Cornucopia's intricate backstory, unraveling the tales of the land and its residents.<h3>💕 Join the Vibrant Cornucopia Community! 💕</h3><br/><strong>Connect With Us on Discord</strong><br/><br/><br/><br/>Become an invaluable part of our thriving community, a lively hub where experiences are exchanged, creativity ignites, and tales are woven. Wishlist Cornucopia and stay tuned to all our exciting updates and events. Together, let's sow the seeds of a memorable farm-life saga in the enchanting world of Cornucopia!<br/><br/><br/>https://store.steampowered.com/app/1681600<br/><br/>🎮🎥🌽 If you're a game reviewer, curator, streamer, or YouTuber 📺💻 interested in exploring the bountiful land of Cornucopia, reach out to us 📩 at <strong>david@subconsciousgames.com</strong> 🗝️🕹️.<br/><br/>", "metacritic": null, "released": "2023-07-31", "tba": false, "updated": "2023-08-04T03:03:05", "background_image": "https://media.rawg.io/media/screenshots/7a8/7a8c613ae0f6e4b3ede8699a5cd1409e.jpg", "website": "https://www.playcornucopia.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 3}, "playtime": 2, "achievements_count": 96, "ratings_count": 0, "suggestions_count": 443, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Subconscious Games"], "genres": ["RPG", "Simulation", "Indie"], "publishers": ["Subconscious Games"], "esrb_rating": null}