{"id": 964334, "slug": "bokuharen-lang-ninaritai", "name": "ぼくは人狼になりたい", "name_original": "ぼくは人狼になりたい", "description": "\"I Want to Be a Werewolf\" is a text-based adventure where you can enjoy the detective elements of the Werewolf game and the stories of the characters.<br/>Players proceed with the story by looking at the arguments of the participants and selecting the people to be eliminated and the reasons for doing so.<br/><br/>A serious young man, Shirai wakes up in a strange room.<br/><br/>Without hesitation, he is ordered to participate in the \"werewolf game\" by a person on the monitor.<br/><br/>Six men and women, similarly assembled, were waiting for me as I left the room.<br/><br/>Where the hell is this place?<br/><br/>why should i play the game?<br/><br/>What is the identity of the game master?<br/><br/>The announcement of the start of the game is played without an answer.<br/><br/>What is the \"werewolf game\"?<br/>Participants are divided into two camps, villagers and werewolves.<br/>Villager participants do not know who the werewolves are. Therefore, we will discuss and vote, and remove one human who seems to be a werewolf from the game every term. If you repeat this process and eliminate all the werewolves, you win.<br/>The werewolves can forcibly eliminate one human villager per term. Repeat this process until the number of remaining werewolves equals or exceeds the number of villagers to win.<br/>The above are the basic rules, but the detailed rules may change due to the participation of special positions.<br/><br/><br/>The game progresses by selecting the person you want to banish and the reason for it at the appropriate time.<br/><br/><br/>Let's guess who is a werewolf by checking each person's remarks and voting results.※notice<br/>Due to various circumstances, all in-game images using AI have been replaced.<br/>I am very sorry for those who were fascinated by the graphics when I first reported it and were looking forward to it.<br/>I hope you can understand.", "metacritic": null, "released": "2023-07-31", "tba": false, "updated": "2023-08-04T03:31:02", "background_image": "https://media.rawg.io/media/screenshots/9f3/9f380716210be863abee44950a422edc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["uehara create"], "genres": ["Adventure"], "publishers": ["uehara create"], "esrb_rating": null}