{"id": 964321, "slug": "sex-story-cuckold-life-episode-1", "name": "Sex Story - Cuckold Life - Episode 1", "name_original": "Sex Story - Cuckold Life - Episode 1", "description": "A steamy Visual Novel featuring high-definition graphics and realistic-looking characters, set in beautiful decor. <br/>Wanting to spice up their marital life, Adam tries to convince his loving wife, Nikki, to make him a cuckold. The opportunity arrives when she receives a text from her boss after hours, requesting her immediate return to the office for some silly made-up emergency.<br/>Will Nikki give in to her husband’s request and use her boss to fulfill the dirty fantasy? <br/>Follow the Sex Story and find out!<br/><br/><strong>Game description</strong><br/><br/>Meet Nikki &amp; Adam and embark on their journey of spicing up their marital life in a brand new and wild cuckold Sex Story.<br/><br/><strong>EPISODE 1 </strong><br/>Nikki and Adam have been married for five years and stayed loyal and truthful to each other to this very day. But having his wife step outside their beautiful marriage is one of Adam’s dirtiest fantasies. <br/>So when Nikki returns home late with an unbuttoned shirt, her husband thinks she finally found the courage to get naughty with some other guy and make him a cuckold. He’s instantly turned on, only to be disappointed when she tells him she had dinner with the girls instead.<br/><br/>Intrigued by his reaction, she channels her inner vixen, using her boss’s interest in her to seduce her husband into make-up sex. But their foreplay is interrupted by a text from the devil himself requesting her immediate return to the office for some silly emergency.<br/><br/>Adam urges her to change into something sexy and go to the office, reading the situation as the perfect opportunity to get what he needs.<br/>Will Nikki find the courage to seduce her boss and fulfill her husband’s fantasy? <br/><br/>Follow their Sex Story and find out!", "metacritic": null, "released": "2023-07-31", "tba": false, "updated": "2023-08-04T03:12:35", "background_image": "https://media.rawg.io/media/screenshots/194/194c484bfe4c2bde5e191e12a663c352.jpg", "website": "http://www.exosyphen.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 1, "achievements_count": 2, "ratings_count": 0, "suggestions_count": 228, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["EroticGamesClub"], "genres": ["Casual", "Indie"], "publishers": ["EroticGamesClub"], "esrb_rating": null}