{"id": 964341, "slug": "mage-tower-2-call-of-zadeus", "name": "Mage Tower 2: Call of Zadeus", "name_original": "Mage Tower 2: Call of Zadeus", "description": "Mage Tower (2013) was one of the first deckbuilders with damage-based combat. Now the game returns in an open-world Roguelike adventure!<br/><br/>You're a hero on a quest to stop a warlock from summoning the interdimensional monster known as ZADEUS. Travel across a randomly-generated world, visit towns, and delve into dungeons. Battle the monsters roaming the land, collect cards, and upgrade your deck.  Raise your power level, and defeat Zadeus!<br/><br/><strong>Defend the realm against the boss wizards and destroy them!</strong><br/><br/><h3>NO NODES, PLEASE</h3><br/>Travel in any direction and explore a randomized map full of towns, dungeons, monsters, events, and other secrets. A free-roaming deckbuilder you can play however you want.<h3>TOWER DEFENSE-INSPIRED COMBAT</h3>Each enemy is represented by a deck of monster cards. Monsters attack in waves just like a tower defense game, and you must destroy them before they get close enough to attack you. As enemy spellcasters appear and minibosses charge, the monster deck system provides a unique flow to combat unseen in other deckbuilders<h3>130 ACHIEVEMENTS, 6 CLASSES</h3>Progress in Mage Tower 2's robust achievement and progression system, where you can unlock new cards and artifacts, and play with different character classes such as the Brewmaster or Beast Tamer.<h3>A SEQUEL TO THE CARD GAME</h3><br/>A digital sequel and adaptation to the 2013 internationally published card game <strong>Mage Tower, A Tower Defense Card Game</strong> and its accompanying app (also on Steam under the same name.) Mage Tower 2 boasts a revamped combat system with hundreds of new cards and monsters.<h3>MORE CARD VARIETY</h3><br/>Mage Tower features more complex cards and varied card types than other deckbuilders. Build an army of Defenders (which stay in play) and equip them, then unleash them all in one devastating turn. Play \"Level Up\" cards which gain power each time you play them. Cast devious \"Scheme\" cards which are overpowered but take time to take effect. And lots more!<h3>FEATURES:</h3><ul><li>Single-player<br/></li><li>A combination of roguelike deckbuilders and tower-defense inspired combat. Fight off waves of monsters as you manage your deck and spells.<br/></li><li>Wander an open world made up of 5 biomes. Visit towns, discover magical obelisks, and more.<br/></li><li>6 playable classes, with more to come<br/></li><li>Achievement-based progression system.<br/></li><li>A varied card pool that includes 8 different card types and robust interactive mechanics.<br/></li><li>Delve into dungeons where your life doesn't recover, but you can seek powerful Legendary rewards.<br/></li><li>Collect trade resources to draft specific cards. Build the deck you want like you would be able to with your collectible card game collection in real life.<br/></li><li>Late 90's aesthetic.<br/></li><li>Defend the realm against Boss Wizards' attempts to conquer towns.<br/></li><li>Build buildings in towns to receive powerups and gain resources.<br/></li><li>Crazy boss fights! Battle dozens of plant monsters, a camp of hidden bandits, warlocks with otherworldy spells, or multiple cards representing the various parts of a single foe.<br/></li><li>Will you build your deck from dungeon cards, trade resource card picks, or good old-fashioned card drafts?<br/></li><li>Easy to learn - The original card game has a \"medium\" complexity rating on BGG. Cards and mechanics are introduced at a reasonable pace through the progression system. After the one battle tutorial, you can pretty much do anything.<br/></li><li>Sequel to the 2013 internationally release card game and app.<br/><br/><strong>Join us on our Discord here: https://discord.gg/qJwC8PBSBr</strong></li></ul>", "metacritic": null, "released": "2023-07-31", "tba": false, "updated": "2023-08-04T03:40:09", "background_image": "https://media.rawg.io/media/screenshots/31b/31bd0be15df3c116a3c09fd98e7f2036.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 497, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Super Mega Games®"], "genres": ["Strategy"], "publishers": ["Super Mega Games®"], "esrb_rating": null}