{"id": 964366, "slug": "boxes-5", "name": "Boxes", "name_original": "Boxes", "description": "<strong>introduction</strong><br/><br/>Welcome to <strong>Boxes</strong>, a nostalgic pixel art game that will put your puzzle-solving skills to the test! Embark on a delightful journey through over 100 mind-bending levels in this charming and addictive box-pushing adventure. Prepare to be captivated by the retro-inspired visuals, immersive gameplay, and a wealth of challenging puzzles that will keep you hooked for hours on end.<br/><br/><strong>key Features</strong><br/><br/>Classic Pixel Art: Immerse yourself in a beautifully crafted pixel art world, reminiscent of the golden age of gaming. The game's retro aesthetics will transport you back to the days of 8-bit gaming nostalgia.<br/><br/>Engaging Gameplay: Prepare to exercise your brain as you navigate through a series of increasingly complex levels. Push boxes strategically, avoid obstacles, and find the optimal path to solve each puzzle. With multiple mechanics introduced throughout the game, you'll always encounter new and exciting challenges.<br/><br/>Over 100 Puzzles: Test your problem-solving abilities across a vast array of meticulously designed levels. Each level presents a unique and thought-provoking puzzle, ensuring that you'll never run out of brainteasers to solve.<br/><br/>Progression and Difficulty: Start with simpler puzzles and gradually work your way up to the most challenging brain teasers. As you progress, the game will introduce new elements, obstacles, and mechanics that will push your skills to the limit.<br/><br/>Retro Soundtrack: Immerse yourself in an enchanting retro-inspired soundtrack that complements the pixel art visuals and enhances your gaming experience.<br/><br/>Intuitive Controls: Navigate the game effortlessly with simple and intuitive controls. Pixel Puzzler is designed to be accessible to players of all skill levels, from casual gamers to experienced puzzle enthusiasts.<br/><br/>Are you up for the challenge? Put your problem-solving skills to the test in Pixel Puzzler, the ultimate pixelated box-pushing adventure. With its captivating pixel art, challenging puzzles, and addictive gameplay, this game guarantees countless hours of fun and nostalgia. Get ready to embark on a journey that will challenge your mind and satisfy your retro gaming cravings. Can you conquer all 100 levels and become the ultimate Pixel Puzzler master?", "metacritic": null, "released": "2023-08-01", "tba": false, "updated": "2023-08-04T04:11:25", "background_image": "https://media.rawg.io/media/screenshots/4ff/4ff0d61993568b60200803989ef72ad6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 6, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aisoko Game"], "genres": ["Casual"], "publishers": ["Aisoko Game"], "esrb_rating": null}