{"id": 964361, "slug": "chess-remix-chess-variants", "name": "Chess Remix - Chess variants", "name_original": "Chess Remix - Chess variants", "description": "Unlock the World of Chess with Chess Remix - A New Era of Chess Gaming!<br/>\n<br/>\r\nExperience the thrill of playing Chess like never before with Chess Remix, your ultimate destination for a diverse range of Chess games from around the world. Explore ancient versions of Chess and Shogi, trace the evolution of these games from Chaturanga, and get ready to play the Viking's Chess game Hnefatafl. With hundreds of games to choose from, including European, Japanese, Korean, Chinese, Thai and Mongolian Chess, you'll never run out of options.<br/>\n<br/>\r\nBut wait, there's more! Chess Remix lets you customize the rules of your game and play how you want. From crazyhouse, atomic, 960, king of the hill, absorption, losing, forced capture, and beyond, the possibilities are endless. Create the next big board game with the most advanced Chess variant creator - assign special powers to pieces, add unique behaviours to board squares, and share your creations with friends and other players.<br/>\n<br/>\r\nWhether you're a seasoned Chess player or a beginner, Chess Remix has something for everyone. Play with AI, challenge friends, watch AI vs AI battles, or invent your own game. With customisable styles, dark and light themes, and no signup or login required, the app is designed for a seamless and enjoyable experience.", "metacritic": null, "released": "2023-08-01", "tba": false, "updated": "2023-08-04T04:06:01", "background_image": "https://media.rawg.io/media/screenshots/586/586694af57c6cf5d0766159e1d7845e2.jpg", "website": "https://chessremix.app/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Alexander Everett"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Everett App Development"], "esrb_rating": null}