{"id": 96445, "slug": "flight-deck-itch", "name": "Flight Deck (itch)", "name_original": "Flight Deck (itch)", "description": "Flight Deck\r\n<p>Welcome to the world of commercial flying! Your goal in Flight Deck is to use cards to safely pilot a plane to your destination while keeping passengers happy and your plane intact. </p>\n<p>All content for Flight Deck, including game concept and design, source code, artwork, sound effects, and music, was developed by our team in just three days for ludum dare 41. No outside assets were used.</p>\n<strong>Gameplay</strong>\n<strong>Controls</strong>\n<ul><li>Left-click to play or discard a card.</li><li>Right-click to view a card. </li></ul>\n<strong>Pre-flight Effects</strong>\n<p>Before you take off, pre-flight effects are determined. </p>\n<ul><li><strong>Age of the Plane</strong> - New planes have stronger, more durable equipment and are easier to repair. Old planes are just the opposite. </li><li><strong>Flight Crew Attitude -</strong> Happiness is contagious, but a rude crew will bring everyone down.</li><li><strong>Plane Capacity -</strong> No one wants to be squished on their flight. Especially if a bunch of empty seats means some free upgrades to first class.</li><li><strong>Time of Departure -</strong> Delayed flights are the worse! Early flights are great for those who managed to board. Regardless though, the passengers have short memories once you're in the air.</li></ul>\r\nWeather\r\n<p>Weather plays a big role in how successful your flight is. Every so often, you'll encounter new weather patterns. Each weather system has a different effect, and you'll definitely want to get through the harsh weather as quickly as possible.</p>\r\nGauges\r\n<p>After taking off, you're in control. The four on-screen gauges must be monitored closely to ensure a smooth flight. </p>\n<ul><li><strong>Altitude </strong>- This is your altimeter. You want to keep it close to center as possible. Too high and your plane will start to break down. Way too high and you'll enter orbit. Too low and your passengers will start panicking. Way too low and you just killed everyone on board.</li><li><strong>Speed</strong> - How fast you're traveling. If you're unlucky enough for this drop completely, you'll start free-falling and lose altitude quickly. Better get it back in gear ASAP.</li><li><strong>Happiness </strong>- Part of your job is to ensure the customers' happiness. It leads to more business and more money for you. If this bar hits 0, you better watch out. The customer may start rioting and damage the plane.</li><li><strong>Condition</strong> - This is your plane's condition. It can be lowered by weather, mechanical failures, and rioting passengers. If this hits 0, you might want to look for an eject button...</li></ul>\r\nCards\r\n<p>Cards are used to control the airplane and your passengers. <br/>Each one has a unique effect that occurs when that card is played. <br/>You begin with 5 cards in your hand each turn. <br/>You can hover a card to slightly expand it or right click to get a detailed view.</p>\r\nTurns\r\n<p>The current phase of the turn can be seen in the upper-left of the screen.</p>\n<ol><li> Flip a card from the deck. The effects of that card is applied. </li><li> Choose a card from your hand to play. Those effects are applied as well. </li><li> Discard one card from your hand and draw two new cards. </li><li> All persisting affects are applied, and your plane advances along its course. *</li></ol>\n<p>    *If you reach your destination at the end of a turn, you attempt to land. However, certain weather types may force you to a hold pattern. You continue to the next turn until you can successfully land.</p>\r\nFuture Plans\r\n<p>While we believe this is already a fairly complete game, there are some tasks we would like to still implement in the future. Some of the audio balancing needs to be adjusted, and partical effects stabilized on weather cards. We also are planning on adding additional cards and effects, more balanced gameplay, and additional settings such as difficulty of flights and varying flight distances (maybe use real airports).  If you have any feedback or ideas, feel free to let us know. Thanks!</p>\r\nTeam Info\r\n<p>We first came together as a group during our senior project at the University of Central Oklahoma, where we all studied computer science. Our diverse backgrounds and interests have led to a versatile and dedicated group, all with a passion for gaming. This is our first ludum dare game.</p>\n<p><strong>Adrian Kovatana </strong>-  Programming and Development<br/><strong>Cody McGuire</strong> - Programming and Development, Menu Music and Voices <br/><strong>Cole Penning</strong> - Card Design, Sound Effects, Rainbow Music, and Voices <br/><strong>Don Nguyen</strong> - Partical Effects<br/><strong>Virgil Stringfield</strong> - Background and Card Art (check out more amazing artwork here)</p>\n<p><strong>All </strong>- Game Concept and Design</p>\r\nQuotes From The Team\r\n<p>\"I'm hungry and tired.\" - <strong>Adrian</strong><br/></p>\n<p>\"Game Jams are stressful, but oh so satisfying when you finish and submit. A word to my fellow developers...SCOPE. That is all.\" - <strong>Cody</strong></p>\n<p>\"This weekend has been nuts. Trying to come up with all custom sound effects for the first time was a huge challenge. All sound effects in the game were created with a headset microphone, household objects, and Audacity for editing. Music was created in beep box.\" - <strong>Cole </strong></p>\n<p>\"yeah here's my quote ......\" - <strong>Don</strong></p>\n<p>\"2.5 images an hour\" - <strong>Virgil</strong></p>", "metacritic": null, "released": "2018-04-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/165/165e994f5fdf78a5c1ad72af8f1b2de0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Kovakomes", "SBX5", "Mister_Kweh", "cole_of_oklahoma", "CaryStringfield"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}