{"id": 964474, "slug": "demons-bane", "name": "Demon's Bane", "name_original": "Demon's Bane", "description": "Venture into the fallen kingdoms and adventure in this roguelike deckbuilding game that combines strategic card combat with randomly generated levels. As a hero on a quest to save the animal kingdom, you must navigate through ever-changing regions filled with danger and treasures.<br/>\n<br/>\r\nWith 10 distinct classes, each offering a unique playstyle and a vast array of cards, you'll have countless strategies at your disposal. Unleash devastating attacks, cunning defenses, and powerful buffs as you assemble your deck from a selection of over 350 cards. Experiment with different combinations to find the perfect synergy that suits your preferred playstyle.<br/>\n<br/>\r\nThe game's innovative card combat mechanic uses on a 3x3 grid, which represents your hand of cards. In each round, you strategically play cards from this multi-colored grid, unleashing their effects and influencing the flow of battle. But before the combat begins, you have the opportunity to manipulate the colors of this grid, determining which cards you will activate and which color your opponent will be using.<br/>\n<br/>\r\nPrepare yourself for intense encounters with over 100 enemies and 20 bosses, each with their own unique abilities and challenges. Along your journey, you'll also come across 25 \"friendly\" encounters, offering opportunities to optimize your deck, gain rewards, or unexpected consequences.<br/>\n<br/>\r\nAs you progress, you'll unlock an expansive arsenal of over 50 upgrades and abilities, allowing you to enhance your deck and strengthen your heroes. Choose wisely to adapt to the ever-increasing challenges that await you.<br/>\n<br/>\r\nAt the pinnacle of your journey, you'll face the ultimate test: a showdown against the Demon King. Rally your skills, refine your strategy, and summon your courage to overcome this fearsome adversary and save the animal kingdom from impending doom.<br/>\n<br/>\r\nWith the emphasis on strategic gameplay, this roguelike deckbuilding game promises countless hours of challenging battles, and strategic decision-making.", "metacritic": null, "released": "2023-08-03", "tba": false, "updated": "2023-08-04T06:27:48", "background_image": "https://media.rawg.io/media/screenshots/9c0/9c06f7a804f93d1119a88e3a531b0f7c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 285, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JD van Dingenen"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["JD van Dingenen"], "esrb_rating": null}