{"id": 964406, "slug": "my-kingdom-for-the-princess-ii", "name": "My Kingdom for the Princess II", "name_original": "My Kingdom for the Princess II", "description": "\"My Kingdom for the Princess 2\" is a distinctive mixture of click management and building simulation that works perfectly!<br/>\r\nThis sequel builds on the original formula with some new captivating mini-games. Can you overcome the obstacles and save the day?<br/>\n<br/>\r\nThe adventures of Arthur and Princess Helen continue in this long awaited sequel to the addictive strategy, time management, simulation game.<br/>\r\nIt’s up to Arthur to clear the land in pursuit of Longbeard the Dwarf and rescue Princess Helen. On his way to triumph he will have to defend against invaders, and work with magical beings like flying cats and witches.<br/>\r\nThere are six dozen of levels to beat along with numerous tasks to complete and plenty of strategies to plan. In addition to standard tasks like clearing roads, building things and collecting resources, there are also trophies just waiting to be collected and mini-games to add to the fun!<br/>\r\nWill Arthur be able to save the day? There's only one way to find out and try the game!<br/>\n<br/>\n<br/>\r\nMain game-features:<br/>\r\n- Long-awaited sequel to the award-winning title My Kingdom For The Princess<br/>\r\n- Unique mixture of genres - time-management, strategy and farm simulation<br/>\r\n- Great, intrigue and full of adventures story<br/>\r\n- New characters and obstacles<br/>\r\n- More than 50 base levels and plenty of special tasks and mini-games<br/>\r\n- Diverse achievements for excellent performance", "metacritic": null, "released": "2023-08-02", "tba": false, "updated": "2023-08-04T05:00:45", "background_image": "https://media.rawg.io/media/screenshots/cbb/cbbea3eacc7df51e77bbb8a2b6f3e050.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 330, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nevosoft"], "genres": ["Strategy", "Simulation", "Casual"], "publishers": ["Best Place Apps"], "esrb_rating": null}