{"id": 96448, "slug": "the-rock-and-the-rose", "name": "The Rock and the Rose", "name_original": "The Rock and the Rose", "description": "<p>You've just inherited Lake Manor from your eccentric Aunt Agatha, but the manor is in a dismal condition and you have no money to pay for repairs and its upkeep. You decide to convert it to an inn, but is there more to the manor than meets the eye? \r\n  </p>\n<p><strong><em>Highlights: \r\n  </em></strong></p>\n<ul><li>Explore the      manor, fix it up and unlock different rooms (there must be a secret room      somewhere, right?). \r\n</li><li>Hire an      interesting cast of characters to work at your inn. \r\n</li><li>Meet a gaggle of      guests who have different needs and preferences. \r\n</li><li>Configure the guest rooms to satisfy your visitors. \r\n</li><li>Complete the      tasks on the to-do list so kindly provided to you by your butler,      Wodehouse, and earn enough money to pay for the upkeep of the manor!</li></ul>\n<p><strong><em>Game instructions:</em></strong><br/></p>\n<ul><li><strong>Mouse</strong>: left-click on a location to navigate there, and \r\nleft-click on a character or item to interact with it or to \r\nselect a choice. Right-click to access the <strong>Main Menu</strong> or to cancel or delete.</li><li><strong>Keyboard</strong>: Use the arrow keys to navigate, and the \r\n<strong>Z or ENTER</strong> key to interact with people or items. Use the <strong>X</strong> or <strong>ESC </strong>keys to access the <strong>Main Menu</strong> or to cancel. Press the <strong>SHIFT</strong> key while walking to walk faster.</li></ul>\n<p><strong><em>Credits</em></strong><br/></p>\n<p><strong>Plug-ins: </strong>Yanfly, Galv, Galenmereth, Hudell, Sasuke Kannazuki, mrcopra, Shaz, Yami</p>\n<p><strong>Graphics: </strong>Kadokawa, REFMAP, Degica, Enterbrain, Avery, Chalkdust, whtdragon, WikiArt\r\n  </p>\n<p><strong>Title image: </strong>Original image by Alain Audet from Pixabay, transformed stylistically using machine learning software.</p>\n<p><strong>Music:</strong> J.C. Brickston<br/> </p>\n<p>I am eternally grateful to Paul for brainstorming sessions and playtesting.<br/></p>\n<p>This game was developed by SeaPhoenix using RPG Maker MV.<br/></p>\n<p><strong><em>Notes</em></strong><br/></p>\n<p>This game was made for the 2017 Indie Game Maker Contest. It's a short game, meant to finished within an hour. I plan to develop it further but that'll probably be in the far future rather than the near future. :) <br/></p>\n<p>Please leave a message if you have any comments or if you experience any bugs. The game was updated on Dec 19, 2017 after the judging period for IGMC ended to fix a few bugs that other players had found.<br/></p>", "metacritic": null, "released": "2017-11-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e77/e77fedb3e1e7ad1b2b17e403cffde805.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["seaphoenix"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}