{"id": 96447, "slug": "riposte", "name": "Riposte", "name_original": "Riposte", "description": "<em>\"Pangalactic fisticuffs and fast paced live or die sword fights. Riposte is online and couch arena brawling at it's best!\"</em><p>Quick and intense arena brawler</p><p>Asymmetric lightning fast combat<br/></p><p>If you love games like Towerfall, Samurai Gunn, or Smash, you'll also love Riposte!<br/></p><p>This build contains three out of eight playable characters. Each character is uniquely distinct. The different abilities, weapons and moves give a lot of diversity, while in-game pickups and level events create new tactical options and scenarios.</p>Alpha Build V0.100a<p>This is a preview build that is being made available alongside our Kickstarter and Greenlight campaigns. Please see our Kickstarter page for where we're headed with this project and to check for the latest updates. You can support us by helping us get through Greenlight, and by backing us on Kickstarter. Even a small donation can make a big difference!</p>Alpha Features<ul><li>Local Multiplayer: Play with up to four people</li><li>Distinct Characters: Three characters, each with their own attacks and special ability</li><li>Dynamic Levels<br/></li><li>Easy to pickup, hard to master</li><li>Super fast: Rounds last between thirty seconds to two minutes, creating intense and exciting matches!</li></ul><p><em>-- The final version of the game is built around custom networking tech and is highly optimized for online multiplayer! --</em><br/></p>Alpha Build Limitations<p>Note that this build is considered 'Alpha', which means that the game isn't yet complete and we're actively working on it. With this demo build we want to give a good impression of our direction with the game. We've limited the demo to include:</p><ul><li>Deathmatch Mode. We're still working on adding more game modes</li><li><strong>Local Multiplayer Only</strong>. We'd love to show to you how awesome our custom engine and networking tech is at handling a fast paced game like this. However, we're still missing key matchmaking and lobby features that are required to give a good multiplayer experience. Once we're through Greenlight, we'll begin work on integrating matchmaking through Steam, which will make getting into a game quick, easy and simple</li><li><strong>Only three out of eight characters</strong>. Because we want to keep you guys wanting for more!</li></ul>", "metacritic": null, "released": "2015-10-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/496/496b37934e9ac42db93a1dd1392db3db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["damajogames"], "genres": ["Fighting", "Platformer"], "publishers": [], "esrb_rating": null}