{"id": 964430, "slug": "axon-td-uprising-tower-defense", "name": "Axon TD: Uprising - Tower Defense", "name_original": "Axon TD: Uprising - Tower Defense", "description": "Axon TD infuses a new layer of strategy into Mazing Tower Defenses. Typically, you build towers on the path to obstruct enemies and make the path longer. But what if you could take control of the map layout itself and expand things directly? In Axon TD, you're given a brush, and the map is your canvas!<br/><br/><h3>A Shifting Battlefield</h3>The name of the game is map manipulation. Place down tiles to make longer paths and support more towers. Tiles can also bridge to various islands scattered around the map; these provide entire new chunks to maze with. On various maps, you can even place a new destination point!<br/><br/><br/><h3>Survival of the Fittest</h3>A roguelite mode where you face the gauntlet of randomized maps, towers, and techs. Adapt to a rapidly expanding map area and take advantage of an accelerated tower technology progression. Surviving earns you a place on the global leaderboard.<br/><br/><br/><h3>Bring Your Friends</h3>Online co-op supports up to 4 players. With maps designed for 2, 3, and 4 players you'll find a wide variety of battlefields to conquer and make your own. A global leaderboard allows you to see how you compare to other teams. Will your team come out on top?<h3>Story Driven Campaign</h3>You play as a defense contractor on a routine mission. As you arrive, your ship is shot down, and you're attacked by a robotic force called the Axons. Your only way off the planet is to fight. Build towers against hoards of enemies, progress through a tech upgrade tree, and defeat epic bosses! You may even find out the truth behind the ongoing war…<h3>Towers, Lots of Towers</h3>With so many map layouts at your disposal, you want a huge arsenal of towers to play with. Dozens of towers, each with their own effect, fulfills that need. Towers also have three possible upgrades, and these upgrades add either new effects or change existing ones.<br/><br/><br/><h3>Cunning Enemies</h3>What complements a ton of towers and a lot of maps? A wide variety of enemies having different abilities, of course. From those that move faster around corners to those that teleport nearby enemies forward, the Axons are devious in their onslaught.<h3>Early Access Features</h3><ul><li>32 Towers and Traps<br/></li><li>8 Castable Abilities<br/></li><li>Mechanics for Map Manipulation<br/></li><li>25+ Unique Enemies<br/></li><li>Co-op with up to 4 Players<br/></li><li>Survival Mode<br/></li><li>Partial Campaign with 15+ Levels<br/></li><li>Leaderboards for Survival, Co-op, and Quick Play Modes</li></ul><br/>With a wide selection of tower variations to upgrade and an array of complex strategic maps to test your defenses, even the most skilled Tower Defense players will meet a challenge in Axon TD.", "metacritic": null, "released": "2023-08-02", "tba": false, "updated": "2023-08-18T02:14:17", "background_image": "https://media.rawg.io/media/screenshots/544/5440ab953f05e9b4008a3f1503779c90.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 2}, "playtime": 3, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 463, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Element Studios"], "genres": ["Strategy", "Indie"], "publishers": ["Element Studios"], "esrb_rating": null}