{"id": 964525, "slug": "white-album-memories-like-falling-snow", "name": "WHITE ALBUM: Memories like Falling Snow", "name_original": "WHITE ALBUM: Memories like Falling Snow", "description": "<h3>JOIN OUR COMMUNITY</h3><br/><h3>Sobre o jogo</h3><br/><br/>The classic visual novel from AQUAPLUS that launched one of Japan's most beloved franchises.<br/><br/>WHITE ALBUM is a story of love in many forms.<br/><br/>Touya Fujii is an ordinary college student but for one thing:<br/>His connection to the popular singer Yuki Morikawa.<br/><br/>That popular singer, you see, is his girlfriend...<br/>and the more popular she gets, the less time<br/>the two can spend together.<br/>Will they stay a couple, or will their ways part?<br/>As winter falls and the air grows colder,<br/>the two lay down new tracks in the album of their love...<br/><br/>This album will be as white as snow, and as poignant.<br/><br/><h3>CHARACTERS</h3><br/>An up-and-coming singer who made her debut just one year ago. She's been dating Touya ever since high school, and the two now attend the same college. However, her increasing popularity hasn't improved their relationship, and instead is threatening to tear them apart.<br/><br/><br/>Yuki's senior coworker at the production agency they both belong to, Rina Ogata grew into stardom from a young age due to a mixture of talent and hard work... not to mention her good looks, quick thinking, smooth manners, accumulated experience, unwavering singing voice, and unbreakable spirit. These traits and more have helped make her an unstoppable force in the entertainment world—and all she had to sacrifice was any semblance of a personal life.<h3>PROLOGUE</h3><br/>Strains of a song drift on the cold winter wind,<br/>and outside a music shop, my feet come to a stop.<br/>The cathode-ray tubes of the monitor pipe in a picture<br/>and I stand here, on the other side, silently watching.<br/>On my way home from classes, amid the biting chill, she holds me rapt...<br/><br/>It's been as ordinary as every other day of my life.<br/>Ordinary, that is, in every way except one.<br/>We've clung together just as always, even since her debut.<br/>At least so far.<br/><br/>She leads her extraordinary life, and I live my mediocre one.<br/>People meet, and they break up, and get all mixed up together,<br/>but the days spin by all the same.", "metacritic": null, "released": null, "tba": false, "updated": "2023-08-07T02:23:14", "background_image": "https://media.rawg.io/media/screenshots/860/860b4e071a6acfbe81d0812c19c6ae58.jpg", "website": "https://shiravune.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 275, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aquaplus"], "genres": [], "publishers": ["Shiravune", "DMM GAMES"], "esrb_rating": null}