{"id": 964587, "slug": "hia-horror-investigation-agency", "name": "H.I.A: Horror Investigation Agency", "name_original": "H.I.A: Horror Investigation Agency", "description": "Join the fun in this brand new Early Access Multiplayer Horror Game!<br/><br/><h3>WELCOME TO THE H.I.A: HORROR INVESTIGATION AGENCY</h3>The H.I.A. is a <strong>fun multiplayer horror game</strong> in which you and <strong>co-players</strong> have to <strong>investigate horror cases</strong>. Among finding victims and evidence of the horror event that has taken place, you will be faced with <strong>jumpscares</strong> and scary monsters along your investigation. Get the evidence you need and return to the H.I.A. headquarters safe and sound.<h3>FEATURES</h3><ul><li> <strong>1-6 player online co-op</strong><br/>Play through fun horror missions together with your friends or with random teammates. Explore unique missions with each their own story and challenges. Have you and your friends got what it takes to complete them?</li></ul><ul><li> <strong>Welcome new employee!</strong><br/>As an H.I.A. employee it is your task to help horrified customers in need. Manager Dominic is always on the phone with new customers which you can help. Head over to Ricky, select a case, and finish the job.</li></ul><ul><li><strong>Casual</strong><br/>Apart from solving horror cases, the H.I.A. is also a great place to have casual fun with friends. Hangout, spend time, make yourself look cool, and don't poop your pants when the monster gets you!</li></ul><h3>SOCIALIZE</h3><br/>Besides the H.I.A. being a horror game, the H.I.A. is also a place to <strong>socialize</strong> and have fun with others. Make use of chat, chat emotes, gestures and physical emotes to express yourself and communicate with friends and fellow players.<h3>APPEARANCE</h3><br/>Customize your character <strong>appearance</strong> and express yourself with a variety of <strong>clothing &amp; cosmetic</strong> options. Hats, outfits, backpacks and more customization options on its way.<h3>GADGETS</h3><br/>The H.I.A. has a fun and intuitive <strong>tool system</strong>. Interact with tools around the world, each having their own unique functionality. Pick them up and store them in you tool slots.<h3>SOLVE CASES</h3><br/>Decide which mission you and your friends will be playing by selecting cases in the lobby. Once you and your friend have decided on which case to solve, jump in the car and head to the mission.<h3>NPC INTERACTIONS</h3><br/>Interact with <strong>lively NPCs</strong>. Some tell you some stories, other ask you for help, and who knows, some might even jumpscare you!<h3>THINGS YOU CAN DO IN H.I.A.</h3><ul><li> Play missions</li></ul><ul><li> Fun multiplayer with up to 6 players</li></ul><ul><li> Replayability</li></ul><ul><li> Socialize with friends or strangers</li></ul><ul><li> Customize your character</li></ul><ul><li> Talk with NPCs</li></ul><ul><li> Equippable tools</li></ul><ul><li> Horror chasing AI</li></ul><ul><li> Jumscares</li></ul><ul><li> Chat &amp; Voicechat</li></ul><ul><li> Emotes &amp; Gestures</li></ul><ul><li> Puzzles</li></ul><ul><li> Find/Collect objects</li></ul><ul><li> Objectives</li></ul><ul><li> Arcade Gamemodes (Coming Soon)</li></ul><br/>And plenty more features added every week!<h3>What you can also expect in H.I.A:</h3> Jumping across obstacles, Fun(ny) horror stories, Different types of Equipment, Socializing, Multiple unique Monsters and Cases to solve, A mighty fun time.", "metacritic": null, "released": "2023-08-05", "tba": false, "updated": "2023-08-18T02:04:50", "background_image": "https://media.rawg.io/media/screenshots/9ee/9ee1b88dfb36a325ff72396714ec5e63.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 255, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Kekdot"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Kekdot"], "esrb_rating": null}