{"id": 964528, "slug": "the-witch-knight-anna-the-black-serpent-and-the-go", "name": "The Witch Knight Anna -The Black Serpent and the Golden Wind", "name_original": "The Witch Knight Anna -The Black Serpent and the Golden Wind", "description": "&gt;Story Summary<br/>The latest in the “Heroine in a Pinch” series brought to you by the futanari focused circle “Circle Sigma”!<br/><br/>The curtain opens………☆ …☆ …☆ …☆ …☆ on the Witch’s Banquet!<br/><br/>Number of Erotic Scenes<br/>11 Erotic Scenes<br/>22 Basic Erotic CGs<br/>A total of 362 Erotic CGs including all the variances! <br/><br/>We want to deliver this to all the futanari lovers out there! The amazing initial volume in the series! <br/><br/>&gt; Synopsis<br/><br/>It has been a thousand years since the wicked Genies began to appear in this world. Humans offer their “Souls” to these Genies in exchange for having their wishes granted. The maidens who battle against these wicked Genies are known as the Witch Knights.<br/><br/>Anna, a new member of the Witch Knights, heads to one of the Genie’s strongholds, a “Genie Mansion”, after consulting with her Master as usual. Along with her Master, Rain, they arrive at the Genie’s stronghold. However… Anna is suddenly attacked by Rain when they arrive. It turns out that Rain is actually the nemesis of the Witch Knights, Lilith, the Mother of Genies.<br/><br/>Anna is attacked by Lilith who has transformed into a hermaphroditic form and loses consciousness. Then… when she awakens, she is trapped within the Genie Mansion and Mami, Rain’s aide appears… already having had her soul stolen by a Genie. <br/><br/>Anna, who has had a magical tool called a “Mara” placed around her neck, finds that it can grant an sexual wish.<br/><br/>After this, she is attacked by her friends who have had their souls stolen by various Genies… Will Anna be able to save her friends from the clutches of the Genies living in this debauched Mansion?<br/><br/>Character Introductions<br/><br/>☆Anna<br/>The heroine of this work, she is a good Witch that hunts down and defeats Genies. She is one of those that are commonly called a “Witch Knight”. She is captured and taken inside the Genie Mansion. There she is given a cursed magical item that makes her grow a penis and forced to commit lewd acts in order to escape the Mansion. <br/><br/>☆Rain <br/>Feared by her enemies as the strongest Witch, Rain is Anna’s mentor and master. On her way to the Genie Mansion with Anna, she suddenly attacks Anna and steals her virginity. What are her true intentions?<br/><br/>☆Mami<br/>One of the Witch Knights, she has served Rain as her right hand man for many years. Once Anna is within the Genie Mansion, she appears before her. She then performs many debauched and lewd acts. Her body is said to be controlled by a Genie… but is that really the truth…<br/><br/>☆ Emi<br/>A mysterious girl who was saved by Anna while being pursued by several Genies. Once Anna is captured and placed in the Genie Mansion, they once again meet. At this time, she tells Anna that she will serve her and take care of her sexual and personal needs. What is her true aim and identity?", "metacritic": null, "released": "2023-08-03", "tba": false, "updated": "2023-08-07T02:27:04", "background_image": "https://media.rawg.io/media/screenshots/652/652b453cbd65021e66c4a98cc8be9acc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 339, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CircleΣ"], "genres": ["Adventure"], "publishers": ["CircleΣ"], "esrb_rating": null}