{"id": 964558, "slug": "police-car-escape-simulator", "name": "Police Car Escape Simulator", "name_original": "Police Car Escape Simulator", "description": "Police Car Escape Simulator is an action-packed driving simulation set in the desert. Players will find themselves in a breathtaking chase after the cops in this gripping game with stylized graphics. The main aim of the game is to use the vehicle you are driving skillfully to neutralize the cops chasing you and to escape as long as possible.<br/>\n<br/>\r\nPlayers start with just a basic car in the first place. This car is sensitive enough to immediately kick the player out of the game as a result of collisions. But do not be afraid, because, with the rewards you will get in the game, you can unlock more powerful and durable vehicles. Other vehicles have a higher damage tolerance, so you can crash more and have a better chance of staying in the game. However, it is vital not to forget basic driving skills and to control the vehicle; because the key to escape is to be able to counter the dangerous maneuvers of the cops surrounding your vehicle.<br/>\n<br/>\r\nThe game requires a combination of speed, skill, and tactical thinking. The number and difficulty of cops increase as the player's scores increase. In this crazy world full of high-speed chases and unexpected obstacles, the only way to survive is to push your skills to the limits and identify the fastest escape routes.<br/>\n<br/>\r\nPlayers can purchase new vehicles with the rewards they earn, such as in-game money package. Each vehicle offers a different driving experience. Some vehicles are fast and help you escape easily, while others are more durable and can withstand more collisions. Players choosing the most suitable vehicle based on their personal preferences is the key to a successful escape.<br/>\n<br/>\r\nPlayers can also complete secret missions and challenging challenges to unlock special vehicles that are locked. This increases the replayability of the game and motivates players to discover more content.<br/>\n<br/>\r\nThe stylized desert environment of the game offers players an impressive atmosphere. Sandy deserts full of cacti, and other obstacles along the way force players to be alert at all times. Visual effects and sounds put you in a realistic police chase and increase the excitement of the players.<br/>\n<br/>\r\nPolice Car Escape Simulator offers an addictive experience for players who love the police chase genre. Impressive graphics, different vehicle options, challenging challenges, and fast-paced gameplay will keep players locked in the screen for hours. We are sure that you will play this police chase game again and again to break the high records you set.<br/>\n<br/>\r\nAre you ready to show off your driving skills, make quick and wise decisions, and deftly deal with the cops while escaping? Police Car Escape Simulator invites you to become a driving genius and outrun all cops!", "metacritic": null, "released": "2023-08-04", "tba": false, "updated": "2023-08-07T03:05:58", "background_image": "https://media.rawg.io/media/screenshots/3eb/3ebaa78f92db7f3e6fb3efd19a65eb5f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Samet Acar"], "genres": ["Action", "RPG", "Simulation", "Racing", "Indie"], "publishers": ["UPCELL TELEKOMUNIKASYON LIMITED SIRKETI"], "esrb_rating": null}