{"id": 964590, "slug": "goodbye-eternity", "name": "Goodbye Eternity", "name_original": "Goodbye Eternity", "description": "<p>\n<strong>Goodbye Eternity</strong> is a Visual Novel set in a world eerily similar to ours, at our current time.<br/>\n \n</p>\n<p>\n \n</p>\n<p>\nYou play as a man who, after enduring a miserable existence, suddenly finds himself in his body from years ago. A golden opportunity to start a new life unfolds before you. Seize this chance, learn from your past mistakes, seduce the women you never dared approach before, take revenge on others, change your fate... <br/>\n <br/>\nBut why have your eyes turned yellow? Why aren't certain events from the past unfolding as they used to? Confronted with your old tormentors, the women who trampled your heart, and the numerous upcoming challenges, will you be able to make the right choices?<br/>\n \n</p>\n<p>\nWill you manage to unravel the secret behind your reincarnation?<br/>\n \n</p>\n<p>\n<strong>Goodbye Eternity</strong> allows you to carve your own path toward your goal. The stories and relationships with the female characters you aim to seduce will evolve based on your choices during interactions with them. Blackmail, domination, love... it's up to you to make the right decisions.\n</p>\n<p>\n \n</p>\n<p>\n\n \n</p>\n<p>\n<strong>Goodbye Eternity</strong> offers you:<br/><br/>\n</p>\n<ul>\n<li>Incredible 60FPS high-quality animations</li>\n<li>Stunning backgrounds are available in various versions according to the time of day</li>\n<li>Endearing characters along with others who will not leave you indifferent</li>\n<li>A vast city to explore</li>\n<li>An outstanding soundtrack produced by .Quotam</li>\n<li>A mysterious and captivating storyline</li>\n<li>A polished user interface</li>\n<li>And so much more...</li>\n</ul>\n<br/><p>This Game may contain content not appropriate for all ages or may not be appropriate for viewing at work.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2023-08-07T03:50:24", "background_image": "https://media.rawg.io/media/screenshots/7a9/7a9b23700c01a4c3875b2771074448aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The End of Time"], "genres": [], "publishers": ["RNGeusEX"], "esrb_rating": null}