{"id": 964580, "slug": "realm-of-the-dead", "name": "Realm of the Dead", "name_original": "Realm of the Dead", "description": "<h3>What kind of game is this?</h3>This is a game that supports both a top-down perspective and a first-person perspective, which can be switched between. You can use the top-down perspective to control any of our characters. Alternatively, you can directly switch to one of the characters and experience the game from a first-person perspective during combat.<br/><br/>In the game, You need to evade and eliminate zombies, collect items, rescue teammates, utilize the support skills given by the shaman, and strengthen your team.<br/><br/><br/><br/>The ability to switch perspectives instantly allows for a variety of tactical cooperation. For example, you can control some characters from a top-down perspective as vanguards while providing cover fire for them from behind.<br/><br/>Of course, if you are confident in your own skills, you can also personally act as a vanguard, attract zombies, and then have your teammates shoot them down.<br/><br/><br/><br/>If you find it challenging to control multiple characters, you can command the AI of the characters and have them switch between various modes, freeing up your hands.<br/><br/>And if you particularly excel at real-time strategy games, especially with a preference for multitasking, then the formation system will fulfill your desire to simultaneously control multiple teams.<br/><br/><br/><br/>In general, you need to carefully navigate through houses and avoid shooting outdoors to prevent attracting too many zombies. This helps conserve ammunition and gather resources.<br/><br/>But there is a saying: all fear stems from insufficient firepower. If you have great confidence in your team, you can confidently step out of the room and engage in a major battle with the zombies, clearing out all the nearby zombies in one go for a satisfying experience.<br/><br/>Alternatively, you can take advantage of the zombies' sharp hearing to create loud noises, use obstacles to block approaching zombies, and then calmly eliminate them.<br/><br/>Or perhaps you can challenge yourself with a death marathon against the zombies using special characters?<br/><br/><br/><br/>Any playstyle is feasible—it all depends on how you choose to approach the game.<br/><br/>Welcome to follow my BiliBili account: <strong>确实是起名苦手</strong><br/>And my YouTube account: <strong>@NamingStruggler</strong>", "metacritic": null, "released": "2023-08-05", "tba": false, "updated": "2023-08-07T03:34:57", "background_image": "https://media.rawg.io/media/screenshots/8ff/8ffc5c920f900f4d8ba7ded5aff611db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["确实是起名苦手"], "genres": ["Strategy", "Indie"], "publishers": ["确实是起名苦手"], "esrb_rating": null}