{"id": 964516, "slug": "the-forest-of-conx", "name": "The Forest of Conx", "name_original": "The Forest of Conx", "description": "The Forest of Conx is a survival horror tower defense game, where you have came to a forest to find a mysterious creature named \"Conx\", unfortunately, this task isn't as easy as once planned..<br/><br/><br/><br/>Features in The Forest of Conx:<br/>-Exploration<br/>The vast forest provides lots of environments to explore<br/><br/>-foraging<br/>Before night hits you must collect a descent amount of globs, these globs will allow you to buy towers to defend yourself<br/><br/>-Upgrades<br/>The makeshift cabin you hunker in has many uninstalled upgrades that you can use to better your chances of survival<br/><br/>-Progressive Difficulty<br/>The difficult of enemies increases as the days go by, make sure to not overstay your welcome in the woods..<br/><br/>-Towers<br/>There are many Towers you can buy and place around your cabin, these towers will defend you from creatures once night hits..<br/><br/>-Challenge and Freeplay Modes<br/>Even after you complete the main story, there are still more things to do! Such as mods, the level editor, challenge mode, or the freeplay menu.<br/><br/><br/><br/>Some other things to keep in mind:<br/><br/>-Your cabin has a limited power supply, make sure to recharge power via the fusebox outside.<br/><br/>-There's a large cave system underneath the forest, make sure to explore these tunnels thoroughly<br/><br/>-Be aware of flash floods and other disasters!<br/><br/>-Beware Conx...", "metacritic": null, "released": "2023-08-05", "tba": false, "updated": "2023-08-07T02:12:07", "background_image": "https://media.rawg.io/media/screenshots/2a1/2a1a5d718a8a4d6bba3bc14fe983bb93.jpg", "website": "https://aconeishone.pages.dev/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 58, "ratings_count": 0, "suggestions_count": 295, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Calvin MacCaull", "Tiernan Brazil"], "genres": ["Action", "Adventure"], "publishers": ["a_coneish_one"], "esrb_rating": null}