{"id": 964552, "slug": "red-genie-an-eidola-tale", "name": "Red Genie: An Eidola Tale", "name_original": "Red Genie: An Eidola Tale", "description": "How far would you go to have a wish granted?<br/>\n<br/>\r\nOne of the many stories across the world of Eidola's vast and varied history, the tale of the Red Genie has become one of myth and legend. A lone Adventurer, of no renown, travels to find the resting place of a mythical artifact called the Red Genie. But the situation changes quickly when they are pulled into another land of mystery.<br/>\n<br/>\r\nUsing an arsenal of weaponry that can be swapped on the fly and a massive variety of magic, take the story of The Adventurer yourself and see to the truth lying at the end of the road!<br/>\n<br/>\r\nKey Features:<br/>\r\n-Weapon Swap System: change between weapons before taking an action to change stats and battle style! Have 10 different weapons equipped and swap freely to best handle the enemies you come across!<br/>\r\n-Weapon and Armor Variety: 200 Weapons across the 10 types and 150 Armors and Charms to mix and match to best suit your playstyle! From rogue-like Agility masters to Plate Armor Paladins, try all sorts of playstyles through the weapons you find!<br/>\r\n-Rich Story and Soundtrack: Intriguing characters and fascinating lore lie beyond each horizon this game presents, and the soundtrack composed by Officer DaMickey highlights each moment!<br/>\r\n-Multiple Endings: Your tale may end in one of four different places. The more you explore, the closer you'll be to the truth!", "metacritic": null, "released": "2023-08-04", "tba": false, "updated": "2023-08-07T02:58:27", "background_image": "https://media.rawg.io/media/screenshots/11e/11e1e1fbc64637b772bf308f8c9d10a4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Officer DaMickey"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Officer DaMickey"], "esrb_rating": null}