{"id": 964698, "slug": "chickenoidz-super-party", "name": "Chickenoidz Super Party", "name_original": "Chickenoidz Super Party", "description": "<h3>►LITTLE BIRDS BIG KERFUFFLE◄</h3>Fight against other players in fast-paced 10-minute battles. This is perfect for playing with friends at your house party or competing against numerous opponents from across the globe. Just in case, there is always an advanced AI on standby.<br/><h3>►MUTATE A LITTLE AS A TREAT◄</h3>Snack on the secret DNA formula and mutate into a frenzied burly bro. Scatter the other chickens around, unleash the ultimate massive attack ability, destroy everything within your reach - feel the power of being a gigantic freak.<br/><h3>►FORGET TRIGGER DISCIPLINE◄</h3>Knock yourself out, go through the entire available arsenal of non-lethal weapons - from a squirt gun to an egg launching slingshot. Just pick up a weapon and obliterate all the other chickens! Stun 'em with a hammer, punch with a boxing glove and skedaddle using a pocket teleport - this is just a little sneak peek of all the special moves available in the game. Bamboozle your opponent and watch your back, don't get outsmarted yourself.<br/><h3>►PUT YOUR GUN DOWN FOR A SEC◄</h3>Participate in both the standard battles, and in rounds with special rules. Earn extra points in additional competitions where shooting accuracy is not that important.<br/><h3>►LET YOUR PERSONALITY SHINE◄</h3>Choose your personal chicken look from over fifteen top-notch outfits: be a punk, a samurai, a witch and many more. You can also wipe out your opponents dressed up as a chicken scientist.<br/>", "metacritic": null, "released": "2023-08-08", "tba": false, "updated": "2023-08-11T03:51:07", "background_image": "https://media.rawg.io/media/screenshots/1b3/1b3cb15b846c38a8202279a474e2d737.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RaveGameDev"], "genres": ["Action", "Casual", "Indie"], "publishers": ["RaveGameDev"], "esrb_rating": null}