{"id": 964667, "slug": "escape-from-nalaxion", "name": "Escape From Nalaxion", "name_original": "Escape From Nalaxion", "description": "As a brave commander leading your platoon on a critical raid on Nalaxion 54, fate takes a thrilling turn when you accidentally stumble upon a hidden trap door. Unbeknownst to you, it leads to the heart of the enemy's inner base, where hordes of alien troops are pouring in through dimensional portals.<br/>\n<br/>\r\nNow, the fate of the entire operation rests solely on your shoulders. Equip yourself with an arsenal of heavy armaments and embark on a high-stakes mission to obliterate this staging base. It's a one-person show from here on out – no reinforcements, no backup, just you against overwhelming odds.<br/>\n<br/>\r\nNavigate through five progressively challenging levels, each more treacherous than the last. Stay vigilant, as you won't be able to carry your gear across each level's transport – make the most of the weapons and resources available in each stage. <br/>\n<br/>\r\nWill you emerge victorious against the alien onslaught and put an end to their nefarious plans? It's time to lock and load, soldier – the fate of the universe hangs in the balance! Are you up for the challenge?<br/>\n<br/>\r\nFeatures include:<br/>\r\n1. Unyielding Alien Horde: Brace yourself for an epic battle against a massive, ever-growing army of alien invaders. Their numbers are limitless, and they won't stop until Earth is under their control.<br/>\r\n2. Arsenal of Destruction: Arm yourself with an impressive array of weaponry! Discover and wield over a dozen cutting-edge and powerful weapons. <br/>\r\n3. Stim Packs for Survival: In the heat of combat, every second counts. Scavenge for vital stim packs scattered throughout the complex to rejuvenate your health. With precise timing, you can turn the tide of battle and keep fighting against impossible odds.<br/>\r\n4. Realistic Graphics and Audio: Immerse yourself in the lifelike graphics and immersive sound effects. Our cutting-edge technology ensures a truly cinematic gaming experience, placing you at the heart of the action.", "metacritic": null, "released": "2023-08-07", "tba": false, "updated": "2023-08-11T03:09:31", "background_image": "https://media.rawg.io/media/screenshots/ecd/ecd9aee88aa67f97fc8309fb8b7c361a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 294, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tom's Feral Cat Games"], "genres": ["Action", "Casual"], "publishers": ["Tom's Feral Cat Games"], "esrb_rating": null}