{"id": 964664, "slug": "soluble-dream", "name": "Soluble Dream", "name_original": "Soluble Dream", "description": "Soluble Dream is a visual novel for adults only. Venture into a world of passion, temptation and mystery. Starring Jackson Taylor, a brilliant programming student who must make tough decisions while guarding his reputation and struggling with himself.<br/><br/>Embodying Jackson, you, along with scientists Katie Martinez and Rachel Brown, will plunge into an exciting project to create an AI capable of synthesizing unique substances. Soon the heroes discover that their discovery has a narcotic effect, and Jackson decides to start its secret sale, plunging them all into the dark world of illicit affairs.<br/>Success seems close, but everything changes with the arrival of a mysterious hacker named \"Phantom\" who threatens to expose their secret. Struggling with his demons and increasing addiction, it's up to Jackson to find a way out of this dangerous game.<br/><br/><strong>The game contains a gripping story full of intrigue, love and betrayal. It is a romantic visual novel that keeps you in suspense throughout the game.<br/>Meet unique and interesting characters, each with their own story and motivation.<br/>The game touches on such topics as the fight against drugs, moral issues in science and technology, and the complexities of love relationships.<br/>Attractive visuals and musical accompaniment create an unforgettable atmosphere.</strong>", "metacritic": null, "released": "2023-08-07", "tba": false, "updated": "2023-08-11T03:06:18", "background_image": "https://media.rawg.io/media/screenshots/def/def858ba7e1a36ccab33eac4adc72f5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Heartstrings Interactive"], "genres": ["Adventure"], "publishers": ["Heartstrings Interactive"], "esrb_rating": null}