{"id": 964675, "slug": "a-risen-heart", "name": "A Risen Heart", "name_original": "A Risen Heart", "description": "<h3>Prepare</h3><br/>Tired? Lonely? Desperate? Welcome to A Risen Heart, a world of romance, drag queens, and queers! Prepare to flirt with hot guys and a hotter girl to discover the many intricacies of dating. <br/><br/><br/><br/>Play as <strong>YOU</strong>, a brunet boy with a heart of gold!<strong>A Risen Heart Includes</strong>:<br/>A Risen Heart is a dating simulator that allows players to court four characters from the Webtoon comic, \"A Risen Heart\" by creator Byangelly. This game features<br/><br/><ul><li>4 datable characters</li><li>16 possible endings</li><li>60+ unique dialogue prompts</li><li>New looks at the characters you know and love</li></ul><h3>Who are the Characters?</h3><br/><br/><strong>Meet Alex</strong>: A sweet, decisive girl who knows what she wants and will do what it takes to get it. Alex is fiercely loyal to her loved ones and always ready to try new experiences with friends and family.<br/><br/><br/><strong>Meet Mason</strong>: an attentive, honest guy focused on a multitude of hobbies, NPOs for which he volunteers, and extracurriculars. Whatever is available, Mason is involved in, all while working full-time as a hairdresser.<br/><br/><br/><strong>Meet John</strong>: an insecure, loving young boy whose lack of social skills only adds to his charm. He spends most of his time by himself struggling with a new life and his past experiences, but when he lets loose, he really lets loose!<br/><br/><br/><strong>Meet Andrew</strong>: an extroverted, caring guy who's always smiling and filled with infectious, bubbling happiness. He wouldn't hesitate to help anyone who needs it, but he's always been reluctant to share his problems and concerns with others.", "metacritic": null, "released": "2023-08-07", "tba": false, "updated": "2023-08-11T03:22:35", "background_image": "https://media.rawg.io/media/screenshots/133/133d6a0f2398a0c7aa56a19c4853cece.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Micah Stoogenke", "Micah Sanders"], "genres": ["RPG", "Simulation", "Indie"], "publishers": ["Chime Productions"], "esrb_rating": null}