{"id": 964658, "slug": "adventure-field-remake", "name": "Adventure Field Remake", "name_original": "Adventure Field Remake", "description": "<h3>The Premise :</h3>Have you ever heard of the legend? The legend of a kingdom, ruled by darkness and betrayed by its own king... Here's how this legend started! <br/>A long time ago, in the fabled kingdom of Sarook, a young boy was witness to words of light filling his dreams. An evil aura had consumed and poisoned the Sarook King's soul, and the corruption swayed him to unleash an army of monsters upon his own kingdom.<h3>The Game :</h3>This game is a turn-based JRPG made with the Smile Game Builder engine.  It is the 3D remake of the first ever Adventure Field™ that was originally made with RPG Maker XP in 2008... In this game you will have to fight your way trough dungeons and powerful foes. Between the fighting and the exploration, you can try to find all of the 100 mandragora hidden across the kingdom, this will help you unlock 1 of the 15 new in-game only achievements available in the game!<h3>Shiny Monsters :</h3>In Adventure Field™ Remake you always have 1 in 100 chance to find rare coloured version of monsters that give 10 times the exp and golds when entering a battle!<h3>2 Difficulty Modes :</h3>There is now 2 difficulty modes in the game, Remake and Classic! In the classic difficulty mode ( Hard Mode ), you are not healed when levelling up, resting at inn’s will cost 100 more gold, dungeons healing crystals will be deactivated and there will be no hidden items... So to make it short...<br/><br/><br/>As the first ever dark hours are coming to Sarook Kingdom... Relive the very start of the legend in this remake... The Kingdom will fall... But not if you save it...<br/><br/><br/><br/><strong>We strongly recommend to play the game with a controller</strong>. It is totally possible to play with the keyboard. Unlike the other Adventure Field™ games, this on is played with a fixed camera angle. So it is really up to you if you want to play using a controller or a keyboard!<br/><br/><br/><br/>The game as been made entirely with the Smile Game Builder engine and as not been exported to Unity to customize it in any way! So this game is an example of what you can do with the SGB engine without any knowledge of programmation whatsoever! Keep in mind when playing that this engine as some limitation...<br/>", "metacritic": null, "released": "2023-08-07", "tba": false, "updated": "2023-08-11T02:57:54", "background_image": "https://media.rawg.io/media/screenshots/a4c/a4ca1d8ef7cfd75de6af9672936fdc75.jpg", "website": "https://www.wathitdew.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wathitdew Record"], "genres": ["Adventure", "RPG"], "publishers": ["Wathitdew Record"], "esrb_rating": null}