{"id": 964661, "slug": "pact-of-joy", "name": "Pact of Joy", "name_original": "Pact of Joy", "description": "<strong>Setting:</strong><br/>Set in the same world as <strong>Test of Courage</strong> and <strong>Born Into Fear</strong>, you’ll assume the role of Victor Cortes as you investigate the signs of a potential Buffer at the abandoned, underwater Aegis facility, Phorcys Station. There’s much more going on than meets the eye. Your organization has heard rumors that a cult-like group has moved into the installation. If you want to succeed in your mission of finding, Lila, you’ll need to search for the Buffer and uncover the secrets of the Children of Joy.<br/><br/><strong>Gameplay</strong>:<h3>Terrifying threats and a chilling story await you in the claustrophobic depths of Phorcys Station. Step softly while you explore its haunted halls and solve its mysteries or risk the wrath of its guardians.</h3><h3> Repair control panels to restore access to locations around Phorcys Station.</h3><h3>Meet some of the former souls that lived in Phorcys Station and hear what they have to say. </h3><h3>Learn about the past lives of the Children of Joy through their personal computer terminals.</h3><br/><strong>Features:</strong><br/><br/>- Stealth elements: Stay in the shadows to hide from the guardians of Phorcys Station.<br/><br/>- Inventory System: Collect items that may later help you in your quest.<br/><br/>- Variety of characters: Speak to various NPC's and avoid the failed experiments of Phorcys Station.<br/><br/>- Randomized solutions: Each console will have a different solution for every playthrough.<br/><br/>- Drone Companion: A Drone will serve as your flashlight and can highlight interactable objects using Enlightened Vision. It’ll also speak to you at times.<br/><br/>Can you bring the Children of Joy the peace they seek? Or will you abandon them?", "metacritic": null, "released": "2023-08-07", "tba": false, "updated": "2023-08-11T03:01:30", "background_image": "https://media.rawg.io/media/screenshots/b3c/b3c0d566a159c375b4fefadf22550da2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 297, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Just Sauce Studio"], "genres": ["Adventure", "Indie"], "publishers": ["Just Sauce Studio"], "esrb_rating": null}