{"id": 96464, "slug": "stardrop-itch", "name": "STARDROP (itch)", "name_original": "STARDROP (itch)", "description": "<p><strong>STARDROP</strong> is a narrative driven, single player experience. As Aryn, You set out on a seemingly routine salvage operation alongside your close friend John to explore an unknown spacecraft reported to be somewhere in the Cassiopeia constellation. But things are not what it seems and as you explore this old derelict ship more mysteries will come to light and before long you'll find yourself in the midst of a truly exciting adventure unlike any other.<br/><br/><br/><br/><br/><strong>TRY IT BEFORE YOU BUY IT:</strong> We have a demo of the game available right here on our storepage. Be sure to give it a try before you buy it. We want you to enjoy the game but only if you're sure that <strong>STARDROP</strong> is your kind of game. </p>\n\n<ul><li>Three full fledged chapters within the main campaign. (With more to come)</li><li>Two playable SRO side missions. (Also with more to come)</li><li>Fully voiced dialogues by professional voice actors.</li><li>A rich options menu with lots of graphical settings, gameplay options and keybinding.</li><li>Retron One: a fun little arena minigame.</li></ul>\n<p><strong>STARDROP</strong> presents its narrative through traditional cut scenes and in-game cinematic story telling as you play. The main campaign is where the heart of the game's narrative lies but you will also be able to experience the universe of <strong>STARDROP</strong> through its side missions.<br/><br/><br/><br/>Exploration lies at the game's core but so does accessibility. While the game offers puzzles and asks the player to figure out what to do or where to go next, the flow of information within the game will always guide you. Objectives are always made clear and designed with logic in mind. However, those who venture off the beaten path will find that there are more than enough secrets to be discovered.<br/><br/><br/><br/>Throughout the game the player will be able to interact with various types of interfaces such as control panels, elevators and security system as well as other various interactive objects such as computer interfaces where you can read emails, listen to audio logs and more.<br/><br/><br/><br/>Your <strong>All-Purpose-Design (APD) space suit</strong> is equipped with a set of tools that you will need in order to succeed. The suit comes with a built-in flashlight. The object scanner enables you to identify objects of interest that you can interact with. The vision scanner uses echo location technology so that you will be able to see when your ordinary flashlight is not sufficient. Your suit also is capable of zero gravity mobility under certain circumstances.<br/><br/><br/><br/>The <strong>DataPad</strong> is an essential tool. It enables you to view your current objective, read audio and text logs that you've collected and it also comes with a built-in mini-map.<br/><br/><br/><br/>Our main focus will always be on the game's story but we strife to deliver breathtaking visuals where possible. Our efforts have lead us to win <strong>Best 3D Graphics</strong> in the <strong>Intel Level Up Contest</strong> of 2017. We will continue to uphold these standards if not lifting them up even higher.<br/><br/><br/>We will continue to release new chapters through episodic installments until the full story is told. We will also release patches, tweaks and polished content in between these installments. More SRO side missions are planned upon release and post release and we will also keep listening to out community as we always have and we will do our very best to make <strong>STARDROP</strong> a unique and amazing experience.<br/><br/></p>\n<ul><li>A strong engaging story breaking from the usual darker Sci-Fi setting.</li><li>Explore multiple spacecraft, Outposts, Stations and more as a salvage &amp; rescue operative.</li><li>Professional voice acting to drive an unusual story full of mysteries and excitement.</li><li>A range of light environmental puzzles and a touch of stealth.</li><li>Exploration mixed with narrative driven gameplay.</li><li>Inspired by story-rich classics such as Portal, Firewatch and even Alien: Isolation.</li></ul>\n<br/>\n<p>We love interacting with our fans and community members, so be sure to visit our website or follow us on Twitter or on Facebook to keep up to date and to be able to interact with us. Have a question, or a comment, or found a bug we missed? Pay us a visit on the forums.</p>\n<ul><li><strong>Official Website</strong></li><li><strong>IndieDB</strong></li><li><strong>Facebook</strong></li><li><strong>Twitter</strong></li><li><strong>YouTube</strong></li></ul>\n<p>STARDROP Troubleshooting FAQ</p>\n<p>STARDROP Official Play Guide<br/></p>\r\nWhy Early Access?\r\n\r\n<p><em>“Through Early Access we are able to grow and maintain a strong connection with our community as we develop the rest of the game. Our goal is not only to create an amazing gaming experience but to build up trust between us and our community and grow the team's reputation in general. </em>\n<em>Since we are a very small team we'll be able to gain feedback and bug reports which we ourselves might have missed to make sure that the game will be strong on release with a solid fan base.</em>\n<em>Our plan for continued support is to release new side missions and proper development progress updates and releasing stable builds akin to episodic releases as well as other ways to include community members that we can keep our audience engaged and excited as we work towards the game's full release.</em>\n<em>On top of that we love to engage with the community and want to offer them a chance to voice their opinions, likes and dislikes about the game. While we have a very strong design philosophy we also believe that we're just mere mortals and that there are a lot of people out there with good ideas and suggestions and we'd like to be able to listen to them.</em>\n<em>To not tap into that would be a missed opportunity as an indie developer wanting to build a solid relationship with its audience.”</em></p>", "metacritic": null, "released": "2016-04-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5ef/5ef9bb4209dd44e788abe6adc2ec1a09.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 446, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Joure"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}