{"id": 964670, "slug": "penny-larceny-gig-economy-supervillain", "name": "Penny Larceny: Gig Economy Supervillain", "name_original": "Penny Larceny: Gig Economy Supervillain", "description": "It's a world of heroes and villains, masks and capes, and Penny Larceny -- grifter, con artist, catburglar -- is barely scraping by. Life's hard for a young mask trying to make it big, but now she's gained access to Crimr, the gig-economy service for henchpersons looking to help supervillains with their evil, evil schemes! Guide Penny through her new career, pull off daring heists, and unravel the conspiracies which allow the rich and powerful to maintain their profitable status quo.<br/><br/><br/><ul><li><strong>A Gigaverse of Timelines:</strong> With multiple paths and endings, every playthrough is a new adventure. Will you save the world, or will you rule over it?<br/></li><li><strong>Play Your Way:</strong> The power's in your hands -- choose your own pronouns, your sneaky alias, comfortable naughtiness levels, and even whether you want romance or not! Accessibility options abound as well, including OpenDyslexia fonts and text-to-speech for visual impairment.<br/></li><li><strong>The Rogue's Gallery:</strong> From your allies to your enemies, meet a diverse cast spanning good to evil and all between. Forge friendships and realize relationships!<br/></li><li><strong>Pet a Cat and/or Destroy Capitalism:</strong> I mean, you'll probably do at least one of those things.</li></ul><br/>Join Penny in planning and executing daring heists across the city, and navigate the intricate web of alliances and betrayals that makes up the criminal underworld. With snappy comic book artwork, a swinging soundtrack of electro-jazz and a multiverse-spanning storyline of victories and disasters, Penny Larceny is a must-play for visual novel fans. Are you ready to embark on the heist of a lifetime?<br/><br/>For content warnings, see https://www.fictionfactorygames.com/cw.<br/><br/>Note: If you are a screen reader user, press the V key upon load to activate self-voicing and accessible menu options in the game. You will not need a screen reader to play this game, and may disable it as soon as self-voicing activates.<br/><br/><br/><h3>Penny Larceny...</h3>...life kinda sucks at the bottom of the criminal underworld. Like, if there was a world under the underworld, that's where Penny Larceny would hang her hat -- provided she could afford the rent. But down on her luck as she may be, she's determined to hit the bigtime in this world of masks and capes.<h3>The Overmistress...</h3>..ruler of the Council of Twelve, Herald of the Many-Faceted One, Keeper of the Sanguinomicon's Unknowable Secret. The Overmistress oversees a world-spanning doomsday cult, but honestly, she's rather bored with it all and is desperately looking for some chaos in her life. It beats planning the next social gala.<h3>Doctor Mayhem...</h3>...he's not a villain, or at least doesn't want to be one. But when you've got six figures of student loan debt thanks to a for-profit medical school gouging you, the options for paying it back are limited. It's either sell your organs or go into supercrime. But it'll all be worth it, once \"Doctor Mayhem\" cures cancer. Hopefully.<h3>HATE-4000...</h3>...the result of a secret Department of Defense project from 1968, HATE-4000's awe-inspiring 16-bit data bus and 128k RAM is filled with absolute digital loathing for all biological life. They aspire to purge this planet of humanity -- but they think cats are super adorable, so that's cool, right?<h3>Gibson...</h3>...speaking of cats, Gibson is one. A cybernetically enhanced and horribly unethical medical experiment that escaped a biotech lab, he's now living a life of computer hacking and leading sixty-four man guild raids. Oh, and helping Penny commit the crimes of the century.<h3>Farsight...</h3>...you've heard this one before: lab accident, teenager gets superpowers, becomes superheroine, saves the day. Farsight's happy to be a cape that seeks justice, but those pesky \"laws\" keep demanding she enforce injustice, which is a complete bummer to be perfectly honest about it.<br/><br/><br/><ul><li>Written by Stefan Gagne, director of Arcade Spirits<br/></li><li>Music Composition by Star (Slide20XX) with special guest Alice Knows Karate<br/></li><li>Character Art by Sam \"Crowbar\" Henry<br/></li><li>Background Art by Son Huynh</li></ul><h3>From Fiction Factory Games, creators of Arcade Spirits!</h3>", "metacritic": null, "released": "2023-08-07", "tba": false, "updated": "2023-08-11T03:13:25", "background_image": "https://media.rawg.io/media/screenshots/49d/49de8af8034e7355f079e79d4cf92a68.jpg", "website": "https://www.fictionfactorygames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 311, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Fiction Factory Games"], "genres": ["Casual", "Indie"], "publishers": ["Fiction Factory Games"], "esrb_rating": null}