{"id": 964753, "slug": "worldless", "name": "Worldless", "name_original": "Worldless", "description": "Worldless is set in a newborn universe based on entities trapped in an eternal conflict by the polarising nature of their attractions. These interactions can result in an exchange of their polarities, but this process is very unstable, and who knows what new results can come from it…<br/><br/>In this 2D active, turn-based, platformer, players will explore intricate and interconnected areas full of secrets and mysteries to uncover with a plethora of abilities like dashing and wall-jumps.<br/><br/>Along the way you will encounter different beings that aim to stop you as you seek to find your place in this universe. Using turn-based rules, fights combine traditional combat with active time actions for a thrilling and strategic combat where your knowledge of game mechanics and skills will be put to the test.<br/><br/><strong>Establish Yourself</strong><br/><ul><li><strong>Uncover unimaginable possibilities</strong> - Jump and dash your way through abstract areas in pursuit of transcendence.</li></ul><br/><br/><br/><strong>Grow to Survive</strong><br/><ul><li>Upgrade your abilities through an intricate and rewarding talent tree<br/></li><li><strong>Ready yourself </strong>- Engage in active time, turn-based battles, and time your attacks and defences perfectly to shatter your enemies.</li></ul><br/><br/><br/><strong>Immerse yourself</strong><br/><ul><li><strong>Indulgent Melodies</strong> - Connect to the areas of Worldless on a deeper level with a haunting yet beautiful score.<br/></li><li><strong>Cherish the moment</strong> - Define the world and challenge its secrets in a mysterious and enchanting narrative.</li></ul><br/>", "metacritic": null, "released": "2023-11-20", "tba": false, "updated": "2024-01-17T09:31:23", "background_image": "https://media.rawg.io/media/screenshots/930/93084416cf47ba4547f3810d5b1d1961.jpg", "website": "https://playworldless.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 3, "toplay": 9, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Noname Studios"], "genres": ["Action", "Adventure", "RPG", "Strategy"], "publishers": ["Coatsink", "Thunderful"], "esrb_rating": null}