{"id": 964742, "slug": "the-prospector-odyssey", "name": "The Prospector Odyssey", "name_original": "The Prospector Odyssey", "description": "<strong>Disclaimer: This game contains prolonged sequences featuring strobe lighting and / or flashing effects.</strong><br/><br/>After a research centre on a recently discovered planet goes dark, an investigation is launched - which uncovers tragedy and leads to the mysterious destruction of the entire site. Now, 15 years later, a lone prospector heads to the former site in search of salvageable artefacts, only to unwittingly unleash a dangerous mutagenic anomaly onboard a nearby service station. Trapped and alone, he is forced to fight for his life.<br/><br/><ul><li>Survival Horror<br/>The absorbing, cerebral nature of traditional survival horror with limited inventory system and self-directed, non-linear progression, paired with a 3rd person, 360 degree player-controlled camera. The Prospector Odyssey is the perfect marriage of classic and modern design sensibilities. <br/><br/></li><li>Think or Die<br/>Solve intricate puzzles, find your own way around the dark, oppressive environments, be smart in your decisions of inventory management. Think carefully before heading into danger - there is no one coming to help...<br/><br/></li><li>Fight or Hide<br/>Sneak your way past the lurking dangers undetected or do your best to stand up to the relentless terrors. Craft defensive items with scarce resources. Search thoroughly for weapons and supplies to aid your survival. </li></ul>", "metacritic": null, "released": "2023-08-10", "tba": false, "updated": "2023-08-11T04:49:09", "background_image": "https://media.rawg.io/media/screenshots/d87/d87d637d82eff04bd2e50a8b3b149177.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Quiet Room"], "genres": ["Adventure", "Indie"], "publishers": ["Quiet Room"], "esrb_rating": null}