{"id": 964731, "slug": "ufo-unidentified-falling-objects", "name": "UFO: Unidentified Falling Objects", "name_original": "UFO: Unidentified Falling Objects", "description": "Unidentified Falling Objects is a unique mashup of platforming and puzzle destroying gameplay. Players are dropped into the puzzle where they must dodge the falling obstacles and destroy blocks to make big combos. Many different things will fall from above, and the player must act quickly to remove them to level up and get the highest score. Compete for highscores or play with friends in local and online multiplayer modes.<br/>\n<br/>\r\nPUZZLE PLATFORMING<br/>\r\n•\tA literal puzzle platformer, where you can move around the puzzle, kicking and dodging blocks to match big combos all while avoiding many other types of obstacles, leveling up, and collecting powerups<br/>\n<br/>\r\nSOLO OR MULTIPLAYER<br/>\r\n•\tChallenge yourself to complete all the objectives in single player or challenge others for the best score in multiplayer with local 1 vs 1 or up to 20 players in online<br/>\n<br/>\r\nCUSTOMIZATION<br/>\r\n•\tUpgrade your way to the ultimate puzzle platformer, with unlockable equipment you can change your weapon, movement style and special kick powers. Changing the way you shoot, jump, and kick will help you get better scores and defeat other players<br/>\n<br/>\r\nRETRO STYLE<br/>\r\n•\tRetro graphics and a synthwave soundtrack across 6 different worlds <br/>\n<br/>\r\nCOLORFUL CAST OF CHARACTERS<br/>\r\n•\tMeet several eccentric characters when you progress the single player campaign. Each new character will offer new unique challenges for the player to complete", "metacritic": null, "released": "2023-08-09", "tba": false, "updated": "2023-08-11T04:34:51", "background_image": "https://media.rawg.io/media/screenshots/7b2/7b2913c936ff037618a74966dc21ecfb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Andrew Morrish"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Gearbox Publishing"], "esrb_rating": null}