{"id": 964796, "slug": "yue-nonu-he-notian-shi-shen-mekutoki", "name": "月の女、河の天使、神めくとき。", "name_original": "月の女、河の天使、神めくとき。", "description": "■Overview<br/>\r\n\"月の女、河の天使、神めくとき。\"<br/>\r\nAn 18+ novel game set in modern Japan. The troubles of a sick and lonely woman,<br/>\r\nIt is recommended for those who want to take a peek at the divinity born after falling in love with a young man who understands for the first time in their lives.<br/>\n<br/>\r\n■ story<br/>\r\n\"I will make you real\"<br/>\n<br/>\r\nAway from her sick father and her mother, who committed suicide to care for him,<br/>\r\nA woman who lives alone on the outskirts of the city, relying on relatives and welfare assistance ---- Hidari Takanagi.<br/>\r\nShe aspires to be both an actor and a screenwriter, but because she wants a self-satisfied stage, no one finds her.<br/>\r\nI was spending my days talking to another self in my brain.<br/>\n<br/>\r\nMeanwhile, it was a series of bizarre murders that shook the world.<br/>\r\nIt mainly targeted elderly people and women living alone, and was thought to be the same criminal because of their cruel way of doing things.<br/>\r\nNews sites and SNS were busy with the topic every day.<br/>\n<br/>\r\nOne day, Hidari finds a young man sitting in a corner of the park on his way home from a convenience store late at night.<br/>\r\nDespite his otherworldly beauty and friendliness, he quickly fell in love with Hidari, and Hidari also opened his heart to him.<br/>\r\nThe two become friends.<br/>\n<br/>\r\n――The beautiful man never said a word to Hidari, but he was a serial killer.<br/>\n<br/>\r\nIn this work, there are expressions of violence in the text,<br/>\r\nVisual representation of bloodshed, sexual intercourse between men and women,<br/>\r\nIncludes expressions such as the suicide of a relative of a character.", "metacritic": null, "released": "2023-08-12", "tba": false, "updated": "2023-08-14T02:30:56", "background_image": "https://media.rawg.io/media/screenshots/2da/2daea1da5de2d34e480ed645697009eb.jpg", "website": "https://succulent01.wixsite.com/mekutoki", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 259, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["サキュレント"], "genres": ["Adventure", "Indie"], "publishers": ["サキュレント"], "esrb_rating": null}