{"id": 964709, "slug": "oma-one-man-army-2", "name": "OMA - One Man Army", "name_original": "OMA - One Man Army", "description": "The year is 2095,<br/>A hostile force has enslaved most of the human race using highly trained commandos backed by advanced AI systems. You have been training for something like this, and now you are humanities last resort to put an end to the rampant force that is taking over the world! Do you have what it takes to destroy the enemy headquarters while navigating treacherous obstacles and fighting off dangerous enemies? <br/><br/><strong>One Man Army</strong><br/>Developed by one man, over the course of ten years! Bringing you classic 2D side scrolling Shoot-'Em-Up style gameplay with modern features and non-stop excitement! Battle over 15 different types of enemies while using over 50 different weapons - all across over 100 unique levels!<br/><br/>- Everything is randomly generated: What type of enemy will spawn in a location, what weapon they drop, and even what the next level will be! No two playthroughs or levels are ever the same! <br/><br/>- No installing, installing drivers, updates, logins, accounts, sign-up's, passwords or other shenanigans: Simply download and play. <br/><br/>- Full immersive soundtrack custom made for the game included with download!<br/><br/>- Use a variety of weaponry on your adventure: From knives to railguns and everything in between! You will see a huge selection of traditional firearms, as well as fantasy weapons, gadgets, grenades and melee weapons!<br/><br/>- Many different enemies will try to stop your efforts! Look out for commandos wielding machine guns, rocket launchers, sniper rifles, gas grenade launchers and more!<br/><br/>- Collect coins from defeated enemies to spend on in-game upgrades like a force field generator and jump boots! <br/><br/>- Find cool gadgets on the battlefield like the teleportation cannon, grenade dropping drone, and the grappling hook.<br/><br/>-Over 100 different story levels that are accessed at random. Some levels you may play through twice, and some you may not even see on a playthrough! <br/><br/>-Test your survival skills at the survival or attack modes, where enemies spawn in at random and provide endless mayhem!", "metacritic": null, "released": "2023-08-08", "tba": false, "updated": "2023-08-11T04:05:57", "background_image": "https://media.rawg.io/media/screenshots/c21/c219a4f76d84c6f145c7ccbbd38a433e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dominic Scuccimarri"], "genres": ["Action"], "publishers": ["Dominic Scuccimarri"], "esrb_rating": null}