{"id": 964795, "slug": "chains-of-the-goddess", "name": "Chains of the Goddess", "name_original": "Chains of the Goddess", "description": "For centuries, the residents of your quiet little village have sent their strongest into the Labyrinth, where a powerful Goddess is bound. It is said that those who reach her can persuade her to bless the village… But the Labyrinth is a treacherous place, full of illusions, lies, and insane spirits. Today, it is your turn to descend into the Labyrinth. The thought fills you with eager anticipation, for you know that you are different from every other would-be hero that has attempted this journey.<br/><br/><strong>To you, this is all a game.</strong><br/><br/><br/><br/>Generate a random hero, then descend into a labyrinth full of monsters. Your hero will attack on their own — your job is to figure out which powerful items to loot, which upgrades to purchase, and which dialogue options to pick. If you are persistent in your efforts, you will reach the Goddess, time and time again. However, each time you interact with the Goddess, the whole world will change, little by little.<br/><br/>Perhaps you will change, too?<br/><br/><br/><br/>This game is intended to play over and over again. Each successful run will advance the story and increase difficulty.<br/><strong>The presence of a player in a game is a hostile and disruptive force, and will be dealt with accordingly. Tread carefully. We warned you.</strong>", "metacritic": null, "released": "2023-08-12", "tba": false, "updated": "2023-08-14T02:29:58", "background_image": "https://media.rawg.io/media/screenshots/c79/c79970874370dd0e284972bd0afc50ee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cosmic Cog", "Ten Trillion Triangles"], "genres": ["RPG", "Indie"], "publishers": ["Cosmic Cog"], "esrb_rating": null}