{"id": 964728, "slug": "pirate-jigsaw-2", "name": "Pirate Jigsaw 2", "name_original": "Pirate Jigsaw 2", "description": "New Pirate Jigsaw 2 – the best gift for all treasure hunters! Uncover 500 pirate secrets hidden in 500 unique high-quality photos. The spirit of risk and adventure lies within each jigsaw!<br/>\n<br/>\r\nFor more exciting gameplay, we’ve added a whole bunch of possibilities! Set a difficulty to suit you for each puzzle! Save your progress at any time! Easy controls and a multitude of hints and tools will make the game more fun to play. Special tasks and trophies are available for the bravest conquerors of the seas!<br/>\n<br/>\r\nPrepare for fun challenges, learn all the charms of pirate life, explore the seas and the oceans, enjoy the beauty of exotic nature and find your first treasure trove!<br/>\n<br/>\r\nIt’s time to set off on a treasure hunt! Are you ready to take to the seas and explore unknown shores? Start your adventure with Pirate Jigsaw 2!<br/>\n<br/>\r\n- 500 high quality unique images<br/>\r\n- well designed game-play: useful hints, sort tool and magnifying glass.<br/>\r\n- optional game difficulty control makes your gameplay infinite<br/>\r\n- custom styles of pieces with rotation<br/>\r\n- save game progress and continue to collect the puzzle at any time<br/>\r\n- tasks and colorful trophies for those who love excitement<br/>\r\n- pleasant and relaxing music<br/>\r\n- pirate treasure in every jigsaw!<br/>\r\n- Get 500 puzzles for one purchase. It is beneficial!", "metacritic": null, "released": "2023-08-09", "tba": false, "updated": "2023-08-11T04:31:23", "background_image": "https://media.rawg.io/media/screenshots/8f3/8f3319348a2cc35aae311630415a996a.jpg", "website": "https://www.facebook.com/8FloorGames/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Creobit"], "genres": ["Casual"], "publishers": ["8Floor"], "esrb_rating": null}