{"id": 964743, "slug": "tales-tactics", "name": "Tales & Tactics", "name_original": "Tales & Tactics", "description": "<h3>Join us on Discord!</h3><br/><br/>Tales &amp; Tactics blends roguelike strategy with a squad-based autobattler, creating a deep and rich one-of-a-kind experience tailor made for a single player adventure.  No time limits and no pressure means you have all the time in the world to take in the game's mechanics and characters, and to strategize correctly for the fight ahead of you.  With a quick and easy tutorial, and mechanics that start off simple and approachable, anyone can learn to play.  The mechanics will only get more complex if you want them to, with our unique \"complexity at your own pace\" unlock system.<br/><br/>The Grand Tournament awaits every eager hero, the annual ultimate test of skill.  And every up-and-coming hero has their own story to tell on the path to glorious victory.  Take a seat at the table, and begin your own Tale.<br/><br/><br/><br/><br/><br/>Collect characters from a vast pool of units, each with a unique combination of traits and archetypes.  Build up a squad of monsters who synergize well with each other in order to dominate your opponents.  Merge three of a kind to combine them into an even more powerful unit, and carefully decide which units get equipped with gear to maximize your power.<br/><br/>No matter what type of fantasy creature you prefer - from Skeletons, Demons, and Ghouls, to cutesy baby Dragons, Fae Creatures, and Treefolk, there's something for everyone to enjoy.<br/><br/><br/><br/><br/><br/>Carve a tale, guided by a fully-voiced Game Master.  Meet a wide and colorful cast of enemy challengers to face, each with their own personality and special abilities.  You may even find the current Tournament Champions, the celebrity commanders of the annual Grand Tournament event.  They're always invited back to the Tournament every year, so if you encounter one in your travels, they'll remember how you treat them - and react in kind when you face up against them in the Tournament brackets.<br/><br/>Encounter unique stories in the form of Tales, hand-written narrative events with important decisions to make regarding the outcome of your run.  Beware the tricky Dungeon Tales, where both evil and glory await...<br/><br/> <br/><br/><br/><br/>With every defeat comes not only lessons learned, but the opportunity to unlock new features and challenges.  Unlike many roguelikes, new features unlocked in Tales &amp; Tactics rarely ever directly increase power, but rather add new opportunities, mechanics, and options - increasing the run's complexity, without necessarily increasing your power.  Rather than an unlock granting \"your units gain more damage\", you might unlock \"a Devil's Deal may be offered...\".  What's a Devil's Deal?  Who knows!  You'll have to unlock it and find out.", "metacritic": null, "released": "2023-08-10", "tba": false, "updated": "2023-08-23T13:07:24", "background_image": "https://media.rawg.io/media/screenshots/c05/c057bf4fe3a126ff033208c3558e0e43.jpg", "website": "https://table9studio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Table 9 Studio"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": ["Yogscast Games"], "esrb_rating": null}