{"id": 964797, "slug": "the-rush-2", "name": "The Rush", "name_original": "The Rush", "description": "The Rush is a horizontal shoot 'em up with an MSX inspired art style and plenty of that arcade excitement (without a nasty hunger for quarters)!<br/><br/>Features:<br/><ul><li> 7 unique stages<br/></li><li> Many enemies and boss fights that (I severely hope) are well designed<br/></li><li> 11 different weapons that can be mixed and matched with one another<br/></li><li> Some surprise easter eggs and bugs I decided not to fix because they work in your favor<br/></li><li> A good(?) OST that was a collaborative effort between yours truly and my friend BuckChickens<br/></li><li> Controller support</li></ul><br/>Controls:<br/><ul><li> Default keyboard controls are WSAD for movement, L to shoot, K to bomb<br/></li><li> Alternate keyboard controls (which can be enabled in the configure menu) use Arrow Keys for movement, Z to shoot, X to bomb<br/></li><li> For either keyboard control method, enter is start/pause<br/><br/></li><li> On controller \"A\" is shoot and \"B\" is bomb, with \"Start\" acting as start/pause<br/><br/></li><li> Holding alt and pressing enter will enable/disable true fullscreen mode</li></ul><br/>Thank you for checking out The Rush! Do not hesitate to voice your opinions regarding anything in game.<br/><br/>As this game is in early access, the latter half of stage 7 has yet to be completed. Steam achievement support will also be added in the future. I'm just one guy working on this in my free time...", "metacritic": null, "released": "2023-08-11", "tba": false, "updated": "2023-08-14T02:31:44", "background_image": "https://media.rawg.io/media/screenshots/158/158dcf872110e6c3c5ac82809e76934c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hornbuckle Who", "BuckChickens"], "genres": ["Action", "Indie"], "publishers": ["Hornbuckle Who"], "esrb_rating": null}