{"id": 964881, "slug": "the-queens-gambit-chess", "name": "The Queen's Gambit Chess", "name_original": "The Queen's Gambit Chess", "description": "Available exclusively for Netflix members.<br/><br/>Welcome to Beth Harmon's world. Take chess lessons, play puzzles and matches, or compete against friends online in this stunning love letter to the show.<br/><br/>From beginners to chess masters, this immersive chess experience pays homage to the award-winning drama and has something for everyone.<br/><br/>MAP YOUR CHESS PROGRESSION<br/><br/>• A beautifully rendered map of Beth's local haunts will act as your central hub throughout the game. <br/><br/>• Play custom games on 3D or 2D chess boards, track weekly game goals to earn rewards, learn your and friends' stats, access a chess lesson library and more through this central map. <br/><br/>SEE CHESS LIKE BETH<br/><br/>• Take advantage of the game's unique \"Beth Vision\" feature to visualize your next move or see threats on the board, just like Beth in the show.<br/><br/>LEARN TO PLAY CHESS IN MULTIPLAYER MODE OR SOLO<br/><br/>• Play chess matches with friends or play against sophisticated AI that replicates the playing level and style of your favorite characters. <br/><br/>• Multiplayer modes include: multiplayer online matchmaking, multiplayer online invite a friend, or in-person pass &amp; play with a friend.<br/> <br/>MEET UP WITH OLD FRIENDS AND FAMILIAR FACES<br/><br/>• Learn chess with Mr. Shaibel, engage in chess matches with Borgov or challenge Beth to matches in the park. Checkmate.<br/><br/>LEARN THE LANGUAGE OF CHESS<br/><br/>• Are you a beginner, or just need a lingo refresher? Use the in-game glossary to learn new terms or track ones you've already learned. <br/><br/>• Track everything from move evaluations (book, blunder, mistake) to general terms (checkmate, ranks, files) and advanced terms (fianchetto, pins, fork) as you play.<br/><br/>FUN WAYS TO PLAY, LEARN CHESS AND LEVEL UP<br/><br/>• Pick a skill level and take chess lessons at a pace that's right for you. Players are able to pick from three different levels of increasing difficulty (novice, intermediate, advanced).<br/><br/>• Make a mistake? Try again by taking advantage of the \"undo\" feature in the game. You can also analyze your moves by pressing the \"review\" button to learn from mistakes, improve your movements and take advantage of missed opportunities. <br/><br/>• Collect custom postcards and earn unique rewards for your profile to show off to your friends.<br/><br/>• Complete a variety of puzzles to gain the skills you need to play like a master of chess.<br/><br/>- Created by Rockwater Games, a Ripstone Studio.", "metacritic": null, "released": "2023-07-25", "tba": false, "updated": "2023-08-14T04:19:07", "background_image": "https://media.rawg.io/media/screenshots/f1e/f1e4d21ca1ac1fc2c3e569232f3d8435_b0oVEXI.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Netflix"], "genres": ["Strategy", "Board Games"], "publishers": ["Netflix"], "esrb_rating": "Everyone 10+"}