{"id": 964807, "slug": "war-of-being", "name": "War Of Being", "name_original": "War Of Being", "description": ".<h3>E X P E R I E N C E</h3><br/>War Of Being is a single-player sci-fi Virtual Reality adventure game also playable in standard mode, created and developed by members of the award winning progressive metal band 'TesseracT'. Enter into the surreal nature of 'The Strangeland' discovering characters from War Of Being, solving puzzles and collecting items that reveal the band's new music.<h3>E X P L O R E</h3><br/><strong>Immersive Experience:</strong> Realistic graphics and a bespoke soundtrack ensure a totally immersive Unreal5 experience.<br/><strong>Locations:</strong> Explore 6 surreal and highly stylised environments each with their hiding spots and detailed surroundings.<br/><strong>Play Alone:</strong> Specifically single-player for an isolated experience.<h3>D I S C O V E R</h3><br/><strong>Listen:</strong> Prepare to dive head first into the bands full album and embrace the music in a way like no other.<br/><strong>Narrative:</strong> Meet the unique characters behind the story and listen attentively as they reveal cryptic details about themselves.<br/><strong>Puzzles:</strong> Solve hidden puzzles scattered around The Strangeland to unlock music from War Of Being.<br/><strong>Liberate:</strong> Locate and free the obsidian statues of the five band members and discover more about each musician.", "metacritic": null, "released": "2023-08-11", "tba": false, "updated": "2023-08-14T02:44:00", "background_image": "https://media.rawg.io/media/screenshots/8c9/8c975ade9204ae0c4d8c0e6cf1544577.jpg", "website": "https://www.tesseractband.co.uk/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 532, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DMTesseracT"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["4D Music"], "esrb_rating": null}