{"id": 964863, "slug": "eternal-three-kingdoms", "name": "Eternal Three Kingdoms", "name_original": "Eternal Three Kingdoms", "description": "Go rumble and own them!<br/><br/>Tired of complicated Three Kingdoms games?<br/>Say no more! It's all about casual tactics and the thrill of mass battles!<br/><br/>Assign your favorite heroes to different armies!<br/>It's all about customization!<br/><br/>Recruit mighty heroes such as Lu Bu, Guan Yu, and Zhao Yun.<br/>Devise unique strategies to form elite troops!<br/><br/>Explore solid and extensive scenario based on the Romance of the Three Kingdoms!<br/>Heroes with unique skills and unique game modes are at your disposal.<br/><br/>Command the mightiest heroes using unrestrained strategies and formations!<br/>Crush your foes as you face them in mass battles!<br/><br/>Enjoy simple controls and fast-paced gameplay!<br/>Engage in an immersive storyline as you clear stage on the go!<br/><br/>Collect powerful Three Kingdoms heroes and supercharge their progress!<br/>Experience a variety of upgrade systems and battles!<br/><br/>** This game is available in 한국어, English, 日本語, 中文简体, 中文繁體, ไทย, Tiếng Việt.<br/><br/>[Minimum Requirements]<br/>iPhone 7<br/><br/>[Permission Guidelines]<br/>App will request permissions in order to provide certain services:<br/><br/>[Optional Permissions]<br/>- Camera: Permission to access Camera to take pictures that can be set as your in-game profile image.<br/>- Photo: Permission to access Photo Album to upload pictures from your photo album to set as your in-game profile image.<br/>- Push Notifications: Permission to send you Push Notifications in the game.<br/>- Identifier for Advertisers: Permission to track your activities for Targeted Promotions and Tracking Analysis.<br/><br/>[Manually Setting Permissions]<br/>Follow the directions below to manually set permissions:<br/>- Settings &gt; Privacy &amp; Security &gt; Select the Permission &gt; Choose which permissions you want the app to have.", "metacritic": null, "released": "2023-07-18", "tba": false, "updated": "2023-08-14T03:55:15", "background_image": "https://media.rawg.io/media/screenshots/41b/41b35c684f9d61eeb80113c73eee4f43_EZ4GQju.jpg", "website": "https://www.withhive.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 407, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Com2uS Holdings"], "genres": ["RPG", "Strategy"], "publishers": ["Com2uS Holdings"], "esrb_rating": "Teen"}