{"id": 964850, "slug": "tile-club-matching-game", "name": "Tile Club - Matching Game", "name_original": "Tile Club - Matching Game", "description": "Are you looking for a new and exciting tile matching puzzle game? Look no further than Tile Club - the ultimate puzzle game for tile matching enthusiasts! Download and install now and join the fun!<br/><br/>With over 10 000 levels, Tile Club offers a challenging and relaxing puzzle game experience for players of all skill levels. Solve puzzles, match tiles, and master the classic game of tile matching. Join a club to chat and help each other, travel through the world by completing levels and participate in tournaments.<br/><br/>Tile Club features include:<br/><br/>- Over 10 000 tile matching levels with increasing difficulty, providing endless hours of gameplay.<br/>- Join clubs, chat and help each other to solve challenging puzzles and match tiles.<br/>- Travel through the world by completing levels, unlocking new locations.<br/>- Tournaments to challenge yourself and compare your triple tile matching skills with other players.<br/>- Classic tile matching gameplay with a modern twist, providing a relaxing and brain-training experience.<br/>- A wide variety of cute tiles including fruit, cakes, animals and more.<br/>- Powerful boosters to help you pass the most challenging levels.<br/><br/>Tile Club offers a unique blend of classic triple tile matching gameplay with a modern twist, providing a relaxing and brain training experience to get Zen. With thousands of layouts and useful tips, undo and powerful boosters, Tile Club will keep you entertained for hours.<br/><br/>Join a club and chat with other players to help each other solve challenging puzzles and match triple 3D tiles. As you progress through the levels, you will travel through different locations and unlock new backgrounds. And with tournaments, you can challenge yourself and compare your tile matching skills with other players.<br/>The game is available to play on mobile and tablet devices, and can be played offline as well.<br/><br/>Get ready to join the Tile Club and embark on a journey of tile matching and puzzle solving. With over 10 000 levels, Tile Club offers hours of fun and challenging gameplay.<br/><br/>- - - - -<br/><br/>Contact &amp; more info<br/>Many more cool features will be added to Tile Club in the coming months. Feel free to tell us what you like to see in the game!<br/><br/>Terms of Service can be found here: https://www.gamovation.com/legal/tos.pdf<br/>Privacy Policy can be found here: https://www.gamovation.com/legal/privacy-policy.html", "metacritic": null, "released": "2023-05-16", "tba": false, "updated": "2023-08-14T03:41:19", "background_image": "https://media.rawg.io/media/screenshots/977/9772d1c8210b8e3e540eb27b4eff230f_gAC36d3.jpg", "website": "https://www.gamovation.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GamoVation"], "genres": ["Board Games", "Puzzle"], "publishers": ["Gamovation"], "esrb_rating": "Everyone 10+"}