{"id": 964945, "slug": "dont-flee", "name": "Don't Flee", "name_original": "Don't Flee", "description": "<strong>\"Don't Flee\"</strong> - is a psychological horror-thriller, all the actions of which take place in an old abandoned school, in which the player finds himself to save his brother, but soon he realizes that everything he sees is not true, as if the whole world that surrounds him is one big nightmare ...<br/>The player will have to find your  ̶b̶r̶o̶t̶h̶e̶r̶ and get out of the school, which contains a large number of secrets<br/><br/><strong>Features of the game:</strong><br/>1. You have two light sources with you: a flashlight and a night vision device<br/><strong>Flashlight</strong> - has a longer battery life and a stronger light source, but the enemy can notice the light from the flashlight and pounce on the player<br/><strong>Night vision</strong> - has a shorter battery life and a smaller high beam, but the enemy is not able to notice the light from night vision.<br/><br/>2. <strong>The complexity of the game</strong> - you have no right to make a mistake, every mistake will take your life, so I advise you to think through all the actions.<br/><br/>3. <strong>Freedom of actions</strong> - there are no strong restrictions in the game, which means that you have much more choice of actions!<br/><br/><br/>I would like to say a huge thank you to you personally for taking the time to play the game. I am very glad to everyone who passed this game and to those who just tried to play it!<br/><br/><strong>The game is also in active development, so there may be bugs in it.</strong>", "metacritic": null, "released": "2023-08-13", "tba": false, "updated": "2023-08-18T02:52:18", "background_image": "https://media.rawg.io/media/screenshots/ae8/ae80106548d1c6f82e0574cf6f6f6929.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rehoboam"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Rehoboam"], "esrb_rating": null}