{"id": 964977, "slug": "the-isle-survival", "name": "the ISLE survival", "name_original": "the ISLE survival", "description": "In the early 1920s an extraordinary reunion of scientists took place to speack about DNA modifications and the urge to test their knowledge. In 1947 they secretly finished the installations in place they named '' the ISLE''. At first DNA testing where on plants and animals. In late 1952 they brought humans specimens and tested on them. Mid 1963, some hyperintelligence test begun on a tribe. We don't know how it breaks, however in 1967 the facilities where attacked by the guinea pigs and most of the scientists got slayed and murdered. The tribes established a trap system to continue supplying the island with goods and... Humans. Your boat is trapped and forced to the shores of.. ''The ISLE''.<br/>\n<br/>\r\nKey features:<br/>\r\nEarly access contant:<br/>\r\n-Base Building<br/>\r\n-Item crafting and crafting benches<br/>\r\n-Character health, hunger and thirst<br/>\r\n-Resources to loot and use in crafts<br/>\r\n-Agressive and non agressive animals<br/>\r\n-Day / Night cycle<br/>\r\n-Mining ores<br/>\r\n-Animal hunting<br/>\r\n-Food cooking mechanics<br/>\r\n-Weather cycle<br/>\r\n-Resources transformation for crafting<br/>\n<br/>\r\nDisclaimer:<br/>\r\nBeing a single game developer working on the game, early acces gives me the opportunity to work full time on the game. It will also help me a lot to read your comments and suggestions so I know what players would like the game to become. I'm planning to add lots of features that are not yet in the game. For now the game is not a finished product. Only plan buying the game knowing that this is not a final product and several changes will be made in gameplay through time. Thanks for your understanding.", "metacritic": null, "released": "2023-08-14", "tba": false, "updated": "2023-08-18T03:30:12", "background_image": "https://media.rawg.io/media/screenshots/e4d/e4d16524605164a76a1f467e2d64fba6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 350, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Free Land Studios"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["Free Land Studios"], "esrb_rating": null}