{"id": 964990, "slug": "rageblocks", "name": "Rageblocks", "name_original": "Rageblocks", "description": "<strong>Introducing \"Rageblocks\" - A Block-Busting Revolution on Steam!</strong><br/>Are you ready to embark on a thrilling and addictive gaming experience like no other? Say hello to \"Rageblocks\". Prepare to be captivated by its innovative Sidescrolling Powerdowns, 8x8 Mega Chunks which add an adrenaline-pumping score multiplier that will leave you breathless!<br/><br/><strong>Unleash the Powerdowns: Sidescrolling Challenge!</strong><br/><br/>Welcome to the adrenaline-fueled realm of \"Rageblocks,\" where the classic Tetris you once knew takes a heart-pounding turn with our innovative Sidescrolling Challenge! Brace yourself for an electrifying journey that will push your puzzle-solving skills to the limit, as you face a relentless barrage of game-changing Powerdowns that will keep you on your toes and your heart racing!<br/>In \"Rageblocks,\" the only constant is change! As you expertly stack and rotate blocks, prepare for the ultimate test with our devious Sidescrolling Powerdowns. These devilish elements will take you by surprise, removing blocks from the playfield, inverting controls, turning falling blocks invisible, or accelerating their descent to lightning speeds! Every moment is a whirlwind of excitement, challenging you to adapt and strategize in real-time.<br/><br/><strong>Bigger Chunks, Bigger Rewards: The 8x8 Mega Chunks!</strong><br/>Get ready for a game-defining sensation as you unlock the immense potential of the 8x8 Mega Chunks. Strategically assemble  blocks of the same pieces to create awe-inspiring combos and watch your score skyrocket! Each expertly crafted Mega Chunk brings an irresistible sense of accomplishment and multiplies your score, proving that bigger really is better in \"Rageblocks\"!<br/><br/>If the game has 5000+ downloads we will make a multiplayer update!", "metacritic": null, "released": "2023-08-15", "tba": false, "updated": "2023-08-18T03:49:17", "background_image": "https://media.rawg.io/media/screenshots/514/514ff5b739d5d6f9c2b543ef2f32c313.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["T.E.S.B."], "genres": ["Casual"], "publishers": ["T.E.S.B."], "esrb_rating": null}