{"id": 965087, "slug": "water-sort-puzzle-game-color", "name": "Water Sort Puzzle: Game Color", "name_original": "Water Sort Puzzle: Game Color", "description": "Meet Water Sort: Color Game, a new water sorting game! The main goal of this puzzle is to sort the colored liquids and to fill each cup with the same color. This is a true challenge for your IQ and logic!<br/><br/>The game begins with quite simple puzzle levels  to teach you how to play, but every level gets tougher as you keep sorting. You will never get bored by the multiple levels full of bright colors and fascinating special effects to enjoy!<br/><br/>Water Sort Puzzle: Color Game gets your attention from the very first game level with its amusing color sorting process. If you adore some brain exercise from time to time, you’ll surely find our liquid pouring puzzle addictive. There are loads of game levels in our water sort puzzle game. We’re sure you’ll truly enjoy all multi level game challenges to train your brain and have fun - all at once!<br/><br/>HOW TO PLAY<br/><br/>- Tap a tube with the liquid you want to move and then tap the next tube to pour that liquid there.<br/>- Follow the only game rule: while sorting liquids by color, you can only place a liquid of the same color on top of the other one.<br/>- You can restart the game level, if you feel you won’t get the colored liquid combination at once.<br/>- Lost in a level? No worries! Use the “Retry” button if you’re stuck in this puzzle level.<br/>- Got too complicated? Try adding a special tube to finish the level.<br/>- Fill the tubes with liquids of the same color - and win!<br/><br/>TOP GAME FEATURES<br/><br/>- No charge: Water Sort: Color Game is totally free to play!<br/>- No time limits: think of your next move as long as you need!<br/>- No Wi-Fi needed - enjoy the game offline on-the-go at any place any time!<br/>- Easy game navigation and one-finger control<br/>- Absolutely addictive multi level color sorting game to keep you entertained for hours<br/>- Satisfying and relaxing ASMR effects as you sort puzzle and complete levels!<br/><br/>Have you tried classic color sort puzzles or pouring games and wish to play something new for a change? Up for some water sorting puzzle game now? Then Water Sort Puzzle: Color Game is exactly what you need! Being one of the greatest picks on the market of sorting games for adults, our game will give you that special vibe of color sorting and liquids pouring you’ve been searching for!<br/><br/>Just fill the cup with all liquids of the same color and celebrate the level completion. As simple as that!<br/><br/>Feel free to leave us a rating and a review and support our team and our cool color sorting puzzle game!<br/>Any questions? We’re here to help!<br/><br/>Enjoy Water Sort Puzzle: Color Game!", "metacritic": null, "released": "2023-02-27", "tba": false, "updated": "2023-08-18T06:00:34", "background_image": "https://media.rawg.io/media/screenshots/d38/d38496d0d20cd6ad26252e6e13a69804.jpg", "website": "http://hypercell.games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hypercell Games"], "genres": ["Casual", "Puzzle"], "publishers": ["Hypercell Games SIA"], "esrb_rating": "Teen"}