{"id": 965072, "slug": "space-ball-vr", "name": "Space Ball VR", "name_original": "Space Ball VR", "description": "Experience the excitement and exhilaration of Space Ball! Firing a rocket under everyday sports, Space Ball launches you into an arena full of action, where quick thinking and lightning reaction times are all that matter.<br/>\n<br/>\r\nFeaturing Football and Basketball gameplay modes, this competitive multiplayer is all about scoring points and bragging rights. Slam dunk a basketball like a pro or use your body to score a goal in football, use the arenas anyway you see fit to gain the advantage.<br/>\n<br/>\r\nSpace Ball features a unique movement mechanic that is easy to master. Simply use your hands to leap across the arenas. Slam them into the ground to accelerate, then use the Dash feature to soar into the rafters! You’ve never played a game of Basketball as vertical as this!<br/>\n<br/>\r\nSpace Ball features:<br/>\n<br/>\r\nCreate Private and Public matches<br/>\r\n1vs1, 2vs2 and 3vs3 team selection<br/>\r\nOnline multiplayer and AI Bots with multiple difficulty settings<br/>\r\nCharacter customisation options - be a Cat, Pigeon, or even a Capybara!<br/>\r\nArenas are filled with fans to bring matches to life!<br/>\r\nFull voice chat with privacy settings<br/>\n<br/>\r\nSpace Ball on Steam also supports cross-play functionality with the Meta Quest version.<br/>\n<br/>\r\nDuring Early Access we’ll be regularly updating Space Ball with new features and QoL enhancements, so don’t forget to join our Discord for all the latest updates!", "metacritic": null, "released": "2023-08-17", "tba": false, "updated": "2023-08-18T05:41:40", "background_image": "https://media.rawg.io/media/screenshots/101/101e618e6b5b183410cda99799196543.jpg", "website": "https://spaceballvr.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["31 Labs"], "genres": ["Sports"], "publishers": ["31 Labs"], "esrb_rating": null}