{"id": 965018, "slug": "gamedev-trash", "name": "GameDev Trash", "name_original": "GameDev Trash", "description": "<strong>A true AAA experience at an indie price!</strong> Why pay extra for unfinished games, with broken code, and lack of optimization when you can get this experience right now at a significantly lower cost - meet GameDev Trash. The game of tomorrow that will show you where the gaming industry is really heading and what awaits you in the future!<br/><br/><strong>The gameplay:</strong> Game Dev Trash is highly unconventional. Each level undergoes a genre shift, ranging from first-person shooter  to third-person open-world RPG  and even horror.  Additionally, the game features two unique levels. At the end of each level, players will encounter a boss that represents a different game industry persona, from developer to game producer. All of this is wrapped in a slightly insane plot about the modern game developer and its secrets, narrated by an off-screen voice.<br/><strong>If you enjoy silly jokes and unique gameplay, then this game is perfect for you!</strong><br/><br/><strong>!!CAUTION!!</strong><br/>At the moment, there are 2 out of 5 planned levels in the game. The horror level is still under development, while the next two levels are only in the plans.<br/><br/>Favorite aggressive microtransactions and Day One DLCs - are just jokes. There is no aggressive microtransactions and Day One DLCs in game.", "metacritic": null, "released": "2023-08-17", "tba": false, "updated": "2023-08-18T04:28:08", "background_image": "https://media.rawg.io/media/screenshots/e74/e741dd461105286d65b7e874157fcd4f.jpg", "website": "https://www.extelagames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 457, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Extela Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Extela Games"], "esrb_rating": null}