{"id": 9650, "slug": "auto-age-standoff", "name": "Auto Age: Standoff", "name_original": "Auto Age: Standoff", "description": "Welcome to the Auto Age The year is 2080. America lies in ruins. Bands of militarized motorists work to keep the peace in the east. Wheeled gangs rule the western wastes. A mysterious voice crackles through the static of radio relays, beckoning travelers into the desert canyons of the Dead Zone.<br/> <br/>Choose your side and speed full throttle into a deadly game of ruthless car combat soaked in '80s Saturday morning cartoon style. Will you rally behind SAIGE and Val Vega to fight for a better future, or seek total domination with the evil Dark Jaw and his ragtag Jawlings?<br/><br/>Team-Based Car CombatHurl headlong into the chaos of twelve-player online combat, buckle up for classic couch co-op, or even do both. With Auto Age: Standoff's versatile split-screen play, you and three other friends can skirmish privately or team up together in online battles.Pimp Your RideIn a high-tech world of lowlifes, you'll need every advantage you can get. Choose your chassis and gear up with powerful weaponry and the latest gadgets, including missile launchers, ramming plates, mines, boosters, and more.<br/><br/><ul><li>14+ vehicles including light, medium, heavy and tower classes<br/></li><li>30+ weapons and gadgets</li></ul>Multiple Modes of MayhemFire up classic Deathmatch combat (free-for-all and team-based) and rampage across five wasteland maps, or battle for control of Eagle's Nest in Point Capture mode where coordination and strategy is king. Twelve players supported in a single online match.1980 Meets 2080Get hooked on our retro-future dashboard mixtape and soundtrack where synthwave and guitar-shredding fuel your quest for vehicular destruction.<br/><br/><ul><li>Mixtape tracks by:  20Six Hundred, Skull Fist, Stilz, and TWRP.<br/></li><li>Underscore by: Jim Guthrie and JJ Ipsen<br/></li><li>Theme song by: Matthew Reid</li></ul>", "metacritic": null, "released": "2017-09-21", "tba": false, "updated": "2023-01-20T07:10:49", "background_image": "https://media.rawg.io/media/screenshots/f16/f1671d5fafa343d13c42286f8f6881aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 14, "owned": 183, "toplay": 2, "dropped": 1}, "playtime": 4, "achievements_count": 25, "ratings_count": 4, "suggestions_count": 368, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Phantom Compass"], "genres": ["Action", "Indie"], "publishers": ["Phantom Compass"], "esrb_rating": null}