{"id": 965019, "slug": "blazblue-entropy-effect", "name": "BlazBlue Entropy Effect", "name_original": "BlazBlue Entropy Effect", "description": "A brand-new action roguelite developed by a team with years of experience in action games, ready to present the best 2D action combat experience the world has ever seen!<br/><br/><br/><br/>Each character has their own traits and hundreds of moves to choose from as you create your unique combos. The Legacy System making each battle a unique experience.<br/><br/><br/><br/>Think strategically and plan your Tactics by selecting eight elements (Lightning, Fire, Ice, Blade, Toxin, Light, Umbra, and Generic) and over 200 upgrades that synergize with your kit to create different \"reactions,\" such as Burn, Freeze, Blind, Paralysis... Choose upgrades wisely and customize your very own combat style! <br/><br/><br/><br/>Experience the fusion of two classic side-scrolling gameplay styles: sandbox-level progression and Metroidvania-inspired adventures. Battle diverse enemies and face stage-specific bosses within the sandbox-style levels. Embark on a journey through a procedurally generated Metroidvania vast map, stepping into hidden forbidden zones and unraveling the story's climax.<br/><br/><br/><br/>In this fictional near-future, a technology known as \"ACE\" allows people to enter a virtual world and fight as different characters. Yet little do they know what happens in the virtual world is slowly changing their reality...<br/>Phenomenon Fragments could either reveal or conceal the truth... Will you trust them?<br/>Your dialogue choices will decide which way the story goes... How will you choose?<br/>Make your choices carefully, for they will lead to completely different destinations at the end of your eventful journey.", "metacritic": null, "released": "2023-08-15", "tba": false, "updated": "2024-03-01T17:53:02", "background_image": "https://media.rawg.io/media/screenshots/8a7/8a7e7d95bcae532fac4e0c83da7b8099.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 10, "beaten": 2, "toplay": 15, "dropped": 2, "playing": 1}, "playtime": 10, "achievements_count": 35, "ratings_count": 3, "suggestions_count": 368, "game_series_count": 0, "reviews_count": 3, "platforms": ["macOS", "PC"], "developers": ["91Act"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["91Act"], "esrb_rating": null}