{"id": 965028, "slug": "bot-crisis", "name": "Bot Crisis", "name_original": "Bot Crisis", "description": "Put your wits and acting skills to the ultimate test! In this 3D online game, players are transported to a variety of captivating stages. The goal? To <strong>identify which of the characters are real players and who's just pretending to be a bot!</strong><h3>Gameplay</h3><br/><ul><li> <strong>Identify real players</strong>: Can you discern who's a real player and who's an expertly disguised bot?<br/></li><li> <strong>Behave as a bot</strong>: To avoid detection, you must behave as a bot yourself. This means moving around randomly and avoiding doing anything that would make you stand out.<br/></li><li> <strong>Expose the players</strong>: There are animals and other hazards that can expose the real players. For example, some innocently annoying animals will only approach real players.</li></ul><br/><h3>Features</h3><br/><ul><li> <strong>Multiple stages</strong>: The game features multiple stages, including a farm, a desert, a haunted forest, a snow level, and a battlefield.<br/></li><li> <strong>Customization</strong>: You can customize your appearance, including your skin color and clothing.<br/></li><li> <strong>Chat</strong>: You can chat with other players. Though it is up to you whether to help them or fool them :).<br/></li><li> <strong>Leaderboard</strong>: Compete on the leaderboard to become the ultimate <strong>Bot Crisis</strong> champion!</li></ul><h3>Humor</h3><br/>The game is full of humor, with funny animals and other hazards that can expose the players. This makes the game both challenging and fun.", "metacritic": null, "released": "2023-08-16", "tba": false, "updated": "2023-08-18T04:43:04", "background_image": "https://media.rawg.io/media/screenshots/3fd/3fd7ba4ce10191379f9f886f7d36a80f.jpg", "website": "https://www.codya.co/botcrisis", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Codya"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Codya"], "esrb_rating": null}