{"id": 965092, "slug": "fairyscapes-adventure", "name": "Fairyscapes Adventure", "name_original": "Fairyscapes Adventure", "description": "Explore the new fairytale land after happy ending!<br/><br/>How's life going on after Princess married the Prince? Is it real that they live happily ever after?<br/>Welcome to the world of Fairyscapes. Join Sophia to travel between real world and the fairytale land. While there, you'll meet Cinderella,Princess Snowy,Little Mermaid,Bella and other fairy characters. Help them to solve their problems in fairy world. <br/><br/>Features:<br/>- New Stories: Explore a new story after happy ending. Reveal Princess‘daily life in the fairy world.<br/>-Treasures: Collect all kinds of supplies and magical items to keep your fairyland happy and prosperous.<br/>- Explorations: Set on a mysterious adventure and explore the fairytale world: the enchanted Forest, the underwater Dungeon, the magic Palaze and many other fancy places in the fairyland. Save Fairytale land from unknown curse.<br/>-Characters: Meet different fairytale characters - Cinderella,Snowy,Little Mermaid, Bella...... Help them solve daily problems. You can change their stories if you want!<br/>-Chioces: Make different choices in the story.Experience the life of different fairy characters, all in one game!<br/><br/>You can now use the following subscription plans (prices may vary by location):<br/>Regular 1-month subscription for $14.99 with a free 3-day trial.<br/>-Payment will be deducted from the iTunes account at the time of purchase confirmation.<br/>-The subscription will automatically renew at the end of the period unless it is canceled at least 24 hours prior to the end of the current period in the account settings.<br/>-The account will be charged for renewal within 24 hours before the end of the current period, and the renewal fee will be determined.<br/>-After purchase, the subscription can be managed by the user, and automatic renewal can be turned off by going to the user's iTunes account settings.<br/>-During the active subscription period, the current subscription cannot be canceled.<br/>You can cancel the subscription through your iTunes account's subscription settings during the free trial period. This must be done 24 hours before the end of the subscription period to avoid charges. Please visit https://support.apple.com/HT202039 for more information.<br/>-You can turn off the automatic renewal of the subscription through the iTunes account settings. However, you cannot cancel the current subscription during its active period.<br/>-When a user purchases a subscription, any unused items from the free trial period will be taken back.<br/><br/>Terms of Service: https://betta-games.com/terms<br/>Privacy Policy: https://betta-games.com/privacy<br/><br/>Enjoy Fairyscapes Adventure? Learn more about the game on our Facebook Fan Page: <br/>https://www.facebook.com/Fairyscapes-Adventure-110208544506877", "metacritic": null, "released": "2023-06-15", "tba": false, "updated": "2023-08-18T06:05:47", "background_image": "https://media.rawg.io/media/screenshots/11f/11fe478f7862a5332abefc496bf9fe30_MvIu4TA.jpg", "website": "http://betta-games.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["BETAGAMES PTE"], "genres": ["Simulation", "Casual"], "publishers": ["BETAGAMES PTE"], "esrb_rating": "Everyone 10+"}