{"id": 965001, "slug": "ai-dreams-of-roses-of-desert", "name": "AI Dreams of Roses of Desert", "name_original": "AI Dreams of Roses of Desert", "description": "Japan's declining birth rate is unstoppable and engineering has advanced.<br/>On her way home from work, Ruri picked up Aizen, a male prostitute android who was abandoned in a corner of the city.<br/>Ruri stayed up all night repairing Aizen, but because the owner of Aizen neglected regular inspections, she was able to keep her body for five days.<br/>Ruri will spend the final five days with Aizen.<br/><br/>Genre: AVG (ADV), R18<br/>Otome (Maiden) Adventure Game, Near future Fantasy Setting<br/>11 still images<br/>This game can be played with only a mouse.<br/><br/>・Ruri Heroine of this work<br/>He is a certified android maintenance engineer and has a workshop in a corner of the city.<br/>On the other hand, she makes a living as a prostitute, which is rare for a real human being.<br/>\"It's hard to settle down in one land, and it's a wandering body.\"<br/>\"He's good as an engineer, but his dexterity is poor.\"<br/><br/>・Aizen<br/>A male prostitute android produced by RC Company, type RC4698.<br/>Five years after it was produced, it was not inspected regularly, and it was thrown away and picked up by Ruri.<br/>\"Good-natured and soft-spoken.\" Always smiling and always smiling.<br/>\"I'm not good at fighting.\"<br/><br/>○ sub-characters<br/><br/>・Purple (Yukari)<br/>A handsome one who helps Ruri as a town informant and handyman.<br/>A strong ally of money.<br/><br/>・Kureno<br/>A legal shota who is Ruri's best customer as a prostitute.<br/>\"Contrary to his appearance, he is already an adult.\"<br/>A heavy smoker.<br/>He urges Ruri from time to time.<br/><br/>・Hisui<br/>???<br/><br/>The player becomes the main character and chooses his own destiny.<br/>Bring happiness to his beloved and many others.<br/>Visual novel.<br/><br/>[Supplements and notes when playing the game]<br/>Because the heroine of this work (Ruri) is an android maintenance engineer (see above setting)<br/>I want players to experience that professional sentiment, so I've given them some \"productions\".<br/>The difficulty of repairing a malfunctioning android.<br/>The process of repairing corrupted programs.<br/>How information was collected in the IT industry. etc. are expressed using game-like \"production\" and BGM.<br/>You may sometimes feel a surprising sense of tension... but that's how the main character, Ruri, feels.<br/>Restoration work is also an act that always walks on the edge of failure and side by side.<br/>Please understand this point and enjoy this work and \"IT-like production\".<br/><br/>This work contains violent and bloody scenes. please note<br/><br/>Voice will be directed only for some scenes", "metacritic": null, "released": "2023-08-15", "tba": false, "updated": "2023-08-18T04:05:18", "background_image": "https://media.rawg.io/media/screenshots/eee/eee62288c27b594309a9e007408c3862.jpg", "website": "http://magichouse.uh-oh.jp/18ai_1.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 519, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MagicHouse"], "genres": ["Adventure", "Indie"], "publishers": ["MagicHouse"], "esrb_rating": null}