{"id": 96501, "slug": "wind-time-slime", "name": "Wind | Time Slime", "name_original": "Wind | Time Slime", "description": "<p><strong>Wind Slime:</strong><br/></p>\n<p>Locked in battle with a powerful dark mage, the arrogant wind mage has met his match. Unexpectedly, the wind mage is sealed into the body of a slime, and he is tasked with ascending the snowy mountain to again reach his foe in order to claim his body back.<br/></p>\n<p>Slimes cannot jump -- however, by collecting mana crystals the wind mage is able to use a small fraction of his power to move his new cumbersome body, or objects around him, in order to navigate the hazardous mountain.<br/></p>\n\n<p><strong>Time Slime:</strong><br/></p>\n<p>Trapped in the body of a slime, a powerful mage must ascend to the top of a mountain in hopes of finding a way to return to his original form. Collecting mana crystals allows him to reverse time in short bursts, riding the updrafts caused by the rising snow and navigating the treacherous mountain.<br/></p>\n<p>Wind Time Slime was made for the 2018 Kenney Jam! As such, all in-game art assets come from Kenney's amazing asset packs.</p>\n<p>Music: WaveParadigm</p>\n<p>     https://waveparadigm.bandcamp.com/album/wind-time-slime<br/></p>\n<p>Art: Kenney</p>\n<p>Audio: BFXR, Soniss GDC 2018 pack<br/><br/></p>\n<p>(The real game is Wind Slime -- Time Slime has a bit more limited movement but fits better with the theme of Kenney Jam)<br/></p>\n<p>(Select which one you'd like to play by pressing 'T' on the title screen to toggle between Wind Slime and Time Slime!)<br/></p>", "metacritic": null, "released": "2018-08-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e64/e649224ea569afce3e227142b17ec12e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["WaveParadigm"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}