{"id": 965011, "slug": "she-fell-off", "name": "She Fell Off", "name_original": "She Fell Off", "description": "Unravel the enigma of the post-apocalyptic world in \"She Fell Off,\" an indie game crafted by a single developer that plunges you into a dystopian, sci-fi reality where everything familiar has been lost. This atmospheric, third-person, 3D platformer draws you into a mystery that transcends reality as we know it, enveloping you in a paradox where you control Eve, a vibrant, mysterious heroine.<br/><br/>\"She Fell Off\" paints a dark yet colorful World where the Earth's crust has been devoured, replaced by an unforgiving, acid ocean. With nothing but three enormous, black lily pad-like plants spanning the size of Africa as the only remnants of life, you'll navigate the once-vibrant world, now turned silent and spectral.<br/><br/><br/><br/>But the real mystery lies beneath the surface. Test your courage and step into the underground realm, a perplexing anomaly that houses horrors more terrifying than the surface's desolation. Here, in this minimalistic, precision platformer world, danger lurks in the darkness and the only source of light is you, with Eve's radiant yellow outfit piercing the ever-present gloom.<br/><br/>Survival is a matter of skill and grit in this game. Designed for gamers seeking an intense and frustrating challenge, \"She Fell Off\" provides no save points. Every demise, every failure, will bring you back to the beginning, forcing you to learn, adapt, and ultimately, to conquer the unknown. It is a relentless test of your resilience as you leap from platform to platform, seeking answers, and perhaps, redemption in the eerie quiet of this post-apocalyptic underground landscape.<br/><br/><br/><br/>The game’s precision platforming, combined with its terrifying premise, creates a unique and unsettling twist on the 3D platformer genre. The heart-pounding tension of a horror game mixes with the demanding, unforgiving gameplay of a precision platformer to create a truly distinct experience. As a single-player game, \"She Fell Off\" offers an immersive and nerve-wracking adventure that pushes the boundaries of what a 3D platformer can be.<br/><br/>Play as Eve, the game's mysterious female protagonist, whose backstory remains as enigmatic as the world she traverses. Delve deep into the head cannon of her mystery, unraveling threads of intrigue and deception. The true essence of Eve, however, is never explicitly revealed, keeping you forever on edge, questioning, wondering, and fearing the unknown.<br/><br/>Experience the eerie beauty of a stylized, post-apocalyptic world in \"She Fell Off.\" It's a journey into the unknown, a descent into darkness, and a leap of faith into a reality where mystery prevails and danger lurks around every corner. Do you have what it takes to navigate this terrifying underground environment, and unmask the chilling secrets of the past? \"She Fell Off\" awaits your challenge. Remember, in this world of shadows and deception, the only beacon of hope is you.", "metacritic": null, "released": "2023-08-15", "tba": false, "updated": "2023-08-18T04:19:13", "background_image": "https://media.rawg.io/media/screenshots/490/4900b446f64c4d7f9403748afb3b52f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Oliver Nelson"], "genres": ["Indie"], "publishers": ["Oliver Nelson"], "esrb_rating": null}