{"id": 965054, "slug": "mystery-box-evolution-2", "name": "Mystery Box: Evolution", "name_original": "Mystery Box: Evolution", "description": "Turn wheels, move handles, push buttons, and think smart to unlock all the boxes and collect tiles to discover lost artifacts. You can find hidden tiles on the side of the boxes as well, so pay attention to the details!<br/><br/><strong>THE GHOST BOX</strong><br/>Discover all Artifacts in the game to unlock an extra amazing level, the Ghost Box!<br/><br/><strong>REALISTIC GRAPHICS</strong><br/>Drag the mouse to walk around each box and feel like you're trapped in a room for real<br/><br/><strong>DISCOVER LOST ARTIFACTS</strong><br/>Once you open all 8 boxes of a chosen pack (and you also collected the small hidden puzzle tiles on the side of the boxes), you'll be able to compose a puzzle and discover a brief history of an artifact.<br/><br/><strong>AMAZING PUZZLES</strong><br/>Think outside of the box to solve all riddles, it's not always easy, but I know you can make it!<br/><br/><strong>CHILLING BACKGROUND MUSIC</strong><br/>Play the game with your headphones and get immersed in the adventure! Each Box Pack has got its music theme.<br/><br/><strong>HINTS</strong><br/>In case you get stuck in a level, click the bulb button to get a hint that will help you solve the puzzle you're facing<br/><br/><strong>ACHIEVEMENTS</strong><br/>Can you complete all the achievements of this game? Every time you'll complete a Box Pack, you'll earn its special Steam achievement. Don't forget to show your results to the community and your friends", "metacritic": null, "released": "2023-08-16", "tba": false, "updated": "2023-08-18T05:16:35", "background_image": "https://media.rawg.io/media/screenshots/4db/4db9a9b2f3022b58f22ee2d3a62a9b02.jpg", "website": "https://xsgames.co/mystery-box-evolution.php", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 315, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["XSGames"], "genres": ["Adventure", "Strategy", "Indie"], "publishers": ["XSGames"], "esrb_rating": null}