{"id": 965038, "slug": "waven", "name": "Waven", "name_original": "Waven", "description": "In a flooded world where only a few islands have survived the rising waters, you play a seafaring adventurer searching for answers to this great upheaval. Long ago, gods and dragons ruled the world. Today, magic remains but what of the mythical beings of yesteryear?  <br/><br/>At the dawn of a new era, choose your hero, equip your best spells and set sail for an incredible odyssey. Sail from island to island in a vast world full of colorful creatures, gain power, refine your strategy and uncover the secrets of a world adrift. <br/><br/>WAVEN is a new roleplaying game experience that is accessible, fun and immersive. It combines adventure and turn-based strategy, inspired by the best tactical RPGs, with deckbuilding mechanics and valuable items to collect. It can be played for free online on PC, Mac, smartphone and tablet. <br/><br/>Alone or with friends, face off against multitudes of burlesque monsters of increasing difficulty. Master the elements, cast powerful spells, summon mythical companions and battle your enemies in close combat or from a distance to defeat them and win tons of loot! <br/><br/>Gain experience to upgrade your hero and prove your valor by entering the doors of the \"Kolossium\" to challenge other players and become a legend yourself!<h3>TACTICAL RPGs REVISITED</h3>WAVEN takes inspiration from the combat and progress systems of the best tactical RPGs while building on the strategic depth of turn-based combat and deck building. The result? An explosive and joyful combo!  <br/><br/><h3>LIVELY TURN-BASED COMBAT</h3>Prepare your deck before each battle and use every ruse available to you to take home the victory! Play in your own style! Your options are practically unlimited when combining the many character archetypes, spells, equipment and companions available.<h3>ALL MODES ARE YOURS</h3>PvE, PvP : take advantage of each game mode to express yourself! Fight monsters to harvest resources and win equipment, and challenge other players to climb to the top of the rankings! <br/><br/><h3>PLAY AS A GREAT HERO</h3>Win battles, earn experience, spells and companions, customize your equipment and deck, and take your strategy to new heights.<h3>A CROSS-PLATFORM ADVENTURE</h3>Continue your adventure wherever you are! Enjoy WAVEN on PC, Mac, smartphone or tablet with the same account. <br/><br/><h3>AN ORIGINAL UNIVERSE WITH A UNIQUE GRAPHIC STYLE</h3>Explore a colorful heroic fantasy world inside a distinctive graphic universe, the \"Krosmoz\", a persistent world that has existed for years in video games, animated series and much more.<h3>WHILE YOU'RE WAITING FOR THE EARLY ACCESS</h3>Add WAVEN to your Steam wishlist and follow us so you don't miss any updates!", "metacritic": null, "released": "2023-08-16", "tba": false, "updated": "2024-01-09T01:59:20", "background_image": "https://media.rawg.io/media/screenshots/e75/e7562dd64e0931129fb1410a6800a9ef.jpg", "website": "https://www.waven-game.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 76, "toplay": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 363, "game_series_count": 0, "reviews_count": 4, "platforms": ["macOS", "PC"], "developers": ["Ankama Studio"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": ["Ankama Games"], "esrb_rating": null}