{"id": 965017, "slug": "ruled-by-rule", "name": "Ruled by Rule", "name_original": "Ruled by Rule", "description": "\"Ruled by Rule\" is an RPG that mainly includes adult elements such as rape and hypnotic brainwashing, as well as combat. This game features the following characteristics:<br/><ul><li>Erotic specialization in combat. The erotic content of this work focuses on the combat part, and there is no need to wait for the defeat CG in combat.The main erotic scenes will take place within the combat scenes.<br/></li><li>After being defeated, in this work, the gameplay in this game does not result in a Game Over. The perspective  shift from the Public Order Princesses to the villains who enslave them, providing unique post-defeat content for players to engage with. Players will control the villains and use various methods to manipulate and bully the Public Order Princess.<br/></li><li>The World's Rule System: Within the game's worldview, there exists a set of laws that surpass the physical rules of the world, known as \"The World's Rule\". Any declarations made by \"The World's Rule\" are guaranteed to come true. Villains can use the villain points earned from their misdeeds to activate various World Rules that work against the Public Order Princess. By utilizing these excessive World Rules, they gradually lead the security princesses into corruption.</li></ul><h3>Combat Erotic Specialization</h3>The work highly specializes in explicit content within combat, which can be summarized by the following characteristics:<br/><ul><li>Erotic CG appears during combat. In this game, the core explicit CG content is not presented in a visual novel style but rather directly within the combat scenes. There is no need to wait until the battle is over to enjoy defeat CG. Instead, Players can quickly experience this content directly within the combat scenes, eliminating the need for tedious waiting.<br/></li><li>Further specialization of combat erotic. Unlike general \"combat erotic specialization\" games, where you can only see a single fixed explicit CG per battle, this game expands the range of explicit content depicted through CG during combat. Furthermore, the game includes a larger quantity of explicit CGs, providing a wider variety of content for players to experience.<br/></li><li>Erotic performance is incorporated into combat. This work features a unique combat system where players need to consider strategies to avoid being violated and how to break free from restraints if violated. These aspects are taken into account during actual battles, making even goal-oriented combat engaging and far from boring.</li></ul><h3>The World's Rule System</h3>In the game, when the protagonist is defeated, the perspective shifts to the villain who enslaves the protagonist. You can operate the villain to commit evil deeds and to earn villain points, you can use those villain points to unlock harsh World's Rules. There are a total of 30 World's Rules, covering various plays and scenarios.:<br/><ul><li>Compulsory effect system. For example, Rule 17: If the Public Order Princess is defeated in battle, she must pay the opponent a compensation of 100,000 yen.<br/></li><li>Personality change system. For example, Rule 6:  Being compelled to develop feelings of admiration towards their enemies, and after each defeat in battle, those feelings of admiration will grow stronger.<br/></li><li>Bodily suggestion system. For example, Rule 4: When the Public Order Princess is creampied during sex with others, her body forcibly produces a large amount of pleasure and reaches climax.<br/></li><li>Common sense change system. For example, Rule 29: It is the duty of the Public Order Princess to relax the minds of the residents by dancing vulgar dances on the stage of the store.</li></ul>By utilizing a variety of world rules, you can manipulate the \"Public Order Princess\" character and gradually make her situation more and more unfavorable.", "metacritic": null, "released": "2023-08-15", "tba": false, "updated": "2023-08-18T04:26:48", "background_image": "https://media.rawg.io/media/screenshots/cb0/cb0c5b0bc42d29f1d483788a77169d19.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 402, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["KineticDog"], "genres": ["RPG", "Indie"], "publishers": ["KineticDog"], "esrb_rating": null}