{"id": 965183, "slug": "nothorian-online-acceso-anticipado", "name": "Nothorian Online: Acceso Anticipado", "name_original": "Nothorian Online: Acceso Anticipado", "description": "El Señor del Caos, recluido en el infierno desde memorias inmemoriales, ha regresado para lograr su ansiado sueño, traspasar el Portal del Destino para acceder a nuestro mundo y sembrar el Terror. Actualmente el poder de una Diosa Ancestral que solo permanece en la memoria de quienes conocían su existencia, brota nuevamente y misteriosamente van apareciendo nuevos Héroes donde tienen todo lo necesario para tratar de encontrar y derrotar al señor del Infierno antes de que logre llegar a nuestro mundo.<br/>\n<br/>\r\nLos jugadores podrán administrar y personalizar sus personajes a través de todo tipo de acciones en la zona segura y común, así como acceder a Battle Zones, Mega Bosses, Challenges, PVP, Clan System y muchas otras cosas. Gráficos de la era clásica de los MMO 2D junto con una banda sonora original y épica acompañarán a los jugadores durante las muchas horas que nos ofrece este título, brindándoles un entorno clásico y dinámico a medida que exploran y se vuelven cada vez más poderosos buscando nuevas construcciones para sus personajes.<br/>\n<br/>\r\nDespués de Derrotar al Señor del Caos y el Infierno en el modo Normal, los Jugadores podrán continuar con constante contenido nuevo gratuito y de larga duración además de las Expansiones de pago que recibiremos con el tiempo. Únete al Discord oficial para acceder a servicios externos relacionados con el juego y únete a la comunidad.", "metacritic": null, "released": "2023-08-18", "tba": false, "updated": "2023-08-21T03:27:29", "background_image": "https://media.rawg.io/media/screenshots/e8c/e8c5b9c424dc96f391dd94e5f22df672.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 298, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Raghnar", "Fantasmyta"], "genres": ["Action", "RPG", "Massively Multiplayer"], "publishers": ["Rapshody Games"], "esrb_rating": null}