{"id": 965168, "slug": "daisy-flies-to-the-moon", "name": "Daisy Flies to the Moon", "name_original": "Daisy Flies to the Moon", "description": "The year 2083... A colony on the Moon... cut off from Earth, with no hope of return...  One engineer searches for signs of life, while trying to make contact with Earth...<br/><br/><br/><br/>In the spring of 2077, Daisy graduates from engineering school.  New jobs, experiences, and travel seems to be at her fingertips.  The world and beyond lays ahead of her...   until the C+ average she maintained causes her dreams to come to a crashing halt and she simply told her friends she was \"between opportunities.\"<br/><br/>The large corporations and defense contractors chose to hire all the new Ivy League graduates and all the good internships went to Cum Lauds, Magna Cum Lauds, and all the other Lauds...<br/><br/>With no other options available, Daisy chose the one internship that had zero applicants...  A job no one else wanted in 2077...  A year on the Moon... on a tiny outpost... to research lunar rock formations.  One year... looking at rocks...<br/><br/>Near the end of the year, as everyone eagerly awaited their return home, the outpost suffered a complete loss of connectivity with Earth.  All communication systems went down.  There was no more contact from home.<br/><br/>When the year ended, no one came to pick them up.<br/><br/>Years passed since the lunar travelers were stranded on the Moon.  The outpost had life support systems to keep everyone alive, but there still wasn't a word from Earth.<br/><br/>In the beginning of 2081, a virus started to spread through the lunar colony.  A plant-based infection covered people's skin with spores.  It would eventually spread over their entire body and from there it would move into their brain, driving them insane.  The colony was split in two, with the sick occupying Delta Base, and the dwindling number of uninfected staying on Theta Base.  Five years on the Moon, and there was still no response from Earth.  The infected began to regularly attack Theta Base, trying to overrun what was left.<br/><br/>Daisy, an engineer intern, and Herbert, a robot she built from scrap, volunteered to adventure out on the Moon into the unknown to search for help.  They would face the infected mutants and other monsters that had taken over while desperately trying to contact Earth for an evacuation.  They soon would uncover a plot that spanned beyond the galaxy as they stood ready to face the monsters that were waiting at the doorstep and find a way home.<br/><br/>Features:<br/><ul><li> An expansive, open world to explore.</li><li> Hundreds of original enemies to fight and dozens of unique weapons and spells.</li><li> A rich, science-fiction story that takes you through space.</li><li> Hours and hours of RPG gameplay.</li><li> Fully playable on Steam Deck!</li></ul>", "metacritic": null, "released": "2023-08-18", "tba": false, "updated": "2023-08-21T03:01:37", "background_image": "https://media.rawg.io/media/screenshots/29e/29e988295aca3f512ee004924c503fa9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["PDS Games"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["PDS Games"], "esrb_rating": null}