{"id": 965140, "slug": "the-danger-zone", "name": "The Danger Zone", "name_original": "The Danger Zone", "description": "<h3>Discover the new game universe of The Danger Zone:</h3><ul><li>Unique shooter-based gameplay with side view, horror elements and immersive survival mechanics in a post-apocalypse setting.<br/></li><li>Plot-linear story mode in the form of memories of the main character.<br/></li><li>Free game mode: A huge, uninhabited concrete shelter in which the player will have to arrange his life. A global map with a large number of sub-locations and points of interest. Changing the weather, the cycle of day and night will increase the immersion in the setting.<br/></li><li>Realistic artificial intelligence systems that, along with a constant shortage of ammunition, will keep even the most seasoned players in suspense.</li></ul><h3>Discover the new game universe of The Danger Zone:</h3>After thousands of intercontinental nuclear missiles have dissected the earth, enough time has passed: the era of eternal and cold winters is gone. The radioactive background slowly rushed down. And people who have been dragging their existence in underground shelters for a dozen years have reopened the gates of hermetic locks, smouldering with the hope of regaining control of the previously destroyed and lost world.<h3>The story is just an essay in a school notebook. </h3><br/>For our protagonist, the story is really over, while for the player it slowly manifests itself on the pages of a self-written diary. Get ready to plunge into the endless stream of events that pursued our hero along the way. Having met the sunset of the human era as a small child, having seen the subsequent horror, after a while, the main character risks repeating the mistakes of the past again... Or not?<h3>And eventually...</h3><br/>Having escaped from the underground dungeon, we were again buried under a dense layer of earth in a concrete box - in a bunker. It's dark, wet and incredibly cold. We are here for a long time and therefore it would be nice to equip our new home, and finally fix a hole in this rusty pipe.<h3>This oppressive firmament.</h3><br/>As a result of the global conflict, the world has undergone serious changes. Pressing the red buttons, the leaders of the superpowers did not spare to exchange the most advanced means of destruction. Previously, the white-blue sky was forever painted in bright yellow shades, the radioactive background jumped dozens of times, and the district was filled with previously unknown and not very friendly creatures.<h3>Beyond the German revolution.</h3><br/>A massive unexplored territory stretches around the shelter. Beyond the edge of the forest there can be both a small abandoned village and a huge city where everyone will find what they are looking for.<br/>Attention! The global map will be updated and updated in every major content update.<h3>Everything has eyes, but not enough ammo for everyone.</h3><br/>Widespread radioactive contamination is only one of the consequences of the nuclear conflict. Along with nuclear weapons, previously banned biological weapons have made changes to the surrounding fauna. Get ready to meet creepy, frightening, and very unfriendly creatures on your way.", "metacritic": null, "released": "2023-08-17", "tba": false, "updated": "2023-08-21T02:24:17", "background_image": "https://media.rawg.io/media/screenshots/7c9/7c9dde721e427bd7499ff7c5cff3e759.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Andrey Khramushin"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Andrey Khramushin"], "esrb_rating": null}