{"id": 965191, "slug": "lawgivers-ii", "name": "Lawgivers II", "name_original": "Lawgivers II", "description": "Lawgivers II is a turn-based political and geopolitical simulation game. The player can choose to start the political career as a simple activist or directly as the leader of a party. There are three alternative ways to win the game: By pursuing personal interests, party influence or national prestige.<h3>World</h3>A hand-crafted realistic world map featuring the most well-know countries, regional/state subdivisions and cities. The playable nations will feature electoral districts too. Use comfortable filters to display population density, foreign relations, gdp growth, military spending, media outreach, election outcomes, etc. For a better overview, the map can also be projected onto 2D.<br/><br/><h3>Elections</h3>Lawgivers II is designed to be a sandbox game, where players can experiment new strategies for winning elections and implement policies to avoid national bankruptcy. All playable nations start with their own system and rules. During the game the lawmakers might propose to parliament/congress to switch to another electoral system which can be proportional, majoritarian or mixed. Constituencies are also editable and allow practicing gerrymandering for winning the elections. Debates can be organized in a region/state to discuss important matter that affects that part of population.<br/><br/><h3>Parliament/Congress</h3>Enter the parliament/congress with your lawmakers to approve or abolish laws in a much expanded and realistic way. Elect the speaker of the house to watch over parliamentary democracy and set up custom committees. Lawmakers will have their own opinion about laws and ways to rule. If there are too many points of view inside the party, some politicians might leave or form another one. Check out their personal history and be sure to secure their trust during the most difficult times. Request a secret vote for a bill, or a motion to impeach the president.<br/><br/><h3>Laws</h3>Personalize and approve bills, article by article, like never before. With constitutional amendments players are able to control the workflow of the most important institutions of the country. Players will have total freedom to choose whether to incorporate a specific bill into the constitution or approve it as an ordinary law.<br/><br/><h3>Government</h3>Run for the highest seat in presidential and semi-presidential republics or become the prime minister in parliamentary republics. Form a government alone or with a coalition of parties and manage to survive motions of no confidence. Bypass the parliament if necessary, to meet your needs, but be prepared to face the consequences.<br/><br/><h3>Organisations and Lobbies</h3>Organizations and lobbies can wield a significant amount of influence in your country. You can seek their support by hiring one of their representatives or choose to practice honest and clean politics and be a good servant of the country.<h3>Trade &amp; War</h3>Every nation has something to offer to the world, whether it's know-how, raw materials, or exotic fruits. In the role of head of the government, you will have to visit other countries and forge strategic alliances to secure vital resources for your citizens. Influence nearby regions with your main ideology or surprise the world by pressing the red button, but be prepared to face strong political consequences and sanctions! While war is possible, it's highly discouraged, and the repercussions might be catastrophic for your economy as well.<br/><br/><h3>Multiplayer</h3>Join with your friends in a coalition to form the government, or simply stay in opposition and get ready for your first chance to grab power. (Available at a later development stage)<h3>Mods</h3>The game comes with Steamworks support. Modders can add new countries, laws, events, parameters, resources, ideologies, and more content with just a simple text editor. The appearance of lawmakers is completely customizable too, so you can draw and import portraits of your favorite politicians!<br/><br/>Join our community on Discord, participate in development polls and contribute to one of the most ambitious political simulation games!", "metacritic": null, "released": "2023-08-18", "tba": false, "updated": "2024-01-06T22:18:03", "background_image": "https://media.rawg.io/media/screenshots/6da/6da4df04c0da1fdf258fce9f529c30be.jpg", "website": "https://www.lawgivers.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 2, "platforms": ["Linux", "macOS", "PC"], "developers": ["Damian Bernardi"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["SomniumSoft"], "esrb_rating": null}