{"id": 965160, "slug": "astro-heist", "name": "Astro Heist", "name_original": "Astro Heist", "description": "<strong>Join the Action in Astro Heist and Prove Yourself as a Covert Pilot or Skilled VR Watcher!</strong><br/><br/><strong>Pilot Player</strong> -  Become a masterful pilot navigating bustling space outposts on daring heists. Maneuver through intricate structures, hidden areas, and challenging routes to collect valuable objectives scattered throughout the outpost, all while avoiding the watchful eye of the VR player.<br/><br/><strong>VR Player</strong> - Take on the role of VR Watcher and use your keen eye to spot the sneaky saboteur.  Send out police squads to search suspicious activity and activate security gates to set traps that trigger the alarm.<br/><br/><strong>A New Perspective!</strong> Experience the visually stunning and stylized universe of Astro Heist, where arcade-style gameplay has you hurtling through a gigantic space outpost, maintaining your cover while completing challenging objectives.  The VR player enjoys a diorama-style view into the world, allowing greater oversight of the outpost as they look around the tiny world.<br/><br/><strong>Accessibility is a Top Priority!</strong> We've ensured that the VR aspect is 100% Gaze-controlled, making the game accessible to as many players as possible.<br/><br/><strong>Asymmetric PvP Experience!</strong> The game is designed for 2 players, but with Steam's Remote Play Together feature, you only need one copy of the game for two players to connect from anywhere in the world or play locally on a single setup.<br/><br/>During Early Access, your feedback is essential to shape the game's future. Expect more levels, missions, and a wider range of vehicles in the full release.  The Early Access version includes a single replayable mission and a single vehicle.<br/><br/>Prepare for thrilling heists, intense action, and an unforgettable experience in Astro Heist. Are you ready to embark on this daring mission?", "metacritic": null, "released": "2023-08-18", "tba": false, "updated": "2023-08-21T02:50:48", "background_image": "https://media.rawg.io/media/screenshots/5a6/5a6b22adfb04b34e8d0592c7cd7c58b1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 575, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ProjectorGames"], "genres": ["Action", "Strategy", "Simulation", "Indie"], "publishers": ["ProjectorGames"], "esrb_rating": null}