{"id": 965131, "slug": "tian-gui-tian-tiao-rule", "name": "天规天条 Rule", "name_original": "天规天条 Rule", "description": "In the game, each level will be a new experience, random ghost, random item refresh, a variety of ways to pass, the player's personal style of challenge strategy and unique \"rules\" play.  When you trigger the condition required by the Ghost Rule in the level, you will receive a \"deadly attack\".  The player can use items to neutralize this attack.  Once in the level the player was very lucky that the \"rule\" did not trigger, bringing all the items back to the safe zone.  It is also possible to trigger the \"rule\" of the Ghost continuously in the level, resulting in an early return to the safe zone.  Even return the archive to its original appearance. Players can cleverly use a variety of items to complete the level.  You can also gain insight into and seize the rules of the Ghost, and run amok in the level.  Players can also use ghost rules to attack other ghosts.  Players need to decide the strategy according to their own situation, and the Great God's walkthrough can only be used as a reference, trust me.<br/>\n<br/>\r\nNow let's talk about what \"rules\" are. A \"rule\" is a condition that needs to be observed within its effective scope, and when the \"rule\" is violated, certain penalties will be imposed. A few simple examples of \"rules\" to facilitate the player's understanding, but also introduce the current \"rules\" in the \"rules\" of several elements, later will add more elements.<br/>\n<br/>\r\n1: movement<br/>\n<br/>\r\nExample 1 No Jumping: Jumpers will be attacked if they are in effect, but not if they are not jumping.<br/>\r\nExample 2 No walking: People who walk within the effective limits will be attacked, if not walking will not be attacked.<br/>\r\nExample 3 Must jump: Those who do not jump within the effective range will be attacked.<br/>\n<br/>\r\n2: Behavior<br/>\n<br/>\r\nExample 4 Item Pickup: Items picked up within the effective range will be attacked, if not picked up will not be attacked.<br/>\r\nExample 5 Open the door: Open the door within the effective scope will be attacked, if not open the door will not be attacked.<br/>\n<br/>\r\n3: Relative position in space<br/>\n<br/>\r\nExample 6 Prohibit ahead: The player or the Ghost will be attacked when they are in front of the Rule holder.<br/>\r\nExample 7 Forbidden Above: The player or the Ghost will be attacked when they are above the Rule holder.<br/>\n<br/>\r\n4: time<br/>\n<br/>\r\nExample 8 Do not stay for 10 seconds: Stay for 10 seconds within the effective range will be attacked.<br/>\r\nExample 9 Must stay for 10 seconds: You must stay for 10 seconds within the validity range.  If you leave the validity range without staying for 10 seconds, you will be affected.<br/>\n<br/>\r\n5: Speed<br/>\n<br/>\r\nExample 10 No Running: When the player reaches running speed, they will be attacked.<br/>\r\nExample 11 Forbidden to Stay: When the player stays in place without moving, it will be attacked.<br/>\n<br/>\r\nThe above are the current \"rules\" of the \"rules\" of the generation elements, the player can infer the \"rules\" of the ghost according to the above elements, the current \"rules\" will only have 1 or 2 elements.<br/>\n<br/>\r\nAs for how the player can obtain the \"rules\", when the ghost is attacked by other \"rules\" will fall asleep and stop activities, at this time the player can interact with the ghost, the player answers the right  \"rule\" will be included in the safe zone.Please note that the wrong answer will be attacked.<br/>\n<br/>\r\nghost: A challenger who cannot return and remains in the level forever.   Each ghost has a unique \"rule\" and will be attacked when a challenger or other ghost meets the conditions.<br/>\n<br/>\r\nDeletion probability: The player will calculate the deletion probability after selecting the challenge difficulty, and when the player dies in the level, it will determine whether to delete the current save according to this probability.  Please play with caution.", "metacritic": null, "released": "2023-08-20", "tba": false, "updated": "2023-08-21T02:12:34", "background_image": "https://media.rawg.io/media/screenshots/cf0/cf0aac17276e4106aafe7bf273091793.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["虚拟宇宙"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["虚拟宇宙"], "esrb_rating": null}