{"id": 965179, "slug": "evil-officer", "name": "Evil Officer", "name_original": "Evil Officer", "description": "Prepare yourself for an intense and terrifying survival horror experience in Evil Officer for PC. You find yourself trapped in the ominous house of a malevolent Officer who met a grim fate long ago. Unbeknownst to you, he seeks revenge from beyond the grave, and you are his next target!<br/>\n<br/>\r\nAs you venture through the eerie halls of the haunted house, you must search for crucial items that unlock the numerous locks guarding your escape routes. Time is of the essence, for you only have 5 days to break free before suffering the same fate as the previous unfortunate soul.<br/>\n<br/>\r\nThis chilling remake offers an array of heart-pounding encounters, as you must stealthily navigate the darkened corridors, evading the relentless pursuit of the vengeful Officer. Can you muster the courage to outwit this malevolent spirit and find a way to freedom, or will you succumb to the nightmarish consequences that lie ahead?<br/>\n<br/>\r\nInteract with various objects scattered throughout the haunted abode, and devise a cunning strategy to elude your paranormal tormentor. But beware, the Officer possesses an uncanny sense of hearing, adding an extra layer of tension to your desperate escape.<br/>\n<br/>\r\nAre you ready to face your darkest fears and confront the wrath of the \"Evil Officer\" in this spine-chilling PC remake? Your survival instincts will be put to the ultimate test as you embark on a harrowing journey filled with horror, suspense, and adrenaline-pumping action. Remember, time is ticking, and the malevolent Officer is on the hunt. Can you break the curse and emerge victorious, or will you become just another tragic chapter in this chilling tale of revenge? The choice is yours.", "metacritic": null, "released": "2023-08-18", "tba": false, "updated": "2023-08-21T03:22:11", "background_image": "https://media.rawg.io/media/screenshots/562/562b07c5b8ca40b3e6156eae6c80ae64.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["aitchGames"], "genres": ["Action", "Adventure", "Strategy", "Casual"], "publishers": ["aitchGames"], "esrb_rating": "Mature"}