{"id": 9652, "slug": "kommissar", "name": "Kommissar", "name_original": "Kommissar", "description": "In Kommissar, you take the rôle of a regime commissar. A perfect designed gear for the machine of peace &amp; wealth utopia. <br/><br/>Your duty and commitment is to lead the Ministry of Truth and to keep the Independent City-State of Roulettenburg united under the regime's iron fist.<br/><br/>Mobilize its agents, neutralize the insurgents in the districts, interrogate the suspects and watch out for your fellow citizens whilst capturing dissidents all for the glory of your fatherland.<br/><br/>FEATURES<br/><ul><li><strong>DISCOVER</strong><br/>a new challenge in each game. The social context of Roulettenburg and its citizens motivations will be different every time you play.<br/></li><li><strong>INVESTIGATE</strong><br/>profound and harsh story arcs that will not let you indifferent. You will be presented to moral dilemmas that will make you question reality as you know it.<br/></li><li><strong>CONFRONT</strong><br/>all possible outcomes of a story which take form through your actions and the alliances and loyalties that your forge.<br/></li><li><strong>INTERROGATE</strong><br/>captured suspects and choose wisely your actions. Judge between either being magnanimous or pushing them to the limit as you bear the consequences.<br/></li><li><strong>EMBODY</strong><br/>the regime and do your duty as a respected member of the party. Go wherever is required and obey the orders.<br/></li><li><strong>MANIPULATE</strong><br/>the events to pursue your own interests. After all, you are the truth and the truth is power.</li></ul>", "metacritic": null, "released": "2017-04-06", "tba": false, "updated": "2019-08-28T22:14:51", "background_image": "https://media.rawg.io/media/screenshots/0a7/0a724886ac018304df8544b487ad6032.jpg", "website": "http://www.beardserkstudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Beardserk"], "genres": ["Adventure", "Strategy", "Simulation", "Indie"], "publishers": ["Beardserk"], "esrb_rating": null}