{"id": 965282, "slug": "block-queencard", "name": "Block Queencard", "name_original": "Block Queencard", "description": "An exciting block elimination game. The challenge of the game is that every once in a while, a row of notched squares will appear at the top of the box. Players need to flexibly select one of the four shapes by clicking the mouse, control the Angle and position of the box through the arrow keys or SAD, and press w after determining the position to fill in the gap of the falling squares above. Filling a row will eliminate the row. When the top box drops to the bottom the game will fail<br/>\r\nOne of the key features of the game is to eliminate blocks one row at a time, and the player will deal damage to the beauty BOSS. Each beauty BOSS has a certain blood bar, when the blood bar is exhausted, the player successfully passes. This adds a layer of strategy to the game, the player needs to quickly eliminate the block at the same time, reasonable choice of block placement, in order to maximize the damage to the BOSS, smooth clearance.<br/>\r\nThe game has multiple levels, each with a different BOSS and difficulty. Players need to constantly challenge, improve their reaction speed and block elimination skills, in order to win in the face of increasingly powerful beauty BOSS.<br/>\r\nThe beautiful BOSS characters, rich and diverse square patterns and smooth game operation bring players a double enjoyment of visual and game experience. The game is compact and easy to operate, suitable for players of all ages. At the same time, after successful clearance, unlock more beautiful BOSS images and wonderful pictures, but also increase the playability and fun of the game.", "metacritic": null, "released": "2023-08-21", "tba": false, "updated": "2023-08-25T02:42:43", "background_image": "https://media.rawg.io/media/screenshots/ba5/ba540013299826c7506f8ace8b9d5ca6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["YS"], "genres": ["Racing", "Casual"], "publishers": ["ys"], "esrb_rating": null}