{"id": 965203, "slug": "yokai-art-survival-prologue", "name": "Yokai Art: Survival Prologue", "name_original": "Yokai Art: Survival Prologue", "description": "<h3>Standalone survival mode from the original game Yokai Art: Night Parade of One Hundred Demons</h3><h3>Story</h3>By accident, you broke the seal of the mysterious book in your household's storage. The mythical book contains enormous magical power that allows users to control any Yokai by defeating them and recording their names. This godly power is too much, which alerts all the Yokai. So they are coming for the power. You must find your way to defeat and survive.<h3>Roguelike Tower Defense</h3>Welcome to an engaging gaming experience! Strategically position units on a chess-based battlefield, defending territories while earning roguelike upgrade-items for leveling up. Discover over 30 unique equipment pieces that modify units, allowing for exciting customization. Each battle offers diverse strategies and experiences, ensuring endless excitement and replayability.<br/><br/><br/><h3>Units and skills</h3>Unleash the power of 15 main and support units, each with unique specialties and diverse roles. From high-dps damage dealers to resilient tanks, healers, buffers, and masters of status effects, assemble a formidable team. <br/><br/><br/><br/><br/>Evolve your units to their final forms and harness their true potential. Utilize power stones to unleash their tailored and devastatingly powerful skills. Prepare to dominate the battlefield with your strategically upgraded and specialized forces.<br/><br/><br/><h3>Boss Challenge</h3>Confront mini-bosses, prove your strategy skills, and face the ultimate challenge: the Skeleton King. Survive until the last minute and emerge victorious in this thrilling adventure.<br/><br/><br/>", "metacritic": null, "released": "2023-08-19", "tba": false, "updated": "2023-09-13T10:34:17", "background_image": "https://media.rawg.io/media/screenshots/7b3/7b3c47ff38547de5cd70a65e523119ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 3, "ratings_count": 1, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Secret Labo"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Secret Labo"], "esrb_rating": null}