{"id": 965202, "slug": "sex-story-cuckold-life-episode-3", "name": "Sex Story - Cuckold Life - Episode 3", "name_original": "Sex Story - Cuckold Life - Episode 3", "description": "A steamy Visual Novel featuring high-definition graphics and realistic-looking characters set in beautiful decor. <br/>The story continues with Nikki going to the gym on a Saturday morning, attempting to seduce her new smoking hot trainer for a quickie, despite her husband’s reluctance. <br/>Will Adam enjoy being a cuckold for his slutty wife again?<br/>Follow the Sex Story and find out!<br/><br/><strong>GAME DESCRIPTION</strong><br/><br/>Meet Nikki &amp; Adam, and embark on their journey of spicing up their marital life in a brand new and wild cuckold Sex Story.<br/><br/><strong>EPISODE 3</strong><br/>It’s Saturday morning, and Nikki wakes up full of energy, looking forward to going to the gym and renewing her subscription to her smoking hot trainer.<br/>His name is Jason. They don’t know each other well, but she’s confident the attraction isn’t one-sided. <br/>Looking forward to seducing the hot trainer into a wild quickie, she takes a shower and goes to change into something sexy when she bumps into her husband in the kitchen. He just returned from his favorite coffee place, and he’s nowhere near happy with her change in routine.<br/> <br/>Will Nikki escape Adam’s jealousy and seduce the hot trainer into giving her what she needs?<br/>Follow their Sex Story and find out!", "metacritic": null, "released": "2023-08-19", "tba": false, "updated": "2023-08-21T03:52:58", "background_image": "https://media.rawg.io/media/screenshots/490/49016b49722cf2cac8e64c563c85bc8a.jpg", "website": "http://www.exosyphen.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 1, "achievements_count": 2, "ratings_count": 0, "suggestions_count": 256, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["EroticGamesClub"], "genres": ["Casual", "Indie"], "publishers": ["EroticGamesClub"], "esrb_rating": null}