{"id": 965213, "slug": "heartless-dreadful-return-by-72-hours", "name": "Heartless & Dreadful: Return by 72 Hours", "name_original": "Heartless & Dreadful: Return by 72 Hours", "description": "In the world of darkness. There is an interesting being.<br/><br/>A being who holds a tournament for the strong. They call him the Master of Darkness.<br/><br/>Why does he hold a tournament? No one knows. Some say it enjoys the sight of young blood being spilled. Some say it is for other, unknown motives.<br/><br/>The Master of Darkness knew that no one would just come forward and spill their blood for him for no reason... so he offered a reward.<br/><br/>A wish. Anything the victorious team could wish for would be granted to each of its members.<br/><br/>Shamir, one of the leading demon lords, and his small team, Dominika and Kair, are on a winning streak, getting closer and closer to their goal... Ever since they heard about the tournament, they've been working hard to get to the top.<br/><br/>Everything was going well... Until a fateful moment...<br/><br/>-----------------------------------------------------------------------------------------<br/><br/>Welcome to Heartless &amp; Dreadful!<br/><br/>Heartless &amp; Dreadful is a character action game, mostly made by one person. It features complex combat systems, light platforming elements, a short story campaign with multiple brutal difficulty options that allow for quite a bit of replayability, and additional unlockable modes and content.<br/><br/><br/><br/><strong>* Play as an edgelord, just like in 2000s.</strong><br/><br/>- There are no good guys in this story. Just pure silly edge. After all, don't you just want to go crazy for once?<br/><br/><strong>* Classic character-action game shenanigans.</strong><br/><br/>- It’s fast, fluid, and flashy, just like in the classics.<br/><br/><strong>* A dark... but light-hearted world.</strong><br/><br/>- The world of this game is dark, but not depressing. It's full of light-hearted moments that doesn't take itself too seriously.<br/><br/><strong>* And at last... the difficulty.</strong><br/><br/>- Yes, this game is hard. But it’s also fair. Once you will learn the depths of it, you'll feel the thrill of the combat that will make you come back for more.<br/><br/>-----------------------------------------------------------------------------------------<br/><br/>Estimated time to complete the entire story on the first playthrough is approximately 3-5 hours. What you see is what you get.<br/><br/>-----------------------------------------------------------------------------------------", "metacritic": null, "released": "2023-08-20", "tba": false, "updated": "2023-08-21T04:10:10", "background_image": "https://media.rawg.io/media/screenshots/46f/46f0de5f8dc135d2eb9d01acb7f6dbd7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 295, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Kirillian"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Kirillian"], "esrb_rating": null}