{"id": 965305, "slug": "dead-end-mission", "name": "DEAD END MISSION", "name_original": "DEAD END MISSION", "description": "The humans fled for their life! Now only aliens remain in the city. The alien queen lays eggs, and the aliens become more numerous and slowly mutate over time. Your name is Mark, a professional marksman. You have one mission, to kill the alien Queen! Your helicopter buddy will provide you with supplies during the mission.<h3>But This Will Not Be Easy...</h3><br/><br/><strong>INTENSE ACTION</strong><br/>Shoot, slash, and blast your way through different types of mutated aliens in this dark post-apocalyptic world. Arm three different sharpshooter weapons and unlock weapon modifications and special upgrades in the arsenal.<br/><br/><br/><br/><strong>MUTANTS</strong><br/>From small crawling creatures to giant spinning spiky meatballs. This game has six unique mutants that will protect their mother at all costs!<br/><br/><br/><br/><br/><strong>TIME</strong><br/>Short but intense main story! <strong>Be aware</strong> that the main story can be completed in 1 hour if you're very good at the game! <br/><br/><strong>This game is designed to be played more than once to get unlocks, find secrets, and challenge yourself! </strong><br/><br/><br/><br/><br/><strong>SETTINGS</strong><br/>Graphics, Window/Fullscreen, and Resolution Settings.<br/>Keybindings menu, Medium or High mouse Sensitivity, and Inverted or Regular Mouse-Look settings. <br/>Music ON/OFF.<br/><br/><strong>DIFFICULTY</strong><br/>This game has no real \"Difficulty Option\", it all depends on how you play it. If you have unlocked stuff it may become easier. If you find secrets it may become easier. If you want to challenge yourself to the maximum to get the <strong>Glorious Crown</strong>, you can! This game does not have an easy mode and is considered <strong>Hard!</strong> You just have to learn the game, give your best, <strong>and not get lost in the DEAD END!</strong>", "metacritic": null, "released": "2023-08-21", "tba": false, "updated": "2023-08-25T03:04:30", "background_image": "https://media.rawg.io/media/screenshots/570/5702251a6dd1ba4f3b1e994d878d625e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RednapGames"], "genres": ["Action", "Adventure"], "publishers": ["RednapGames"], "esrb_rating": null}