{"id": 965369, "slug": "politon", "name": "Politon", "name_original": "Politon", "description": "Politon is a turn-based strategy game with easy-to-understand mechanics and various game modes. Whether you want to defeat your friends online by employing your strategies or enjoy single-player game modes, Politon offers a variety of hex-based maps with different terrains. You'll need to manage your economy while expanding your territories and defend your region against rival invasions. Are you ready to experience the joy of utilizing countless strategies using Politon's simple and profound game mechanics?<h3>Multiplayer</h3><br/>Through the <strong>online</strong> gaming experience, you can engage in battles with your friends or opponents from across the world. By creating your own online game lobby, you can customize turn mechanics and various map types according to your preferences. In the \"Challenge\" mode, you can test yourself against players worldwide who have made it to the leaderboards, competing for rankings and trying your skills against various mechanics.<h3>Single Player</h3><br/>In the <strong>Scenario</strong> mode, you can progress through Politon's story and get to know the world of Politon closely. With a rich pool of characters, you'll have hours of gameplay ahead of you as you witness events unfolding in the kingdom. In the \"Skirmish\" mode, you can practice without entering online battles, developing your new strategies, and getting familiar with different map types.<br/><br/><h3>Gameplay and Mechanics</h3><br/>Politon offers two different turn mechanics: Standard and Arena. The game features 4 unit types, 3 building types, and hex grid maps waiting to be conquered. The unit types are arranged from weakest to strongest: Peasant, Militia, Baron, and Knight. Each hex grid allows placing one unit or building, and each unit has one movement point per turn. To afford the cost of units and their maintenance, you must expand your territory and strengthen your economy by building Farms. You can opt to place Outposts or Watchtowers to form defensive lines. Enhance your economy by collecting resources from the terrain or strategically spreading your influence by waiting for a few turns. The joy of victory lies in achieving the highest score or eliminating all your opponents, depending on the game mode.<br/><br/>We are working hard on Politon, and you can join our Discord channel to stay updated about the latest updates!<br/><br/>", "metacritic": null, "released": "2023-08-23", "tba": false, "updated": "2023-08-25T04:23:15", "background_image": "https://media.rawg.io/media/screenshots/47e/47ecca6ec3f61389776d9f886285cec8.jpg", "website": "https://politon.online/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 292, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Pinq Games"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Pinq Games"], "esrb_rating": null}