{"id": 965341, "slug": "competitive-checkers", "name": "Competitive Checkers", "name_original": "Competitive Checkers", "description": "Competitive Checkers - Multiplayer Strategy Game<br/>\n<br/>\r\nAre you ready for an exhilarating test of strategy and skill? Dive into the world of \"Competitive Checkers,\" the ultimate multiplayer experience for Checkers enthusiasts!<br/>\n<br/>\r\nFeatures:<br/>\n<br/>\r\nMultiplayer Showdown: Engage in thrilling head-to-head matches with players from all over the globe. Prove your Checkers prowess and outmaneuver your opponents to claim victory.<br/>\n<br/>\r\nStrategic Gameplay: Sharpen your mind as you plan and execute each move. Carefully analyze the board, anticipate your opponent's actions, and seize the advantage.<br/>\n<br/>\r\nReal-Time Matches: Experience the excitement of live gameplay with real-time multiplayer action. Stay on your toes and react quickly to each strategic twist and turn.<br/>\n<br/>\r\nChat with Opponents: Stay connected with your rivals through in-game chat. Exchange playful banter, congratulate each other on well-executed moves.<br/>\n<br/>\r\nHow to Play:<br/>\n<br/>\r\nCompetitive Checkers follows the classic rules of the beloved board game. Start with a grid of alternating dark and light squares, and each player has a set of twelve checkers. Move your pieces diagonally forward, capturing your opponent's checkers by jumping over them. Reach the opposite end of the board, and your piece will be \"crowned,\" gaining the ability to move both forward and backward. Outsmart your adversary, strategize your moves, and aim to capture all their checkers.<br/>\n<br/>\r\nJoin the Checkers Community:<br/>\n<br/>\r\nAre you new to Checkers or a seasoned player looking for a fresh challenge? The Competitive Checkers community welcomes players of all levels. Engage with fellow Checkers enthusiasts, share your experiences, and learn new tactics to enhance your gameplay.<br/>\n<br/>\r\nDownload now and claim your spot in the world of Competitive Checkers! Challenge, conquer, and become a true Checkers master!", "metacritic": null, "released": "2023-08-22", "tba": false, "updated": "2023-08-25T03:46:21", "background_image": "https://media.rawg.io/media/screenshots/569/5694d3ee3f835fece8b986353bb6cb1d.jpg", "website": "https://www.lockgamedevelopment.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Smelly Jamie"], "genres": ["RPG", "Strategy", "Simulation", "Indie"], "publishers": ["Smelly Jamie"], "esrb_rating": null}