{"id": 965327, "slug": "rev-to-vertex", "name": "Rev to Vertex", "name_original": "Rev to Vertex", "description": "“Rev to Vertex” (R2V) Early Access is developing by “Plutonization,” a small development team led by virtual-to-reality Macau Grand Prix racers in Hong Kong. R2V is a new racing game platform set in the unexplored hills and streets of Hong Kong. <br/>\n<br/>\r\nR2V, unlike any rally or racing circuit competition, the champion doesn't win by crossing a finish line. Instead, competitors engage in their hometown public roads, highway and touge battle rivalling street racers on the fly. Speed through hill climbs and street tags. Distance yourself until your tail light vanishes from your opponent to claim victory. R2V’s vast collection of cars and the ability for players to fully set-up, modify and customize their vehicles. You will always ride with style and finesse. <br/>\n<br/>\r\nThe game brings reality into your monitors by taking geospatial data of the road as the most accurate reference, tracing every spec of reality and creating the racing tracks simulating our world. The game explores to give racing fans fresh and exciting tracks. R2V’s maps are currently set in Hong Kong at release and expand across the ocean on future updates. The Augest Early Access version will allow players to access Route Twisk and Tolo Harbour in different type of training mission modes, unlock more layouts and cars in Sector Tutorial will allow you to freely choose your combinations of tracks and cars in Free Play Mode.", "metacritic": null, "released": "2023-08-22", "tba": false, "updated": "2023-08-25T03:28:51", "background_image": "https://media.rawg.io/media/screenshots/2a7/2a7e0e2bdd19745424f866edbfac9886.jpg", "website": "https://www.rev2vertex.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PLUTONIZATION"], "genres": ["RPG", "Simulation", "Sports", "Racing"], "publishers": ["Z-Challenger"], "esrb_rating": null}