{"id": 965377, "slug": "we-need-to-cook-drug-empire-simulator", "name": "We Need To Cook - Drug Empire Simulator", "name_original": "We Need To Cook - Drug Empire Simulator", "description": "We need to cook!<br/>\r\nYou are a drug-designing genius, living a bland existence in a middle-class neighborhood in Utah.<br/>\r\nYou decide you want more out of life, so you buy a beat-up RV, drive it into the desert, and cook up drugs.<br/>\n<br/>\r\nYou find a reliable drug distributor to sell your product, make enormous profits, and upgrade from your humble RV cook, to a Megalab in the city.<br/>\n<br/>\r\nBut you must be careful... Your money has to be laundered safely before you can spend it. The Government can't know of your illicit dealings.<br/>\r\nUntil then, store your millions on a pallet in the basement.<br/>\n<br/>\r\nSlowly grow your business until you own the largest drug empire in the state!<br/>\n<br/>\r\nGame Features:<br/>\r\n   Scientifically-Accurate (somewhat) Drug Cooking Mechanics. Complete all the real-life steps of cooking meth!<br/>\r\n   Operate a realistic money-laundering Business; selling fake digital art to YOURSELF.<br/>\r\n   Earn Immense Profits, and upgrade from your humble RV to a MEGALAB in the city, and buy a Penthouse to store your money in.<br/>\r\n   Become the ultimate Drug Kingpin<br/>\n<br/>\n<br/>\r\nThis game was developed by 1 person (me) as a resume-building game to show employers my skills. <br/>\r\nI look forward to the community I hope this game will create!", "metacritic": null, "released": "2023-08-23", "tba": false, "updated": "2023-08-25T04:33:58", "background_image": "https://media.rawg.io/media/screenshots/5d6/5d606825b33b36d499b21ac8149c3bb0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Anark Studios", "Crowbar Games"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Indie"], "publishers": ["Anark Studios", "Crowbar Games"], "esrb_rating": null}