{"id": 965324, "slug": "pin-crasher-2", "name": "PIN CRASHER", "name_original": "PIN CRASHER", "description": "Pin Crasher is an exciting and unique casual game that combines the classic sport of bowling with the fast paced action of endless runners.<br/><br/>Control your bowling ball as it rolls down an endlessly generating bowling alley, filled with a variety of challenging obstacles to dodge. From simple bumpers to giant spinning hammers, you'll need quick reflexes and precise maneuvering to survive and achieve the highest scores.<br/><br/><br/><br/>Engage in a thrilling highscore hunt as you aim for the best possible score while the gameplay steadily becomes faster and more intense. Challenge yourself and compete with friends as you share your impressive scores on social media.<br/><br/>Pin Crasher offers a wide range of customization options. Unlock an array of vibrant skins for your bowling ball, pins, floor, and even music to create a unique environment that matches your style.<br/><br/><br/><br/>Race against the clock in the \"Time Chase\" mode, as you knock down pins and score strikes to gain additional time.<br/>If you prefer a more relaxed experience, the \"Zen\" mode offers the same intense gameplay but without any time pressure. Take a break from the daily grind and indulge in a simple, yet challenging, bowling experience that lets you unwind and rejuvenate.<br/><br/>Pin Crasher offers a refreshing break from your everyday routine. Immerse yourself in this endless bowling adventure, master the art of dodging obstacles, and strive for the highest scores!<br/><br/>", "metacritic": null, "released": "2023-08-22", "tba": false, "updated": "2023-08-25T03:25:29", "background_image": "https://media.rawg.io/media/screenshots/894/894a22cfc0b4304cf18b73923bf3b360.jpg", "website": "https://www.fullsteamstudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["byXToGo", "FULL STEAM STUDIOS"], "genres": ["Sports", "Casual", "Indie"], "publishers": ["FULL STEAM STUDIOS"], "esrb_rating": null}