{"id": 965378, "slug": "nian-shang-ozi-sanwodu-rizhan-meshitai-possessing-", "name": "年上お姉さんを独り占めしたい！ - Possessing My Older Sister", "name_original": "年上お姉さんを独り占めしたい！ - Possessing My Older Sister", "description": "\"Posessing My Older Sister - 年上お姉さんを独り占めしたい！ -\" is a novel game in which one man's jealousy causes him to mistake his perversions for love.<br/>\r\nA Bishojo Game released in 2017 under the \"Peony\" brand has been reworked for the \"PandaShojo\" platform for players of various ages worldwide to enjoy.<br/>\n<br/>\n<br/>\r\n◆Introduction<br/>\r\nI need an older woman...someone close to my late mother's age would do...<br/>\r\nIt's the only way I can alleviate this sense of loneliness.<br/>\r\nBut it won't be easy to satiate this yearning.<br/>\r\nThere can't be any room for anybody but me...<br/>\n<br/>\n<br/>\r\n◆Synopsis<br/>\r\nThe protagonist, Satoru, lost his parents in an unfortunate accident when he was very young.<br/>\r\nOne hot summer day, he almost passes out and collapses.<br/>\r\nFortunately, he is nursed back to health by Aika, a married woman living in the area.<br/>\r\nIt was a memorable event to Satoru, who had never experienced such tenderness.<br/>\n<br/>\r\nAfter his encounter with Aika, Satoru begins to obsess over older women.<br/>\r\nHe seeks out the company of women such as the recent divorcee, Kazumi, as well as Sakura, a single mother he met at the local park.<br/>\r\nBut their attention isn't enough for him, he wants more.<br/>\r\nAnd to get it, he won't shy away from blackmail and threats of violence.<br/>\n<br/>\n<br/>\r\n◆Characters<br/>\r\n・Aika Ichikawa<br/>\r\n\"Are you alright......? You don't look so well.\"<br/>\r\nA housewife possessed of style, beauty, and kindness.<br/>\r\nSatoru begins to stalk her obsessively after she tries to help him.<br/>\r\nShe bears the trauma of losing her child and the thought of having another terrifies her.<br/>\n<br/>\r\n・Kazumi Yamazaki<br/>\r\n\"So, you finally recognize my charms.\"<br/>\r\nA recently divorced working woman with an outgoing personality.<br/>\r\nShe lives in the same building as Satoru and they often see each other.<br/>\r\nAs she was a victim of domestic violence, she tends to react poorly to threats of violence.<br/>\n<br/>\r\n・Sakura Hijikata<br/>\r\n\"Something about you reminds me of my child......\"<br/>\r\nA single mother with a cheery personality.<br/>\r\nShe tries to look after Satoru, seeing something similar to him in her own child.<br/>\r\nThis leads to her becoming a target of Satoru's twisted affections.<br/>\n<br/>\r\n・Satoru Murakami<br/>\r\nHaving lost his parents at a young age, Satoru has lived a life of solitude.<br/>\r\nWithout a strong parental figure to guide him, he lacks the ability to control his emotions and is quick to envy.<br/>\r\nAs he has spent much of his life being avoided by others, he overreacts to even the smallest of kindnesses, mistaking them for love.", "metacritic": null, "released": "2023-08-23", "tba": false, "updated": "2023-08-25T04:35:29", "background_image": "https://media.rawg.io/media/screenshots/703/7031ab017906a63e7574a88b6741ca68.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CyberStep", "Rideon Works Co. Ltd,"], "genres": ["Adventure", "Simulation", "Casual"], "publishers": ["CyberStep"], "esrb_rating": null}