{"id": 965313, "slug": "dominoo", "name": "DomiNOo", "name_original": "DomiNOo", "description": "Welcome to the world of creativity and limitless possibilities in our immersive sandbox game! Here, you can let your imagination run wild and explore endless opportunities to have fun and entertain yourself. The game is designed to provide you with a platform where you can create, experiment, and play at your own pace.<br/>\n<br/>\r\nOne of the main features of our game is the ability to place dominos and knock them over. Whether you want to build a complex domino maze or simply set up a row of them to knock down, the choice is yours. You can experiment with different layouts, colors, and shapes to create the perfect domino effect that you've always dreamed of.<br/>\n<br/>\r\nBut that's not all - many other toys and accessories are available to make your gaming experience even more exciting. There are numerous items that you can use to create your own adventures and challenges. You can build towers, castles, or any structure that comes to your mind, You can also use the physics of the game to launch objects through the air or create complex Rube Goldberg machines.<br/>\n<br/>\r\nThe game environment is completely open-ended, allowing you to let your creativity take over. You can customize your surroundings, add objects, and create your own challenges. The game also has a multiplayer mode, where you can collaborate with other players and work together to build structures or complete challenges. You can even use the built-in screen recording and sharing features to share your creations with friends and family.<br/>\n<br/>\r\nIn summary, our immersive sandbox game provides an exciting and engaging platform to unleash your imagination and creativity. With endless possibilities and numerous tools at your disposal, you can spend countless hours exploring and creating the world of your dreams.", "metacritic": null, "released": "2023-08-21", "tba": false, "updated": "2023-08-25T03:13:50", "background_image": "https://media.rawg.io/media/screenshots/7eb/7eb0597d276794eb23d6e2fa48223319.jpg", "website": "https://bright-developers.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Elijah Anadon"], "genres": ["Strategy", "Simulation", "Casual"], "publishers": ["Elijah Anadon"], "esrb_rating": null}