{"id": 965399, "slug": "edge-of-war", "name": "Edge of War", "name_original": "Edge of War", "description": "Edge of War delivers an isometric CRPG experience where your choices carve a unique path through the Northlands inspired by laplands and Finnish Folklore. Engage in intricate grid-based combat, leveraging a deeply interactive environment to outmaneuver foes.<br/><br/>In this world, every quest holds weight and significance, directly influencing your journey and the others around you. With semi-procedural world creation and emergent storytelling, each playthrough offers a distinct narrative and plenty of variety.<br/><br/>Venture forth, but remember: mastering the environment is as crucial as mastering the blade.<br/><br/><br/><strong><h3>Engage in Tough &amp; Tactical Combat</h3></strong><br/>Trials and tribulations await those who seek redemption in the Northlands. Assemble your squad and scout the wilds beyond Fort Turso. This tough turn-based CRPG will pit you against the dangers and the darkness that inhabit the North. Test your wit, wiles and will in a world inspired by Finnish Folklore and the Kalevala!<br/><br/><strong><h3>A New Story Every Playthrough</h3></strong><br/>Procedurally-deployed hand-crafted quests along with reactive environments lead to a level emergent gameplay unlike any other, and ensures every playthrough is different. Your decisions affect the fate of the Northlands. Choose your squad, choose your skills, choose your allies.<br/><br/>Make friends or enemies of the locals. Delve in dungeons and discover ancient artefacts. Fight tooth, nail and claw against the mighty beast of the wilds. Commune with the spirits and abide by their ways when traversing their realms. Or tackle indomitable constructs and collect their weird technology. <br/><br/>Each element is taken into account and will shape not just your characters but the Northlands. The smallest decision can rally a faction to come to your aid, or seek your destruction. So be careful where you swing that blade, toss that fireball, or lay a kind word. How you live will determine how you die in Edge of War.<br/><br/><strong><h3>Explore Finnish Folklore </h3></strong><br/>Your squad is tasked with exploring a region that has seen the corruption of a Compelled God, bears the scars of a warlord, and is marked by histories and peoples long forgotten. And yet, somehow people still eek out an existence amidst all these dangers. The Free Folk and the Barbarian Tribes call it home, as do the many spirits - all of them just waiting for a reason to kill you.<br/><br/>Vaeki infuses every stone, every tree, every stream. It gives rise to life, it is present in death, and it is a gift of the gods. Ukko reigns above, Tuoni below. Their brethren are scattered. Yet all ignore you and your prayers. Such is the way of the North. <br/><br/>Fort Turso is your home, your hub for adventures. From here you can journey to the borders of Pohjola or seek the river to Tuonela. Perhaps you will follow in the footsteps of Tapio or heap praise and prayers upon a shrine to Vetehain. Wherever you go Hiisi and other horrors are never far away.", "metacritic": null, "released": "2023-08-24", "tba": false, "updated": "2023-08-25T05:05:20", "background_image": "https://media.rawg.io/media/screenshots/b34/b34fd6f8876da2c635265c40ceb8d24b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 519, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Action Squad Studios"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": ["Action Squad Studios"], "esrb_rating": null}