{"id": 965323, "slug": "ghostpia-season-one", "name": "ghostpia Season One", "name_original": "ghostpia Season One", "description": "<h3>What is ghostpia?</h3> <br/><br/><strong>\"Cruel cuteness and melancholy violence<br/>A movie you can read on PC\"</strong><br/><br/>\"Denshi\" - The digital graphic novel artstyle.<br/>ghostpia's visuals mix warm, delicate art that would be fit for an illustrated children's book with glitch and noise effects, for a strangely nostalgic visual novel vibe.<br/>\"Denshi\" is Japanese for \"electrical\" or \"digital\", and this is what a denshi graphic novel is.<br/> <h3>All story, no fluff</h3><br/>There are no quick time events, no branching scenarios. We've put all of our efforts into making the best possible story we could, so that you could enjoy it like you would a good movie.<br/><br/> <h3>Story</h3><br/>Isolated from the world by snow, a town lies barren near a terminal station.<br/>There lies a town where ghosts flood the streets at night.<br/>But they aren't really ghosts. They are immortal. Unable to die, with their neverending lives, they took to referring to themselves like that.<br/>They say this is an ideal town. A true utopia for ghosts.<br/>\"But is it really? Can you really call this place a utopia?\"<br/>This is Sayako, and that is her plight.<br/>For you see, Sayako is the only one in town who doesn't truly belong there.<br/>All the while she is sharing a room with the mysterious new face, Yoru.<br/>More than anything in the world, Sayako longs to return to her hometown.<br/>To set off beyond the unfathomable vast desert of snow, beyond where nobody has ever gone.<br/>To the home she can only dream is out there.<br/>To be able to remember what she has forgotten: the thing she holds the most dear.<br/>That is her dream.<br/><br/>“In my dreams, I can get out. In my dreams, I can fit in.”", "metacritic": null, "released": "2023-08-22", "tba": false, "updated": "2023-08-25T03:24:16", "background_image": "https://media.rawg.io/media/screenshots/fb6/fb6f8033960b2e2b5e61308fbc252516.jpg", "website": "https://ghostpia.xyz/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Chosuido", "超水道"], "genres": ["Adventure"], "publishers": ["room6", "yokaze"], "esrb_rating": null}