{"id": 965494, "slug": "kingdom-incremental", "name": "Kingdom Incremental", "name_original": "Kingdom Incremental", "description": "Kingdom Incremental is a light-hearted city builder where cash is king. Starting from nothing, you build your civilization from the ground up and expand out into the vast unknown. Every penny you earn can be used to build new buildings, improve existing ones, or upgrade production chains. It's up to you to create a balanced economy where the profits flow right back into your pockets! After your city's growth stagnates, you can burn everything to the ground for powerful bonuses that multiply your profits in your next kingdom!<br/><br/><h3>Build and upgrade your kingdom!</h3>Each building increases your worker capacity and resource storage. Invest in upgrades to increase profits or improve the buildings to cram more peasants in.<br/><br/><br/><br/><h3>Balance your economy</h3>Each building type produces unique resources. In order to produce complex resources, you need to balance the production of base components. Optimize profits while not starving your citizens, or just let them starve... they can probably find some cake to eat.<br/><br/><br/><br/><h3>Expand out into the great unknown</h3>Who knows what kind of mysteries lie beyond your kingdom's borders. Expand out to transform your humble little hovel into a bustling metropolis! Maybe even uncover some hidden treasures that can be used to upgrade your production chains or warp through time. <br/><br/><br/><br/><h3>Defend your kingdom!</h3>Dragons have the potential to burn your kingdom to ash, but offer powerful rewards for an active playstyle. if you can manage to slay them of course. <br/><br/><br/><br/><h3>Gain prestige for even greater rewards!</h3>Eventually, you will have to make hard decisions about whether to invest exorbitant sums of money in price-gouged real estate or invest exorbitant sums of money in price-gouged upgrades. If that becomes too rich for your blood you can abdicate the thrown to gain powerful bonuses in a new land.<br/><br/><br/><br/><br/>So, are you ready to start building?<h3>FEATURES</h3><ul><li>100+ Upgrades<br/></li><li>100 Achievements<br/></li><li>Auto-Save<br/></li><li>Unlimited Offline Production<br/></li><li>Unlockable Auto-Clicker<br/></li><li>Unlockable Fast-Forward<br/></li><li>Satirical Storyline<br/></li><li>Dragons. Like too many dragons.<br/></li><li>Random Events (Maybe you'll meet a goose! How exciting!)<br/></li><li>An army of peasants to perform dumb tasks for their entire meaningless lives!<br/></li><li>Bigger numbers! (Wow, how original!)<br/></li><li>1 Developer (Oh hey, that's me!)<br/></li><li>NO MICROTRANSACTIONS! (What's that smell? Is it the refreshing lack of corporate greed?)</li></ul>*Zero peasants were harmed in the creation of this kingdom. Okay well maybe a few depending on your definition of \"harm\" and \"zero\"", "metacritic": null, "released": "2023-08-24", "tba": false, "updated": "2023-08-28T02:41:08", "background_image": "https://media.rawg.io/media/screenshots/2ac/2ac8169e22ba91fbbfa758736176154e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Royal Goose Studios"], "genres": ["Simulation"], "publishers": ["Royal Goose Studios"], "esrb_rating": null}