{"id": 965404, "slug": "one-life-clicker", "name": "One Life Clicker", "name_original": "One Life Clicker", "description": "<strong>One Life Clicker</strong> is a unique combination of idle, clicker and RPG games. Take a hero under your control and fight through the hordes of enemies! Your only goals are to survive and defeat the evil. Buy various upgrades and use complex prestige system to accomplish your mission!<br/><br/>А hardcore mode is available for the most experiences players. You will have only one life to complete the game. If you fail all your progress will be lost forever!<h3>ONE LIFE</h3>Select the hardcore difficulty and get a real challenge. But if you die all your progress will be lost permanently!<h3>GAMEPLAY</h3>Addictive idle clicker gameplay with comlex upgrades and prestige systems. Besides, the game can be completed!<h3>UPGRADES</h3>Various upgrades are available to power up your character. Improve your stats to hold back waves of enemies!<h3>PRESTIGE</h3>Buy extra upgrades to significantly improve your power. Exchange your current game progress for super bonuses!<h3>GRAPHICS AND MUSIC</h3>Cute pixel graphics with simple UI and calm ambient music for your pleasure<h3>ACHIEVEMENTS AND RANKING</h3>Collect al Steam achievements and conquer the global ranking system!<br/><br/><br/><strong>One Life Clicker</strong> contains an experience you have never tried before. Select a hardcore mode or play for your pleasure on any other difficulty, but be sure that you will be satisfied.", "metacritic": null, "released": "2023-08-24", "tba": false, "updated": "2023-08-25T05:10:45", "background_image": "https://media.rawg.io/media/screenshots/573/573692337a3ab8a98068375018cd83f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pixel Fox"], "genres": ["RPG", "Simulation", "Indie"], "publishers": ["Pixel Fox"], "esrb_rating": null}