{"id": 965475, "slug": "digitanks-2", "name": "Digitanks!", "name_original": "Digitanks!", "description": "We know you stay up at night wishing you could build electronic tank fleets and lob digital artillery shells at your hapless victims. We know you trod through the day dreaming of crushing your enemy under your merciless hover-treads. We’re not sure how being crushed under a hover-tread would work, but what you may not know is that your computer dreams of the same things. Fortunately, we’re here to help.<br/>\n<br/>\r\nDigitanks brings classic artillery-style gameplay to 3D, and transforms the concept with strategy elements. Traditional artillery games locked players into a 2D environment, but Digitanks kicks it up a notch by opening the game up with resources, base-building, and turn-based strategy, all in three dimensions. You command a fleet of digital tanks and work to conquer your foes. Expanding your base, defending your supply lines, and controlling Electronodes - the source of power - allows you to build ever increasing fleets of battle tanks.<br/>\n<br/>\r\nDigitanks raises the bar for artillery games. Tanks are no longer automatons firing blindly in a desperate attempt to kill the enemy before he kills you. In Digitanks, you must manage your resources intelligently and effectively if you expect to succeed. Four specialized units each have distinct advantages and drawbacks. Will you allocate your resources to constructing an artillery battery, at the risk of allowing your enemy time to build his defenses? If you advance to capture more resources, will you leave your supply lines undefended? Will you focus on increasing production capacity or will you construct your fleet and go for an early victory? Artillery games used to be about having sharp aim, now they’re about having sharp brains.", "metacritic": null, "released": "2023-08-26", "tba": false, "updated": "2023-08-28T02:12:24", "background_image": "https://media.rawg.io/media/screenshots/ad7/ad75aa7dcdb4078cad15d8c106c90b49.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lunar Workshop"], "genres": ["Strategy", "Indie"], "publishers": ["Lunar Workshop"], "esrb_rating": null}