{"id": 965476, "slug": "poached-hunt-the-hunter", "name": "Poached: Hunt The Hunter", "name_original": "Poached: Hunt The Hunter", "description": "In the vast wilderness of South Africa's Northern Province, a battle is raging between the ruthless poachers who seek to exploit the region's natural resources, and the dedicated game rangers who are determined to protect the animals and preserve the beauty of the land. \"Poached: Hunt The Hunter\" puts you in the shoes of a game ranger, tasked with defending the nature reserve from the poachers who seek to destroy it.<br/>\n<br/>\r\nHere you must fight to survive. It’s man versus beast versus man versus man. And if you’re no stranger to danger, come play as a ranger fighting off armies of ruthless poachers with nothing but your wits, harsh language, braai tongs and an arsenal of weapons that would make any arms dealer green with envy. You wake up in your camp, make breakfast, get your orders and shoot poachers on sight using high powered automatic weapons. Simple. Or you skip breakfast, that’s up to you. Or you chase chickens around for half an hour, grow hallucinogenic plants in the shed, spend the day barbequing goat chops to perfection, race ostriches or rescue lost rangers stuck in trees, I’m not going to tell you how to live your life. You play it your way. This is the POACHED experience.<br/>\n<br/>\r\nFeatures:<br/>\r\n- Fight hilarious enemies<br/>\r\n- An open map with day/night cycle &amp; weather<br/>\r\n- Approach missions in any direction you choose<br/>\r\n- Old-school FPS gameplay<br/>\r\n- Crafting, Looting, Merchant &amp; other RPG Elements<br/>\r\n- English, Afrikaans, Sepedi &amp; Zulu voice acting cast<br/>\r\n- Driving mechanics - own your own 2Litre Bakkie!!!<br/>\r\n- Many powerups and secrets to find<br/>\r\n- Grow your own powerups and other special herbs<br/>\r\n- Hunt for food and make braais, craft and camp<br/>\r\n- 14 weapons to discover and use<br/>\r\n- Easy Inventory &amp; Crafting menus<br/>\r\n- Hub based mission gameplay<br/>\r\n- 12 Action-Packed levels + cinematics and lore<br/>\r\n- Challenging to play - Easy to master<br/>\r\n- Side quests and bonus missions to complete<br/>\r\n- Ostrich racing, golf and other activities to explore<br/>\r\n- Realistic South African weapon types<br/>\r\n- Hours of virtual S.A. radio stations to listen to while driving<br/>\r\n- Interactive realtime virtual braai mechanics<br/>\r\n- Camping, drinking moerkoffie and eating bokvleis <br/>\r\n- Many Steam Achievements<br/>\r\n- Procedural bosveld generation options<br/>\r\n- Armor types such as bulletproof vests and stealth camoflage<br/>\r\n- An optional shooting range for practicing and trying out new gear.<br/>\n<br/>\r\nA game by Ingozi Games South Africa, a one man development studio backed by a talented team of voice actors and musicians.<br/>\r\nVoice &amp; Casting by Asylum Studios<br/>\r\nOriginal Soundtrack by Senkhane Montsitsi<br/>\n<br/>\r\nThe game has currently been in development for approximately 3 Years, and will be releasing into Early Access for a dollar-store price.<br/>\r\nThe Early Access process will last another 3 years to ensure maximum compatibility with all systems and best possible experience. <br/>\n<br/>\r\nThe price will remain low and fair as agreed by the community at all times of the development phase and full transparency is always ensured. The games development is fully self funded and I encourage players to rather not buy the game until it's out of early access unless they want to be involved in the development process and instead download the free demo while waiting for the finished game! The demo itself will be regularly updated as the main game branch is updated for free forever.<br/>\n<br/>\r\nThe game already currently has a great community behind it with over 100+ Private Beta testers that have helped steer development since the projects inception in 2020. Please feel free to join in on the discussions on our Steam Forums and make sure to play the Free Demo now!!!", "metacritic": null, "released": "2023-08-26", "tba": false, "updated": "2023-08-28T02:15:14", "background_image": "https://media.rawg.io/media/screenshots/127/12783fdcfa9b85e0d22ec4e50df28651.jpg", "website": "http://ingozigames.co.za", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 522, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ingozi Games"], "genres": ["Action", "Adventure"], "publishers": ["Ingozi Games"], "esrb_rating": null}