{"id": 965538, "slug": "commander-keen-keen-dreams-definitive-edition", "name": "Commander Keen: Keen Dreams Definitive Edition", "name_original": "Commander Keen: Keen Dreams Definitive Edition", "description": "Get ready to embark on an exciting nostalgia trip with the modernized release of Commander Keen Dreams Definitive Edition! This beloved sidescroller has been meticulously enhanced to provide a captivating gameplay experience while preserving its original charm. Let's dive into the detailed user gameplay experience and feature set:<br/>Visual Enhancement and Widescreen Support: Commander Keen Dreams Definitive Edition has undergone a visual overhaul, embracing modern graphics while staying true to its retro roots. The introduction of full widescreen support ensures that players can fully immerse themselves in the vibrant and expanded game world.<br/><br/>Twelve All-New Levels: Prepare to explore a plethora of new environments and challenges with the addition of twelve brand-new levels. This doubling of content length compared to the original release guarantees hours of engaging gameplay, each level offering unique puzzles, enemies, and secrets to uncover.<br/><br/>Reimagined Music Score: Accompanying your adventures is a meticulously crafted full music score that dynamically evolves as you progress through the game. The reimagined soundtrack captures the essence of the original while delivering a fresh and captivating auditory experience.<br/><br/>Reworked Game Structure: The game structure has been thoughtfully reworked to provide a more modernized experience without sacrificing any of the original appeal. Enjoy a seamless blend of nostalgic elements and modern game design, ensuring that both veteran players and newcomers can appreciate the adventure.<br/><br/>Controller Compatibility: To enhance your gameplay experience, Commander Keen Dreams Definitive Edition offers full compatibility with controllers, including the highly anticipated SteamDeck. The following controller buttons are utilized:<br/><br/><ul><li>Left Control Stick: Move Keen, allowing you to navigate the colorful landscapes and explore every nook and cranny.<br/></li><li>B Button: Execute precise jumps and drop down from platforms that aren't solid from below when the Control Stick is pressed downward.<br/></li><li>Y Button: Engage the run feature to increase Keen's speed, enabling you to swiftly traverse levels and overcome challenges.<br/></li><li>ZR Button: Strategically use the seed-throwing ability to stun enemies. For versatility, you can throw seeds upward by keeping the up direction pressed on the Control Stick.<br/></li><li>Plus Button: Easily pause the game to take a breather, strategize, or simply admire the beautifully reimagined world around you.</li></ul>Get ready to relive the magic of Commander Keen Dreams like never before. With enhanced visuals, additional levels, a reimagined music score, and seamless controller support, Commander Keen Dreams Definitive Edition promises an unforgettable gaming experience that merges the best of both the past and the present. Embark on this nostalgic journey and embrace the exciting adventures that await!", "metacritic": null, "released": "2023-08-25", "tba": false, "updated": "2023-08-28T03:54:51", "background_image": "https://media.rawg.io/media/screenshots/6ba/6ba37a8e2ca2b804d798974e1e603fb9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Keen Dreams"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Strategy First"], "esrb_rating": null}