{"id": 965545, "slug": "carrot-the-cat", "name": "Carrot The Cat", "name_original": "Carrot The Cat", "description": "<strong>Welcome to the Whimsical World of \"Carrot The Cat\"!</strong><br/><br/>Embark on a purrfectly delightful adventure with our charming new platformer, \"Carrot The Cat\"! Dive into a world where cat-titude meets cartoony fun, and join our feline hero, Carrot, on an epic journey through vibrant landscapes and quirky challenges.<br/><br/><strong>Key Features:</strong><br/><br/><strong>🐾 Playful Platforming:</strong> Leap, dash, and climb your way through imaginative levels filled with cunning obstacles and surprising twists. Carrot's nimble moves will keep you engaged and entertained for hours on end!<br/><br/><strong>🥕 Carrot-powered Abilities:</strong> Unleash Carrot's unique abilities, from soaring through the air with graceful jumps to using a range of amusing power-ups. Can you master her moves and conquer each level's delightful dilemmas?<br/><br/><strong>🌟 Stylized Visuals:</strong> Immerse yourself in a world bursting with color and charm! Our cartoony and stylized graphics will transport you to a whimsical realm where every corner is a feast for the eyes.<br/><br/><strong>🎵 Enchanting Soundtrack:</strong> Let the enchanting music sweep you off your paws as you traverse through diverse environments, from lush forests to quirky contraption-filled factories.<br/><br/><strong>🌈 Epic Boss Battles:</strong> Prepare for epic showdowns with quirky bosses that will test your skills and strategic thinking. Can you outsmart these eccentric adversaries and emerge victorious?<br/><br/><strong>🎮 Accessible for All Ages</strong>: \"Carrot The Cat\" is designed to be enjoyed by players of all ages and skill levels. Whether you're a seasoned gamer or new to the platforming genre, you'll find endless enjoyment in Carrot's world.<br/><br/><strong>Join the Adventure:</strong><br/><br/>Get ready to embark on a tail-swishing, high-jumping, carrot-munching adventure like no other! \"Carrot The Cat\" invites you to explore its fantastical realms, uncover hidden secrets, and experience the joy of a classic platformer revitalized with modern flair.<br/><br/><strong>Pounce into the Fun:</strong><br/><br/>Are you ready to immerse yourself in a world of cartoony wonders and whimsical challenges? Add \"Carrot The Cat\" to your gaming collection and let the delightful escapades begin. Get ready to purr, pounce, and play your way to victory!<br/><br/>Remember to follow us on social media for the latest updates, sneak peeks, and behind-the-scenes antics of Carrot and her pals.<br/><br/>🐱🥕 <strong>Carrot The Cat: Where Adventure Meets Whisker-twitching Fun!</strong> 🥕🐱<br/><br/>Credits: Cheesy HFJ for the soundtrack, xdbear666 for the Carrot artwork, Dev Enabled for the movement system and base model,<br/>Cyberenetic Ant Studios for the platformer engine and mayonezzzz for the cat head model!<br/>Special thanks to AleksandrIvanov for the main map!", "metacritic": null, "released": "2023-08-25", "tba": false, "updated": "2023-08-28T04:05:50", "background_image": "https://media.rawg.io/media/screenshots/414/4142c674b62814addc044ce2f1931781.jpg", "website": "https://sparklingpishy.online", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 348, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SparklingPishy"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["SparklingPishy"], "esrb_rating": null}