{"id": 965558, "slug": "tavernacle", "name": "Tavernacle!", "name_original": "Tavernacle!", "description": "A shadow has fallen across Upper-Left-Earth and threatens the realm of Dwarves. Monsters gather on the horizon, ready to plunge the world into an era of sobriety. Ensure the dark hordes are driven back and the brewery keeps pumping out the lifeblood of the Dwarven people. So, grab a hammer, fill up that mug, and get crafting to protect the beer.<br/><br/><br/><br/><br/><br/>Dwarves do not watch the fight from above. They're too short and besides, how would you get a beer up to the heavens anyway? No, you’re needed on the front lines! Hunt down resources across the map, dodge enemy attacks, and build up a robust defense just in time to turn the hordes back. Punt rocks, wood, iron and many more materials.<br/><br/><br/><br/><br/><br/><ul><li> This here tavern is a frenetic cooperative spectacle, emphasis on cooperative, okay lads? Dwarves have murky moods, but overcome them to defend the foundations of Dwarven culture (beer).<br/></li><li> Work together in teams of up to four Dwarves, either online or in local split-screen (perfect with beer), and get to work!<br/></li><li> There's stone to be mined, trees to be cleared, iron to be smelted, and of course, hordes of monsters to introduce to the wonders of Dwarven ingenuity (not beer).</li></ul><br/><br/><br/><br/><br/><ul><li> Just as beer doesn't just pop into existence (much to Dwarven disappointment), the waves of creatures won't stop themselves.<br/></li><li> Travel to every corner of Upper-Left-Earth, meet exciting and maniacal monsters to set up a welcoming committee using towers, traps, and explosives to wipe the gatecrashers out.-Keep an eye on resources to ensure the Dwarves won't have to endure a painful future of sobriety and mere water for sustenance!</li></ul>", "metacritic": null, "released": "2023-09-11", "tba": false, "updated": "2023-09-15T03:29:15", "background_image": "https://media.rawg.io/media/screenshots/5ef/5ef190254e565b72e32a39173ef1b094.jpg", "website": "https://www.damadamagames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 335, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dama Dama Games"], "genres": ["Action", "Strategy", "Simulation", "Indie"], "publishers": ["Freedom Games"], "esrb_rating": null}