{"id": 965544, "slug": "truth-3", "name": "Truth", "name_original": "Truth", "description": "(HEADPHONES EXTREAMLY SUGGESTED)<br/>\r\nTruth is a 3D, First Person, Horror Game, created by an indie game developer, who goes by the name Blight. <br/>\r\nIn this game you are a detective, the best in your department. <br/>\n<br/>\r\nThings have been going awfully grey for you in the past week, your wife was away on one of her dreadful work trips, you had no interesting cases, and some idiot just called you at 2 AM. <br/>\n<br/>\r\nWhen you picked up the phone, you realized quickly that it was your Captain, calling you from the department. He briefed you quickly on some disturbance at a luxurious hotel known as Cenivard Hotel. An evacuation took place and lots of survivors made it out screaming and yelling about some odd robot with minimalistic designs, going around causing DREAD. <br/>\n<br/>\r\nYour boss continued on with the story mentioning that a SWAT team was sent into the hotel to take care of the threat, but they were never seen again. After this incident, the police came up with their next idea, sending only one officer inside, on a stealth mission in order to find the hotel owner, to get his keys to lock down the building and secure the threat. That's when your boss offered you the case, which you accepted.<br/>\n<br/>\r\nOnce you made it to the scene, one survivor grabbed your arm and quickly said to you. \"Don't run, don't panic. He can hear you... When the lights go out, and all goes dark, he lurks.\" Then, the survivor quickly handed you a flashlight. \"This flashlight saved my life, it might save yours too\", said the survivor. \"But the only thing that is more important than life, is the TRUTH\", he finished saying before abruptly leaving.<br/>\n<br/>\r\nAfter standing there with a bit of confusion, you slipped the flashlight into your pocket with no regards and walked into the hotel. <br/>\r\nBut what you quickly learned is that your mission was about be a lot more treacherous than you thought.", "metacritic": null, "released": "2023-08-27", "tba": false, "updated": "2024-01-08T07:48:13", "background_image": "https://media.rawg.io/media/screenshots/d2e/d2eca958ae2b148f1b6bbd71748a85f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FMV Interactive", "BLIGHT"], "genres": ["Adventure", "Indie"], "publishers": ["FMV Interactive", "Blight"], "esrb_rating": null}