{"id": 9655, "slug": "shoot-shoot-mega-pack", "name": "Shoot Shoot Mega Pack", "name_original": "Shoot Shoot Mega Pack", "description": "Are you tired of settling for just one game to play with your friends? Does the thought of needing to pick a single game for your party paralyze you? Well blow out a candle and call it your birthday, because we have just the game for you!<br/><br/>In <strong>Shoot Shoot Mega Pack</strong> you and up to three friends can duke it out head-to-head in any of four 2D shooters, each one focusing on its own core mechanic! Push each other into walls that expand with every shot in <strong>zoom</strong>, thrust and shoot together in <strong>sync</strong>, avoid a barrage of black holes in <strong>void</strong>, or carefully try to find your invisible friends before they find you in <strong>fade</strong>! <br/><br/>For the tinkerers out there, mix and match rules however you want in <strong>custom mode</strong>! Try 'em once or mark them as your faves and come back to them whenever you want! Finding all these options too overwhelming? Don't worry, we've got you covered! Take a load off and let the party gods choose for you in <strong>party mode</strong> or take your chances with an endless stream of randomly generated rulesets in <strong>chaos mode</strong>!<br/><br/>There's no right way to play Shoot Shoot Mega Pack, just make sure you do it with friends!RED HOT FEATURES<br/><ul><li>Fast-paced competitive local mutliplayer for 2 to 4 players<br/></li><li>Playable pre-game lobby that makes sure everyone knows the basics before their first game<br/></li><li>Customizable controls including both modern and classic aim styles<br/></li><li>Four preset games that all focus on their own unique core mechanics<br/></li><li>Unlockable modes, rules, and maps<br/></li><li>Customizable rulesets that can be saved as faves for ease access<br/></li><li>13 rules that can be used in any configuration<br/></li><li>Over 4000 rule combinations<br/></li><li>Cycle through presets, faves, and unlock matches in Party Mode (BYOB)<br/></li><li>Maps are divided between 4 sectors that each highlight a different level object<br/></li><li>Over 40 versus maps<br/></li><li>Let the game randomly generate rulesets in Chaos Mode<br/></li><li>80 cool names to choose from like Bearman, Lady Fistforheart, and Greg</li></ul>", "metacritic": null, "released": "2017-04-28", "tba": false, "updated": "2019-08-28T17:06:39", "background_image": "https://media.rawg.io/media/screenshots/225/22596b672120b300a62f660593791165.jpg", "website": "http://ssmpgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Actual Humans"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Actual Humans"], "esrb_rating": null}