{"id": 965525, "slug": "chimeras-heavenfall-secrets-collectors-edition", "name": "Chimeras: Heavenfall Secrets Collector's Edition", "name_original": "Chimeras: Heavenfall Secrets Collector's Edition", "description": "Long Description<br/>\r\n(No limit for Web site. If there are too many features to fit in the bullets below, work them into the copy here.)\tElephant Games presents a magical tale in their popular series Chimeras!<br/>\n<br/>\r\nAstrid and Greta are the best of friends, but when Greta doesn’t report in for her semester break at their school of magic, everyone knows something’s wrong. As you begin digging deeper, you’ll discover the hallowed halls of Heavenfall hold many secrets. And someone will do anything to keep you from finding the truth, guarding the mysteries laid dormant in Heavenfall’s darkest corners for years. Can you bring the truth to light, and help find Greta? Find out in this enchanting hidden-object puzzle adventure game!<br/>\n<br/>\r\nThis is a Hidden Object Puzzle Adventure game, meaning a specific genre of story-driven, point &amp; click adventures. Throughout the game, players are tasked to find a list of objects hidden within a particular scene, and to occasionally complete various mini-games/puzzles. <br/>\n<br/>\r\n•\tSeal the Dark World portal forever in the bonus game!<br/>\r\n•\tReplay your favorite HOPs and mini-games and earn achievements!  <br/>\r\n•\tFind morphing objects, collectible spell cards, and puzzle pieces!  <br/>\r\n•\tEnjoy exclusive wallpapers, screensavers, music, concept art, and more! <br/>\r\n•\tNever get lost with the strategy guide!", "metacritic": null, "released": "2023-08-25", "tba": false, "updated": "2023-08-28T03:33:22", "background_image": "https://media.rawg.io/media/screenshots/de7/de7dc4c02868651522499da43ede3c9a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 525, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Elephant Games"], "genres": ["Adventure", "Casual"], "publishers": ["Big Fish Games"], "esrb_rating": null}