{"id": 965533, "slug": "time-and-time-again-a-strategy-game", "name": "Time and Time again - a Strategy game", "name_original": "Time and Time again - a Strategy game", "description": "It all takes place on a board, where you have some zones, or tiles. On each zone you can have settlements, and the zone be one of many types: woods, plains, water, swamp, barren. Zone types affect food production and unit movement speed.<br/><br/>The Settlements are simulated realistically, but simplified, with food production, happiness, sanitation, taxation, etc. As a ruler you can adjust food rationing, taxation levels, and choose to construct improvements to make your settlement better.<br/><br/>You can also interact with other nations, fight them, or trade, perhaps buy some nice products which would make your citizens happier (so you can tax them even further!)<h3>Wishlist</h3><br/>Make sure you Wishlist the game to explore it on day 1!<br/><br/><br/><br/><br/><br/><ul><li>Combination of settlement-specific Food rationing and Taxation, balanced against their happiness<br/></li><li>    Units on the world map require food rations, and take cold damage during winters, affecting how you need to plan your invasions<br/> </li><li>   Improvements all have some benefits, but they might also cost a bit (money), and require some working population (which would otherwise procure food), and some may also give you penalties (such as decreasing sanitation from some industries), forcing you to consider what you build where<br/></li><li>    Units can be recruited at will, but they will cost you both money, population (some villagers are converted to soldiers) and armaments. You need to balance population procuring food, working your improvements, and staffing your armies to not run out of food or money (or inhabitants!).<br/></li><li>    Three Factions can be played, all with their own unique bonuses.<br/> </li><li>   A large amount of improvements (70) and research topics (20) are present, providing a myriad of ways for you to develop both individual settlements, as well as your nation overall.<br/> </li><li>   Minerals are hidden by default, and need to be prospected on the map. After prospection, you can build mines. Once you have raw materials you can build Smelters to produce Products - which are sold in settlements for wealth and happiness - and stronger Armaments - which can improve your new recruited units.<br/> </li><li>   Products, Food and Armaments can all be bought or sold to other nations with the help of Traders. You could also use Traders to ship resources within your nation to enable more ways to use your resources optimally.<br/></li><li>    Scenarios which introduce you to features of the game, as well as historical scenarios (mostly Roman empire right now).<br/> </li><li>   Multiplayer mode so you can defeat or collaborate with your friends<br/> </li><li>   A wide range of units available (20), primarily divided into infantry, cavalry, ranged and siege </li></ul><br/><h3>Scenarios</h3>Play through different scenarios with varying difficulty in order to master the game mechanics. <br/>Learn how to balance the different aspects of a successful game session: Food production, sanitation, crime, upkeep and attacking and defending settlements.<br/>After you have learned the basics, embark on a historical journey, following in the footsteps of the roman emperors as they tried to assert control of large parts of Europe and the Mediterranean!<br/><br/><h3>Random skirmishes</h3>If you just want to play a skirmish and want the game to decide all conditions this is for you.<br/>One click and you are in the middle of the action.<br/><br/><h3>Map editor</h3>Can't get enough of the scenarios? Why not build your own?<br/>In the map editor you can edit the terrain, paint the map in different biomes, place settlements and pick the winning conditions.<br/><br/><h3>Long-lasting design</h3><br/>We will continue maintaining and the developing the game post-launch at least for another one or two years until the game feels as polished as we want it to be (we might be perfectionists, but it takes time).", "metacritic": null, "released": "2023-08-25", "tba": false, "updated": "2023-08-28T03:46:54", "background_image": "https://media.rawg.io/media/screenshots/5cb/5cb31a79699166fe7d884ebeb87b8df1.jpg", "website": "https://timeagain.se/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Evergreen IT"], "genres": ["Strategy", "Simulation"], "publishers": ["Evergreen IT"], "esrb_rating": null}