{"id": 965610, "slug": "po-yue-zhi-xing-the-broken-moon", "name": "破月执行-The Broken Moon", "name_original": "破月执行-The Broken Moon", "description": "1. Game content <br/>What we live in is a world where ordinary people and aliens coexist and co-exist.<br/>The few selected elites among the aliens become the executives of the Alien Authority, shouldering the mission of crossing the world line and carrying out various mysterious missions.<br/>One day, Qin Shen, the administrator of the Alien Authority, received a mysterious message - \"File SSM\".<br/>That night, Qin Shen came to the file room, only to find that almost all of the documents summarizing the event had been taken away, leaving only a list. It was a list of the executors who were assigned to enter Samle three years ago.<br/> <br/>\"Samle\" is a physical world formed by the distortion of all the chaotic and horrific world fragments.<br/>We, as Exalted Ones, have no right to save this world. We only know that it is a forbidden place, an existence that can never be faced directly.<br/>Once you enter it, it means that your soul will be corrupted and eventually annihilated.<br/>But we had all heard that Samle's existence was not an accident, but a man-made event.<br/> <br/>Qin Shen, due to the collection of evidence against the upper management of the branch, was designated as a rebel to carry out the \"judgment\", exiled to Samle .......<br/>And the enforcer who witnessed it all, the Hangman, Yao Siling, is also involved.<br/>Wen Yi’an, the top 1 among the executives, chooses to stand with them without knowing the reason.<br/> <br/>The fate and mystery of each other will be unraveled one by one in this dark world.<br/>We meet, we know each other, we recognize each other.<br/>We will break the dark moon and overturn the adversity. That is to save Samle and ourselves.<br/>The Broken Moon is starting.<br/> <br/>2. Game Features<br/>The plot is oriented to the empty space, with an independent worldview. Each of the three main lines has a different female protagonist and an exclusive 1v1 male protagonist.<br/>Due to the emergence of the supernormal ability, the supernormal ability management bureau also came into being. The three heroines all belong to the members of the branch. The heroines have different personalities and possess different psychic abilities.<br/>How to keep your \"heart\" and save \"Samle\", the rest of the world, and yourself will depend on your choice and courage.<br/>Uncover the veil of the black moon, explore the mystery of fate, and start an ultimate battle. Let us embark on this feat of crossing the edge of alien power together!<br/> <br/>3.Gameplay <br/>The Broken Moon Execution is a text-based fast-passing supernatural puzzle game. The overhead plot contains various elements such as fast-passing, otherworldly, survival, and suspense.<br/>Game play is diverse, players need to explore through the map, collect various clues to solve the mystery, and gradually understand the truth of the collapse of \"Samle\" ......<br/>Three story lines with different styles:<br/>\"Ghost Village Mystery Line\": Ghost Village break-in, thriller and suspense, pretend to be a pig in a poke, explore and analyze.<br/>\"The Evening Clock Line\": escape suspense, newcomers, upgrading and growth, exploration and deciphering.<br/>\"Abandoned Capital Line: city map, suspenseful exploration, peak of the opening, and face-planting.<br/>Part of the line contains micro-terrorism plot. Please look at your discretion. You can turn on [High-powered Tip] to give you a [High-powered Warning] before the screen appears.", "metacritic": null, "released": "2023-08-28", "tba": false, "updated": "2023-09-01T02:48:48", "background_image": "https://media.rawg.io/media/screenshots/382/38258a0bc604cf0a454a3eb9dc11a75f.jpg", "website": "http://www.66rpg.com/index", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["橙光游戏"], "genres": ["Adventure", "RPG"], "publishers": ["橙光游戏"], "esrb_rating": null}