{"id": 965648, "slug": "disruptive", "name": "Disruptive", "name_original": "Disruptive", "description": "In <strong>Disruptive</strong> you'll enter the story of an abandoned laboratory, the scene of atrocious experiments. You were about to become one more victim of them, but after a strange event, inhuman beasts devastated the place, leaving you, apparently, as the only survivor.<br/><br/>Solve puzzles, collect information and gather resources to survive while you pursue your purpose. However, bear in mind that this task won't be easy, since all sorts of atrocities await you at every corner. There will be no rest for those who seek to finish you off. Get ready to experience this sinister story that will put your principles to test, in which you decide its course.<br/><br/>What is hidden here transcends mere visualization. How far are you willing to go?<br/><br/><ul><li>Collection of limited resources necessary to continue this story alive. You must be careful with the management of them.<br/></li><li>Confrontations in first person. It accompanies the moments of tension with action in situations in which you will have to fight to survive.<br/></li><li>Immersive and terrifying world. You will feel a constant tension in each area of the laboratory that you will have to go through, all of them surrounded by an atmosphere of suspense and terror with every detail that will tell you the story of the place.<br/></li><li>Solving puzzles by interacting with the scenery.<br/></li><li>Non-linear story with a destiny that will depend on your decisions.</li></ul>", "metacritic": null, "released": "2023-08-28", "tba": false, "updated": "2023-09-01T03:39:15", "background_image": "https://media.rawg.io/media/screenshots/cae/caef1800c4ae0375547fc9da18f4343f.jpg", "website": "https://hvnsart.games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HVNSART"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["HVNSART"], "esrb_rating": null}