{"id": 96562, "slug": "the-growth-project", "name": "The Growth Project", "name_original": "The Growth Project", "description": "<p><strong>Welcome to The Growth Project</strong></p><p>The Growth Project is a mellow, zen-like game about encouraging flora (and occasionally fauna) to flourish in fabulous fashion. To grow things at such a rapid rate, we employ the use of a vibrant, funky, gradient-laden ball which can grow things either hidden underground or further the development of flora/fauna already exposed or struggling to stay alive. <br/><br/>When all potential growth on a given piece of land gets to its peak, a path to another grow-able island will appear for the player to access. This process repeats until the final island in a given level set (roughly ~10 islands) has achieved complete growth. <br/><br/>Despite each island vaguely resembling a golf course, The Growth Project doesn't penalize nor limit the number of balls a player may use to grow a given island. Instead, the game rewards players by cranking up a score multiplier every time the ball ricochets off of a wall or new object. This multiplier will affect the base number of points rewarded for each object you grow in a given shot. The more bounces you get before growing something, the more points you'll squeeze out of it. This is what The Growth Project qualifies as \"skillful play\". <br/><br/>Treat yourself to a chill stroll through the floating island-gardens of The Growth Project. But if the Grandma you introduce this to decides to brag about beating your highscore, don't say we didn't warn ya.</p><p>Controls: Left-click, drag-and-release to launch the ball. Right-click: early ball recall.</p><p>Current Build Version: 0.0.0.0 [12-20-2016]</p>", "metacritic": null, "released": "2016-12-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b2f/b2fd1e745ce17c24b510d9a3d1055dbd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Mr. Thee"], "genres": ["Action"], "publishers": [], "esrb_rating": null}