{"id": 965615, "slug": "dungeon-evolution-nemesis", "name": "Dungeon Evolution: Nemesis", "name_original": "Dungeon Evolution: Nemesis", "description": "\"Dungeon Evolution: Nemesis\" takes you on an exhilarating journey into a world of dungeon exploration! In this solo electronic tabletop game, you'll face cunning enemies and endless challenges, immersing yourself in a unique adventure.<br/><br/>Brave adventurer, the depths of the dungeon hold countless secrets and treasures, but beware, for a deadly nemesis is silently tracking your every move. These foes are not only cunning but constantly grow stronger, launching relentless attacks against you. Only through wise strategy and careful planning can you emerge victorious in this battle of life and death.<br/><br/>In this addictive game, you'll make tough decisions, unlock treasures, defeat enemies, and develop your skills and abilities. Each choice will alter your destiny, determining whether you continue forward or fall into despair. Proceed with caution, utilizing your wit and courage to unveil the mysteries of the dungeon.<br/><br/>\"Dungeon Evolution: Nemesis\" features streamlined and compact gameplay mechanics, allowing you to focus on decision-making and strategy, pushing your tactical acumen to its limits. Don't be deceived by its simplicity on the surface; every decision will have a profound impact on your adventure.<br/><br/>Are you ready to embrace the challenges of the dungeon? Forge ahead, battle against formidable foes, and weave your legendary tale in this world teeming with adventures and dangers. Become the bravest adventurer, conquer all obstacles within the dungeon!<br/><br/>Embark on an exploration of \"Dungeon Evolution: Nemesis,\" where your strategy dances with courage, unfolding an epic adventure that is uniquely yours.<br/><br/><br/><strong>Key Features</strong><br/><br/><strong>Nemesis System</strong>: The Nemesis relentlessly hunts you down and grows stronger with each encounter, posing an ever-increasing threat.<br/><br/><br/><strong>Adventurers</strong>: Each character possesses unique skills. Allocate skill points and attributes wisely to prepare for future battles and adventures.<br/><br/><br/><strong>Dungeon Exploration</strong>: Every floor of the dungeon is filled with captivating event cards. Make strategic choices on each card to face the corresponding outcomes.<br/><br/><br/><strong>Battle System</strong>: Engage in combat using regular dice for basic attacks, or combine regular and elemental dice to unleash powerful skills and gain corresponding effects.<br/><br/><br/><strong>Boss System</strong>: Confront formidable boss monsters on each dungeon floor. Defeating them unlocks deeper levels of the dungeon to conquer.<br/><br/><br/><strong>Point System</strong>: Earn points by defeating bosses, elite monsters, or through special events. Utilize these points to enhance your skills and attributes.<br/><br/><br/><br/><strong>Item System</strong>: With limited space, carefully choose and carry valuable items that will aid your adventure and boost your combat capabilities.<br/><br/><br/><strong>Faith System</strong>: Adjust your faith dial to adapt to different situations and challenges, gaining an edge in your journey.<br/>", "metacritic": null, "released": "2023-08-27", "tba": false, "updated": "2023-09-01T02:55:32", "background_image": "https://media.rawg.io/media/screenshots/441/441769caecd3da1dfefe85df63a552f8.jpg", "website": "http://www.blackphoenixgamestudio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 424, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Black Phoenix Studio"], "genres": ["Adventure", "Strategy", "Indie"], "publishers": ["Black Phoenix Studio"], "esrb_rating": null}