{"id": 965673, "slug": "fun-with-the-fitzgeralds", "name": "Fun with the Fitzgeralds", "name_original": "Fun with the Fitzgeralds", "description": "Before you say \"Oh here's another Battle Royal game\"<br/>\n<br/>\r\nLet me tell you FWTF aka Fun with the Fitzgerald's it's what it says in the title it's all just about the fun.  My six-year-old Daughter is a massive gamer just like I was at her age but most of the more suitable popular titles were just too difficult for her. So we teamed up to create a simple yet fun Battle royal game that can be enjoyed by all ages. The Fitzgerald's family is a fun loving bunch. Drop into the land where you will find a cool array of weapons to knock out your opponents with. From small snowball guns to epic ice blasters or electric zappers, rocket launchers, slime bomb guns, and paintball guns there are so many fun ways to play be sure to grab a cake or two and splatter your opponents right in the face. Pick up and eat beans to land smelly pumps. For quick getaways get your hands on a jetpack to fly away if you're finding yourself in trouble. The battle is played out on the Fitzgerald land and there can be only one king or queen of the land. There are handy level shops around the land to buy your favourite weapons by simply collecting as many coins and diamonds from the wide range of chests scattered around the land and if you are lucky enough to pick up some x-ray glasses you can seek out your opponents much easier. The safe zone will shrink in fast making matches quick and fun. Oh by the way watch out for Bruce the zombie and the ghost of posh aunt's mansion they think they own the Fitzgerald's land too. So come on and join in on the fun.", "metacritic": null, "released": "2023-08-30", "tba": false, "updated": "2023-09-01T04:15:09", "background_image": "https://media.rawg.io/media/screenshots/193/193244a3bda752730cc26a633e7bc5b6.jpg", "website": "https://draydurstudio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 468, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Draydur Studio"], "genres": ["Action", "Massively Multiplayer"], "publishers": ["Draydur Studio"], "esrb_rating": null}