{"id": 9656, "slug": "shiness-the-lightning-kingdom", "name": "Shiness: The Lightning Kingdom", "name_original": "Shiness: The Lightning Kingdom", "description": "Shiness is an Action-RPG developed by indie development studio Enigami, which will let you travel in a captivating universe doomed to destruction ever since the fragmentation of the planet Mahera...<br />\nTravel through an enthralling and interactive world as Chado and his 4 companions, and develop your characters<br />\nHyper-dynamic combat mixing magic with combos, parries, and blocks like a traditional arena fighter<br />\nDevelop 2 types of skills (physical attacks and magic) and unlock new talents and spells<br />\nExplore and interact with a vast world made of multiple environments thanks to you and your companions’ special powers and skills<br />\nNumerous quests and side-quests will give you the opportunity to develop your characters and their reputation<br />\nPlay as Chado and his companions, and travel across the Celestial Islands onboard a flying boat.  After a rough landing on hostile territory, you find yourself in the midst of a power struggle between several kingdoms. Chado might be able to resolve this situation thanks to Shiness, a magical spirit that only he can see.<br />\nExplore a large and captivating world with which you&#39;ll be able to interact thanks to the power of your 5 playable characters: crush a big rock using pure strength to enter a secret cave, or use telekinetic powers to activate some mechanisms and discover a back entry…  During your journey, you&#39;ll meet dozens of dangerous enemies with whom you&#39;ll have to face off during hyper-dynamic fights mixing magic, and traditional fighting game mechanics (hit, block, combos…).  Gain experience during those fights, while progressing in the storyline or by accomplishing numerous side quests.  Evolve your characters, learn new skills and spells, and become the hero who will unify the civilizations of Mahera.</p>", "metacritic": 68, "released": "2017-04-18", "tba": false, "updated": "2023-05-25T12:03:52", "background_image": "https://media.rawg.io/media/screenshots/096/0963033cf4c3f1db685221fc3d143033.jpg", "website": "http://www.shiness-game.com/", "rating": 2.56, "rating_top": 1, "added_by_status": {"yet": 71, "owned": 769, "beaten": 1, "toplay": 8, "dropped": 15, "playing": 1}, "playtime": 3, "achievements_count": 157, "ratings_count": 27, "suggestions_count": 528, "game_series_count": 0, "reviews_count": 27, "platforms": ["PlayStation 4", "PC", "Xbox One"], "developers": ["Focus Home Interactive", "Enigami"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Focus Home Interactive"], "esrb_rating": "Teen"}