{"id": 965630, "slug": "the-colorful-creature", "name": "The Colorful Creature", "name_original": "The Colorful Creature", "description": "<h3>THE GAME:</h3>A difficult platformer with the main mechanic of changing color in order to stand on specific colored blocks to progress. In order to change color, you must pick special items that turn you into a specific color.<br/><br/>Play over 300 levels with diverse gameplay that have various items, blocks and hazards, one of the items change gravity and player speed, give you an ability to jump higher, teleport from one place to the other and etc!<h3>LEVEL EDITOR:</h3>The Level Editor let's you build levels and it has over 110 placeable blocks and items (including backgrounds and liquids). Other main features in the level editor are saving/loading multiple levels, enabling fog, changing music, applying narrator text, and play/build mode. There are litetally millions of different level combinations and hours of fun! Finally, you can also put your levels on the Steam Workshop!<h3>LOCAL MULTIPLAYER:</h3>Local Multiplayer can be played with 2, 3 or 4 players. All of the players can customize their look with unlocked skins and hats, and can change controls with 4 presets. Local Multiplayer currently offers two gamemodes, <strong>Survival</strong> and <strong>Race</strong>, but we plan adding more, all gamemodes are compatible with all players.<h3>ENDLESS RUN</h3>If you want to play through the endless queue of hand-crafted levels, try this gamemode! Three gamemodes are available for Endless Run, those gamemodes are Normal, Old School and Custom Endless Run.<h3>CUSTOMIZABLE SKINS &amp; HATS</h3>You can customize your character with skins and hats. Skins are obtained by doing various tasks and most hats are obtained at the hat merchant shop!<h3>AND WAY MORE!</h3>This game has a lot more features than that! We are hoping to add more and you to enjoy our game!<h3>IS THIS GAME FOR YOU?</h3>If you like difficult platformers, puzzle games to some extent, like to make your own levels in games, competing in leaderboards, speedrunning, then this game is for you!<h3>STILL UNSURE?</h3>Well, we got a solution for that as well! You can try the demo or check the game on google play https://play.google.com/store/apps/details?id=com.infiland.tcc", "metacritic": null, "released": "2023-08-28", "tba": false, "updated": "2023-09-01T03:13:43", "background_image": "https://media.rawg.io/media/screenshots/8c2/8c2571220f6e82acdfe3ee8cc5fb8a0b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Infiland"], "genres": ["Indie"], "publishers": ["Infiland"], "esrb_rating": null}