{"id": 965686, "slug": "world-of-rune", "name": "World of Rune", "name_original": "World of Rune", "description": "Welcome to World of Rune, a thrilling and immersive MMORPG where you'll embark on epic adventures across a stunning fantasy world filled with magic and danger. With countless quests, dungeons, and battles to conquer, you'll never run out of excitement in this action-packed game. Customize your character, team up with friends and pets, and take on powerful bosses to unlock new areas and uncover hidden treasures. Get ready to explore a vast and magical universe!<br/>\n<br/>\r\n● Four Playable Classes with Unique Abilities<br/>\r\nYou start out as a novice class character, and later you can choose a class. You can play as a Swordsman, Mage, Archer and Cleric. <br/>\r\nMake your character your own – become a unique adventurer in the world of Rune.<br/>\n<br/>\r\n● Unique Card System<br/>\r\nThere are over 100+ cards in the game, each with their own unique abilities and stats. You’ll need to collect them in order to become stronger! <br/>\r\nCollect and Level up your cards to unlock more abilities and powers to conquer different monsters and bosses. <br/>\n<br/>\r\n● Partners Formation: Combat with Your Partner<br/>\r\nCall the best fighters in the land to fight by your side. <br/>\r\nCollect partners as you adventure through the land and add them to your formation. Deploy partners to increase your Power and join more difficult dungeons and battles.<br/>\n<br/>\r\n● Trustworthy Pets to Keep You Company<br/>\r\nCollect and grow mystical pets that help you on adventures. You can also capture monsters in dungeons to raise them as new pets.<br/>\n<br/>\r\n● Hunt the Boss and Win Rich Loots<br/>\r\nExplore unique maze dungeons and defeat the Boss! Get rare and exciting drops from dungeons to get stronger and increase EXP. Take your character’s power to the next level by leveling up your abilities to overcome dark dungeons and powerful MVP monsters that you'll encounter on your adventures!<br/>\n<br/>\r\nA fantastic journey awaits! Become an unbreakable adventurer and overcome obstacles in this world!", "metacritic": null, "released": "2023-08-29", "tba": false, "updated": "2023-09-01T04:31:59", "background_image": "https://media.rawg.io/media/screenshots/663/663574fbf56b3dbb6e415352428c6e24.jpg", "website": "https://wor.gamehollywood.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 274, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["F5 Games"], "genres": ["RPG", "Massively Multiplayer"], "publishers": ["Game Hollywood Games"], "esrb_rating": null}