{"id": 965667, "slug": "the-black-pool", "name": "The Black Pool", "name_original": "The Black Pool", "description": "The Black Pool has taken you to a remote and unknown galactic system. Make your way across a number of diverse and randomized worlds to try and make it back home. <br/><br/>Throughout your journey, you will learn to master supernatural elemental abilities. Carefully select powers from a large pool of possibilities, complimenting existing abilities and those of your friends. Strategically upgrade these abilities to maximize your potential. There are thousands of possibilities, can you become powerful enough to face what lies ahead? <br/><br/><br/><strong>The Black Pool</strong> is a 3d action roguelike to be played solo or preferably with up to 3 of your friends. Each attempt to make it back home will take you through a gauntlet of different worlds. You will discover different elements, abilities, and upgrades. Striking visuals, an electrifying soundtrack, and high pace / skilled action will plunge you into each attempt to battle your way out.<h3>THE JOURNEY HOME</h3>In each attempt to return home, you will traverse across a random sequence of highly diverse worlds. Throughout the journey, you will unlock supernatural abilities from randomly selected sets of elements, and upgrade these selected abilities from a set of randomly offered options. This procedural sequence of worlds and offerings of abilities and upgrades yields a highly replayable roguelike sequence. Each playthrough presents a randomized set of choices that ensures that every session is completely unique. Committing to decisions and improvising an effective build is core to the game.<h3>IMPROVE WITH EACH ATTEMPT</h3>With each attempt you will learn how enemies behave and what their weaknesses are. You will learn how each of these supernatural abilities work and synergistic ways to use abilities together. In addition, you unlock enhancements that are permanent and persist across playthrough attempts. <br/><br/><br/><h3>BRING A FRIEND</h3>While you can try and make it on your own, it may be more fun to bring a friend or three. The Black Pool has been designed to maximize the cooperative multiplayer experience.  Many of the abilities contain game mechanics that deliver fun and rewarding interactions between players. Redirect friendly attacks, amplify team spells, coordinate stuns and team buffs, create barriers, and much more.  In The Black Pool, co-op play can be much more than simply playing the same game together— you are rewarded for actually working together to be successful.", "metacritic": null, "released": "2023-08-29", "tba": false, "updated": "2023-09-01T04:05:05", "background_image": "https://media.rawg.io/media/screenshots/e2c/e2ccf13af0c3d18d63b0302e7ea6e56b.jpg", "website": "https://smugmarmot.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 505, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Smug Marmot Studios"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Smug Marmot Studios"], "esrb_rating": null}