{"id": 965616, "slug": "aggregator-elevator-system", "name": "Aggregator Elevator System", "name_original": "Aggregator Elevator System", "description": "<p><strong>&#39;Aggregator Elevator System&#39;</strong> is a strategic logic-based number puzzle game, designed and developed with a fresh original gameplay foundation. It caters to those who enjoy faintly similar games like Sudoku, Picross etc.</p>\n<h1>ABOUT THE GAME</h1>\n<ul>\n<li>The game involves strategically arranging blocks within a grid to make the horizontal and vertical signal numbers add up correctly.  </li>\n<li>The blocks have intuitive logical properties such as adding, combining, equalizing, XY, distance etc and more which you can use to manipulate the values of the signals to solve each levels.  </li>\n<li>A highly solvable combinatorial puzzle game. Focusing on a deep,versatile and balanced gameplay experience.  </li>\n<li>The game involves the use of number logic, but it will not bog you down with any mind numbing math. The real focus is on analyzing number patterns and clever logical manipulations within tight constraints.  </li>\n<li>The game is designed to respect both your time and your intelligence.  </li>\n</ul>\n<h1>CHOOSE AMONG 2 GAME MODES - 60 LEVELS EACH</h1>\n<ul>\n<li>Elevator Sliding Mode  </li>\n<li>Direct Placement Mode  </li>\n</ul>\n<h1>KEY FEATURES</h1>\n<ul>\n<li>Over 60 semi hand-crafted levels which you can play for hours. The level composition are carefully set by hand but the solutions are randomly arranged through a custom seed.  </li>\n<li>High replay value, as you can start new games using new seeds to generate fresh set of unique levels.  </li>\n<li>Experience simple to complex puzzle systems through the emergent combination of many primitive block operations working in perfect synergy with each other.  </li>\n<li>Multiple difficulty levels.  </li>\n<li>Levels are carefully optimized separately for the two game modes.  </li>\n<li>Aggregator is all about the mental satisfaction of solving logic based number puzzles. No artificial hindrance like timers or move counters.  </li>\n<li>Optional tip and cheat feature to help pass challenging levels.  </li>\n<li>Mouse/Keyboard/Gamepad support.  </li>\n<li>Steam cloud save and achievements integration.</li>\n</ul>", "metacritic": null, "released": "2023-08-28", "tba": false, "updated": "2024-03-16T23:47:07", "background_image": "https://media.rawg.io/media/screenshots/081/08184cf6b027b59f1c4fcda3b4c8c2d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["Eternal Monke Games"], "genres": ["Casual", "Indie", "Puzzle"], "publishers": ["Eternal Monke Games"], "esrb_rating": null}