{"id": 965649, "slug": "prison-city", "name": "Prison City", "name_original": "Prison City", "description": "<strong>Prison City</strong> is an action-packed side-scrolling shooter where players use chakrams and grenades to battle through various levels, defeat bosses, and uncover hidden upgrades. The game features customizable gameplay and difficulty, a 'Boss Rush' mode for players to compete for the best time, and an excellent retro soundtrack by Raddland Studios.<br/><br/><h3>80s and 90s ACTION MOVIE &amp; GAME REFERENCES</h3>Prison City is packed with nods and homages to classic action movies and games from the 80s and 90s, including iconic one-liners, memorable characters, and familiar gameplay mechanics. Fans of the action genre will feel right at home.<br/><br/><h3>FIGHT YOUR WAY ACROSS AN ENTIRE CITY</h3>Players will fight their way across an entire city, grappling through eight or more zones that range from sewers and factories to nature preserves. Each zone presents its own unique challenges, from environmental hazards to powerful bosses that will put your skills to the test.<br/><br/><h3>FIGHT FOR THE FUTURE... IN THE FAR OFF YEAR OF 1997</h3>The crime-ridden and crumbling city of Detroit was evacuated in 1995 and became an impenetrable mega-prison. In the present-day (of 1997) an evil group has infiltrated and seized control. Former cop Hal Bruzer is called back from retirement by his mentor, \"The Chief,\" to take down the 'Techno-Terrorists' and their appointed Wardens... to hopefully, bring the 'spirit' of Detroit back!!<br/><br/><br/><br/><strong>...best part of the game?? You can TALK TO A DOLPHIN</strong>", "metacritic": null, "released": "2023-08-28", "tba": false, "updated": "2023-09-18T23:02:29", "background_image": "https://media.rawg.io/media/screenshots/ede/ede945d9f9165021be62d24fb3e1408e.jpg", "website": "https://prisoncitygame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "toplay": 2, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 443, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Programancer", "Retroware"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Retroware"], "esrb_rating": null}