{"id": 965656, "slug": "adam-2", "name": "Adam", "name_original": "Adam", "description": "The first Realistic Rogue-like FPS game is now available. \"Adam\", which we continue to develop, is now on sale!<br/><br/>Now you are ready for the best mix of Rogue-like and FPS genre.<br/>Experience the incredible story of Yavuz with his military skills now as a military robot pilot! Experience the Rogue-like feeling at its best with a huge number of levels.<br/><br/>CO-OP Mode will be playable very soon!<br/><br/><h3>Subject</h3><ul><li>Adam is a science fiction-themed game that combines the Rogue-Like and FPS genres. The events take place in a universe set in the future. The player, as a betrayed soldier, fights for revenge against his enemies. In an age where the human body is weak, our character has trained himself in robot combat and has become a powerful robot pilot. Prepare to destroy enemies by powering up your own robot!</li></ul><br/><h3>Purpose and Challenge</h3><ul><li>The main goal of the game is to get the revenge described in the story, but as the game progresses, the goal of our character changes. In terms of gameplay, it is to progress by killing enemies in all the battlefields we enter. Our progress in the battlefields is to kill robots and pass the levels one by one with many improvements such as armor, bullets, skills.</li></ul><br/><h3>Features</h3><ul><li>You can enjoy the Rogue-like genre with \"Adam\", which has the first realistic atmosphere and storyline. <br/><ul><li>The game difficulty is designed in such a way that the Rogue-like player will enjoy it the most.</li></ul><ul><li> With the \"Dynamic Music Transitions\" music system, never lose the action in Adam, where the music adapts to the pace of the game.</li></ul><ul><li>There are 3 different weapon types, this number will be increased to 6 in a very short time. In this way, you can experience the FPS experience in the best way with a variety of weapons.</li></ul><ul><li>Maximize the Rogue-like feel both visually and mechanically with a variety of bullets, armor, enemy characters and more.</li></ul><br/><h3>Built for Replayability.</h3><ul><li>Fight robots in this technological universe where you can interact with various characters.</li></ul> <ul><li>Keep fighting to become permanently stronger and ensure your next attacks are successful!</li></ul></li></ul>", "metacritic": null, "released": "2023-08-29", "tba": false, "updated": "2023-09-01T03:49:26", "background_image": "https://media.rawg.io/media/screenshots/a28/a287184bcbd0e1d1ff1ab1e7e38df668.jpg", "website": "https://www.tetastudio.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 286, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Teta Studio"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Teta Studio"], "esrb_rating": null}