{"id": 965650, "slug": "space-dezinsector", "name": "Space Dezinsector", "name_original": "Space Dezinsector", "description": "You control a free artificial intelligence named Dez, who was forcibly returned to his old robot body, located in an abandoned space mine where he used to work. Now the station has a new owner. The new station manager, an artificial intelligence named TOM, forces Dez to clean up this place before the arrival of people. But there is one problem - everything around is captured by alien bugs - lithoarachnids.<br/><br/><strong>Gravity Beams:</strong><br/>Your character has gravitational beam technology. With their help, you can interact with objects around.<br/><br/><strong>Swarm:</strong><br/>Hordes of aggressive bugs captured the corridors of the station. Carefully plan your battle tactics with them, otherwise you will be crushed by numbers.<br/><br/><strong>Debris:</strong><br/>Along the way, you will encounter various pieces of debris that prevent you from passing. Use gravity beams to disassemble them.<br/><br/><strong>Combat system:</strong><br/>A unique combat system in which objects around you are used instead of ammunition. Be careful, they are not endless!<br/><br/><strong>Everything is in business:</strong><br/>You can throw literally anything you can get your hands on at enemies. Tear off paneling from walls or pick up various debris from under your feet to throw at enemies. Even bugs hives can serve as a source of ammo.<br/><br/><strong>Free AI:</strong><br/>Your character is extremely dissatisfied with his current position and constantly reminds of this in many dialogues.", "metacritic": null, "released": "2023-08-28", "tba": false, "updated": "2023-09-01T03:42:08", "background_image": "https://media.rawg.io/media/screenshots/788/7886864c0b8859c0ba98fbd9ce845912.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Red Crystal"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Red Crystal"], "esrb_rating": null}