{"id": 965770, "slug": "hainya-world", "name": "HAINYA WORLD", "name_original": "HAINYA WORLD", "description": "You are an adventurer, you need to explore this continent, make good use of the resources of this continent to arm yourself, explore this world full of monsters and unknown things and survive!<br/>Custom Character, collect ores and various resources, build stronghold, and enjoy a variety of rich game content! The refreshing combo and skill system allows you to experience the different fighting styles of each job to defeat dangerous monsters! In addition, you can also cook food, craft, enchant weapons, make tools, and explore a wider area. Invite more partners to adventure together!<h3>Custom Character</h3><br/>In the game, through various furniture, you can change the character's appearance, clothing, accessories, hairstyle, makeup, etc., and even gender at any time. Keep exploring in the game to obtain new appearances, and constantly change characters until you configure the unique shape you are most satisfied with!<br/><h3>Mining Resources</h3><br/>There are a variety of resources that can be collected in the game. Each region will have different blocks and specialty resources. Explore all regions, understand the uses of all props, and make good use of them. As long as you understand this continent, the continent will help you .<br/><h3>Job System</h3><br/>You can choose different jobs in the game, each occupation has its unique role positioning and ability to play. Understand professional skills and establish a tacit understanding with friends, cooperate with each other, fight together, create various combat strategies, and make the game more interesting.<br/><h3>Building a stronghold</h3><br/>There are various blocks in the continent that can be collected, explore all areas and collect the required specialties and resources, and build stronghold  everywhere on the map. Part of the blocks can be reprocessed through furniture, and the shape of the blocks can also be changed by using a hammer. Make good use of these functions, create, build and decorate the base with friends, and create a game world with your own unique style.<br/><h3>Production Items</h3><br/>In a large sandbox game, production items is a very important part. Players can collect different types of resources on the map, and use these resources to make various tools, furniture, equipment, weapons and other items. Come and explore different areas more easily, improve the game experience, and share your exploration results with other players.<br/><h3>Fashion Clothing</h3><br/>In this adventurous world there is another important element - stylish clothing. Defeat mighty monsters or find and earn raffle machine tokens in the Shadow World Gate to draw stylish outfits. Dress up yourself to make your character more colorful.<br/><h3>Adventure together</h3><br/>It is better to be alone than to be happy together. Invite friends to explore this mysterious world together, use the initial altar to connect with each other, and take risks in this unknown world together!<br/>", "metacritic": null, "released": "2023-08-31", "tba": false, "updated": "2023-09-01T06:17:12", "background_image": "https://media.rawg.io/media/screenshots/7d1/7d1b7268e770ac88c4aee8e6233f029c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 281, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NETWORKGO"], "genres": ["Action", "Adventure", "RPG", "Casual"], "publishers": ["NETWORKGO"], "esrb_rating": null}