{"id": 965720, "slug": "curt-maddox", "name": "Curt Maddox", "name_original": "Curt Maddox", "description": "The sheriff of a small town like Snake Valley is meant to be a pillar of society, somebody everybody looks up to, a man whose mere presence is enough to keep the peace. It’s a pity, then, that Curt Maddox only got the badge because the last sheriff got too drunk during a poker game. <br/><br/><br/><br/>With this purchase, you're getting the ORIGINAL CURT MADDOX game with the expansion called WIDER HORIZONS.<br/><br/><br/><br/>The expansion will introduce two gripping plot lines, introducing characters we've never seen before - like <strong>FENG SHUI,</strong> the exotic Asian trader from the train station. Her oriental-style apartment is perched atop the ticket office and she sparks a passionate romance with both Hank and Curt. Lori, Hank's beloved daughter, will take center stage in an explosive scene overflowing with lust and undeniable chemistry. Sue proves her loyalty to Curt by making a daring sacrifice that affects us all.<br/><br/><br/><br/><strong>CANDELA RIVERA</strong> strides across the wild west, the dirt and dust kicked up by her boots mixing with a cloud of gun smoke from the pistol nestled in her holster. Her sharp wits and no-nonsense attitude keep outlaws at bay, until Curt steps onto the scene. With curves that draw men in like moths to a flame and eyes as deep as an abyss, he stares into the heart of Candela with an expression too tempting for even her brave spirit to ignore. He fumbles for words while she stands there in nothing but lacy lingerie; can Curt resist this femme fatale?<br/><br/><h3>GAMEPLAY</h3><br/>This is an adventure game with visual novel elements. Explore this Wild West town and the stories of its inhabitants! Bring about new relationships and solve their problems like a good sheriff who is not at all a hustler in a paper-thin disguise should! I mean, it’s not like every decision you make is bound to end up in hair-whitening havoc! The game is non-linear, after all, and at least one of its multiple endings should be about Curt being a nice, competent person… Shouldn’t it?<h3>EROTIC CONTENT</h3><br/>Saddle up, cowboy! Or don’t, if you like it raw, because this is, after all, an erotic story. The ladies are plenty and varied, and so is what they’ll expect (or want, or try to avoid) Curt to do, so better get ready to pluck that apparently innocent flower caring for her ranch or to break the ice queen persona of that bitchy mayoress. Between swinging, cheating, and threesomes of the usual or devil variety, Curt is sure to stumble upon something that works. Even if just for him.<br/><br/><h3>WHY IS IT WORTH IT?</h3><br/>- genuine wild west theme with stylized characters and atmospheric locations<br/>- glamorous cast of characters including town Mayor, farmer girl, voodoo shaman, and more<br/>- an intriguing story full of smart decisions to make, spiced with voodoo magic<br/>- open world gameplay with easy relationship-building and adventure game vibe<br/>- highly interactive sex scenes with a lot of positions and cumshots to select<br/>- non-linear gameplay, 11 unique endings, sex scenes gallery and secrets to discover <br/>- 100% UNCENSORED, unlimited save slots, options to roll back the time and replay scenes", "metacritic": null, "released": "2023-08-30", "tba": false, "updated": "2023-09-01T05:14:13", "background_image": "https://media.rawg.io/media/screenshots/4bd/4bd2b9fb9d8fd5074a76a3883e7bb55d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 406, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Lesson of Passion"], "genres": ["Adventure", "Indie"], "publishers": ["Lesson of Passion"], "esrb_rating": null}