{"id": 965721, "slug": "dynastio-2", "name": "Dynast.io", "name_original": "Dynast.io", "description": "\"Dynast.io\" is a cool multiplayer browser game where you can play online with players from all over the world. Before starting the game, you can choose not only your nickname, but also a cool warrior. Also, the hero can choose the color of clothes and hair. When everything is ready, you can start. You will find yourself on a large map, where rivals have already been waiting for you. Around you will be not only other players, but also other creatures - from harmless animals to wild animals and monsters.<br/>\n<br/>\r\nWhile there are no weapons in your arsenal, you need to collect wood, iron and gold to create weapons. After all, you and I understand that it is not the best idea to engage in battles with enemies and monsters with bare hands. Each weapon has its own advantages. If the club hits harder, then with an ax, you can get more resources. First, it is better to make a club and use it to crush monsters. It is the club that will cause great damage to creepy creatures.<br/>\n<br/>\r\nAs soon as you get the required amount of resources, you can start building your base, and then hire guards, archers and knights. There, you can not only hide from attacks, but also store your special treasures.<br/>\n<br/>\r\nAlso, you can join clans and demonstrate your skills and talents of playing in a team. In addition to building a base, you can create a vehicle for yourself and move around it on the map. Here, the wonderful world of \"Dynast.io\" will open before you and you can become a cool warrior. Enjoy the game and good luck!", "metacritic": null, "released": "2023-08-30", "tba": false, "updated": "2023-09-01T05:15:30", "background_image": "https://media.rawg.io/media/screenshots/d93/d93ad27bc2ad5acd2bdd35ab83f16291.jpg", "website": "https://dynast.io/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Whalebox Studio"], "genres": ["Action", "Adventure", "RPG", "Massively Multiplayer", "Indie"], "publishers": ["Whalebox Studio"], "esrb_rating": null}