{"id": 965702, "slug": "tamer-vale", "name": "Tamer Vale", "name_original": "Tamer Vale", "description": "Tamer Vale is a turn based card battler, where a collective of elven heroines, known as Tamers, journey forth beyond the safety of their hidden valley to find and confront the sources of corruption in the land, and bring balance to it using their special rituals!<br/><br/><br/>The Elves of the glade are armed with unique skills and abilities. They will meet and subdue a wide range of foes, some of which are immensely powerful and can only be truly defeated by the Tamers secretive rituals!<br/><br/><br/>The Tamers will need your help to guide them past the Gloomward and forests edge as they encounter the source of the demonic influences disrupting balance across their Glades.<br/><br/>Help them choose the way forward, manage their abilities, skills and rituals to keep the demons at bay!<h3>Key Features:</h3><ul><li>Build and manage your card deck through selection, upgrades, and removal.<br/></li><li>Enjoy over 150 diverse cards supporting various playstyles and strategies. <br/></li><li>Conquer 3 maps filled with unique enemies and challenging bosses. <br/></li><li>Experience 19 beautifully handcrafted pixel art animations depicting the elves and their encounters. <br/></li><li>Immerse in visually nostalgic retro-style pixel graphics, entirely hand-drawn and animated. <br/></li><li>Indulge in a musical score inspired by classic fantasy RPGs. <br/></li><li>Explore a vast array of content crafted with love and care by a small indie team of 2 people.</li></ul>", "metacritic": null, "released": "2023-08-31", "tba": false, "updated": "2024-01-05T18:23:26", "background_image": "https://media.rawg.io/media/screenshots/985/985b976ada5d813c8135aaa268b350eb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 2, "toplay": 5, "dropped": 2}, "playtime": 0, "achievements_count": 20, "ratings_count": 4, "suggestions_count": 352, "game_series_count": 0, "reviews_count": 4, "platforms": ["macOS", "PC"], "developers": ["PixelBee"], "genres": ["Adventure", "Strategy", "Indie"], "publishers": ["PixelBee"], "esrb_rating": null}