{"id": 965703, "slug": "free-for-all-2", "name": "Free For All", "name_original": "Free For All", "description": "What do you think is the most important thing in life?<br/>\r\nmoney? honor? love? or something else? everything is fine Please enjoy this adventure according to your values.<br/>\n<br/>\r\nVarious races live in harmony in this world. They work hard every day with their own purpose.<br/>\r\nBecome a part of this world too, adventure in their world and fulfill your purpose.<br/>\n<br/>\r\n1. Game progress.<br/>\r\nThe game consists of a tutorial chapter and one chapter.<br/>\r\nEach chapter has its own main story and sub story. Depending on that, there are various quests or items.<br/>\r\nIn the tutorial chapter, you can naturally learn the core features of the game and infer the story of chapter 1 by doing quests.<br/>\r\nAdditionally, upon successful completion of the tutorial, you will receive several items, stats, and reputation.<br/>\r\nIn Chapter 1, you can freely adventure according to your values.<br/>\r\nAs you progress through the adventure in Chapter 1, you will naturally approach the main story, so you will never forget what the main story is.<br/>\n<br/>\r\n2. Features of the game.<br/>\r\nThere are two ways to defeat monsters in this world.<br/>\r\nThere is a way to kill monsters by attacking, and a way to expel monsters by letting them go.<br/>\r\nDepending on how you defeat monsters, there may be changes in the rewards or reputation you get, so you can choose according to your needs.<br/>\n<br/>\r\nYou can get important clues for exploring this world through the conversation function with NPCs, and you can acquire various rewards or change your reputation through the quest function.<br/>\r\nIn addition, various items can be acquired through transactions with NPCs with shop functions.<br/>\r\nChoose carefully as the story of each chapter progresses through interactions with these NPCs.<br/>\n<br/>\r\nTypes of items include equipment items, consumption items, and other items.<br/>\r\nEquipment items are classified into weapons (swords, axes, daggers), sub-weapons, hats, tops, bottoms, gloves, and shoes.<br/>\r\nAnimations vary depending on the weapon category. Also, there are various advantages and disadvantages.<br/>\r\nThere are equipment items that have set effects. If you meet the conditions of the set effect, you will get additional stats and reputation.<br/>\r\nEquipment items can be enhanced to adjust their stats and reputation.<br/>\r\nConsumption items are classified into recovery potions, temporary buff potions, permanent buff potions, reinforcement books, and gift boxes.<br/>\r\nOther items are all items that are not equipment items and consumption items.<br/>\n<br/>\r\nImportant factors that affect gameplay include your level, stats, reputation, and quest progress.<br/>\n<br/>\r\nReputation has been added in addition to levels and abilities, which are indispensable elements of RPGs.<br/>\r\nThere are various races in this world, and there is a reputation (overall reputation) and a reputation for each race.<br/>\r\nDepending on this reputation, there are restrictions on numerous functions such as using items and performing quests.<br/>\r\nRegardless of reputation, the main story progresses, but the conditions for clearing the main story quest will change, so be careful.<br/>\n<br/>\r\nThere are various conditions such as chained quests, opposing quests, required stats, and required reputation as conditions for performing quests.<br/>\r\nThis is a game where quests are important. If you perform some quests, you may not be able to perform other quests, so you need to choose carefully.<br/>\n<br/>\r\nMonster dictionary function is supported. It doubles as a kind of challenge or monster information.<br/>\r\nIn the Monster Dictionary function, you can unlock the monster and check the monster's information.<br/>\r\nThe way to unlock the monster is to kill a certain amount of the monster.<br/>\n<br/>\r\nAll game data is saved to the user's local storage every minute.<br/>\r\nThis will be used later when loading the game.<br/>\n<br/>\r\nVarious UIs are provided.<br/>\r\nIt provides stat and equipment window, item window, quest window, reputation window, monster dictionary window, in-game notification window, quick slot window, log window, and option window.<br/>\r\nIn the Ability and Equipment window, you can check the status and status of the equipment you are wearing in detail.<br/>\r\nIn the item window, you can check all the items you own.<br/>\r\nYou can check your reputation in the Reputation window.<br/>\r\nIn the Monster Dictionary window, you can check the level of unlocking the monster dictionary and various information.<br/>\r\nYou can check various log records in the in-game notification window.<br/>\r\nThe quick slot window supports quick use of items.<br/>\r\nIn the case of equipment items, item switching is possible, and in the case of consumption items, it is possible to use them. For other items, only simple quantity confirmation is possible.<br/>\r\nIn the log window, you can check various log records.<br/>\r\nIn the options window, you can set the resolution, sound settings, and exit the game.", "metacritic": null, "released": "2023-08-30", "tba": false, "updated": "2023-09-01T04:51:46", "background_image": "https://media.rawg.io/media/screenshots/57f/57fae1459e59b33a859ea5d566bceef5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BAE JONG WON"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["BAE JONG WON Game"], "esrb_rating": null}