{"id": 965763, "slug": "cardbob", "name": "Cardbob", "name_original": "Cardbob", "description": "The game puts you in the shoes of Cardbob. A hi-tech cardboard robot with access to a mysterious dungeon system in their basement. Where they collect items to later on sell to traders. You have to negotiate for the best price when selling the dungeon items to NPCs. Look after your shop in a sci-fi cardboard universe! Go on dungeon runs to collect rare items and negotiate their price with traders. Meet security robots that try to stop you, bosses and unique types of rooms! Grow stronger and become the top trader in the town of neon lights and cardboard robots.<h3>FIGHT, EXPLORE AND COLLECT ITEMS</h3>Find, collect and send home the items you come across in the dungeon. Fight and defeat enemies to grow stronger! Every room has its usefulness and having enough currency allows you to make the most out of it. <br/><br/><h3>NEGOTIATE FOR THE BEST PRICE</h3>Put items in their slots, open your shop, and get ready to negotiate. Observe the stats of your customers and go for the best price you can get. <br/><br/><br/><h3>GROW STRONG</h3>Sell items, explore the dungeons, and grow stronger every time you do so. Going further in gives you better loot. Negotiate for a higher price! Currency made from haggling gets you permanent upgrades.<br/><br/><br/><br/><br/>https://store.steampowered.com/app/1963670/Cardbob_Revival", "metacritic": null, "released": "2023-08-30", "tba": false, "updated": "2023-11-27T06:42:07", "background_image": "https://media.rawg.io/media/screenshots/543/5435b015ad40aa1051a6cdff1f8f6383.jpg", "website": "https://cardbob.madcookies.games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 276, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Mad Cookies Studio"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Mad Cookies Studio"], "esrb_rating": null}