{"id": 965861, "slug": "holuas-arcades", "name": "Holua's Arcades", "name_original": "Holua's Arcades", "description": "Get ready to dive back into the pure joy of gaming with Holua's Arcades! You've got a chance to relive the classics that made arcade gaming legendary. Prepare yourself for four thrilling games inspired by the genre's all-time favorites. From challenging platformers that require mad skills to epic space battles and classic beat 'em-up action. It's like having four arcade machines right at your fingertips!<br/><br/><strong>For the geeks! Some extra details about games in this collection:</strong><br/><br/><strong>Don't Mess With Rick</strong><br/>A pulp story, highly animated graphics, and bouncy gameplay are here to celebrate the 90s, the pinnacle of arcade beat'em ups. This street rumble is set across four different stages. After being kicked out of his mob family by his father, Rick decides to revenge by beating all its members and getting to the top of the power. Alternated by typical for the period bonus stages and cutscenes, the player has at his disposal a rich combat system.  Made up of combos, clinch, projections, parries, and counterattacks, as well as handy and throwing weapons like knives or nunchuks, among loading bar that allows to perform four super special and ultra scenic moves. Fight your way through huge bosses, replicant ninjas, road yard traps, rabid dogs, and ... the fury of your bloodline!<br/><br/><br/><br/><strong> Crescent Moon</strong><br/>A fast horizontal shoot 'em up with a basic formula to jump into the action instantly! Destroy the army of Trixion, the cosmic tyrant who wants to conquer Holua! Collect and swap five different weapons, multiple directional shot bonuses, and optional pods which assist you in the battle. Avoid and memorize environment traps and face huge bosses at every stage. Find some secrets hidden here and there. The scoring system rewards your ability to collect the multiplier bonuses without losing a life.<br/><br/><br/><br/><strong>Heist Of The Ninja</strong><br/>Directly from an alternative 1983, here is another single-screen game fully dedicated to the golden era fans! Help Koji, the ninja, in his heist mission by jumping the obstacles, shooting at the enemies, and digging into the environment for the scrolls he needs to steal! The mythological \"clean it all without getting caught\" pattern comes back armed with shurikens and other special bonuses! But there's more ... Those who in the eighties used to spend the afternoons at home trying to solve some Impossible Missions will find something very familiar in this game. For all pro gamers, the scoring system features various secret tactics to quickly accumulate more points and climb the leaderboard in ten scheduled rounds to give everything.<br/><br/><br/><br/><strong>Peng Peng</strong><br/>What about a cute game? A cute single-screen platformer game with a co-op possibility - wiping out monsters and collecting infinite quantities of fruits and sweeties? Yeah, Peng Peng will dive you back into that feelings, and it's designed for all kinds of players: casuals, speed-runners, and score catchers. The game system allows you to solve each round using speed or tactics. Two runs done by different players coming to the same point can gather \"extremely\" different scores depending on how they approach the game. Cross four different worlds to rescue the Frost Orb kidnapped by evil Von Pega. Try to dig out the secret rooms to get the hidden ending sequence! Meet the boss at the end of 10-rounds single world and prepare for a LOT of secret bonuses and special events!<br/><br/><br/><br/><br/><strong>BUT WAIT !! LAST BUT NOT LEAST !! WHAT'S COMING NEXT SHORTLY??!?</strong><br/><br/>Ladies and gents, meet Lyn, the vivacious player of Holua's arcade room! <br/><strong>Lyn is also the hero of FANTASY NETWORK</strong>, an upcoming high-resolution cartoonish metroidvania game. So TRY THE DEMO level hidden just outside the arcade room and uncover the connections between the arcade games and the overarching plot!<br/><br/>Holua's Arcades sales will support Fantasy Network development. Any feedback is much appreciated! <br/>And don't forget to wishlist Fantasy Network here!  https://store.steampowered.com/app/1492100/Fantasy_Network/<br/>Endless Thanks !!!", "metacritic": null, "released": "2023-09-01", "tba": false, "updated": "2023-09-04T03:35:42", "background_image": "https://media.rawg.io/media/screenshots/bff/bff0d3cc00753969d82b183ea017ffe2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 430, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Raven Travel Studios"], "genres": ["Action", "Indie"], "publishers": ["Raven Travel Studios"], "esrb_rating": null}