{"id": 965828, "slug": "the-last-exodus", "name": "The Last Exodus", "name_original": "The Last Exodus", "description": "The Last Exodus is a fast paced turn based strategy made as a sandbox experience.<br/>Game has multiple single player story-driven campaigns and a fast paced multiplayer mode where you can play cooperatively with your friends or competitively against your foes.<br/><br/>The Last Exodus will have multiple campaigns with persistent fleet where your units and tech from previous missions will be available to you in future ones.<br/>As you complete missions your technology will advance and your fleet will grow until you became the unstoppable force in the galaxy.<br/>Single Scenario mode will also include a hot seat mode where you can play with your friends on a single device.<br/><br/><br/><br/>Every player controls the fleet and the heart of that fleet is your mothership.<br/>Mothership is a massive capital ship on which you can build various subsystems which have different functions.<br/>Building subsystems on you capital ship you will be able to research new technologies, gather resources and produce various ships to strengthen your fleet.  <br/><br/><br/><br/>Technology is a very important aspect of the game. Not only will it increase strength of you ships and weapon systems but also unlock new options for designing a new blueprints of ships that can be deployed into battle.<br/><br/>Instead of being limited to a number of ship types in you roster, your fleet can adapt to new circumstances during the battle. So you will<br/>be able to customize your ship blueprints to better counter enemy fleet. Once you research new chassis and weapon systems, plating and engines, you will be able to combine them into a new killing machine.", "metacritic": null, "released": "2023-09-03", "tba": false, "updated": "2023-09-04T02:39:44", "background_image": "https://media.rawg.io/media/screenshots/4bb/4bb83e08ceeca95a8d8004a24769e956.jpg", "website": "https://www.the-last-exodus.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 460, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Logos Games"], "genres": ["Strategy", "Indie"], "publishers": ["Logos Games"], "esrb_rating": null}