{"id": 965839, "slug": "azorius", "name": "Azorius", "name_original": "Azorius", "description": "<h3>INTRODUCTION</h3>You will find yourself in the role of an adventurer who was thrown onto an island surrounded by water, where you will build your own settlement in the future.<h3>PROCESSING</h3>After some time spent on the island, you begin to realize that you need resources to create your first tool and cut down your first tree, you go outside your cozy island, collect branches, stones, sand, everything you need in your hard business.<br/><br/><h3>DUNGEONS</h3>Over time, you notice that for subsequent crafting you will need ore and you will try to find it in this world, but where to look for it? Right! In the dungeons filled with hordes of monsters, that's where you need to go!<br/><br/><h3>PUZZLE</h3>Going deeper into the dungeon, you notice strange stones with inscriptions on them, pressure plates and the like. You are trying to solve the riddle of this world, but ... you are not very successful, because a crowd of monsters follow you, which do not allow you to see the puzzles in detail.<br/><br/><h3>BATTLE</h3>Running from monsters all over the dungeon, you remember that you had a sword in your inventory, you gain courage and holding it with both hands, approach the first monster that caught your eye, after which you swing your sword, another .. and another .. ...until the monster falls to the ground, scattering coins and resources it found from previous adventurers.<br/><br/><h3>MAGIC</h3>A huge silhouette appears in front of your eyes, resembling the skeleton of an ogre, he moves towards you, holding a huge chain in his hand, your hands begin to tremble and you do not understand what to do, but ... Words that you read in one of the books appear in your head , it was a spell book, you start saying all this out loud and as a result, a fireball appears in your hand, which, with the movement of your hand, destroys the monster in front of you.<br/><br/><h3>BUILDING A SETTLEMENT</h3>After a long time in the dungeon, you get out with a lot of resources, now you can definitely build a few buildings for your settlement, you start working day and night, tirelessly and finally ... Here it is! Your first built building!<br/><br/>", "metacritic": null, "released": "2023-09-01", "tba": false, "updated": "2023-09-04T02:55:40", "background_image": "https://media.rawg.io/media/screenshots/b31/b311191f258c11bc26644d6d738131b7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Azathorn Game Studio"], "genres": ["Adventure", "Indie"], "publishers": ["Azathorn Game Studio"], "esrb_rating": null}