{"id": 965887, "slug": "sci-fi-builder", "name": "Sci-fi builder", "name_original": "Sci-fi builder", "description": "Sci-Fi builder is a Cthulhu mythos inspired simulator and third-person sandbox game defined by creativity and fantasy, it's a game where you can do whatever you want and create anything and everything. It's like a sandbox with a lot of items where you will entertain yourself starting from landing and to the very end, but what is the end? Well, you have to come up with yourself.<h3>STORY</h3>Play as the head manager in the completely new and empty space station in the planet number 1188 in the Constellation Centurion. Your task is to make here a new thriving colony. The gameplay begins with the landing on the space station, you are alone here and have to make a create job to build your own world and hire other characters. A short list of tasks at the very beginning will help you to learn more about the game functions. You will find out how to go to certain room, put props, teleport NPC, like humanoids, alien races, creatures and robots, set up interaction between the NPC and main character, other NPC and props, so you can easily build your own world.<br/><br/>Please remember, that game is in Early Access, and I will add a lot of new modules into it. And it depends on you, what modules it would be. Please, go to the discussion's sections and post all of your notes and ideas there.<br/><br/>Turn on your creativity, in Sci-fi builder, you are free to do whatever you want.<br/>Arrange all elements the way you want. No placing by the grid - complete freedom of action. If you don't like where you put a piece of furniture, just move it or remove it at any time. No limits on the number of objects in the room. If you do not like the main colors of your space station or any item's color, you can easily change it in the color settings. In the light settings menu, you can change the light in the whole station and adapt it to your needs.<br/><br/>Sci-fi builder is a simulation game about building sci-fi rooms and station and create your own society. A huge selection of characters, whom you can give commands, devices which you can manage, furniture, construction elements, computers and other interior details await you.<h3>GAMEPLAY</h3>Enjoy over hundreds of different characters which you may use as the main character or NPC in the game. Players can freely guide character movements and interact with the objects to influence character reactions. Every room is fully sounded and contains a variety of action options.<br/>Personalize the characters, manage their wardrobe and decide how they will behave.<br/><br/>Good luck in your new life in a space station!", "metacritic": null, "released": "2023-09-01", "tba": false, "updated": "2023-09-04T04:21:27", "background_image": "https://media.rawg.io/media/screenshots/d5e/d5ecfc3b5fa7c5719f37b60a4c408d72.jpg", "website": "https://t.me/bestpcgamesforfun", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 415, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Games For Pleasure"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["Games For Pleasure"], "esrb_rating": null}