{"id": 965816, "slug": "the-riflemen", "name": "The Riflemen", "name_original": "The Riflemen", "description": "The Riflemen is a fun, fast-paced low poly first-person shooter where matches are short and full of action! All players start with bolt-action rifles that they don’t need to reload. Players can customize their weapons and characters to get the look they want.<br/><br/><strong>Play like you want</strong><br/><br/>There's something for everyone with 2 game modes and 4 game types that you can mix how you like.<br/><br/>Choose from familiar game modes like Team Deathmatch or Domination and affect the gameplay by selecting the game type you want. You can disable the supply drops in Barebones to get only bolt-action rifle action or make it even more competitive with the Hardcore type where every hit will be an insta-kill!<br/><br/><br/><br/><strong>Gunplay</strong><br/><br/>The Riflemen is a battle of skills and a true trial of friendships. Aim, shoot, reload, and repeat — no automatic weapons, only tough-ass action. Headshots make your opponents go sleepy-time at once and supply drops might bring you a shotgun, a sniper rifle, a bazooka, or even a katana.<br/><br/><ul><li> All players start with bolt-action rifles &amp; knives<br/></li><li> Headshots kill with one shot<br/></li><li> No manual reloading is needed</li></ul><br/><br/><br/><strong>Customization</strong><br/><br/>With DLC, you are able to level up your character all the way up to 100 levels! Unlock new skins for your weapons &amp; character and make yourself comfortable. Weapons can be customized so that you can select from different wood and metal skins and combine them the way you like!", "metacritic": null, "released": "2023-09-01", "tba": false, "updated": "2023-09-04T02:22:43", "background_image": "https://media.rawg.io/media/screenshots/07b/07b4de07f577bdf782f65d0ec493cec8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 17, "dropped": 1, "playing": 1}, "playtime": 2, "achievements_count": 13, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Normogames"], "genres": ["Action", "Casual"], "publishers": ["Bonus Stage Publishing"], "esrb_rating": null}