{"id": 965896, "slug": "the-golden-eyed-ghosts", "name": "The Golden Eyed Ghosts", "name_original": "The Golden Eyed Ghosts", "description": "The Golden Eyed Ghosts is a dark fantasy soulslike heavily influenced by the legacy of Zelda adventures, set in the crumbling kingdom of Andromeda. Ancient, macabre secrets lurk beneath the kingdom's surface threatening its very existence. Take up Orion’s exiled mantle to brave the kingdom’s dangers, recover the four legendary stolen swords, and save it all from certain doom.<br/><br/>Things aren't always what they seem in Andromeda. Countless secrets and things best left forgotten are buried beneath the earth. If not too careful... Orion might find himself struggling inside a web of secrets, lies, and mysteries. Because...<br/><br/><br/><br/><br/>Decisions dictate the way forward. Do you hack and slash your way through? Or look for a way to avoid needless slaughter? Do you heal yourself with the life energy of those you run through with your sword? Or retreat and find a moment of peace among strangely familiar grindstones? Perhaps the choice is to mix and match, adapting Orion’s kit to face down any form of foe. But try as you might, no matter if traveling sinister forests, glittering icefields, murky bogs, or decaying cities...<br/><br/><br/><br/><br/>The choices made in combat pale in comparison when it comes to the real gut-wrenching, world-changing decisions. Track down a dastardly thief, befriend a suffering maiden, or aid a desperate father. Will they trust you? Can you trust them? Maybe a favor will be returned, or maybe betrayal is afoot.<br/><br/>Perhaps it's better to just leave this crumbling kingdom to its own devices and let the madness and eldritch energies consume the realm. After all...<br/><br/><br/><br/><br/>Orion is a man on a quest, but he's no hero. He's just one of the many derelict denizens of the fallen Andromeda empire, struggling to survive in a moribund world. Join him on the journey to find a way forward in classic Metroidvania fashion. Face seemingly insurmountable odds and struggle to survive festering beasts, hideous machinations, and abyssal horrors of an ancient world...", "metacritic": null, "released": "2023-10-30", "tba": false, "updated": "2023-11-03T16:44:48", "background_image": "https://media.rawg.io/media/screenshots/f21/f21997f38c51de38e69e4d32854aa5d5.jpg", "website": "https://thegoldeneyedghosts.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Syphono4"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Freedom Games"], "esrb_rating": null}