{"id": 96590, "slug": "blue-lacuna", "name": "Blue Lacuna", "name_original": "Blue Lacuna", "description": "<p><em>Blue Lacuna</em> is among the largest text-based interactive stories ever produced, a full-length novel and adventure game in one. As a wayfarer, you will find new worlds to explore, complex characters to befriend or anger, choices to make that affect the fate of worlds, and a story whose ultimate meaning and resolution is defined by you.</p><p>A 2010 IndieCade Finalist, <em>Blue Lacuna</em> was more recently named one of the top 10 interactive fiction titles of all time by the intfiction.org community.</p><p><strong>Features:</strong></p><ul>\n<li>DYNAMIC ROOM DESCRIPTIONS that change based on the time of day, weather, tides, and what you've learned. Explore the island of Lacuna plus four other worlds.</li><li>COMPLEX CHARACTERS who can converse, remember, form opinions, and follow their own agenda. You'll develop a unique relationship with the game's characters that affects which of them are most important to your own personal story.</li><li>A NOVICE-FRIENDLY KEYWORD NAVIGATION SYSTEM that simplifies input by using the same syntax for moving, examining, and conversing. Other ease of use features include a built-in tutorial, smarter command parsing, more helpful error messages, and typo correction.</li><li>DITCH THE COMPASS and navigate via relative directions, landmarks, following other characters and approaching distant items.</li><li>A DRAMA MANAGER that tries to detect when you're getting stuck or bored and introduces new story elements to provide hints.</li><li>CHOOSE BETWEEN STORY MODE OR PUZZLE MODE to experience <em>Blue Lacuna</em> the way you like best.</li><li>By award-winning interactive story author Aaron A. Reed (<em>Ice-Bound</em>, <em>18 Cadence</em>, <em>Almost Goodbye</em>, <em>Prom Week</em>)</li></ul><p><strong>Quotes</strong></p><ul><li>\"If the creators of Zork or Witness had a copy of Blue Lacuna travel back in time and appear on their computers, <strong>they would have wept openly</strong>.\" -- G4 TV</li><li>\"...one of those rare experiences that turn your set of assumptions about a medium on its head. ...<strong>as close to 'interactive literature' as I've ever seen in gaming</strong>.\" -- Jay Is Games</li><li>\"There is no separation between the way the player engages in narrative and the way he engages in gameplay. There are no cut scenes, no uninteractive passages, no portions where the characters are essentially 'switched off' and indifferent to what the player does. Everything counts. <strong>Everything is part of the story</strong>.\" -- Emily Short, Gamasutra</li></ul>", "metacritic": null, "released": "2014-09-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/725/725aaf43f3e38123046c7084d9e3506e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Aaron A. Reed"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}