{"id": 965996, "slug": "aatral", "name": "Aatral", "name_original": "Aatral", "description": "In the mystical lands of ancient India, a tale echoes through the ages. It tells of a mighty king named Vallaan, who embarks on a perilous journey to an English kingdom in order to rescue his beloved queen, Alli. Little did he know, the Eng Empire was plagued by a sinister force, infecting its every corner and subjecting its people to the rule of malevolent powers and terrifying creatures. Will King Vallaan's courage and determination be enough to overcome the darkness and save his queen, or will they both succumb to the evil that lurks within the English kingdom's walls?<br/><br/><ul><li><strong>A Fierce full warrior</strong> - Vallaan is a fierce warrior, wielding powers of mythic proportions. In the action-adventure gaming world, he showcases gravity-defying acrobatics, ferocious fighting skills, and even the ability to bend time to fulfill his destiny.</li></ul><br/><ul><li><strong>Mystical landscapes and sprawling realms</strong> - In this action-adventure gaming experience, players will have the opportunity to uncover the mysteries of exotic worlds and vast kingdoms. From the ancient realm of Tamil Nadu to the mythical and deadly English Empire, there is a staggering array of landscapes and kingdoms to explore and conquer.</li></ul><br/><ul><li><strong>Define your own combat style with the Free-Form Fighting System</strong> - An intricate new combat system lets you wage battles with no boundaries. Utilize the environment, weapons, and your enemies themselves to develop your own unique fighting style. Plus, a strategic projectile attack system allows for a variety of ranged combat tactics.</li></ul>", "metacritic": null, "released": "2023-09-05", "tba": false, "updated": "2023-09-08T03:35:13", "background_image": "https://media.rawg.io/media/screenshots/9a8/9a861cc75e4329552260d78f001f46d7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 353, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Exio Entertainments"], "genres": ["Action", "Adventure"], "publishers": ["Exio Entertainments"], "esrb_rating": null}