{"id": 966004, "slug": "girl-genius-adventures-in-castle-heterodyne", "name": "Girl Genius: Adventures In Castle Heterodyne", "name_original": "Girl Genius: Adventures In Castle Heterodyne", "description": "<h3>ACTION, RRRRRROMANCE (pronounced like Provence) and MAD SCIENCE!</h3>Discover the award winning, gaslamp fantasy world of “Girl Genius™”! Experience Agatha Heterodyne’s story, as she navigates the hostile hallways, catacombs and kitchens of her ancestral home, Castle Heterodyne.<br/> <br/>As the Lost Heir to a mad family, she must return the ancient fortress to its former glory and ascend the throne as a \"True Heterodyne\". Only then can she stand up to the might of the Wulfenbach Empire and other power hungry usurpers. But first, she has to contend with a corrupted and insane AI controlling the castle, its spiky death traps, and bottomless doom-pits. Not to mention the painfully pink  cherry on top, Zola Heterodyne. Another lost child? Or just another villain here to steal your thunder.<br/><br/>Time to find out.<br/><br/><h3>Gameplay</h3><br/><ul><li>Build tools like the Grapple Gun and the Wrencherang at the Workbench, and use your tools to explore and solve the castle’s challenges.<br/></li><li>Discover numerous sights and secrets, by being perceptive and using your tools to the fullest.<br/></li><li>Defeat foes in furious melee combat or with explosive gadgets, and utilize the environment to your advantage using your tools.<br/></li><li>Use your trusty Dingbot minion to explore places Agatha can’t reach, by moving in tight spaces, digging beneath or soaring above danger. <br/></li><li>Use the Dingbot to solve lock puzzles, and operate the internal machinery of the castle.<br/></li><li>As Agatha’s power over the castle grows, command the castle AI to release traps at your foes, and activate mechanisms.<br/></li><li>Use the unique “Build System”, rebuilding scrap traps into objects like the Springclank, Grappleclank and the special Rollerclank, giving the player a suite of tools for creative spatial puzzle solving.<br/></li><li>Interact with several of the fantastic characters from “Girl Genius™”, like Gilgamesh Wulfenbach, Tarvek Sturmvoraus and many others.<br/></li><li>Read the Girl Genius™ graphic novels in the game! Note! This feature is in English only.</li></ul><br/>", "metacritic": null, "released": "2023-09-04", "tba": false, "updated": "2024-03-09T07:10:42", "background_image": "https://media.rawg.io/media/screenshots/8d6/8d611ac48bd842f0d03a1b0315ee671b.jpg", "website": "https://rain-games.com/games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 395, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "macOS", "PC"], "developers": ["Rain Games"], "genres": ["Action", "Adventure"], "publishers": ["Rain Games"], "esrb_rating": null}