{"id": 966059, "slug": "march-of-tulpasxanadu", "name": "March of Tulpas:Xanadu", "name_original": "March of Tulpas:Xanadu", "description": "<strong>Lies, delusions, become the light that shines on the truth too.</strong><br/><br/><strong>■About This Game</strong><br/>This game is a remake of the traditional turn-based RPG 『March of Tulpas』 that I made in 2021.<br/>This game has added new dungeons and items, and the art and performances have been refreshed and remade.<br/><br/><br/><strong>■Game System</strong><br/>The game stage is an infinite looping world that will end on the third day.<br/>If you fight with the enemy, time will be consumed, and you will return to level 1 at the end of the third day.<br/>However, the skills learned and the powerful equipment collected will not disappear.<br/>The materials collected in various places in the game can permanently increase the character attributes.<br/><br/><br/><strong>■Battle System</strong><br/>The main means of recovery in this game is to \"bite\" the enemy.<br/>After letting the enemy enter the special debuff \"dignity break\", you can bite the enemy and restore HP.<br/>Other means of healing is almost nonexistent, so how to effectively use the bite to renew is the main point of this game's strategy.<br/><br/>Teammates who join the team have different unique abilities.<br/>Like \"low probability of action twice\", \"easy to become a target\", \"magic immunity\", etc.<br/>You need to change your teammates according to the characteristics of various mazes to reduce the consumption in order to successfully clear the dungeon.<br/><br/><br/><strong>■Story</strong><br/>The main character is a boy named \"King of Paradise\".<br/>Without any antecedents, he awakens on an unknown throne.<br/><br/>Walking out of the room, he met a creature named \"Path Case\".<br/>She said that the King of Paradise had an important mission,that he needs to go everywhere to gather his teammates and partners.<br/><br/>The King of Paradise is a \"Tulpamancer\".<br/>He can generate and summon imaginary friends \"Tulpa\" to help him.<br/>The first half of the story is mainly about collecting \"Tulpas\" as teammates.<br/>When the teammates are all there, the story will take a huge turn.<br/><br/><br/>Why is this world in an infinite loop?<br/>What is the mission of the Paradise King?<br/>What is the secret of the Tulpamancer?<br/><br/><br/>The source of power is love.<br/>You will know what this means at the end of the story.", "metacritic": null, "released": "2023-09-07", "tba": false, "updated": "2023-09-08T05:00:18", "background_image": "https://media.rawg.io/media/screenshots/f49/f49fd9620eea9a04d8866015a18b487c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 396, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ローゼンクロイツ", "Rosenkreutz", "蔷薇十字", "薔薇十字"], "genres": ["RPG"], "publishers": ["ローゼンクロイツ", "Rosenkreutz", "蔷薇十字", "薔薇十字"], "esrb_rating": null}