{"id": 966140, "slug": "roundrunners-playground", "name": "RoundRunners Playground", "name_original": "RoundRunners Playground", "description": "Load into a random map in the middle of the lobby to play game modes inspired by the classic tag. Each match has a chance for a random effect to happen. This will alter the gameplay in a special way, like making everyone faster, lowering gravity, or making everyone colorblind. It's an easy-to-pick-up game that allows for the possibility to improve your skills through rolling, bunnyhopping and climbing. It's perfect if you're looking for something easy to play with possibilities for improving your skills.<br/><br/><h3>Engage in thrilling game modes, like:</h3><strong>Freeze-Tag</strong>: Take on the role of a tagger, freezing everyone you touch, or work as a team as a runner to rescue frozen teammates while evading the taggers' icy grasp.<br/><strong>Bomb-Tag</strong>: Race against the clock as the tagger passes a ticking bomb to other players. Avoid being caught with the explosive device when it goes off!<br/>And of course <strong>classic tag</strong>.<br/><br/>Play with a twist with the possibility of random effects to happen. Each random effect will create new possibilities and difficulties. To overcome these difficulties, you will have to make the map your playground.<br/><br/><br/>Everything is connected as the random map (test chamber) will always load and unload in the middle of the lobby. This allows players who join late to watch the spectacle of the match happening through the windows.<h3>Key Features:</h3><ul> <li>Multiple Game Modes: Choose from different game modes, including traditional tag, freeze tag, bomb tag and more, each offering a distinct twist to the gameplay.<br/> </li><li>Unpredictable Random Effects: Mr. Man's experiments result in unexpected effects that can significantly alter the gameplay, making every match a unique experience.<br/> </li><li>Semi-Random Map Generation: Experience dynamically generated test chambers, where the layout and structure are partially randomized, ensuring fresh and exciting gameplay with each match.<br/> </li><li>Online Multiplayer: Compete against friends or random players in intense tag battles to prove your skills and become the ultimate RoundRunner.<br/> </li><li>Full Bot Support: Fill up the lobby with AI-controlled bots that react to the random effects and game modes, ensuring a lively and dynamic gameplay experience even when playing offline.<br/> </li><li>Customize Your RoundRunner: Personalize your character with various customization options, making your RoundRunner unique.</li></ul><br/>Become the best roundrunner out there!", "metacritic": null, "released": "2023-09-08", "tba": false, "updated": "2023-09-11T02:51:13", "background_image": "https://media.rawg.io/media/screenshots/fbb/fbb200e53be94cbbb8d735b176e096c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vibrant Pixel Productions"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Vibrant Pixel Productions"], "esrb_rating": null}