{"id": 966122, "slug": "beast-slayer-2", "name": "Beast Slayer", "name_original": "Beast Slayer", "description": "In Beast Slayer, you will embark on a thrilling adventure in an 8-bit open world where monsters roam free. As a skilled hunter, your mission is to track down and defeat the most dangerous beasts, each with its own unique strengths and weaknesses. With 8 different classes (and genders) to choose from, with varying skills and spells, each time you play will be different. You'll be able to create the character of your dreams. Plus you get to feel the retro nostalgia as you listen to an epic 8-bit soundtrack while flying on the wings of a dragon.<br/><br/>Explore a vast and varied landscape, from lush forests to icy tundras and scorching deserts, as you search for your prey. But be careful, as the monsters are not the only threat - you'll also have to navigate treacherous terrain and fend off rival hunters who are after the same legendary beasts. So gear up, sharpen your skills, and embark on an epic hunt for the rarest and most powerful beasts in Beast Slayer.<br/><br/>Beast Slayer was designed to feel like it was made in a bygone era. Everything was specifically chosen to feel retro, and designed to fit right at home on a classic gaming system. With a retro-inspired 8-bit soundtrack, colorful pixel graphics, and graphical details that fit the time period.. Beast Slayer will take you back to a different time: all while being fresh and new with features found in the latest open world RPGs. Build a home. Cook food to prepare for the latest dungeon trek. Pick up side missions. Get married. Explore the world.<br/><br/>Players will have a choice from 8 classes with distinct benefits and abilities. There are masculine and femine designs for each class. This means there are 16 different character appearance options. Marriage is open and you can marry any gender you please. <br/><br/><br/>Features:<br/><ul><li>Explore an open world.<br/></li><li>8 classes with a masculine or female design choice for the main character.<br/></li><li>Get married. Marriage options for both genders, and no restrictions on who can marry who.<br/></li><li>Clear dungeons and take on quests.<br/></li><li>Build a home.<br/></li><li>Fly a dragon.<br/></li><li>Complete a main quest line and side quests.<br/></li><li>Cook food and purchase ingredients.<br/></li><li>8-bit soundtrack and sound effects.<br/></li><li>And many more features!</li></ul>", "metacritic": null, "released": "2023-09-07", "tba": false, "updated": "2023-09-11T02:29:11", "background_image": "https://media.rawg.io/media/screenshots/585/5851ec96b07246481b95d4b37a1828f1.jpg", "website": "https://solohack3r.my.canva.site/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Solohack3r Studios"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["Solohack3r Studios"], "esrb_rating": null}