{"id": 966115, "slug": "sex-with-ogre", "name": "Sex with Ogre 😈🍆👩", "name_original": "Sex with Ogre 😈🍆👩", "description": "Dive into a captivating world of enchantment and discovery in our visual novel, \"Sex with Ogre 😈🍆👩\" Immerse yourself in a unique narrative experience that blends whimsy with intrigue. Explore the hauntingly beautiful forest as you follow the journey of Alice, a young girl who stumbles upon an unlikely companion in her quest to find her way home.<br/><br/><strong>Story</strong><br/><br/>Embark on an unforgettable adventure alongside Alice, an intrepid young soul with a heart full of courage. Stranded and disoriented in a mysterious forest, Alice encounters a world both enchanting and treacherous. As she navigates this otherworldly realm, she crosses paths with a formidable Ogre whose intentions remain shrouded in uncertainty.<br/><br/>Set against the backdrop of a haunting forest, Alice's journey unveils secrets that intertwine her fate with that of the enigmatic Ogre. As their paths entwine, you'll unravel a tale of camaraderie, unexpected alliances, and the resilience of the human spirit.<br/><br/><strong>Features</strong><br/><br/>- Engaging Visual Novel: Immerse yourself in a beautifully illustrated world, rich with captivating visuals that bring the story to life.<br/>- Compelling Narrative: Navigate through an intricate storyline filled with unexpected twists, as you forge connections with unique characters.<br/>- Unveil Mysteries: Discover the secrets hidden within the forest's depths and unearth the truth behind Alice's journey.<br/>- Evolving Characters: Witness Alice and the Ogre undergo transformative journeys, evolving through challenges and unexpected revelations.<br/>- HD renders<br/>- Intriguing story<br/>- Explicit scenes<br/>- Can be played with one hand", "metacritic": null, "released": "2023-09-08", "tba": false, "updated": "2023-09-11T02:19:34", "background_image": "https://media.rawg.io/media/screenshots/00c/00c320be0b46ee8b467b63e4a4abe629.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ogre Games"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Ogre Games"], "esrb_rating": null}