{"id": 966156, "slug": "star-farmer-prologue", "name": "Star Farmer: Prologue", "name_original": "Star Farmer: Prologue", "description": "This is the free version of <strong>Star Farmer: Warlock of the Universe</strong>, a bullet heaven farming game where you dash across the galaxy.<h3>Star Farmer: Prologue Features</h3>Star Farmer: Prologue is a part of the full version of the upcoming game, <strong>Star Farmer: Warlock of the Universe</strong>, and it includes:<br/><ul><li>2 acts from the full version of the game (from a total of 5)<br/></li><li>Over 100 powers to take advantage of on your runs<br/></li><li>Cutscenes and story moments covering the early portion of the game<br/></li><li>3 unlockable Warlock Powers <br/></li><li>Herbarium<br/></li><li>6 audio logs to collect<br/></li><li>Full farming gameplay for 6 different plant types<br/></li><li>A save file that is shared with the full version of the game<br/></li><li>Collectable furniture for your ship<br/></li><li>An upgradeable character and ship to a fifth of the power of the maximum in the full version of the game</li></ul><br/>As a Warlock, fund your expedition to discover rare and powerful flora through your participation in the lucrative profession of space farming. Build the ultimate space farm as you explore the galaxy and stumble onto the mystery of a dead planet. Cultivate exotic plant life, trade your harvests for credits, and customize your runs with unique powers in this roguelite adventure.<h3>Harvest the Cosmos</h3>Venture into uncharted territories and gather an array of seeds and rare materials in diverse environments. <br/><br/><h3>Cultivate Your Bounty</h3>Return to your trusty spaceship and transform your harvested resources into flourishing crops. Create the ultimate interstellar farm.<br/><br/><h3>Warlock Life</h3>On your travels, find rare and powerful flora you can bring back to your den. These plants can then be utilised to give you powerful boons on your runs.<br/><br/><h3>Trade Among the Stars</h3>Encounter wandering traders during your galactic escapades and strike deals to sell your meticulously grown produce for valuable credits. <br/><br/><h3>Decorate Your Ship</h3>Find furniture on your expeditions and bring them back to spice up your farm.<br/><br/><h3>Upgrade Your Cosmic Expedition</h3>Harness the power of your hard-earned credits to enhance yourself and your spaceship.<br/><br/><h3>Unravel the Secrets</h3>Immerse yourself in a captivating story that unravels the mysteries of a long-dead planet. The fate of this forgotten world lies in your hands.<br/><br/><h3>Features</h3><ul><li>Auto-firing weapons<br/></li><li>Fast runs (under 15 minutes)<br/></li><li>Over 100 unique powers available to customise your runs<br/></li><li>Find furniture and cuddly companions on your runs to take back to your ship<br/></li><li>Expand your farm, recruit drones to aid you in the busy work, and use your profits to increase the power of your character<br/></li><li>Each run takes you to many different planets, survive waves lasting 20-40 seconds and harvest as much as you can in that time</li></ul>", "metacritic": null, "released": "2023-09-08", "tba": false, "updated": "2023-09-11T03:21:14", "background_image": "https://media.rawg.io/media/screenshots/e8f/e8fc305f413ddbfc5e8bd460c6e1902e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tinker Town"], "genres": ["Action", "RPG", "Casual", "Indie"], "publishers": ["Tinker Town"], "esrb_rating": null}