{"id": 966127, "slug": "secrets-of-the-haunted-mansion", "name": "Secrets of the Haunted Mansion", "name_original": "Secrets of the Haunted Mansion", "description": "\"Secrets of the Haunted Mansion\" is an immersive interactive adventure game that transports players into the dark and mysterious world of an abandoned and haunted estate. Step into the shoes of an explorer, ready to unearth forgotten secrets and unravel intriguing puzzles.<br/>\n<br/>\r\nKey Features:<br/>\n<br/>\r\nExploration: Traverse through old corridors and antique chambers as you delve into the uncharted corners of the haunted mansion. Keep a keen eye out, as every nook and cranny might hold clues or hidden objects crucial to solving the mysteries.<br/>\n<br/>\r\nPuzzle Solving: Embrace the intellectual challenge by solving diverse logical puzzles, riddles, and enigmas. Discover the estate's past secrets, decipher ancient manuscripts, and unveil encrypted messages that lead to the next stages of the adventure.<br/>\n<br/>\r\nHidden Object Hunting: Scrutinize meticulously designed locations to find hidden objects and clues. Sometimes, key narrative elements might be cleverly concealed, so attentiveness and perception are essential.<br/>\n<br/>\r\nNarrative and Atmosphere: Immerse yourself in the dark and captivating world of the abandoned mansion. As you uncover secrets, you'll encounter past residents and learn their stories. Engaging storytelling, polished graphics, and soundscapes create a unique and immersive atmosphere.<br/>\n<br/>\r\nIntricate Plot: Uncover ever-deeper mysteries that lead to increasingly intriguing stages. Get to know characters from the past, uncover their motivations, and uncover their connections to the haunted estate.<br/>\n<br/>\r\nAre you prepared to enter the heart of this enigmatic tale and unravel the \"Secrets of the Haunted Mansion\"? It's time to put your detective skills to the test and unearth the hidden secrets that this forsaken residence conceals.", "metacritic": null, "released": "2023-09-10", "tba": false, "updated": "2023-09-11T02:34:46", "background_image": "https://media.rawg.io/media/screenshots/bf7/bf7723df9285d53a5eedf6722095b5a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WulwArtGames"], "genres": ["Action", "Adventure", "Simulation", "Casual", "Indie"], "publishers": ["WulwArtGames"], "esrb_rating": null}