{"id": 966174, "slug": "mage-of-the-olekta-desert", "name": "Mage of the Olekta Desert", "name_original": "Mage of the Olekta Desert", "description": "Aisha, a crafty, quick-witted thief in the Adventurer's Guild, takes on a mission to deliver a letter to a mage who lives in the infamous Olekta Desert. To reach him, she must get through a heavily guarded cavern, traverse perilous, trap-filled ruins, and defeat unhinged bandits and cultists. Along the way, there will be many dangers... perhaps even a dreadful dragon. Will Aisha be able to survive and find her way to the mage safely?<br/><br/><br/>In this turn-based puzzle RPG, you control Aisha and try to solve the mysteries of the Olekta Ruins. Don't forget that you'll have limited equipment and gear! Also, fighting head-on isn't exactly Aisha's forte, so you'll have to be creative in finding your way through the safeguarded caverns, ruins, and traps within. <br/><br/>Invest points into Aisha's assassination skills to deal with enemies directly, or simply get around by sneaking past any possible threat! She can also learn other skills that help her avoid fights! There are many paths you can take to complete her mission.<br/><br/><br/><br/><br/><br/><br/>How you enjoy Mage of the Olekta Desert is entirely up to you. You can stealth your way through the entire game, or fight everything in sight! Each playthrough is a new, exciting adventure. If you lose and Aisha is captured, you can even get a glimpse into her life as a slave.<br/><br/><strong>Multiple Ways to Clear the Game</strong><br/>Aisha can complete her mission in a multitude of ways. Will she take a dangerous approach or play it safe? Who will she side with? Who will she help? Will she unravel the mysteries of the ruins or avoid them entirely? The choice is yours! Take advantage of Aisha's training as a thief to reach your goals!", "metacritic": null, "released": "2023-09-08", "tba": false, "updated": "2023-09-18T04:47:53", "background_image": "https://media.rawg.io/media/screenshots/83c/83c487de852daf9f8f545dacf8eeb9bf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["baron sengia"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Kagura Games"], "esrb_rating": null}