{"id": 966223, "slug": "kaikan", "name": "KAIKAN", "name_original": "KAIKAN", "description": "A vertically scrolling shooter where you mow down enemies that stand in your way.<br/>Aim for a high score with items that appear by destroying enemies and bonus items that can be obtained by using bombs.<br/><br/><strong>game description</strong><br/>Destroy an enemy to release a bonus item.<br/>Bonus items can be attracted to your aircraft when you release the shot button,<br/>If you press the shot button while sucking, it will fall again.<br/>Collecting bonus items will raise the item rank and increase the number of bonus items.<br/>Your score will increase, but if you miss it, your rank will drop.<br/><br/>Hitting an enemy with a bomb releases a bonus item for the bomb.<br/>When you fire a bomb, the enemy bullets on the screen will be converted into a bomb bonus item.<br/>If you get hit while you have a bomb, you lose the bomb, but an auto-barrier is activated.<br/><br/><br/><strong>You can choose from 6 types of aircraft, and the characteristics and behavior of weapons change when moving at low speed.</strong><br/>typeA: Napalm that explodes when it hits an enemy<br/>typeB: Wide shot that can attack in a wide range<br/>typeC: Homing that tracks the enemy<br/>typeD: Fire that attacks to cover the screen<br/>typeE: Blast that emits high power<br/>typeF: A ball that rotates around itself and erases enemy bullets<br/><br/><br/><strong>Changes from the free version</strong><br/>・Correspondence to STEAM ranking by improving the function of the production tool<br/>・Fixed the performance of own machine other than wide shot type<br/>・Abolish left and right free scrolling, widen the screen, and remove the off-screen item radar<br/>・Display the position of falling score items<br/>・Display the position of your aircraft on the mini-map<br/>・Changed the counter during true boss battles to \"total of boss destruction items (BOSS MEDAL) on each side\"<br/>・Changed to not being able to continue after entering the true boss battle (according to that, the no continue bonus has been abolished)<br/>・Changed so that you can practice in practice mode as long as you enter the true boss battle (true boss achievements cannot be unlocked in practice mode)<br/>・Changed 2 types of hidden aircraft that were unlockable to be usable from the beginning.<br/>・Blur effect is used for production (parts related to game play can be turned off)<br/>・Change all BGM<br/>The latest free version was ver2.4, but I started over from 1 as (verS~)", "metacritic": null, "released": "2023-09-14", "tba": false, "updated": "2023-09-15T02:42:48", "background_image": "https://media.rawg.io/media/screenshots/18d/18d4d170656bf215e5242c5d5df49dd5.jpg", "website": "http://zakichi.ojaru.jp/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["zakichi"], "genres": ["Action"], "publishers": ["zakichi"], "esrb_rating": null}