{"id": 966241, "slug": "tales-from-the-arcade-starship-murder", "name": "Tales From The Arcade: Starship Murder", "name_original": "Tales From The Arcade: Starship Murder", "description": "Tales From The Arcade: Starship Murder is an experimental murder mystery roguelite in which the killer changes every time you play.<br/><br/><br/><br/>The astro hauler the SS Persephone is falling apart. You - the on-board AI - are being reactivated to perform the necessary repairs. The crew claims that the captain died in a mysterious accident, the same one that conveniently erased your memory banks. Who is telling the truth and who is just trying to buy time to finish the job they started? Welcome, to Starship Murder.<h3>Features:</h3><ul><li>Artificial Intelligence Perspective - become the AI of a starship.<br/></li><li>Experimental Gameplay - balance searching for the killer with repairing the ship.<br/></li><li>Digital Thriller - experience an atmosphere of tension and mistrust.</li></ul><br/><br/><br/><br/>Making games can wear you down. A few months back as a break from our main project we created a little free game - Hank: Straightjacket. The experience was so invigorating that we decided to repeat this exercise whenever we get burned out. In the weeks before this year’s Summer Steam Next Fest once more we felt exhausted… And so… we took a breather and made Starship Murder. This game is an experiment in creating tension. We’re not exactly sure how people will interact with it :D If you’d like to share your playthrough we would be very happy to watch or read or hear about your experiences in any way.", "metacritic": null, "released": "2023-09-11", "tba": false, "updated": "2023-09-15T03:05:24", "background_image": "https://media.rawg.io/media/screenshots/832/832cb3142e79fc4805870d10af8b05f2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["My Next Games"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["My Next Games"], "esrb_rating": null}