{"id": 966225, "slug": "the-capture-games", "name": "The Capture Games", "name_original": "The Capture Games", "description": "Come one! Come all! Gather around for another exciting round of The Capture Games! Our specially chosen contestants are dropped onto a special island filled with traps. If she can find all four pieces of the exit code, she will win more money than you can imagine! Alongside these traps, we’ve deployed horny hunters and dastardly drones to join in the games. If they manage to wear her down, they’ll get to keep her as their very own prize!<br/><br/>These three ladies think that they can beat The Capture Games. Will they get their hands of the big cash prize, or will they end up fucked and humiliated like every single other contestant? May the luck be forever in their favor!!<br/><br/><strong>Rougelike 3D Action!</strong><br/>Navigate the ever-changing island in search of a way to escape. With each experience being different, there’s never a dull moment in The Capture Games. The hunters and traps in each area are also randomized each run, so even familiar scenery might not be so familiar...<br/><br/><strong>Treasures and Relics!</strong><br/>Find tons of delicious food to buff your stats and keep your Stamina up as you go! If you’re lucky, you’ll find a powerful Relic that you can use your prize winnings to unlock. You’ll need the help of these stat boosts and Relics if you want to come out on tip.<br/><br/><strong>Transformations! Bondage!</strong><br/>The island is littered with mysterious potions that transform those who drink them in the most bizarre and erotic ways. While temporary, they can provide an advantage for those willing to humiliate themselves by drinking them. Snare traps and Bondage traps, on the other hand, wrap you up and hinder your progress. Getting caught while vulnerable in these states are a bad idea. Watch out!!!<br/><br/>Game Modes galore! Think you can handle The Capture Games? There’s many ways to mix things up with special rule sets once you’ve proven that you can handle it. More drones to hunt you down? Better enemy vision? Pick your poison, if you dare.<br/><br/><br/>Controls:<br/><br/><strong>Arrow Keys or Left Mouse Click</strong> - Move <br/><strong>Enter or Z or Left Mouse Click</strong> - Confirm<br/><strong>Esc or X or Right Mouse Click</strong> - Cancel or Menu<br/><strong>Shift Key (Hold)</strong> - Sprint/Move Fast", "metacritic": null, "released": "2023-09-14", "tba": false, "updated": "2023-09-15T02:45:34", "background_image": "https://media.rawg.io/media/screenshots/354/354db6211aff50613415fa02e226fcd4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Overlord Empire"], "genres": ["Action"], "publishers": ["Overlord Empire"], "esrb_rating": null}