{"id": 966273, "slug": "logiart-grimoire", "name": "Logiart Grimoire", "name_original": "Logiart Grimoire", "description": "<h3>Story</h3><br/>You, who have taken hold of the Logiart's grimoire, encounter Emil, the custodian of the grimoire.<br/><br/>Originally, it is a magical book that can solve \"Logiart,\"<br/>but the cast magic has gone awry, transforming it into an enigmatic tome.<br/>Most of the \"Logiart\" can no longer be unraveled.<br/><br/>As one led by the Logiart's grimoire, you can solve the mysteries of the book and once again restore the ability to solve \"Logiart.\"<br/>Let's work together with Emil to unravel the mysteries of this mysterious grimoire and restore it to its original state.<h3>Features of the game.</h3><br/><strong>Logiart</strong><br/>Logiart is a \"Picture Logic Puzzle\" that uses vertical and horizontal numbers as hints to complete illustrations.<br/>It has simple and easy-to-understand rules, making it accessible for anyone to play.<br/>Various assist functions are also included, allowing for a smooth gameplay experience.<br/>You can also choose to turn off the assist functions if desired.<br/><br/><strong>Fusion</strong><br/>The puzzles cleared in Logiart serve as materials to unlock new problems.<br/>By correctly combining 2 to 3 materials through fusion, new puzzles are unlocked.<br/>To find the right combinations, read the hint texts provided for each puzzle and use deduction.<br/><br/><strong>Number of Logiart Puzzles</strong><br/>There are a total of 280 puzzles in various sizes.<br/>The sizes range from 5×5, 10×10, 15×15, 20×15, 30×30, to 40×30.<br/><br/><strong>Emil's Growth</strong><br/>Emil, who helps unravel the mysteries of the magic books together, gains magical power every time you solve a Logiart puzzle.<br/>As Emil's magical power increases, you'll be able to fuse more puzzles.<br/><br/><strong>Unlocking Magic Book Categories</strong><br/>Due to a malfunction in the magic books, the categorized sections have become inaccessible.<br/>At first, there may be few categories available to browse, but as you progress through the game and clear specific puzzles, more categories will be unlocked.<h3>How to progress in the game.</h3><br/>Solve and clear the Logiart puzzles.<br/>Fuse the cleared problems to create new ones.<br/>Repeat the process of solving the newly created puzzles...<br/>...and work together with Emil to aim for the restoration of the magic book.", "metacritic": null, "released": "2023-09-12", "tba": false, "updated": "2024-03-18T01:21:52", "background_image": "https://media.rawg.io/media/screenshots/18e/18e10017fc0d89b7a8bb552d053598ea.jpg", "website": "https://twitter.com/Jupiter_JP1", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 53, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Jupiter"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Jupiter"], "esrb_rating": null}