{"id": 966271, "slug": "the-isle-tide-hotel", "name": "The Isle Tide Hotel", "name_original": "The Isle Tide Hotel", "description": "Explore a mysterious hotel and infiltrate a cult in this FMV detective game, featuring an award-winning cast from Game of Thrones, The Witcher, and more. Every decision counts as you gather clues and question guests. Can you unearth the ominous secrets at The Isle Tide Hotel before it's too late to save your missing daughter?<br/><br/><br/> <br/>Open every three years for three nights, a strange mix of colourful characters hiding personal traumas gather to uncover the one thread binding them. Their search for the meaning of life. But tonight, this mysterious organisation must decide whether to break their own etiquettes and hand over a teenage girl to their elusive founder, Dr. Aniston, who promises her sacrifice will conclude their purpose. <br/><br/><br/> <br/>How do you infiltrate the hotel? Will you coax your way into the cult? Do you discover the hidden lore, side quests and their dedicated endings or fail at any one of the ruthless narrative puzzles? Navigate a branching narrative with numerous ways to help rescue the daughter you’ve never met.<br/><br/><br/><br/><strong>Main Features </strong><br/>A live action game which responds to your choices <br/>7 main endings available with 14 different outcomes <br/>Side quests which have dedicated endings <br/>Real-time personality and cult association tracker <br/>In-game chapter skip menu - but you have to earn it first <br/><br/><br/><br/><strong>Narrative Features </strong><br/>A unique cult with its own rich history and rules <br/>Paths blocked behind information <br/>Cryptic notes to hidden endings <br/>Hidden lore and ‘Easter eggs’ to discover <br/>Sprawling dialogue options that make you see the same character in a different light <br/><br/><br/><br/><strong>Cast </strong><br/>Michael D. Xavier (“Gentleman Jack”, “The Blacklist”) Jemima Rooper (“Flowers in the Attic: The Origin” (2022), “Matriarch” (2022-Hulu), Amit Shah (“Happy Valley\", “The Witcher”) Richard Brake (“Game of Thrones”)  Georgie Glen (“Call the Midwife”) Tristram Wymark (“Pennyworth”) Jessica Ellerby (“Pennyworth”, “Lovesick”) Joni Ayton-Kent (“The Watch\")", "metacritic": null, "released": "2023-09-11", "tba": false, "updated": "2023-09-15T03:45:53", "background_image": "https://media.rawg.io/media/screenshots/ed1/ed1acdc81f471443a2eacdf87236fcb1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Wales Interactive", "Interflix Media"], "genres": ["Adventure"], "publishers": ["Wales Interactive"], "esrb_rating": null}