{"id": 966300, "slug": "sheng-zhe-bu-zai-ye-li-ku-qi", "name": "生者不在夜里哭泣", "name_original": "生者不在夜里哭泣", "description": "I'd like to call this game Rebel in English. So if you can't understand the Chinese game title you can call it Rebel.<br/><br/>The following is a machine translation.<br/><br/><br/>This is a Japanese RPG puzzle game with multiple endings, where you follow the protagonist as he explores the \"world\".<br/>The game is keyboard operated, no mouse is required.<br/>The plot of this game is long, exploration and puzzle solving also has a certain degree of difficulty, the full process of the game should be more than six hours long, I can not estimate, I wish you a happy game.<h3>The keys are: </h3>Arrow keys to control the movement of the protagonist, change options or adjust the numbers you need to enter, Spacebar to explore or confirm options, Esc to bring up the menu or exit the menu.<h3>Caution:</h3>If you don't like reading a lot of text or aren't good at finding things, please don't torture yourself with this game.<br/>The explorable blocks in this game generally require you to press the spacebar to explore, but there are some explorable blocks that require only your touch, so keep an eye out, you don't know what kind of ending these blocks will lead you to.<br/>There are twenty-one endings in total, and there are different ways to reach the same ending.<h3>Some reminders:</h3>You can skip the opening animation with the Esc key; some blocks can be explored more than once; you'll have to confirm your input with the Enter key for the only text-based puzzle solving in this game; some items can be viewed in the menu bar, so keep an eye out for them; please don't panic if you get a black screen, that's just the buffer I set up between scene jumps.<br/><br/><br/><br/>Also, if you like this game, you can support me by buying the DLC.<br/><br/>I'm sorry this game only supports Chinese.<br/>If you have something to say to me, you can contact me at:<br/>Elon Musk's mojo dojo casa house: @Fredevam (I don't really use it.)<br/>Email: it's the Customer Service Email", "metacritic": null, "released": "2023-09-12", "tba": false, "updated": "2023-09-15T04:27:23", "background_image": "https://media.rawg.io/media/screenshots/56b/56bb2203274ea189268e0a605068e645.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fredevam"], "genres": ["RPG", "Indie"], "publishers": ["FREDEVAM"], "esrb_rating": null}