{"id": 966378, "slug": "monster-truck-racing-stunt", "name": "Monster Truck Racing Stunt", "name_original": "Monster Truck Racing Stunt", "description": "The new real monster truck stunt game is finally here. This free monster truck racing game will take you to the next level of destruction and truck simulator games. You've never seen such car crash madness like this before. Get ready for extreme destruction and 3D truck crashes. Dominate your rivals and knock them down in our amazing, realistic, high-quality 3D arena. Always attack &amp; defend like a fearless master monster truck in this monster truck stunt race game. Let the fire begin between the powerful 3d monster trucks derby and wait for the win. This offline monster truck stunt game is the beginning of a new demolition game era. In this Xtreme real monster truck car racing game, being nice or weak is not an option. Try hard and smash all your opponents in monster truck car destruction 2022 before it's too late. <br/><br/><br/><br/>FEATURES:<br/><br/><br/><br/>Realistic 3D arena environment.<br/>Unique and multiple modes <br/>Amazing sound effects of truck collision and destruction.<br/>Realtime damage of cars &amp; trucks simulator.<br/>Realistic dust and mud particle effects.<br/>Enjoy live commentary during the race and match<br/>Choose from multiple unique and extremely high-performance real monster trucks.<br/>Drive the 4x4 truck simulator and smash your rivals <br/>Participate in multiple leagues offline.", "metacritic": null, "released": "2022-12-15", "tba": false, "updated": "2023-09-15T06:09:20", "background_image": "https://media.rawg.io/media/screenshots/dbd/dbd7f0154a1d2da591953bb48d77667c_Dv9b0uz.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Aril Labs"], "genres": ["Simulation", "Racing"], "publishers": ["Aril Labs"], "esrb_rating": "Everyone 10+"}