{"id": 966355, "slug": "pathfinder-gallowspire-survivors", "name": "Pathfinder: Gallowspire Survivors", "name_original": "Pathfinder: Gallowspire Survivors", "description": "Pathfinder: Gallowspire Survivors is a new roguelite survivor game set in the beloved fantasy world of Pathfinder. Venture into Gallowspire, Pathfinder’s legendary tower of darkness, as one of three heroes — and alongside a fearless companion — on a doomed quest to seal away the greatest threat the world has ever known.<br/><br/><br/><br/><br/><br/><ul><li>3 hero classes: Fighter, Rogue, and Wizard, each with unique abilities and playstyles<br/></li><li>Unlock 67+ different abilities and 36+ talents, all inspired by Pathfinder TTRPG<br/></li><li>Fight 4 unique bosses in scripted and challenging battles<br/></li><li>Face against 47+ unique monsters, and mini-bosses with over 275 variants<br/></li><li>Complete 30+ quests<br/></li><li>Battle through 16 floors showcasing 3 unique biomes<br/></li><li>Deep replayability: 5 Difficulty levels for those seeking pain and suffering</li></ul><br/><br/><br/><br/><br/><br/><br/>You won’t have to face the darkness alone. Choose one of your other heroes to join your main hero as a companion while adventuring. They will stand alongside you on the battlefield, offering protection and firepower.<br/><br/><br/><br/><br/><br/><br/>Absorb necromantic essence to find and enhance attacks and passives each run to grow stronger against Tar-Baphon's forces.<br/><br/>Use attribute points to increase Strength, Dexterity, Constitution, Intelligence, Wisdom, and Charisma.<br/><br/>Upgrade your talent tree and get deeper customization options by unlocking new attacks and passive abilities<br/><br/><br/><br/><br/><br/><br/>Explore dungeons, find hidden treasure chests, and let fate decide your fortune with d20 rolls. Use gold to upgrade potent consumables like healing potions and spell-like effects.<br/><br/><br/><br/><br/><br/><br/>Support the independent team behind \"Pathfinder: Gallowspire Survivors\" as we craft a thrilling roguelite survivor experience.<br/><br/>Step into the beloved fantasy world of Pathfinder and prepare for an unforgettable journey.<h3>Featured on</h3><br/>", "metacritic": null, "released": "2023-09-14", "tba": false, "updated": "2023-09-15T05:36:27", "background_image": "https://media.rawg.io/media/screenshots/349/349eb5ad0e0be6b598c8d409e702f212.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "dropped": 1}, "playtime": 1, "achievements_count": 35, "ratings_count": 0, "suggestions_count": 383, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BKOM Studios"], "genres": ["Action", "RPG", "Casual", "Indie"], "publishers": ["BKOM Studios"], "esrb_rating": null}