{"id": 966349, "slug": "we-were-here-expeditions-the-friendship", "name": "We Were Here Expeditions: The FriendShip", "name_original": "We Were Here Expeditions: The FriendShip", "description": "It’s all about Communication, Teamwork… and Trust. Talk together, work together, and most of all, believe in your friend.<br />\nThe two of you are alone at sea when pursuing a distress call leads you to a deserted island, where you encounter a mysterious boat ride in an abandoned amusement park. This is a voyage you won’t forget, with puzzles that take two to solve. The state of your friendship will directly affect the state of your friend-ship!<br />\nWe Were Here Expeditions: The FriendShip has a free boarding ticket until October 13.<br />\nBe aware, this is an actual test as you’ll be graded on how well you solve these puzzles! Will friendship truly last forever? Or is this friend-ship sinking to the bottom of the ocean?<br />\nWe Were Here ‘Expedition’ SeriesFrom the makers of the renowned We Were Here Series comes the bite-sized We Were Here Expeditions! The perfect chance for new Explorers to get a taste of our flavour of co-op puzzle fun - while longtime fans can try to achieve the perfect score. Everything&#39;s better together with a friend, and crossplay is supported so if your friends use a different platform you can still board the friend-ship!<br />\nPlaying with your friend and communicating well is key to the series: asymmetrical puzzles give players different perspectives and can only be solved together. But don’t worry, your walkie-talkies will let you keep in touch. Over and out!<br />\nNOTE: This game is co-op only. It requires both players to have a working PC-compatible microphone and an internet connection.<br />\nhttps://store.steampowered.com/app/1341290/We_Were_Here_Forever/</p>", "metacritic": null, "released": "2023-09-14", "tba": false, "updated": "2024-04-05T13:11:21", "background_image": "https://media.rawg.io/media/games/123/1234ba5e5cfe5c2165fe9bbc814db664.jpg", "website": "https://totalmayhemgames.com/", "rating": 3.86, "rating_top": 5, "added_by_status": {"yet": 54, "owned": 426, "beaten": 49, "toplay": 26, "dropped": 3, "playing": 2}, "playtime": 2, "achievements_count": 36, "ratings_count": 34, "suggestions_count": 599, "game_series_count": 0, "reviews_count": 35, "platforms": ["PC", "PlayStation 5"], "developers": ["Total Mayhem Games"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Total Mayhem Games"], "esrb_rating": null}