{"id": 966386, "slug": "truck-simulator-pro-usa", "name": "Truck Simulator PRO USA", "name_original": "Truck Simulator PRO USA", "description": "Experience the ultimate trucking adventure with Truck Simulator PRO USA! Immerse yourself in the world of American trucking as you explore vast highways and breathtaking landscapes across the United States. Transport goods, take on challenging missions, and build your own trucking empire.<br/><br/><br/>Drive Authentic American Trucks:<br/>Take the wheel of a variety of authentic American trucks, including iconic brands and models. Feel the power and precision of these massive machines as you navigate cities, highways, and off-road routes. Customize and upgrade your trucks to suit your style and enhance their performance.<br/><br/>Explore Iconic American Landscapes:<br/>Embark on a journey through diverse and stunning landscapes across the United States. Drive through bustling cities, scenic countryside, and vast deserts, experiencing the beauty and variety of American scenery. Encounter realistic weather conditions and day-night cycles that add to the immersive gameplay.<br/><br/><br/>Complete Challenging Missions:<br/>Take on a wide range of engaging missions and challenges as you progress in your trucking career. Transport various types of cargo, navigate tight spaces, and overcome obstacles along the way. Earn rewards and unlock new opportunities as you successfully complete missions.<br/><br/><br/>Build Your Trucking Empire:<br/>Start as a small-time trucker and work your way up to becoming a respected and successful trucking tycoon. Invest your earnings wisely to expand your fleet, hire skilled drivers, and establish your own logistics company. Strategically manage your business to maximize profits and dominate the trucking industry.<br/><br/><br/>Key Features:<br/><br/>Realistic American truck simulator with immersive gameplay<br/>Wide selection of authentic American trucks to drive<br/>Explore iconic American landscapes and cities<br/>Engaging missions and challenges to test your skills<br/>Customize and upgrade your trucks for enhanced performance<br/>Realistic weather conditions and day-night cycles<br/><br/>If you're a fan of truck simulators and seeking an authentic trucking experience in the United States, Truck Simulator PRO USA is the game for you. Get ready to hit the road and conquer the American trucking industry!", "metacritic": null, "released": "2023-08-16", "tba": false, "updated": "2023-09-15T06:17:26", "background_image": "https://media.rawg.io/media/screenshots/902/902bf18dd3db728b665c268ffb3e043c_xJEm2D5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MAGEEKS SC"], "genres": ["Simulation", "Racing"], "publishers": ["MAGEEKS SC"], "esrb_rating": "Everyone 10+"}