{"id": 966463, "slug": "pep-pel", "name": "Pep-Pel", "name_original": "Pep-Pel", "description": "Play as Pep-Pel, a magician cursed to be a small red goblin, in this fluid and fast paced platformer!<br/><br/>Explore 8 unique worlds in the search of monstrous treasure chests that cursed her. Hundreds of hand drawn assets make up each world the player will travel to.<br/><br/>Try not to be too greedy, with hundreds of collectables in each level, and medals you can win for beating levels quickly!<br/><br/> <h3>Key Features</h3><strong>-Momentum Based Platformer: </strong>Pep-Pel is a momentum based platformer, where the player runs through large scale levels.<br/><br/><strong>-High Replayability Value:</strong> The game is made to encourage the player to replay each level to improve how fast they can finish a level, along with having collectables in each level.<br/><br/><strong>-Unique Level Mechanics:</strong> Each of the games 8 main levels have there own unique mechanic, including; candy projectiles, rope, lazers, chase mechanics, wind, water, and poison<br/><br/><strong>-Robust Customization Options:</strong> Unlock many different costumes as you progress through the game. Costumes can be unlocked by beating levels or by collecting collectables.<br/><br/> <h3>Momentum Based Platformer</h3><strong>-Momentum System: </strong>run as fast as you can through each level to beat them as fast as possible. With a focus on building momentum as you play, skilled players will be rewarded by being able to move at extreme speeds through levels.<br/><br/><strong>-Curved Surfaces:</strong> Curved and natural surfaces are a main focus of level design. Using a system that allow the player to move across any style of surface geometry, level design is not restricted to blocky pixel surfaces<br/><br/><strong>-Movement Mechanics:</strong> Pep-Pel has a large variety of different movement mechanic. All of which can help the player move fluidly through levels.<br/><br/><strong>-Fast and challenging:</strong> Players will die often so player deaths are made to be quick and satisfying, allowing the player to retry quickly. Armour can be found hidden around levels, this allows the player to survive one extra hit of damage before they die.<br/><br/><br/> <h3>Level mechanics</h3><strong>-Each level has its own unique mechanic:</strong> New Mechanics are introduced naturally at the start of a level and get more complex as the level progresses<br/><br/><strong>-Hard Mode: </strong>Hard mode levels incorporate mechanics from multiple different levels<br/><br/> <h3>Visuals</h3><strong>-Level Worlds:</strong> Every level exists in its own unique world, allowing level designs to be creative and involve anything that would be fun as a visual.<br/><br/><strong>-Color Palette:</strong> Each level is designed with a unique color palette and style to make them visually distinct.<br/><br/><strong>-Hundreds of unique animations: </strong>Pep-Pel is animated with over 150 unique animations. These are blended together in gameplay.<br/><br/><strong>-Animation blending:</strong> animations are combined as the character moves to make character animation more dynamic and natural.<br/><br/><strong>-Actually 3D!:</strong> Pep-Pel is animated as a unique 3D model using 2D stylization, this allows for more extreme and dynamic animations to be made.<br/><br/>", "metacritic": null, "released": "2023-09-14", "tba": false, "updated": "2023-09-18T02:55:12", "background_image": "https://media.rawg.io/media/screenshots/daa/daa9a6c6da7d3d85c7064cb0556d598b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 278, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["SlugGlove"], "genres": ["Adventure", "Indie"], "publishers": ["SlugGlove"], "esrb_rating": null}