{"id": 966480, "slug": "bright-side-riddles-and-puzzles", "name": "Bright Side: Riddles and Puzzles", "name_original": "Bright Side: Riddles and Puzzles", "description": "Bright Side: Riddles and Puzzles is a collection of videos with mind-bending riddles, puzzles and brain teasers that will test your insight and boost your creative thinking skills. Are you up for the challenge?<br/><br/><br/><br/><br/>Choose a video packed with riddles, listen to the story, analyze, pay attention to details and make quick decisions because you don't have much time to answer! <br/><br/>Solve various types of puzzles ranging from perception, deduction and finding the difference to ciphers and even survival questions! Score as many points as possible and become the riddle master!<br/><br/><br/><br/><br/>Invite your friends and family to play together in local multiplayer mode with up to 4 players! Personalize your player icons, face each other in little mental gymnastics, put your observation and perception abilities to the test and emerge the puzzle master! Enjoy together the thrill of the challenge, the joy of learning and the satisfaction of problem solving.<br/><br/><strong><h3>Play and learn with Bright Side!</h3></strong><br/>As you dive into these quizzes, you're not only entertaining yourself, but you're also giving your brain a healthy workout. Every quiz is an opportunity to discover something new, as you grow your own general knowledge thanks to Bright Sides hugely popular videos.<br/><br/><strong><h3>Overall features:</h3></strong><br/><ul><li>25+ videos with over 450 riddles <br/></li><li>multiplayer with up to 4 players<br/></li><li>various types of riddles: deduction, find the difference, codes, ciphers, survival and more<br/></li><li>easy mechanics: point and click or answer select with a button press<br/></li><li>cartoonish and colorful graphic<br/></li><li>pleasing voice-over</li></ul>", "metacritic": null, "released": "2023-09-15", "tba": false, "updated": "2023-09-18T03:17:27", "background_image": "https://media.rawg.io/media/screenshots/104/104ef2a7b1e1763667860b09a0e81017.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 266, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["QubicGames"], "genres": ["Casual", "Indie"], "publishers": ["QubicGames"], "esrb_rating": null}