{"id": 966493, "slug": "bancroft-academy", "name": "Bancroft Academy", "name_original": "Bancroft Academy", "description": "Delve into the enthralling universe of \"Bancroft Academy,\" an episodic narrative-driven adventure set to span a season of 5 captivating episodes. As you navigate the academy's corridors, immerse yourself in a storyline rich with unique characters, engaging dialogues, and choices that dictate your path.<br/><br/><br/><br/>Starting with Episode 1, players will meet essential characters such as Ashley, Elizabeth, Julia, and others. Engage in dialogues that shift between light-hearted banter and profound revelations, unveiling the intricate dynamics that breathe life into Bancroft Academy.<br/><br/><h3>key Features:</h3><ul><li><strong>Episodic Releases:</strong><br/><ul>Experience the narrative as it unfolds over time. While the full season will comprise 5 episodes, they are currently in development and will be released progressively.</ul></li><li><strong>Character-Driven Plot:</strong><br/><ul>Dive deep into interactions with a diverse cast, each boasting their own distinctive personalities and histories.</ul></li><li><strong>Free Roam Dynamics:</strong><br/><ul>Wander the academy at your own pace, encountering characters and making crucial choices that alter the story's course.</ul></li><li><strong>Discover Hidden Gems:</strong> <br/><ul>Unravel concealed episodes, alternative character appearances, and exclusive achievements.</ul></li><li><strong>Adaptive Soundtrack:</strong> <br/><ul>Elevate your gaming experience with a dynamic soundtrack. Adjust the audio settings to suit your preferences.</ul></li><li><strong>Varied Gameplay Modes:</strong> <br/><ul>Choose how you wish to play, whether it's a comprehensive narrative journey or a more laid-back exploration mode.</ul><br/><br/>Join us on this evolving journey through \"Bancroft Academy.\" As the episodes are in active development, your experience will expand and deepen with each new release. Dive in now and be part of the unfolding saga.</li></ul>", "metacritic": null, "released": "2023-09-15", "tba": false, "updated": "2023-09-18T03:44:20", "background_image": "https://media.rawg.io/media/screenshots/173/173b3a266b837319b5dfb68776d5f1be.jpg", "website": "https://www.mrauroragames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 417, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["MrAuroraGames"], "genres": ["Adventure"], "publishers": ["MrAuroraGames"], "esrb_rating": null}