{"id": 966401, "slug": "danger-quest-the-lost-levels", "name": "Danger Quest! The Lost Levels", "name_original": "Danger Quest! The Lost Levels", "description": "For Super Players! Danger is back with 30 new extra difficult epic puzzle adventures.<br/><br/>If you enjoyed Danger Quest! Epic Puzzle Adventure, you will love the Lost Levels. The puzzles tend to be a bit more difficult in this game than in the original version.<br/><br/>Two control methods:<br/>- Full screen arrows.<br/>- Touch where you want to go. (The character will move in that direction but will not avoid obstacles)<br/><br/>Skills: visual logic, planning ahead, puzzle solving.<br/><br/>This is a puzzle adventure game. The game stars Professor Danger, a globe trotting explorer who uses his puzzle solving skills to escape dangerous situations. The goal is to move objects around an area to grab gold star items and make it to the end. The puzzles are challenging and addictive. Always plan ahead. The game contains 6 themed worlds, each with 5 unique levels.<br/><br/>Awesome graphics! Exciting soundtrack!<br/><br/><br/>World 1: Caves of Peril<br/>- Professor Danger is lost underground.<br/><br/>World 2: Ancient Terror<br/>- Avoid mummies while exploring the treasures of ancient Egypt.<br/><br/>World 3: Trouble in the Jungle<br/>- Monkey idols are protected by gorillas.<br/><br/>World 4: Lost Planet<br/>- Explore an alien planet (that looks suspiciously like California).<br/><br/>World 5: On Thin Ice<br/>- Slide on the ice by angry snowmen.<br/><br/>World 6: The Big Dilemma<br/>- Track down falcon figurines in this noir film setting.<br/><br/>Soundtrack and sound effects from Verity Studios. http://www.veritystudios.ca<br/><br/>This app contains completely original artwork and content. Copyright 2013 Make It So Studios. All rights reserved. http://www.makeitsostudios.com", "metacritic": null, "released": "2013-12-18", "tba": false, "updated": "2023-09-15T06:34:14", "background_image": "https://media.rawg.io/media/screenshots/8e7/8e7ec292e13b218a7febbc6c1cbc7f3e_YVhFZ8m.jpg", "website": "http://www.makeitsostudios.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Make It So Studios"], "genres": ["Adventure", "Puzzle"], "publishers": ["Geoff Davidson"], "esrb_rating": "Everyone 10+"}