{"id": 966482, "slug": "the-backrooms-last-expedition", "name": "The Backrooms: Last Expedition", "name_original": "The Backrooms: Last Expedition", "description": "<strong> DESCRIPTION </strong> <br/>\"The Backrooms: Last Expedition\" is a cooperative horror game designed for 1 to 4 players. Its main objective is to create an enjoyable gaming experience for friends. Players will navigate through terrifying levels, filled with various entities and dangers, as they strive to escape.<br/><br/>\"The Backrooms: Last Expedition\" aims to provide players with a thrilling and immersive horror gaming experience, combining cooperative gameplay, terrifying encounters, and enhanced visuals to create an unforgettable adventure.<br/><br/> <strong> ENTITIES </strong> <br/><br/>We have created new entities and also redesigned some existing ones to maintain coherence with the Backrooms universe. In addition to crafting new, unprecedented monsters specifically designed for each of our cards, we have also reimagined all the original and iconic Backrooms maps. We have recreated them while preserving their appearance and charm, making them even more terrifying and interactive than what was previously known.<br/><br/> <strong> FEATURES </strong> <br/><br/><br/>With the utilization of Unreal Engine 5, we have achieved an unparalleled level of immersion. The cutting-edge technology and advanced graphics capabilities of Unreal Engine 5 have allowed us to create stunning visual effects, realistic environments, and lifelike animations. Prepare to be fully immersed in the world of The Backrooms: Last Expedition, as every detail comes to life with unprecedented fidelity and realism.<br/><br/><br/>", "metacritic": null, "released": "2023-09-15", "tba": false, "updated": "2023-09-18T03:20:30", "background_image": "https://media.rawg.io/media/screenshots/a48/a48b3ced5b7b95612b182fb382cdc0a9.jpg", "website": "https://backrooms.valkyrieinteractive.fr/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 278, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Valkyrie Interactive"], "genres": ["Action", "Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Valkyrie Interactive"], "esrb_rating": null}