{"id": 966472, "slug": "baby-shark-sing-swim-party", "name": "Baby Shark: Sing & Swim Party", "name_original": "Baby Shark: Sing & Swim Party", "description": "Get ready Shark Family, we’re going on a rhythmic adventure in Baby Shark: Sing &amp; Swim Party! Swim across the wide waters with Baby Shark, Mommy Shark, Daddy Shark, Grandma Shark, and Grandpa Shark to enjoy the Fin-tastic Festival. A spectacular festival where performers gather every year, from all over the sea to sing, dance, and rock!<br/><br/><br/><br/><br/><br/><br/>Road trips don’t have to be long and uneventful. They can be fun, engaging, and action-packed! Especially if you sing a song or two. Serenade your friends and family with your fin-omenal voice singing songs from original videos like Disco Sharks, Baby Mermaid Shark, Chumbala Cachumbala Skeleton Pirates, Shark Dance Party, and Baby Shark Dance, among others. Doo Doo Doo Doo Doo Doo!<br/><br/><br/><br/><br/><br/><br/>In Baby Shark: Sing &amp; Swim Party, you will journey through seven different locations in the ocean. You can swim through Tropical Bay, party in Ocean City or dive into the dark Kingdom of the Deep. With that many places to visit, you are bound to get a rumbly tummy, so make sure to stop by the Blue Pirate Ship to gulp down a couple of kelp sandwiches. And don’t forget to go to the Opera House to enjoy an exotic sea-mphony of sounds.<br/><br/><br/><br/>Baby Shark: Sing &amp; Swim Party lets you choose between five different playable characters from the Shark Family that are customizable in various costumes, clothes, and skins. Play in two game modes: you can either go on an adventurous quest collecting stars while dodging blowfish or take on the waves and test how quick you are with your pectoral fins following the music. You will be rewarded with tons of musical cards that can be added to your album!<br/><br/>Are you ready to make new ocean friends and journey across the amazing sea? Jaw-some, pack your salty snacks and leeeeeeeettttt’s go!<h3>This is going to be fun. I can feel it in my fins!</h3><br/><br/><ul><li>HELP THE SHARK FAMILY – Swim through iconic ocean locations and get them to the greatest festival.<br/></li><li>SCORE STARS – Dodge obstacles or tap to the rhythm of the music to earn points.<br/></li><li>SWIM, SING, AND SWING – Sing and dance along to jaw-some songs like Baby Shark, Doo Doo Doo Doo Doo Doo.<br/></li><li>STRENGTHEN YOUR FINS – Collect stars whilst dodging blowfish or tap to the rhythm of the music to earn points.<br/></li><li>YOU CAN DOO IT! – Collect tons of musical cards to add to your album.</li></ul>", "metacritic": null, "released": "2023-09-15", "tba": false, "updated": "2023-09-18T03:06:08", "background_image": "https://media.rawg.io/media/screenshots/9ad/9ad57a9dd7602faf4e385e7842c6597d.jpg", "website": "https://outrightgames.com/games/baby-shark-sing-swim-party/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RecoTechnology"], "genres": ["Adventure", "Casual"], "publishers": ["Outright Games"], "esrb_rating": null}