{"id": 966470, "slug": "dashbounce", "name": "Dashbounce", "name_original": "Dashbounce", "description": "Far away there's a planet whose laws are governed by a mystical Core deep within its heart.<br/>Life, death, time and the functionality of frozen dessert machines at fast food restaurants are all governed by this powerful artefact.<br/>Unfortunately, it isn't exactly the most reliable piece of hardware, and so it is protected by a mysterious, shrouded people known as the Bouncers.<br/>Whimsical, curious, quick and honestly kind of adorable, they have laboriously maintained something resembling order for time immemorial...<br/>A generation has passed since the Core last experienced a serious malfunction...<br/>...And now the sun has stopped setting, crops have stopped growing, people have lost the ability to jump and worst of all, video ads can no longer be skipped!<br/>It was quickly decided that enough was enough! The rallying cry was sounded for heroes to help set things right!<br/>And so it was that eight brave volunteers set forth on a journey to enter the heart of the planet and reset the Core of the World...<br/><br/><strong>Welcome to Dashbounce, a 2D Speedrunning Puzzle-Platformer about going fast and intentionally abusing physics quirks! Seek the goal in each level before the clock hits zero - but watch out, you can't jump!<br/><br/>You'll have to use your surprising speed and bouncy body to turn every object and obstacle into an advantage!</strong><br/><br/>Select between eight characters and dash through over 50 levels in a lighthearted adventure mode about going fast and saving the world!<br/><br/>There are over 150 different challenges to complete, bonus levels to unlock, or you can make your very own with the included level editor!<br/><br/>Custom levels are stored as tiny several-kilobyte text files for easy sharing!<br/><br/>Three difficulty modes are included:<br/>-Easy, providing a more relaxed challenge for the less confident or those that don't enjoy the stress of a strict time limit.<br/>-Normal, which will require you to think quick on your feet to reach the goal in time.<br/>-Hard, for the absolute masochists who demand perfection of themselves and nothing less.<br/><br/>In addition, you can choose to play with a left or right-handed keyboard control setup, or using a PC-compatible gamepad!<br/><br/>For the speedrunners out there, the game includes a dedicated speedrunning mode which removes all loading times and story events so you can focus entirely on saving those frames!<br/>Every level in the main adventure mode also tracks your best time, so if you prefer individual level records, Dashbounce has you covered!", "metacritic": null, "released": "2023-09-15", "tba": false, "updated": "2023-09-18T03:03:33", "background_image": "https://media.rawg.io/media/screenshots/bd9/bd99b5aed55d277d0a1d7c10e0866fc1.jpg", "website": "https://twitter.com/DeliciouSoft", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Delicious Software"], "genres": ["Action", "Indie"], "publishers": ["Delicious Software"], "esrb_rating": null}