{"id": 966545, "slug": "coreupt", "name": "Coreupt", "name_original": "Coreupt", "description": "\n<br/>\n<br/>\n<br/>\nIn the vast expanse of distant galaxies, the very fabric of reality trembles as an unstoppable warlord leads an armada to seek out the Hyperion Cores. Imbued with unimaginable power, they hold the key to either salvation or annihilation. Will you plunge the universe into eternal darkness, or bring it back from the brink?\n<br/>\n<br/>\nCoreupt is a fast-paced fighting game, blending lightning-fast combat with strategic depth. Assemble your team from a diverse roster of fighters from all corners of the galaxy, with dark secrets and complex stories galore. On the other side of the battle, meet an equally interesting group of enemies, then obliterate them with a torrent of devastating combos, chaining together blistering attacks - and either save the universe or damn it forever!\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<ul><li>Flashy and Over-the-top Combat: Engage in blistering, high-octane battles that defy the laws of physics. Execute jaw-dropping combos, ignite the battlefield with awe-inspiring special moves, and experience the thrill of unleashing god-like powers upon your adversaries.\n<br/>\n</li><li>Shape the Fate of the Universe: The fate of the universe lies in your hands. Align yourself with Gatling's stalwart allies to protect existence or join Dragonov's ruthless entourage to rewrite the fabric of reality itself. \n<br/>\n</li><li>Multiple Game Modes: Catering to both solo and multiplayer experiences, Coreupt offers Arcade, Story, and Survival modes. Want to delve into the lore? Seeking a true test of skill? Perhaps even…\n<br/>\n</li><li>Compete on the Leaderboards: Ascend the ranks and cement your name in history as you climb the leaderboards. Showcase your skills, earn recognition, and establish your dominance as the ultimate Coreupt champion.</li></ul>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nCoreupt has been developed in Unreal Engine and features a cast of highly polished characters, each showing their own personality and style as they take on their foes. Each model has been rendered with deadly precision, ensuring that not only does the game play smoothly, but the characters also look flashy as they beat each other to a pulp. With over 12 wildly diverse fighters to try out, everyone can find a favorite character in the roster!", "metacritic": null, "released": null, "tba": false, "updated": "2023-09-18T05:00:24", "background_image": "https://media.rawg.io/media/screenshots/09a/09a087eae8d75e19eff53d7878fd9737.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 589, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Team Coreupt"], "genres": [], "publishers": ["Freedom Games"], "esrb_rating": null}