{"id": 966593, "slug": "super-paul-world", "name": "Super Paul World", "name_original": "Super Paul World", "description": "Dive into an exciting adventure in \"Super Paul World\" where you can choose from 5 unique characters and countless cosmetic customization options to make your hero one of a kind. Your mission? Help Baker Tim regain his ability to produce cookies.<br/><br/>Experience the thrill of the game in various modes, including the single-player story mode where you'll battle through multiple levels, and the endless mode where you collect points by defeating countless enemies until you run out of lives. You can also team up or compete against friends in the multiplayer mode.<br/><br/>Earn experience points (EXP) by defeating enemies or playing the multiplayer mode and level up to unlock a variety of cosmetic items, including knight armor, fox suit, blue jacket, blue cap, crown, and much more.<br/><br/>Your skills will be put to the test as you make both big and small jumps in the game world, scale walls, and defeat enemies in melee or ranged combat. Stay alert, as defeated enemies may drop life, helping you stay in the game longer.<br/><br/>The story begins when two villains steal the Cookie-Nexus-Core, which gives Baker Tim the ability to produce cookies. Chase the villains through different worlds and embark on an epic adventure to retrieve the Cookie-Nexus-Core and help Baker Tim.<br/><br/><strong>Gameplay Features</strong><br/><ul><li>Singleplayer Story<br/></li><li>Endless Fight Arena<br/></li><li>Controller Support</li></ul>", "metacritic": null, "released": "2023-09-21", "tba": false, "updated": "2023-09-22T02:24:30", "background_image": "https://media.rawg.io/media/screenshots/5af/5af44d06e8adaac102e9337463e972d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Palez"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Palez"], "esrb_rating": null}