{"id": 966530, "slug": "light-city-district", "name": "Light City District", "name_original": "Light City District", "description": "<h3>INTRO</h3><br/>Light City District is home to Agent Null. But a telephone call will drag him out of his office and into the bustling streets. He will have to help people along the way, play with kids, and know all the characters in this strange city.<h3>Main idea behind this game</h3><br/><br/><br/><br/>What if all the 80's Game and Watch like systems were part of the same world? <br/>That is the idea behind Light City District.<br/>To create a huge open world game, in realtime, with interaction with all the characters of that world, secondary missions, while embracing all the artistic limitations of those old 80's games before even 8 bit games were invented.<br/><br/>This is the FIRST chapter of this series. Hope people like it and I can do more.<br/><br/>All the main elements of the game were created as the old Game and Watch systems were: with paper and pencil. Everything taking into account that nothing can overlap, becuase it had to be able to be created as a liquid cristal display. <br/>All the scenes have two layers: the moving characters an dthe coloured background. <br/>This is to imitate the way most of these systems got some colour, with transparent films for the backgrounds and polarised films for the moving elements. <br/>We are even imitating the small shadows that the elements project in real physical systems.<br/><br/><h3>Main features:</h3><br/><ul><li>Openworld exploration<br/></li><li>Feel again the simplicity of GameAndWatch like games.<br/></li><li>Character conversations and reactions change with the time of day<br/></li><li>Pure arcade action<br/></li><li>Puzzle solving<br/></li><li>Secondary missions.<br/></li><li>A Cinema Noire inspired story.<br/></li><li>Autosaving in each scene which allows a pick a few minutes for play and continue later.</li></ul><br/>You can play it with your keyboard or controller.", "metacritic": null, "released": "2023-09-16", "tba": false, "updated": "2023-09-18T04:35:26", "background_image": "https://media.rawg.io/media/screenshots/5a7/5a7d12c711417bdb68991b7c38f7cd4d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["GokiburiGeemu"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Gokiburigeemu"], "esrb_rating": null}