{"id": 966540, "slug": "shrines-legacy", "name": "Shrine's Legacy", "name_original": "Shrine's Legacy", "description": "\n<br/>\nA dark shadow has fallen upon the world of Ardemia. An evil force looms on the horizon and it's up to two young heroes, Rio and Reima, to take up the Sword of the Shrine and save the world from certain doom.Before they can save the world, the duo first needs to restore the Sword by finding its eight elemental gems of magic, along with helping dozens of denizens on the way.\n<br/>\n<br/>\nShrine's Legacy is an action RPG inspired by the best SNES classics. Explore a vast overworld while fighting in real-time battles using a robust combat and equipment RPG system. As a heroic party of two, one companion will always be there to help, either controlled by the game or by a friend in co-op.\n<br/>\n<br/>\n<br/>\n<br/>\n<ul><li>The magical world of Ardemia is home to countless secrets. Hidden in its many nooks and crannies are treasures like crafting materials, magical jewels, Zuell, and more.\n<br/>\n</li><li>Delve into a myriad of dungeons to fight monsters and bosses guarding treasure you can use to increase your stats and learn powerful new spells.\n<br/>\n</li><li>Solve puzzles requiring clever use of the elemental magics.</li></ul>\n<br/>\n<br/>\n<br/>\n<br/>\n<ul><li>Ardemia teeters on the brink of destruction. There is no victory without sacrifice. How much are Rio and Reima willing to lose?\n<br/>\n</li><li>Hard choices must be made. How will Ardemians and the heroes cope with losing what's dearest to them as bonds develop In this character-driven story?</li></ul>\n<br/>\nThe Sword of Shrine awaits you, heroes!\n<br/>\n<br/>", "metacritic": null, "released": null, "tba": false, "updated": "2023-09-18T04:53:41", "background_image": "https://media.rawg.io/media/screenshots/ee3/ee3f6592722fa024f57c2c5b1de9489c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Positive Concept Games"], "genres": [], "publishers": ["Freedom Games"], "esrb_rating": null}