{"id": 966534, "slug": "college-sex-party", "name": "College Sex Party 🔞", "name_original": "College Sex Party 🔞", "description": "Welcome to the world of <strong>College Sex Party</strong> 🔞 - an exciting visual novel that immerses you in an unforgettable and enticing student life! Behind every twist of the plot, secrets, passions, and unpredictable events await, all unfolding against the backdrop of education, friendship, and, of course, fun-filled parties.<br/><br/><br/><br/>Embark on a captivating journey through university corridors, where each character is a lively and intriguing individual with their own dreams, ambitions, and dark secrets. Your decisions will shape the course of the story, revealing different paths and alternative endings.<br/><br/><br/><br/><strong>College Sex Party</strong> 🔞 opens up the universe of the most exhilarating student parties. From epic dance battles to cunning intrigues - each party is a separate world with the opportunity to discover new characters and environments. And with the inclusion of adult content elements, the game offers a chance to delve deeper into the intimate aspects of character relationships.<br/><br/><br/><br/>Conquer the world of <strong>College Sex Party</strong> 🔞 and create your unique path to love, power, or uncovering the most intriguing secrets of university life. Lift the veil on the adult and daring facets of student routines and feel like a part of this unpredictable world!<br/><br/><h3>Features:</h3><ul> <li>Plenty of lewd scenes with various girls<br/></li><li>Real-time 3D character and animations<br/></li><li>A fascinating story<br/></li><li>A Multitude of Sexy Situations<br/></li><li>Minigames<br/></li><li>Ability to play with one hand. ( ͡~ ͜ʖ ͡°)</li></ul>", "metacritic": null, "released": "2023-09-16", "tba": false, "updated": "2023-09-23T00:06:55", "background_image": "https://media.rawg.io/media/screenshots/21d/21deffb5e650287067b75cfab4dc555b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 428, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Taboo Tales 💘"], "genres": ["Adventure", "RPG", "Simulation"], "publishers": ["Taboo Tales 💘"], "esrb_rating": null}