{"id": 966543, "slug": "subterrain-mines-of-titan", "name": "Subterrain: Mines of Titan", "name_original": "Subterrain: Mines of Titan", "description": "After a massive meteor strikes the icy surface of Titan, nothing is left but a vast deposit of rare minerals. The TECC mining company rushes to establish a colony on Titan and successfully tap the riches, until the colony goes dark. It takes years to mount a salvage expedition to the far flung moon of Saturn, so make it count. Restart the flow of resources and figure out what happened to the first wave of colonists.<br/><br/>Stand between the sole survivors of Camp Huygens and total obliteration by Saturn's darkest mysteries. Every turn counts in the desperate struggle for survival, as Titan will not wait around - and neither should you.<br/><br/><br/><br/><ul> <li> Titan is an unrelenting dynamic, persistent world. Every action and step advances time and brings Camp Huygens closer to collapse, unless someone intervenes.<br/></li><li> Help surviving colonists with their tasks, assign key jobs, harvest materials, and organize crafting stations to keep the doom at bay.<br/></li><li> Manage food and water intake, keep tabs on oxygen and energy levels, and treat any sustained injuries, all while penetrating the abandoned mining tunnels beneath the surface.<br/></li><li> Track the passage of time efficiently or it might turn out that the greatest threat to Camp Huygens isn't Titan or its monsters... but you!</li></ul> <br/><br/><br/><ul> <li> Unearth the mysteries of Saturn's most famous moon and go deep beneath its surface to face off against its many horrors.<br/></li><li> Fight the monstrosities using intuitive, brisk turn-based combat. Do you make the fight close and personal, risking death as you go toe to toe? Or plink from afar, hoping that ammo won't run out at the wrong time?<br/></li><li> Harness the power of nanomachines to unleash devastating abilities against foes, but also sacrifice the ability to physically pummel monsters into submission?<br/></li><li> Gain experience and power alongside the celestial creatures underground. Evolve and adapt tactics, or perish in the darkness of Titan's mines!</li></ul> <br/><br/><br/><ul> <li> Craft an endless array of items thanks to a small handful of allies like weapons and elbow grease.<br/></li><li> Salvage what you can, break it down into materials, and produce tools like melee weapons, firearms, protective gear, explosives, and countless survival upgrades.<br/></li><li> Enhance yourself with medical supplies and continue research to develop even better versions.<br/></li><li> Survive long enough to unearth the terrible truth of what happened to the first wave of colonists or find a way to get off the doomed moon, no one said you get both...</li></ul>", "metacritic": null, "released": "2024-03-12", "tba": false, "updated": "2024-03-15T07:58:36", "background_image": "https://media.rawg.io/media/screenshots/a1a/a1a4c10ae2d6ce814dce22b4b2928bcc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 363, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pixellore"], "genres": ["RPG", "Indie"], "publishers": ["Freedom Games"], "esrb_rating": null}