{"id": 966503, "slug": "banter", "name": "Banter", "name_original": "Banter", "description": "Welcome to the wonderful world(s) of Banter VR. The physics-based social app where we enthusiastically encourage you to flex the magnificent art of wordplay, exaggeration, irony, sarcasm, and more while you have fun with your pals in VR.<br/><br/>Portal across the Bantaverse—a wide range of wacky worlds filled with… a whole bunch of weird sh*t, to be honest. From a winter wonderland packed with mini-games (and a giant snowman with no shame), to the ISS chock full of no gravity to float about in, our glorious suite of spicy spaces provides the perfect backdrop for your majestic Bantering.<h3>Reality is overrated </h3>We built Banter to get people connecting in VR and having a total blast while they do it. Our community is growing every day, with regular events in the calendar to keep the banter flowing. Invite your friends, create groups you control—and even build your own worlds to share (or keep hush-hush) at your leisure.<br/><br/>That’s right—we’ve got a comprehensive toolkit built into the back end to help you get creative. Unity, Blender, A-Frame, and more, pick your poison and let the good times roll.<br/><br/>(And you can find all the tips, tricks, and relevant info for creating in Banter right here.)<h3>Bring on the Banter</h3>* An ever-expanding Bantaverse filled to the brim with wacky worlds<br/><br/>* BoneLab-inspired physics engine for immersive exploration<br/><br/>* Fully customizable ReadyPlayerMe avatars—with legs!<br/><br/>* Crystal clear spatial audio to stay in on the banter (or mute yourself out)<br/><br/>* A fully curatable friends list—Banter is better together<br/><br/>* The chance to create—build your own worlds using Unity, Blender, A-Frame, and more<br/><br/>* A regular schedule of events to showcase Banter’s very best<br/><br/>* A welcoming community full of friendly and funky folks to banter with<br/><br/>* It’s totally free to join the banter—and always will be<br/><br/>Get Banter today, and get ready for the next level of hanging out.", "metacritic": null, "released": "2023-09-15", "tba": false, "updated": "2023-09-18T03:57:51", "background_image": "https://media.rawg.io/media/screenshots/200/200e3377c2233515b664091f322f0669.jpg", "website": "https://bantervr.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SideQuest"], "genres": ["Adventure", "Simulation", "Casual", "Massively Multiplayer"], "publishers": ["SideQuest"], "esrb_rating": null}