{"id": 966546, "slug": "dwarf-delve", "name": "Dwarf Delve", "name_original": "Dwarf Delve", "description": "\n<br/>\n<br/>\nWelcome to Dwarf Delve, Delveling! In this randomly-generated extraction roguelite, become the dwarf you were meant to be. Venture deep into treacherous mines in search of precious ores and hidden treasures as you explore what lies in the very depths of the earth.\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nTake up your Battlemallet and seize every valuable ore, treasure and legendary relic that you can get your gloves on. These ancient caverns have sat dormant for centuries…but not for much longer. \n<br/>\n<br/>\nStrategically place rails and utilize minecarts to efficiently transport your hard-earned ores to safety. Navigate through the darkness with the aid of lanterns and flares, illuminating the path ahead and uncovering secrets hidden in the shadows.\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nBut beware! These mines are riddled with unseen dangers and long-forgotten traps. One wrong boot could cost you your life - or worse, your loot! Craft essential support items like sturdy beams and platforms, dig deep to construct foundations, and buy yourself a little more time. Every decision counts as you strive to survive the labyrinthine tunnels and escape with your beard intact.\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nAfter a long venture into the underground, finally emerge from the depths, take solace in your cozy quarters, and take a breather. Refine the ores you've gathered during your expeditions and transform them into valuable assets. Utilize your newfound wealth to purchase a vast array of equipment and tools, enhancing your abilities and empowering you to strike harder, move faster, and carry more loot!\n<br/>\n<br/>\nThe adventure in Dwarf Delve is never-ending, as each delve presents a fresh and unique challenge. With every descent, hone your skills, learn from your experiences, and adapt to the shifting environment.\n<br/>\n<br/>\n<br/>\n<br/>\n<ul><li>A randomly-generated adventure. No two mines will ever be the same. Scour every corner for the rarest of ores and treasures and bring them home before everything falls on your head!\n<br/>\n</li><li>A massive array of tools and equipment. From your trusty Battlemallet, to the most basic lantern, gain the upperhand and strive to buy yourself as much time as possible before the inevitable collapse of these ancient caverns\n<br/>\n</li><li>Did somebody say…upgrades? Every piece of gear can be upgraded and customized to your playstyle; hit harder with upgraded tools or cast away shadows with a portable floodlight. You decide how to approach each delve.\n<br/>\n</li><li>Relax in your very own quarters. Customize everything from the carpets to the furnishings! Make it your own.\n<br/>\n</li><li>Skills for ores. Trade resources for coin and upgrade your Delveling by buying new perks and skills. Move faster, hit harder and carry more loot!\n<br/>\n</li><li>Work smarter, not harder. Place rail and construct networks of minecarts to shift and store those heavy ores for you! Attach tools to constructed carts and support beams to free up your hands whilst you strike the earth!\n<br/>\n</li><li>Failure is an option. Learn from your mistakes and overcome every obstacle that the treacherous mines can throw at you!</li></ul>\n<br/>\nAre you ready to embrace the call of the underground? Enter a place where fortune favors the bold and the depths hold unimaginable riches for those brave enough to seek them!", "metacritic": null, "released": null, "tba": false, "updated": "2023-09-18T05:01:47", "background_image": "https://media.rawg.io/media/screenshots/a3f/a3f0555b39fc8d5ad463644975a0c20e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gloom Box"], "genres": [], "publishers": ["Freedom Games"], "esrb_rating": null}