{"id": 966620, "slug": "time-survivors-chapter-0", "name": "Time Survivors: Chapter 0", "name_original": "Time Survivors: Chapter 0", "description": "This is the free Chapter 0 to <strong>Time Survivors</strong>, a rogue-like bullet hell game where you can <strong>play as legendary historical characters</strong> like Abe Lincoln, Tesla, Cleopatra, and more, each now wielding unique custom abilities that revolutionize gameplay. <br/><br/><br/>Transform into a flying ninja robot as Oda Nobunaga, create defensive barriers made of cherry trees as Abe Lincoln, or set the battlefield ablaze as Nero - the choice is yours. Each character brings<strong> a unique touch to every run</strong>, making each playthrough a unique adventure.<br/><br/><br/>Travel through time and <strong>fight hordes</strong> of memorable enemies as you unravel a mystery. With over 150 different weapons, items, Relics, and buffs to choose from, every run is a unique experience. Fight skeletons in the Medieval Age, Velociraptors and T-Rexes in the Stone Age, and discover plenty of quests and secrets along the way.<br/><br/><br/>But that's not all - Time Survivors: Chapter 0 presents a new meta progression system, allowing you to unlock and upgrade characters, weapons, and stages, even <strong>game mode modifiers</strong>, using gold and resources collected during your runs. Tailor your progression to your preferred playstyle and strategically <strong>allocate resources</strong> to create your own game-breaking build.<br/><br/><br/><br/><br/><ul><li>2 stages full of enemies, secrets, mini bosses  and end-stage bosses: The Dark Age and The Stone Age<br/></li><li>8 unlockable characters from the entire human history, <strong>each with their own unique ability</strong>!<br/></li><li>32 different weapons and buffs to choose from for a unique experience every run<br/></li><li>8 Cursed Relics<br/></li><li>41 different enemies<br/></li><li>35 Unlockables</li></ul><br/><br/><ul><li>9 stages full of enemies, secrets, mini bosses  and end-stage boss<br/></li><li>20 unlockable epic characters from the entire human history, <strong>each with their own unique ability</strong>!<br/></li><li>50+ different weapons and buffs to choose from for a unique experience every run<br/></li><li>20+ Cursed Relics<br/></li><li>107 different enemies<br/></li><li>80+ Unlockables</li></ul><br/><br/><ul><li>Play as epic historic characters, each with their unique ability<br/></li><li>Tree-based meta progression for all elements in the game<br/></li><li>Casual quick 20 minute play sessions + plenty of quests and secrets to discover<br/></li><li>A Sandbox mode to test any overpowered build and train against any enemy</li></ul><br/><br/><br/><br/>And since you've come this far... don't forget to <strong>wishlist the full game</strong> to stay up-to-date on the latest features and updates!<br/><br/>https://store.steampowered.com/app/2211390/Time_Survivors/", "metacritic": null, "released": "2023-09-18", "tba": false, "updated": "2023-09-22T03:00:58", "background_image": "https://media.rawg.io/media/screenshots/94b/94ba2af20cf371d61161ec51756b0435.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 470, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lunar Chili"], "genres": ["Action", "RPG", "Casual", "Indie"], "publishers": ["Lunar Chili"], "esrb_rating": null}