{"id": 966642, "slug": "bloodoomoon-survivor", "name": "BlooDooMooN SurViVoR", "name_original": "BlooDooMooN SurViVoR", "description": "During a flying reconnaissance mission, your aircraft unfortunately encounters a sudden and violent storm over the Bermuda region. Helpless against the forces of nature, you find yourself forced to make an emergency landing in a mysterious and unfamiliar world. This realm is brimming with unknown wonders and enchantment, calling for you to employ your wisdom and knowledge to embark on an entirely new journey of survival.<br/>\n<br/>\r\nStepping onto this unfamiliar terrain, you must swiftly adapt to the environment, gathering a variety of resources and crafting essential survival tools. Venture through the surrounding flora, mine valuable minerals, and study the vegetation. With these fundamentals, construct tools and create rudimentary shelters to shield yourself from the harsh weather conditions, particularly during the dreaded Blood Moon phase. Additionally, be diligent in fulfilling basic survival needs, such as seeking food, purifying water, and collecting wood, to ensure your continued existence in this uncharted world.<br/>\n<br/>\r\nDuring your adventurous exploration, you'll encounter a series of mystical teleportation points that link different regions together. These gateways seem to lead to otherworldly realms, where you'll engage in battles against brave souls from alternate realities. To establish a foothold in this mystical realm, you'll need to accumulate equipment and weaponry, constantly enhancing your own capabilities. Traverse various locales, gather rare materials, and forge powerful weapons in preparation for confronting the warriors from distant realms.<br/>\n<br/>\r\nHowever, you are more than just a warrior; you are a life architect. In this realm, you'll have the opportunity to rear animals, cultivate vegetable plants, and even experience the joy of fishing. Gradually master the art of animal husbandry, taming wild creatures to become dependable resources. The vicinity of your sanctuary can transform into a diverse array of farmlands, cultivating various vegetables and crops to sustain your nourishment. Moreover, the waters house delicious fish that can be acquired through fishing techniques, providing you with an additional delectable food source.<br/>\n<br/>\r\nIn this world teeming with mystery and challenges, you won't merely be a survivor but a creator. Through diverse survival methods like animal husbandry, agriculture, and fishing, you'll construct a multifaceted survival ecosystem, granting you a myriad of opportunities. Within this enigmatic land, your wisdom and courage will join forces to script an awe-inspiring legend.<br/>\n<br/>\r\nWithin this unfamiliar world, a phenomenon known as the \"Blood Moon\" exists. This extraordinary event signifies a sudden surge in the aggression of monsters, causing a multitude of creatures to rally and flood into the nearby areas.<br/>\n<br/>\r\nAs the Blood Moon descends, the sky takes on a crimson hue, enveloping the environment in an eerie atmosphere. The monsters become extraordinarily active and ferocious, unbound by time and space as they surge forth from all corners, posing an enormous threat. For survivors, this scenario serves as an immense trial, necessitating rapid readiness.<br/>\n<br/>\r\nTo weather the Blood Moon event, you must prepare thoroughly in advance. Equip yourself with robust weaponry and armor, construct sturdy defensive structures, and strategically choose battle locations. Simultaneously, cooperation with fellow survivors becomes paramount – together, you can repel the monsters' advances, supporting one another as you navigate these arduous times.<br/>\n<br/>\r\nThe emergence of the Blood Moon event presents not just a daunting test but also an opportunity. Engage in combat with the monsters to acquire rare materials and equipment, steadily boosting your strength. Additionally, adaptability is key; tailor your tactics according to the unique traits of each monster, striving to achieve victory in this life-and-death struggle.<br/>\n<br/>\r\nIn this world rife with unknowns and dangers, the Blood Moon event stands as another challenge you must confront. Through wisdom, courage, and collaborative effort, you can emerge victorious in the face of the Blood Moon event, ascending as a true hero within this enchanting world and becoming a radiant symbol of the Blood Moon survivors.", "metacritic": null, "released": "2023-09-19", "tba": false, "updated": "2023-09-22T03:32:32", "background_image": "https://media.rawg.io/media/screenshots/126/126fdcd94c07b611f61337a2543e26ac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 402, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WaterDance"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["WaterDance"], "esrb_rating": null}