{"id": 966673, "slug": "hana-exposure-a-blooming-flower", "name": "Hana Exposure! A Blooming Flower~", "name_original": "Hana Exposure! A Blooming Flower~", "description": "After being in an unfortunate accident which left her vehicle damaged, Hana was left stranded in a faraway town.<br/>\r\nHana, a naïve and pure high-class woman who had never worked before, sets out to work and save up money in order to pay for the repair of her vehicle.<br/>\n<br/>\r\nHana's lack of experience and naiveness will lead her into many embarrassing and shameless situations which will result in her having her body covered with men's gazes. Hana will experience for the first time all sorts of indecent feelings and sensations, and despite their indecent nature, she doesn't dislike. Instead... she notices that for some reason they make her heart race.<br/>\n<br/>\r\nThroughout her adventure, Hana will discover the pleasures of being exposed, and she will start exposing herself in various increasingly embarrassing and lewd ways. Hana for some reason refuses to let herself be touched by men, but that does not stop her from pushing herself and further exploring these new pleasures!<br/>\n<br/>\r\nFollow Hana as she discovers her lewd side while doing her best to work and have a good time at River Town!<br/>\n<br/>\n<br/>\n<br/>\r\nHana Exposure! is a simple and straightforward game in which you control Hana and are able to freely navigate River Town, interact with NPCs, enter points of interest, interact with events, etc.<br/>\n<br/>\r\nThroughout the town there are various points of interest in which Hana will be able to either work or spend some leisure time, with some areas having both options available. These activities will have Hana interact with events which will contain a variety of embarrassing and exposure-based situations.<br/>\n<br/>\r\nThere is no combat, or grinding in this game. In order to progress, Hana will simply have to interact with and see the available events in the current level, and once she clears them, her lewdness level will increase, which will unlock a new set of events throughout the town.<br/>\n<br/>\r\nThe gameplay loop is simple and straightforward. You walk around the town, start activities, and see events.<br/>\n<br/>\r\nThere are no branching plots. The plot as well as Hana's progression are both very linear.<br/>\n<br/>\r\nThere are no sex scenes in this game.<br/>\n<br/>\r\n-120+ Events<br/>\r\n-70+ CGs<br/>\r\n-Gallery system in which most events can be replayed<br/>\r\n-Fully translated into English and Japanese", "metacritic": null, "released": "2023-09-20", "tba": false, "updated": "2023-09-22T04:12:32", "background_image": "https://media.rawg.io/media/screenshots/057/057c369971c9e326da4c5cfc877cd82d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 337, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Flimsy"], "genres": ["RPG", "Indie"], "publishers": ["Flimsy"], "esrb_rating": null}