{"id": 966687, "slug": "tiny-mans-revenge", "name": "Tiny Man's Revenge", "name_original": "Tiny Man's Revenge", "description": "<strong>Billionaire Tim Martin, known by many as \"Tiny Man\", had an unfortunate encounter with a blue-collar worker who turned out to be a notorious villain. </strong><br/><br/><strong>As a result, Tim not only lost his soup but also his height, leaving him vulnerable and exposed. </strong><br/><br/><strong>It was a humbling experience for the once-arrogant businessman, and he couldn't help but wonder what other surprises life had in store for him if had had his soup. <br/>Despite his setback, Tim vowed to bounce back stronger and wiser, determined to reclaim his throne in the world of his delicious treat.</strong><br/><br/><br/><strong>Tim Martin shrugs off his loss of height but cries over his lost soup. <br/>He embarks on an epic adventure into an innocent, yet sinister man's house, <br/>using his skills in Glide, Climb, and Dodge to steal everything he can. <br/>With his haul, he hopes to afford his beloved soup once again.<br/><br/>Tiny Man's Revenge is an action-packed game where you play as a tiny person with the goal of stealing everything in a house. <br/>Realistic movements make the gameplay immersive, and multiple endings depend on your decisions throughout. <br/>The game provides a thrilling experience with its action-oriented gameplay and gives you the freedom to play as you want.</strong><br/>", "metacritic": null, "released": "2023-09-20", "tba": false, "updated": "2023-09-22T04:29:36", "background_image": "https://media.rawg.io/media/screenshots/580/580804e03c07f4487efd493aa4afb7fc.jpg", "website": "https://www.shangkostudio.com/tinyman", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["ShangkoStudio"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["ShangkoStudio"], "esrb_rating": null}