{"id": 966615, "slug": "dungeon-golf", "name": "Dungeon Golf", "name_original": "Dungeon Golf", "description": "Dungeon Golf is a mini golf party game broadcasted to you live from the Dungeon Sports Network, the ONLY television channel dedicated to dungeon-related sports. <br/><br/>Compete with your friends in online and local multiplayer or play solo to win trophies and climb to the top. Whack balls, battle enemies and get the upper hand with your abilities to change the odds.<br/><br/>Holes in one are for boring regular golfers, real pros shoot for the Holes In None!<br/><br/><br/><br/><ul><li>Play single player or compete with up to 3 friends. Online or locally!<br/></li><li>Polish your putt and sharpen your swing by touring solo in single player story mode.<br/></li><li>Choose from a line-up of whacky dungeon golfers each with their own strengths, weaknesses, and unique powerful abilities.<br/></li><li>Complete Challenges to unlock new abilities, courses, sponsorships and much more.<br/></li><li>Full controller support allows for precision putting.</li></ul><br/><br/><br/><br/><ul><li>Battle Goblins in the grand treasure halls of the Mountain Fortress, avoid Fire Golems and lava pits in the treacherous Volcanic Forge and try not to get cursed and fall off the windy peaks of the Ancient Temple.<br/></li><li>Defeat monsters that stand in your way to gain extra shots. Goblins, Zombies, Golems and of course, Slimes, are just some of the dungeons’ inhabitants.<br/></li><li>Destroy treasures and unlock chests to fill your mana bar and power your special moves.<br/></li><li>Avoid traps, obstacles and annoyances by using well-timed and well-aimed shots. The Dungeon Sports Network will throw everything at you for the sake of entertainment: walls of spikes, swinging axes and even buckets of lava!</li></ul><br/><br/><br/><br/><ul><li>Show your friends (and random internet strangers) who’s the greatest Dungeon Golfer in local and online multiplayer that supports up to 4 players.<br/></li><li>Jealous of your friend’s last stroke? Smash their ball into traps or even out of bounds to gain an advantage.<br/></li><li>Customise your matches to put your skills to the test!<br/></li><li>Activate powerful abilities to control where your golf ball rolls, knock back or swap places with your rivals, remove obstacles and much more!</li></ul><br/><br/><br/><br/><ul><li>Pick your golfer from a roster of 8 outrageous fantasy favourites, from buff barbarian to musical frog, each with their own strengths, weaknesses, and unique powerful abilities. <br/></li><li>Boost your game with lucrative product placement sponsorship deals that let you tweak your play style with extra abilities and perks. Just be warned, some of the products are borderline weird, creepy, or maybe just plain evil.<br/></li><li>Collect mana to recharge your abilities by collecting gems, destroying your environment or hitting a Perfect shot.</li></ul>", "metacritic": null, "released": "2023-09-18", "tba": false, "updated": "2023-09-22T02:52:35", "background_image": "https://media.rawg.io/media/screenshots/ff7/ff7b78c3ca75c0f0546e3dede889ed50.jpg", "website": "https://www.ant-workshop.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ant Workshop"], "genres": ["Sports", "Casual", "Indie"], "publishers": ["Ant Workshop"], "esrb_rating": null}