{"id": 966618, "slug": "eldritch-exterminators", "name": "Eldritch Exterminators", "name_original": "Eldritch Exterminators", "description": "Stand against the Abyssal monsters that threaten to consume you, and devour them to grow your power. Utilize several different characters to survive the Tribulations laid out before you and escape from the prison you find yourself trapped in. Unlock the secrets of this world and what happened to you, and find a way to escape your fate. Will you be able to discover the Way of the World and stand strong atop abominations seeking your doom?<br/><br/>With the wide variety of characters, abilities, and artifacts at your disposal, build to your strengths and break the laws of this universe. Move beyond the Mundane, pass through the Eerie, dominate the Eldritch, and embrace the Unspeakable to become a force this world has never seen. Rip through the evergrowing hordes to find the doors that conceal a past you can't remember and a future that hasn't been written. Shred enemies with a fast-firing machine gun, dance around monstrosities with the nimble revolver, smash down foes with a powerful shotgun, or cut through them all with the terrifying Rail Gun.<h3>Key Features</h3><br/><ul><li>A growing list of characters and abilities<br/></li><li> High speed, intense combat against a variety of foes<br/></li><li> Unique build options that can be tailored for each character<br/></li><li> Eldritch horrors beyond your comprehension!<br/></li><li> Tentacles!(?)</li></ul>", "metacritic": null, "released": "2023-09-18", "tba": false, "updated": "2023-09-22T02:57:00", "background_image": "https://media.rawg.io/media/screenshots/089/0899520ec953c15ab5a04c60617b9e57.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ephern Games"], "genres": ["Action"], "publishers": ["Ephern Games"], "esrb_rating": null}