{"id": 966769, "slug": "heretic-gods", "name": "Heretic Gods", "name_original": "Heretic Gods", "description": "<p>You are looking for a &quot;Action Role Playing Game&quot; ?<br />\nWell, Heretic Gods is simply the best game for Android if you are ravenous for Epic Loot, mastering skills and to butcher through hordes of monsters in dark dungeons.</p>\n<p>Heretic Gods is an ARPG in which players can enter a dark world, full of dungeons and monsters, set in the land of the Viking Myths. Your objective will be to enter the depths of a cursed abbey to banish the heretical gods.</p>\n<p>The control system of Heretic Gods is intuitive and is very well adapted to tactile devices. With the virtual crossbar on the left of the screen you can move your character, while with the buttons on the right you can attack and use skills. With just pressing the attack buttons, your hero will automatically target the nearest enemy.</p>\n<p>The dungeons of Heretic Gods are generated randomly, so you will never play twice in the same scenario. That said, many levels are very similar to each other, with different variations in architecture and especially in the variation of enemies. The more levels you raise, the deeper you dive into new dungeons with stronger enemies to fight.</p>\n<p>A very important aspect of Heretic Gods is the loot. You can find and equip hundreds and hundreds of different objects, including axes, helmets, gloves, boots, armor, shields, bows, swords, rings, and so on. In the village, in addition, you can trade with its inhabitants or even craft your own items.</p>\n<p>Heretic Gods manages to successfully adapt the formula of popular roleplaying games to tactile devices. For this, it not only offers an accessible control system, but also some levels with a relatively short duration, which we can finish in a few minutes perfectly styled for mobile gaming.</p>\n<p>• random generated dungeons<br />\n• shape up different character-builds out of 48+ skills<br />\n• adjustable graphic settings for best performance even on old hardware<br />\n• innovative auto targeting system<br />\n• optional auto fight system<br />\n• infinite random generated magic items<br />\n• hundreds of unique items and set items<br />\n• fully playable for free<br />\n• 3 difficulties<br />\n• ongoing updates for even more game-content</p>\n<p>HereticGods grants full playability now and will be upgraded through updates.<br />\nfuture updates will include more:<br />\n• unique items<br />\n• set items<br />\n• enemies<br />\n• boss enemies<br />\n• quests<br />\n• skills<br />\n• game environments</p>", "metacritic": null, "released": "2018-02-10", "tba": false, "updated": "2023-09-22T07:38:47", "background_image": "https://media.rawg.io/media/screenshots/1a7/1a75bd8eabc2a5d79e528a7b435f815b.jpg", "website": "https://play.google.com/store/apps/details?id=com.curacha.hereticgods&hl=en", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 294, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": [], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}