{"id": 966767, "slug": "epic-empire-a-heros-quest", "name": "Epic Empire: A Hero's Quest", "name_original": "Epic Empire: A Hero's Quest", "description": "<p>With merciless bandits and deadly bosses around every corner, only the most fearless and strategic leader can bring honor to his empire. Arm your heroes, prepare for battle, and defend your town!</p>\n<p>COLLECT AN ENDLESS SUPPLY OF WEAPONS AND ARMOR</p>\n<p>Claim swords, steel, and shields from fallen opponents<br />\nOutfit your warriors in your favorite combinations of gear</p>\n<p>BATTLE POWERFUL BOSSES IN REAL-TIME COMBAT</p>\n<p>Encounter bandits, barbarians and more as you explore a mysterious land on the edge of civilization<br />\nShow no mercy as you put your fighting skills the test</p>\n<p>STRENGTHEN YOUR ARMY<br />\nForge your old gear and evolve your weapons into magnificent pieces of armor<br />\nUpgrade your characters and equipment to reach maximum power</p>\n<p>BRING GLORY TO THE REALM<br />\nTake command of your military outpost and design the city of your dreams<br />\nBuild your empire from the ground-up to create the strongest force in all the land</p>\n<p>Supports Tablets!</p>\n<p>Please note that Epic Empire is free to play, but you are able to purchase game items with real money. If you want to limit the ability to make in-app purchases, you may create a PIN in the Settings menu from within the Google Play Store.</p>\n<p>Your use of this application is governed by the Terms of Service available at http://pocketgems.com/terms. Collection and use of your data are subject to the Privacy Policy available at http://pocketgems.com/privacy.</p>", "metacritic": null, "released": "2014-02-21", "tba": false, "updated": "2023-09-22T07:32:00", "background_image": "https://media.rawg.io/media/screenshots/be3/be3e2002dac65b8f4d070cb356d8f1e1.jpg", "website": "https://play.google.com/store/apps/details?id=com.pocketgems.android.epicempire&hl=en", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Pocket Gems"], "genres": ["RPG"], "publishers": ["Pocket Gems"], "esrb_rating": null}