{"id": 966784, "slug": "steel-roamer", "name": "Steel Roamer", "name_original": "Steel Roamer", "description": "<strong>In the desolate Australian outback of 1997, Steel Roamer offers a brief, chilling horror experience. The twisted parody of a kangaroo, born from Wonder Magpie station's ominous shadow, blankets the land in eternal dread.</strong><h3>FEATURES</h3><ul><li>Embark on an RV journey into experimental minimalist gameplay, where your senses are constrained and the unknown lurks at every turn</li></ul><ul><li>Navigate the RV's interior using thermal vision on monitor screens, unveiling the lurking horrors that surround you</li></ul><ul><li>Horror scenario designed to evoke a growing sense of dread and paranoia</li></ul><ul><li>Original sounds made by Max Simmons</li></ul><ul><li>A short experience intended to be finished in 30 minutes or more</li></ul><br/><h3>GAMEPLAY</h3><strong>DRIVING SIMULATOR:</strong> Awakening within the RV's suffocating confines, you step from the shadows into a bone-chilling reality on this nightmarish odyssey. The shift from abyssal darkness to stark clarity jolts your senses, immersing you in an unrelenting suspense. Your gaze fixates on the modified RV's front and back consoles, your lifeline amidst the terror. <br/><br/><strong>YOUR MISSION:</strong> Trigger all 9 signal towers, beckoning desperately for aid to rein in the abominations lurking beyond in the wasteland's depths.<br/><br/><h3>STORY</h3>In the haunting year of 1997, in the desolate fringes of Australia where Wonder Magpie Station's ominous shadow stretched, a cursed presence emerged a twisted parody of a kangaroo, casting a permanent shroud of dread over the land. This malevolent entity bore sinister names like \"Shadow Hopper\" and \"Silent Roo,\" but none invoked more fear than the dreaded \"Kylieroo.\" Whispers tell of its horrific birth: a ghastly, glowing harvest egg fused with an unearthly cobalt plant, a union that defied the natural order. Legends recount audacious experiments and a relentless thirst for forbidden knowledge. <br/><br/><br/>Yet, within the grim walls of Flowers Gap, disaster was unleashed. From the very core of the egg surged a hellish blaze of enigmatic warmth and deadly decay, spawning a vile contagion that consumed the ill-fated laboratory, sealing its fate in a malevolent and suffocating embrace.", "metacritic": null, "released": "2023-09-23", "tba": false, "updated": "2023-10-24T00:52:36", "background_image": "https://media.rawg.io/media/screenshots/3d3/3d3272e4f692feb7b63813dd498cba12.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Kyle Kirley"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Cornet Interactive"], "esrb_rating": null}