{"id": 966710, "slug": "dropkick-navvy-first-step", "name": "Dropkick Navvy: First Step", "name_original": "Dropkick Navvy: First Step", "description": "Do you dig crafting games like Minecraft, Astroneer, and Forager? How about goofy physics sims like Human: Fall Flat or Moving Out?<br/><br/>We love both — so we smushed em together!<br/><br/>\"First Step\" is a short demo for the upcoming \"Dropkick Navvy\", designed to help us fine-tune the fun. Go ham on rocks and trees with slapdash tools you made yourself, then pile 'em into your little wicker basket and wobble back to your workbench in charmingly precarious fashion.<br/><br/>Or just dropkick them suckers clear across the map. Ain't nobody got time for all that.<h3>Features</h3><br/>Our dev team forgot how nested arrays work and didn't feel like coding an inventory system, so you only have two slots for carrying stuff: your left paw, and your right one.<br/><br/>I don’t know, man. Figure it out. Did I mention you can kick things?<br/><br/><br/><strong>Run Around and Stuff</strong><br/>Some games tie their sprint functions to stamina bars. Not us! In this game, you can run all over creation to your heart’s content. I mean, creation is like 10 feet wide until you make more of it, but still.<br/><br/>Also there's, like, junk on the ground. You can trip and drop stuff. And then you’ll be like “ahhh, noooo, my stuff” and have to stop to pick it up.<br/><br/><br/><strong>Platforms and Puzzles</strong><br/>Like jumpin' off things? We got you.<br/><br/>Like puzzles? Behold: We have prepared several.<br/><br/>We’ve got all sorts of stuff in here. And we're planning to add even more!<br/><br/>", "metacritic": null, "released": "2023-09-21", "tba": false, "updated": "2023-09-22T04:59:33", "background_image": "https://media.rawg.io/media/screenshots/00f/00fd2632dee724a7adebc4f418fd2076.jpg", "website": "https://www.oceandrive.studio", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 25}, "playtime": 1, "achievements_count": 24, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ocean Drive Studio"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Ocean Drive Studio"], "esrb_rating": null}