{"id": 966709, "slug": "deskape", "name": "dEskape", "name_original": "dEskape", "description": "From the team that made Desktopia comes 'dEskape': a new world to build, manage, and defend at the bottom of your desktop!<br/><br/>At its core, 'dEskape' is a base-building game which sits across the bottom of your desktop allowing you to work, browse, or watch something else while you play. It's idle when you like and active when you want.<br/><br/>Like any base-builder, you get to make the big decisions while taking control of your own laser shooting, resource-collecting character whose only objective is repairing their broken ship and getting off the dark and dreary rock onto which they've crashed.<br/><br/><h3>SPECIAL FEATURES</h3><br/><ul><li>    A completely original approach in PC gaming: designed with functionality in mind, 'dEskape' allows you to use your PC for multiple purposes on a single monitor.<br/></li><li>    Clever UI: with resizeable pop-out windows which can be arranged anywhere on your screen, including a radar, log and build menu.<br/></li><li>    A playable character which you can level up allowing you to jump into the action whenever you want.<br/></li><li>    Mystical, weather and lighting effects that are a delight for the eyes.<br/></li><li>    A fully circular planet: keep walking one way and you'll arrive back home.<br/></li><li>    A high-power active mode where resources are plentiful but so are the enemies, and a low-power idle mode for when your attention is elsewhere..</li></ul><br/><h3>THE GAME</h3><br/><ul><li>    From nothing but the ruins of your ship: construct the infrastructure to escape the planet and build a truly massive base.<br/></li><li>    Construct a range of facilities (factories, research labs, alien technology, mystical crops) and watch as storage creatures and aliens take up residence around your base.<br/></li><li>    Wander away from the safety of your base to find resources and crashed resource pods.<br/></li><li>    Research strange creatures and use them to create new and powerful resources.<br/></li><li>    Construct droids, level them up, give them new skills, and take them out into the dark to collect resources, and destroy the dangerous blood hives that are attracted to your industry.<br/></li><li>    Research new weapon types, and wield them against the dark creatures which try to steal your light.</li></ul><br/>", "metacritic": null, "released": "2023-09-20", "tba": false, "updated": "2023-09-22T04:58:22", "background_image": "https://media.rawg.io/media/screenshots/6ed/6ed5a6678851681a804882b0ecf38b53.jpg", "website": "https://www.evergloomworld.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Evergloom Team"], "genres": ["RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["The Evergloom Team"], "esrb_rating": null}