{"id": 966700, "slug": "adventurer-farmer-save-my-son", "name": "Adventurer Farmer: Save my son!", "name_original": "Adventurer Farmer: Save my son!", "description": "Father and son leave their farm, aboard their old plane, heading for the city. Their objective was to sell the fruits produced with the farm's work.<br/><br/>Halfway through, something frightening happens: the old plane starts to show problems and the fruits, produced with so much work, start to get lost along the way.<br/><br/>But the worst is yet to come...<br/><br/>Suddenly, the plane's windows open, and the window next to the boy breaks, and without the father noticing, the son is pulled out of the plane.<br/><br/>They are above the clouds.<br/><br/>After this happens, the father realizes everything that is happening and despairs for a moment.<br/><br/>But his adventurous spirit gives him the strength to go in search of his beloved son, to save him from the fall and the dangers of the place.<br/><br/>The father tries with all his might, but unfortunately he lands with his parachute very far from the boy.<br/><br/>Now, he needs to overcome a forest full of dangers to save his son, and he will have to fight if he doesn't want them to be lost in the depths of the forest, forever.<br/><br/>---<br/><br/>Father and son need all your strength, intelligence, gamer skills and your courage to overcome this journey!<br/><br/>---<br/><br/><strong>GAMEPLAY:</strong><br/><br/>● You can play with joystick or mouse if you prefer.<br/><br/>● The game has a dynamic movement mechanic, through the farmer's rope. She clings to hard surfaces and makes him move across the map at different speeds.<br/><br/>● The player needs to control the physics, in a fluid and natural way, so that the character moves in the right direction, taking advantage of impulses and points where the character's rope grabs the surfaces.<br/><br/>● The path will have challenges such as thorns and areas that cannot be passed, but it will also have rewards and the trail of goods will guide you through the levels until you rescue your child.<br/><br/>---<br/><br/>Will he make it through the journey?<br/><br/>The adventure is all yours!<br/><br/>:)", "metacritic": null, "released": "2023-09-20", "tba": false, "updated": "2023-09-22T04:45:46", "background_image": "https://media.rawg.io/media/screenshots/75c/75ceb823c824e545d8e1debd39210076.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NaipSoft"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["NaipSoft"], "esrb_rating": null}