{"id": 966739, "slug": "monolith-requiem-of-the-ancients", "name": "Monolith: Requiem of the Ancients", "name_original": "Monolith: Requiem of the Ancients", "description": "Journey across Gliese, a mystical world under threat by dark forces in this vibrant action RPG. Aided by a mysterious presence, embark on a dangerous adventure with the power of the Runic Swarm in your hands. Crush the minions of evil on your path to fulfill your destiny and become the planet’s savior.\n<br/>\n<br/>\nPlay as Astor - a young Diokek engaged in a fight for his world’s survival as he attempts to unearth the secrets of the past. Learn new abilities, gain magical powers, and collect legendary weapons on your quest to stop an unholy ritual.\n<br/>\n<br/>\nFEATURES\n<br/>\n<br/>\n<br/>\n<br/>\nEXPLORE A VIBRANT WORLD\n<br/>\n<br/>\n<br/>\n<br/>\nTraverse the mystical world of Gliese, searching its majestic landscapes, mysterious ruins, and ancient temples for the secrets left behind by an ancient civilization.\n<br/>\n<br/>\nShift into the spirit realm where echoes of the past linger, granting passage to inaccessible places, perhaps containing answers to save the future.\n<br/>\n<br/>\nDEFINE YOUR COMBAT STYLE\n<br/>\n<br/>\n<br/>\n<br/>\nArm yourself with powerful weapons and special abilities as you engage in intense, fast-paced battles.\n<br/>\n<br/>\nSwitch between equipped weapons at any time–even mid-combo to deliver unyielding critical hits.\n<br/>\n<br/>\nPummel your enemies with a combination of melee strikes, ranged attacks, air combos or summon powerful constructs. The choice is yours!\n<br/>\n<br/>\nCollect orbs to unlock new techniques, skills, and combos to grow stronger as you prepare for armies of relentless enemies and brutal bosses.\n<br/>\n<br/>\nWIELD THE RUNIC SWARM\n<br/>\n<br/>\n<br/>\n<br/>\nHarness the power of the Runic Swarm, an arcane energy used to materialize Monolithic Constructs as weapons or tools.\n<br/>\n<br/>\nSummon companions, shields and decoys to gain the upper hand in combat, or unleash charged attacks to create devastating finishers, such as the Wall Crush and Runic Coffin!\n<br/>\n<br/>\nAN ENTHRALLING ADVENTURE UNFOLDS\n<br/>\n<br/>\n<br/>\n<br/>\nYour journey will lead you down a path of discovery toward who you are and your true purpose. Uncover answers to solve the mysterious disappearance of the ancients thousands of years ago as your destiny unfolds in an epic tale of good and evil.", "metacritic": null, "released": null, "tba": false, "updated": "2023-09-22T05:44:44", "background_image": "https://media.rawg.io/media/screenshots/6e3/6e3056437707e4699d4ad6b728c03728.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 569, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["C2 Game Studio"], "genres": [], "publishers": ["Versus Evil"], "esrb_rating": null}