{"id": 966738, "slug": "the-legend-of-heroes-trails-through-daybreak", "name": "The Legend of Heroes: Trails through Daybreak", "name_original": "The Legend of Heroes: Trails through Daybreak", "description": "\n<br/>\nIn the aftermath of a brief war, Calvard is enjoying unprecedented economic prosperity. However, the public grows uncertain as the number of immigrants increases and questionable political reform runs rampant. Follow the spriggan Van Arkride on a unique request that will prove more than he bargained for. Will the nation fall into chaos?<br/>\n<br/>\nThe Story So Far…<br/>\n<br/>\nThe spriggan's life is but one of many professions that has emerged from the Calvard Republic. Be it playing detective, negotiator, or bounty hunter, Van Arkride takes on the kind of work that legitimate sources can’t accept. Whether it’s work that's best left out of the public eye, or even a request from a criminal organization in the underworld; so long as it pays, he'll accept near-any job that comes across his table.<br/>\n<br/>\n<br/>\nThe year is S.1208. A prim-and-proper young lady dressed in the uniform of an esteemed academy visits a rundown multi-tenant building in the Old Town district of Edith, the nation's capital. With a most dignified gaze, she looks upon the plaque of the door before her. It reads: 'ARKRIDE Solutions Office: Complicated Matters Only.'<br/>\n<br/>\n<br/>\nSteeling herself, she knocks on the door three times.<br/>\n<br/>\n<br/>\n\"First thing in the morning...?\" a relaxed yet surprisingly young voice grumbles with a yawn.<br/>\n<br/>\n<br/>\nFrom the moment he opens the door to greet her, a new tale begins.\nGameplay Details:\n<br/>\nA Case in Calvard: Follow the bounty hunter Van Arkride as he takes on a case that will change the nation’s fate…as well as his own. Explore the reaches of the Calvard Republic while immersing yourself in a rich story filled with action and intrigue.<br/>\nSpriggan to Action: Transition seamlessly between action field battles and turn-based combat with the revamped AT (Action Time) Battle system, and expand your arsenal of Arts and Skills with the sixth-generation combat orbment, Xipha.<br/>\nBetween Law and Chaos: Under the Alignment system, your choices and actions affect how your story unfolds. Your propensity towards Law, Chaos, and the shades in between can influence your status in the city, who will ally with or oppose you, and even what jobs and dialogue options are available to you.<br/>\n<br/>\n<br/>", "metacritic": null, "released": null, "tba": false, "updated": "2023-09-22T05:42:39", "background_image": "https://media.rawg.io/media/screenshots/5bd/5bd5f2353da0a886833151e899d60830.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nihon Falcom"], "genres": [], "publishers": ["NIS America"], "esrb_rating": null}