{"id": 966850, "slug": "the-events-at-unity-farm", "name": "The Events at Unity Farm", "name_original": "The Events at Unity Farm", "description": "On a strange and forgotten farm, a teenager uncovers an inter-dimensional battle between an occult scientist and an insidious global corporation that unleashes the Multipocalypse.<br/><br/>In EVENTS AT UNITY FARM, you will prevent the future Multipocalypse by engaging in riveting spell shooting combat, solving puzzles, crafting and gathering. This open-world virtual reality game pits you against advanced enemies in an ever-expanding story universe that mixes the best of dark fantasy, with elements of Lovecraft and a dash of steampunk for good measure. But beware! Monsters lurk around every corner and some of them are human. The nefarious Graumann Company has also taken up residence on Unity Farm with the intention of using the farm's powers for their own sinister ends.<br/><br/><br/><br/>Pick up and wield spells from your magical spell book. Grow your arsenal of elemental magic and harness unique spells to fight enemies and solve puzzles. With a spell in each hand combine different elements together to create devastating combo attacks. Tap into ancient places of power to improve your combat skills and purchase spell upgrades.<br/><br/><br/><br/>You’ll have to use all your skills to survive against a number of formidable enemies and bosses. Beware as creatures from myth, legend, technology and human experimentation gone wrong lurk around every corner of the farm. Outwit their tactics and find their weak spots. THE EVENTS AT UNITY FARM employs an advanced AI technology generated through evolutionary computing to create unique groups of emotionally driven and tactical enemies.<br/><br/><br/><br/>Use the tools you acquire to solve puzzles and gain clues to achieve your ultimate goal: reawakening an ANCIENT PORTAL to help a mysterious ghost girl trapped on Unity Farm. Search around you for useful objects, peer through your enchanted Magnascope to reveal things unseen to the naked eye and utilize your arsenal of spells. You’ll have to use all the tools at your disposal to decipher the puzzles left by your ancestors to uncover the secrets kept safe from the prying eyes of the Graumann Company.<br/><br/><br/><br/>In EVENTS AT UNITY FARM, you will step into the shoes of Ruth Bowie, to uncover the mysteries of your family’s magic and the ancestral land where it was first activated. To do so you will travel back in time to a crucial moment in your family’s history. But, upon arriving in the past, you quickly discovers that something has gone terribly awry. Your grandmother Alliss is dead, the farm is under attack and the Multipocalypse is nigh.<br/><br/>The deeper you dig into the family secrets that led you to this moment in time, the more you must rely on the gadgets and spell book left behind by your great grandmother LIV BOWIE, in order to ward off THE RISEN DEAD, the bosses that control them, and the PORTAL CREATURE lurking in the lake. All the while, hearing whispers from relatives you've never met. Are you going crazy? It is a side effect of time travel? Or, perhaps, magic? Should trust the information you're getting. Will it lead you to success or into danger?<br/><br/>And to make matters worse, You find yourself slowly being erased from the timeline by the dark presence responsible for these discrepancies in history. You've got to reawaken the Ancient Portal and resurrect Ghost Alliss before you too become an eternal captive of Unity Farm….<br/><br/><br/><br/>The farm is teeming with ancient magic and steampunk gizmos left by your ancestors. You’ll have to search every nook and cranny of this Alberta farm to discover all of its secrets and collect the remnants of information your family left behind for you.<br/><br/><br/><br/><ul><li>Persistent enemies and epic Souls-like boss battles<br/></li><li>Numerous spells, upgrades and combinations<br/></li><li>Immersive built-for-VR gameplay with movement-focused action and physical menu systems<br/></li><li>Dynamic 2SLGBTQIA characters who are women of color<br/></li><li>A large variety of potions to craft that enhance combat, and provide unique skills<br/></li><li>Evocative cinematics, illustrated and animated by hand in VR<br/></li><li>Gorgeous environments based on a real world locations in Alberta, Canada<br/></li><li>A ​rich original score, balanced to key story moments and gameplay, accompan​ies you on your journey<br/></li><li>Environmental and spell-based puzzles<br/></li><li>Hidden collectibles and secrets<br/></li><li>Customizable comfort and accessibility options for VR with different movement options<br/></li><li>Customize your story experience with different navigation modes</li></ul>", "metacritic": null, "released": "2023-09-22", "tba": false, "updated": "2023-09-25T03:59:38", "background_image": "https://media.rawg.io/media/screenshots/819/819539267ce1b475f566e4062dde307a.jpg", "website": "https://www.titan1studios.com/featured-work", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 281, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Titan1Studios"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Titan1Studios"], "esrb_rating": null}