{"id": 966843, "slug": "crime-pays", "name": "Crime Pays", "name_original": "Crime Pays", "description": "Crime Pays is an immersive top-down 2D RPG crime simulator that plunges you into a gritty virtual world. Embark on a thrilling journey as you navigate through a vast open city, filled with intriguing quests and dangerous encounters.<br/><br/>Engage in a wide range of quests that cater to your adventurous spirit. Whether it's helping someone deal with their noisy neighbor, stealing valuable items, or working for an underground crime boss, the game offers a diverse array of challenges to keep you on the edge of your seat.<br/><br/>One of the standout features of Crime Pays is its robust computer system. Accessible through an in-game browser, the computer system allows you to delve into a virtual world within the game. Use keywords to search and explore various websites, each offering a unique user-interface and serving a distinct purpose. The computer system adds a layer of immersion and depth to your gameplay experience.<br/><br/>Arm yourself with an arsenal of firearms that ranges from trusty pistols for up-close encounters to long-ranged snipers for precise eliminations. Choose your weapons wisely as you face off against your enemies. Every firefight is a test of your skill and strategy.<br/><br/>Delve into the intricacies of an intuitive inventory system that allows you to scavenge and loot items from a variety of containers. Encounter different types of locks for different containers, including regular lockpicks for basic locks, as well as combination padlocks that challenge your dexterity and problem-solving abilities.<br/><br/><br/><br/>", "metacritic": null, "released": "2023-09-22", "tba": false, "updated": "2023-09-25T03:49:24", "background_image": "https://media.rawg.io/media/screenshots/ba3/ba31fd7d52cfd69411040197a3e3f112.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Moonlight Productions"], "genres": ["Action", "Adventure", "RPG", "Simulation"], "publishers": ["Moonlight Productions"], "esrb_rating": null}