{"id": 966872, "slug": "puzzles-for-clef", "name": "Puzzles for Clef", "name_original": "Puzzles for Clef", "description": "Puzzles for Clef is a relaxing adventure game focused on the eponymous heroine. Following a letter from her sister, Cres, our bunny friend Clef journeys to the island of her ancestors, to undertake a treasure hunt... The journey will take her across a land of beauty, magic, and mystery, as she explores each of the island’s regions, solves its countless puzzles, unearths long-forgotten secrets, and rediscovers her family’s legacy.<br/><br/><br/><br/><br/>The treasure hunt is a birthday gift from one sister to another. It’s an invitation to a world full of magic and mystery! <br/><ul><li> Visit nine distinct regions, from a serene bamboo forest to an opulent floating castle. <br/></li><li> Each region has its own, distinct feel and secrets to discover!  <br/></li><li> Every puzzle found in each zone aims to challenge your wit!</li></ul><br/><br/><br/><br/>It’s not just Clef and Cres on the island. Many people make their home there, with personal quests they can share with Clef.<br/><ul><li> Meet the Lord of the island and his associates!<br/></li><li> Many have memorable quests for Clef to accomplish.<br/></li><li> Find a variety of items dear to the locals throughout Clef’s travels.</li></ul><br/><br/><br/><br/>The journey to give the bells back their voice is not a linear one. Clef will need your help.<br/><ul><li> Dozens of puzzles and ciphers await to be solved.<br/></li><li> Each is designed to be logical and understandable.<br/></li><li> No pixel hunts or moon logic: every task is meant to be challenging yet relaxing, not frustrating!</li></ul><br/><br/><br/><br/>The floating island is a place of mystery, wonder, and endless secrets. <br/><ul><li> With each completion of the treasure hunt steps, secrets of the ancient island will slowly be revealed!<br/></li><li> Every secret might answer a question - but also unlock even more puzzles to complete.<br/></li><li> Discover the history of the island and Clef’s ancestry.</li></ul><br/><br/><br/><br/>By the way, don’t worry about monsters or dangers. Cres would never put her sister’s life in danger.<br/><ul><li> Clef is free to explore and experience the island at her leisure, breaks encouraged!<br/></li><li> Fret not about death or danger or recycled enemy types.<br/></li><li> It’s just a bunny and her puzzles.</li></ul>", "metacritic": null, "released": "2024-03-06", "tba": false, "updated": "2024-03-11T11:43:59", "background_image": "https://media.rawg.io/media/screenshots/a3f/a3f017ab6398b8bd8f3620f8cbd1f93f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 539, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Weasel Token"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Freedom Games"], "esrb_rating": null}