{"id": 966857, "slug": "psyche60s", "name": "Psyche60s", "name_original": "Psyche60s", "description": "The Psyche60s is a 3D experience that combines a unique collection of artwork, original music soundtracks, and rich historical insights that took place in San Francisco in the 1960s. This innovative concept was brought to life by the renowned photographer Roberto Rabanne and recreates the iconic Human Be-In event, better known as \"The Gathering of the Tribes.\", where over 20,000 people gathered in San Francisco's Golden Gate Park Polo Fields on January 14, 1967, to experience psychedelics en masse.<br/>\n<br/>\r\nIt was a prelude to San Francisco's Summer of Love, which made the Haight-Ashbury district a symbol of American counterculture and introduced the word “Psychedelic\" to the rest of the world.<br/>\n<br/>\r\nHistorians have reclassified the ‘Summer of Love’ as a major social experiment, in which young people began to question the social spheres, mores, and practices in which they grew up. They decided that major structural changes had to happen to address some of the inequities that we were living with for too long.<br/>\n<br/>\r\nTake your time leisurely as you enjoy this special experience exploring the rich history of this paradigm-shifting, massive cultural \"Youthquake!\".<br/>\r\nOutside, you will experience the Alice in Wonderland-themed topiary gardens that host a big Psychedelic Victorian House. Once inside the House, you will meet some of the key influencers and artists of the Psychedelic era and learn about how each left their footprints during those revolutionary times.", "metacritic": null, "released": "2023-09-23", "tba": false, "updated": "2023-09-25T04:10:15", "background_image": "https://media.rawg.io/media/screenshots/c08/c08987f5960f5b6b65cb20c31980c5dd.jpg", "website": "https://psyche60s.sigmaways.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SigmawaysInc"], "genres": ["Simulation"], "publishers": ["SigmawaysInc"], "esrb_rating": null}