{"id": 966860, "slug": "semu", "name": "SEMU", "name_original": "SEMU", "description": "Survival is <strong>Key!</strong><br/>With our latest innovation is space suit development, we can ensure your continued safety no matter where you travel in the universe. Worried about your water and oxygen levels? Tracked and maintained constantly. Current position in relation to galactic co-ordinates? Monitored and displayed in your visor. The current temperature and humidity in your surroundings? Not a problem. All that's left for you to do is...Well...Nothing !<br/><br/>Mobility is <strong>Easy!</strong><br/>We know what you really want out of a space suit! Gone are the days of slowly floating around space, moving at the speed of my grandma (she's got a bad hip). With our SEMU suit, you will be zooming around planets at Lightspeed!*. Using the ingrained Grapplehook, you will be able to fling yourself around like a man with spider like abilities. And coupled with the jetpack for extra mobility, you will soon forget about a thing we call the ground! Barren planets become skateparks, so how will you be travelling around?<br/><br/>*For legal reasons, we have to stipulate that users WILL NOT be travelling at light speed, this was merely a hyperbole for dramatic effect<br/>Exploration is <strong>Free!</strong><br/>No matter where you end up in the cosmos, the SEMU suit will ensure your survival. If you, for a random hypothetical scenario, were to find yourself stranded on a barren planets with a crashed ship, escape is all but guaranteed. Your current objective will be displayed for you, and all you will need to do is find the lost parts of your broken ship. In this completely made up example of course that's the case. Complete hypothetical.<br/><br/>", "metacritic": null, "released": "2023-09-23", "tba": false, "updated": "2023-09-25T04:13:39", "background_image": "https://media.rawg.io/media/screenshots/03c/03cfc46d01fd420d4584a2d1317a1167.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["InkForge Studios"], "genres": ["Indie"], "publishers": ["InkForge Studios"], "esrb_rating": null}