{"id": 966815, "slug": "bud-spencer-terence-hill-slaps-and-beans-2", "name": "Bud Spencer & Terence Hill - Slaps And Beans 2", "name_original": "Bud Spencer & Terence Hill - Slaps And Beans 2", "description": "<strong>Bud Spencer</strong> and <strong>Terence Hill</strong> are back again! The new game is a sequel to the first game and just like a movie saga. The story picks up where it left off at the end of the first Slaps and Beans. Our heroes will experience adventures in new places with new events and will also meet many new characters along the way.<br/><br/><br/><br/><strong>Slaps and Beans 2</strong> returns as a scrolling fighting game with a retro gaming, co-op or single player look with a platform mechanic that allows the player to control Bud Spencer and Terence Hill in a revised and improved version of the combat system. Brand new environment dynamics that progressively add enemies as the difficulty increases and of course again with lots of funny quotes.<br/><br/><br/><br/>New mini-games that can be played repeatedly in a dedicated party play area for up to 4 players.<br/><br/><br/><br/>And finally the dubbing in four languages that immerse the player even more in the real Bud Spencer and Terence Hill ambience.<br/><br/><br/><br/>The main features of Slaps And Beans 2 are:<br/><br/>- 80s pixel art graphics<br/>- improved Bud and Terence-style combat system<br/>- cooperative mode<br/>- minigames in 4-player party game mode<br/>- voiceovers in 4 languages<br/>- lots of slaps and lots of beans (double at least, of course!)<br/><br/>", "metacritic": null, "released": "2023-09-22", "tba": false, "updated": "2023-12-27T10:03:00", "background_image": "https://media.rawg.io/media/screenshots/48c/48c45b6bd2e8f2b86ebeb7e9ba9b7ab4.jpg", "website": "http://www.slapsandbeans.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "beaten": 3, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 34, "ratings_count": 2, "suggestions_count": 290, "game_series_count": 0, "reviews_count": 3, "platforms": ["Linux", "macOS", "PC"], "developers": ["Trinity Team"], "genres": ["Action", "Indie"], "publishers": ["Buddy Productions"], "esrb_rating": null}