{"id": 966814, "slug": "woodland-town", "name": "Woodland Town", "name_original": "Woodland Town", "description": "<h3>🌲 Welcome to Woodland Town! 🌲</h3>Embark on a serene journey of discovery and wonder in this enchanting exploration game. Immerse yourself in the lush embrace of a mystical town and the adjacent forest, where hidden objectives await your keen eye!<h3>Features</h3><ul><li>🌳 Whispering Forest Adventure: Step beyond the town's borders and immerse yourself in the ethereal beauty of the surrounding forest. Encounter captivating landscapes and unlock the mysteries of the wilderness.<br/></li><li>🔮 Relaxation and Cozy Vibes: Immerse yourself in a tranquil and soothing atmosphere that encourages you to set your own pace. Enjoy the quiet moments, the soft rustling of leaves, and the gentle babbling of streams as you unwind in a world designed for relaxation. 🌿<br/></li><li>🎯 Objective Hunt: Engage in a delightful search for hidden objectives scattered throughout the town and forest. Every discovery unravels a piece of the narrative, rewarding your curiosity with a sense of accomplishment.<br/></li><li>🌟 Captivating Visuals: Lose yourself in the beauty of hand-crafted environments that evoke a sense of wonder and nostalgia. The seamless blend of vibrant colors and intricate details creates a captivating world that invites you to explore every nook and cranny.<br/></li><li>🎶 Enchanting Soundtrack: Immerse yourself in an evocative and melodic soundtrack that perfectly complements the ambiance of Woodland Town. Let the music carry you on your journey of exploration and self-discovery.</li></ul><br/>Embark on a cozy adventure today!", "metacritic": null, "released": "2023-09-22", "tba": false, "updated": "2023-09-25T02:58:02", "background_image": "https://media.rawg.io/media/screenshots/dab/dab44b7e4b14ad107ed57eab3f60629f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 251, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Morning Shift Studios"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Morning Shift Studios"], "esrb_rating": null}