{"id": 966863, "slug": "gunslinger-2", "name": "Gunslinger", "name_original": "Gunslinger", "description": "The westward movement continued unabated, and the American West grew and flourished with fire and blood. The era proved the balance between order and chaos. From gangsters trying to establish power through violence and fear to police chiefs trying to protect the barriers of civilization, they choose to use guns to uphold the established laws.<br/>    You're the sheriff of a small wilderness town, everyone knows your name, and no one challenges your authority. And then there's a bunch of out-of-town gangsters trying to challenge your authority, trying to commit a crime in your town.<br/>If they don't know the rules, why don't you tell them the rules with a gun.<h3>Game features:</h3> <ul><li>Refreshing shooting experience: unlimited ammo and automatic reloading, bringing the most romantic shooting experience.<br/></li><li>Death’s Eye: Players aquire ‘Death’s Eye’ after combo killing . All enemies and bullets will slow down.<br/></li><li>Upgrade skills to become stronger: Upgrading skills not only can unlock dual-gun mode, but also helps you challenging more difficult levels. <br/></li><li>Strike at the right time: You can hide behind obstacles in the level and wait for opportunities to defeat enemies. <br/></li><li>Wild Maxim mode: You can use Maxim heavy machine guns to defeat swarms of enemies in specific levels.<br/></li><li>Classic Western Duel Mode: You have to pick up the gun after count down time and shoot all the enemies before you lay down. After completing the first level, you can enter this Quick Gun Duel Mode.</li></ul>", "metacritic": null, "released": "2023-09-23", "tba": false, "updated": "2023-09-25T04:17:15", "background_image": "https://media.rawg.io/media/screenshots/353/353c33d0d6e0f11ab0afb57364e09839.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 400, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["广州雷氪沉浸技术有限公司"], "genres": ["Indie"], "publishers": ["广州雷氪沉浸技术有限公司"], "esrb_rating": null}