{"id": 966917, "slug": "games-advent-calendar-25-days-25-surprises", "name": "Games Advent Calendar - 25 Days - 25 Surprises", "name_original": "Games Advent Calendar - 25 Days - 25 Surprises", "description": "<strong>In GAMES ADVENT CALENDAR, immerse yourself in that fantastic Christmas spirit, an exciting new game, every day for 25 days! </strong><br/> <br/>Every morning when you wake up you can open a new festive gaming surprise. Can’t wait? No problem! You can just open all the games right away. Every game can be played immediately if you don’t mind missing out on that unique Advent experience... All games can be played indefinitely. The festive months have never been so much fun!<br/> <br/><strong>DECEMBER</strong> – Your first surprise starts the 1st of December. Can’t wait? Don’t want to taste that full Advent experience, then you can just unlock all your gifts immediately and start playing right away!<br/> <br/><strong>25 FANTASTIC CHRISTMAS GAMES</strong> - Gift Runner, Arctic Adventure, Bauble Shooter, Penguin Runner, Holiday Jigsaw, TetriX-mas, Winterpong, Christmas Match 3, and many more surprises<br/> <br/><strong>INFINITE GAMING FUN</strong> - Don't just play during the holiday season, each game can be played every day, forever! <br/> <br/><strong>PLAY WITH FRIENDS AND FAMILY</strong> - 25 days full of challenging games, many of which you can play with multiple players for endless Christmas fun!<br/><br/><br/>Disclaimer: At least one controller is required to play in local multiplayer.", "metacritic": null, "released": "2023-09-28", "tba": false, "updated": "2023-09-29T02:35:23", "background_image": "https://media.rawg.io/media/screenshots/f0e/f0e836fdfdb1e8bc31575a7a86dbb804.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Mindscape", "Graphium Studio", "Denda Games"], "genres": ["Action", "Adventure", "Casual"], "publishers": ["MINDSCAPE"], "esrb_rating": null}