{"id": 966946, "slug": "the-ceo-love-me", "name": "The CEO Love Me", "name_original": "The CEO Love Me", "description": "<h3>Game introduction</h3>This is a role-playing game. You are the CEO who manages a huge family business. You need to interact with the characters in the game (E key) and complete the tasks assigned by them (about 15 in total).<br/>After completing the task, the market value of your company will be increased, so that you can recruit more employees; among them, there are four beautiful employees that you can develop intimate relationships with, help them solve problems in work and life<br/>Difficulties and troubles, as the friendliness increases, they will slowly open their hearts to you...<h3>Digging game</h3>Be sure to check out our youtube channel and discord channel, there will be surprise content in it, the link is at the link at the bottom right of this page.<h3>Game control</h3>Use WSAD to control the character movement, mouse movement to control the viewing direction, use the E key to interact with people and objects in the game (dialogue, pickup, etc.), use the Tab key to open the task information bar, and ESC to open the game menu.<h3>Role introduction</h3><strong>Lisa</strong><br/>As an assistant to the president, she is considerate, beautiful and generous. She usually likes to dress herself up carefully. If you have anything you don't understand, you can ask her.<br/><br/><br/><strong>Sakura</strong><br/>Sakura is a shy and shy girl. She just graduated from university and works as an administrative assistant. She doesn't know much about many things. You should take care of her.<br/><br/><br/><strong>Berry</strong><br/>Berry is an economic consultant from France. She is enthusiastic and unrestrained. She likes fitness and swimming. She will be of great help to the company's economic management. Please contact her.<br/><br/><br/><strong>Nana</strong><br/>Nana is still studying at the university, and now she is an intern at the company. The position is HR. Nana is lively and cute. She has a cute Cat at home to accompany her.<br/><br/><br/><strong>Luo</strong><br/>The CEO of a family business manages the operations of the family business, grows the company, and recruits more employees.<br/>", "metacritic": null, "released": "2023-09-25", "tba": false, "updated": "2023-09-29T03:09:03", "background_image": "https://media.rawg.io/media/screenshots/6e0/6e0864dfd2e191f0388ed33ff0120fbd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 305, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sunny Game Studios"], "genres": ["RPG", "Indie"], "publishers": ["Sunny Game Studios"], "esrb_rating": null}