{"id": 966963, "slug": "cookie-game", "name": "Cookie Game", "name_original": "Cookie Game", "description": "It's been 30 years since the last human has eaten a cookie. Missiles rain down from an unknown source in the sky, seeking to eliminate the last of the cookie enjoyers. While not human, Bottle is one of the last organisms on the planet that still harbors the dream of one day eating cookies without fear. It is your job to help Bottle accomplish her goal -- to eat cookies. <br/>\n<br/>\r\nThis game is pretty simple - you move side to side dodging the different types of missiles that fall from the sky. While the missiles get harder and faster, you can help Bottle get stronger by purchasing accessories from the shop. The two different currencies collected throughout the game will assist with upgrading Bottle until she is the strongest cookie enjoyer left on the planet. <br/>\n<br/>\r\nMade with a combination of Pygame and Microsoft Paint 3D, the graphics and animations are awe-inspiring*. You will surely enjoy the inconsistent line sizes and 5 frame animations, not to mention the sprites that look as if they've been poached from a 3rd grader's coloring book. Not to pat myself on the back or anything, but I believe this quality of illustration is pairs quite well to the complexity of this game, which is essentially nonexistent. Thus, Cookie Game is a perfect game for people who want to take a break from games with graphics that transform their PC into a Boeing 727 taking off from the ground. <br/>\n<br/>\r\n*This evaluation is subjective, of course.", "metacritic": null, "released": "2023-09-25", "tba": false, "updated": "2023-09-29T03:32:54", "background_image": "https://media.rawg.io/media/screenshots/054/054e0d19d7d184a5b8299a0c462bcb35.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["cccookiegame"], "genres": ["Casual", "Indie"], "publishers": ["cccookiegame"], "esrb_rating": null}