{"id": 966923, "slug": "shark-shark-2", "name": "SHARK! SHARK!", "name_original": "SHARK! SHARK!", "description": "<h3>SHARK! SHARK!®</h3>Inspired by the legendary <strong>SHARK! SHARK!®</strong> game released in its original version for the Intellivision® home console in 1982, this reimagined version for up to four players offers you a modern and addictive gameplay, fantastic graphics, great sounds, lots of levels and many underwater characters.<br/><br/>You are a very ambitious little fish … surrounded by the gulping underwater crowd! These are nasty, sneaky, big-mouthed aquatic devils that would swallow you up in no time … plus the real-slick, fast-turning sharks and other enemies as well that just love keeping you in their stomachs. But you´re smarter … and sly-mouthed too! … and why let them DEVOUR you?<br/><br/>In <strong>SHARK! SHARK!® </strong>you control a fish! Your goal is to earn as many points as possible while staying alive. Swimming in the ocean with you are other fish of various sizes, lobsters, crabs, jellyfish, kraken, puffer fish, orca, electric eel, and a very fast shark. You are able to eat any fish that is smaller in size than you are, and any fish that is larger will eat you! The shark can also be defeated if you nibble at its tail several times, but be careful for the shark can turn quickly. And be also aware of the lobster, crab, kraken, puffer fish, orca, and the electric eel. Each time you eat a fish or nibble on the shark´s tail, points are earned. When some shells on the bottom open, you have to be quick and collect the pearls inside. Each time you score, your fish will grow larger in size allowing you to eat even more of the fish on the screen. <br/><br/>The original version of <strong>SHARK! SHARK!® </strong>was launched 1982 for the Intellivision® console. The game was developed by game development pioneer Don Daglow and Ji-Wen Tsao, the world´s first female game console programmer. SHARK! SHARK!® was selected by the National Game Preservation Board as one of the best video games for permanent maintenance in the United States Library of Congress National Game Registry. Only games of the highest standard like Space Invader, Pac-Man or Donkey Kong are chosen.<br/><br/>This new version brings you the old classic Intellivision® game back into the modern world. Enjoy to play SHARK! SHARK!® on your console, on your PC or your mobile device:<br/><br/><ul><li>Single player mode<br/></li><li>Local and online multiplayer modes up to 4 players (cross platform)<br/></li><li>3 different worlds (Coral Reef, Pirate Lagoon, Sunken City) with 12 levels<br/></li><li>Different kind of enemies like shark, puffer fish, orca, lobster, kraken, jellyfish, electric eel, crab)<br/></li><li>Fantastic underwater graphics<br/></li><li>Superb sounds compiled and designed by famous game music composer Tommy Tallarico has won over 35 industry awards and has worked on more than 300 game titles<br/></li><li>Keyboard and Joystick support</li></ul>", "metacritic": null, "released": "2023-09-28", "tba": false, "updated": "2023-09-29T02:42:04", "background_image": "https://media.rawg.io/media/screenshots/d25/d255a7dc8eccc7848981723516e79062.jpg", "website": "https://bbg-entertainment.com/game/shark-shark", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["BBG Entertainment"], "genres": ["Action", "Casual", "Indie"], "publishers": ["BBG Entertainment"], "esrb_rating": null}