{"id": 966929, "slug": "stella-of-the-end", "name": "Stella of The End", "name_original": "Stella of The End", "description": "<h3>STORY</h3><br/>The world no longer belongs to humanity.<br/>Giant machines now roam the earth, pushing mankind to the brink of extinction.<br/>Jude Gray, a wandering Courier, receives a request to deliver some very special cargo. This cargo turns out to be Philia, an android girl who is unaffected by the enigmatic Singularity Machines.<br/>Jude is left with no choice but to escort Philia to her destination, doing his best to protect her from harm and teach her how to survive in this harsh world. Together, they must traverse the hostile wilderness, avoiding threats both mechanical and human.<br/>The whole time, Philia insists she's going to become human someday.<br/>What awaits Jude and Philia at the end of the road? Can humanity really be saved, or is it already too late...?<h3>CHARACTERS</h3><br/>An Android Who Dreams of Being Human<br/><strong>Philia</strong><br/>\"If I become human... I can save everyone. I think.\"<br/>An android girl discovered inside an ancient replicator capsule.<br/>Ever since she opened her eyes, she's been fixated on finding a way to become human.<br/>Philia has a bright, innocent personality and zero real life experience. It's up to Jude to teach her how the world works.<br/>She's curious about everything around her and occasionally charges in without thinking about the consequences.<br/>She also has a natural affinity with AI, being able to understand them on an almost instinctual level.<br/><br/><br/>A Wandering Courier Just Trying to Get By<br/><strong>Jude Gray</strong><br/>\"I have to protect you somehow, and shooting down threats is the only way I know how.\"<br/>A man who makes his living as a traveling jack of all trades.<br/>His knowledge of technology and engineering means he gravitates toward more specialized jobs, for better or worse.<br/>Jude's mind is always on survival first and foremost. He doesn't allow himself to be influenced by emotions or any abstract sense of duty.<br/>An avid gun enthusiast, he often gets so wrapped up preparing his gear that he loses track of time.<br/><br/><br/>A Nobleman Working to Revive Humanity<br/><strong>Willem Grosvenor</strong><br/>\"I have a dream. One I've harbored all my life.\"<br/>This mysterious old man claims to be working on a project to take the world back from the Machines.<br/>He has access to highly advanced technology that has kept him alive for over 100 years.<br/>After contacting Jude via a drone delivery, Willem offers him a king's ransom to retrieve and deliver Philia.<br/>He's only ever seen on video calls, making his actual whereabouts a mystery.<br/><br/><br/>An Android Seeking Her Father<br/><strong>Delilah</strong><br/>\"He's the one who taught me everything I know.\"<br/>An android rescued from a gang of bandits, who appears to be the same model as Philia.<br/>She's been treated badly, and now has a cracked-open head, a missing leg, and a multitude of other injuries.<br/>She was separated from the man she calls her father, and is desperate to find him again.", "metacritic": null, "released": "2023-09-25", "tba": false, "updated": "2024-01-11T20:58:04", "background_image": "https://media.rawg.io/media/screenshots/381/38190ca9c4f0f578f05d22a83ff6b7bc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "beaten": 1, "toplay": 2, "playing": 1}, "playtime": 5, "achievements_count": 22, "ratings_count": 1, "suggestions_count": 444, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["VisualArts/Key"], "genres": ["Adventure", "Simulation", "Casual"], "publishers": ["VisualArts"], "esrb_rating": null}