{"id": 966977, "slug": "venusblood-gaia-international", "name": "VenusBlood GAIA International", "name_original": "VenusBlood GAIA International", "description": "<strong>The island of Palastra, once the shining gem of the Golden Age...</strong><br/><br/>Centuries have passed, and the world has grown still, heralding the beginning of the Twilight Age. Now, the oceans have receded, birthrates have plummeted for all races, and an unknown plague ravages the land. Grotesque creatures of unknown origin roam the lands...<br/><br/>However, hope shines amidst the darkness. A new energy source discovered by Theofrad, the Archduke of the Sorcerous City of Energeia, may hold the key to saving the realm -- Ether. The Holy Dragon Empire Granleyd has outlawed the use of Ether as heresy, declaring a holy war on Energeia. And so begins Theofrad's uphill battle against the Empire, all for the sake of saving the world.<br/><br/>Join Archduke Theofrad in his efforts to save a decaying world in the Twilight Age with the power of Ether and his revolutionary Arcane Avatar Theory! As the underdog in the war against the Empire, he cannot stand against them in a direct confrontation. However, through clever use of the Labyrinth defense system present in the Sorcerous City of Energeia, he can ensnare and trap invading forces before closing in and wiping them out. Aided by his Succubus Secretary, Rein; Artificial Embryo, Lala; and a mysterious young girl known as Titie, Theofrad prepares the labyrinth to welcome any would-be invaders.<br/><br/>With the power of Ether, Theofrad is willing to fight against a world unified against him to save it from decay.<br/><br/><br/><br/><strong>Labyrinth Dungeon Defense</strong><br/>Set traps, position your defenders, and brace yourself for the enemy invasion.<br/>You are the master of the labyrinth, and these invaders are but pieces on a board that you control...<br/><br/><br/><br/><strong>Battalion Battles (Triple Division Battles / Large Foe Battles)</strong><br/>With three divisions of six units each, you enter battle...with all 18 units! Decimate the enemies trapped in your labyrinth with the full force of three divisions!<br/>During certain Event battles, you can face off against other battalions of three enemy divisions, but sometimes, you will enter battle against a colossal foe, taking it on with all three of your divisions to eke out a narrow victory!<br/><br/><br/><br/><strong>Customize &amp; Optimize Units</strong><br/>Units can be customized in many different ways!<br/>Raise them, assign them to a division, give them equipment, and place them as defenders in the labyrinth or put them into an assault team to directly attack invaders!<br/><br/><br/><br/><strong>Routes of Law and Chaos</strong><br/>Depending on the decisions you make throughout the game, the story may progress down different paths, and there are also multiple endings available!<br/>Make your choices wisely, for they will influence the ultimate ending to your story...<br/><br/><strong>Difficulty Modes and Replayability</strong><br/>Multiple difficulty settings offer a wide range of gameplay options. For those who want to skip the gameplay and just enjoy the story, use the easy mode's \"Win Skip\" function to skip battles or even entire maps altogether. Hardcore fans, use the New Game Plus mode that allows you to carry over progress from your previous run and challenge the newly unlocked higher difficulty levels for a more challenging experience! In fact, if story isn't really your thing, there is a dungeon defense only mode available where all story content is cut!", "metacritic": null, "released": "2023-09-26", "tba": false, "updated": "2023-09-29T03:49:50", "background_image": "https://media.rawg.io/media/screenshots/a57/a574a301b74d9dc6c6c57a2739372390.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 255, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ninetail", "Dualtail"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": ["Jast"], "esrb_rating": null}