{"id": 9670, "slug": "age-of-fear-2-the-chaos-lord", "name": "Age of Fear 2: The Chaos Lord", "name_original": "Age of Fear 2: The Chaos Lord", "description": "Age of Fear 2: The Chaos Lord is a refreshingly fun strategy title that marries a tabletop wargame with elements of RPG. The game features a huge variety of units, a novel hex-free battle system, morale, and flexible multiplayer.<br/><br/><br/><br/>Play as a manipulative succubuss or a brutal orc warchief in two fully voiced story driven campaigns!<br/><br/>FEATURE LIST<ul><li>Two long scenarios - play as a manipulative succubuss or a brutal orc warchief in fully voiced story driven campaigns!<br/></li><li>Hex-free battle system - units are no longer constrained to artificial grids. Unit's size matters too.<br/></li><li>Steam Workshop integration - create your own world and share with the community!<br/></li><li>Easy to Play but Hard to Master - Age of Fear is very easy to pick up but with deep and emergent strategy.<br/></li><li>Low hardware requirements - the game will even work on that old laptop of yours.<br/></li><li>Permanent death - all characters that fall in a battle will stay dead - unless an evil Necromancer raises them as Zombies!<br/></li><li>Diverse enemy roster - game features 160+ unique units with over 250 different spells and skills.<br/></li><li>AI behaviour is modelled on a neural network system and influence maps. Age of Fear has probably one of the most advanced strategic AI's ever created!<br/></li><li>Items and artifacts - there are over 100 unique items in Age of Fear, which are randomly distributed. Items not only give bonuses, but also unlock powerful skills and spells.</li></ul>", "metacritic": null, "released": "2015-03-27", "tba": false, "updated": "2019-09-17T12:30:26", "background_image": "https://media.rawg.io/media/screenshots/e38/e38d46781922b8cf68dcae2d182baf89.jpg", "website": "http://www.age-of-fear.net", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 6, "owned": 125}, "playtime": 5, "achievements_count": 23, "ratings_count": 4, "suggestions_count": 338, "game_series_count": 0, "reviews_count": 4, "platforms": ["macOS", "PC", "Linux"], "developers": ["Leslaw Sliwko"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Age of Fear"], "esrb_rating": null}