{"id": 967072, "slug": "vexlands-demo", "name": "Vexlands Demo", "name_original": "Vexlands Demo", "description": "You're the lone survivor deep within the cursed lands. You need to explore and expand the world by unlocking the mysterious cells that surround you. You do this by gathering and making resources and selling them for more coins. Unlocking the surrounding world also cleanses them, bringing the world back to life the way it was before the unknown calamity struck -- a story that will be revealed through collecting hidden relics as you play.<br/>\n<br/>\nAs you unlock the world, you'll find fantastic underworld dungeons and caverns to explore, but while these can be rich with loot, they are also ripe with dangers like traps and creatures to fight. You'll need to craft the right gear to have any chance of returning from the depths.<br/>\n<br/>\nUNLOCK THE WORLD<br/>\n<br/>\nIn Vexlands, unlocking each new space is like a pull on a slot machine. Will you find resources? Discover treasure? Or a meteor hitting your village?<br/>\n<br/>\nBUILD YOUR BASE<br/>\n<br/>\nTake the resources you find and turn them into tools, buildings and defenses. Some will allow you to tame and raise animals, some will allow you to improve your gear. Craft the home you need to survive.<br/>\n<br/>\nGO ON ADVENTURE &amp; FACE DANGEROUS CREATURES<br/>\n<br/>\nAdventure through the wilds and dive deep into dungeons with puzzles and loot galore. Reach new biomes and fight powerful monsters on your quest to cleanse these cursed lands.<br/>\n<br/>\nUNLEASH YOUR TALENTS<br/>\n<br/>\nLevel up as your progress and unlock perks from the branching talent tree. Are you a resourceful gatherer? A wealthy crafter? Or a battle-hardened warrior?", "metacritic": null, "released": null, "tba": false, "updated": "2023-11-27T14:41:39", "background_image": "https://media.rawg.io/media/screenshots/f7f/f7f8f17ef6492495613dee4704df15df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 341, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Apogee Entertainment"], "genres": [], "publishers": ["Apogee Entertainment"], "esrb_rating": null}