{"id": 967033, "slug": "dreams-unlimited-links", "name": "Dreams: Unlimited links", "name_original": "Dreams: Unlimited links", "description": "《Dreams: Unlimited links》 is a third-person shooter competitive game that features a variety of unique heroes, exciting gameplay modes, and rich scene maps and battlegrounds.<br/>Players can venture alone or team up with friends to engage in thrilling multiplayer battles and team fights, competing against other players' teams.<br/><br/><strong>Liquid Shooting and Liquid Absorption</strong><br/>Unlike most shooting games, in 《Dreams: Unlimited links》 players can experience the charm of liquid bullets and their unique gameplay. When entering an area where liquid bullets are present, heroes will transform into the form of \"Gluuue\" and absorb liquids to gain special buffs and abilities. With this feature, players can seize the opportunity to ambush, maneuver around obstacles, or traverse challenging terrain.<br/><br/><strong>Diverse Arsenal and Free Building</strong><br/>The game provides players with a wide range of diverse weapons to choose from, allowing them to strategically combine and match them to enhance their combat abilities. Additionally, players can switch their weapons to building mode and freely construct unique objects on the battlefield, dynamically altering the terrain and adding an element of unpredictability and challenge to every match.<br/><br/><strong>Varied and Exciting Battle Modes</strong><br/>The game offers a rich variety of battle modes, including team competition, solo competition, area capture, team elimination, and chicken survival. In these different modes, players must rely on their own skills or cooperate with their teammates to achieve ultimate victory. Even in the same mode, the experience can vary greatly on different battlefield maps.<br/><br/><strong>Continuous Expansion of Game Content</strong><br/>The game's content will continue to expand, including heroes, battle modes, maps, weapons, cores, and more. A plethora of unknown and enjoyable content awaits players to experience in the near future.", "metacritic": null, "released": "2023-09-27", "tba": false, "updated": "2023-09-29T05:05:19", "background_image": "https://media.rawg.io/media/screenshots/90c/90c7fa928336a156eeb01d62ac20e0b6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 282, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BEIJING HETU UNITED INNOVATION TECHNOLOGY"], "genres": ["Action", "Casual"], "publishers": ["BEIJING HETU UNITED INNOVATION TECHNOLOGY"], "esrb_rating": null}