{"id": 967068, "slug": "i-expect-you-to-die-3-cog-in-the-machine", "name": "I Expect You To Die 3: Cog in the Machine", "name_original": "I Expect You To Die 3: Cog in the Machine", "description": "<h3>Just when you thought you were out, we’re pulling you back in, Agent!</h3><br/>Outwit your most cunning adversary to date in the latest installment of this beloved escape room, spy-fi puzzle series. Dr. Roxana Prism, scientist and former Agency inventor, believes she can create a better agent, one that’s superior to our human agents. Wield new gadgets, visit six action-packed locales, and wear custom disguises as you dive back into the world of espionage.<br/><br/>Protect the Agency and the world as we know it, without losing your wits…or your life! ☠️<h3>In I Expect You To Die 3: Cog in the Machine, you will:</h3><strong>Race to Beat Dr. Zor</strong><br/>Your assignments take place in some of the most dangerous and expansive locales to date, and each one will require your most advanced covert agent skills. These fast-paced missions will leave you breathless.<br/><br/><strong>Meet a Brilliant Mastermind</strong><br/>Dr. Roxana Prism, scientist and former Agency inventor, believes she can create a better agent, one that’s superior to humans. And she has it out for you, Agent. Your mission: stay alive long enough to defeat this new escalating threat.  <br/><br/><strong>Go Undercover in Style</strong><br/>Show off your style (undercover, of course) with an imaginative array of Agency-approved attire. Look smart and choose your hat, watch, and gloves before embarking on your top-secret missions.<h3>Join our Discord server for all the latest intel!</h3>", "metacritic": null, "released": "2023-09-28", "tba": false, "updated": "2024-01-22T02:54:24", "background_image": "https://media.rawg.io/media/screenshots/bc6/bc679cb5becab6cf2113a7b7d6ea13d6.jpg", "website": "https://iexpectyoutodie.schellgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1, "toplay": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Schell Games"], "genres": ["Action", "Adventure", "Simulation"], "publishers": ["Schell Games"], "esrb_rating": null}