{"id": 967061, "slug": "wildmender", "name": "Wildmender", "name_original": "Wildmender", "description": "Wildmender is a game about bringing a deserted world back to life.<br/><br/>Explore the vast desert, alone or with friends. Collect plants and bring them back to your garden to thrive. Craft new tools and use them to shape the earth, and channel water to your plants. Delve into the mysteries of a fallen civilization and discover their magic. Befriend animals, spirits, and seek out the gods to help you defend the land from the vicious wraiths who seek to corrupt it. It’s up to you to save the world, one seed at a time.<br/><h3>Turn the Desert Green</h3>With the tools you crafted, set out to grow the little oasis in the middle of a vast desert into your own thriving garden. Plant seeds, dig canals, nurture your plants, craft useful and beautiful structures, harness magical essence, protect against the forces of nature, and more! You’ll have plenty of space and choices to create the garden of your imagination. Acre by acre, you will reclaim the desert and reforest the world.<br/><h3>Explore, Forage, and Survive</h3>Explore the desert around you. It is not as barren as you think! Forage for seeds and resources. Store them for a longer journey or bring them back to your garden, the choice is yours. Manage your food and water carefully as your journey through the dunes, the drained and salted sea, the poisoned canyons, and the cold and distant mountains. The farther you adventure, the greater the peril and rewards. Rare minerals, exotic plants, adorable creatures, and ancient spirits await your discovery. <br/><h3>Uncover the Mystery</h3>What happened to this world? How did everything go wrong? How did the life-draining wraiths corrupt the land? Journey to the temples of the gods, learn their stories, rediscover arcane magic, unlock powerful weapons, tools, and abilities to help you defeat the wraiths, free the gods, and breathe new life to the world. <br/><h3>4-Player Co-op Gardening</h3>Invite up to 3 of your friends to your garden online! Work together to tend your flourishing garden. Share resources and survive together. Adventure with friends through the lonely desert. Fight together against dangerous wraiths. But don’t forget, with more hands to garden you’ll have more mouths to feed!<br/><h3>Customize your Garden and Looks</h3>Just let nature take its course or style the garden to your liking. Craft structures and tools to decorate and shape the terrain. Build bridges over canals, a footpath dotted with lanterns, stucco walls with a gate, magical sigils that return bees to your garden, a streaming waterfall with a pool below, and more. Craft a loom and weave a wide variety of outfits to travel the desert in style.<br/><h3>Features:</h3><ul><li>Dozens of plant species to cultivate and grow, each with a variety of cultivars to be discovered<br/></li><li>50+ craftable structures and tools to build and manage your perfect garden<br/></li><li>75+ unlockable perks and ability upgrades<br/></li><li>1-4 player online Co-op multiplayer<br/></li><li>Procedurally generated world for a unique challenge every replay<br/></li><li>Day-night cycle: plants thrive and grow in the sun, while ghosts roam the cool nights<br/></li><li>Variety of outfits for your character<br/></li><li>Difficulty settings and game modes that can be adjusted on the fly</li></ul>", "metacritic": null, "released": "2023-09-28", "tba": false, "updated": "2024-01-20T08:28:24", "background_image": "https://media.rawg.io/media/screenshots/f87/f872754b6ee45535f0f546d8d67f7958.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 6, "beaten": 1, "toplay": 3, "dropped": 3, "playing": 1}, "playtime": 2, "achievements_count": 30, "ratings_count": 4, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Muse Games"], "genres": ["Adventure", "Strategy", "Simulation", "Indie"], "publishers": ["Kwalee"], "esrb_rating": null}