{"id": 967045, "slug": "dolphin-spirit-ocean-mission", "name": "Dolphin Spirit: Ocean Mission", "name_original": "Dolphin Spirit: Ocean Mission", "description": "<strong>Explore the island of Maupiroa and discover its deep-sea secrets!</strong><br/><br/>Embark on an amazing adventure on the tropical island of Maupiroa! Take to the seas and discover the secrets that surround the island!  Dive into the ocean's depths, teeming with life and color, with your dolphin friend Keanu. Learn about marine life and ecology while helping the local environmentalists save the island from impending disaster.<br/><br/>Your holiday on the island of Maupiroa is not going to be easy! Fortunately, you can count on your grandfather and the island's inhabitants to lend you a helping hand in your quest. Learn about the folklore and traditions of the island to save it from destruction. Embark on a fantastic adventure and immerse yourself in the heritage of your ancestors to unlock the secrets of magic totems.<br/><br/>Discover the hidden treasures of the underwater world with your sidekick, Keanu the dolphin. Take part in the conservation missions of the local people and take photos of the island's wildlife to complete your codex. <br/><br/>Marvel at the ocean's rich ecosystem and learn how to preserve it. Use your power to help endangered marine life.<br/><br/>Dolphin Spirit - Ocean Mission is an educational adventure game with a touch of fantasy, set on the beautiful tropical island of Maupiroa. <br/><br/><strong>Features </strong><br/><br/><ul><li>An original story full of mystery and magic<br/></li><li>A fun way to learn about ecology with well-researched information<br/></li><li>A codex of different marine species to complete<br/></li><li>Wild, colorful landscapes to explore</li></ul>", "metacritic": null, "released": "2023-09-28", "tba": false, "updated": "2024-02-04T17:47:23", "background_image": "https://media.rawg.io/media/screenshots/7a6/7a6bfbb19f08109513f191af879fac9c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 368, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Magic Pockets"], "genres": ["Adventure", "Simulation"], "publishers": ["Microids"], "esrb_rating": null}