{"id": 967144, "slug": "paw-patrol-world", "name": "PAW Patrol World", "name_original": "PAW Patrol World", "description": "Please note: Controller required for 2 player split screen mode. <br/><br/><br/><br/>Save the day all over Adventure Bay, Jake’s Mountain, the Jungle, and Barkingburg<br/><br/><br/><br/>Explore the world of PAW Patrol like never before, in a 3D action adventure where anything is PAWsible. Play as your favorite pups, drive their vehicles and save the day by taking on fun rescues and missions. It’s the ultimate PAW Patrol playtime!<br/><br/><br/><br/><br/>Use your pup treats to unlock new pup outfits, postcard stamps, emotes, vehicle stickers and more.<br/><br/><br/><br/>The PAW Patrol Day festival is almost here, and everyone in Adventure Bay is excited – everyone except Mayor Humdinger and his Kitten Catastrophe Crew, that is. Humdinger has taken all the festival posters and he’s causing mayhem in his new super blimp! It’s going to take the whole bunch of good pups – Chase, Skye, Marshall, Rubble, Zuma, Rocky, Everest and Tracker – with their unique skills to stop Humdinger and make the festival PAWsome.<br/><br/><br/><br/><br/>Experience a new PAW Patrol story, TV show flashback, plus bonus missions you’ll find as you explore.<br/><br/><br/><br/>So, jump into the wide world of PAW Patrol! Freely roam Adventure Bay, Jake’s Mountain, the Jungle and Barkingburg, in missions designed for pre-school players. Enjoy a brand-new story and play flashback missions inspired by classic PAW Patrol episodes, either in single-player or with a friend in split-screen co-op mode. And customize your game with countless collectibles, like emotes, pup tags, postcard stamps, costumes, vehicle stickers, and artworks for the Chickaletta Exhibition.<br/><br/><br/><br/><br/>One or two players can control every PAW Patrol pup including Chase, Skye, Marshall and Everest, each with unique skills.<br/><br/><br/><br/><br/><ul><li><strong>WORLD-SIZED FUN –</strong> Save the day all over Adventure Bay, Jake’s Mountain, the Jungle, and Barkingburg<br/><br/></li><li><strong>SNIFF OUT COLLECTIBLES – </strong>Use your pup treats to unlock new pup outfits, postcard stamps, emotes, vehicle stickers and more<br/><br/></li><li><strong>PLAY, RESCUE, EXPLORE – </strong>Experience a new PAW Patrol story, TV show flashback, plus bonus missions you’ll find as you explore<br/><br/></li><li><strong>ALL PAWS ON DECK – </strong>One or two players can control every PAW Patrol pup including Chase, Skye, Marshall and Everest, each with unique skills</li></ul>", "metacritic": null, "released": "2023-09-29", "tba": false, "updated": "2024-03-16T17:18:09", "background_image": "https://media.rawg.io/media/screenshots/edf/edf6d597dde8ec30cf78264aaa47725a.jpg", "website": "https://outrightgames.com/games/paw-patrol-world/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["3DClouds"], "genres": ["Action", "Adventure"], "publishers": ["Outright Games"], "esrb_rating": null}