{"id": 967113, "slug": "cyberpunk-red-light-district", "name": "Cyberpunk: Red-Light District", "name_original": "Cyberpunk: Red-Light District", "description": "<h3>CYBERPUNK CHICKS AND MASTURBATION</h3>Cyberpunk Red Light District is a game for adults inspired by the world of cyberpunk. It is a real-time sandbox SEX simulator with intuitive gameplay. Third-person or POV gameplay is available.<br/><br/><h3>STORY</h3>Play as visitors to the red light district of a cyberpunk megalopolis. The latest controversial inventions and the most powerful drugs are tested in such a district before they go on sale. Cyber sex drugs take you from the red light street to the world of super realistic sexual illusions.<br/><br/><h3>GAMEPLAY</h3>Enjoy real-time porn game. Playing with a free camera or POV camera gives you the opportunity to see details from every angle. Nine scenes with super sexy girls and 10 animations the same for each scene. Each scene is fully voiced and includes action from penetration to ejaculation.<br/><br/><ul><li>Choose cyber drug. One of them is blue and it is a cyber drug that takes you deeper into the cyberpunk world.The second red is also a cyber drug but this one is different and leads to alternative worlds. You always choose which path you will follow. You can try one of the paths, then come back and try the other...</li></ul><ul><li>Each sex scene includes a free third-person camera and a POV camera. There are sex animations to choose from, with the ability to adjust their playback speed according to your preferences.</li></ul><ul><li>When you hear your heartbeat, you know you're ready for hyper cumsot. Cum on her and keep fucking the cum-covered girl.</li></ul>", "metacritic": null, "released": "2023-09-30", "tba": false, "updated": "2023-10-02T02:52:25", "background_image": "https://media.rawg.io/media/screenshots/085/085f639f5b8a386ee8d916d43d119ed7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 375, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Autonomaton Interactive"], "genres": ["Action", "RPG"], "publishers": ["Autonomaton Interactive"], "esrb_rating": null}