{"id": 967181, "slug": "protolife-other-side", "name": "Protolife: Other Side", "name_original": "Protolife: Other Side", "description": "Protolife: Other Side - is arcade game which can also be called as \"reverse tower defense\". You have to lead squads of alien creatures though the ever-growing defense line on miltiple locations. The more creatures you save the easier it will be to reach the main goal: find the interplanet transport and evacuate.<h3>Plot</h3>One year passed since Protolife game events. Mankind started colonization of new planet. It was called Planet of Leonov (aka Leo-Nóva). The alien biotechnologies was found on this planet too. But this time the alien core was found and blasted with orbital strike, avoiding heavy ground combat.<br/>Alien overseer who also acts as backup core decides to evaculate survived creatures from planet. He's scared. Scared not of humans.<h3>Features</h3><ul><li> 5 species of creatures with own abilities<br/></li><li> 4 common abilities<br/></li><li> 6 zones with different level architecture<br/></li><li> partially destructible landscape<br/></li><li> familiar towers and buildings from original Protolife (as enemies this time)<br/></li><li> new towers and buildings<br/></li><li> each level must be beaten several times in order to evacuate as much creatures as possible. Each attempt is harder than the previous one.<br/></li><li> special missions which affect the other levels</li></ul><h3>Controls</h3>Keyboard, keyboard+mouse or gamepad. You directly control leader's movement, other creature follow the leader. Also you may activate one of the abilities for the whole squad.", "metacritic": null, "released": "2023-09-29", "tba": false, "updated": "2023-10-02T04:31:18", "background_image": "https://media.rawg.io/media/screenshots/279/27943205e9a1f607ebf95f98782f29bc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aleksei Grishin"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Volcanic Giraffe"], "esrb_rating": null}