{"id": 967175, "slug": "mother-ghoul-the-curse-of-unborns", "name": "Mother Ghoul - The Curse of Unborns", "name_original": "Mother Ghoul - The Curse of Unborns", "description": "Your eyes suddenly snap open, and you find yourself in a chilling graveyard. The silence of the deceased envelops you, and you come face to face with a grim reality: You've been buried as a sacrifice in these accursed grounds. Thus begins \"Mother Ghoul: The Curse of Unborns,\" where you are welcomed into the depths of a horrifying video game experience.<br/><br/><br/><br/>This game will lead you on a harrowing adventure, pitting you against a malevolent entity that seeks to claim your soul step by step. The narrative revolves around six babies born lifeless, their souls tainted by revenge as they make sinister pacts with demons. The mother of these babies has returned as a malevolent specter, compelling you to confront a gruesome fate.<br/><br/><br/><br/>As the main character, you have but one objective: Roam the graveyard and church to uncover the skeletal remains of these six babies and free them from their cursed souls. However, this task won't come easy. At every turn, the ghostly woman draws nearer, shadowing your every move and attempting to seize your soul.<br/><br/><br/><br/>\"Mother Ghoul: The Curse of Unborns\" offers a challenge and a heart-pounding experience for horror enthusiasts. As you unravel the mysteries within the graveyard and church, there's no escaping the horrifying ghostly woman. The game immerses you in a captivating story and compels you to venture into its dark world.<br/><br/>Are you ready? Prepare yourself to embark on a journey to the heart of fear and horror with \"Mother Ghoul: The Curse of Unborns.\" An unforgettable horror experience awaits you, but remember, in the darkness, something is always waiting...", "metacritic": null, "released": "2023-09-29", "tba": false, "updated": "2023-10-02T04:22:58", "background_image": "https://media.rawg.io/media/screenshots/563/563378986b90c1ef1fb1ce1cf923090e.jpg", "website": "http://queendeveloper95.byethost5.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Queen Developer"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["Queen Developer"], "esrb_rating": null}