{"id": 967180, "slug": "souls-spectrum-awakening", "name": "Soul's Spectrum: Awakening", "name_original": "Soul's Spectrum: Awakening", "description": "Welcome to Soul's Spectrum: Awakening, a free prequel for Soul’s Spectrum. A game where death is not the end — it's your key to progress. With each passing demise, your soul transforms, granting you new abilities to conquer the challenges ahead. Will you harness your abilities and fulfill your purpose?<br/><br/><br/><br/>In Soul's Spectrum: Awakening you will embark on a captivating journey through an original storyline that sheds light on the mysterious events prior to the main game.<br/><br/><br/><br/><strong>Game Features:</strong><br/><br/><ul><li>🎮 Master the game's mechanics as death shapes you, enabling you to assume up to four distinct forms.<br/></li><li>🧩 Solve a variety of puzzles and riddles, exploiting Nora's unique abilities to transform into the courageous Human, the haunting Skeleton, the elusive Umbra, and the ethereal Anima.<br/></li><li>🔥 Confront bizarre characters, unravel mysteries, and outwit deadly traps in this exhilarating adventure!<br/></li><li>💥 Unveil an epic tale of unexpected twists and confessions through your actions and interactions.<br/></li><li>🎶 Let the original 16-bit music tracks by Javarnanda enchant you, shifting with the character's actual form.</li></ul><br/>Embrace your destiny and unlock the secrets that lie within. Can you escape the clutches of eternal confinement and find your freedom?", "metacritic": null, "released": "2023-09-29", "tba": false, "updated": "2023-12-18T17:29:04", "background_image": "https://media.rawg.io/media/screenshots/15b/15bcd859c39360688fdef7327a209fb5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 37, "beaten": 2}, "playtime": 1, "achievements_count": 8, "ratings_count": 2, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Thund Games"], "genres": ["RPG", "Indie"], "publishers": ["Ravenage Games"], "esrb_rating": null}