{"id": 967129, "slug": "the-midnight-town-stories-adams-diary", "name": "The Midnight Town Stories: Adam's Diary", "name_original": "The Midnight Town Stories: Adam's Diary", "description": "<strong>***This game isn't for everyone. It's a blend of a visual novel and an escape room. If you're sharp enough, you'll explore every nook and cranny of the rooms, figuring out a way to escape and uncovering the truth about Adam by finding all the pages of his diary. But if you're not the type to think too well, you might get stuck in the first room and end up dropping the game. What kind of player are you? Are you one of the resilient ones who can pay attention to every detail in each room, or are you the type to throw in the towel, call for help or just give up? It is up to you.***</strong><br/><br/><strong>*** This is our first game, and we are working hard to deliver the best experience to you.<br/>Soon, updates with more puzzles, monsters, stages and support for other languages such as Portuguese, Italian, and Japanese.<br/>Stay tuned, and thank you for your support.***</strong><br/><br/><br/>\"The Midnight Town Stories: Adam's Diary\" is an immersive blend of Escape Room, Visual Novel, and Horror genres. Prepare to journey into the depths of a chilling and enigmatic Limbo, where reality intertwines with the realm of the living and the dead.<br/>In this spine-tingling adventure, you assume the role of Adam, a tormented soul who awakens in the confines of his apartment. However, something is amiss - the once familiar walls now bear strange markings, and a haunting ambiance surrounds him. Trapped in this ethereal dimension, Adam must confront his deepest fears, for it is the only way to unlock the secrets of his own identity and uncover the unsettling truth about his inexplicable journey into the unknown.<br/><br/>Explore the hauntingly atmospheric rooms, each shrouded in mystery and laden with cryptic puzzles. As you navigate through Adam's fragmented memories, relive his darkest moments and confront the demons that lurk within his subconscious. Unravel the twisted narrative that blurs the boundaries between sanity and madness, drawing you deeper into the sinister secrets of \"The Midnight Town.\"<br/><br/>\"The Midnight Town Stories: Adam's Diary\" delivers a hauntingly atmospheric experience, filled with dread and suspense, as you strive to confront the terrors that lie dormant within your own psyche. Will you emerge victorious, or will the shadows claim you forever? Do you dare delve into the abyss of Adam's mind, where reality becomes an enigma and terror becomes a constant companion?<br/><br/>Note: This game contains elements that may be disturbing or trigger unsettling emotions. Player discretion is advised.<br/><br/><br/>Guiding Adam through the maze of his memories, you'll bear witness to haunting recollections and unearth the fragments of his forgotten past. Each revelation exposes the tormenting events that led him to this ethereal plane, forging a path towards understanding the mysteries that shroud his existence.<br/><br/>The line between reality and illusion blurs further, and unsettling discoveries intertwine with a sense of imminent dread. Unravel the enigma of Adam's identity, for he holds the key to unlocking the sinister riddles that bind the living and the dead in this spectral dimension.<br/>Your journey into the depths of fear and revelation awaits.<br/><br/>Note: This game contains intricate psychological themes and distressing content. Player discretion is advised as you embark on this chilling odyssey of self-discovery and terror.<br/><br/><br/>Adam's path through the haunting Limbo forces him to confront the painful memories of rejection and isolation, both from himself and his family. The echoes of their disapproval reverberate through the ethereal realm, fueling the shadows that seek to ensnare him further.<br/>As Adam's story unfolds, you'll find yourself immersed in a deeply human narrative that delves into the complexities of mental health and the enduring power of acceptance. <br/><br/>\"The Midnight Town Stories: Adam's Diary\" urges players to reflect on their own journeys of acceptance and self-discovery, touching on sensitive themes with grace and empathy. Through this mesmerizing exploration of the human condition, may you find solace, healing, and a renewed sense of compassion for yourself and others.<br/><br/>Note: This game contains powerful themes, including depression, acceptance, and substance abuse. It is intended to provoke thought and foster understanding. Please approach with sensitivity and an open heart as you immerse yourself in Adam's poignant tale of self-acceptance and transformation.<br/><br/><br/>Dark Ocean Games is an Indie Game Development Studio with a primary focus on creating visual novels that raise awareness about mental health issues such as drug addiction, suicide, depression, and self-acceptance. Our mission is to use the power of storytelling to educate and inspire people to take action towards positive change. We believe that by creating engaging and thought-provoking content, we can help break down the stigma surrounding mental health and encourage more open and honest conversations about these important issues.<br/><br/>We are committed to developing visual novel games that can have a constructive impact on people, inspiring them to seek help or take strides towards self-improvement. To fulfill this commitment, we donate a portion of our profits to organizations that provide mental health services, with a particular focus on those working towards suicide prevention.<br/><br/>***We are thrilled to present \"The Midnight Town Stories: Adam's Diary,\" our debut game at Dark Ocean Games. We sincerely hope that players will immerse themselves in this haunting experience, embracing the emotional journey of Adam's self-discovery. <br/><br/>Your support is invaluable, and we eagerly welcome your feedback, questions, and suggestions to help shape our future projects.<br/><br/>Together, let's embark on a captivating adventure and pave the way for a brighter gaming future. Thank you for being a part of our journey. ***", "metacritic": null, "released": "2023-09-28", "tba": false, "updated": "2023-10-02T03:17:00", "background_image": "https://media.rawg.io/media/screenshots/ad7/ad7085fd8fabee953ad4fcc4374adf8f.jpg", "website": "https://www.darkoceangames.com/adamsdiary", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fabio TG", "Erico Bracco", "Renan Momente"], "genres": ["Action", "Adventure", "Strategy", "Casual", "Indie"], "publishers": ["Dark Ocean Games Studios"], "esrb_rating": null}