{"id": 967124, "slug": "shape-shifter-formations", "name": "Shape Shifter: Formations", "name_original": "Shape Shifter: Formations", "description": "Shape Shifter: Formations is an action twin-stick shooter with rogue-lite elements, where you must destroy hordes of geometric enemies alone or with a friend. Select your ship and combine a large variety of weapons, abilities and infinitely stacking upgrades to craft your own unique build.<h3>Customize Your Loadout</h3>Choose from a wide variety of ships each with their own unique active and passive abilities, ranging from protective barriers or invisibility, to shocking tesla towers and a burning laser. Pick the ship the suits your play style and outfit it with a weapon of your choice. Spend cores gained each run on the skill tree to provide powerful permanent upgrades.<h3>Limitless Upgrade Combinations</h3>Gain experience by killing enemies to improve your ship with infinitely stacking upgrades that allow you to tailor your build as you play. Tether your enemies together to chain damage, or release a barrage of icicles in retaliation when attacked. Unlock new upgrades that can be found in future runs as you complete challenges.<h3>Shift Shapes</h3>Survive against swarms of enemies before fighting challenging bosses each with their own unique attacks and abilities. Throughout the run, spend currency collected from killing enemies on further upgrades at the shop, in order to gain a greater chance at surviving the next horde.<h3>Features</h3><ul> <li>Play solo or in 2 player local co-op.<br/> </li><li>10 Ships each with their own unique active and passive abilities.<br/> </li><li>10 different weapons to choose from.<br/> </li><li>130+ infinitely stacking upgrades to craft your build each run.<br/> </li><li>Expansive skill tree that provides permanent upgrades for every run.<br/> </li><li>Choose your difficulty with multiple customizable options.<br/> </li><li>Unlock new upgrades, weapons and ships by completing challenges.<br/> </li><li>Options for either manual or automatic aiming/firing based on your preference.<br/> </li><li>Multiple enemies and bosses each with their own diverse attacks.<br/> </li><li>Short 30 minute runs.</li></ul>", "metacritic": null, "released": "2023-09-29", "tba": false, "updated": "2023-10-02T03:09:31", "background_image": "https://media.rawg.io/media/screenshots/55e/55ee3a2c29eebcdb1b4332f36c7f29a0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 5, "achievements_count": 86, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Castec Studios"], "genres": ["Action", "RPG"], "publishers": ["Castec Studios"], "esrb_rating": null}