{"id": 967288, "slug": "bomber-party", "name": "Bomber Party", "name_original": "Bomber Party", "description": "Immerse yourself in an explosive and heart-pounding adventure! Put your strategic skills to the test as you battle through a fast-paced arena, aiming to eliminate all opponents and emerge as the last survivor. Will you cleverly place your bombs to surprise enemies and destroy valuable item blocks? Gather mighty power-ups that enhance your chances of triumph!<br/><br/>The excitement reaches its peak as you compete round by round for trophies, striving to claim the coveted crown. Every move is crucial, for only the most skillful player will break through the trophy barrier and claim victory. Are you prepared to prove yourself in this relentless competition? Ignite the fuse and let the action begin – an epic bombfest where only the strongest shall earn glory!<br/><br/><strong>Description of the Level Editor!</strong> <br/>With this entertaining in-game tool, players can create their own custom levels, save them in one of the six available save slots, and even host them in multiplayer later on.<br/><br/>The Level Editor provides a creative playground where players can design completely individual level layouts, resulting in unique and original maps, as well as innovative gameplay scenarios.<br/><br/>In this tool, players have the freedom to choose and place any destructible and indestructible blocks on one of the eight available Level Editor backdrops. The possibilities are virtually limitless, as they can use their imagination to create impressive challenges.<br/><br/>Once players have completed their masterpieces, they can safely store their creations in one of the six save slots for later access or share them with friends in multiplayer mode. Invite other players to master your levels and face new challenges.<br/><br/>Whether you're an artist seeking creative expression or a tactician wanting to design tricky and exciting battles, the Level Editor provides you with the tools to bring your ideas to life. Are you ready to create your own worlds and show others what you're made of? Let's get started!", "metacritic": null, "released": "2023-10-02", "tba": false, "updated": "2023-10-06T02:56:08", "background_image": "https://media.rawg.io/media/screenshots/d45/d4557074a12049340d565eb90499b1b6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CryneX"], "genres": ["Action", "Strategy", "Casual", "Indie"], "publishers": ["CryTechGames", "CryneX"], "esrb_rating": null}