{"id": 967292, "slug": "sunlight-scream-university-massacre", "name": "Sunlight Scream: University Massacre", "name_original": "Sunlight Scream: University Massacre", "description": "<ul><li> The visual novel inspired by the game \"Everlasting Summer\", R. L. Stine's \"Goosebumps\" series of books and the movie \"Scream\", created on the pure enthusiasm of one man.<br/><br/></li><li> Friendship, romance, betrayal, secrets, intrigue - it's all about Sunlight City! Moving from Los Angeles to a small town, Max immediately finds himself in a whirlwind of events that will not let you breathe easy.<br/><br/></li><li> The visual novel is presented with more than 80 colorful, hand-drawn backgrounds, characters and illustrations that will let you enjoy a picture that complements the main story.<br/><br/></li><li> A rich soundtrack of more than 50 atmospheric songs will leave no one indifferent. <br/><br/></li><li> A huge variety of endings with indicators of significance will help to lead your own way and not get confused. It can lead you to completely different endings!<br/><br/></li><li> At any moment everything can change. Remember, you can't save everyone! <br/><br/></li><li> And also the events are backed up by various in-game achievements, with the receipt of which you will be able to explore all the secrets of Sunlight City 100%.<br/><br/></li><li> And remember, every choice you make can become decisive. It depends only on you who will survive and who will die. Everything is in your hands!</li></ul><br/>Join the game's official Discord community to ask any questions, report bugs, ask for keys or just chat! We will be glad to answer any of your requests. <br/><br/>", "metacritic": null, "released": "2023-10-02", "tba": false, "updated": "2023-10-06T03:03:30", "background_image": "https://media.rawg.io/media/screenshots/038/038bdf142d6a3248f26adb554a39c6c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 357, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Faithy"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Faithy"], "esrb_rating": null}