{"id": 967210, "slug": "dungeon-tale", "name": "Dungeon Tale", "name_original": "Dungeon Tale", "description": "<strong>\"Dungeon Tale\" is a single-player ARPG game developed by me alone. It incorporates various elements of traditional ARPGs and combines characteristics of action games and traditional arcade games.</strong><br/><br/>Players can assume the roles of different races and professions, embarking on adventures in randomly generated dungeons with AI-generated companions. They will complete various boss challenges, level up, and acquire equipment. <br/><br/>Moreover, in terms of combat skills and actions, the game draws inspiration from action games. For instance, light attacks can be combined with medium and heavy attacks to form combos, unleashing different skills. <br/><br/>The game's mechanics incorporate features from side-scrolling arcade action games of the 1990s into the 21st-century dungeon exploration ARPG genre. Players have limited revives in dungeons and can collect treasure for score increases, which, in turn, enhance the quality of the final reward chest. Boss battles come with time limits, and the more time remains when the boss is defeated, the more experience points are gained for the final chest, just like the games I used to play in arcades during my childhood.<br/><br/><h3>Game Modes: </h3><strong>1. Random Team Dungeons</strong><br/>Players form a four-person team with AI allies to explore random dungeons, defeat enemies and bosses, and loot treasures. The dungeon is divided into three parts, with basic bosses in the first two parts. In the third part, the player's team joins a 12-player large group to challenge a world boss. In addition to the equipment obtained in the dungeon, players receive chest rewards in the main city based on their performance after completing the entire dungeon.<br/><br/><strong>2. Survival Challenge (Normal/Boss)</strong><br/>Players and AI teammates enter an arena to defend against waves of enemy attacks. Each hero has only one life, and once the challenge is successfully completed, the corresponding chest will be unlocked. The survival challenge comes in two types: Normal and Boss. In the Boss challenge, the player's team must consecutively defeat five dungeon bosses within a set time limit, with no rest or recovery time in between.<h3>Races:</h3><br/><strong>Human</strong>: Increased stunning ability by 20% on attacks.<br/><strong>High Elve</strong>: Raised energy limit by 33%.<br/><strong>Barbarian</strong>: Reduced rage consumption for super special moves by 10%.<h3>Classes:</h3><br/><strong>Warrior</strong>: Equip single-handed weapons and shields, forming defensive combos while switching to a two-handed weapon for massive damage at critical moments.<br/><strong>Rogue</strong>: Proficient with dual-wielded melee weapons and a backup bow, switching freely between long-range and close-range combat. Special super move combos allow for assassinations on regular enemies.<br/><strong>Mage</strong>: Excel in ranged combat, using lightning, fire, and frost spells to attack enemies in different combo combinations.<br/><br/><h3>Future Updates:</h3><br/>The game will receive ongoing free updates, introducing new races, classes, dungeon environments, and various gameplay experiences.<br/><br/><strong>Q4 2023:</strong><br/><br/>Bug fixes and detail optimizations, more dungeon scenarios, and additional game content.<br/><br/><strong>New Class - Paladin:</strong><br/><br/>Despite the traditional RPG similarities in equipment and combat between paladins and warriors, I hope to make some changes. For instance, while still retaining two-handed weapons, I might change one-handed melee weapons to longer-reaching spears, allowing paladins to maintain an appropriate distance from enemies.<br/><br/><strong>Heroic Dungeons:</strong><br/><br/>I don't plan to just increase monster levels and equipment drops in heroic dungeons; I hope to introduce more engaging gameplay mechanics. One creative idea is that during battles in heroic dungeons, a colossal corrupted sword will drop onto the battlefield, stabbing into the ground and continuously inflicting AOE damage to all heroes. This raises the requirements for player equipment. Once the corruption ends, players of any class can pick up this artifact and deal tremendous damage to enemies. However, the artifact has a limited number of attacks and will disappear after use. This concept draws inspiration from arcade games of the 1990s.<br/><br/><strong>Q1 2024:</strong><br/><br/><strong>A New Mysterious Race</strong><br/><br/><strong>New Class - Demon Hunter:</strong><br/><br/>Demon Hunters will possess a unique combat style. Unlike traditional dual-wielded weapons, they wear lightweight cloth armor, move swiftly, and carry a specialized blade. This blade remains in its sheath for the most part, storing power and awaiting the perfect moment to strike for a lethal blow. This system is still in the design phase and promises to bring even more unique gameplay to the game. Stay tuned.", "metacritic": null, "released": "2023-09-30", "tba": false, "updated": "2023-10-02T05:18:32", "background_image": "https://media.rawg.io/media/screenshots/418/418c6a69faa044111979c7d645b30d7b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Parisii"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Parisii"], "esrb_rating": null}