{"id": 967217, "slug": "olho-spectral", "name": "Olho Spectral", "name_original": "Olho Spectral", "description": "In a distant kingdom, the Lutherian Guard, the elite warriors responsible for protecting the royal family, live in perfect harmony. The youngest member, Dartan, is a skilled and loyal young man, dedicated to defending the king and his people. However, his loyalty is put to the test when he discovers a dark secret: the king he is sworn to protect is not who he says he is.<br/><br/>Determined to expose the truth, Dartan assembles his fellow Lutherian Guards to confront the King about his suspicions. To his surprise, they discover that the king is actually Vadniit, a malevolent being who has usurped the throne and takes the form of the rightful monarch. An epic battle ensues, but the Lutherian Guard is defeated by Vadniit's sinister force.<br/><br/>With a terrible blow, Vadniit uses a powerful magical artifact to separate the Guard members, sending them to another dimension. Now, Dartan and his fellow warriors must find a way to come together again to face the malevolent threat plaguing the realm.<br/><br/>On their journey of rediscovery and self-discovery, each member of the Lutherian Guard faces personal challenges and confronts their own fears. They learn to rely on their individual abilities and, at the same time, the strength of teamwork. Hoping to restore peace and justice to the kingdom, they embark on a perilous journey, where they will face mystical creatures and overcome magical obstacles.<br/><br/>However, time is running out, and Vadniit is growing more powerful. The Lutherian Guard will have to overcome each other and unite again to challenge evil in its purest form and save the realm from utter destruction. In this thrilling saga of action, magic and loyalty, the heroes will discover that true courage lies in standing up against the darkness, even when all seems lost. The final battle looms, and the fate of the kingdom depends on the valor and determination of the Lutherian Guard.<h3>GAME FEATURES</h3><br/><ul><li>3D scenery and pixelated 2D sprites<br/></li><li>Turn-based battles, simple mechanics and easy to play<br/></li><li>Various types of weapons for each character, allowing different combat strategies<br/></li><li>Two parallel worlds to explore<br/></li><li>Five dungeons full of challenges<br/></li><li>24 Creatures to register in the bestiary</li></ul>", "metacritic": null, "released": "2023-09-30", "tba": false, "updated": "2023-10-02T05:28:27", "background_image": "https://media.rawg.io/media/screenshots/9b4/9b4596923f20a2e65f6468bbd76cdd20.jpg", "website": "https://www.facebook.com/olhospectralRPG/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Adriano Martins"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Adriano Martins"], "esrb_rating": null}