{"id": 967265, "slug": "hun-dun-yuan-yu-chaosmetaverse", "name": "混沌元宇(ChaosMetaverse)", "name_original": "混沌元宇(ChaosMetaverse)", "description": "In the chaotic Yuan Yu, there are thousands of races. They fight without cultivating. In the endless blood and fire, 10 top war emperors are born. They are the human race in order: Wujie (male), Xuan Huang (female), Yu Huang (female), and the Dark Clan. The Dark Emperor (female), the Demon Emperor (female), the Dwarf Mecha Emperor (male), the Elf Emperor (male), the Demon Emperor (male), the Prison Emperor (male), and the Celestial Girl (Queen of Heaven),<br/>\r\n10 War Emperors met and became brothers when they were young. Ranked in order of strength are: Wujie, Xuan Emperor, Yu Emperor, Dark Emperor, Demon Emperor, Demon Emperor, Prison Emperor, Elf Emperor, Mecha Emperor, and Heavenly Empress. After supporting each other for endless years, the 10 emperors came together to conquer all races. Among them, Wujie and Emperor Xuan, Emperor Yu, and Emperor Demon successively became Taoist couples. The Emperor of Darkness and the Queen of Heaven secretly admired Wujie.<br/>\r\nThe leader of the 10 War Emperors in one day, Wu Jie, summoned the 10 War Emperors and said: There is too much desire and darkness in the world that makes all living beings suffer. The battles of thousands of races have caused countless hot-blooded men to die on the battlefield, and I vaguely feel the sealing barrier of this world. Unstable extraterrestrial demons may break through the barrier, so I propose to open up 7 war realms to create a beautiful world for our subordinates. Because of the natural attributes of the Demon Emperor family, they are not suitable for opening up, so other war emperors can give up their territories to the demons. The emperor, and the human race can only select some to enter because there are too many, so I will leave the four holy beasts of Qinglong, White Tiger, Xuanwu, and Suzaku and their subordinates to form the Four Holy Sects to protect the human race. The four holy beasts master the four holy weapons. The four holy beasts Working together with the Four Sacred Artifacts, we can defeat the powerful War Emperor. Then our ten War Kings will work together to open up the Central War Realm. The Demon King Protector, King Xuan, King Yu and I will open up the central war realm. The other six war kings will each open a war realm. The six war realms Connect with each other. The other war kings nodded in agreement after hearing this. So a few years later, the other six major races all entered the meson space after giving up their territory to the demons, and were carried by the six war emperors. Those from the human race who wanted to enter the central war realm were carried by Wujie, Xuanhuang, and Yuhuang respectively. The 10 war kings gathered in a chaotic space to start the battle. Wujie was in the center, King Xuan and King Yu were sitting behind him. The other six war kings were scattered around three people, while the Demon King was doing it in the center. The other side of Wujie began to guard. With the cooperation of everyone, Wujie began to use his magical powers. He exudes boundless power and condenses powerful power. King Xuan and King Yu also used their talents to form an invincible formation. The other six war kings also exerted their own abilities and jointly condensed a powerful energy field.<br/>\n<br/>\r\nThe boundaries of the war realm began to change, filled with a mysterious and ancient atmosphere. The unbounded power gradually merges into it, and the battle environment gradually reveals a grand and spectacular scene. Vast plains, steep mountains, rapid rivers and mysterious forests appeared in the war environment, forming an independent and complete world. However, as everyone opened up the battlefield, the demon clan's ten war generals led the demon clan soldiers to begin an all-out attack on human territory. A few months ago, the Qinglong Holy Emperor received a letter and left the sacred artifact behind and mysteriously disappeared. Therefore, only the Qinglong lineage of the Four Holy Sects was left in the East to protect them. With the help of the sacred weapons, everyone could barely resist, but at the critical moment of their retreat, the great power of the Central Plains, Fu Nian, took action and forcibly opened the Divine Guardian Formation. Due to exhaustion, he was poisoned. There are sores, there are no years at the end of the world, there are winds and clouds on the wrong road, a hundred years are full of sins, right and wrong are just a cloud, the blood is spilled, and the earth returns in spring. Although it is a sacrifice, it does not mean passing away, but rebirth in another form with dedication. The remaining peaks are cut across, the lonely clouds leave, and the ambition returns. Accept the lonely soul and restart the four pillars. The top six arts are all alone. Kindness and kindness are in vain, and now we are in a desperate period. Feelings of sadness are inextricably linked. All transformed, the catkins are flying in the wind. The war in the west was extremely tragic. The White Tiger Holy Emperor fought furiously and bloodyly. The hero's promise was so important that thousands of people were frightened and the world was frightened. He followed the disaster of the troubled times, swept across the pinnacle of martial arts, opened up the light of darkness, and asked the heroes of the world. The blood-stained robes and armor are red, who dares to compete with him in the sun? In ancient times, only Changshan Zhao Zilong was able to rush into battle to help someone in danger. Raise your head to the sky and roar thousands of miles away, and fight against the adversity of the world again. It's a night when anger turns into a promise, hatred never stops, and five generals have been killed in three passes. Who can call him a hero? He fought until the demons became frightened, and finally died of exhaustion. Before he died, he shouted, \"Who can fight with me here?\" His body remained standing, and the demon soldiers did not dare to step forward for three days. After that, the White Tigers fought side by side with their sacred weapons. While retreating, the Suzaku Holy Emperor and his tribe in the south also fought and retreated. In the north, the Xuanwu Holy Emperor rebelled and took away the holy weapon. The three moves slightly injured the demon warrior, and then he used the sword of defeat that had never appeared in the world. The sword master focused his fingers and raised his energy. Suddenly, the empty world spread, and the sword master's will was dispersed between the sky and the earth. Thousands of miles of wind and sand came out of nowhere. Dissipated, facing the extreme of Tao, the demon general took up his true energy, and the earth vibrated. The sword master silently recited in his heart: \"All things in heaven and earth are swords, gods, ghosts and evil spirits are swords, the sky of the universe is swords, this is the tribulation of all gods.\" It was unprovoked and came without a trace. The demon general suddenly burst out with his true energy, and his ultimate move was launched. The wind of God, overlapping layers of spontaneous sword energy, tried to block the divine power, but the divine power was unstoppable, and he repeatedly broke through dangerous obstacles. The demon general said : \"Spontaneous indiscriminate attack, but it's a pity that no one can cooperate with you.\" The wind of God swept through the Mercedes-Benz. Unexpectedly, it was the swordsman's last chance to bet. The spontaneous sword energy penetrated the eye of the wind and rushed away. Two people were injured at the same time. , the Demon General said: \"Is this the last move of your bet?\", the Sword Master said: \"It's not over yet, or now is the beginning.\" Suddenly the Sword Master lost his will and expanded outward, the Demon General said: \"The Swordsman of Humanity has another human being that I can remember.\" The sword's intention spread in all directions, and was sensed within a hundred miles. People nearby shouted \"My sword,\" and then the sword flew away automatically, and then only the sky was seen. Thousands of swords gathered together in an inexplicable place. A woman looked at the trembling sword in front of her and said, \"You want to accompany him on his last journey. The fate has come. Go ahead.\" Here, as soon as the words fell, the sword penetrated the sky, turned into soaring sparks, and shot towards the sky. A strange image appeared in the sky. Ten thousand swords were scattered among the thunder clouds. Following the flying sparks, ten thousand swords rushed towards the border of China. The sword master said : \"The true meaning of Tao is nothing more than nature, but the protection of life.\" The demon general said: \"The seeker of Tao uses up his will, his soul, and gives up the opportunity to enter the Tao. Is this your enlightenment?\" The sword master said: \"Guardian Life is the true meaning of Tao, and this is my Tao.\" Every drop of splashed blood carries the will of the Sword Master, and the last will is to protect Shenzhou. The blood of the Sword Master is gone, and thousands of swords fly together to form a huge If you get the sword wall, the devil will not be able to come forward. At the same time, countless heroes have fallen across the land of China, and countless heroes are mourning all over the country. They uttered their last words: \"Life is like a dream, but there is so much happiness. When I reach the end of my life, I have no regrets or regrets. My last sigh is only for the only thing I care about in my heart.\" Name\", \"Although Wu was defeated, no one in the demon world has stepped through the thunder pool\", \"What success is mine, the past is just like a dream, why are you looking for the immortal way, right and wrong are joking\", \"With a bright moon in my heart, my sword can transform the seven-foot universe. , I am used to watching the mist and rain all over the city, holding my head high and not regretting the wind and clouds.\", \"I want to tell you, even if Shi Yun's soul flies away, I will turn into the wind by your side.\", \"Why are rivers and lakes competing for fame, but forgetting the leisurely scenery of mountains and rivers. There is nowhere to find the shoes of the stick, and the sky and the earth are vast and there is no trace left.\", \"Since life values ​​righteousness, how can we give up righteousness?\", \"Donate blood and scatter the loess, and the righteousness returns to the sky. Only the loyal heart remains in this world, and I want to prove this path with Zixia \",\"The lonely old plum blossom is alone in its spirit. Unexpectedly, thunder and lightning overnight wiped it out. The rain and sky do not understand the pain of the spectators, and the sound of thunder is still deep.\", \"The Taoist heart does not want to be disturbed, but it is difficult to calm down the storm, and no one in the world has died since ancient times.\" .....<br/>\n<br/>\r\nOn the other side, at the critical moment when the battle realm was opening up, the Demon Emperor suddenly launched an attack on Emperor Xuan and Emperor Yu, and suffered heavy losses. The two emperors Xuanyu had no time to think too much, and at the same time, they transferred all their body skills to Wujie to speed up the opening of the battle realm. While notifying the Emperor of Darkness, the Second Emperor Xuanyu was defeated in the second attack. At the same time that the Second Emperor Xuanyu was defeated, the Emperor of Darkness gave up on opening up the battlefield, opened his eyes, and found that the Second Emperor Xuanyu died tragically. Finally, he said full of anger and hatred: \"Demon Emperor, you are looking for death\", and then directly attacked the Demon Emperor who was about to attack Wujie. The Demon Emperor had no choice but to respond hastily. For a moment, the Demon Emperor was already at a disadvantage. At this time, the sky suddenly changed dramatically, and the sky and the earth suddenly lost color. Only a few majestic figures appeared one after another with poem numbers: \"The country's mountains and rivers are entering the battle map. How can the people live in Qiao Su? Don't talk about the matter of ennobling the marquis.\" A general's achievements will lead to tens of thousands of bones being withered.\", \"In his lifetime, he will sit on the roaring tiger and make the wind, and there will be no one on the top of the world. When a hero encounters me, he will be short of breath, and he will smile proudly and fight in the clouds.\", \"Heaven and earth are silent, and disaster will be incarnated. I will kill and purify the world. \"Destiny goes against the gods\", \"Throughout the ages, there is no king. Who has the highest ambition? Who can rival him? He swallows the majestic waves with anger, and fights against the sky with one hand\", \"The Taiyu God wanders around the sun and moon, and performs martial arts for thousands of years. He fights with swords to make the wind and clouds rise, Pay the Emperor of the East with a smile\", \"The calamity spreads across the world, and the decree is to bring six disasters and seven killings; disasters have spread throughout the past and present, killing eight difficulties and nine evils alone. There is one demon from all ages, who defies heaven.\", \"Sacrificing one's body to return to evil, reincarnation without form, the end of Dharma, \"Celestial Burial\", \"The heaven and earth are in chaos, and the emperor's power is coming; falling into black and white, following the shadow. Sighing that humans and ghosts are impermanent, the sky is against the destiny; holding the sun and moon without limit, the emperor's order\". After these figures appeared, the world did not dare to release the evil that the gods chose to imprison. They were shocked to see all the demons descending into their true forms, and the shadow of the tyrant appeared on the throne. A majestic voice appeared: \"Thousands of demons have come to pay a visit, and thousands of years will pass; the thunder of the wind will shock everyone.\" , endless calamity, chaotic Yuanyu, the arrival of the Heaven-Swallowing Demon Emperor, which is the beginning of the Scorched Earth Demonic World.\" As soon as his slanderous words fell, the Heaven-Swallowing Demon Emperor gathered his supreme magic power and formed the Demon Black Sky, which symbolizes the source of despair, represents the beginning of destruction, and is the Lord of Eternal Death. The Emperor of Darkness stood guard in front of all the emperors with a cold face, and released many masters of the Dark Clan. When the battle was about to begin, the clouds in the sky changed, dawn suddenly appeared, and among the auspicious clouds, shocking words were heard. : \"The world is in chaos, the world is out of order, how can the chaotic Yuan Yu tolerate treachery and rebellion?\" Behind him, there are several figures coming: \"The heaven and earth are mysterious and order the universe, the mountains and rivers are shining in our door, the luck changes cleverly, hiding the false and the true, and the vast world The way to transform all things will last forever.\", \"With your head held high, thousands of hills away, in the roaring wind, you can find enemies to discuss swords with, but it's too cold at high places.\", \"If you say nine words, wave your sleeves and the wind and clouds are gone, where will the country sink? Follow Yixing, and put your hands behind your back. The world is settled, and the pale yellow is light.\", \"Half in the turbid current, half in the clear, leaning on the zither and chanting Guangling prose, silently listening to the gentleman's wishes with the cold sword, looking down on the world and laughing at the mortal world\", \"Dancing in the mysterious song, the truth in the illusion, Taiyou Fangfang \"Looking out at the world of mortals\", \"It means that the world is shocked by the waves, I have been playing the kite for a hundred years, and my life is clear. I pick up a string and listen to someone, I raise my head thousands of miles away, and there is no one in the country\", \"I lean on the kite to look at the vastness of the sky, and the sound of the sky is making waves. Wash the stars. The white rainbow penetrates the sun and sweeps away the demons, and the bright moon shines in the sky to illuminate the past and present.\" \"It crosses the heaven and earth, how can the clouds be buried in the troubled times; sweeps away the eternity, and the sword bears the mad name and is feared all over the world.\" Year; The world is full of clouds, the maniac with swords and swords is now taking the mantle off his shoulders. No one knows him when he travels through thousands of mountains, and he was famous in vain; the east wind wakes up the hero's dream, and smiles to the green mountains and the sky. The heart of falling in love with the mortal world is dead, I have been holding a sword for a lifetime. Feng Qing is alone on the road to the end of the world, and his tears have turned into ice. He has become a sword fanatic.\" \"My heart has always been quiet and simple, and the world of mortals has stained Cheng Zi's clothes. I have been used to watching the rise of wind and clouds for half my life, and there is no end to the world at one step.\" \"There are hundreds of steps up to the blue sky, and there is no one who can climb there alone. The clouds in all directions wash away the smoke and dust, and the lin clothes fade away from the earthly roots. There is no definite spring and autumn in the world, and the people are confused day and night. Now I am holding on to the storms and annihilating the soldiers one by one. The green slip platform, the scripture of heaven and earth, a stroke of history determines the first year. \"Laughing at Xu Yun, making friends with Xia, looking proudly at the old stone and plum blossoms. It is uncertain in this life. Learn from Taizhou, the dragon will go and the tiger will stay, tomorrow the ruins will be in the hills. Rest and occupy a few houses. Merry? Count the Spring and Autumn Period.\" \"The shadows in the leisurely cloud pool are long, and things change and the stars move several autumns. I want to ask you what's going on recently, and you can manage the mountains, water, and the wind.\" \"Watch the snow and practice the leaning river, ten miles of dragon waves, and the clouds are whistling alone on the waves. \"The scenery is proud, ask what the world is like, the emperor is at ease\", \"The poems and wines of Qitian have their own relegated immortals and gods. Thousands of stars and lightning, alone embrace the blue sky and the depth of the clouds\", \"Wearing six baht clothes, the truth is hidden in the sky. The road to becoming a god is in the clouds, and the apocalypse descends from the purple sky.\" The war is about to break out. Everyone fights together to win or lose. The Demon Emperor confronts the Dark Emperor. As time goes by, the Heaven-Swallowing Demon Emperor gradually loses patience and activates the Demon Black Sky to suppress everyone. The situation is critical for a while. At this moment Wujie woke up. He slowly opened his eyes and felt the situation outside. His consciousness traveled through the entire battlefield and the land of China. When he discovered that the Demon Emperor had betrayed him, Emperor Xuanyu was killed, and the land of China was invaded by war, and countless heroes died in battle. Finally, he raised his head to the sky and screamed, summoning the four great protectors of the human race to replace him and then generate the central battle realm. Then he walked to the Emperor of Darkness, closed his eyes, and a surge of hatred spread. He held the hilt of the sword in his hand, A wave of sword intent spread, and everyone felt as if their necks were about to be scratched by a sword, and then a voice echoed in their ears: \"Slashing the Sky and Drawing the Sword Technique\", a white light flashed through everyone's hearts, and they saw Shenzhou and the Demon Race. The boundary of the earth was completely broken, cutting off the demon clan's way to send troops to the mainland of China. Then he slapped the Demon Emperor with a palm and directly injured him and vomited blood. Wujie said: \"I once said that I would protect you for the rest of my life, but you betrayed the Ten Clans Alliance, betrayed me, colluded with the demons from outside the territory, killed the Second Emperor Xuanyu, and invaded Shenzhou Continent, you have borne me too heavy a burden. This hatred is as high as the sky. In a thousand years, I will lead the nine tribes to destroy your demon tribe.\" After saying that, he fought with Moheitian. Their extreme moves met, and the world shook. After a few moves, Moheitian's power did not diminish, but became more powerful. Wujie was already wounded, Moheitian raised his hands, The world-destroying fortune palm was formed. Suddenly, the strong wind was pulled by the divine power, intensifying the power of the devil. Wujie cried out sadly \"God's will\" and told everyone to retreat. Then he fully drew his true energy, took a meal with one foot, and the holy seal opened in the sky. , Suddenly the yellow sand was like a raging wave, rolling into the sky. Wujie was raising the last energy, transforming the whole body's true energy into the supreme holy energy. Suddenly the nine Brahma divine seals appeared in both palms, and the move of approaching the gods appeared in the world. He has been cultivating for a hundred years. Today, the foundation of the Dao was destroyed in the battle to subdue the demon, the dragon gods from all directions descended to the world, and the Holy Flame of Nine Dragons burned the Demon Heaven. The two sides handed over, and the Holy Flame of Nine Dragon swallowed the sky and destroyed the earth, blasting a radius of hundreds of miles. The Heaven-Swallowing Demon Emperor was pushed back a few steps and spewed out. With a mouthful of blood, Mo Heitian loomed, obviously suffering heavy injuries. Wujie also spurted out a mouthful of blood and fell to the ground exhausted. Then he took out a handful of pills and drank them, then stood up with strength. Seeing that Demon Heitian was injured, the Heaven-Swallowing Demon Emperor said coldly: \"Retreat\", and the demons outside the territory retreated. Everyone stepped forward and Wujie said: \"It is disrespectful to come and not go back. The Emperor of Darkness protects everyone, and we will go to the outside world to fight against the demons.\" After saying that, he disappeared into Chaos Yuanyu with everyone.", "metacritic": null, "released": "2023-10-05", "tba": false, "updated": "2023-10-06T02:26:46", "background_image": "https://media.rawg.io/media/screenshots/6e9/6e95ce7ae7a593e6e3e4986390e59175.jpg", "website": "https://chaosmetaverse.niangu.top", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["niangu"], "genres": ["Action", "Racing", "Massively Multiplayer", "Indie"], "publishers": ["niangu"], "esrb_rating": null}