{"id": 967340, "slug": "station-to-station-2", "name": "Station to Station", "name_original": "Station to Station", "description": "FEATURES<br />\nA relaxing and peaceful experience<br />\nBeautiful, colorful voxel art<br />\nOptional strategic gameplay to earn high scoresCONNECT THE WORLD<br />\nIn Station to Station, your world starts small with a handful of rural structures. Place stations and create connections to foster growth and expansion. As you build more connections, your area will grow, transforming into a vibrant, lush environment full of life and color! To keep you on your toes, the game also features engaging puzzle elements, challenging you to optimize routes and solve logistical conundrums.<br />\nADMIRE VOXEL-ART VIEWS<br />\nHop on board and steam through colorful biomes. Breathe life into the dry desert sands, and transform the untamed mountain terrain. Build and watch your tranquil world come to life with an ever-widening tapestry of flora and fauna!<br />\nTHRIVE<br />\nFor those eager to put their management and planning skills to the test, each level offers optional challenges, stack bonuses, and unique mechanics tied to every biome! Whether you seek relaxation or mental stimulation, &#39;Station to Station&#39; has something for everyone!<br />\nGET ON BOARD AND RELAX<br />\nFollow us, join the community, and choo-choo with the devs. Check the external links to join our Twitter and Discord!<br />\nStation to Station is inspired by titles, such as Mini Metro, Train Valley, Dorfromantik, Terra Nil and Islanders.</p>", "metacritic": null, "released": "2023-10-03", "tba": false, "updated": "2024-04-15T02:43:51", "background_image": "https://media.rawg.io/media/games/fab/fabb514d218bc2d3d8b3a554790bc722.jpg", "website": "", "rating": 3.88, "rating_top": 4, "added_by_status": {"yet": 4, "owned": 13, "beaten": 1, "toplay": 14, "dropped": 5}, "playtime": 3, "achievements_count": 66, "ratings_count": 8, "suggestions_count": 310, "game_series_count": 0, "reviews_count": 8, "platforms": ["PC"], "developers": ["Galaxy Grove"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Prismatika"], "esrb_rating": null}