{"id": 967318, "slug": "save-city-r", "name": "Save City R", "name_original": "Save City R", "description": "Introducing \"Save City R\" - an exciting game in which you take on the role of a tank commander on a mission to destroy the tanks of a well-known criminal organization known as \"Shai Guu\".<br/>The player will have to control a tank that has two types of fire: large-caliber from the main gun, and a machine gun. According to the plot, a tank controlled by the player is landed on a city bridge, which is captured by enemy tanks. You need to destroy them using your skills and the weapons on board the tank.<br/>For years, this nefarious group has instilled fear in the hearts of the country's inhabitants, and now it's up to you to restore peace and justice.<h3>Key Features:</h3><ul><li>Epic Tank Battles: Take command of powerful tank and engage in intense battles against Shai Guu's forces. Utilize strategy, precision, and teamwork to outmaneuver your enemies, unleash devastating firepower, and emerge victorious.<br/></li><li>Stunning Visuals: Immerse yourself in the visually stunning world of Save City R, brought to life with detailed environments, realistic tank physics, and jaw-dropping special effects. </li></ul><br/>Join the fight on the bridge in Save City R and become the beacon of hope for the oppressed citizens of the city. Prepare for adrenaline-fueled tank battles, heart-pounding moments. Will you answer the call and save City R?", "metacritic": null, "released": "2023-10-02", "tba": false, "updated": "2023-10-06T03:39:22", "background_image": "https://media.rawg.io/media/screenshots/ee1/ee187d5c74ba632e977709d74e1c742e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["devbooster's"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["devbooster's"], "esrb_rating": null}