{"id": 967314, "slug": "farmcraft-2", "name": "FarmCraft 2", "name_original": "FarmCraft 2", "description": "\"Farm Craft 2\" builds a pivotal bridge between time management and strategy genres, and crosses it only when it's advantageous to do so.<br/>\r\nYou will deal with such real-world issues as global warming, economic crises, worker strikes, material shortages, and equipment breakdowns.<br/>\r\nYou'll plant and harvest crops, take care of farm animals, and process raw materials into finished products, search for objects, play arcade mini-games to get to the root of the conspiracy and save the world!<br/>\n<br/>\r\nThe story of Farm Craft continues... anyone who played the first \"FarmCraft\" will remember that our heroine, Ginger, defeated Agronovich and took over the Agronovich Corporation. Ginger’s company, aptly called the Tomato Corporation, owns and works with a vast network of farms and food suppliers making quality, healthy food. Her trusty shovel hangs on the wall as a memento to her great work in the past. And although she longs to be back on the farm, Ginger’s a successful businesswoman and her most important tool these days is her cell phone. <br/>\n<br/>\r\nDuring a trip back to her farm to visit her grandparents, Ginger stumbles upon people making suspicious experimental fruits and vegetables in her village. The plot thickens with international intrigue and the global vegetable crisis. There’s not a minute to lose as this charming farming game has gone global!<br/>\r\nThe game boasts a variety of features, including unique farm management mechanics, a compelling story with surprising plot twists, and an engaging cast of characters.<br/>\n<br/>\r\nHelp Ginger and her company Tomato Corporation make quality and healthy food!<br/>\n<br/>\n<br/>\r\nMain game-features:<br/>\r\n- In addition to farming you'll need to hunt for objects and play arcade-like mini-games<br/>\r\n- There's no time limit. Create your own strategy for solving each level's tasks<br/>\r\n- Hone your skills to earn 25 different awards<br/>\r\n- Great story line with interesting characters<br/>\r\n- Amazing graphics and original musical compositions", "metacritic": null, "released": "2023-10-02", "tba": false, "updated": "2023-10-06T03:34:44", "background_image": "https://media.rawg.io/media/screenshots/bd8/bd8d121f94d06d2e7c8573e1187fe9f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 387, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nevosoft"], "genres": ["Strategy", "Simulation", "Casual"], "publishers": ["Best Place Apps"], "esrb_rating": null}