{"id": 967306, "slug": "a-promise-best-left-unkept", "name": "A Promise Best Left Unkept", "name_original": "A Promise Best Left Unkept", "description": "<strong>Prompted into action by the promise he made to his girlfriend a year ago, Harry finally made a huge breakthrough in his quest for success by scoring a major deal for his company, in doing so setting into motion his inevitable promotion. But what he didn’t foresee is that the byproduct of his unshakable resolve would unintentionally invite an undesirable presence into his life. The representative of the subcontracting company—his old bully from high school.</strong><br/><br/><br/><br/><ul><li>400k+ Words<br/></li><li>Multiple Perspectives<br/></li><li>8+ Endings<br/></li><li>140+ CGs<br/></li><li>60+ Sex Scenes<br/></li><li>Animated Sex Scenes</li></ul><br/><br/><br/><h3>Harry</h3>Harry is a hard-working, cooperative, and loveable office worker whose prospect has been particularly bright ever since he started going out with Laura, his coworker, and made her a promise that he would aim to match her professional success. He's a hopeless romantic and would do almost anything to help a friend in need.<br/><br/><br/><h3>Laura</h3>While her look definitely defines accurately her personality, Laura has been steadily softening as her relationship with Harry has become a more and more important part of her life. She's strict, but usually fair. Though if you're dead weight, she won't blink an eye before casting you aside. <br/><br/><br/><h3>Aya</h3>As the most useless employee in the office, Aya seems to almost make a point out of it daily. Luckily, she's working under Harry, which gives her a lot of leeway in terms of procrastinating. She's secretly in love with him, and won't hesitate to use her modest bosom to capture him like she would a dungeon in the video games she always plays during work hours!<br/><br/><br/><h3>Luca</h3>Luca is the representative of the subcontracting company that hired Harry's firm in order to develop a mobile app for them. He's very laidback and hardly finds anything interesting. Coincidentally, he's also Harry's childhood bully, although he's weirdly acting as though Harry is now his best buddy.<br/><br/><br/><h3>Sandra</h3>Sandra is Laura's mother. The two of them have been estranged ever since Sandra ran away with another man, leaving Laura behind with her single dad. But that's in the past. At least that's what Sandra is hoping. She's come back in Laura's life and has been actively trying for the past year to build a bridge between them. She's charming, kind-hearted, and still holds a touch of youthfulness.<br/><br/><br/><br/><br/>", "metacritic": null, "released": "2023-10-02", "tba": false, "updated": "2023-10-06T03:22:31", "background_image": "https://media.rawg.io/media/screenshots/11a/11ad0fe742ffd5afa445ef690c66e306.jpg", "website": "https://hangovercatpurrroduction.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 455, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Hangover Cat Purrroduction"], "genres": ["Casual", "Indie"], "publishers": ["Hangover Cat Purrroduction"], "esrb_rating": null}