{"id": 967331, "slug": "magicians-cat-diary", "name": "Magician's Cat Diary", "name_original": "Magician's Cat Diary", "description": "<h3> Introduction to gameplay </h3><br/>The game includes four mini games, namely parkour, sleeping, catching fish, catching mice, and also corresponds to four competitions.<br/><br/>Consuming some of the cat's physical strength to play small games can exercise the cat. As the cat's ability increases, the game will become increasingly difficult. When the cat's ability reaches a certain value, it can be allowed to participate in competitions and win rewards.<h3> Flower shop operation </h3><br/>After starting, players will enter the flower shop, which has four rooms. Hall, bedroom, cat room, flower room.<br/><br/>When operating a flower shop, there is a concept of time, which can be divided into morning and evening. Together, it means spending a day. You can switch between morning and evening by clicking the button at the top of the middle of the interface.<br/><br/>Buy seeds and plant flowers, water them every day, and make money by selling them after they bloom.<br/><br/><h3> Train cats </h3><br/>In the morning, if the cat has sufficient physical strength, it can be trained by using the \"magic mirror\" in the cat's room.<br/><br/>Each small game has clearance conditions. If the clearance conditions are not met, the cat's ability improvement will be halved during settlement.<br/><br/>If all cats have exhausted their Energy, they should be fed with food and can purchase food to feed the cats. Click on the sun button in the middle of the screen to enter the next day, and the cat can recover its Energy.<h3> Parkour game </h3><br/>Move the mouse to control the wand and click on the cat, using the wind magic released by the wand to catch the cat that fell from the roof.<br/><br/>There is a limit to the number of times magic can be released, and attention should be paid to timing and rhythm.<br/><br/><h3> Sleep game </h3><br/>Move the mouse to control the wand and click on mosquitoes to eliminate them and keep the cat sleeping for as long as possible.<h3> Catching fish game </h3><br/>Moving the mouse to control the wand to blow the fish swimming in the wind can increase the cat's ability to catch the fish.<h3> Catching mice game </h3><br/>Move the mouse to control the wand and click on the hidden teacher in the darkness, so that the cat can catch as many teachers as possible.<h3> Voice controlled parkour </h3><br/>In the game, you can get a little kitten, which cannot compete. When playing parkour, you can use <strong>  audio input  </strong> instead of the mouse to control the cat's jumping.<br/><br/>At this point, it is important to keep the room relatively quiet and free from additional sound sources.<br/><br/> Users above Windows 10 should ensure that the game allows access to the microphone in the privacy settings of the operating system before using audio input. <br/><br/><h3> Provides various interactions with cats </h3><br/>1. Find a Cat: A simple hide and seek game. Every morning when I wake up, the cat will be scattered in various rooms. After clicking on the cat, the cat will return to the cat house, making it easy to check which cat is not at home.<br/><br/>2. Touching cats: For example, feeding cats or having nightmares can wake them up.<br/><br/>3. Obtain a new cat: After reaching the trigger condition, a special event will occur, and the cat will be captured on the computer in the lobby. If the cat's face is captured, it can be directly summoned by magic.<br/><br/>4. When cats are in a bad mood, they can break things: Breaking things can reduce cat health. Click on the broken item to restore it. The restoration of fragile items requires gold coins.<br/><br/>5. There is a probability of encountering mice when switching rooms: Old mice will break things or steal food or seeds, causing damage. The probability of encountering mice decreases with the increase of the total number of cats. If there are cats in the current room, they will definitely not encounter mice.<br/><br/><h3> You can collect </h3><br/>1. Up to 5 different cats! Including a special baby cat.<br/><br/><br/><br/>2. Some colored eggs, such as meeting certain conditions, will attract new cats or draw lucky cats from gifts.", "metacritic": null, "released": "2023-10-03", "tba": false, "updated": "2023-10-06T03:55:41", "background_image": "https://media.rawg.io/media/screenshots/b76/b7661e1d85a5eec9fb78681416f04391.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Color Studio"], "genres": ["RPG", "Simulation", "Casual", "Indie"], "publishers": ["Color Studio"], "esrb_rating": null}