{"id": 967313, "slug": "sundermead", "name": "Sundermead", "name_original": "Sundermead", "description": "Sundermead is a procedurally generated, open-world RPG in which the Anglo-Saxon gods have sent you to the Island of \"Sundermead\" to create a settlement. The gods have tasked you with farming and, over time, inviting more people to join you in your settlement. Described as \"Minedew Valley\", it takes inspiration from the two popular games, Minecraft and Stardew Valley.<br/><br/>Each new villager you invite to your settlement will bring something new, allowing you to unlock more items, trade with the outside world and form relationships!<br/><br/>But there is more to Sundermead than just your newly founded settlement. Below the ground lurks creatures beyond your imagination.<br/><br/><strong>Features:</strong><br/><ul><li><strong>Procedurally Generated:</strong><br/>Sundermead takes place on a procedurally generated 20km² island with varied biomes and tonnes to explore!<br/><br/><br/><br/></li><li><strong>Landscape terrain:</strong><br/>Use your trusty tools to create the perfect landscape for your farm, although this can come at a cost.<br/><br/><br/><br/></li><li><strong>Build a homestead:</strong><br/>Use a near limitless combination of Sundermeads construction objects to build a home.<br/><br/><br/><br/></li><li><strong>Farming:</strong><br/>Use Sundermead's fertile soil to plant seasonal crops for your settlement.<br/><br/><br/><br/></li><li><strong>Settle down and build a community:</strong><br/>Call villagers to trade with and live in Sundermead alongside you.<br/><br/><br/><br/></li><li><strong>Share your peaceful life with your friends:</strong><br/>Sundermead can be played alone or with friends!</li></ul><br/>Sundermead is being developed by a lone developer who goes by the alias of \"Josephus\". The project began in May of 2021 with the hopes of creating something that he and his girlfriend could play. He is based in the UK (England) and, as such, is heavily interested in English medieval history, specifically the Anglo-Saxon era.", "metacritic": null, "released": "2023-10-02", "tba": false, "updated": "2023-10-06T03:33:28", "background_image": "https://media.rawg.io/media/screenshots/e35/e35af7e871cf75fc52661b58545d8aa9.jpg", "website": "http://sundermead.co.uk", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Josephus"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["Josephus"], "esrb_rating": null}