{"id": 967363, "slug": "thief-simulator-2", "name": "Thief Simulator 2", "name_original": "Thief Simulator 2", "description": "Thief Simulator 2 will transport you to a world full of valuables, expensive cars, and rustling banknotes. As long as you find a way to steal them.<br/>Know that a thief’s trade is not a piece of cake. In order to get some practice, you’ll start with petty theft. This is how you’ll gain the experience required to access more and more risky – and most importantly, more profitable – jobs.<br/><br/><br/><br/>Gain levels and unlock new possibilities. Get useful tools. Together with newly acquired skills, they will pave the way to expensive items, which you can then sell on the black market. The tools of your trade include a crowbar and binoculars, as well as advanced equipment that becomes available as you progress, such as a laptop for hacking through security systems.<br/><br/><br/><br/>The creators of Thief Simulator 2 have prepared two unique locations with houses, banks, restaurants, and other special places that you’ll get to strip of money, valuables, and other items. But before you do, examine the surroundings: find out when the building empties out, learn the tenants’ or the employees’ schedule. Then you just need to prepare a strategy and it’s gone time.<br/><br/><br/><br/>Just be quick and efficient. You don’t have much time, so you’ll need to immediately assess which item to take and which one to leave. Can you handle the pressure, or will you panic?<br/><br/>Make sure to work on cars between robbing buildings. Start with small family sedans and make gradual steps towards mastery, which will allow you to steal the coolest sports cars.<br/><br/><br/><br/>Remember to keep your eyes around your head. Even the best plan can fall apart, and the local police are just waiting for a chance to put you in handcuffs. Don’t get caught. Always be one step ahead of law enforcement.<br/><br/><strong>Feature list</strong><br/><ul><li>Two neighborhoods, with over 20 houses to break into. Learn tenant's routines, pick the right time to break in, and then rob them<br/></li><li>Three heists, each with a unique location. Make your way into a resort with 6 houses full of loot, a warehouse crawling with guards, and a central bank with gold waiting to be snatched from the vault.<br/></li><li>Get better and better tools, ranging from a crowbar or binoculars to hacking laptops, stethoscopes, etc.<br/></li><li>Make your way into houses undetected, or run in welding a baton and knock everyone out. Alternatively, put them to sleep using sleeping gas or a tranquilizer gun. The choice is up to you.<br/></li><li>Payphone missions - rob certain locations in a specified amount of time<br/></li><li>Over 15 contracts requiring you to steal unique items<br/></li><li>Level up your thief and acquire new skills, which allow a number of new possibilities. Learn special skills, and activate unique abilities.<br/></li><li>Escape the police - intense chases with police cars and helicopters. Be careful to not get shot.<br/></li><li>Upgrade your car, change its color, give it more power - or just buy a sports car and be no match for the police.<br/></li><li>Steal cars - begin with a small, family sedan, and work your way up to a sport's dream car</li></ul>", "metacritic": null, "released": "2023-10-04", "tba": false, "updated": "2024-01-16T16:54:44", "background_image": "https://media.rawg.io/media/screenshots/02c/02c9efa590f34dcf8548bf634614803f.jpg", "website": "", "rating": 0.0, "rating_top": 3, "added_by_status": {"yet": 1, "owned": 10, "beaten": 3, "toplay": 4, "dropped": 2}, "playtime": 10, "achievements_count": 50, "ratings_count": 3, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["Ultimate Games", "CookieDev"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["PlayWay"], "esrb_rating": null}