{"id": 967450, "slug": "rising-dead", "name": "Rising Dead", "name_original": "Rising Dead", "description": "Immerse yourself in a heart-pounding survival adventure with \"Mall of the Undead,\" a gripping video game where your wit and survival skills will be put to the test. Trapped within the sprawling labyrinth of a shopping mall, your only goal is to endure for three relentless days until rescue arrives. But there's a chilling twist – hordes of ravenous zombies roam the mall's halls, hungry for your flesh.<br/>\n<br/>\r\nYour toolkit for survival? The mall itself. Make ingenious use of everyday items as makeshift weapons, bludgeoning and blasting your way through the relentless undead menace. Your mission is not just self-preservation; it's about saving others too. Locate fellow survivors before the zombies do, escorting them to the designated safe zones. Time is of the essence; those left behind are marked as \"lost\" and presumed dead.<br/>\n<br/>\r\nBut it's not just the zombies that threaten your survival. Your body craves sustenance, and calories are your lifeline. Move too quickly, and you'll burn precious calories, risking starvation and the slow erosion of your health. Scour the mall for food and beverages, the life-giving sources of calories and vitality.<br/>\n<br/>\r\nFor a more personal touch, customize your character's appearance at mall mirrors. Choose your gender, play with hair and eye colors, and mix and match outfits to define your unique style. Capture the essence of your survival journey with real digital photos that you can save to your hard drive, whether it's documenting your gameplay, taking selfies, or preserving the memories of the survivors you encounter.<br/>\n<br/>\r\nOne of the game's standout features is its dynamic unpredictability. Survivor and zombie locations are randomized, ensuring that every playthrough is a unique and thrilling experience. Will you conquer the relentless undead horde and emerge victorious from the \"Mall of the Undead\"? The clock is ticking, and your survival instincts are your only guide.", "metacritic": null, "released": "2023-10-07", "tba": false, "updated": "2023-10-09T02:17:29", "background_image": "https://media.rawg.io/media/screenshots/96d/96d1c396643c6f04fc94930c1aa34b3f.jpg", "website": "https://www.frozendungeon.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 425, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Frozen Dungeon"], "genres": ["Action", "RPG", "Simulation", "Indie"], "publishers": ["Frozen Dungeon"], "esrb_rating": null}