{"id": 967438, "slug": "my-sushi-story", "name": "My Sushi Story", "name_original": "My Sushi Story", "description": "<p>Cook in kitchen and restaurant</p>\n<p>My Sushi Story is a restaurant business simulation game that brings happiness to players. It features a wide variety of decor, appetizing Japanese dishes, and lovely characters.</p>\n<p>The customers are upset? The staff is slacking off? The restaurant is too small? The food is bad?</p>\n<p>You will go through the story of the restaurant in the game. It all begins when my grandma went to travel the world, leaving behind a slightly run-down sushi restaurant and a clumsy employee—Ono Ryota.</p>\n<p>Running a sushi restaurant of my own has always been my dream, but I have no prior experience in doing so. For the sake of my dream and to fulfill my grandma&#39;s instructions, Ono and I embark on a journey of running a restaurant that is soothing, hilarious, and filled with ups and downs!</p>\n<p>In this game, you will play as the boss of the sushi restaurant. You will create an assortment of Japanese dishes, make the daily purchasing plan, serve the customers, train the chefs and waiters, purchase items in the restaurants, and open a chain store.</p>\n<p>The game features hundreds of facilities, thousands of dishes, a dozen employees, and dozens of characters. Everything is free to play. In the game, you can create dishes like pork katsu, sushi, ramen, tempura, wagyu beef, sashimi, udon, foie gras, desserts, grilled seafood, steak, and many others. Enjoy delicacies from all over the world!<br />\n[Your Goal]<br />\nServe the customers, upgrade the facilities, create Japanese dishes, and collect good customer reviews!<br />\nCreate more Japanese dishes and make the restaurant famous!<br />\nEarn gold to upgrade, decorate, and expand the restaurant!<br />\nUnlock new private rooms, the second floor, the theater, and the conveyor belt sushi hall to make the restaurant larger and livelier.</p>\n<p>[Game Features]<br />\n1. High level of freedom: You can enjoy different business models and try out various management methods.<br />\n2. Renovation: You are free to combine the furniture of different styles and design the interior of different private rooms.<br />\n3. Making interesting friends: Meet people who are also fighting for their dreams, just like you. Enjoy the fun interaction with customers with different personalities.<br />\n4. Dealing with all kinds of customer requests: How would you handle customers with different personalities?<br />\n5. Enjoy a variety of cuisines.</p>\n<p>Never play a game of this genre?<br />\nDon&#39;t worry! My Sushi Story is very easy to play. With just a few taps, you can complete actions such as taking orders, serving customers, and settling bills to earn income effortlessly. You can play the game anytime, anywhere.<br />\nWhether you are a master or a newbie of simulation games, you&#39;ll be crazy about this warm and fun restaurant business simulation game!<br />\nDownload My Sushi Story for free now and embark on a delightful journey of running the restaurant!</p>", "metacritic": null, "released": "2023-04-09", "tba": false, "updated": "2023-10-07T11:43:02", "background_image": "https://media.rawg.io/media/screenshots/06b/06bc75e82641e4c6937f62bc4ca7e1cf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "Android"], "developers": [], "genres": ["Simulation", "Casual"], "publishers": [], "esrb_rating": "Everyone"}