{"id": 967410, "slug": "wizordum-demo", "name": "Wizordum Demo", "name_original": "Wizordum Demo", "description": "\nWizordum is coming soon and can be wishlisted \nhere<br/><br/>\n<h3>JOIN THE COMMUNITY</h3>\n<p>\n<br/>\n\nJoin the Wizordum community on <strong>Discord</strong> and talk directly with devs and other fans around the world.\n</p>\n<br/>\n\nWizordum is a retro first-person shooter placed in a fantasy world and it focuses on action and light puzzle elements with plenty of secrets filled with loot and bonus items. The game is inspired by classics from the 90s like Hexen, Heretic, and Catacomb Abyss.STORYChaos roams the land...Mercenaries from the West are pillaging towns and rumors speak of Darkness spreading from the Northern mountains. \n<br/>\n\nOrder of the Dawn dispatched every last of their Clerics to learn more about the source. None have returned so far...\n<br/>\n<br/>\n\nYou, one of the last Clerics, now stand at the edge of the town of Grimbrook. Do you have what it takes to locate the source and banish the Chaos? \n<br/>\n<br/>\n\nKEY FEATURES<ul>\n<li> Blast off your enemies with magic and steel\n<br/>\n</li>\n<li> Big arsenal of weapons &amp; consumable items\n<br/>\n</li>\n<li> Plenty of secret places filled with loot &amp; bonus items\n<br/>\n</li>\n<li> Solve puzzles and avoid traps\n<br/>\n</li>\n<li> Travel from town to mountains, through lush forest and beyond in single player campaign\n<br/>\n</li>\n<li> Collect all the bonus items and get the top score on the leaderboards</li>\n</ul>LEVEL EDITORUse in-game level editor to create levels or full campaigns and share them with others online.\n<br/>", "metacritic": null, "released": null, "tba": false, "updated": "2023-10-06T05:44:05", "background_image": "https://media.rawg.io/media/screenshots/412/4126a3b6bd017adc084023705ff870d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Emberheart Games"], "genres": [], "publishers": ["Apogee Entertainment"], "esrb_rating": null}