{"id": 967463, "slug": "the-castle-mystery", "name": "The Castle Mystery", "name_original": "The Castle Mystery", "description": "<strong>\"In the castle's depths, darkness awaits those who seek.\"</strong><br/><br/><br/><br/><strong>The Castle Mystery</strong> is a short first-person horror game where you step into the shoes of a historian who receives a tempting invitation to explore a long-abandoned castle. Drawn by the promise of a generous reward, you accept the offer without hesitation.<br/><br/>Equipped with your camera and notepad, you embark on an adventure, documenting ancient artifacts and unraveling the castle's history. However, exercise caution, for within its halls resides an ominous darkness, and an unknown entity is determined to hinder your discoveries.<br/><br/><br/><br/>Encounter a select number of intricately designed puzzles that will test your problem-solving abilities.<br/><br/>Beware of a mysterious presence lurking within the castle's shadows. As you progress, you may find yourself confronted with heart-pounding moments where you must navigate the castle's halls and evade this enigmatic being.<br/><br/><br/><br/>Delve into the castle's atmospheric environments, meticulously designed to immerse you in its haunting beauty, and experience a gameplay journey that offers replay-ability and the opportunity to uncover <strong>3 multiple endings</strong>.<br/><br/><br/><br/><strong>The castle beckons you forth... will you answer its call?</strong><br/><br/>First-time play-through around 1 or 2 hours<br/><br/><br/><br/><strong>Note:</strong><br/><br/>This game partially supports Xbox controllers (Shoulder buttons are necessary). You cannot rebind keys in this game. <br/>Control keys are viewable in the menu.", "metacritic": null, "released": "2023-10-06", "tba": false, "updated": "2023-10-09T02:33:52", "background_image": "https://media.rawg.io/media/screenshots/268/268749fa2804aae266409790db333050.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BTD Enterprises"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["BTD Enterprises"], "esrb_rating": null}