{"id": 967499, "slug": "noblesse-oblige-legacy-of-the-sorcerer-kings", "name": "Noblesse Oblige: Legacy of the Sorcerer Kings", "name_original": "Noblesse Oblige: Legacy of the Sorcerer Kings", "description": "What does it mean to be nobility? Is it no more than an inherited title, or does it hold some greater meaning? To some, nobility is not merely a station to be held, but an obligation to be met, and yet... Can such convictions hold firm in the face of intrigue, betrayal, and overwhelming odds?<br/><br/>Noblesse Oblige: Legacy of the Sorcerer Kings is a high fantasy RPG that reenvisions turn-based combat in dynamic ways. The game tells the story of Alexander, a young and idealistic yet intelligent and pragmatic nobleman, and his companions as they navigate politics, intrigue, ruling, and love amidst a tempestuous civil war. <br/><br/>Upon his return from studying in a distant land, Alexander’s birthright has been stolen and his lands thrown into chaos. Faced with this betrayal and the sudden loss of all that he has spent his life preparing for, he must take up the sword and retake what is his. But a true ruler does not—cannot—live by the sword alone, not if he seeks to create something that can endure. No, victory in battle may be essential, but true triumph comes in subtler ways: to claim a lasting, meaningful victory, Alexander must not merely crush or outwit his enemies, but also navigate the labyrinthine politics of court, inspire his people… and perhaps find love for himself amidst it all.<br/><br/>To some, the obligations of a lord are but a burden; to others, a farce. Yet to one like Alexander, who is possessed of the conviction to embrace his obligations, naught could bring greater satisfaction that using his power for good. Beneath the banner of such a lord gather allies, both those drawn by the flame of his will and those who have been touched by the light of his actions. Along the narrow path to victory, Alexander will gather a group of loyal companions—lovers, friends, rivals, allies, even those who were once his enemies, each with unique personalities and skills. Together with them, he will delve into the dark places of the world, traverse mountains, fight great battles... and perhaps most of all, struggle against those most terrible of shadows—those that lurk in the hearts of men, wrought by greed, hatred, envy, and sometimes lust. <br/><br/>But it is in deepest darkness that light can shine the brightest. Will you join Alexander on his journey to change the world for the better? <br/><br/>In Noblesse Oblige, every character is unique, with his or her own opinions, personality, and reasons for joining the party. Every party member has loyalty, driven by their opinions of choices made and paths taken; increasing loyalty unlocks powerful skill upgrades and extra story content for that character. In addition to their unique perspectives on the story, each of Alexander’s companions brings unique mechanics into battle. These include not only a wide variety of skills and playstyles, but also unique passive effects that shape how they approach combat. Combat in Noblesse Oblige is a novel take on the traditional turn-based RPG, one intended to promote skill and judicious use of abilities, rather than merely managing attrition or spamming generic attacks. <br/><br/><br/><br/><br/><br/><br/><br/>Beyond the battlefield, a lord must rule his realm. To see this done, Alexander must carefully build and manage key factors like Popular Support, Noble Support, Economic Status, Army Size, and Army Quality, factors that will have important impacts as the game proceeds. In addition, key choices may serve to shape the path ahead: with whom to ally, who is most worthy of holding strategic lands, or what faith the realm should follow in the days ahead. These choices, though few, will have a lasting impact upon the story. <br/><br/>But ruling the realm is not without its perks. Any lord of any importance has need of a castle, and that castle should reflect its lord’s desires. Accordingly, Noblesse Oblige features a system allowing for extensive castle customization:<br/><br/> <br/><br/><br/>As an Early Access game, Noblesse Oblige is a work in progress. The game already contains over 20 hours of playtime, comprising over 275,000 words of content. The present release schedule is to release a new set of content every 2-3 months. At present, Noblesse Oblige is free; when the game is closer to completion, this may change. For now, if you enjoy the game, please consider purchasing the optional Crown Loyalist DLC.", "metacritic": null, "released": "2023-10-06", "tba": false, "updated": "2023-10-09T03:23:23", "background_image": "https://media.rawg.io/media/screenshots/c39/c39835871e36e2fbad3e29f4cbfb13c3.jpg", "website": "https://www.lordfortegames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 463, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lord Forte Games"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Lord Forte Games"], "esrb_rating": null}