{"id": 967473, "slug": "speed-master", "name": "Speed Master", "name_original": "Speed Master", "description": "Speed Master is a racing game with a focus on speed and skill, inspired by the slot cars of yore. All you need is one button to control your car. <br/>Fast-paced gameplay with a \"easy to learn, hard to master\" mindset. Anyone can pick up the controller, for fun or for glory.<br/><br/><br/>You may only have one button, but you can accelerate, jump, flip, drift and boost to achieve maximum speed. It's all about knowing when to put the pedal to the metal, so you don't go offroad and crash.<br/>The car sticks to every surface, so nothing is impossible. Tight turns, sideways tracks, upside down maneuvers, loops, ramps, all in a days work of a Speed Master.<br/><br/><br/><br/>Learn your skills in the arcade mode and challenge yourself with the craziest race tracks. <br/>Compete online in a different circuit everyday. Gather points based on your rank and claim your place at the weekly championship podium.<br/>Gather your friends and show them who's boss in the split screen mode for up to 4 players.<br/><br/><br/><br/>Collect over 30 cars with different colors to choose from. Inspired by real and fantasy vehicles with a low poly toy art style.<br/>During your play-through you will gather coins to unlock cars and colors. However, if you really want them all, you'll have to be a true Speed Master and claim victory at the Champioship. Let the races begin!<br/><h3>Features List</h3><ul><li> <strong>Speed and stunts</strong><br/>Beat multiple challenges with tight turns, jumping ramps, sideways tracks, upside down tracks and loops.<br/><br/></li><li> <strong>One Button Control</strong><br/>You only need to press one button. Press to accelerate and backflip, let go to break and frontflip.<br/><br/></li><li> <strong>Arcade Mode - Single player</strong><br/>30 single player tracks with unique challenges <br/><br/></li><li> <strong>Versus Mode - Spit Screen Local Multiplayer</strong><br/>Play with up to 4 friends on Spit Screen across 10+ circuits<br/><br/></li><li> <strong>One controller to rule them all</strong><br/>You and your friends can all play using one controller/keyboard. Just assign  a different button to each player.<br/><br/></li><li> <strong>Car collection</strong><br/>30+ cars with different color combinations to unlock and collect. </li></ul><br/><strong>May the speed be with you!</strong>", "metacritic": null, "released": "2023-10-06", "tba": false, "updated": "2023-10-09T02:45:21", "background_image": "https://media.rawg.io/media/screenshots/acc/accce93dc34027e0f20edaf11d7b2dc6.jpg", "website": "https://carpistudio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Carpi Studio"], "genres": ["Action", "Racing", "Casual"], "publishers": ["Carpi Studio"], "esrb_rating": null}