{"id": 967517, "slug": "tankitos", "name": "Tankitos", "name_original": "Tankitos", "description": "<h3>Tankitos!</h3>Even the name reveals what is this game about, game inspired by old school game \"Battle City\" originally on NES in modern stylized style is full of tanks and tank battles in various arenas.<h3>What is all about?</h3><br/>You can choose if you want to play solo missions or just enjoy some fun with your friends in online. Solo missions has same rules as in original \"Battle City\" game. Player have to protect his base against enemies. Enemies are spawned with different level and power. If player survive all enemies, player wins and can continue to next level, if player lost his all lives, player loosed and must play again. Most of walls are destroyable and those ones contains pickable items like, healths, armor and variety of weapons.<h3>What can you expect by purchasing it?</h3><br/>Lot of fun with friends or with NPCs trying to destroy your base.<br/>By playing solo player can achieve achievements, levels, xps and game coins. Game coins can be used for buying chests. Chests contains skins, new tanks, boosting cards and another game coins.<br/>By playing multiplayer player can achieve free chests of all levels and xp points which leads to level up.<br/><br/><strong><h3>There is marketplace? :O</h3></strong><br/>YES! Finally, I tried to make games more interesting, this game is my first game which contains marketplace! Marketplace contains skins, boosting cards, keys for some chests and chests. Some of items are tradable.", "metacritic": null, "released": "2023-10-08", "tba": false, "updated": "2023-10-09T03:46:23", "background_image": "https://media.rawg.io/media/screenshots/82f/82f60c45f0844fa6412fc44b8dd20a25.jpg", "website": "http://bl0ckdave.cz/games/Tankitos", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bl0ckDave"], "genres": ["Action", "Indie"], "publishers": ["Bl0ckDave Studio"], "esrb_rating": null}