{"id": 967579, "slug": "animalia-2", "name": "Animalia", "name_original": "Animalia", "description": "As the next leader of your people, you visit the Summit, a meeting of world leaders in a netural location. Your parents, the King and Queen, demand you find a marriage proposal while your here. Your options encompass the animal kin as they visit the Summit this year to strenghten the relationship between your races. Tensions are high between your races and may prove a challenge in your match. Choose your mate from among the lords and ladies and get swept away in the adventure of your courtship. Your choices will change the outcome of your life.<br/>\r\nWill you choose Sebastion, Lord of the Forests of the undying? A Deer kin of massive size, but a bigger heart, as a chance at a normal life takes a fiery turn. Or maybe you like struggle cuddles with a fox? Renley, the Lord of Shadows, will drag you deep into the criminal undergound in search of the resistance. Maybe the brooding type is more for you? Ferris, Lord of the Azure skies, may seem cold, but his passion to protect you from the resistance may warm your heart. <br/>\r\nVarious scenarios and choices can hinder or spice your playthrough. Learn new information about your mate with every choice option. No pay to play ever. All content included. This romance sim is player gender free and includes lgbtq romance options. Sexual scenes are skippable. Currently 3/7 romance options available and more on the way!", "metacritic": null, "released": "2023-10-10", "tba": false, "updated": "2023-10-13T02:45:05", "background_image": "https://media.rawg.io/media/screenshots/7fe/7fe8ecf6fca4191fac1851ac3ff1be5f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jesse Robinson"], "genres": ["Simulation"], "publishers": ["Jesse Robinson"], "esrb_rating": null}