{"id": 967513, "slug": "draw-3", "name": "Draw", "name_original": "Draw", "description": "<strong>Welcome to the doodle world! Armed with nothing but a pencil, play as Stickman as you explore a brand-new world. Solve intricate puzzles by drawing into the game, meet new friends while dodging scribble monsters, and make memories that’ll never be erased!</strong><br/><br/>Draw is a 2D sidescroller–an artistic story-rich journey of grief and acceptance through the doodles of Nathan, a high schooler dealing with the grief of a recently lost friend. <br/><br/>As “Stickman,” you will navigate a lined-paper world of fun puzzles and doodle monsters. You’ll encounter different characters representing unique individuals in Nathan’s life who play a vital role in his journey of self-sabotage, isolation, depression, acceptance, and recovery.<br/><br/>In creating Draw, we set out to tell a meaningful and impactful story through simple artistic means, drawing heavily from the art style of iconic stick-figure fighting Flash games popular in the late 2000s. Taking inspiration from indie devs in the past who have tackled heavy and emotional topics with maturity and thoughtfulness despite their limited creative and programming resources, we hope to pay tribute to them in our own way through Draw.<br/><br/><strong>This game contains mature themes/topics that may be upsetting to some viewers.</strong><h3>Features</h3><ul><li> 1-2 hours of total gameplay with 600+ lines of dialog<br/></li><li> Draw with your mouse to create objects that interact with the environment<br/></li><li> An original soundtrack featuring 7 songs<br/></li><li> Explore over 30 different puzzles with 3 unique object physics<br/></li><li> 30 different hand-drawn animations and cutscenes<br/></li><li> Visual novel-style cutscenes deep-diving into the characters' lives</li></ul>", "metacritic": null, "released": "2023-10-06", "tba": false, "updated": "2023-10-09T03:41:45", "background_image": "https://media.rawg.io/media/screenshots/977/977d0e8abf03ee93c23f20fe3af364a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Draw Games Developers"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Draw Games Developers"], "esrb_rating": null}