{"id": 967516, "slug": "xin-ling-zhan-zheng-feng-yun-zai-qi", "name": "心灵战争-风云再起", "name_original": "心灵战争-风云再起", "description": "Guofeng multiplayer online real-time combat 3D game is coming strong! Breaking through the army in close combat, wielding swords for nine days and dominating the world. Long range ink bow, forest dark grass startle wind, general night bow, various professions to choose from. The game adopts real-time combat mode.<br/>\n<br/>\r\nIn the game, the characters played by players wander between countries, earn meritorious deeds, enhance military ranks, and achieve great success!<br/>\n<br/>\r\nBy completing national missions, exploring storylines, defeating bosses, challenging dungeons, daily activities, and other gameplay methods, various materials and resources are obtained to enhance equipment, obtain spiritual cavalry, collect beauties, and famous generals, achieving more possibilities and opening up new legends!<br/>\n<br/>\r\nPlayers can team up with friends to face the challenges in the game and fight side by side. In the game, players can conquer various maps, cross thousands of miles, and experience thrilling battles on the battlefield. The accompanying elements of beauty also add to the romantic plot of the game, allowing players to adventure with their partners and create legends together. Family unity is another highlight of the game, where players can collaborate with family members to create a new brilliance. This gameplay feature creates an atmosphere of unity, mutual assistance, and romantic adventure, allowing players to enjoy the fun of teamwork and intimate relationships in the game.<br/>\n<br/>\r\n【 Featured gameplay 】<br/>\n<br/>\r\nCool equipment, shining throughout the venue<br/>\n<br/>\r\nIn the game, there are various professions to choose from, various cool equipment, and mounts waiting for you!<br/>\n<br/>\r\nFamous General System, Strong Attack<br/>\n<br/>\r\nEnable players to obtain powerful generals, each with unique skills to adapt to different combat needs. The combination of elite generals in the battle can activate the powerful mana bonus!<br/>\n<br/>\r\nVersatile fashion, supporting the entire audience<br/>\n<br/>\r\nCool appearance paired with your heart, making you unique and earning a high turnover rate!<br/>\n<br/>\r\nFree trading, those with higher prices will receive<br/>\n<br/>\r\nThe market system is a system where players buy and sell excess equipment and props, allowing them to purchase high-quality props from other players and sell them out to obtain the resources they need!", "metacritic": null, "released": "2023-10-06", "tba": false, "updated": "2023-10-09T03:45:03", "background_image": "https://media.rawg.io/media/screenshots/8b5/8b551ae05979c9f3ed18d97750eda216.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Echo"], "genres": ["RPG"], "publishers": ["Echo"], "esrb_rating": null}