{"id": 967504, "slug": "hot-dog-reporter", "name": "Hot Dog Reporter", "name_original": "Hot Dog Reporter", "description": "<h3>Hello!</h3><br/>Hot Dog Reporter is a (very early access) game about a hot dog in a hurry.<br/><br/>It's a fast paced platformer with a speedrun mode that will eventually turn into a metroidvania with a mystery to solve and charmingly weird characters to meet (and a speedrun mode). Once the linear levels are iterated on enough to finalize Hot Dog Reporter's mechanics, gameplay will begin to spill onto the sprawling, interconnected streets of New Yorkshire City. I already have a pretty firm grasp of the final narrative shape and visual direction, and I can't wait to share what's inside my head (and also inside like 500 word documents and photoshop files). Thank you, from the bottom of my heart, for checking out Hot Dog Reporter.<br/><br/><strong>Current features include:</strong><br/><ul><li>Obsessively tuned movement mechanics influenced by some of my favorite platformers, including Celeste, Super Meat Boy, and Mega Man X.<br/></li><li>An in game timer that tracks your fastest runs for each level, as well as a sum of best for your overall time.<br/></li><li>Speedrun Mode, a non-stop race through every level in the game that tracks your fastest time.<br/></li><li>Twelve levels exploring all the best ways to have fun with a fast moving hot dog.<br/></li><li>A leaderboard to rank the best Speed Doggers on the planet.<br/></li><li>A killer bebop soundtrack to GET YOU MOVING!</li></ul><br/><strong>We're currently working on:</strong><br/><ul><li>New abilities to expand your repertoire and go EVEN FASTER.<br/></li><li>Fresh levels with new mechanics to explore.<br/></li><li>Artwork for more diverse levels and biomes.<br/></li><li>Additional accessibility options.<br/></li><li>MacOS and Linux platform releases.</li></ul><br/><strong>Longer term plans:</strong><br/><ul><li>A lovingly crafted story filled with memorable characters. Take Frankie Merguez through the streets, factories, nightlife, and dark underbelly of the city to get to the bottom of the mysterious disappearances haunting New Yorkshire City.<br/></li><li>An expansive, interconnected map with fast travel.<br/></li><li>Ability acquisition, allowing you to reach previously inaccessible areas and more quickly traverse the places you've already been.<br/></li><li>Unlockable costumes for Frankie.<br/></li><li>CUTE CATS!</li></ul><br/>Join the EXQUISITE TRASH CLUB Discord for updates, bug reports, and more!<br/><br/><strong>HEADS UP:</strong> Hot Dog Reporter is currently in very early access and will have frequent save wipes and leaderboard wipes as levels get added and updated.<h3>Credits</h3><strong>DESIGN / ART / PROGRAMMING / SFX</strong><br/>Angel Rivera<br/><br/><strong>MUSIC</strong><br/>Do It, Seven, Open the Source, and Nobody Sleep<br/>by Paolo Pavan<br/><br/><strong>SOFTWARE</strong><br/>Godot Engine 4<br/>Aseprite<br/>Adobe Photoshop<br/>Bfxr<br/><br/>", "metacritic": null, "released": "2023-10-06", "tba": false, "updated": "2023-10-09T03:31:10", "background_image": "https://media.rawg.io/media/screenshots/a87/a87090ea28ae261b7a76deaf02be36fd.jpg", "website": "https://exquisitetrash.club/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Exquisite Trash Club"], "genres": ["Action", "Indie"], "publishers": ["Exquisite Trash Club"], "esrb_rating": null}