{"id": 967503, "slug": "inside-the-labs", "name": "Inside the Labs", "name_original": "Inside the Labs", "description": "Inside the Labs is the ultimate online co-op survival horror game for 1-4 players. The abandoned sites of Nova Laboratories Incorporated, also known as Nova Labs, have always been shrouded in mystery. However, when news of possible human experiments surfaced, it piqued your curiosity like never before. As a medical student, you decide to visit and explore the labs to uncover the truth and gather evidence. But beware! Rumor has it that the darkness, which was once a failed human experiment, now haunts the halls of the lab. Can you unravel the mysteries of the labs and emerge unscathed, or will you fall victim to the unspeakable horrors that lurk within?<br/><br/><br/><br/><br/>As you step inside the labs, your mission is clear: be stealthy, explore the site, and gather evidence related to the failed human experiments that took place there. But be warned, lurking in the shadows is a mutant that will stop at nothing to hunt you down and tear you apart.<br/><br/>Every step you take is crucial. Stay alert and stay alive. Your objective is to complete all tasks, including identifying the type of mutation before your time runs out. The mutant is cunning and agile, and it will roam everywhere, ready to pounce at any moment. You must outsmart it and stay one step ahead.<br/><br/>To increase your chances of survival, always carry an extra medkit and spare flashlight batteries. Remember where the hiding spots are so you can quickly lock yourself inside if the mutant spots you. The clock is ticking, and every second counts.<br/><br/><br/><br/><br/><br/>Immerse yourself in a thrilling adventure that features a chilling atmosphere and a dark ambiance, enhanced by stunning, Unreal Engine 5 graphics.<br/><br/><br/>Dive into the complex and mysterious pasts of each character, uncovering their motivations, fears, and secrets.<br/><br/><br/>Add an additional layer of realism by switching to the bodycam camera anytime.<br/><br/><br/>Explorers can choose from easy, normal, and hard.<br/><br/><br/>Endure the effects of eerie 3D audio attenuation and distortion.<br/><br/><br/>Collect useful items and use them wisely.<br/><br/><br/>Prepare and choose your item and perk wisely before the exploration. <br/><br/><br/>If you are too scared to enter the labs alone, gather your friends and bring them along with you.<br/><br/><br/>Each explorer is given a walkie-talkie to communicate, but be careful not to speak too loudly, as it could attract unwanted attention.<br/><br/><br/>Multiple maps as well as randomized mutation, item spawning and triggers.<br/><br/><br/>Unlock new items, perks, maps and characters as you progress through the game.<br/><br/><br/>It considers the lab its home and knows the place better than you do. It can see you and it might hear you.", "metacritic": null, "released": "2023-10-06", "tba": false, "updated": "2023-10-09T03:29:57", "background_image": "https://media.rawg.io/media/screenshots/638/6380492f8f3f2600d62d818e4551d4f9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 255, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chreseeba Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Chreseeba Games"], "esrb_rating": null}