{"id": 967698, "slug": "heir-of-the-dog-2", "name": "Heir of the Dog", "name_original": "Heir of the Dog", "description": "Discover the darker side of Victorian London in this British point &amp; click comedy adventure.\nAfter a mysterious explosion over Victorian London, Cummerbund Bandersnatch (a likeable, if dim-witted twit) visits his uncle's laboratory and discovers an experimental new formula guaranteeing a \"good time\" for whoever drinks it. Seduced by the promises in his uncle's journal, Cummerbund decides that it is probably safe to drink and discovers his life will never be the same again.\n<br/>\n<br/>\n<br/>\n<br/>\nWhat may seem like a curse at first, leads Bandersnatch on a thrilling, love-torn adventure through the back alleys of Old London Town as he uncovers a sinister plot involving a secret society, the royal family, copious amounts of dog hair and his uncle at the very centre.Demo coming soon!Take a night-time stroll around the local park, take in a show at \"Giuseppe Mitchell's Famous Travelling Louse Circus\" or enjoy a fat-encrusted delight from Mrs Figgins' pie shop as you attempt to mix the antidote to your uncle's experimental formula. Just watch your back at the local barbers! The demo will be the perfect introduction to the world of Cummerbund Bandersnatch with high-quality art, hilarious dialogue and a promise of what's yet to come.An origin storyBack in 2020, we created a short adventure game in under two weeks, for a game jam competiton. In that time, we developed a fully-voiced point &amp; click adventure called Hair of the Dog. We released it on various platforms and, since then, it has been enjoyed by over tens of thousands of players worldwide.\n\n<br/>\n<br/>\nWe parked the concept while we worked on developing our first commercial title, Lucy Dreaming, which has enjoyed awards and critical acclaim since its release in 2022. Now we're returning once again to the fog-smothered streets of London town to expand the world of Cummerbund Bandersnatch and his peculiar condition.", "metacritic": null, "released": null, "tba": false, "updated": "2023-10-13T05:19:49", "background_image": "https://media.rawg.io/media/screenshots/db8/db8f2b4ca772cb5e2fcde81e2210d17a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Tall Story Games"], "genres": [], "publishers": ["Tall Story Games"], "esrb_rating": null}