{"id": 967663, "slug": "super-56", "name": "SUPER 56", "name_original": "SUPER 56", "description": "Eons ago, <strong>SUPER 56</strong> was banned by the Government of Pain and all copies were buried in the Samsara Desert. Cartridges have now been spotted in independent gaming stores throughout Hell. Roommates Kronos and Brones secured their own copy of the game and challenged their neighbor to a high-scoring bet. But, it turns out they're pretty bad at video games. It’s up to you to achieve an S Rank and shut the pesky neighbor up once and for all.<br/><br/><br/><strong>SUPER 56</strong> features 56 genre-bending mini-games to crush with a press of a single button. Each run challenges players to complete as many mini-game stages as possible before running out of lives. As stages are conquered, the games speed up until all Hell is unleashed! Earn bragging rights as you compete for the top of the worldwide leaderboards. Even after you become a SUPER 56 legend, keep things fresh with Daily Challenges. <br/><br/><br/>Each stage draws inspiration from a different era of gaming, and even includes some recognizable references and homages to gaming history. Whether you’re drifting around the racetrack, mowing down demons in a retro FPS, or even finding love in a lavish JRPG in 25 seconds, you never know what to expect next!<h3>Key Features:</h3><ul><li>56 genre-bending mini-games all designed around the press of a single button.<br/></li><li>Easy to learn, yet hard to master gameplay.<br/></li><li>Unlockable Mod Stones to change the rules of each playthrough.<br/></li><li>References, homages, and ridiculous humor centered around gaming history.<br/></li><li>Compete on the worldwide leaderboard and earn the ultimate bragging rights.<br/></li><li>Fully customizable experience with unlockable characters, voice packs, ludicrous phrases, and more.<br/></li><li>Achievements galore! </li></ul>", "metacritic": null, "released": "2023-10-11", "tba": false, "updated": "2023-10-13T04:36:16", "background_image": "https://media.rawg.io/media/screenshots/554/5547899dd6042473ed05a5ee8345d3db.jpg", "website": "https://www.onionsoupinteractive.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Onion Soup Interactive"], "genres": ["Action", "Sports", "Racing", "Casual", "Indie"], "publishers": ["WhisperGames"], "esrb_rating": null}