{"id": 967621, "slug": "chronicles-of-vaeltaja-in-search-of-the-great-wand", "name": "Chronicles of Vaeltaja: In Search of the Great Wanderer", "name_original": "Chronicles of Vaeltaja: In Search of the Great Wanderer", "description": "<strong>Chronicles of Vaeltaja: In Search of the Great Wanderer takes you back to the golden era of pc gaming, when role-playing games like Dungeon Master, Might and Magic, Eye of the Beholder, Lands of Lore, Wizardry and Ultima ruled the world. Gather your party of six adventurers and embark on a journey through the colourful kingdom of Twin Falls where sunny fields, lush forests, misty swamps and dark dungeons await to be explored!</strong><br/><br/>Welcome, traveller, to the kingdom of Twin Falls where strange menace is threatening the land that once lived in tranquil. You are hired by the King Menekses II to investigate strange occurrences in seaside town of Pramea where children have been disappearing and travellers are under constant attacks from bandits and beasts that shouldn't even roam there. Your job is to gather a party and find out who or what is behind this new threat and uncover the mystery of the Great Wanderer who once saved the humanity from a great peril.<br/><br/>So ready your weapons and wits to take on a memorable journey across vast forests, fields, swamps and dungeons to bring peace back to Twin Falls.<br/><br/><ul><li>First-person exploration in beautiful and colourful world created with 2.5D pixel graphics combining pre-made and custom assets.<br/></li><li>Main questline where some quests give you a possibility to choose from a couple of different solutions.<br/></li><li>Mythology inspired by ancient Gnostic writings. <br/></li><li>Six character party system with skills and stats that affect beyond battles and conversations.<br/></li><li>Multiple character classes to hire: Warrior, Hunter, Mage, Shadow, Priest, Witch.<br/></li><li>Grid-based movement that takes you back in the golden era of pc-gaming.<br/></li><li>Turn-based battle system with animated enemies.<br/></li><li>Overworld areas full of exploration.<br/></li><li>Atmospheric and dangerous dungeons where different enemies delve and puzzles await.<br/></li><li>Fight against bandits, bats, skeleton warriors, zombies, leechers, dark mages and other creatures of evil.<br/></li><li>Boss battles that might have other solutions than violence.<br/></li><li>Hand-crafted game world with no procedural generation.<br/></li><li>Multiple side-quest that may even lead to optional dungeons or other hidden secrets.<br/></li><li>Branching conversations where your 'charisma' and speech skills are put to test.<br/></li><li>No tutorials, no hand-holding, no cinematic cutscenes - just pure joy of experiencing and discovering!<br/></li><li>Lots of equipment and items to help you on your journey - don't forget to buy at least torches as the dungeons are dark places to wander around.<br/></li><li>Use mouse and/or keyboard to interact with the game world.<br/></li><li>Control battles with mouse and/or keyboard.<br/></li><li>Interact with NPCs to access side-quests.<br/></li><li>Meet quirky characters like The Order of the Knights Who Never Discuss About the Same Topic Twice.<br/></li><li>Inspired by the classics like Dungeon Master, Eye of the Beholder, Ultima and The Legend of Zelda<br/><br/><strong>Graphics and mechanics may and will change for the final release.</strong></li></ul>", "metacritic": null, "released": "2023-10-10", "tba": false, "updated": "2023-10-13T03:38:45", "background_image": "https://media.rawg.io/media/screenshots/255/255800b0ffef687f04bd6eeb2d877034.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 307, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Witchgrove Games"], "genres": ["RPG"], "publishers": ["Witchgrove Games"], "esrb_rating": null}