{"id": 967656, "slug": "soulbind-tales-of-the-underworld", "name": "Soulbind: Tales Of The Underworld", "name_original": "Soulbind: Tales Of The Underworld", "description": "\"Soulbind: Tales Of The Underworld\" is an addictive 2D roguelike platformer game that will take you into an amazing and dangerous dark fantasy world. As the mysterious skeleton known as \"The Endless\", you will embark on an epic journey full of adventure, battle and mystery.<br/><br/>In this dark and brutal world, you will explore a variety of locations filled with terrifying creatures and dangers. To overcome these challenges, you must collect the body parts of various monsters to strengthen your hero. Each collected body part grants new abilities and powers, opening the way to more challenging levels and secret locations.<br/><br/>Beware, however - every decision has consequences. You'll have to make a choice between using your new abilities and conserving resources for future challenges. Tactical thinking and strategic planning will be your faithful companions in this exciting adventure.<br/><br/>Additionally, you'll have the help of your trusted ally - a living flying book named Archie. She will be your guide in this world, keeper of the lore and history and assistant in dialogues with other characters.<br/><br/>In Soulbind: Tales Of The Underworld, you will navigate your way through treacherous labyrinths, battle powerful bosses and uncover secrets of the past and present. Your journey will take you to dark and ancient places, revealing the history and myths of this unique world based on the Olonkho epic.<br/><br/>\"Soulbind: Tales Of The Underworld\" offers you an immersive gameplay experience, gorgeous drawing world style graphics and captivating music that will immerse you even deeper into this dark and mysterious world.<br/><br/>Are you ready to take on the challenge and unravel the mysteries of Soulbind: Tales Of The Underworld? Embark on this exciting journey and show your strength, skill and ability to overcome any obstacle. Your destiny and the fate of the world depend on your decisions.", "metacritic": null, "released": "2023-10-11", "tba": false, "updated": "2023-10-13T04:25:31", "background_image": "https://media.rawg.io/media/screenshots/17b/17b2dabf2428b68040e8186dbd8ba25b.jpg", "website": "http://rubedogames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Rubedo Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Rubedo Games"], "esrb_rating": null}