{"id": 967648, "slug": "fallen-ninja", "name": "Fallen Ninja", "name_original": "Fallen Ninja", "description": "<h3>Story:</h3>Fallen Ninja is big RPG game with different themed maps like forest, dungeon etc. Evil Mordenai and his army has captured treasure chests. Player mission is to find Mordenai boss in every level and kill him. Mordenai boss has several different special attacks like magic sword and skull storm attacks, but Mordenai is weakened boss but his army is very strong.<br/>After killing boss Mordenai magic gate will disappear and player can collect treasure chest and finish level. Every level also contain 1 secret Blue crystal. Finding blue Crystal gives player Steam Achievement also finishing levels gives achievements.<br/>Player Ninja has sword and shield for basic battle also 20 normal arrows and 8 explosive arrow  to use every level and also 20 health potions to increase health. After death player need restart level from start. So be the hero Fallen Ninja and find evil Mordenai and save treasure chests.<h3>Features:</h3>- 7 different themed maps<br/>- Several weapons like sword, bow and 2 different arrows. Player has every level 20 normal arrows and 8 Explosive arrows<br/>- 20 health potions to increase health<br/>- Every level has boss Mordenai. Killing boss Mordenai magic gate will be disappeared and player can save Treasure chest<br/>- Steam achievements by collecting Treasure chest and hidden blue Crystals<h3>Planned updates:</h3>- Bugfixes<br/>- More maps", "metacritic": null, "released": "2023-10-11", "tba": false, "updated": "2023-10-13T04:13:09", "background_image": "https://media.rawg.io/media/screenshots/d8a/d8a4c1d2d251f55d0e4bc90c509b221f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 476, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Valkeala Software", "VS Revolution"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Valkeala Software"], "esrb_rating": null}