{"id": 967683, "slug": "saltsea-chronicles", "name": "Saltsea Chronicles", "name_original": "Saltsea Chronicles", "description": "<p>Saltsea Chronicles is a new story-driven adventure game from the award-winning indie studio Die Gute Fabrik (Mutazione, Sportsfriends).<br />\nCaptain Maja’s misfit crew must heist their impounded ship and mount a rescue. Guide the crew across islands of a post-flood world known as ‘Saltsea’. Explore strange and wonderful communities, uncover a deep conspiracy, choose where to go and which crew members to investigate with, and chart a journey through twists and turns, difficulties and delights.<br />\nA Post-Flood World<br />\nVisit different island communities as you investigate the mystery at the heart of the game. Each built on pre-flood ruins – in beautiful and beguiling ways.<br />\nAs you explore you will uncover different pathways through a rich and varied series of islands. This flooded world, betrayed by the so-called Hoarders, barely remembers a time before the Flood. They rebuilt on the ruins of what came before, and new talents and technologies took the place of the old. Many surprises await!<br />\nChoose Your Priorities<br />\nIn Saltsea Chronicles you guide the entire crew through the story. As well as investigating the mystery of your captain’s disappearance, you will uncover secrets, create and resolve tensions between the crew, and add to your number as you meet others who ask to join you.<br />\nEach chapter, you pick which island to visit and who to send on the expedition. Your choices will unlock different content, develop relationships, and give you a chance to resolve (and create) tensions within the crew.<br />\nWith a lightning-fast navigation system, you’re free to hop around the islands as you explore. Choose between short and snappy observations, or dig deep into conversations with your crewmate or the locals, exploring the islands across different times of day.<br />\nUncover a Conspiracy<br />\nWas your captain kidnapped? Or did she leave of her own free will? Keep track of the mystery in Murl’s Log and collect records of your encounters as stickers in the Almanac.<br />\nDifferent playthroughs will take you to different islands, introduce different characters and have dramatic consequences for your crew. You can replay from any chapter and branch your save file to meet new crew members, explore different communities and trace alternative pathways through the rich and gripping story.<br />\nThemes<br />\nFrom an award-winning and diverse writersroom – with experience in Young Adult fiction, film, theatre, poetry and games – Saltsea Chronicles imagines a rich world where communities have rebuilt in the aftermath of disaster, creating a new society of connection, resilience and hope—but one still troubled by the universal questions of how to live together through conflict and change. This wide-reaching story game traces meaningful themes with humour, lightness of touch, and care.<br />\nFeatures:<br />\nDistinctive print-inspired art style: A unique art style inspired by risograph print techniques brings a storybook aesthetic to the fantasy-tinged world of Saltsea Chronicles, brought to life with beautiful bespoke animation.<br />\nTry your hand at Spoils: Spoils is a trick-taking card game from the world of Saltsea Chronicles. Play cards with each local community, but watch out – some islands have their own house rules!<br />\nAn original soundtrack by Eli Rainsberry: IGF-nominated composer and sound artist Eli Rainsberry (No Longer Home, A Monster&#39;s Expedition) presents a musically hybrid score and soundscape guided by the spaces and characters of Saltsea Chronicles.<br />\nNavigate the drama as well as the seas: Tensions between crew members are represented by Issues, small ‘relationships quests’ you can track, resolve, or, sometimes, just have to leave unsolved.</p>", "metacritic": null, "released": "2023-10-12", "tba": false, "updated": "2023-10-15T17:01:56", "background_image": "https://media.rawg.io/media/screenshots/3b5/3b5b4b65058b93749db27b43a0726e00.jpg", "website": "https://www.saltseachronicles.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1, "toplay": 4}, "playtime": 16, "achievements_count": 42, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Nintendo Switch"], "developers": ["Die Gute Fabrik"], "genres": ["Adventure", "Indie"], "publishers": ["Die Gute Fabrik"], "esrb_rating": null}