{"id": 967603, "slug": "swords-crystals", "name": "Swords & Crystals", "name_original": "Swords & Crystals", "description": "Embark on an epic journey into a sprawling and immersive top-down MMORPG that invites players to explore a vast and enchanted medieval open world teeming with secrets, challenges, and competition. Explore ancient villages, sprawling forests, and mystical landscapes that offer a truly captivating online adventure where your destiny is shaped by your work and abilities.<br/><br/>This groundbreaking top-down game distinguishes itself from the rest through its wholly innovative approach, encompassing elements such as online gameplay, a distinctive graphic style, real-time combat, an extensive inventory and equipment system with banks and shops, and a singular expansive open world devoid of loading screens or segregated zones. It features a 2D world with graphics and physics reminiscent of 3D.<br/><br/><br/><strong>KEY FEATURES:</strong><br/><br/><strong>Stunning Visuals:</strong> Lose yourself in the mesmerizing landscapes with beautiful wild forests, dazzling deserts, enchanted waters, and mysterious dark ravines. From day and night cycles to floating leaves to radiantly reflected water, the game's visuals bring the world to life.<br/><br/><strong>Immersive Meditative Soundscapes:</strong> Immerse yourself in a sonic tapestry of enchanting melodies and ambient soundscapes that transport you to the heart of the game. The evocative music brings the world to life, heightening the emotions of every triumph and trial.<br/><br/><strong>Interactive Multiplayer:</strong> Collaborate with a vibrant community of players from around the globe. Compete, trade, or unite with other players to partake versus monsters that demand unity or strategy to overcome.<br/><br/><strong>Vast Magical Realm:</strong> Step into a breathtaking, beautifully crafted vast open world, free from any loading screens or separate zones where lush forests, mysterious caverns, and arcane landscapes await your exploration rich with secrets, hidden pathways, and mythical creatures waiting to be discovered.<br/><br/><strong>Leveling and Questing:</strong> Embark on a journey of continuous growth by leveling up your character by slaying foes and completing quests. From a fledgling adventurer to a legendary hero, your progression is a testament to your dedication and prowess.<br/><br/><strong>Skill Mastery:</strong> Hone your skills in 10 various disciplines, such as swordsmanship, mining, and courage. With dedicated training, your character can become a master in multiple areas, allowing improved opportunities such as access to better weapons, access to more valuable mines, or to have no fear debuff when facing terrifying bosses that require higher courage.<br/><br/><strong>Collect Items and Upgrade Gear:</strong> Delve into ancient ruins and treacherous dungeons to uncover rare items and improved gear. Collect an impressive array of weapons, armor, consumables, and many other resources that evolve as you do. As you collect tokens from bosses or receive gold coins from trading, can you buy equipment from artisans, enhancing your prowess on the battlefield.<br/><br/><strong>Epic Boss Battles:</strong> Fight solo or team up with fellow adventurers to take on colossal bosses that threaten the balance of the realm. Strategize, coordinate attacks, and harness the right equipment set to emerge victorious and claim rare treasures as your reward.<br/><br/><strong>Engaging Puzzles and Hidden Pathways:</strong> Immerse yourself in intricate puzzles and guide yourself with magical elements to unlock hidden chambers, access secret areas, and unveil the mysteries of the land.<br/><br/><strong>Badges and Achievements:</strong> Seek out a plethora of achievements and badges scattered throughout the realm. From conquering treacherous dungeons to reaching hidden vistas, these accolades showcase your dedication and skill to demonstrate your victory to other players.<br/><br/><strong>Leaderboards and Records:</strong> Compete with fellow adventurers for supremacy on the online leaderboards by striving to break records in various activities, including boss battles, PVP, and skill challenges. Push your limits to ascend the ranks and earn legendary rewards to showcase your accomplishments to the world.<br/><br/><strong>Constant Evolution:</strong> Experience a living, breathing world that evolves over time. With regular updates, new expansions, and seasonal events, Swords &amp; Crystals ensures that your adventures remain fresh and captivating, while at the same time not diminishing the value of your previous earned achievements and belongings, and while also not updating the game broken like some major MMORPG titles did in the past.", "metacritic": null, "released": "2023-10-09", "tba": false, "updated": "2023-10-13T03:12:22", "background_image": "https://media.rawg.io/media/screenshots/370/3704a9e6c8ff429f2486bf2a55c2e9a9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 270, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Job Timmermans"], "genres": ["Adventure", "RPG", "Massively Multiplayer", "Indie"], "publishers": ["Luminous Forest Games"], "esrb_rating": null}