{"id": 967624, "slug": "harvest-island-2", "name": "Harvest Island", "name_original": "Harvest Island", "description": "Harvest Island is a story-driven, horror, farming simulator where you farm crops, collect tidepool critters, and catch fish for the gods. You can discover lots of hidden places like a cave behind a waterfall or befriending wild animals that hide in the forest or finding a randomly placed vending machine in a dark underground hidden room along the beach.<br/><br/><br/><br/><br/><ul><li>Gods play an important part in Harvest Island. Everyday, the gods will ask you for items that are around the island. You receive bless from the gods once you give the items to them. You use the bless to upgrade your farm or use bless to build and craft stuff.<br/><br/><br/><br/><br/></li><li>As time progresses, the forest, caves, and seashores change. When it becomes night, the caves glow, the forest sings and sparkles with fireflies, and the shore recedes creating a low tide. You can see the sunset and sunrise while the landscape changes. The day/night cycle is perpetual and you don't even have to sleep if you want to pull an all nighter or two.<br/><br/><br/><br/><br/></li><li>There are many wild animals on the island. You can befriend them, pet them, or even feed them. Sometimes they will give you items they find in the wild or show an undiscovered passage for you to explore.</li></ul><br/><h3>Features</h3><ul><li>Throughout the island, you'll collect items like coconuts, seaweed, horseshoe crabs, and other peculiar stuff: Nine-armed starfish, beetle, and a shark. You'll offer these common and strange items to the gods and in return, the gods will reward you by giving you bless. This bless helps you craft, upgrade your farm, and progress the story.<br/></li><li>There are tons of different types of fish that you can catch all over the island. Each fish has their own behavior and habitat. Depending on the conditions, fishing during the day or night, or far off into the corner of the island will catch you different types of fish as long as you use the correct bait during those times. You can then cook the fish and eat it to gain bless and stamina when you perform activities like farming.<br/></li><li>You can craft various tools from your workbench to help you further explore the island like a ladder, rope, and a fishing pole. These tools will help you further progress the story and will help you farm.<br/></li><li>When it rains, animals will hide, fish will hide, and crops will be watered. Sometimes you'll get a sprinkle, and other times it'll pour down hard. But when it's sunny, everything is back to normal.<br/></li><li>Tides fluctuate as time progresses, changing the island's landscape. You can pick up sea critters during low tide and offer them to the gods. And tides can open up new paths. It'll allow you to explore the island further.</li></ul>", "metacritic": null, "released": "2023-10-10", "tba": false, "updated": "2023-11-30T17:31:11", "background_image": "https://media.rawg.io/media/screenshots/3e1/3e16cc11188ece6c5b0d535f259c82a2.jpg", "website": "https://yobobgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Yobob"], "genres": ["Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["Yobob Games"], "esrb_rating": null}