{"id": 967625, "slug": "geist-2023", "name": "Geist (2023)", "name_original": "Geist (2023)", "description": "The Empire has enlisted your help in Geist Squad. Complete mission based on events of World War II in order to fulfill the will of the Empire. Each fight will be more brutal than the last. In this fictional World War II first-person shooter game. You the Player will have to fight through a wave of enemies, The Allied forces stand to oppose the Empire and all of its Glory! You will face heavily armed soldiers of the Allied army, all based on actual events that happened in World War II. You will face enemies with rifles, machine guns, and heavily armed vehicles. Defeat all the Empire's enemies in order to bring it Glory!<br/>\n<br/>\r\nFirst-person shooter based on events of World War II. Players can expect to find objective-based missions like search and destroy escort, and wave defense. This game also has a hoard game mode, where players can see how long they can last with an ever-growing enemy threat.  <br/>\n<br/>\r\nGenre: First Person Shooter<br/>\r\nPlayers: Single-Player<br/>\r\nAchievements: 13<br/>\r\nEstimated Playtime: 5-6 Hours<br/>\r\nSecrets: Now it wouldn't be a secret if I told you now would it ; )<br/>\n<br/>\r\n7 September, 1939<br/>\r\nDear recruit,<br/>\r\nYou are receiving this notice of draft into the Great War. The Empire has been gathering a team of elite soldiers to fight against the Allied Forces. You are ordered to report by 10 October 1939. <br/>\n<br/>\r\nGlory to the Empire!", "metacritic": null, "released": "2023-10-10", "tba": false, "updated": "2023-10-13T03:43:50", "background_image": "https://media.rawg.io/media/screenshots/ea3/ea32db65e0aa2a6a73321c077d29e513.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dark Cloud City"], "genres": ["Action", "Indie"], "publishers": ["Tyler Farley"], "esrb_rating": null}