{"id": 967666, "slug": "wtc-loves-labours-lost", "name": "WTC: Love's Labour's Lost", "name_original": "WTC: Love's Labour's Lost", "description": "WTC : Love's Labour's Lost is the third and last side-story in the \"Welcome To... Chichester\" visual novel series.  This episode concentrates on Grendel's past<br/><br/><br/><br/>The city of Chichester, England was once an unassuming and lawful place. located on the southern tip of England.  However, with the arrival of the megalomaniacal Grendel Jinx and her put-upon \"friend\", this soon changes as Grendel works her way into all aspects of local governance.<br/><br/>Not wanting to see another place fall under the control of Grendel, the protagonist devises a plan to take Grendel back to America but comes up against opposition on the form of Cindi Eglantine, the local tourist guide and Autumn Shaw, “The Violet Hotel” over-worked waitress/cleaner.<br/><br/>Together, they devise a counter-plan, although neither would realise the cost of stopping the protagonist.<br/><br/><br/><br/><ul><li> 74,000+ word visual novel, with around 6 - 8 hours gameplay for the main story and another 1 - 2 hours  for the extra side stories.<br/></li><li> Side stories and new route in main story are available once the game has been completed<br/></li><li> Multiple paths leading to four different endings.  It's even possible to break the time/space continuum <br/></li><li> Meet Grendel's love interests<br/></li><li> Many CG's to be discovered, mostly by Tarako309, but with some by Hadwinart</li></ul>", "metacritic": null, "released": "2023-10-11", "tba": false, "updated": "2023-10-13T04:40:12", "background_image": "https://media.rawg.io/media/screenshots/abc/abc33cf809f8c950e2e1c2540913a8c9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Triority Interactive Novels"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Triority Interactive Novels"], "esrb_rating": null}