{"id": 967667, "slug": "mercenaries-saga-will-of-the-white-lions", "name": "Mercenaries Saga -Will of the White Lions", "name_original": "Mercenaries Saga -Will of the White Lions", "description": "Mercenaries Saga 1 is a turn based tactical simulation RPG.<br/>It is the first of the series followed by many other solid simulation games: Mercenaries Blaze and Mercenaries Rebirth being the most recent addition to the series.<br/><br/><br/>[Game Characteristics]<br/>・Quarter view battlefield in dot-art – Command your characters and lead them to victory!<br/><br/>・Attacking from the side, back or higher ground deals more damage – Take advantage of the 3D terrain when building your strategy.<br/> <br/><br/><br/><br/>・Class change system using SP – As your characters level up they are able to choose Advanced and Expert level classes which allow new skill sets to be learned. Some items unlock Special classes. Create a balanced team to your liking!<br/><br/><br/><br/>・Learn new skills using SP – Take advantage of the various skills which can buff, debuff or cast status ailments upon enemies.<br/><br/><br/><br/><br/><br/><br/>・Multi-ending storyline – Your choices affect each character’s destiny.<br/><br/>・Ex stages – Extra challenging stages for the highly skilled player. <br/><br/><br/><br/>[Story]<br/>Fornea, the Green Continent is known for its vast expanses and warm climate.<br/>Stretching from the south to west is the Flare Kingdom, who has been conquering its neighboring countries in the recent years. <br/><br/>In the southern tip lies the Kingdom of Mondoa. Fearing the growing power of Flare, Mondoa invades Sekrak, a smaller country to its north in attempt to obtain more territory. <br/><br/>Mondoa is met with fierce resistance. As the war drags on, this situation brings great joy to mercenaries who fight for coin. Many large mercenary companies use the opportunity to line their pockets with gold.<br/><br/>However, things are different for those without an established name. <br/><br/>Our story differs in many ways, focusing on the young commander Leon and his troop of but six fresh-faced mercenaries: The White Lions…", "metacritic": null, "released": "2023-10-11", "tba": false, "updated": "2023-10-13T04:41:41", "background_image": "https://media.rawg.io/media/screenshots/0fb/0fb8a0a7b3dfa8c3a1463b1d4d338145.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 318, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ESQUADRA,inc.", "RideonJapan"], "genres": ["RPG", "Strategy"], "publishers": ["Flyhigh Works"], "esrb_rating": null}