{"id": 967705, "slug": "tcg-hyper-card-collect", "name": "TCG Hyper Card Collect", "name_original": "TCG Hyper Card Collect", "description": "Collect TCG monster cards in this card collection game! Livestream your card pack opening and earn money from fans!<br/><br/>Open booster packs and collect all TCG Hyper Monster cards! Open card packs to get rare Hyper Monster cards and complete your card collecting album, live stream your card opening and earn money. Earn money and unlock higher level Hyper Monster cards. Upgrade your TCG collecting skill as card trader, collect all TCG cards!<br/><br/><br/><br/>HOW TO PLAY: Open card packs and collect cards of Hyper Monster cards, earn money from live stream fans donation. Trade cards to increase your monster card value and to complete your card collection.<br/><br/><br/>=== FEATURES OF TCG HYPER MONSTER CARD COLLECT GAME: ===<br/><br/>-Livestream card pack opening and earn money.<br/>-Complete card collection by opening card pack and trading.  <br/>-Over 1000+ cards to collect and trade.<br/>-Unlock rare cards by opening high level card packs. <br/>-Idle gameplay for card collectors.<br/><br/>Play TCG Hyper Monster Card Collect and become the ultimate card collector.<br/><br/>Are you ready to be a card collector and Hyper Monster cards trader? Don’t wait any longer. Download TCG Hyper Monster Card Collect today!<br/><br/>Internet connection required to play this game.", "metacritic": null, "released": "2023-01-04", "tba": false, "updated": "2023-10-13T05:28:55", "background_image": "https://media.rawg.io/media/screenshots/41e/41e466f9fed9af417c77468c4e88c9dd_KcslmJe.jpg", "website": "https://opneon.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["OPNeon Games Sdn Bhd"], "genres": ["Simulation", "Card"], "publishers": ["OPNeon Games Sdn Bhd"], "esrb_rating": "Everyone 10+"}