{"id": 967758, "slug": "squadblast", "name": "SquadBlast", "name_original": "SquadBlast", "description": "The year is 2042 and the state of the planet has been in decline: bankrupt governments and ruthless dictators are plentiful, while selfish corporations rule the world. Injustice against the powerless population is rampant. But there is hope. Armed gangs organized by a shadowy organization are intent on battling the oppressive evil.<br/><br/>SquadBlast is a free-to-play multiplayer run and gun shooter. Its team-based battles are an innovative take on a shooter that you have to experience — meticulously balanced for fairness and incredibly easy to pick up and play. In SquadBlast, every bullet matters. You'll need to adapt diverse lines of attack to claim victory in a variety of modes. Play cross-platform with your friends for free on Xbox Series S|X, Xbox One, PS4, PS5, Nintendo Switch, iOS, Android, web, cloud and PC with full controller support.<br/><br/><strong>DEEP CLASS-BASED COMBAT</strong><br/>Choose from a roster of heroes, each with their own abilities, to turn the tide of battle in your team’s favor. You’re sure to find a favorite, but you’ll have to master them all – and even swap heroes mid-battle – to shut down your opponents’ dreams of victory!<br/><br/><strong>AN FPS IN DISGUISE</strong><br/>Bring all your skills from your favorite FPS. Swap to your secondary after unloading with your main. Equip your melee weapon to run unburdened. Rocketjump for a greater vertical leap. Slide down ramps, bunny hop, vault over projectiles and more.<br/><br/><br/><br/><strong>MEATY MULTIPLAYER</strong><br/>Jump into battle to master each essential multiplayer mode, from TDM to Capture the Point to Payload. Better yet, pick a custom match to choose the map, mode, and rules that suit you best. Always expect a smooth experience since all the action is synced with perfect rollback netcode. Lead your squad to striking locations across the troubled world of 2042.<br/><br/><strong>GUNS GALORE</strong><br/>One thing's for sure – there are tons of guns in SquadBlast, from assault rifles to rocket launchers to experimental supa weapons. Get your hands on each one and get a feel for the play style that maximizes its effectiveness.<br/><br/><strong>SUPER COMFY CONTROLS</strong><br/>Pick up and play! All the controls are right where you'd expect them to be whether you're playing with a controller or mouse and keyboard.", "metacritic": null, "released": "2023-10-15", "tba": false, "updated": "2023-10-16T02:29:35", "background_image": "https://media.rawg.io/media/screenshots/5c2/5c266dc5746fe1432839dc4913660326.jpg", "website": "https://www.squadblast.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ULTRAHORSE"], "genres": ["Action", "Massively Multiplayer"], "publishers": ["ULTRAHORSE"], "esrb_rating": null}