{"id": 967766, "slug": "overdevil-legend-of-the-sacred-stone", "name": "OVER‧DeviL: Legend of the sacred stone", "name_original": "OVER‧DeviL: Legend of the sacred stone", "description": "Long, long ago, the terrible Over Devil was defeated by the eight Chosen Ones, each wielding one of eight Sacred Artifacts. This brought nearly a century of peace to the land.<br />\nOne day, the eight Sacred Artifacts, which were supposed to have disappeared along with the Over Devil, reappear as Sacred Stones—an omen of the Over Devil&#39;s imminent return!<br />\nFar from the empire, in a port village located on the border, Lola recovers her mother&#39;s gemstone from thieving pirates only to realize that it is one of the eight Sacred Stones. Why was her mother in possession of this legendary stone? With some encouragement from a new friend, Lillane, she sets out on an adventure to collect the rest of the stones and hopefully find out about her missing mother.<br />\nWill they collect the Sacred Stones, defeat the Over Devil, and save the world? Or will they use their new-found power to destroy it, instead? That&#39;s up to you, as you venture forth in this naughty story of adventure and hardcore fun.<br />\nThe cast also features:<br />\nThe Adventurer&#39;s Guild<br />\nThe Imperial Army<br />\nThe Demon Army<br />\nAnd many more unique characters that you&#39;ll love... or hate.<br />\nDive deep into the lore in this epic, masterfully-crafted JRPG<br />\nInteract with more than 60 lovingly-crafted characters. Besides common NPCs, all characters have their own unique portrait.<br />\nOutskill the enemy in turn-based battles, where energy points are used to enhance your character. Build a balanced party to harness the unique skills and battle styles of each main character.<br />\nListen! The main storyline is supplemented with voice acting for battles, and a variety of other titillating sounds are voice acted as well.<br />\nPeruse 190 sets of basic CGs, with no repeated CGs or storylines and tons of porn content... Whatever you&#39;re into, we&#39;ve got it!<br />\nWatch unique storylines after winning or losing boss battles and live with the wonderful/terrible consequences!<br />\nEnjoy the plethora of animated H-scenes!<br />\nThe story has two different endings, and thus unfolds in two very different ways. Based on the player&#39;s choices, each main character can evolve into various final versions of themselves.</p>", "metacritic": null, "released": "2023-10-12", "tba": false, "updated": "2023-12-26T19:04:51", "background_image": "https://media.rawg.io/media/screenshots/1d1/1d1e23974234f85de57bd7a66fe4eb5c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["大肘子"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Mango Party"], "esrb_rating": null}