{"id": 967765, "slug": "tan-ke-xi-shou-2", "name": "坦克猎手2", "name_original": "坦克猎手2", "description": "Dear new friends, old friends, big friends and children:<br/>\n<br/>\r\nThis is a simple game of tank play. The main driver of the game is to get points to experience different tanks. There are 16 different tanks, and hopefully one you will like.<br/>\n<br/>\r\nIn the game, you can use additional armor features to provide a certain amount of additional protection for the weak parts of the tank.<br/>\r\nIn defense mode, you can use a train box obstacle to provide some cover for yourself.<br/>\r\nIn endless mode, only one tank can be used in, but as a bonus, the tank's loading time can be reduced to one second, giving you a unique high-speed combat experience.<br/>\n<br/>\r\nI have to mention some things is that, due to my limited ability, can to add any sound music to the game, this players please be careful to buy. Due to the production difficulties caused by the old computer graphics card, some special effects that should be added to the game are temporarily blank, and I will make up as much as possible in the future.<br/>\n<br/>\r\nFinally, if you are willing to try the game but hesitate, please download a brief demo version, experience the operation and game style, and then consider. <br/>\n<br/>\r\nIf you have some good ideas to share, please be sure to contact me. QQ group number: 496979202<br/>\r\nFinally, I wish you a happy, solo dance Ming Zhong respect on.", "metacritic": null, "released": "2023-10-13", "tba": false, "updated": "2023-10-16T02:37:21", "background_image": "https://media.rawg.io/media/screenshots/f7a/f7a294e292416d580373e886b04f3054.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["独舞明中"], "genres": ["Action", "Indie"], "publishers": ["独舞明中"], "esrb_rating": null}