{"id": 967799, "slug": "possessions-3", "name": "Possessions", "name_original": "Possessions", "description": "In this online asymmetric ambush thriller, one player controls a Burglar trapped in a house by a Kitsune and forced to do random tasks while 2-7 other players play as invisible Ghosts with the ability to possess household objects and use them to ambush the Burglar, take control of the body, and attempt to accomplish their own tasks. The first one to finish their tasks and escape the house with the body wins the round!<br/>\n<br/>\r\nForm lobbies and play online with your friends or join public lobbies with strangers.<br/>\n<br/>\r\nPlay as the Burglar:<br/>\r\n-Explore the house to find the objects on your list and make it to an exit while avoiding ambushes<br/>\r\n-Pay attention to subtle visible and audible clues to tell if a ghost possessed a nearby object<br/>\r\n-Use the dodge mechanic to quickly roll out of the way of an ambush<br/>\r\n-Use the night vision mechanic to walk around in the dark or turn the lights on and let your eyes adjust<br/>\n<br/>\r\nPlay as the Ghosts:<br/>\r\n-Customize the look of your ghost with several Colors, Eyes, and Flair to choose from<br/>\r\n-Possess objects and time your ambush to hit the Burglar and take control of the body<br/>\r\n-Use decoys while possessing objects to taunt and goad the Burglar<br/>\r\n-Watch the tasks that the Burglar completes and undo them later after taking control<br/>\r\n-Turn lights on near the Burglar to cause a flashbang effect and discharge his night vision<br/>\r\n-Turn lights off near the Burglar to plunge him into darkness until his night vision charges<br/>\r\n-Utilize the Ghost's glow to easily see in the dark<br/>\r\n-Scout out the house to learn the location of the shuffled rooms before becoming the Burglar", "metacritic": null, "released": "2023-10-13", "tba": false, "updated": "2023-10-16T03:23:38", "background_image": "https://media.rawg.io/media/screenshots/ad7/ad79616cb9d90e7133bb6c7a64a53b23.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Black Knight Digital"], "genres": ["Action"], "publishers": ["Black Knight Digital"], "esrb_rating": null}