{"id": 967777, "slug": "defense-cards", "name": "Defense Cards", "name_original": "Defense Cards", "description": "Defense Cards is a small, replayable arcade score game. The goal of the game is to continuously improve your survival time in the previous game, and to unlock and build your own new hand of cards through gold coins collected in battles.<br/>If you encounter any problems during the game or have any ideas, you can send me an email and I will reply and fix it as soon as possible.<br/>(I'm glad if you like this game)<br/><strong>Gameplay</strong><br/><ul><li>In the game, enemies will come to you one after another, so you need to keep dragging cards to release barrages and skills.<br/></li><li>You can’t keep shooting because the cards will consume your usage points. In order to consume the card points more rationally, you need a certain card usage strategy.<br/></li><li>In the game, you can continuously obtain new skill cards through upgrading. These powerful cards will help you better eliminate monsters.<br/></li><li>After each game, you can unlock cards in the store. These unlocked cards will appear in your hand in advance, which can make you stronger every game</li></ul><strong>Game features</strong><br/><ul><li>Easy-to-learn card usage strategies<br/></li><li>A variety of card skills to help you survive better in the game<br/></li><li>Continuously upgraded cards provide strong support for clearing monsters.<br/></li><li> Gold coins can be obtained immediately when clearing monsters, allowing your abilities to continue to grow.<br/></li><li>Steam achievements<br/></li><li>Steam cloud<br/></li><li>Provides different combat experiences</li></ul>", "metacritic": null, "released": "2023-10-15", "tba": false, "updated": "2023-10-16T02:51:46", "background_image": "https://media.rawg.io/media/screenshots/4b2/4b2063b661a2352e03fa180d2212c58d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["zhangtianfeng", "Morningstar Studios"], "genres": ["Casual", "Indie"], "publishers": ["Morningstar Studios"], "esrb_rating": null}