{"id": 967806, "slug": "sclera-2", "name": "Sclera", "name_original": "Sclera", "description": "Sclera is a no-save, session-based game of random encounters for fans of older RPGs and interactive horror fiction. While there are scripted events and custom written stories, much of the content is the result of traditional procedural generation techniques; no two runs will ever be the same.<br/><br/><strong>The Story:</strong><br/><br/>An unseen cosmic entity has been changing the planet's inhabitants over time. While some have gained immunity to its hunt, or joined one of the many cults dedicated to its cause, most are repeatedly marked, stalked and preyed upon until their eventual thralldom -- often first driven to madness by the knowledge of their impending doom. You are the latest Followed One seeking release from this cycle as the cursed population continues to decline and fragment into factions. What will happen upon your inevitable meeting with the Shadow?<br/><br/><strong>Features:</strong><br/><br/><ul><li>High replayability with session gameplay in mind: expect one character's run to take between 30 and 60 minutes.<br/></li><li>Multiple endings, with matching achievements, showcasing the various successful and failed states.<br/></li><li>Gameplay and aesthetics influenced by D&amp;D, interactive fiction, turn-based survival horror classics (Laplace no Ma, Sweet Home), modern roguelikes (NEO Scavenger, Darkest Dungeon, FTL), and 90’s RPGs (Fallout, Darklands, Final Fantasy, Earthbound).<br/></li><li>Challenging and strategic turn-based combat.<br/></li><li>Text-based exploration: both procedurally-generated and custom-written interactive fiction (choice-based, non-parser, puzzle-free text adventures/narratives).<br/></li><li>Procedurally-generated enemies and towns.<br/></li><li>No meta-progression, as in the vein of traditional roguelikes, where player skill and decision making will determine your outcome.<br/></li><li>A world setting that uses themes of Lovecraftian/cosmic horror, science fiction, apocalyptic and post-apocalyptic urban fantasy.<br/></li><li>An original soundtrack inspired by The Thing and Silent Hill 2, along with ~80 different SFX.</li></ul>", "metacritic": null, "released": "2023-10-13", "tba": false, "updated": "2023-10-16T03:38:10", "background_image": "https://media.rawg.io/media/screenshots/c1b/c1bf93a766c6896d92b43f9dc47a439b.jpg", "website": "https://www.sequester.ca/p/games.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ryan Boc"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Ryan Boc"], "esrb_rating": null}