{"id": 967820, "slug": "primal-threat-2", "name": "Primal Threat", "name_original": "Primal Threat", "description": "\r\nHello, my name is Jordan and created Primal Threat in my spare time.  I work at a grocery store, and I’m one of the managers, so I try to dedicate an hour or two each evening on my dream game.  When my son Dean was born in July of 2020, my wife and I decided to decorate his room with a dinosaur theme and my imagination went wild with ideas for my next game.  Dean and my niece Ellie are the two main characters in this adventure.  I developed Primal Threat on my own, but my cousin Kristian created all the music.<br/>\n<br/>\r\nMy first game was Muzzleloaded.  I believe it was a great learning project, but there were certain features that I couldn't create, which I was eventually able to implement in Primal Threat such as: A revealing map, multiple weapons to equip, local co-op, and multiple upgrades such as transforming into a tiny dinosaur!<br/>\n<br/>\r\nPrimal Threat is a short, but true Metroidvania where upgrades are necessary for overcoming bosses, enemies, and obstacles.  The enemy designs are inspired by Sonic the Hedgehog enemies.  The level design is highly inspired by Metroid and the shooting/weapon change mechanic by Axiom Verge.  <br/>\n<br/>\r\nThe co-op mode is a throwback to Sonic the Hedgehog 2 where Tails gets to join Sonic on their epic adventure.  It does make the game easier having a friend to help, but through playtesting it so far, it is a blast! <br/>\n<br/>\r\nPrimal Threat's hook is doing tremendous damage to enemies by shooting them with a weapon of complimentary color.  There are 6 weapons for players to find throughout the world, each having a different color based on which zone it is found.  Players who can correctly change weapons on the fly will be able to eliminate enemies quickly.  <br/>\n<br/>\r\nThank you so much for your interest in my game!<br/>\n<br/>\r\nSincerely,<br/>\r\nJordan Keith", "metacritic": null, "released": "2023-10-13", "tba": false, "updated": "2023-10-16T03:55:04", "background_image": "https://media.rawg.io/media/screenshots/447/447bfa110cfa5b627034ce0a94d09204.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jordan Keith"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Jordan Keith"], "esrb_rating": null}