{"id": 967953, "slug": "death-ration-back-to-19xx", "name": "DEATH RATION: BACK TO 19XX", "name_original": "DEATH RATION: BACK TO 19XX", "description": "In Death Ration, you create your own story - There's no wrong way to play.<br/>You can confront the aliens to save the world, uncover the truth behind the long-term spread of nanomachines and invasion, dedicate your remaining time to work for the community of refugees, transport supplies to camps using trucks, use all the found resources for yourself, decorate your own house with furniture and decorations, engage in wars with all factions, the choice is yours. However, the biggest challenge lies in how to extend your remaining time.<br/><br/><br/><strong>Death Ration: Back To 19XX</strong> offers a combination of survival elements, time-limited mechanics, community interaction, and the exploration of a world invaded by mysterious nanomachines.<h3>Life:</h3>Players embark on an adventure in war-torn areas where alien surveillance is limited. Abandoned buildings, once untouched by anyone, now harbor giant mutated insects resulting from genetic manipulation by nanomachines, as well as resilient mutants who cannot die. However, there is a high chance of finding valuable resources left behind. Players can choose to use acquired resources for themselves or donate them to the community.<h3>Community:</h3>Building relationships with other community members is essential and can be achieved by helping them. Completing their requests unlocks new actions that allow you to progress through the story along different paths. Community camps also allow players to purchase supplies, equip, and acquire decorations and furniture. As the quest progresses, connections between the various communities expand, leading to the exchange of resources between camps. Players are tasked with safely delivering supplies and creating connections between camps.<h3>Limited Life Time Mechanics:</h3>The body controlled by nanomachines measures the level of resistance against the aliens, setting a lifespan for those with strong defiance. The main character, due to their parents' involvement in the war between aliens and humanity, has had a lifespan timer set since childhood. This remaining time, called EMIT, can be collected from unwillingly deceased individuals or their bodies through the nanomachines before time runs out.<h3>Exploring the Mystery Of World Invasion:</h3>Delve into the mysteries surrounding a global invasion with nanomachines and alien manipulation of individual life spans. Why did aliens come to this world? Why did they invade us and seek to rule us for so long?", "metacritic": null, "released": "2023-10-17", "tba": false, "updated": "2023-10-20T04:11:34", "background_image": "https://media.rawg.io/media/screenshots/cfb/cfbbbd68b6346cb5be9b6717d3d0fc4f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 263, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Masatoshi Matsu", "Studio Mastashion"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Studio Mastashion", "CometaBoot Games"], "esrb_rating": null}