{"id": 967942, "slug": "traitorous-trek", "name": "Traitorous Trek", "name_original": "Traitorous Trek", "description": "As a party game, we recommend playing with friends at a LAN party or online via voice chat.<br/>The game requires one player to host, and supports 4 to 12 people playing at the same time.<h3>The Astronaut</h3>Objective: Complete all missions or discover all traitors!<br/><br/>If all traitors are expelled, or if all missions are completed, the astronaut wins!<br/><br/><ul><li>Astronauts need to complete a series of tasks on the spacecraft, including repairing equipment, cleaning the room, navigation control and so on.<br/></li><li>Missions help astronauts earn victory points, but also let others know what they're up to, making it easier to deduce the traitor's identity.<br/></li><li>Astronauts need to respond quickly to neutralize the traitor's sabotage.<br/></li><li>The ghost after the death of the astronaut can still continue to carry out the task assigned to him, and strive for victory for the astronaut camp.</li></ul><h3>The Traitor</h3>Objective: Eliminate the crew or destroy the spaceship!<br/><br/>If the number of traitors is greater than or equal to the number of astronauts, the traitors win!<br/><br/><ul><li>Traitors need to sabotage the ship undercover, killing the crew and framing bystanders, causing confusion and suspicion. <br/></li><li>Traitors can pretend to perform missions to hide their identities, but they also need to avoid being discovered by others.</li></ul><h3>Emergency Meeting</h3><br/><ul><li>When the player walks near the corpse or the emergency meeting button, they can press the report button to call the entire astronauts for an emergency meeting.<br/></li><li>At this time, the player can tell who he suspects to be a traitor and what information he has. Traitors must try to prove their innocence, or accuse the other crew.<br/></li><li>A vote can be held in the meeting, and the result of the vote will determine whether to expel a player. The ejected player will be immediately thrown out of the airlock.</li></ul>", "metacritic": null, "released": "2023-10-16", "tba": false, "updated": "2023-10-20T03:54:09", "background_image": "https://media.rawg.io/media/screenshots/4fa/4fa6e0677afd6d0b4fcfdc203def4c20.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["ZhangWei"], "genres": ["Casual", "Indie"], "publishers": ["Tatame"], "esrb_rating": null}