{"id": 967910, "slug": "nine-realms-revolt", "name": "Nine Realms: Revolt", "name_original": "Nine Realms: Revolt", "description": "Save the Nine Realms in this Deckbuilding Adventure.<br/><br/>Ragnarok has occurred and destroyed the old gods. As the survivors struggle to rebuild, Revna the fire giant has seized control of Asgard. Embark on an adventure to unite the realms and put a stop to his reign in this unique deckbuilding oddyssey.<br/><br/>Make alliances, grow powerful, and discover what lies within each battle. <br/><br/><br/><strong>Campaign:</strong> <br/>You play as Fjolnir, a young light elf living on the remains of Alfheim. After his village is burned down by Revna the fire giant, you embark on a journey to put a stop to Revna, but traveling to the different realms and recruiting allies to aid you in your quest. Fight through the hellscape of musphelheim, Wander the forests of Vanaheim, Explore the now flooded midgard aboard a runeship, Escape from the crumbling Hellheim, and topple Revna off his new found throne in Asgard. <br/><br/>The campaign features: <br/>- 50 scenarios, each with their own story, dialogue and unique enemy and deck to fight. <br/>- 135+ cards to unlock, with each faction being recruited as you journey through their realm.<br/>- Create and save your own decks to use at any point, enabling you to adjust your strategy for each opponent you face. <br/><br/><br/><strong>Gameplay:</strong><br/>A blend of old school card games like mtg and dice mechanics gives Nine Realms Revolt a unique spin on the deckbuilding genre. Craft a deck of at least 40 cards by using 3 of the 5 factions. Gameplay is divided over 3 lanes, each with their own units, banners, traps and die. To win, you must destroy your opponents 3 banners while protecting your own. You must choose when to commit your units to an attack, while also making sure you can defend your own banners. <br/>Nine Realm Revolt Features: <br/>5 different Factions, each with their own spells, units and legendary cards. Combine up to 3 different factions to make your Deck<br/>3 lanes each with a banner. Guard your Banners, and destroy the Enemy's Banners to win.<br/>Play units to defend your banners. Units can attack any lane, but can only defend their lane. Units can only defend if they haven't attacked that round. <br/>Use traps to play cards facedown in lanes. Predict the enemies actions, and you can thwart their attempts and set up a devastating next turn.<br/>Play Spells to immediately swing the battle to your favour.<br/>Unleash game ending legendaries, whose powers will make you think of how to build your deck around them.<br/><br/><br/><strong>Draft Mode:</strong><br/>In this game mode, you will draft a deck of 40 cards by choosing 1 of 3 cards. After you have your deck, Embark on a journey to win 6 battles in a row. Losing at any point will end your run.", "metacritic": null, "released": "2023-10-16", "tba": false, "updated": "2023-10-20T03:12:45", "background_image": "https://media.rawg.io/media/screenshots/8f0/8f06c95e384d1926071bc354b540d4e0.jpg", "website": "https://www.oneupplustrust.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 389, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["One Up Plus"], "genres": ["Strategy", "Indie"], "publishers": ["Roguedolike", "SapStaR Games"], "esrb_rating": null}