{"id": 967958, "slug": "jing-dian-sao-lei", "name": "经典扫雷", "name_original": "经典扫雷", "description": "This is a classic computer single player casual game.<br/>\n<br/>\r\nThe goal of the game is to find all non thunder squares in the shortest possible time based on the numbers that appear when clicking on the squares with the mouse, and avoid stepping on thunder at the same time.<br/>\n<br/>\r\nLeft click on the grid: If it is not a mine and a number appears on the grid, it indicates the number of mines in adjacent grids around it; If the lattice is empty (equivalent to 0), it is possible to recursively open the lattice adjacent to the empty; If unfortunately lightning strikes, the game ends.<br/>\n<br/>\r\nRight click on the grid: marked as a mine (displayed as a small red flag), click again marked as suspected (displayed as??), and click again to unmark. If disable suspected tags is checked in the game menu, two operations can cancel the tags.<br/>\n<br/>\r\nLeft click on the number: The operation is effective when the number of marked mines in adjacent cells is equal to the number in that position, which is equivalent to one left click on all unopened blocks around that number. Clicking is invalid when the mine is not fully marked. If there are mislabeled landmines around the numbers, the game ends.<br/>\n<br/>\r\nOctober 17, 2023<br/>\n<br/>\r\nOfficial version<br/>\n<br/>\r\nMay 5th, 2020<br/>\n<br/>\r\nAdded a hexagonal plate on top of the original square plate<br/>\n<br/>\n<br/>\r\nOctober 1, 2023<br/>\n<br/>\r\nOfficially launched, adding traditional modes, hexagonal variants, and octagonal plates", "metacritic": null, "released": "2023-10-17", "tba": false, "updated": "2023-10-20T04:16:57", "background_image": "https://media.rawg.io/media/screenshots/cef/cefedee53fc833ace38cccaafdabc95a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["koyomogi"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["koyomogi"], "esrb_rating": null}