{"id": 96796, "slug": "the-silent-age-itch", "name": "The Silent Age (itch)", "name_original": "The Silent Age (itch)", "description": "<p>Lose yourself in The Silent Age, the thrilling point-and-click adventure with over seven million mobile downloads, completely revamped and updated for PC.</p><p>Help Joe as he travels between the groovy present of 1972 and the apocalyptic future of 2012 to discover the truth behind humankind's extinction—a quest entrusted to him by a dying man from the future. Use your portable time travel device to solve puzzles that bring you closer to answers and saving humanity.</p><p>Winner of the 2013 Casual Connect Indie Prize and applauded for its deep story, clever puzzles, and radically simple navigation and art style, The Silent Age is an unforgettable experience. Can you, a simple janitor and literally, \"the average Joe,\" save humankind?</p><p>Key Features</p><ul><li>Thrilling adventure with a deep story that captivates from beginning to end. </li><li>Complex characters, each with their own personality and agenda. </li><li>Clever puzzles requiring time travel and specific items to solve. </li><li>A seamless interface which makes you feel like you're actually there. </li><li>10 chapters with unique locations, characters and puzzles.</li><li>Character voiceover brings the story and characters to life. </li><li>The same bold, stylish and minimalistic artwork now presented in stunning Ultra HD. </li><li>Over 20 achievements and Steam Cloud support.</li></ul>", "metacritic": null, "released": "2016-06-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/57e/57ef62dcecb1fd965d971959de4fef8e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Meridian4"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}