{"id": 967928, "slug": "dimenders", "name": "Dimenders", "name_original": "Dimenders", "description": "Contact: remillepattesstudio@gmail.com<h3>Description</h3><br/><strong>Dimenders</strong> is an online horror game playable in cooperative mode up to 4 players. You play as a team, recruited to investigate on the emergence of portals linked to other dimensions. Your job is to solve different puzzles in order to find a way to close all the portails. In fact their emergence allowed wicked entities to flood our world. Be aware, they will try to stop you, at all cost ! Pace all the levels at the risk of your own life ! Will you manage to close all portals, avoid the entities and resolve all riddles ? <br/><br/><h3>Features</h3><br/>Here are some features that you will find in the game :<br/><ul><li> <strong>Inventory </strong>: Stock in your inventory useful items in order to progress and help yourself during your missions.<br/></li><li> <strong>Stamina </strong>: Keep an eye on your stamina to avoid being out of breath.<br/></li><li> <strong>Respawning </strong>: Use crystals to come back to life, share them with your friends to help each other.<br/></li><li> <strong>Travel </strong>: Travel through dimensions keeping all your items with you.<br/></li><li> <strong>Proximity chat</strong> : Chat in-game with your friends.</li></ul><br/><h3>Entities</h3><br/>In the dimensions that you explore, You will find multiples entities. <br/>They act differently in order to neutralize you. Don't get caught !<br/><br/><h3>Content</h3><br/><strong>Dimenders</strong> is currently composed of 4 levels including one optionnal level. <br/>Each one of them will set you in a different atmosphere. You might move to a completely different environnement or land in totally unknown grounds. <br/>There are two different endings.<br/><br/><h3>Puzzles</h3><br/>Plenty of puzzles are set in the game. They show off multiple and original game play mechanics.<br/>The levels will adjust to the number of players, and the puzzles will change from game to game!<h3>Roadmap</h3><br/>New levels, puzzles and dangers will be added incrementally.<br/>Existing game mechanics might be reworked.", "metacritic": null, "released": "2023-10-16", "tba": false, "updated": "2023-10-20T03:37:25", "background_image": "https://media.rawg.io/media/screenshots/3b7/3b72ced98bb6961d5bfafea25bc3cda9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Remillepattes"], "genres": ["Adventure", "Indie"], "publishers": ["Remillepattes, Remillepattes Studio"], "esrb_rating": null}