{"id": 967905, "slug": "everbee", "name": "Everbee", "name_original": "Everbee", "description": "Bees pollinate the most flowers among pollinators. However, bee populations have been declining in recent years due to the accumulation of multiple factors: pests, agrochemicals, and habitat loss. Everbee aims to draw awareness to this issue by letting people raise their own virtual bee hive!<br/><br/><ul> <li><strong>Collect Resources Flower:</strong> Nectar and pollen can be collected from flowers by clicking on them. The bees will also automatically collect resources for you.<br/> </li><li><strong>Convert Resources:</strong> The collected nectar and pollen can be converted into the likes of honey and wax in the top left converting panel.<br/> </li><li><strong>Build New Cells:</strong> New cells can be added to the beehive using wax.<br/> </li><li><strong>Functional Cells:</strong> Functional cells can automate your work. Once built, the bees will fill functional cells with the needed materials to convert into other resources automatically, for example. Hatcheries can provide the queen bee with space for her eggs.<br/> </li><li><strong>Grow the Colony:</strong> New worker bees can hatch if the queen bee is fed and if there is a hatchery available. New workers can boost the hive.<br/> </li><li><strong>Collect New Flowers:</strong> If you give it nectar, the hummingbird will fetch new seeds for you. These can be used to grow new flowers that have different nectar and pollen producing capabilities.</li></ul>", "metacritic": null, "released": "2023-10-16", "tba": false, "updated": "2023-10-20T03:06:29", "background_image": "https://media.rawg.io/media/screenshots/4de/4de1e3da5049f0e156bc95ee5f80b698.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ritta Choi"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Ritta Choi"], "esrb_rating": null}