{"id": 967989, "slug": "rise-of-gun-2", "name": "Rise of Gun", "name_original": "Rise of Gun", "description": "<h3>Rise of Gun</h3>  A simulator of a weapons store in a world overrun by zombies after a global epidemic. The entire world is enveloped in darkness, but humans have not given up and are fighting to the end. After losing his family, the main character sets out in search of survivors in despair. The journey was difficult, but he was able to find a wonderful settlement with few people but all of them determined to rebuild the world. As the only master who can create weapons, the main character is very valuable in this town. The mayor of the town has allocated a shop with a workshop so that we can create and sell the weapons that we make.<h3>Features</h3><h3>Weapon Crafting</h3>You will be able to create weapons without any restrictions, even from incompatible parts. Unleash your imagination and create the most creative weapons.<br/>The weapon crafting system is as convenient and enjoyable as possible, so you can enjoy the result rather than get tired of the countless actions.<br/><br/><h3>Many components</h3>There are over 200 different weapon parts that allow players to create over a million different weapon combinations. The parts are divided into several types and differ in rarity. The main part to which all subsequent parts are attached includes the barrel, scope, stock, grip, magazine, silencer, and bayonet. With these parts, players can create an incredibly unique weapon.<br/><br/><h3>Weapon Sales</h3>In the store, players can display and sell their weapons. There are many different shelves for displaying weapons. Once a resident of the town finds a suitable weapon, they will buy it.<br/><br/><h3>Shop Upgrades</h3>Players can upgrade their shop with various buildings, from decorative elements to workbenches and generators. Each building adds something new to the gameplay, such as attracting more customers, making the store more cozy, opening up more space for selling weapons, speeding up the creation of weapons, adding new functions, such as disassembling parts for materials, and more.<br/><br/><h3>Atmosphere</h3>This small town is very cozy. The mayor of the town makes an effort to ensure the safety of all residents and create a pleasant atmosphere. You will also experience day and night cycles, weather changes, and cheerful residents.", "metacritic": null, "released": "2023-10-17", "tba": false, "updated": "2023-10-20T04:58:41", "background_image": "https://media.rawg.io/media/screenshots/07a/07a604a2eed2845cb06a2106425e0a2c.jpg", "website": "https://www.reddit.com/user/PimpGameStudio", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PimpGameStudio"], "genres": ["Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["PimpGameStudio"], "esrb_rating": null}