{"id": 967964, "slug": "falling-down-xr", "name": "Falling Down XR", "name_original": "Falling Down XR", "description": "Welcome to the world of<strong> Falling Down XR</strong> - an exciting collection of games from various genres designed for virtual reality.<br/><br/><strong>Platformer</strong>: In this game, your goal is to jump from one flying platform to another and descend to the bottom as quickly as possible. Press the game stop button at the right moment to record your time and become the most agile player. At first glance, it may seem easy and even a bit dull, but remember that you are in virtual reality, where all your hidden fears of height and speed come to life. Experience the true pleasure of platforms rushing past you, the wind whistling in your ears, and the enchanting beauty of the world from a bird's-eye view.<br/>For this type of game, we've prepared three different worlds for you:<br/><br/><ul><li><strong>Cubic City</strong> and its destructive tornado.<br/><br/><br/></li><li><strong>Data Center,</strong> a digital realm inspired by the magnificent Matrix.<br/><br/><br/></li><li><strong>Space Adventure</strong>: Defend your ship from pirate attacks.</li></ul><br/><br/>Second Game, <strong>Vertical Maze</strong>: A meditative adventure where your task is to navigate a vertical maze. <br/><br/><br/>Here, you will also experience the fear of heights and the semi-darkness. An evil sorcerer has trapped you at the top of a tower and is draining your life drop by drop. Navigate the maze without falling to freedom! Each new launch generates a unique labyrinth, so you won't get bored.<br/>Third Game, <strong>First-Person Shooter</strong>: In search of adventure, you find yourself in an ancient, abandoned cathedral. <br/><br/><br/>It turns out the cathedral isn't as empty as it seems; it's inhabited by ghostly monks whose spells unleash terrifying magical attacks. Fortunately, you have a gun with unlimited ammunition! Before facing this challenging battle, it's a good idea to undergo the training of a real special forces fighter. For this purpose, we've prepared a training level with obstacle courses, shooting ranges, and moving targets that shoot back. <br/><br/><br/>Your enemies have received training from the best instructors and can shoot with precision. Don't move in a straight line; zigzag like a hare.", "metacritic": null, "released": "2023-10-17", "tba": false, "updated": "2023-10-20T04:26:53", "background_image": "https://media.rawg.io/media/screenshots/cad/cad5109b4c4c8a05fd633d1fabb97b5d.jpg", "website": "https://www.evilradish.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EvilRadish"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["EvilRadish"], "esrb_rating": null}