{"id": 967914, "slug": "leave-panda-away", "name": "Leave Panda Away", "name_original": "Leave Panda Away", "description": "Welcome to join the QQ discussion group, we will follow every game related information.<br/><br/>Fan QQ group: 645822693<br/><br/><br/>Also welcome to follow the Bilibili account and stay updated on the latest development progress.<br/><br/>Bilibili account:猫着游戏工作室<br/><br/><br/><strong><h3>Game Background</h3></strong><br/>In China, there is a peaceful and beautiful country inhabited by pandas of various races. They are usually gentle and friendly, but when faced with threats, they will demonstrate strong combat effectiveness. These races all have their own unique characteristics and skills: the \"bamboo forest tribe\" pandas, who live in dense bamboo forests. They are famous for their expertise in using bamboo to make tools and weapons, and their skills are very exquisite. The \"Ice and Snow Clan\" panda has a unique white fur and can survive in extremely cold environments. It is skilled in ice and snow magic and can summon the power of ice and snow elements. There are also \"Flame Clan\" pandas, who live in tropical areas near volcanic craters. Their fur appears bright red, and the pandas of the Flame Clan possess powerful flame abilities that can be used to attack enemies. There are also more races such as the \"Wisdom Clan\" and \"Diablo Clan\" appearing one after another...<br/><br/>This country is facing a huge crisis, with evil forces threatening its peace and security. In order to protect their homeland, pandas of various ethnic groups have decided to unite and fight against evil forces together.<br/><br/><br/><strong><h3>Game Features</h3></strong><br/>■Each character can carry 6 automatic weapons!<br/>■30 unique characters to experience the different levels of fun brought by different characters!<br/>■Provide 25 basic and 6 advanced optional special weapons (such as pulling monster leather straps, bubble wrapped lucky koi, Vietnam War stronger bear claw fists... more weapons can be discovered and explored on your own)!<br/>■Over 100 optional props!<br/>■20 wave level breaking waves and infinite wave challenge waves are waiting for you!<br/>■Pursue every battle to be cool, peaceful, and fast!", "metacritic": null, "released": "2023-10-16", "tba": false, "updated": "2023-10-20T03:18:06", "background_image": "https://media.rawg.io/media/screenshots/361/36177d12488779a5a4391fd94d611271.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cat Play"], "genres": ["Casual", "Indie"], "publishers": ["Cat Play"], "esrb_rating": null}