{"id": 968095, "slug": "rules-of-engagement-ii", "name": "Rules of Engagement II", "name_original": "Rules of Engagement II", "description": "<p>\nIn Rules of Engagement 2, you are the Fleet Commander of the Federated Worlds Armed Forces (FWAF) main task force. The war with the United Democratic Planets (UDP) has escalated, and hostile alien spacecraft have been discovered in the Local Group. In charge of a fleet of starships, you must engage enemy vessels and hostile outposts in order to protect the Federated Worlds. You being at the rank of Lieutenant Commander, but decoration and promotion are possible upon meeting thr FWAF's objective.\n</p>\n<p>\n \n</p>\nFeatures<ul>\n<li>Experience over 30 missions within the 4 tree-structured campaigns included in the game, or create your own!</li>\n<li>Customize the easy to learn interface by selecting which 4 of the 28 availible Quad Panels appear at any given time.</li>\n<li>Watch each captain under your command respond individually to your orders, according to their own personality</li>\n<li>Advance your Fleet Commander from mission to mission and campaign to campaign, gaining experience and rank as you progress</li>\n<li>Enjoy 256-color animated sequences featuring 3D rendered spaceships.</li>\n</ul>Construction Kit\n<p>\nRules of Engagement 2 is customizable. You can design and revise virtually every component of the game:\n</p>\n<ul>\n<li>Create your own missions</li>\n<li>Link your missions into tree-structured campaigns</li>\n<li>Construct your own fleet and Captains, as well as create new solar systems and alien factions.</li>\n<li>Adjust 18 personality traits to determine the physical and mental capabilities of the captains under your command, and the enemy forces they will face.</li>\n</ul>Interlocking Game System\n<p>\nRules of Engagement is the lastest module in the Interlocking Game System series, enabling you to seamlessly interconnect with Breach 2. Fight battles with Breach 2 where all experience gained is automatically transfered back to your Fleet Commander's record.\n</p>", "metacritic": null, "released": "1992-12-31", "tba": false, "updated": "2023-10-20T07:28:08", "background_image": "https://media.rawg.io/media/screenshots/e42/e4227371470d2697342a9006d9732657.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Omnitrend Software"], "genres": [], "publishers": ["Throwback Entertainment"], "esrb_rating": null}