{"id": 968032, "slug": "the-stormy-islands", "name": "The Stormy Islands", "name_original": "The Stormy Islands", "description": "Survive mother nature, prepare for the different seasons protecting yourself from cold, heat, hunger and thirst. Beware of Tornadoes, Storms, Tsunamis and predatory animals, on a variety of islands where each one will have to adapt to its limited resources. Remember \"What you do with the passage of time will depend on your survival\".<br/><br/>The game is mainly based on survival by implementing seasons, storms, tsunamis, tornadoes, scarcity of resources, the need to get food and build shelters. If necessary, you must move from island to island for your own survival.<h3>Features</h3><br/><ul><li>Survive the 4 seasons of the year. You must build structures and tools to protect yourself against heat and cold. Keep in mind that the seasons affect nature and this will influence the amount of food the island can provide.</li></ul><br/><ul><li>Tsunamis and Tornadoes, these will occur randomly throughout the game and will cause the player to have to adapt until they are over.</li></ul><br/><ul><li>4 Types of Storms. (In degrees of severity), some will give you more problems than others and may contribute negatively or positively.</li></ul><br/><ul><li>Rafts, these will be useful if you want to go to another island simply to explore or need due to lack of resources on your current island.</li></ul><br/><ul><li>Animations for things like sleeping, eating, skinning animals, opening a box, this is to make it more immersive to survive The Stormy Islands!</li></ul>", "metacritic": null, "released": "2023-10-18", "tba": false, "updated": "2023-10-20T05:56:06", "background_image": "https://media.rawg.io/media/screenshots/0d9/0d9039b21b5497aebc8ad381ecb5a116.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SeMaxYa"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["SeMaxYa"], "esrb_rating": null}