{"id": 968091, "slug": "enypnion-redreamed", "name": "Enypnion Redreamed", "name_original": "Enypnion Redreamed", "description": "First things first... How to pronounce \"Enypnion\"!<br/>[ɛnˈy.pni.on / e-nip-nee-on] • Greek<br/>(n. | literary) Something seen in sleep, i.e., a dream, a sequence of representations that appear in the mind during sleep.<br/><br/><br/><br/>Enypnion was originally developed by Sinking Sheep. Joining forces with Dionous Games, it has been transformed into the enhanced and reimagined game, Enypnion Redreamed.<br/><br/>We've gone all-out in this project! <br/>⌑ Fresh new scenes and puzzles to challenge you. <br/>⌑ Complete gameplay overhaul for a more engaging gaming experience. <br/>⌑ An improved story - providing a more cohesive and well-structured narrative.<br/><br/><br/><br/>Enypnion Redreamed is an atmospheric adventure game that will take you on a surreal journey through the subconscious mind of a young boy named Jonathan. With the help of Ikelos, one of the Oneiroi dream spirits, you will navigate through a realm of illusions and challenges to find your way back into the waking world. <br/><br/>As you progress, you will delve deeper into Jonathan's subconscious mind, where his memories, fears, and imagination come to life.  In this captivating and immersive journey, you'll have to explore bizarre and twisted landscapes, solve puzzles, and unravel the mysteries of Jonathan's subconscious. Can you make it back into the waking world, or will you be trapped forever in this twisted realm of slumberland? Join the adventure and find out in Enypnion Redreamed.<br/><br/><br/><br/><strong>FEATURES</strong><br/><br/>◘ One-click Gameplay: The game features a modern interface that is easy for players of all skill levels to pick up and play.<br/><br/>◘ Immersive Dream-like Atmosphere: Immerse yourself in the surreal and evocative atmosphere of the game, created by its unique art style, music, and sound effects.<br/><br/>◘ Transformative Narrative: Join Jonathan on a transformative journey of self-discovery as he confronts the darkness within himself and experiences personal growth.<br/><br/>◘ Puzzle-solving: Challenge yourself with mind-bending puzzles that require logic and critical thinking as you navigate through Jonathan's subconscious mind.<br/><br/>◘ Save System: Take your time exploring the dream world and revisit specific sections once they are unlocked, or pick up where you left off.<br/><br/>◘ Captivating Video Sequences: Enjoy beautiful sequences that add to the storyline and allow you to delve deeper into the surreal dream realm.<br/><br/>", "metacritic": null, "released": "2023-10-30", "tba": false, "updated": "2023-11-03T17:43:22", "background_image": "https://media.rawg.io/media/screenshots/da7/da7bcda0e1d5c2f8d83a8964a715469e.jpg", "website": "https://www.dionous.com/enypnion-redreamed/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 397, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Dionous Games", "Sinking Sheep"], "genres": ["Adventure", "Indie"], "publishers": ["Dionous Games"], "esrb_rating": null}