{"id": 968131, "slug": "l-room", "name": "L-ROOM", "name_original": "L-ROOM", "description": "<strong>Let's build the routes that connect the platforms. </strong><br/><br/>This is a first-person puzzle game where you have to understand the algorithm and select the correct nodes.<br/>Think carefully with a drone as a companion.<br/><br/><br/><br/>L-ROOM is a puzzle game where you build a route from a starting platform to a platform with the Teleporter to get to the next room.<br/>Build the correct route in the unique hologram displayed by the drone.<br/><br/><h3>Node-based program for building routes</h3>Shown inside the hologram is a node-based program consisting of several pages.<br/><ul><li>The \"Seed\" page that sets the initial node list.<br/></li><li>The \"Branch\" page that defines how node will change.<br/></li><li>The \"Generation\" page that determines how many times to grow the node list.<br/></li><li>The \"Tree\" page to browse the built results.</li></ul>Fix empty or incorrect nodes in the node list on the \"Seed\" and \"Branch\" pages.<br/>You can view the build results on the \"Tree\" page at always.<br/>There is no time limit or number of revisions allowed. You can repeat trial and error as many times as you like until you build the correct route.<br/><br/><h3>Node types</h3>The route is deployed in 3D space.<br/>6 types of nodes for going straight:<br/><ul><li>X+ and X-<br/></li><li>Y+ and Y-<br/></li><li>Z+ and Z-</li></ul>in addition, there are 24 types of nodes for turning and 10 types for \"Generation\" page.<br/><br/><h3>If you can build the correct route</h3>Once you have built the correct route, use the Floater to move to the platform with the Teleporter.<br/>You enter the Teleporter will transition to the next room.<br/>Please try to escape from all rooms!<h3>Other features</h3><ul><li>UI with only symbols and numbers.<br/></li><li>Full controller support.<br/></li><li>Steam cloud save.</li></ul>", "metacritic": null, "released": "2023-10-22", "tba": false, "updated": "2023-10-23T02:17:48", "background_image": "https://media.rawg.io/media/screenshots/cd1/cd12891a15ece2a07a7a1e0d2d210132.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Y-Square Games G.K."], "genres": ["Casual", "Indie"], "publishers": ["Y-Square Games G.K."], "esrb_rating": null}