{"id": 968137, "slug": "garden-buddies", "name": "Garden Buddies", "name_original": "Garden Buddies", "description": "<h3>Step into the world of Garden Buddies and unleash your inner gardener. Cultivate a vibrant garden with adorable companion Mutsy, finding joy and peace. Nurture your virtual garden, overcome challenges, and celebrate achievements together. Garden Buddies invites you to a tranquil oasis, where creating brings calm and balance.</h3><br/><br/><strong>Simple and Fun</strong><br/><br/>Simplicity reigns supreme in Garden Buddies, offering a chance to unwind and immerse yourself in soothing gameplay. The game's intuitive mechanics and user-friendly interface effortlessly guide your journey, encouraging relaxation and focusing on the captivating experience that awaits.<br/><br/><br/><strong>Friendship Is Key</strong><br/><br/>Companionship takes center stage as you embark on delightful encounters with adorable animals and extraordinary plant creatures every day. By forming a bond with these charming critters, you'll help them overcome hurdles through engaging and delightful mini-games. These challenges entertain and bring a sense of accomplishment and camaraderie.<br/><br/><br/><strong>Heal Your Mind</strong><br/><br/>Garden Buddies goes beyond the joy of gardening and mini-games, providing a healing experience for your mind and soul. Step away from the hustle and bustle of everyday life, take a deep breath, and let the game guide you toward inner peace.<br/><br/><br/><strong>Explore</strong><br/><br/>Explore essential life skills like box breathing and grounding techniques, while delving into emotions and engaging in discussions that promote emotional well-being. Garden Buddies becomes your virtual oasis, offering a safe haven to reduce stress and anxiety, all while immersing yourself in the beauty of digital nature.<br/><br/><br/><strong>Escape to Tranquility</strong><br/><br/>Get ready to escape to a world where tranquility and companionship flourish. Let Garden Buddies be your guides as you cultivate not only a breathtaking flower garden but also a renewed sense of calm and balance in your life. Uncover the therapeutic power of gardening and embark on a journey of self-discovery and joy. Are you ready to find solace in the embrace of Garden Buddies? Your peaceful sanctuary awaits.<br/><br/><br/><strong>Features:</strong><br/><ul><li>90-minute story mode filled with enchanting narratives, heartwarming interactions, and unexpected twists.<br/></li><li>Multiple Game Modes<br/></li><li>A Soothing soundtrack made for relaxation and harmony<br/></li><li>A healing experience for the mind, introducing essential life skills such as mindfulness exercises, stress reduction techniques, and emotional well-being practices<br/></li><li>Charming characters and animal companions<br/></li><li>Multiple customization options– unlock an array of decorative items and accessories for your oasis of peace and quiet.</li></ul>", "metacritic": null, "released": "2023-10-20", "tba": false, "updated": "2023-10-23T02:25:13", "background_image": "https://media.rawg.io/media/screenshots/98f/98f98dcf195d815f2bfd2ae16aa37cb5.jpg", "website": "https://www.reddeergames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JamPics"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["RedDeer.Games"], "esrb_rating": null}