{"id": 968231, "slug": "bubu-kong-goes-bananas", "name": "Bubu Kong Goes Bananas", "name_original": "Bubu Kong Goes Bananas", "description": "Bubu Kong Goes Bananas - An Adventure Through Classic Family Friendly Fun!<br/>\n<br/>\r\nPrepare for a thrilling journey through captivating and challenging worlds in \"Bubu Kong Goes Bananas,\" a modern-day Arcade game designed for the solitary gamer. This game offers a fresh take on the iconic arcade classic, delivering stunning visuals, immersive gameplay, and a barrel-load of excitement!<br/>\n<br/>\r\nGame Features:<br/>\n<br/>\r\nClassic Revived: \"Bubu Kong Goes Bananas\" brings the nostalgia of the original 1980s Arcade hit to life with a modern twist. Immerse yourself in the magic of retro gaming, reimagined for a new generation.<br/>\n<br/>\r\nDynamic Environments: Navigate meticulously designed levels teeming with perilous obstacles, swinging vines, and tricky platforms. Each world presents a unique challenge, keeping you engaged as you pursue Bubu Kong's quest for bananas.<br/>\n<br/>\r\nEpic Boss Fights: Overcome colossal bosses, each with its own distinctive patterns and vulnerabilities. Strategy and precision are essential to conquering these formidable adversaries.<br/>\n<br/>\r\nEmbark on this solo adventure with \"Bubu Kong Goes Bananas\" as you pay homage to gaming history while indulging in a fresh and exhilarating gaming experience. Join Bubu Kong on his epic quest, and let the banana frenzy commence!", "metacritic": null, "released": "2023-10-20", "tba": false, "updated": "2023-10-23T04:50:28", "background_image": "https://media.rawg.io/media/screenshots/b11/b1171f60b68843857a0beecd9a050ab4.jpg", "website": "http://www.crxentertainment.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CRX Entertainment Pte"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["CRX Entertainment Pte"], "esrb_rating": null}