{"id": 968221, "slug": "ghost-girl-ghussy-xxxl-edition", "name": "Ghost Girl Ghussy: XXXL Edition", "name_original": "Ghost Girl Ghussy: XXXL Edition", "description": "There’s a rumor around town of a giant woman haunting the streets, wearing a white dress as her long black hair obscures her face… Eight feet tall and with a lust for the blood of young men… Well! This young man has plenty to give, and quite frankly, she sounds hot as hell! This countryside is seriously lacking in viable young women, so why not go for the dead instead? A giant ghost gal just means all the more body to play with, as her massive tits swing with every step.<br/><br/>She falls easily to our adrenaline-fueled protagonist, his fight-or-fuck instinct kicked in, and Tsutako was not expecting a sudden rock-hard counter attack! Sinking into her tender ghost flesh, he’ll be able to experience pleasures out of this world! Nuh-uh, no sinking into the shadows for you, Tsutako, you’re gonna be our spectral sex toy whether you want it or not! Teach her the joys of the flesh, and take this ghost as your afterlife wife! The power of cock commands her!<br/><br/>It's up to you to get that fearsome phantom off the streets, and turn her into a sperm slurping specter in your sheets! Go on and get that ghost girl ghussy!<br/><ul><li>Translated version of the original Japanese Visual Novel<br/></li><li>Tsutako is fully voiced with original Japanese dialogue<br/></li><li>Original artwork HD upscaled with 16:9 and 4:3 variants<br/></li><li>Hours of story content<br/></li><li>Audio including music and special effects<br/></li><li>Enhanced with character sprite animations<br/></li><li>Gallery and Scene selections<br/></li><li>Featuring the biggest boobies in any Miel game to date!</li></ul><br/>Ghost Girl Ghussy: XXXL edition Is the English localization of a Visual Novel originally created by prolific Japanese developer Miel. We at Cherry Kiss aim to provide an authentic Japanese Visual Novel experience to gamers outside of Japan.<br/><br/>**PLEASE NOTE**<br/>All characters described and visually represented in this game are over 18 years of age, and no actual, nor identifiable minor was used in the production of this game.", "metacritic": null, "released": "2023-10-20", "tba": false, "updated": "2023-10-23T04:28:48", "background_image": "https://media.rawg.io/media/screenshots/eed/eed91085ab65284eb5b50bfa2af21209.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 405, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["miel"], "genres": ["Casual"], "publishers": ["Cherry Kiss Games"], "esrb_rating": null}