{"id": 968210, "slug": "logicubes", "name": "Logicubes", "name_original": "Logicubes", "description": "Logicubes is a fascinating adventure and puzzle game, where you must accompany Wis to discover his purpose in a Universe threatened by darkness. Meet friends along the way who will help you, along with Chrono, the spokesman of The Great Architect, to collect the ten relics that will save the Cubeverse from the ever-growing darkness that swallows everything.<br/>\n<br/>\r\nWith the help of your cunning and your solving skills, reveal creative ways to solve the puzzles, and with the help of your new friends and their abilities, revisit these worlds and find different ways to solve and advance.<br/>\n<br/>\r\nDiscover with its endearing story, that following your dreams means working for them with discipline and determination, while learning that, to achieve great things, there is nothing better than working as a team, help your teammates to reach their highest potential and take advantage of their skills to achieve their goals, save the Cubeverse, awaken The Great Architect and fulfill your mission.<br/>\n<br/>\r\nEmbark on this wonderful world full of color, challenges and adventures, the Cubeverse is waiting for you, welcome to Logicubes!<br/>\n<br/>\n<br/>\r\nIn OneDru Games we believe in providing a complete and immersive gaming experience without the need for additional purchases. Enjoy the game to its fullest without any additional costs or microtransactions.", "metacritic": null, "released": "2023-10-20", "tba": false, "updated": "2023-10-23T04:11:35", "background_image": "https://media.rawg.io/media/screenshots/b93/b9342118658117819fca61417515aa02.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["One Dru Games"], "genres": ["Adventure", "Indie"], "publishers": ["One Dru Games"], "esrb_rating": null}