{"id": 968295, "slug": "whispers-of-an-elven-captor", "name": "Whispers of an Elven Captor", "name_original": "Whispers of an Elven Captor", "description": "<strong>Whispers of an Elven Captor</strong> is an erotic adult visual novel set in a medieval fantasy realm. You're a captive human, confined in a castle dungeon, interrogated by the enigmatic elven woman, Ayelith. She is driven by an insatiable desire to prove her mettle to her superiors and safeguard her kingdom from unseen threats. However, your reluctance to divulge critical information frustrates her and her desperation leads her to accept your offer, one question answered for another. The questions you ask are of a deeply sexual nature and at first, Ayelith staunchly adheres to the conventions of elven culture, refusing to openly discuss matters of sexuality. Over time, she lets go of her reservations, and your offer escalates as you require ever increasingly sexually explicit acts.<br/><br/><br/><br/><strong>Whispers of an Elven Captor</strong> is a short, linear visual novel. There are choices in the game but they mainly determine the order in which scenes are viewed. None of the sexually scenes are optional as it wouldn't make sense in the context of the game. The sexual acts displayed in this game are handjob, footjob, titjob, blowjob, vaginal sex, and anal sex. You will see all of these in a single playthrough and they are non-skippable. All scenes are consensual and occur between a human male and elven female. <br/><br/><br/><br/>The renders are mostly sprite-based and the entire game is set within a single location. The sexually explicit scenes are fully rendered as can be seen within the screenshots. The game is very dialogue heavy and around 80% of the text is purely dialogue between characters. The game is intended to be a slow burn so expect  it to start off fairly tame but over time more sexually explicit scenes will occur. This is meant to simulate the sexually restrained elven culture that Ayelith is from so she won't simply jump into bed with you straight away. The game has been priced accordingly based upon the above information.", "metacritic": null, "released": "2023-10-23", "tba": false, "updated": "2023-10-27T02:47:53", "background_image": "https://media.rawg.io/media/screenshots/cc8/cc81dc6f4ac6e22c57830e56a1ccb0c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["JellyFluff Games"], "genres": ["RPG", "Casual", "Indie"], "publishers": ["JellyFluff Games"], "esrb_rating": null}