{"id": 968282, "slug": "chase-survivors", "name": "Chase Survivors", "name_original": "Chase Survivors", "description": "<strong>Are you able to wait for 15 minutes until the rescue arrives, right?</strong><br/><br/>In the epicenter of a zombie apocalypse with little hope of making it out alive, grab everything you find along the way: weapons, coins, first aid kits, treasure chests, experience items, and even a four-leaf clover is important to bring luck in times like these.<br/><br/><br/><br/>The living beings around you are now abominations infected by some malevolent pathogen. They will relentlessly chase you as you await the arrival of the rescue helicopter. All you have left is to bless all these creatures with the hell of bullets you have to offer.<br/><br/><br/><br/>Collect as much experience as possible, as this way your character evolves, acquires new weapons, and obtains essential passive items for survival. Gathering coins is also crucial as it allows you to purchase permanent skill item upgrades.<br/><br/><br/><br/><ul><li> Texture, shaders, and lighting effects in the best retro style of 90s games.<br/></li><li> Annihilate crows, zombies, giant insects, monstrous spiders, relentless hellhounds, and other infected creatures that have emerged to decimate human life.<br/></li><li> A heavy metal soundtrack to face the merciless hordes.<br/></li><li> Unlock characters with unique characteristics. Survive until the rescue, and maybe someone else will join the group.</li></ul>", "metacritic": null, "released": "2023-10-26", "tba": false, "updated": "2023-10-27T02:31:44", "background_image": "https://media.rawg.io/media/screenshots/a6e/a6eeecdcfface7a5d9601185abdfbafc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Minicactus Games"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Minicactus Games"], "esrb_rating": null}