{"id": 968208, "slug": "peak53", "name": "PEAK.53", "name_original": "PEAK.53", "description": "PEAK.53 is a tactical shooter developed by Dirty Bird Games - UE5<br/>\r\nAt Dirty Bird Games -PEAK.53 , we want to bring back the nostalgia, the close-quarter fights, the skill-based tactical moments, the overall simplicity to gameplay and other features, and finally, bring back team communication that actually matters.<br/>\r\nImmersive voice over(s) during game-play when either side wins a match, plants a bomb on the opponents site, and rounds counts for both Seals and Insurgents.<br/>\r\nClassic 8 vs 8 matches - one life per round, no healing or reviving teammates.<br/>\r\nClassic map modes - suppression, demolition.<br/>\r\nLimited loadouts, one primary, one secondary, frag grenades(6) and one utility item.<br/>\r\nNO vehicles or other forms of transportation(present or future).<br/>\r\nSimple UI/HUD, no overcomplication with functionality or visual(s).<br/>\r\nPurely skill-based mechanics, team communication, and level/map advantages.<br/>\r\nNo heal buffs, shields or other forms of protection to gain advantages over other players.<br/>\r\nAll weapons/firearms will be similar in performance and handling with slight adjustments for balancing to equal all \"PVP\"(play versus player)\" interactions and \"gun-fights\".<br/>\r\nClassic weapon loadouts, featured guns with additions to new weapons at release.<br/>\r\nClassic lobby system, each side displayed on screen before match begins.<br/>\r\nClassic in-game scoreboard to display team leaders in points, kills, and deaths.", "metacritic": null, "released": "2023-10-20", "tba": false, "updated": "2024-01-06T22:07:26", "background_image": "https://media.rawg.io/media/screenshots/7d0/7d0e4817d3a791082272896b9fd8ad27.jpg", "website": "https://dirtybirdgames.co/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 498, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Dirty Bird Games"], "genres": ["Action", "Massively Multiplayer"], "publishers": ["FOUR"], "esrb_rating": null}