{"id": 968293, "slug": "maze-maverick", "name": "Maze Maverick", "name_original": "Maze Maverick", "description": "Step into the electrifying world of <strong>Maze Maverick</strong>. Think you've mastered mazes? Think again! Navigate unpredictable labyrinths, dodge crafty ghosts, and snatch up coins in this thrilling arcade extravaganza.<h3>Game Modes Galore!</h3><br/>- <strong>Arcade Mode</strong>: Classic mazing with a Maverick twist! Grab strawberries to sneak through walls or chomp on cherries to teach those ghosts a lesson. But beware, some ghosts aren't just wandering – they're hunting!<br/> <br/>- <strong>Ghost Mode</strong>: Who needs walls? Roam freely, gather coins, but remember: these ghosts have had their morning coffee. They're twice as fast and twice as sneaky!<br/> <br/>- <strong>Darken Mode:</strong> No peeking! Navigate with no minimap and no sneaky shortcuts. Just you, the coins, and a couple of ghosts. Hope you've got a good memory!<br/> <br/><br/><br/>- <strong>Skybox Mode:</strong> Show off your maze prowess on open terrains! But don't get too cocky, one misstep and you're history.<h3>Features &amp; Fun Stuff:</h3><br/>- 🎮 <strong>Dynamic Mazes</strong>: No repeats, no deja-vus. Every level offers a fresh, new challenge.<br/> <br/>- 👻 <strong>Crafty Ghosts</strong>: Directly trying to catch you, each ghost adds its own pinch of chaos to the mix.<br/> <br/>- 🕹️ <strong>Stunning Controls &amp; Design</strong>: Smooth, responsive, and just downright fun.<br/> <br/>- 🍒 <strong>Power-ups &amp; More</strong>: Strawberries, cherries, and...wait, did that ghost just speed up?<br/><br/><br/><br/>Jump in, dodge, collect, and conquer! Are you maverick enough for <strong>Maze Maverick</strong>?", "metacritic": null, "released": "2023-10-24", "tba": false, "updated": "2023-10-27T02:44:46", "background_image": "https://media.rawg.io/media/screenshots/b49/b49414fc0e0e245eb0a0f8b60c2df31d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kilanos Studio", "DaPode", "Meltah", "3li"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Kilanos Studio", "Meltah", "3li"], "esrb_rating": null}