{"id": 968344, "slug": "succubus-girl", "name": "Succubus Girl", "name_original": "Succubus Girl", "description": "\"That perpetual being does not die, but in the weird eternity, even death dies.\"<br/>-- Abdul Alhazred, 730<h3>◆Story</h3><br/>There was an organisation that harboured unknown creatures hidden away in the corner of the world.<br/>Leo, a promising researcher, joined the renowned Abel Biotechnology Company and was offered a well-paid job by his beautiful yet cold supervisor on his first day.<br/>Unable to resist the temptation of money, Leo met a naive and romantic girl named Gaia in a greenhouse-like laboratory filled with the fragrance of plants.<br/>[She had to take semen every once in a while?! And she was particularly happy about being touched up?! Occasionally, there were also domineering, cosplay and bondage games.]<br/><br/>In the midst of all this day-to-day company—apart from the growing affection and sweet passion—there seemed to be something else buried in the endless darkness of the past…<br/>The vision that repeatedly appeared in dreams—what could it mean?!<br/>As Leo, could you accept the truth?<br/><br/><h3>◆Gameplay Instructions</h3><br/>A simulation game full of exploration and puzzle elements.<br/>The player takes on the role of Leo, a researcher who takes care of the succubus girl in the institute.<br/>You can try to develop a relationship with the innocent girl and feed her with plenty of love ❤.<br/>Or try to solve the mysteries of the facility...<br/>Remember, there are many truths in this world--and they are often cruel and heartbreakingly beautiful.<br/><br/><br/><h3>◆Game Features</h3><br/>◆34 basic CGs, including more than 350 differentials and 4 motion CGs<br/>◆Game text: 100,000<br/>◆One main female character and four secondary female characters<br/>◆SCP Foundation theme, Cthulhu-style game<br/>◆Group sex, tentacles, and gory contents included<br/>◆Game endings: 14 types (including a true ending)<br/><br/>", "metacritic": null, "released": "2023-10-24", "tba": false, "updated": "2023-10-27T03:52:15", "background_image": "https://media.rawg.io/media/screenshots/aa4/aa487d3f0abc39033504188a1f405640.jpg", "website": "https://www.facebook.com/playmeowGame", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nemesis"], "genres": ["Simulation", "Casual"], "publishers": ["Playmeow", "ACG creator"], "esrb_rating": null}