{"id": 968376, "slug": "japan-train-models-jr-east-edition", "name": "Japan Train Models - JR East Edition", "name_original": "Japan Train Models - JR East Edition", "description": "Japan Train Models, the game where you can enjoy trains in its entirety, is now available with trains of JR West!<br/>\n<br/>\r\nThere are three modes to play: Pazzle mode, Layout mode, and Encyclopedia mode!<br/>\r\nYou can enjoy the fascination of trains as much as you want.<br/>\n<br/>\r\nPuzzle Mode<br/>\r\nThis is a game mode in which players create pazzle by attaching train parts at puzzle intervals.<br/>\r\nAll vehicles appearing in the game are officially licensed!<br/>\r\nYou can assemble these finely detailed vehicles as many times as you like.<br/>\n<br/>\r\nAnd the vehicles are not the only pazzle you can build.<br/>\r\nAt the end of each stage, you can create a diorama of the scenery where the cars run.<br/>\n<br/>\r\nLayout Mode<br/>\r\nThe layout base featured in this work is the new layout from the second edition of \"Japan Train Models\", the new layout base included in this work is the new layout from the second version!<br/>\r\nLet's create a new cityscape different from the first version.<br/>\n<br/>\r\nYou can place buildings and other structures on the layout to create your one and only original layout!<br/>\r\nYou can also take cool pictures by running the cars you built in the Pazzle mode!<br/>\r\nBy selecting morning, evening, or night time, you can enjoy the changes in scenery depending on the time of day.<br/>\r\nThere are also a variety of shooting modes, such as scenery from a train window or from the viewpoint of a cameraman placed on the layout!<br/>\r\nIn addition, you can move the placed cameraman. Take the best shot from your favorite place and angle!<br/>\n<br/>\r\nEncyclopedia Mode<br/>\r\nYou can check detailed data and 3D models of the vehicles!<br/>\r\nEnjoy your favorite cars by enlarging and rotating them.<br/>\r\nYou can switch the internal camera and move to the carriages to feel as if you are on the train.<br/>\r\nYou can also see the detailed descriptions of the cars supervised by JR East.<br/>\n<br/>\r\nEquipped with a train car.<br/>\r\nJapan Train Models - JR West Edition features the following 3 cars.<br/>\r\n225-100 Series<br/>\r\n117 Series<br/>\r\n103 Series<br/>\n<br/>\r\nHere is your own railway space to create!", "metacritic": null, "released": "2023-10-25", "tba": false, "updated": "2023-12-15T05:59:11", "background_image": "https://media.rawg.io/media/screenshots/ddf/ddfb77323a6200a6d4e14c25a426012b.jpg", "website": "https://digipla-marutetsu.gmodecorp.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["G-mode"], "genres": ["Simulation", "Casual"], "publishers": ["G-Mode"], "esrb_rating": null}