{"id": 968327, "slug": "bug-blazer", "name": "Bug Blazer", "name_original": "Bug Blazer", "description": "Created by a guy with a knack for big numbers and a vendetta against pests, comes an incremental clicker/idler that takes a different approach on progress: No prestige mechanic.<h3>Features of the game include, but not limited to.</h3><ul><li> Strategic attacking is rewarded and clients pay more for a job well done!<br/></li><li> Numerous achievements to be gotten for those who enjoy them!<br/></li><li> Destroy pests any way you can with whatever weapons you acquire.<br/></li><li> Swarms of bugs, special glowing bugs with extra rewards.<br/></li><li> No prestige mechanic, so your progress will always increment.<br/></li><li> Costs of items, upgrades and values were simulated and tested and values are not arbitrary.<br/></li><li> Very few people actually read these text descriptions, and if you did, the next line will surprise you<br/></li><li> Set your company name to \"Thoroughly Inc.\" to get a nice 2500 coins to upgrade your first weapon right away.<br/></li><li> Still reading?  Making your name \"Reader\" will also unlock the sticky trap for the first level.<br/></li><li> Just how far does it go?  Who knows, perhaps you'll find out.</li></ul><br/>Your play style is your choice.  An armada of bugs are awaiting their annihilation!<br/>If you choose to idle, there are numerous traps you can set to encourage critters to sniff it out and find out what's really inside.  (It's not candy).", "metacritic": null, "released": "2023-10-23", "tba": false, "updated": "2023-10-27T03:28:50", "background_image": "https://media.rawg.io/media/screenshots/052/052afa97166c059d1eb4564f55eacac3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Xysaph"], "genres": ["Casual", "Indie"], "publishers": ["Xysareen Games"], "esrb_rating": null}