{"id": 968305, "slug": "power-fantasy", "name": "Power Fantasy", "name_original": "Power Fantasy", "description": "Introducing \"Power Fantasy\" - an action-packed roguelike/horde survivor game where you'll embark on a thrilling journey where you'll progress from a humble beginning to become an unstoppable force. Dive into a challenging world filled with relentless enemies and strategic choices as you fight for survival and ultimate victory.<h3>Key Features:</h3><br/><ul><li><strong>Evolving Power:</strong> Begin your journey as a vulnerable protagonist, but fear not! As you progress, unlock and collect powerful perks that significantly enhance your abilities. With each level gained, witness your character grow stronger, empowering you to face even greater challenges.<br/><br/></li><li><strong>Synergistic Gameplay:</strong> Discover a wide array of perks and carefully crafted items that interact with one another in surprising and unique ways. Unleash devastating combinations and experiment with different playstyles as you find synergies that suit your preferred strategies.<br/><br/></li><li><strong>Horde Survival and Boss Battles</strong>: Brace yourself for intense battles against relentless hordes of enemies. Survive wave after wave of adversaries, utilizing your growing power and strategic prowess to overcome their onslaught. Finally, face off against formidable boss encounters in bullet hell-style combat. Only the most skilled players will emerge victorious.<br/><br/></li><li><strong>Unlockable Content:</strong> Prove your prowess by unlocking new characters and additional maps through achieving various in-game accomplishments. Explore new environments and unleash the full potential of each character's unique abilities, adding depth and replayability to your gameplay experience.</li></ul><br/>Embrace the thrill of an ever-evolving power fantasy, where your journey starts with vulnerability and ends with unstoppable might. Are you ready to overcome endless hordes, uncover synergistic combinations, and conquer the ultimate challenges that await? Step into \"Power Fantasy\" and unleash your inner hero.", "metacritic": null, "released": "2023-10-23", "tba": false, "updated": "2023-10-27T02:59:35", "background_image": "https://media.rawg.io/media/screenshots/8c1/8c13c4c443a780cce52762f7a49b58ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 95, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lava Lamb"], "genres": ["Action", "RPG"], "publishers": ["Lava Lamb"], "esrb_rating": null}