{"id": 968369, "slug": "affectionate-annie", "name": "Affectionate Annie", "name_original": "Affectionate Annie", "description": "<strong>Affectionate Annie</strong> is a realtime-3D interactive erotic story about Annie, the hostess at the Haversham resort. Annie is a sweet, smiley ray of sunshine who brightens everyone's day with exceptional service and playful, <strong>casual sex</strong>. All of the guests at Haversham resort know about Annie's unbounded affection, and are not at all shocked to find her <strong>masturbating by the pool</strong> or <strong>having sex with a guest or two</strong> out on the beach.<br/><br/><br/><br/>This interactive erotic story plays out over a week of Annie's life as the resort hostess. In her Free Time, Annie can wander the resort and \"Play\" with the guests. She might <strong>masturbate in the public shower, give a friend a hand-job, or even have sex with a guest or two</strong>. There are also 12 scripted scenes, where the receptionist informs Annie about new guest arrivals, and sends her to enjoy some time (<strong>and casual sex</strong>) with each new group of guests.<br/><br/><br/><br/>When playing out a scene in Affectionate Annie, you can also enter \"Setup Mode\" and modify the scene. You are free to move the characters and objects within the scene to your own preferred location, without interrupting any of the action.<br/><br/><br/><br/>Affectionate Annie takes the Visual Novel to the next level, with completely realtime-3D graphics that give you complete freedom to navigate and explore every scene. The story of Annie and her unbounded sexual affection features:<br/><br/><ul><li>A lighthearted romp through the hyper-sexual life of Annie, the sweet, bubbly hostess at the Haversham resort.</li><li>Full English voice-over by a number of talented professional Erotic Voice Actresses and Actors, including hours of voice content by the amazingly talented and Insanely-Sexy Mia Sloane as Annie.</li><li>The ability to modify certain features of Annie's look, as well as purchase new outfits with \"Affection Points\"</li><li>Free exploration and interaction with random guests.</li><li>'Setup Mode\" where you can modify each scene to your liking.</li><li>The ability to play through and re-live every erotic scene over and over from a “scenes” menu.</li></ul>", "metacritic": null, "released": "2023-10-24", "tba": false, "updated": "2023-10-27T04:26:52", "background_image": "https://media.rawg.io/media/screenshots/971/9710e5e6812156d78deff5f2b4624f9c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 357, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HFTGames"], "genres": ["Simulation", "Casual"], "publishers": ["HFTGames"], "esrb_rating": null}