{"id": 968336, "slug": "nephilim-2", "name": "Nephilim", "name_original": "Nephilim", "description": "A single-player social deduction game in which you must uncover a heretic who has infiltrated a religious order that worships \"La Place\", a machine that can predict the future, as a god.<br/><br/>The advent of \"La Place,\" a machine that can predict the future, has led humankind to a new level of development.<br/>They worshiped the machine as a god and built the \"Garden,\" a sanctuary surrounded by a huge wall.<br/><br/>For those living outside the wall, the Garden is a utopia.<br/>They have joined the order and continue their devotion, looking forward to the day they will be invited to the place.<br/><br/>You are one of them.<br/>Finally, the day has come when all those years of dedication have come to fruition.<br/>You have been invited to the final step of moving to the \"Garden\": the \"Gathering\".<br/>You leave the old house, never to return, filled with the anticipation of your new life in the utopia.<br/><br/><ul><li><strong>Pseudo Werewolf Simulator for One Player</strong></li></ul>You can enjoy a pseudo-werewolf game with a total of 12 NPCs, each has a different thinking pattern.<br/><br/>As the game proceeds, you will be able to set the number of players, whether or not NPCs appear in the game, and whether or not titles appear in the game, allowing you to set up situations that suit your tastes.<br/><br/><ul><li><strong>Using the abilities of the various titles to advance the game favorably.</strong></li></ul>Eight different titles, each has different abilities, allowing you to experience a wide variety of situations.<br/><br/><strong>Follower</strong><br/>A title of the side of the order who has no abilities.<br/>Follower uses deductions and voting to uncover the \"Nephilim\" who have infiltrated the gathering.<br/><br/><strong>Oracle</strong><br/>A title of the order side who is given an oracle from God.<br/>Oracle chooses one of the survivors each night to determine if chosen one is \"Nephilim\" or not.<br/><br/><strong>Inquisitor</strong><br/>A title of the side of the order who interrogates suspects locked up in solitary confinement.<br/>The Inquisitor determines whether the participant sent to solitary confinement is a \"Nephilim\" during the day's discussion.<br/><br/><strong>Guard</strong><br/>A title of the side of the order who protects the congregation from the hands of the heretics.<br/>Each night, Guard chooses one of the survivors and protects one from the attack of the \"Nephilim\".<br/><br/><strong>Nephilim</strong><br/>A position of the heretical side whose goal is to bring down the order.<br/>Each night, Nephilim chooses one of the survivors and attack the chosen one.<br/><br/><strong>Apostate</strong><br/>An \"oracle\" on the heretical side who betrays the order and allies with Nephilim.<br/>The Apostate chooses one of the survivors every night to identify the title.<br/><br/><strong>Junkie</strong><br/>A title on the heretical side who cooperates with \"Nephilim\" for the sake of electronic drugs.<br/>Let's find out who is \"Nephilim\" and support one.<br/><br/><strong>Irregular</strong><br/>A title of the third force who does not belong to either the order or the heretics.<br/>By not being a target of the oracle and surviving, Irregular can aim for a one-person victory.", "metacritic": null, "released": "2023-10-23", "tba": false, "updated": "2023-10-27T03:40:24", "background_image": "https://media.rawg.io/media/screenshots/59d/59d74a124140ef715423d570db7c7a3a.jpg", "website": "https://www.fantasi-sta.com/nephilim", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Fantasista"], "genres": ["Adventure", "Simulation"], "publishers": ["Fantasista"], "esrb_rating": null}