{"id": 968384, "slug": "buddy-and-friends-on-halloween", "name": "Buddy and Friends on Halloween", "name_original": "Buddy and Friends on Halloween", "description": "Embark on a delightful and heartwarming Halloween journey with Buddy the cat and his friends in a charming jigsaw puzzle game, illustrated by Katia Numakura.<h3>🎃 Theme and Story:</h3>In this enchanting game, you'll follow Buddy and his pals Oliver, Pandora and Whiskers as they set off on a Halloween adventure filled with compassion, kindness, and the true spirit of the season. From his decorated bedroom to mysterious streets, each of the six beautifully illustrated scenes captures the essence of Halloween in a way that's both magical and heartwarming.<h3>🧩 Puzzling Challenges:</h3>Challenge yourself with jigsaw puzzles of varying complexity. We offer all six scenes in five different levels of difficulty, ranging from 60 to 540 pieces, ensuring that everyone can enjoy the game at their own pace. Whether you're a puzzle novice or an experienced pro, there's a challenge waiting for you.<h3>🎶 Soothing Soundtrack:</h3>Unwind and relax with our exclusive soundtrack, designed by Tatyana Jacques to complement the game's gentle, heartwarming atmosphere. Let the music guide you through each puzzle as you piece together Buddy's Halloween adventure.<h3>🧩 Puzzle Features:</h3><ul><li> Zoom: Get up close and personal with every piece.<br/></li><li> Highlight Borders: Easily identify edge pieces.<br/></li><li> Highlight Quadrant Pieces: Focus on pieces from a specific area.<br/></li><li> Shuffle: Mix up remaining pieces for a fresh perspective.<br/></li><li> Preview: Take a sneak peek at the complete scene.<br/></li><li> Drag the Board: Customize your puzzle-solving experience.</li></ul><h3>🎁 Unlock and Share:</h3>Complete the puzzle in any mode, and you'll unlock the full image for download. Share it with your loved ones to spread the love and warmth of Buddy's Halloween adventure. Use it as a desktop background to inspire your day and keep the spirit of kindness alive, not just during Halloween but all year round.<br/><br/>Immerse yourself in a heartwarming Halloween tale, piece by piece, with Buddy and friends. Join us on this charming journey and discover the joy of compassion and the magic of togetherness this Halloween season!", "metacritic": null, "released": "2023-10-25", "tba": false, "updated": "2023-10-27T04:46:23", "background_image": "https://media.rawg.io/media/screenshots/9c5/9c586754ad827620edb4e280ab7a626e.jpg", "website": "https://menssanainteractive.com/buddy-and-friends-on-halloween/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Mens Sana Interactive"], "genres": ["Casual"], "publishers": ["Mens Sana Interactive"], "esrb_rating": null}