{"id": 968434, "slug": "cryoterror", "name": "Cryoterror", "name_original": "Cryoterror", "description": "<strong>Cryoterror is a new chilling space horror experience with nostalgic retro-style visuals.</strong><h3>Features</h3><ul><li>Unique Visual Style: Experience a distinct horror atmosphere with pixelation and dithering effects.<br/></li><li>Simplified Gameplay: Enjoy an accessible gaming experience with straightforward controls.<br/></li><li>Eerie Soundscapes: Immerse yourself in a world of unease with haunting audio design that keeps you on edge.<br/></li><li>Engaging Gameplay: Encounter a select number of puzzles and tasks that add depth to your journey.</li></ul><br/><h3>Cryoterror</h3>In Cryoterror you find yourself abroad a spacecraft sent from Earth on a mission to reach the nearest inhabitable star system. Launched over five decades ago the ship now drifts through the vastness of space, far from Earth's reach. The ship, isolated in space, carries a crew in cryosleep, preserving them in frigid slumber.<br/> With the ship far from its destination, you wake up from cryosleep and find yourself seemingly alone, surrounded by empty cryopods and dread. However, a glimmer of hope emerges as you realize that your brother's cryopod, remains active in the cold.<br/><br/>To rescue your brother, you must explore the desolate vessel, piecing together the fate of your fellow travelers and confronting the terrifying mysteries lurking in the shadows of the vessel.<br/><br/>Whatever happens you must rescue your brother...<br/><br/>", "metacritic": null, "released": "2023-10-26", "tba": false, "updated": "2023-10-27T05:52:27", "background_image": "https://media.rawg.io/media/screenshots/b15/b1505a5e61f5d3a01cf97a13e74acdd2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CryoDev"], "genres": ["Indie"], "publishers": ["CryoDev"], "esrb_rating": null}