{"id": 968452, "slug": "happy-lab-2", "name": "Happy Lab", "name_original": "Happy Lab", "description": "<h3>Introducing \"Happy Lab\": A thrilling test facility experience!</h3><br/>You are a new intern at the most advanced science facility. Your daily job would be to train our AI \"Aurora\". Tests, Tools, Upgrades, and Weapons - are at your disposal. \"Aurora\" purpose is to create the most advanced armor and fix all glitches on the way if there are any.<br/><br/><br/><br/>Happy Lab is a single-player game where the player takes on the role of an intern who finds themselves in the mysterious Happy Lab, where robot experiments are conducted. On each level, the player unlocks new tools and gameplay mechanics.<br/><br/>Immerse yourself in the captivating atmosphere of Happy Lab, interact with the environment, solve physics-based puzzles, and uncover the dark secrets of the Happy Lab facility.<br/><br/><br/><br/><strong>Features:</strong><br/><ul><li>   6 Weapons: Unleash the power of explosive tennis ball launchers and the mighty creeper gun.<br/></li><li>    13 Deadly Traps: Set up classic mines and spikes, or embrace modern technology with the portal and pulse traps.<br/></li><li>    Story-based Campaign: Embark on a journey across three acts, where you'll tackle everyday routines and enjoy a cup of coffee. Need a snack? The lab even has a cookie dispenser!<br/></li><li>    Persistent Upgrades: Unlock improved traps as you inflict more damage on your targets. Your budget grows with your success.<br/></li><li>    Sandbox Mode: Let your creativity soar as you build the ultimate torture chamber. Unlock finishers and grind your way to achievements.<br/></li><li>    Boss Events: Prepare yourself for challenging boss encounters that will test your ingenuity and resilience.</li></ul><br/>Experience the excitement of working in the Happy Lab test facility, where you'll discover a wide array of weapons, traps, and thrilling challenges. Get ready to unleash chaos and show off your skills!", "metacritic": null, "released": "2023-10-26", "tba": false, "updated": "2023-10-27T06:13:59", "background_image": "https://media.rawg.io/media/screenshots/b82/b82a1504ad071c5ea472f2d8d6fcd28a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Badim", "Sunset TEKO"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["Sunset TEKO"], "esrb_rating": null}