{"id": 968470, "slug": "usonatsu-the-summer-romance-bloomed-from-a-lie-dem", "name": "UsoNatsu ~The Summer Romance Bloomed From A Lie~ Demo", "name_original": "UsoNatsu ~The Summer Romance Bloomed From A Lie~ Demo", "description": "UsoNatsu ~The Summer Romance Bloomed From A Lie~ is coming soon and can be wishlisted \nhere<br/><br/> \n\nThis is a story about finding love to overwrite the feelings for the one they held dearest. A girls love visual novel about summer, love and adolescence.STORY\n\n<br/>\n<br/>\nOverlooking the sea, atop a hill, stands Aoba Dai-ichi High School in Minatocho. \n<br/>\n<br/>\nOne fateful night, the heart of Tachibana Kaoru, a second-year student, is shattered by her middle school homeroom teacher, Shimotsuki Mirei. This moment is witnessed by Minagi Shiori, a diligent classmate of Kaoru's and a model student.\n<br/>\n<br/>\nIn her state of despair, Kaoru confides in Shiori about her painful past with Mirei. Shiori, with an enigmatic aura, raises a thought-provoking question:\n<br/>\n<br/>\n<br/>\n<br/>\nUncertain but willing to try, Kaoru contemplates this idea as a means to move forward.\n<br/>\n<br/>\nIn a surprising turn of events, Shiori makes an unusual request of Kaoru—to help her forget her older brother. This request involves embarking on a journey through Shiori's own memories, as she has long strived to match the excellence set by her sibling but has realized that she's lost sight of her own desires.\n<br/>\n<br/>\n<br/>\n\nBoth enthusiastic about this \"memory tour,\" Kaoru is eager to forget her first crush, her teacher and Shiori is eager to forget about matching up to her older brother. However, their evolving connection is soon discovered by Inohara Riku, another classmate who secretly holds feelings for Shiori. As the curtain rises on their story, it promises to deliver a mix of slapstick humor and heartfelt romance.CHARACTERS\n<br/>\nFEATURES<ul><li>Spine animation brings the characters to life\n<br/>\n</li><li>Opening Theme \"sun shade\" sung by Yui Nishio\n<br/>\n</li><li>Character designs by Shio Koji (FATAL TWELVE, Sound of Drop)\n<br/>\n</li><li>Main characters with full Japanese voice acting\n<br/>\n</li><li>English, Simplified Chinese, Japanese language support\n<br/>\n</li><li>CG Gallery Mode</li></ul>STAFFCharacter Design: Shio Koji \n\n<br/>\nScenario: Akeo\n<br/>\nBackground Art: Senju Kobo Co., Ltd.\n<br/>\nMusic: Yua（next marginalized progress）\n<br/>\nPublishing: Sekai Project\n<br/>\nProducer: Iida Takaaki\n<br/>\nPlanning/Development: LYCORIS", "metacritic": null, "released": null, "tba": false, "updated": "2023-10-27T06:38:41", "background_image": "https://media.rawg.io/media/screenshots/1af/1af9ee2d27b2b6841adb4312a0d7dbe6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LYCORIS"], "genres": [], "publishers": ["Sekai Project"], "esrb_rating": null}