{"id": 968449, "slug": "oberak-prelude", "name": "Oberak (Prelude)", "name_original": "Oberak (Prelude)", "description": "Oberak is a stylized genre mashup of action adventure RPG and Social School Sim with a dash of Roguelite spice, set in a Sci-Fantasy world inspired by Wuxia stories, Shonen martial arts anime, and the style of hip-hop culture.<br/><br/>As a powerful Qi warrior, your journey will focus on nurturing and training students in order to activate their superhuman Kung-Fu abilities. You’ll master a myriad of skills including martial and athletic training, hunting, gardening, cooking, foraging, and crafting, which you will pass along to your student. You and your students’ abilities will be put to the test through up-close, hyper-stylized combat with deadly rogue clans that have threatened the lands of Ti-an. Challenging combat, exciting narrative, and satisfying cultivation are combined in a refreshing new spin on a Cultivation Sim.<br/><br/><br/>Explore the beauty of Ti-an on this exciting adventure. Collect, forage, hunt, and garden along the way. <br/><br/><br/>Hanato is your home! With the rogue clans on the rise causing an upheaval, it's up to you to keep it safe. <br/><br/>[build your legacy gif]<br/>Nurture and train your students in a variety of skills from martial and athletic training to hunting, gardening, cooking, foraging, and crafting to make them stronger and well-rounded to protect Hanato alongside you. <br/><br/>[connect and conquer gif]<br/>Connect with your fellow Oberaks to train and adventure together through Ti-an.", "metacritic": null, "released": "2023-10-26", "tba": false, "updated": "2023-10-27T06:10:46", "background_image": "https://media.rawg.io/media/screenshots/1fd/1fdd9de82bcbe360b98f78d6790ab951.jpg", "website": "https://oberakgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wildseed Games"], "genres": ["Action", "Adventure", "RPG", "Simulation"], "publishers": ["Wildseed Games"], "esrb_rating": null}