{"id": 968416, "slug": "battlecakes-2", "name": "BattleCakes", "name_original": "BattleCakes", "description": "Indulge in a deliciously delightful world of sweetness as you head out on an adventure to save<br/>the day! Play as Birthday Sprinkle, the cupcake hero that you personalize and create, as you<br/>explore the whimsical world of Pasteleria. Meet charming and endearing friends along the way<br/>like Red Velvet, Midnite Truffle and more as you work together to uncover the mysteries and<br/>hardships plaguing the nearby towns. Choose your approach by either battling or befriending<br/>the monsters who stand in your way. Discover the joy of friendship and community as you fight to leave the world better off than you found it and make your mark. <br/><br/>Stop and smell the frosting in this candy-colored, and cheerful atmosphere while enjoying the<br/>adorably cozy vibes. Immerse yourself in child-like wonder as you celebrate your individuality<br/>by designing your cupcake to reflect who you are. Don’t forget to take a moment to relax to<br/>find and pet all the Jellyroll cats who are just waiting to be snuggled.<br/><br/>Do you think you have what it takes to join the legendary Battlecakes? Of course you do. High<br/>five!<br/><br/><br/><ul><li>Customize your cupcake hero! Bake your best life with loads of fun colors and fashionable frosting styles.<br/></li><li>Save the day your way! Monsters abound in Pasteleria—you decide whether to befriend them and walk away with new pals, or battle it out and take ‘em down.<br/><br/></li><li>Explore a candy-colored world of magic, fun, and mystery! From the fragrant fields of Vanilla Hill to the sticky swamps of Nougat Hollow, your sweet adventure awaits!<br/></li><li>Choose your path! Any quest, monster, and resident of Pasteleria could send your story in a different direction, and it’s all up to what kind of cupcake you choose to be.<br/></li><li>Pet all the cats! Jellyroll cats love to explore, but they love a good snuggle even more. Can you find and pet every Jellyroll cat peppered throughout Pasteleria?<br/></li></ul><br/>", "metacritic": null, "released": "2023-10-25", "tba": false, "updated": "2023-10-27T05:29:28", "background_image": "https://media.rawg.io/media/screenshots/acb/acb98585fc1929cd3e70b937b2c066cf.jpg", "website": "http://www.battlecakes.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Volcano Bean"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Volcano Bean"], "esrb_rating": null}