{"id": 968451, "slug": "desktop-pet-project", "name": "Desktop Pet Project", "name_original": "Desktop Pet Project", "description": "Tired of doing your daily chores?<br/>Think you need to break up the gray, lonely days at your computer?<br/><strong>Do you want to be interrupted for fun?</strong><h3>Desktop Pet Project is designed to do just that.</h3>Inspired by such a wonderful invention as Shimeji, Desktop Pet Project has tried to collect the most interesting and curious mechanics.<br/><ul><li>You can summon up to two pets that will have slight personalities in behavior.<br/></li><li>You can give them names.<br/></li><li>Several cats of several colors are available by default.<br/></li><li>You can also import your favorite Shimeji by going through Shimeji Import Manager (downloadable shimeji, not browser extension) and customize your pet's behavior in a certain way.<br/></li><li>Support Steam Workshop, which will allow you to get the community-created pets.<br/></li><li>Don't forget to feed your pets.<br/></li><li>You can play several mini-games with your pets.<br/></li><li>Pets need sleep, so it is not recommended to interrupt their sleep.<br/></li><li>Pets don't like to be dragged around the screen, who would like that? But with the help of a treat you can peacefully move the pet to another place.<br/></li><li>If you treat them poorly, pets will surely remind you how important it is to treat them well (you can turn it off, but it is not recommended).<br/></li><li>They sometimes will play with some mouses on screen (you can disable this, but then it would be less fun).<br/></li><li>A pet creation manager for creative individuals that allows you to fine-tune the interaction and each sprite. Once created, you can easy upload to Steam Workshop.</li></ul>", "metacritic": null, "released": "2023-10-26", "tba": false, "updated": "2023-10-27T06:12:51", "background_image": "https://media.rawg.io/media/screenshots/668/668d12ae033ba096faeb26e53287de4a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Alterran Rumble"], "genres": ["RPG", "Simulation", "Sports", "Casual", "Indie"], "publishers": ["Alterran Rumble"], "esrb_rating": null}