{"id": 968446, "slug": "beyond-hanwell-teaser-the-royal-hallamshire", "name": "Beyond Hanwell Teaser: The Royal Hallamshire", "name_original": "Beyond Hanwell Teaser: The Royal Hallamshire", "description": "<h3>Beyond Hanwell: The Royal Hallamshire</h3>Head through the gates of The Royal Hallamshire and discover it's secrets. A hospital far beyond the borough of Hanwell, The Royal Hallamshire is a standalone teaser to the upcoming psychological/survival horror <strong>Beyond Hanwell</strong>.<br/><br/><ul><li>Dual control melee combat system, land each hit and combo with satisfying intensity.<br/></li><li>Play your own your own way, non linear open gameplay makes for a unique experience. With multiple ways to complete the location.<br/></li><li>Immersive. All player feedback is displayed in game, with no HUD whatsoever to keep you immersed and the tension high.</li></ul><br/><br/>Explore a dynamic environment. Play through The Royal Hallamshire multiple times and discover new ways to finish the location with their secrets.<br/><br/><br/>We're trying to create an effortless control scheme, navigate the environment naturally with minimal tutorial.<br/><br/><br/>The Royal Hallamshire is dense, detailed and atmospheric, explore, search, scavenge and survive.<br/><br/><br/>Interact with the world in various ways, use the environment to take out enemies or open up new paths to discover.<br/><br/><br/>Dual combat system and environmental blocks. Open up different paths based on what you have available at the time.", "metacritic": null, "released": "2023-10-26", "tba": false, "updated": "2023-10-27T06:07:08", "background_image": "https://media.rawg.io/media/screenshots/63c/63c8cb4b13276bf58454cf58e7c2d7e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Steel Arts Software"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Steel Arts Software"], "esrb_rating": null}