{"id": 968445, "slug": "lofi-kitten", "name": "LoFi Kitten", "name_original": "LoFi Kitten", "description": "🎵 Step into the world of LoFi Kitten, a captivating blend of casual gaming and puzzle-solving with a lo-fi twist. 🎵<br/><br/>Unwind and immerse yourself in the soothing rhythm of our chill beats as you navigate through 45 meticulously crafted stages. Your mission? To collect every vintage vinyl and retro cassette tape hidden within our whimsical world. Each piece of music you unlock is a step closer to completing your personal lo-fi playlist.<br/>But that's not all. In LoFi Kitten, the game itself moves to the rhythm. Watch in awe as elements within the game react to the beat, creating a mesmerizing harmony of sight and sound.<br/>Harness your puzzle solving skills to help your kitten to light up panels and progress through the game. With every challenge you overcome, you'll unlock new tracks of our immersive lo-fi soundtrack, designed to help you relax and enjoy life's simple pleasures.<br/>When you're ready for a break from puzzle-solving, retreat to your cozy study room. Here, you can kick back, relax, and enjoy the music you've unlocked. Watch as your achievements come to life, represented by objects within the room.<br/>LoFi Kitten is more than just a game, it's a journey into a world where stress fades away and good vibes rule.<h3>Key Features: </h3><ul><li> ✓ ﻿﻿45 intricately designed stages to test your puzzle-solving skills<br/></li><li> ✓ ﻿﻿15 unique lo-fi beats composed for the game by Thiago Adamo aka LPXL to discover and add to your in-game playlist to listen in a exclusive study room.<br/></li><li> ✓ ﻿﻿Interactive elements that react to the music's beat<br/></li><li> ✓ A personalized study room to enjoy your music and view your achievements<br/></li><li> ✓ Endless cat customizations to make your feline friend truly yours</li></ul><br/>Ready to let the music guide you? Join us in LoFi Kitten and lose yourself in the rhythm of relaxation.", "metacritic": null, "released": "2023-10-26", "tba": false, "updated": "2023-10-27T06:05:47", "background_image": "https://media.rawg.io/media/screenshots/a48/a48a6a199146e4dbc35ececf5e2afbc6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Game Audio Sounds"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["YarnCat Games"], "esrb_rating": null}