{"id": 968409, "slug": "di-ruanoniang-drenched-girls", "name": "滴るあの娘 ～Drenched Girls～", "name_original": "滴るあの娘 ～Drenched Girls～", "description": "～Drenched Girls～ 滴るあの娘 is a novel game in which the protagonist \"Ryo\" who loves the appearance of drenched girls, will use any pranks to soak them.<br/>\r\nA Bishojo Game released in 2017 under the \"Noirsoft\" brand has been reworked for the \"PandaShojo\" platform for players around the world to enjoy.<br/>\n<br/>\n<br/>\r\n◆Introduction<br/>\r\nDon't worry, I'm living my youth to the fullest.<br/>\r\nIt might be quite a twisted youth, but it's just another form of it.<br/>\r\nI feel amazing right now.<br/>\r\nWell then, shall we get soaking wet!<br/>\n<br/>\n<br/>\r\n◆Synopsis<br/>\r\nThe protagonist Ryo Shirai is a manly, yet unpopular male student.<br/>\r\nepeatedly confessing and facing rejection one after another, there was one ambition in the heart of someone like Ryo...<br/>\r\nTo drench girls and make them soaking wet.<br/>\r\nThere is only one reason... because drenched girls are too cute!<br/>\r\nFor that, he needs to date girls first, but there was no sign of it happening anytime soon.<br/>\r\n\"What should I do to date with girls...?\"<br/>\n<br/>\r\nOne day on his way home, Ryo realized he had forgotten something and turned back to school.<br/>\r\nWhen he returned to the classroom, he found Mikoto Nishigaki, the class representative, sleeping at her desk while she was supposed to be on duty.<br/>\r\nUnable to wake Mikoto up no matter how much he called out to her, Ryo came up with an idea.<br/>\r\nIf I do something to her now, she might not realize what happened.<br/>\r\nJust what is Ryo going to do...!?<br/>\n<br/>\n<br/>\r\n◆Characters<br/>\r\n・Mikoto Nishigaki<br/>\r\n\"Sigh... you're trying to charm them one by one, aren't you?\"<br/>\r\nThe class president is a well-liked, cute, and sociable person with an outstanding figure.<br/>\r\nShe had been napping due to sleep deprivation after school when she became the target of Ryo's prank.<br/>\r\nShe is a central figure in the class and is liked by everyone, regardless of gender.<br/>\n<br/>\r\n・Asuka=Dinoars<br/>\r\n\"As always, you're quite the ladies' man. Going after anyone and everyone?\"<br/>\r\nA transfer student from the United States, full of energy, with outstanding athletic abilities, and a constant smile.<br/>\r\nShe lived next door to Ryo's house, and they went to and from school together most of the time.<br/>\r\nShe was popular among the boys for her glamorous physique and the contrast between her childlike side.<br/>\n<br/>\r\n・Yukiho Shimamura<br/>\r\n\"Ryo, you seem to like all kinds of different people. It's cute\"<br/>\r\nThe landlord of the nearby apartment exudes a soft aura and adult charm.<br/>\r\nShe is acquainted with Ryo and gracefully ignores his multiple confessions.<br/>\r\nAmong the men in the neighborhood, she is secretly referred to as a goddess due to her popularity.<br/>\n<br/>\r\n・Ryo Shirai<br/>\r\n\"Oh, I got rejected... so please go out with me.\"<br/>\r\nA male student with a decent appearance but a troublesome personality and a penchant for women.<br/>\r\nHe repeatedly confesses to many girls, but getting rejected or brushed off has become part of his daily routine.<br/>\r\nThe incident with Mikoto awakened his mischievous side.", "metacritic": null, "released": "2023-10-25", "tba": false, "updated": "2023-10-27T05:19:58", "background_image": "https://media.rawg.io/media/screenshots/785/7858fe554c800476cdea51ace121f25c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 323, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CyberStep", "Rideon Works Co. Ltd,"], "genres": ["Adventure", "Simulation", "Casual"], "publishers": ["CyberStep"], "esrb_rating": null}