{"id": 968441, "slug": "kickback-slug-cosmic-courier", "name": "Kickback Slug: Cosmic Courier", "name_original": "Kickback Slug: Cosmic Courier", "description": "Slugs are SLOW. But not this slug. Slippy is a slug in space, and he has learnt to fly using the kickback of his guns and thrusters! Shoot in one direction, fly in another. But oh, if it was that fun, Slippy has increasingly difficult obstacles in the way - slugs are not happy when they encounter spikes in space…<br/><br/>Kickback Slug: Cosmic Courier is an avoidance-based physics game where you must exploit the kickback of your arsenal to navigate a series of increasingly difficult obstacles.<br/><br/><br/><br/>Slippy and Mr McFly are committed to their job. As delivery drivers for the largest intergalactic trader of goods, they are held to high standards. However, their usual daily shift, and the chance of being named employees of the month, suffers a major blow when a mechanical failure causes their ship to crash land on a planet seemingly floating through space! Even worse, they have lost all of the parcels that now lay scattered across the planet’s surface...<br/><br/><br/><br/>Unbeknownst to all the aliens in the nearby galaxy, the fate of their expected next-day deliveries lie within the tentacles of Slippy and McFly. Can you guide them across the planet and recover all of the lost parcels along the way?<br/><br/><br/><br/><ul><li>Physics-based gameplay, requiring the use of weapon kickback to move.<br/></li><li>Master the three main weapon types to quickly, and successfully, navigate the levels.<br/></li><li>Fifty playable levels spanning five zones, such as a dense jungle, icy peak, long-forgotten mines, boiling lava pools, and even space itself!<br/></li><li>Six unlockable bonus levels that put your kickback abilities to the ultimate test!<br/></li><li>Defeat bosses that guard access to new areas.<br/></li><li>Test your kickback skills by retrieving lost parcels hidden within every level.<br/></li><li>Use the gallery screen to view your recovered parcels!</li></ul>", "metacritic": null, "released": "2023-10-26", "tba": false, "updated": "2023-10-27T06:01:18", "background_image": "https://media.rawg.io/media/screenshots/31e/31e08291aa885b81be7c1d49168be22f.jpg", "website": "http://kittensintimespace.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kittens in Timespace"], "genres": ["Action", "Adventure", "Casual"], "publishers": ["Bonus Stage Publishing"], "esrb_rating": null}