{"id": 9685, "slug": "masterpiecevr", "name": "MasterpieceVR", "name_original": "MasterpieceVR", "description": "MasterpieceVR is the easiest, most natural way to quickly create 3D content. Sculpt and draw using intuitive dynamic tools that let you easily create high quality models for use in games, animation, digital art, VFX, industrial design and 3D printing. Immerse yourself - create collaboratively with colleagues, friends, or teach others in real time in the same virtual space. Perform and engage with others using advanced Mixed Reality and room camera features.<br/><br/> Available for Arcades on SpringboardVR <h3>CORE FEATURES:</h3><h3>Clay &amp; Mesh Creation - Create with Intuitive &amp; Powerful Tools</h3><br/><strong>Clay Sculpting</strong><br/>Shape your creativity with intuitive and powerful clay sculpting tools. Create organic characters, creatures, and scenes with ease.<br/><br/><strong>Ribbons &amp; Meshes</strong><br/>Add detail, hard surfaces and effects to your creations with ribbons and meshes.<h3>Grid &amp; Guide Tools - Create with Precision</h3><br/><strong>Grid</strong><br/>Turn on the Grid and snap your tools to precise points in space.<br/><br/><strong>Angles</strong><br/>Angle Snapping controls the precise orientation of your tool in space.<br/>‍<br/><strong>Guides</strong><br/>Use Point, Line and Plane Guides to add precision to your sculpting.<br/><br/><strong>Gizmo</strong><br/>Change the shape of the basic Sculpting Meshes (Cube, Sphere, Cylinder, Pyramid, Cone and Torus) with the Gizmo for even more modeling power.<h3>Remix your Workflow - Explore New Creative Possibilities</h3><br/><strong>Exporting</strong><br/>Export your creations as OBJ, STL, FBX, GLTF. You can render them in other 3D programs, or 3D print them.<br/><br/><strong>Importing</strong><br/>Fill your virtual creative space with inspiration. Import browsers, images, videos, and 3D models as references or as part of your creation. <br/><br/><strong>Convert to Mesh</strong><br/>Convert parts of your sculpted creations into meshes that act as independent object, allowing you to reach new levels of detail and complexity.<br/><br/><strong>Rasterization</strong><br/>Rasterize imported meshes and edit them with our powerful clay sculpting tools. <br/><br/><strong>3D Library Integration</strong><br/>Our Google Poly and Sketchfab integration allows you to browse for models from these libraries and import them as references, or to Remix with our Clay Editing tools.<br/><br/><strong>Stamps for Kitbashing</strong><br/>Use Stamps from our Featured Stamp library and build amazing, complex creations with ease. You can also create your own stamp library using our sculpting tools and our Save Stamp feature or download 3D kitbash sets online and expand your kitbashing possibilities.<h3>Social - Share Your Creations in Multiple Ways</h3><br/><strong>Collaborate with Friends in the Same Virtual Space</strong><br/>You can create collaboratively with friends or colleagues or teach others in real time in the same virtual space with our networking feature.<br/><br/><strong>View Mode</strong><br/>Share your work with your friends by taking pictures and videos in View Mode. Our lighting studio brings your model to life with Shadows. Ambient Occlusion, Bloom and up to 3 directional lights.<br/><br/><strong>Sketchfab Integration</strong><br/>Our Sketchfab integration lets you save your models directly to your Sketchfab account.<br/><br/><strong>Streaming</strong><br/>Set up a streaming studio with multiple cameras and make your creation videos for Twitch, Facebook or Youtube more dynamic and interesting.<br/><br/><strong>Mixed Reality</strong><br/>MasterpieceVR is the most full-featured creative app for mixed reality performance available. Our Mixed Reality capabilities allow you to demonstrate your work in fun and engaging ways. Learn about our Mixed Reality features and how to set it up here: https://www.masterpiecevr.com/blog/mixed-reality-guide-for-masterpiecevr/", "metacritic": null, "released": "2017-01-20", "tba": false, "updated": "2019-04-22T09:42:58", "background_image": "https://media.rawg.io/media/screenshots/a9a/a9aa60a7b901c85084d6222f9a25eff0.jpg", "website": "http://brinxvr.com/mpvr", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 41, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Brinx Software"], "genres": [], "publishers": ["Brinx Software"], "esrb_rating": null}