{"id": 968582, "slug": "progres", "name": "Progres", "name_original": "Progres", "description": "<strong>Progres – gra edukacyjna dla dzieci </strong><br/><br/>PROGRES jest narzędziem wspierającym wszechstronny rozwój oraz szybką i efektywną naukę dzieci i młodzieży w wieku 6-15 lat. Posiada atrakcyjną formę poprzez wykorzystanie nowoczesnego środka edukacyjnego jakim jest komputer. Rozwój oparty o zabawę i współzawodnictwo, wyzwala pozytywne emocje, pozwala odnieść sukces, podnosi motywację i chęć do dalszego działania.<br/>Kierowany jest do uczniów w wieku 6-15 lat w celu podniesienia umiejętności szkolnych, zapobiegania deficytom, osiągania sukcesów, podnoszenia motywacji do zdobywania wiedzy w sposób szybki i trwały. Ćwiczenia i zadania są formą treningu, który wydobywa potencjał intelektualny dziecka i rozwija go wszechstronnie.<br/><br/><strong>Ćwiczenia kształtują</strong><br/><br/><ul><li> umiejętności językowe<br/></li><li> czytanie i słuchanie ze zrozumieniem<br/></li><li> zdolności wzrokowo-słuchowe<br/></li><li> wyobraźnię<br/></li><li> koncentrację uwagi<br/></li><li> spostrzegawczość i szybkość reakcji<br/></li><li> myślenie logiczne<br/></li><li> umiejętności pamięciowe<br/></li><li> liczenie i myślenie matematyczne</li></ul><br/>Zawartość merytoryczna jest wynikiem zbierania wieloletnich doświadczeń w pracy z dziećmi i młodzieżą w różnym wieku, ze specyficznymi i specjalnymi potrzebami edukacyjnymi jak również z dziećmi wybitnie zdolnymi. Aplikacja realizuje zadania Treningu Globalnego Wspierania Rozwoju Dzieci i Młodzieży. <br/>Jest narzędziem do osiągania sukcesu, jakim jest wszechstronny rozwój ucznia i jego umiejętności. Program jest przeznaczony do wykorzystania zarówno w szkole jak i w warunkach domowych.<br/><br/><br/><strong>Szczegółowy opis programu komputerowego PROGRES</strong><br/><br/><strong>PRZEZNACZENIE</strong><br/>PROGRES narodził się z wiedzy, doświadczeń w pracy  i obserwacji rozwoju dzieci. Jest to program komputerowy wspomagający rozwój psychoruchowy dzieci i młodzieży. Kierowany jest do wszystkich uczniów w wieku 6-15 lat w celu podniesienia umiejętności szkolnych, zapobiegania deficytom, osiągania sukcesów, podnoszenia motywacji do zdobywania wiedzy w sposób szybki i trwały. Ćwiczenia i zadania są formą treningu, który wydobywa potencjał intelektualny dziecka i rozwija go wszechstronnie.<br/><br/><strong>ZAWARTOŚĆ MERYTORYCZNA</strong><br/>Jest wynikiem zbierania wieloletnich doświadczeń w pracy z dziećmi i młodzieżą w różnym wieku, ze specyficznymi i specjalnymi potrzebami edukacyjnymi jak również z dziećmi wybitnie zdolnymi. Oparta jest o wiedzę teoretyczną zawartą w wielu publikacjach naukowych na temat rozwoju dzieci oraz o metody i formy pracy wypracowane przez autorkę. Główną koncepcją jest Trening Globalny Wspierania Rozwoju dzieci i młodzieży. Aplikacja PROGRES realizuje zadania Treningu Globalnego, który jest zawarty w jego strukturze. Traktowany jest jako narzędzie pomocnicze do osiągania sukcesu, jakim jest wszechstronny rozwój ucznia i jego umiejętności. Program jest przeznaczony do realizacji w szkole, wraz z nauczycielem jako towarzyszem treningu, który wzmacnia sukcesy, poświęca uwagę i czas. Program zalecany jest również do używania w warunkach domowych przy udziale rodziców i opiekunów, jako kontynuacja procesu rozwijającego prowadzonego przez szkołę.<br/><br/><strong>ĆWICZENIA KSZTAŁTUJĄ</strong><br/><br/><ul><li> umiejętności językowe<br/></li><li> czytanie i słuchanie ze zrozumieniem<br/></li><li> zdolności wzrokowo-słuchowe<br/></li><li>  wyobraźnię<br/></li><li>  koncentrację uwagi<br/></li><li>  spostrzegawczość i szybkość reakcji<br/></li><li>  myślenie logiczne<br/></li><li>  umiejętności pamięciowe<br/></li><li>  liczenie i myślenie matematyczne</li></ul><br/><strong>ZASTOSOWANIE</strong><br/>Aplikacja powstała z myślą o zastosowaniu jako pomocy w pracy z dziećmi i młodzieżą. Jest w szczególności przydatna w przypadkach:<br/><br/><ul><li> dzieci z problemami szkolnymi powodującymi trudności, deficyty, frustracje, brak równowagi emocjonalnej, brak motywacji do nauki;<br/></li><li> dzieci z dysleksją;<br/></li><li> dzieci nadpobudliwych psychoruchowo;<br/></li><li> dzieci z problemami ruchowymi oraz z zaburzoną koordynacją wzrokowo-ruchową;<br/></li><li> dzieci zdolne mogą dzięki Programowi Komputerowemu Wspierającemu Rozwój przyspieszyć tempo nauki;</li></ul><br/><strong>Deficyty najczęściej występujące u dzieci:</strong><br/><br/><ul><li> brak koncentracji uwagi;<br/></li><li> brak koordynacji wzrokowo-ruchowo-słuchowej;<br/></li><li> słabe procesy pamięciowe;<br/></li><li> powolny proces przetwarzania informacji;<br/></li><li> zaburzona analiza i synteza wzrokowa i słuchowa;<br/></li><li> nadpobudliwość psychoruchowa;<br/></li><li> brak równowagi emocjonalnej;<br/></li><li> brak sukcesów szkolnych, frustracje, brak motywacji do nauki;</li></ul><br/><strong>ZASTOSOWANE METODY</strong><br/>Do opracowania programu wykorzystano techniki pracy terapeutycznej oparte na metodach:<br/><br/><ul><li> Metody Dobrego Startu<br/></li><li> Sensorycznej Integracji Kinezjologii Edukacyjnej P. Dennisona<br/></li><li> Metody 18 struktur Wyrazowych<br/></li><li> Metody relaksacyjne, muzykoterapia</li></ul><br/>Realizacja ćwiczeń w aplikacji Progres to trening sensoryczny przygotowujący centralny układ nerwowy do pracy intelektualnej.<br/><br/><strong>Zadania w aplikacji prowadzą do podniesienia poziomu:</strong><br/><br/><ul><li> koncentracji uwagi,<br/></li><li> koordynacji wzrokowo -ruchowo-słuchowej,<br/></li><li> spostrzegawczości,<br/></li><li> różnicowania wzrokowego i słuchowego,<br/></li><li> analizy i syntezy wzrokowo-słuchowej,<br/></li><li> procesów logicznego myślenia,<br/></li><li> szybkości reakcji na bodźce,<br/></li><li> procesów pamięciowych,<br/></li><li> czytania, pisania,<br/></li><li> liczenia - myślenia matematycznego,<br/></li><li> kształtowania wyobraźni,<br/></li><li> procesów językowych</li></ul><br/><strong>Aktywności podejmowane przez ucznia w aplikacji PROGRES:</strong><br/><br/><ul><li> słuchanie<br/></li><li> czytanie<br/></li><li> mówienie<br/></li><li> liczenie<br/></li><li> myślenie logiczne<br/></li><li> zapamiętywania<br/></li><li> aktywność analizatorów: wzrokowego, słuchowego, kinestetycznego</li></ul><br/><strong>STOPNIOWANIE TRUDNOŚCI</strong><br/>Program umożliwia dostosowanie stopnia trudności zadań do aktualnych możliwości użytkownika. Można tak dobrać trudność każdego zadania, by zadanie zakończyło się sukcesem i przyniosło duży ładunek pozytywnej energii budującej wysoki poziom motywacji ucznia do pracy.<br/><br/><strong>REALIZACJA APLIKACJI</strong><br/>Sposób realizacji aplikacji (interfejs, komunikacja, udzielanie odpowiedzi, wyniki) dostosowane są też do potrzeb i wymagań dzieci. Wszystkie zadania i ćwiczenia są szczegółowo opisane i omówione przez występujące w aplikacji postacie. W każdym momencie realizacji zadań użytkownik widzi w jakiej grupie ćwiczeń się znajduje.<br/>Każda część programu jest prowadzona przez trenera, który jest widoczny na ekranie podczas realizacji ćwiczenia jak również czyta on polecenia. W każdym momencie realizacji ćwiczeń Użytkownik może skorzystać z ćwiczeń ruchowych, jak również ma bezpośredni dostęp do Treningu emocji. Wyniki można drukować, co ma istotne znaczenie w tak zwanym zatrzymaniu chwili, szczególnie tej przynoszącej sukces i radość. Praca z aplikacją odbywa się w przyjemnej bezstresowej atmosferze. Nowoczesna multimedialna forma realizacji łączy w sobie bogatą zawartość merytoryczną z atrakcyjną zabawą z komputerem. Dziecka nie trzeba zmuszać do wykonywania ćwiczeń, wykonuje je samodzielnie z przyjemnością, ciesząc się z osiąganych postępów.<br/><br/>Konstrukcja aplikacji PROGRES pozwala też na wspólną zabawę dzieci i rodziców. Takie zachowania pogłębiają więzy rodzinne i najbardziej stymulują do pracy. <br/><br/><strong>PODSUMOWANIE</strong><br/>PROGRES to wszechstronna i wieloprofilowa pomoc stymulująca rozwój procesów intelektualnych i umysłowych. Prowadząca poprzez trening do prawidłowych funkcji nauki i efektywnego uczenia się.", "metacritic": null, "released": "2023-10-28", "tba": false, "updated": "2023-10-30T04:08:20", "background_image": "https://media.rawg.io/media/screenshots/9c7/9c747b27dcc0b9d8ea2ea4132bf31b3f.jpg", "website": "https://poruszumysl.pl", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LK Avalon"], "genres": ["Casual"], "publishers": ["LK Avalon"], "esrb_rating": null}