{"id": 968518, "slug": "five-nights-no-escape-co-op", "name": "Five Nights: No Escape (Co-op)", "name_original": "Five Nights: No Escape (Co-op)", "description": "<h3>Five Nights: No Escape, another Horror Craze!</h3><br/>We have faithfully reproduced the core gameplay of the classic horror game - Five Nights at Freddy's, and added new features such as online cooperation mode and real-time voice chat, allowing you to relive the classic in a VR environment! Are you ready? <br/><br/><br/><ul><li>Immersive Experience: Immersive scenes and sound effects allow you to immerse yourself in horror and excitement from a first-person VR perspective, and continue to feel the adrenaline surge! <br/></li><li>Online Cooperation: Scared of playing horror games alone? Don’t worry, call your friends and enjoy the fun of horror games together! Double the horror, double the excitement! <br/></li><li>Real-time Voice Chat: Supports real-time voice chat to facilitate communication and cooperation with other teammates! <br/></li><li>Realistic Physical Effects: Comfortable button interaction, simulating the most realistic feeling of physical collision! <br/></li><li>Hidden Plots: Explore the unknown in the dark and unlock the ultimate secrets behind the mall and mascots! </li></ul><br/><br/>We sincerely invite you to join the official Discord to meet other players online, share game experiences, make like-minded friends, and communicate with our development team at any time to obtain the latest development progress, as well as free keys, etc. Come and get it! <br/><br/>Let us enter this mysterious mall together, uncover the mysteries, explore the truth, and experience the unknown fear and excitement. Don't hesitate to join us for a real horror journey!", "metacritic": null, "released": "2023-10-27", "tba": false, "updated": "2023-10-30T02:36:11", "background_image": "https://media.rawg.io/media/screenshots/275/275d1356ed7677d2e678a059fb1ccb48.jpg", "website": "https://vrsuplife.com/home", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 381, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Suplife Games"], "genres": ["Adventure", "Strategy", "Simulation", "Indie"], "publishers": ["Suplife Games"], "esrb_rating": null}