{"id": 968525, "slug": "heavenly-beauty-x-silver-bubble-ninetales", "name": "Heavenly Beauty × Silver Bubble Ninetales", "name_original": "Heavenly Beauty × Silver Bubble Ninetales", "description": "The silver nine-tailed bubble fox \" AWAYUKI\" appeared in front of the protagonist of the exorcist. <br/>The main character, who has a favorable impression of her, be able to resist temptation and seal AWAYUKI...?<br/><br/><br/><br/><br/>This game consists of two parts: \"Evasion\" and \"Battle.\" <br/>The evasion part involves action elements and aims to getting close to AWAYUKI before transitioning into the battle part, all while avoiding flying bubbles and hearts. In the battle segment, the goal is to use your skills to damage AWAYUKI while resisting her attacks and temptations. <br/>Each part is distinct yet intertwined, allowing you to enjoy action elements and strategic combat.<br/><br/>When attempting to achieve victory, the difficulty level is quite high, but the game is designed with the assumption that you will be defeated initially. <br/>There's no privilege to winning; even if you lose, you can comfortably retreat to the reminiscence room, so please enjoy to your heart's content.<h3>The gender of the protagonist can be chosen between male and female. </h3>The storyline, gameplay, and overall structure remain the same; only depictions, CGs, and certain text elements will differ based on gender. <br/>Furthermore, this concept aims to be a user-friendly game, so despite its rich content, it can be enjoyed with ease!<br/><br/><br/><br/><h3>Nine-Tailed Fox × Bubbles!</h3>In this competition, your opponent is the captivating nine-tailed fox. With exceptional sensual skills and alluring temptations, she aims to lead the protagonist astray. From breast fondling, kissing, foot torment, and real sexual encounters to using her heavy and fluffy tail for torment and seduction, as well as employing special bubble abilities for torment (such as sticky soap bubble attacks, entrapping you in a large motionless bubble, and more)!<br/><h3>Intense Scenarios, Casual Gameplay</h3>After a 2-minute opening (optional), dive into battle with AWAYUKI! <br/>There is no exploration or leveling elements, allowing you to immediately enjoy the core aspects of the game. <br/>And after defeat, you're swiftly taken to the reminiscence room. Rich customization features are available, including elements exclusive to the reminiscence room.<br/><h3>Abundant Status Effects</h3>As a key feature of this genre, the pleasurable pains are richly and densely arrayed this time. <br/>Captivating, sensitive, lascivious, brainwashing, sleeping, covered in bubbles, foot fetish, tail fetish, and more... <br/>Although there's only one enemy character, there are around 20 different status effects!<br/><h3>Convenient Reminiscence Room</h3>You can freely select the techniques your opponent uses, choose your preferred evasion game map, and even use debugging features to adjust the pleasure damage ratio received and disable status effects. <br/>Detailed customization is also available. Since around 40 bubble fox skills cannot be used in the main storyline, make full use of the reminiscence room.<br/><br/><br/>", "metacritic": null, "released": "2023-10-27", "tba": false, "updated": "2023-10-30T02:47:42", "background_image": "https://media.rawg.io/media/screenshots/549/54977f66ec9bef5e8898d8c5c1d7008a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FLOAT Arrow"], "genres": ["Action", "Racing", "Casual", "Indie"], "publishers": ["SM KING", "072 Project"], "esrb_rating": null}