{"id": 968507, "slug": "cozy-village", "name": "Cozy Village", "name_original": "Cozy Village", "description": "<h3>Cozy Village</h3>Welcome to the enchanting world of Cozy Village, where tranquility and adventure intertwine in a picturesque setting. Immerse yourself in a heartwarming village exploration game that invites you to uncover hidden treasures and unravel the mysteries of this charming hamlet.<h3>Key Features</h3><ul><li>🌳 Explore a Charming Town: Wander through the quaint streets of a small town, each corner exuding its own unique charm. Uncover hidden treasures, secret pathways, and lovely places.<br/></li><li>🌲 Tranquil Forest Discovery: Venture into the tranquil forest that borders the town. Discover hidden nooks, soothing clearings, and the thrill of stumbling upon rare objects amidst the lush greenery.<br/></li><li>🔍 Search for Scattered Objects: Engage in a rewarding scavenger hunt as you search for specific objects thoughtfully placed throughout the town and forest. Sharpen your observation skills and enjoy the satisfaction of each find.<br/></li><li>🏡 Immerse Yourself: Immerse yourself in the laid-back ambiance and the calming sounds of nature. Let the soothing atmosphere wash over you as you explore at your own pace.<br/></li><li>🎶 Relaxing Soundtrack: Enjoy a soothing and melodic soundtrack that perfectly complements the relaxing gameplay, enhancing your overall experience.</li></ul>", "metacritic": null, "released": "2023-10-27", "tba": false, "updated": "2023-10-30T02:21:32", "background_image": "https://media.rawg.io/media/screenshots/621/621a71b0499779535227916f5eb13f0b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Morning Shift Studios"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Morning Shift Studios"], "esrb_rating": null}