{"id": 968570, "slug": "apollyon-river-of-life", "name": "Apollyon: River of Life", "name_original": "Apollyon: River of Life", "description": "Apollyon is a dark <strong>fantasy narrative RPG</strong> focused on choices, where you summon demons and spiritual entities, deal with them for power, and delve deeper into an occult universe! It is a <strong>multiplayer choose-your-own adventure RPG</strong> mixed with a <strong>roguelike strategy board game</strong> and hidden deckbuilder elements.<br/><br/><br/><br/><br/>In this 40+ hour game, you will:<br/><br/><ul><li>Use obsidian tokens upon the Apollyic table to control the powers of the world. Moving them upon the table influences what spirits can approach your table, which abilities you can use, as well as aiding or harming every challenge before you! <br/><br/></li><li>Deal with three spiritual entities every round. These might be creatures of other worlds, other occult practitioners, visions of the beyond, or many, many more! They must be dealt with through violence, invocation, treaties, deception, or the like.<br/><br/></li><li>Make difficult decisions that will change the narrative, both in small arcs and large stories for character and table alike. Your <strong>choices will matter</strong>, for better or worse!<br/><br/></li><li>Invoke spirits of your own. You may bring some of these spirits between rituals as <strong>permanent unlocks</strong>, known as Invocations.  You may also bring a <strong>small charm</strong> into every ritual, such as the Silver Timepiece to keep yourself sane while projecting into the spirit world.<br/><br/></li><li>Play Apollyon with <strong>up to two friends</strong>, who will share the table's alignment and take on every spirit together! This creates a unique strategy only present in <strong>multiplayer</strong>. For example, your efforts to escape a hostile fire spirit might be led by the player with more <strong>Agility</strong>, or the player who has a <strong>Guard</strong> on their physical statistics, in case they fail and take damage!<br/><br/></li><li>Unlock and play the <strong>ten playable characters</strong>, and progress their stories alone or in multiplayer! Gaining power through these skills and abilities will help you complete later missions, known as Intentions.<br/></li></ul><br/><br/><br/><br/>In the world of Sartova this practice is used to evoke angelic beings, gods, and other intelligences related to souls, elements, the Themes, night terrors, disembodied voices, and even things older than the gods themselves... Through this practice, <strong>Apollyon</strong>, one may speak with them, make deals for power, capture them, or even project one's soul from their body entirely. The table can provide all of this, and it is all dangerous.<br/><br/><br/><br/><br/>Apollyon is a narrative story that will be shaped by your choices. It comprises 550,000+ words and has over 600 pieces of custom-made art in the Apollyic mosaic style. These words and pictures will not be seen in every playthrough, and nearly every line of text can react in some way to <strong>choices</strong> you've made, <strong>items</strong> you carry, or even your <strong>character's identity</strong>! For example, the scientist of magic has insights different from the man shackled to devilish deals he regrets...<br/><br/>Head on over to Apollyon's discord to give feedback, ideas, report bugs directly to the developer, or find others to join in Apollyon!", "metacritic": null, "released": "2023-10-28", "tba": false, "updated": "2023-10-30T03:49:27", "background_image": "https://media.rawg.io/media/screenshots/15d/15d6e356b8cc88530a38ba871feb1fb5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 307, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["theplanardanse"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["theplanardanse"], "esrb_rating": null}