{"id": 968508, "slug": "grand-strokers", "name": "Grand Strokers", "name_original": "Grand Strokers", "description": "In this horror-themed comedic RPG, you are \"Hero\" (but can change your name) that tries to stop a horned-up vampire named \"The Grand Stroker\" and his electrifying friends. You will fight enemies, level up and get progressively stronger tiered gear, take on dungeons and hand-drawn bosses until the final show-down where you will fight the \"The Grand Stroker\" himself in the Grand Stroker's Castle. Will you survive --- or will he suck your life-forces dry? <br/><br/>The game features : <br/><br/>•Hilarious names, places and ideas that will literally say \"Are you kidding me?!\"<br/><br/>•Hand drawn bosses from Cesare, the legendary Italian illustrator from NecroCatic Games!!<br/><br/>•At least 7 dungeons and a dozen bosses!<br/><br/>•A ton of color tiered gear to collect including rare, epic and MONSTER drops!<br/><br/>•Traditional turn-based combat with new and clearly superior <strong>Retro Sideview Combat</strong>!<br/><br/>•Some BANGING Music by returning OST composer Scott Oakes (who did \"The Tower of Wowers\")!! <br/><br/>•Masterful voice actor VaughnsEvilLair providing funny and witty lines that will sure to leave you in stiches.<br/><br/>•Ideas from the same programmer and studio that brought you such classic games as \"The Tower of Wowers\" and \"CarsFuckingDragons\".<br/><br/>AND MORE!!!", "metacritic": null, "released": "2023-10-27", "tba": false, "updated": "2023-10-30T02:23:08", "background_image": "https://media.rawg.io/media/screenshots/c60/c60b9dd0702db76b0ed901af45f8ec8b.jpg", "website": "https://www.necrocaticgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 276, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NecroCatic Games"], "genres": ["RPG"], "publishers": ["NecroCatic Games"], "esrb_rating": null}