{"id": 968567, "slug": "dreadfall", "name": "DreadFall", "name_original": "DreadFall", "description": "Introducing Dreadfall, a chilling psychological horror platform game that will immerse you in an intricate and captivating storyline while offering innovative gameplay mechanics.<br/>\n<br/>\r\nPrepare to embark on a journey like no other as you step into the haunting world of Dreadfall. Dive into the depths of fear and unravel the dark secrets that await you. This spine-tingling adventure will keep you on the edge of your seat throughout.<br/>\n<br/>\r\nImmerse yourself in a gripping narrative that will leave you questioning reality and sanity. Unveil the mysteries of the eerie world that surrounds you and confront your deepest fears along the way.<br/>\n<br/>\r\nWith its innovative gameplay mechanics, Dreadfall takes platform gaming to new heights. Navigate treacherous environments, solve mind-bending puzzles, and face nightmarish creatures that will put your wits to the test.<br/>\n<br/>\r\nPrepare for a truly terrifying experience as you delve into the heart of darkness in Dreadfall. Every choice you make will have consequences, and the line between reality and nightmare will blur as you progress deeper into the game.<br/>\n<br/>\r\nEmbrace the unknown and prepare to challenge your courage in Dreadfall. Are you ready to confront the darkness within and survive the psychological horrors that lie ahead? Brace yourself for an unforgettable journey into the abyss of fear and suspense.", "metacritic": null, "released": "2023-10-27", "tba": false, "updated": "2023-10-30T03:46:06", "background_image": "https://media.rawg.io/media/screenshots/c87/c878b9222e73d7ae06f272d9cc50560d.jpg", "website": "https://www.codingquests.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CB4D", "CodingQuests"], "genres": ["Action", "Indie"], "publishers": ["CodingQuests"], "esrb_rating": null}