{"id": 96857, "slug": "loot-hound-itch", "name": "Loot Hound (itch)", "name_original": "Loot Hound (itch)", "description": "A scavenger hunt with your dog, what will you find today?\r\n<p>\n<strong>In<em> Loot Hound</em>,</strong> you play the role of a hoarder pack rat and collector of odd things that you find meaning in, and you've discovered a great way to find them; take a dog for a walk and see what it digs up!\r\n</p>\n<p>\r\n\tLoot Hound is a casual exploration game with elements of sim and strategy.\r\n</p>\n<p>\n<br/>\n</p>\n<p>\n<strong><br/>\n</strong>\n</p>\r\n\r\n\tKey Features:\r\n\r\n<p>\n<strong><em>132 loot items to start collecting, can you find them all?</em></strong>\n</p>\n<ul>\n<li>Each loot item you discover reveals a little about your character's history and personality </li>\n<li>Own up to three different dogs each with their own unique ability </li>\n<li>Control your dogs by extending, retracting and pulling on the leash when necessary </li>\n<li>Your dogs can detect, track, dig, be distracted, heel, wander, chase, be chased, break free, pee and become exhausted </li>\n<li>Upgrade your dog's skills including digging, detection, concentration, stamina and luck </li>\n<li>Explore twelve different parks from the small Muddy Backlot to the Titanic Botanic </li>\n<li>City Park Patrol are on the lookout, don't get caught digging up city parks </li>\n<li>What's landed in the Buxton Wheat Field?</li>\n</ul>\n<p><strong>Controller support </strong>-<strong> </strong>Loot Hound can be played using Xbox 360 and Thrustmaster GPX controllers</p>\n\r\n\r\nPress: \r\n<p>\"Loot Hound is a cute and casual RPG and the most realistic game I've played...\" <br/>PC Gamer <br/><br/>\"Loot Hound impressed me with its audiovisual design, overall approachable and friendly aesthetic, and genuinely enjoyable exploration mechanics.\" <br/>Swamp Ascension Corporation <br/><br/>\"The memorable mechanics and extraordinary charisma make Loot Hound such an easy recommendation. It settles perfectly between peaceful and exciting in a way that few casual experiences do and appeals far beyond that boundary.\" <br/>Pixelated Paradise <br/></p>", "metacritic": null, "released": "2016-03-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/81d/81d872f090eb3e9abea0791e76ce2839.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rhizome Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}