{"id": 968659, "slug": "brooks-in-wild-west", "name": "Brooks in Wild West", "name_original": "Brooks in Wild West", "description": "You are a modern young adult about to start your second year at university when you are suddenly sent back in time to 1896 Goldfield County. This place is constantly attacked by a dangerous bandit called Charlie Adams and his gang of scoundrels. You quickly learn that you will have to adapt or die, but luckily there are several beautiful girls willing to help you.<br/><br/><br/><br/>During your gameplay you will be able to perform functions such as working in the gold mines, riding horses, hunting bandits and animals and getting money to buy new guns and ammunition. You can also drink whiskey and play dice or blackjack in the Saloon. There is an interactive map for you to move around the different scenarios and visit the characters and places you like best.<br/><br/><br/><br/>The story is told in 5 chapters in a non-linear way (based on the choices you make), during the course of these scenes you will learn a lot about yourself and the people around you. Alternatively, you can have a romance with the girls you meet throughout the story, unlocking extra scenes and exclusive interactions with them. (Just one, or all of them. Depends on what you choose.)<br/><br/><br/><br/>Will you find a way to return home? Or will you get used to life in the west? <br/><br/><br/><br/>This game is a Visual Novel based on static images and short animations. The entire course of the story and interactions with other characters will depend on the choices you make during the game.", "metacritic": null, "released": "2023-10-29", "tba": false, "updated": "2023-11-03T16:17:08", "background_image": "https://media.rawg.io/media/screenshots/92f/92f7677cbb1166fd1cd9cb9a9a63140a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["PiggyNose Games"], "genres": ["Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["PiggyNose Games"], "esrb_rating": null}