{"id": 968660, "slug": "killing-bullet", "name": "Killing Bullet", "name_original": "Killing Bullet", "description": "You need to survive every round of enemy attacks, kill enemies to get rewards, buy props or extract stronger weapons to deal with stronger enemies, until you kill the last enemy. Enjoy the thrill of battle. How to play <br/>1. You need to kill every enemy you see<br/><br/>2.Each time you level up you will receive an enhancement point. You can use points to enhance your skills.<br/><br/>3. The enemy will attack multiple times. There will be a preparation period before each attack. You can replenish ammunition, draw weapons, and purchase props.<br/><br/>4. There will be more and more types of enemies, and it will become more and more difficult to kill. You need to obtain weapons of mass destruction as soon as possible to deal with more powerful enemies.<br/><br/>5. After killing the enemy, you will be rewarded with a random number of energy shard. The energy shard can be used to draw weapons and purchase props in the store.<br/><br/>6. The weapons you get each time are random, and you may get worse weapons. In the shop you can buy first aid kits, throwing weapons, special ammunition. Please allocate your energy shard reasonably<br/><br/>7. After the enemy starts attacking, the store and weapon box will disappear and will not appear again until you kill all the enemies. Ammo boxes will always exist to facilitate your timely replenishment of ammunition.", "metacritic": null, "released": "2023-10-29", "tba": false, "updated": "2023-11-03T16:18:14", "background_image": "https://media.rawg.io/media/screenshots/912/912a8c199aa4c560d1068dc5e314f0ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["逍遥_yw"], "genres": ["Action", "Indie"], "publishers": ["逍遥_yw"], "esrb_rating": null}