{"id": 968669, "slug": "sex-story-cuckold-life-episode-9", "name": "Sex Story - Cuckold Life - Episode 9", "name_original": "Sex Story - Cuckold Life - Episode 9", "description": "An erotic Visual Novel featuring high-definition graphics and realistic-looking characters set in beautiful decor. <br/>The story continues with Nikki and her husband meeting the Boss and his newest girlfriend for an unforgettable wild night. <br/>Will Yvette be everything they ever wanted?<br/>Will Adam feel comfortable being dominated by the Bull in front of a stranger?<br/>Follow their Sex Story and find out!<br/><br/><strong>GAME DESCRIPTION</strong><br/><br/>Meet Nikki &amp; Adam, and embark on their journey of spicing up their marital life in a brand new and wild cuckold Sex Story.<br/><br/>EPISODE 9<br/>A threesome is something Nikki always wanted to try but never had a real opportunity to do with Adam. So when the Boss asked her if she would be interested in adding a woman to their dirty little group, she said Hell yes!<br/>He knew just the right girl, and she knew just the perfect venue, so they set up a date to give this fantasy a try.<br/><br/>Nikki is anxious to meet the vixen, but Adam has his doubts. <br/>The Boss has been cryptic about the girl, and Adam isn't sure whether or not he told her about his cuckold fantasy. Not to mention, he has not experienced having a stranger's eyes on him while being on his knees.<br/><br/>Will Yvette be everything they ever wanted? <br/>Will Adam feel comfortable being dominated by the Bull in front of her?<br/>Follow their Sex Story and find out!", "metacritic": null, "released": "2023-10-30", "tba": false, "updated": "2023-11-03T16:28:52", "background_image": "https://media.rawg.io/media/screenshots/fd8/fd8441b10e3289079a42049341e6b6a3.jpg", "website": "http://www.exosyphen.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 1, "achievements_count": 2, "ratings_count": 0, "suggestions_count": 317, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["EroticGamesClub"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["EroticGamesClub"], "esrb_rating": null}