{"id": 968685, "slug": "haha-2", "name": "HaHa", "name_original": "HaHa", "description": "Destroy your enemies quickly if you want to.<br/><br/>Or play thoughtfully.<br/><br/>Dodge bullets coming towards you by jumping between platforms.<br/>Discover your own playstyle with different passive abilities and weapons.<br/><br/>Pay attention to the stones you throw. Unexpected stones can be surprisingly useful.<br/><br/><br/><strong>GUNS</strong><br/><br/>The rocket is a powerful weapon, capable of taking out multiple enemies at once,<br/>but it moves slowly. Play strategically to hit moving targets.<br/><br/><br/>Use the machine gun to eliminate multiple enemies at once;<br/>it's easier than killing enemies by throwing stones.<br/><br/><br/><br/>There are multiple characters in this game, each with their own strengths.<br/>You can manipulate time to your advantage,<br/>set up portals on walls to ambush enemies,<br/>and play with many other characters like these.<br/><br/><br/><br/>Each level features unique end-of-level monsters,<br/>and each level offers a different gameplay experience.<br/><br/>Enemies are multiplying and getting stronger. Best of luck on your journey to become the most powerful square!<br/><br/><br/><br/>-&gt; Different characters to customize your adventure<br/>-&gt; Numerous spells and weapons to enhance your fun<br/>-&gt; Kill them all and SURVIVE!<br/><br/>HaHa, a fantastic and entertaining horror game with rogue-lite elements, where your choices will quickly have a significant impact against hordes of approaching monsters. The enemies keep increasing in numbers and growing stronger. The circle is closing in, so become strong enough to save not only yourself but also your friends!<br/><br/>Join the fun adventure with your friends in this journey that feels like a bullet hell, where you can move comfortably with simple movement controls and wield customizable weapons.<br/>", "metacritic": null, "released": "2023-10-30", "tba": false, "updated": "2023-11-03T16:49:34", "background_image": "https://media.rawg.io/media/screenshots/462/46253481dd9d9c35c7da037e6814ec91.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["2E"], "genres": ["Action", "Adventure", "Strategy", "Casual", "Indie"], "publishers": ["2E"], "esrb_rating": null}