{"id": 968651, "slug": "fightcore-forge", "name": "Fightcore Forge", "name_original": "Fightcore Forge", "description": "\"<strong>Welcome to Fightcore Forge!</strong> For your entertainment, our AI-powered contestants will go head-to-head in adrenaline-pumping battles within the electrifying arena. With each riveting encounter, Fightcore Forge brings the future of combat sports to life, promising heart-stopping action that will leave you on the edge of your seat. Prepare to be amazed as the champions rise, and a new era of robotic warfare is forged before your very eyes!\"<br/><br/>A new industry has recently emerged in the world: multi-purpose fighting robots that need to be trained for warfare. How about creating new funds by turning this training into a show? You, as robots, will have to fight against each other to achieve the best performances!<h3>Gameplay</h3><br/><strong>Play in local multiplayer, with two to six players on a single keyboard. There is everything you need for a fun-filled experience with friends :</strong><br/>Whether you're playing 1v1 with five keys each or in a group of two to six players with only two keys, you can choose from a variety of arenas filled with teleporters, power-ups, and moving objects. Simply hop in and enjoy!<br/><br/><strong>Play in online multiplayer with three game modes, either with strangers or your friends :</strong><br/><ul><li>Duel allows you to fight in 1 versus 1 to determine who is the best!<br/></li><li>Contest is a team versus team game mode with three players per team. It requires more strategy and cooperation to achieve victory!<br/></li><li>Brawl is a free-for-all with up to eight players in the arena where you will test your skills against constant hostility!</li></ul><br/><strong>Discover the future of Fightcore Forge in the single-player story mode :</strong><br/>Pilot a robot in third person and explore the post-war world. As you interact with characters, choose which path you want your story to follow. Differentiate between your allies and enemies and continue to evolve as you gain new equipment, adding new mechanics to the arcade gameplay. It's a story adapted for every player and skills from casual to hardcore!", "metacritic": null, "released": "2023-10-30", "tba": false, "updated": "2023-11-03T16:05:41", "background_image": "https://media.rawg.io/media/screenshots/816/816bc9603b0431b78a78ae72342a427a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Snain"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Snain"], "esrb_rating": null}