{"id": 968712, "slug": "cats-on-duty-prologue", "name": "Cats on Duty: Prologue", "name_original": "Cats on Duty: Prologue", "description": "Welcome to <strong>Cats on Duty</strong>, the purr-fectly hilarious and action-packed ultimate blend of real-time strategy, tower defense, and match-3 mechanics, where heavily armed battle-hardened cat veterans of rodent skirmishes and yarn tangles take charge in defending their homeland (and litter boxes) against the forces of great evil! Unleash the power of the whiskers and drive those zombies back to the depths of the underworld!<br/><br/><strong>Cats on Duty: Prologue</strong> is the whole first chapter of the Cats on Duty containing the 10 captivating levels. Each level is a unique challenge and showcases a certain game feature. A minigame and a boss fight are also included in the prologue to make an introduction to the game even more exciting! It’s kind of a tutorial to show you the ropes of the game and prepare you for the more challenging levels.<br/><br/>Here you can try out the <strong>co-op mode</strong> with your friends or family. One player focuses on the tile-matching field of the game screen to win food needed to recruit and upgrade your battle cats while the other builds an unbreakable line of defense. Co-op mode can be easily activated or deactivated from the start menu or as you play.<br/><br/>With two difficulty levels (‘Kitten’\\’Cat’) available, you can adjust game difficulty on the fly should you find the current level too hard or too easy for your skills or mood.<br/><br/>It should be pointed out that your save files carry over into the main game so you can either continue from where you left off the Prologue or reset the game progress in the settings menu and start over!<br/><br/>In Cats on Duty: Prologue Some crucial changes were also made according to the feedback from our players:<br/><br/><ul><li><strong>Language auto-detect</strong> feature sets the game language according to the system language.</li></ul><ul><li><strong>Epic Battles:</strong>At the ‘Kitten’ difficulty level players can now choose the position of the cat tower after upgrading it. This way it’s easier to plan your defense.</li></ul><ul><li><strong>Game font is changed from Mono to Sans</strong> as the latter is more comfortable to read.</li></ul><ul><li><strong>New warning sounds and texts</strong> to notify player when there are no more swaps left on a tile-matching field.</li></ul><ul><li><strong>Improved settings menu design:</strong> bigger and highlighted navigation arrows.</li></ul><ul><li><strong>‘Show blood’</strong> on\\off button.</li></ul><ul><li><strong>Gamepad controls</strong> info in the Settings menu.</li></ul><ul><li><strong>Various English language</strong> localization improvements.</li></ul><br/>Get your paws on Cats on Duty now and let the cat-astrophe begin! And remember, in the world of Cats on Duty, some enemies may have nine lives, but they've never faced a cat army like yours before!<br/><br/>", "metacritic": null, "released": "2023-10-31", "tba": false, "updated": "2023-12-22T08:10:41", "background_image": "https://media.rawg.io/media/screenshots/c5d/c5d565ff55054f00de884e17448a5261.jpg", "website": "https://catsondutygame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 24}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Prikol Team"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["ESDigital Games"], "esrb_rating": null}