{"id": 968714, "slug": "the-hunters-journals-return-to-wight-chapel", "name": "The Hunter's Journals - Return to Wight Chapel", "name_original": "The Hunter's Journals - Return to Wight Chapel", "description": "The Crawling Horror is dead, but its legacy of madness lives on!<br/>\n<br/>\r\n  YOU are a hunter; a man or woman of wealth and leisure who has turned their time to hunting the fiendish monsters that assail humanity.  The conclusion of the adventure which began in Wight Chapel Dreams.  Return to the ash-choked alleys of Wight Chapel to hunt down the last traces of Pattic Claine's evil before they create a new nightmare for the cursed district.<br/>\n<br/>\r\n  A choose your own adventure novel in which your choices and actions can lead you to glorious victory...or ignoble defeat.  Explore an original story with three challenging game difficulties, unlock hidden lore to better understand the world you enter, and enjoy the artwork you discover in the gallery.<br/>\n<br/>\r\n  This independently produced novel features a dark soundtrack (with optional atmospherics) by Cryo Chamber, as well as over 40 unique page images to unlock. <br/>\r\n The text of the game has also been recorded by a professional musician and story-teller, making it into an interactive audiobook.  Combine your ancestral Heirlooms with the Traits system to customise your Hunter before taking on the horrors which await you.  Return to Wight Chapel is one of the most complex puzzles in the series to date, with time of day and other factors determining if you can reach the end or will fall short.", "metacritic": null, "released": "2023-10-31", "tba": false, "updated": "2023-11-03T17:26:18", "background_image": "https://media.rawg.io/media/screenshots/d51/d517dd533b7b12ac4ccc12b43042a561.jpg", "website": "https://www.grindwheelgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Grindwheel Games"], "genres": ["Action", "Adventure"], "publishers": ["Grindwheel Games"], "esrb_rating": null}