{"id": 968725, "slug": "feywing", "name": "Feywing", "name_original": "Feywing", "description": "\"Ever wonder how some folks always know where to go, and how to find what they need? Ever wonder what it'd be like to have the intuition that leads you out of harm and into safety? Would you like the ability to choose not just the safest path to a destination, but also the ability to avoid dangerous paths? If you're daring enough, there is a way to gain a supernatural sense of direction and finding your way around. Be warned, it's not safe. Some people trigger the ritual without intent, becoming another number in missing persons cases. Perhaps it is not a bad idea to know how it works in order to avoid it.\"<br/><br/>Feywing is a short game loosely inspired by classic internet ritual stories. As a participant of the Feywing ritual, you must memorize and navigate the strange environment of the Crossroads to collect materials, make effigies for the ritual, and find a way out of the Crossroads. During all of this, the whimsical Feywing will be there to guide you along.<br/><br/>Of course, the Crossroads is a strange, liminal world with dangers all around. In daylight, you may be safe. As night draws near, your worst enemy is the environment surrounding you...<br/><br/><ul><li>Multiple endings to discover.<br/></li><li>Randomly generated maps, relocating landmarks all around.<br/></li><li>No map, only your compass and landmarks to memorize the area.<br/></li><li>Survival hinges on attention to your surroundings. That tree behind you was further back a moment ago.</li></ul>", "metacritic": null, "released": "2023-10-31", "tba": false, "updated": "2023-11-03T17:39:14", "background_image": "https://media.rawg.io/media/screenshots/a35/a35d5c135bc1a212a302ff3a8cbf8f24.jpg", "website": "https://feywing.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Dinoleaf"], "genres": ["Adventure", "Indie"], "publishers": ["Dinoleaf"], "esrb_rating": null}