{"id": 968705, "slug": "the-queendom-of-lithzena", "name": "The Queendom of Lithzena", "name_original": "The Queendom of Lithzena", "description": "You are a young man that wakes up in a femdom isekai, Lithzena, a world full of monster girls, dominatrix and sexy women. You must find a way to survive, can you find a way home or would you rather be a pet forever?<br/><br/><br/><strong>Hardcore</strong><br/>The Queendom of Lithzena is a hardcore femdom game that is designed to focus on the domination theme. The game is packed with femdom lewd scenes, but vaginal and anal sex scenes are not the focus. This is not a gentle femdom game.<br/><br/><br/><br/><strong>HOT ADULT GIRLS</strong><br/><br/><br/>Mistress Therese<br/>Meet your new femdom waifu, Mistress Therese from the House of Discipline, she is the one that summons you and you will have to do anything she says, no matter how humiliating it is. <br/><br/><br/>Lithzena has multiple factions, and each faction has a different philosophy on how to destroy man and dominate them. Some of the factions might be working against you and your mistress, be careful!<br/><br/><br/>EVERYONE IS OVER 24, NO LOLI, NO SHOTA, NO ONE LOOKS LIKE A KID IN THIS GAME, NO KIDS, <br/><br/><strong>FEMDOM</strong><br/><br/>Engaging femdom lewd scenes, choose your choices wisely, this will have an impact on your character.<br/><br/><br/><strong>DEEP RPG GAME PLAY</strong><br/>BECOME AN INCUBUS, Customize your character, and embark on a journey through a gynarchy fantasy world. Collect powerful weapons, master deadly spells, dominate by hot women.<br/><br/><br/><br/>Customize your stats.<br/><br/><br/>Learn magic and skills.<br/><br/><br/>Loot, buy, and craft gears.<br/><br/><br/>Combined classes to build a character that suits you, and unlock different classes as the game progresses!<br/><br/><strong>HOT EPIC STORY</strong><br/>Powerful women from different factions are all trying to take control of Lithzena, how will you impact the story!?<br/><br/>", "metacritic": null, "released": "2023-10-30", "tba": false, "updated": "2023-11-03T17:16:37", "background_image": "https://media.rawg.io/media/screenshots/3a8/3a8187877eb6c7a2127ac59a8294d48f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 347, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["pk"], "genres": ["RPG"], "publishers": ["PΛIN KIŁŁ∃R"], "esrb_rating": null}