{"id": 968791, "slug": "melody-of-seasons", "name": "Melody of Seasons", "name_original": "Melody of Seasons", "description": "<strong>Live the farmer life in Melody of Seasons!</strong> Harvest tons of crops and raise livestock on your brand new farm! Uncover the mysteries of Melody Vale! Meet the locals and discover their stories - maybe you'll even meet someone extra special!<br/><br/><strong>Features:</strong><br/><ul><li><strong>Character Customization</strong>: Create your own unique looking character. Stand out in the way you want!<br/></li><li><strong>Farming</strong>: Harvest and tend to different crops for each season. Water your crops daily, and watch out for crows, insects, and weeds!<br/></li><li><strong>Mining</strong>: Mine for valuable ores and minerals in the local mine.<br/></li><li><strong>Fishing</strong>: Fish for different kinds of fish in different water sources &amp; seasons.<br/></li><li><strong>Foraging</strong>: Forage for various fruits and materials around the local environment.<br/></li><li><strong>Level up</strong> the various <strong>skills</strong> and <strong>tools</strong> to obtain <strong>new recipes</strong> and <strong>abilities</strong>.<br/></li><li><strong>Ranching</strong>: Purchase livestock including cows, chickens, ducks, sheep, pigs, and goats. Raise them from young to mature.<br/></li><li><strong>Crafting</strong>: Craft refiners to transform materials into more valuable materials. Craft sprinklers to automatically water your crops. Craft scarecrows and bat houses to ward off crows and insects. Craft auto fishers to automatically fish for you. Lay down nice pathways to spruce up your farm!<br/></li><li><strong>Social</strong>: Give gifts and fulfill the townsfolks' requests &amp; wish lists to make friends with them. Get to know their stories through cutscenes as you increase your heart level.<br/></li><li><strong>Marriage</strong>: If you desire, marry one of the NPCs! Whoever you want! They'll live with you on the farm and their schedule will change!<br/></li><li><strong>Baby</strong>: Have a baby with your partner!<br/></li><li><strong>NPC Schedules</strong>: NPCs have their own schedules which vary depending on the day and weather. If you marry an NPC he or she will have a schedule that includes your home and farm!<br/></li><li><strong>Ice Cream</strong>: Make Ice Cream for the locals or sell for profit!<br/></li><li><strong>Cooking</strong>: Learn yummy recipes to give as gifts to the locals or replenish your energy.<br/></li><li><strong>Town Hall</strong>: Renovate the Town Hall to help the local community and gain access to more energy and abilities.<br/></li><li><strong>Museum</strong>: Donate rare artifacts to fulfill the museum. Grandpa would be proud if you can find them all.<br/></li><li><strong>Festivals</strong>: Take part in festivals where you can get to know the townsfolk and participate in events such as the chicken race and Winter Ball.<br/></li><li><strong>Home Improvement</strong>: Upgrade your house for more space. Show Grandpa that you're doing well with his old farm.<br/></li><li><strong>Home Decoration</strong>: Change the flooring and walls in each room of your house for your own unique look.<br/></li><li><strong>Seasons</strong>: Enjoy 4 different seasons with different music, moods, colors, and weather effects.<br/></li><li><strong>Grandpa's Judgment</strong>: Do as well as you can so that Grandpa is proud of you. After 2 years, he will check up on you to see how you're doing!</li></ul><br/>Melody of Seasons is a <strong>Farming RPG</strong> and <strong>Life Sim</strong> featuring lots of harvesting, crafting, cooking, ranching, relationships, decorating, scavenging, fishing, mining, collecting, cooking, character customization and more! It is inspired by Stardew Valley and the classic Harvest Moon games as well as Story of Seasons. It's focused on delivering a relaxed and enjoyable experience that will brighten your day and make you smile. Sit back and relax as you collect and craft hundreds of items and grow your farm into everything Grandpa ever wanted! Seasons and weather changes deliver an ever-changing ambient experience. Design a beautiful farm and get to know the local community in this wonderful new world!<br/><br/>There's a lot to do in Melody of Seasons! Come start your new life on the farm!", "metacritic": null, "released": "2023-11-01", "tba": false, "updated": "2023-11-03T19:08:37", "background_image": "https://media.rawg.io/media/screenshots/130/130a9f1ba8e62dc4b1056352cd07d53a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mike Thielen"], "genres": ["RPG", "Simulation", "Indie"], "publishers": ["Mike Thielen"], "esrb_rating": null}