{"id": 968729, "slug": "godzilla-voxel-wars", "name": "Godzilla Voxel Wars", "name_original": "Godzilla Voxel Wars", "description": "<h3>Summary:</h3>From TOHO Games,  subsidiary of the company behind the Godzilla movie series, and the up-and-coming game studio Nukenin LLC<br/> (winner of the Google Indie Game Festival 2021 TOHO Games Award) comes a new strategy puzzle game! <br/><br/>Control Toho monsters as you save the world by repelling the invasion of the Fungoid mushroom menace! Progress through the stages to discover the truth behind these monster mushrooms!<h3>Key Points of this Game:</h3>▼ Defeat the Fungoids!<br/><br/>Control Toho monsters and battle against the Fungoids as they launch a global invasion! Combat foes through turn-based mechanics! The fewer turns you take to clear a stage, the more points you'll earn!<br/><br/>▼ Find the optimal strategy for each stage!<br/>Each of the six worlds includes multiple stages for you to take on. On each stage, you'll have to grapple with different monsters and try different approaches as you strive for victory. Repeat stages and aim to earn more points!<br/><br/>▼ Additional challenges!<br/>There are two sides to this world: the surface and what lies beneath. Once you've cleared the surface, put your skills to the test by attempting the more difficult underside. You can also build your own stages and share them for other players to try. Your ranking will increase as more players attempt stages you've created, so make a stage with your favorite monsters and share it with the world!<br/><br/>▼ An entirely original story!<br/>Why have the Fungoids come to invade our world? Why is Godzilla fighting on our side? Find the Investigation Reports scattered across various stages to unravel the mysteries behind this crisis.<br/><br/>TM &amp; © TOHO CO., LTD.", "metacritic": null, "released": "2023-10-31", "tba": false, "updated": "2023-11-03T17:44:35", "background_image": "https://media.rawg.io/media/screenshots/c54/c541b651d07856e975ab491cfc87f364.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 2, "achievements_count": 30, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["TOHO CO", "Nukenin"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["TOHO Co"], "esrb_rating": null}