{"id": 968715, "slug": "halloween-again", "name": "Halloween Again", "name_original": "Halloween Again", "description": "Prepare yourself for an adrenaline-pumping adventure in the game of  \"Halloween Again\" like no other as the chilling embrace of Halloween night descends upon the town. Panic and fear ripple through the streets as darkness falls, but it's not just any Halloween – it's a night like never before.<br/>\n<br/>\r\nWelcome to the spine-tingling thrill of a Halloween like you've never experienced before. The air is filled with an electrifying sense of impending doom as an eerie atmosphere sets the stage for the unknown. Ah, it's Halloween again, and this time, things have taken a terrifying turn.<br/>\n<br/>\r\nStep into a world teeming with anticipation, and join us for a hair-raising adventure. Have an insatiable craving for sweets but can't find your way to the candy store? Well, now's your moment to shine, channeling the athlete within you. But be warned, this is no ordinary night, and caution is your closest ally.<br/>\n<br/>\r\nWith every step you take, tread carefully, for this evening has unleashed a legion of the undead – zombies on the prowl, hunting for souls like yours. Trick them with your lightning-quick movements and seize as many sweets as you dare. The question is, will you stop in your tracks, or will you embrace the adrenaline rush and risk it all for the ultimate Halloween haul?<br/>\n<br/>\r\nGame Features:<br/>\n<br/>\r\n- Choose from 8 distinct characters, each with their unique abilities and skills.<br/>\r\n- Embark on a heart-pounding quest to collect as much candy as you can before the zombies close in.<br/>\r\n- An atmosphere of dread and excitement as zombies lurk around every corner, ready to pounce on unsuspecting candy seekers.<br/>\n<br/>\r\nThis Halloween, brace yourself for a night of spine-chilling excitement, where the line between panic and thrill is as thin as a spider's thread. Will you be the ultimate candy collector or become a ghastly snack for the lurking zombies? The choice is yours, and the adventure awaits.", "metacritic": null, "released": "2023-10-31", "tba": false, "updated": "2023-11-03T17:27:28", "background_image": "https://media.rawg.io/media/screenshots/5a1/5a1155d7b3ec2c6fa31988b40481ab3c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 302, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AFabrik"], "genres": ["Adventure", "Simulation", "Sports", "Casual", "Indie"], "publishers": ["AFabrik"], "esrb_rating": null}