{"id": 968720, "slug": "byle", "name": "BYLE", "name_original": "BYLE", "description": "Step into a world where the line between sanity and madness has been blurred by the malevolent force of BYLE. In BYLE, you are a mercenary on a mission to liberate the people from the clutches of this mind-controlling substance. Embark on a journey through the city consumed by chaos, as you battle hordes of twisted enemies, discover powerful weaponry and powerups, and take down the sinister BYLE.<br/><br/><strong>Fight Against the Corruption:</strong> Take on the role of one of many unlockable characters, each with their own stats and armed with the sole purpose of saving the city from BYLE's malevolence. Every playthrough is different as levels are procedurally generated and powerups are random.<br/><br/><strong>Multiple Game Modes:</strong> Choose your path to victory between the Save the City and Colosseum game modes. Save the City offers the traditional roguelike experience, traversing through procedural levels, collecting weapons and powerups, and taking on bosses. Colosseum offers wave-based combat where difficulty increases the longer you survive.<br/><br/><strong>An Arsenal of Destruction:</strong> Equip yourself with an extensive selection of powerful and unique weapons. Experiment with melee combat, firearms, and experimental BYLE-fuelled technology as you find the perfect weapon to suit your needs in combatting the corruption.<br/><br/><strong>Face Over 50 Unique Enemies:</strong> The city is brimming with enemies, once residents of the city but now corrupted and forced to fight in the name of BYLE. From mutated abominations to corrupted civilians, you will confront a diverse range of foes that will test your combat skills.<br/><br/><strong>Confront Powerful Bosses:</strong> Test your mettle against formidable bosses that guard the heart of the BYLE's corruption. These colossal adversaries will push your skills to the limit, demanding flawless combat techniques in order to come out on top.<br/><br/><strong>Discover Unique Powerups:</strong> As you delve deeper into the heart of the city, discover special powerups that will give you an edge in your fight against BYLE. These enhancements can change the tide of battle, allowing you to grow stronger or use powerful abilities that will help defend against the horrors that await.<br/><br/>Prepare to confront your worst fears, battle relentless foes, and liberate the city from the imprisoned by BYLE. Are you ready to become the hero this world desperately needs? Will you be the saviour that cleanses the city? Find out in BYLE.<br/><br/>Featured at Insomnia i70's Indie Zone", "metacritic": null, "released": "2023-10-31", "tba": false, "updated": "2023-11-03T17:33:42", "background_image": "https://media.rawg.io/media/screenshots/81a/81adf4ebbd53a87915be82e5e15b639f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 38, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["St Jarle"], "genres": ["Action"], "publishers": ["St Jarle"], "esrb_rating": null}