{"id": 968806, "slug": "perfect-landing", "name": "Perfect Landing", "name_original": "Perfect Landing", "description": "Embark on an adrenaline-fueled journey through the captivating universe of Perfect Landing, a 2D indie minimalist speedrun and race game that will push your skills to the limit. Take command of a sleek rocket ship and immerse yourself in the heart-pounding action of high-speed racing like never before.<h3>Race to Perfection:</h3>Strap in and prepare to soar from the launch platform to the flawless landing spot in record time. Navigate challenging environments, navigate cunning obstacles, and harness the power of physics to conquer each pulse-pounding level.<h3>Leaderboards and Asynchronous Multiplayer:</h3>Prove your worth on the global stage with the integrated leaderboard system. Compete against racers from across the globe as you vie for supremacy in each high-speed race. Ascend the ranks and solidify your dominance in the rocket racing cosmos.<h3>Unleash Your Creative Streak:</h3>Perfect Landing isn't just about conquering existing levels; it's about shaping your own destiny. Transform into a true rocket racing pioneer by designing and sharing your very own levels with the community. Challenge your friends and rivals to triumph over your ingenious creations, and watch as your designs come to life.<h3>Minimalist aesthetics, Maximum Thrills:</h3>Immerse yourself in the captivating minimalist art style that brings Perfect Landing's universe to life. Striking visuals and dynamic animations transform each level into a breathtaking canvas for your high-speed exploits.<h3>Key Features:</h3><br/>Engage in heart-pounding speedrun challenges as you pilot a rocket ship through intricate obstacle courses.<br/>Master levels with precision and ingenuity, employing physics-based mechanics to elevate your racing prowess.<br/>Climb the ranks of the global leaderboard in asynchronous multiplayer races, engaging in thrilling competitions with players around the world.<br/>Embrace your inner designer and forge custom levels that push even the most skilled racers to their limits.<br/>Immerse yourself in a visually stunning minimalist world that provides the perfect backdrop for adrenaline-pumping gameplay.<br/>Prepare for liftoff and redefine the essence of rocket racing excellence. Perfect Landing isn't just a game; it's a thrilling odyssey into the realms of speed, rivalry, and boundless creativity. Are you prepared to launch yourself to greatness?<br/><br/>Get ready to land perfectly - Wishlist <strong>Perfect Landing</strong> today!", "metacritic": null, "released": "2023-11-01", "tba": false, "updated": "2023-11-03T19:27:23", "background_image": "https://media.rawg.io/media/screenshots/965/965f7d59442485bd49d6a1b0f5b02530.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SLMStudio"], "genres": ["Racing", "Indie"], "publishers": ["SLMStudio"], "esrb_rating": null}