{"id": 968803, "slug": "genie-gym", "name": "Genie Gym", "name_original": "Genie Gym", "description": "Enjoy a playful new take on traditional physical games and transport yourself into a VR experience. The games that you know, and have played since childhood, have been reimagined into a gym-like arena, in the desert! Surrounded by an oasis environment under a starry sky; face-off with your opponent in a one-on-one match. The matches you can play with a friend are a twist on pool, tennis, ping-pong, bocce, and more. Explore the types of modes available and join with a friend to compete or relax. At the same time, move to win and exercise at the same time!<br/>\n<br/>\r\nDon't want to compete or just want to play solo? Practice mode, the single player mode, is available for you to face off against the AI with three difficulty settings to train your skills. Relax and beat the AI with no rush. This is an excellent mode to also practice what you've learned from the available tutorial videos. <br/>\n<br/>\r\nOnce you're ready, watch your victories stack up on the leaderboards. Burn calories or gently play to relax, either way there are many themes available for your preference of play as well. Stars, stone, and metal with their own sounds await your choice. <br/>\n<br/>\r\nDon't want to play random matches with others? The invite feature lets you host a match of your own choosing with a numerical invite code. Let your friend know your room and they will join you for a friendly match for a round of fun!", "metacritic": null, "released": "2023-11-01", "tba": false, "updated": "2023-11-03T19:22:55", "background_image": "https://media.rawg.io/media/screenshots/f6f/f6f431f72e46fffb8502c53bc2c1096f.jpg", "website": "https://twowolvesstudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Two Wolves Studio"], "genres": ["Action", "Sports", "Casual"], "publishers": ["Two Wolves Studio"], "esrb_rating": null}