{"id": 968879, "slug": "railed-up", "name": "Railed Up", "name_original": "Railed Up", "description": "Take part in deadly settlings of scores between rival electricity providers, inside futuristic tramways on suspended railways. In Railed Up, everything is upside down. You see the world from below, in order to give a better view of those endless railway networks as well as the oppressively enormous city through which your quest will lead you.<br/><br/><br/><br/>It's a multiplayer game for one to four players. A solo campaign will lead Iskhar on his way up the layers of the lower city, while he faces each electrical gang and discovers all the deadliest weaponry of their tramways. Each gang eliminated means having their arsenal at your disposal, a much needed help against what's coming.<br/><br/>The tone is very dark and violent, but tries at the same time to offer a dose of offbeat, cynical humor in its dialogues, which brings some lightness between the the ruthless confrontations.<br/><br/><br/><br/>The gameplay is \"on rails\", literally. You need to operate your tramway along the tracks of each arena, get ammunition as quickly as you can then shoot and destroy all your opponents in order to be the last one standing.<br/><br/>Its challenge is based on restricting the player both in his movements since he can only follow the tracks, and his firing which can only be done perpendicularly to the tramway trajectory – except for some special weapons. So the choice of positioning is crucial.<br/><br/>The first goal in every fight is to find ammunition, usually in the form of electricity leakages along the tracks, generating bright spheres of concentrated energy. A small sphere will provide you with one unit of electricity, while a large one will give you 5, with a limit of 20 that tramways can store. Leaks will only reappear when there's no more available.<br/><br/><br/><br/>Then the actual shooting can begin. The most basic weapon is the missile. Pretty straightforward, it only costs one electrical unit but only deals one damage out of the ten which make your healthbar. Once you have 5 units at your disposal, you may place a mine, which will explode and deal five damage to any enemy who runs into it, or you can shoot five short-range missiles simultaneously. The last weapon is different for every type of tramway but will always require 10 units in order to be triggered; its effects can go from defensive to extremely powerful.<br/><br/><br/><br/>The year is 2376. The world is now covered with miles high buildings. You live deep down in the lowest layer with your family, who's one of the main electricity providers of the area. In this forsaken place that the sun just barely reaches, a gang war wages between electrical compagnies. But that's not the reason why our young protagonist Iskhar has decided to pay a visit to his family's competitors. It's because of what they did to him years ago, which still affects his life.<br/><br/><br/><br/>Suspended tramways are the main means of transportation between the gigantic buildings which form the lower layers. Their network spreads everywhere, even within the buildings themselves. Many railways have been built by the inhabitants for convenience purposes, or because some hostile encounter lead to the destruction of the regular ones. So some are in better condition than others - which sometimes don't even have two ways, nor proper stations to exit.<br/><br/>Apart from the lack of sunlight, those lower parts of the city hardly get any rain either. The only source of water is the endless ocean at its feet, filled with all the waste falling from above. Needless to say, it's not really the most pleasant place to live, hence why everyone who can afford it, slowly migrates towards the upper layer, which inevitably needs to grow even higher, and leaves the bottom more and more desolated.<br/><br/><br/><br/>Iskhar is young and reckless. All he has in mind is revenge, but he doesn't realize the extent of the forces he's against. He just jumped into the first tramway he saw and embarked on some impetuous quest, or maybe a suicidal one. His ennemies made him what he is now, and this could either be a hopeless weakness or a strength that they'll regret.<br/><br/><br/><br/>While his older cousin Eliace shares his desire for retribution, he's aware that Iskhar's quest won't be quite as easy as he thinks, and he will try to guide him all the way up. Well established among his family of electrical engineers, Eliace has extensive knowledge in many different scientific fields, including the ones relating to weaponry. In fact, behind his intellectual facade, he's no stranger to using tramways as a means of defense.<br/><br/><br/><br/>Express Charge - \"You must have run into them before; they stroll everywhere, especially where we don't want them. In addition to their electrical services, they try to pass themselves off as some kind of police officers serving the bottoms, but everyone knows what they are. They prevent people from developing their own energy sources for alleged security reasons, and force them to subscribe to their services. Of course they pretend to be impartial by making sure everyone pays their bills, even those who have subscribed elsewhere, but their exorbitant fines are outright extortion.\"<br/><br/><br/><br/>D-tone Eight - \"They live near the water, at the very bottom of the city. Sorts of gigantic sewers. They get their current from tidal changes; not the most efficient but it seems to work out for them. They're mostly overload providers. It's a modified electricity that everyone injects through cables into the eyeballs - I hope you stay away from this. I wonder if people are still using them for less twisted electrical needs.\"<br/><br/><br/><br/>Light Circuit - \"Those guys, I don't know if there's still something human left under their circuits; they even replace parts of their brain with electronic devices. But in any case their services are effective, although a bit expensive. Oddly enough, these are the least creepy of the three suppliers, except that they consider themselves like a caste rather than a company. For my part they make me think of a cult.\"<br/><br/><br/><br/>The universe tries to blend different science fiction subgenres, including steampunk, tech-noir, dystopian fiction, etc. Graphics are entirely in 2D, using a mix of realistic shadings and textures with some hand-drawn elements - such as the characters' portrait animations. As for the musics, they're orchestral compositions with a distorted sound, in order to add a dramatic effect to the fights while reinforcing the impression of unease and technological nightmare.", "metacritic": null, "released": "2023-07-06", "tba": false, "updated": "2023-11-03T21:13:28", "background_image": "https://media.rawg.io/media/screenshots/900/90013a0bff678c59297dca2b6c209cbb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Absorb Reality"], "genres": ["Action", "Indie"], "publishers": ["Absorb Reality"], "esrb_rating": null}