{"id": 968816, "slug": "football-legend-2", "name": "Football Legend", "name_original": "Football Legend", "description": "Take over a professional American football team, in this single-player football management simulator. As both general manager and head coach, build a football dynasty that will last for decades to come. Trade, draft, sign free agents, and coach your way into the hall of fame!  Do you have what it takes to become a football legend?<h3>A Football Sandbox</h3>Football Legend drops you into a realistically modeled football universe. In this universe, you are head coach and general manager of a football team. You have total control over roster, personnel, and play calling duties.  Compete with the other AI coaches and try to become the greatest of all time.<h3>Build Your Roster</h3>Acquire a talented roster, with the very same methods the pros use:<br/><br/><br/><ul><li> Draft future stars in a pro-style, seven round draft<br/></li><li> Negotiate contracts with players using an extensive real-world contract system<br/></li><li> Craft trades that can include multiple players and/or draft picks<br/></li><li> Deal with the constant constraint of staying under the salary cap<br/></li><li> Apply a franchise tag to a player, to force keeping a player for one more year</li></ul><h3>Craft Your On-Field Strategy</h3>You have absolute control your on-field strategy. Take an unprecedented level of control over your team, with tools such as:<br/><br/><br/><ul><li> A full-blown, custom play creation editor. Design the right plays to leverage your strengths, and hide your weaknesses.<br/></li><li> A custom game plan editor. Set up exactly which plays you want to run, for every situation.<br/></li><li> A personnel package designer. Put your players into exactly the role they are suited for.<br/></li><li> A depth chart editor. Set your starters, and decide who your backups and replacements will be.</li></ul><h3>A Detailed Football Experience</h3>Football Legend strives to realistically model what it is like to be a part of a professional football league, including features such as:<br/><br/><br/><ul><li> A yearly all star game. See if any of your players were voted in by the fans<br/></li><li> Realistic player retirements.  Some players may retire early due to a severe injury, while some players may have a prime that extends well into their late 30's.<br/></li><li> Yearly hall of fame inductees<br/></li><li> Realistic player rating progression system. Some players will never develop. Some will have a quick peak and rapidly decline. Some will have long primes that last a decade.</li></ul><h3>A Deep Ocean of Stats</h3>If stats are your thing, then you have found the right game! Football Legend features extensive stat-tracking for players, teams, and coaches. There is never a shortage of statistics at your fingertips. You have instant access to:<br/><br/><br/><ul><li> Season and career stats for any player, current or retired<br/></li><li> Team stats<br/></li><li> League leaders<br/></li><li> Box scores for any game, past or present<br/></li><li> All-time stat leaderboards, for players and coaches</li></ul><h3>The Road To Early Access</h3>While Football Legend has been in development for awhile now, we are not quite ready for Early Access. We plan an Early Access release date in late 2023.<br/> <br/><br/>Add Football Legend to your Wishlist to keep up with our progress!<br/><br/>", "metacritic": null, "released": "2023-11-01", "tba": false, "updated": "2023-11-03T19:41:33", "background_image": "https://media.rawg.io/media/screenshots/6b0/6b0c6288be1eb63707930f738751b498.jpg", "website": "https://www.footballlegendgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Beefware"], "genres": ["Strategy", "Simulation", "Sports"], "publishers": ["Beefware"], "esrb_rating": null}