{"id": 968843, "slug": "destroy-the-monoliths", "name": "Destroy The Monoliths", "name_original": "Destroy The Monoliths", "description": "<strong>Destroy The Monoliths</strong> is a single-player real-time strategy tower offense roguelike where you explore a randomly generated map, mine the terrain to get resources, and build turrets to both protect your base and fight monoliths that keep spawning ever more minions. How many infested worlds will you manage to cleanse?<br/><br/><h3>EXPLORE</h3><br/>Discover <strong>procedurally generated maps</strong> with unique <strong>biomes</strong> (arid, volcanic, frost, ...) and <strong>shapes</strong> (dense, archipelago, river, ...). Enjoy a beautiful <strong>3D pixel art style</strong> with dynamic lighting. Find useful <strong>structures</strong> like treasures or shrines.<br/><br/><h3>MINE</h3><br/>Destroy <strong>blocks</strong> to collect tons of <strong>resources</strong>. Use different <strong>weapons</strong> to mine faster and more efficiently, or rely on automated buildings to get the job done for you.<br/><br/><h3>BUILD</h3><br/>Place buildings to <strong>protect your base</strong> and <strong>attack enemy monoliths</strong>. Combine and synergize buildings from four different categories: offensive, status effects, support and biome specials.<br/><br/><h3>FIGHT</h3><br/>Attack monoliths with your <strong>main offensive buildings</strong>. Protect your base from the enemy minions summoned with your other turrets. Use your weapons, shield and dash to fight alongside your turrets. <strong>Collect XP</strong> from damaged monoliths to <strong>get upgrades</strong>.<br/><br/><h3>UPGRADES</h3><br/>Get <strong>new weapons</strong> and <strong>new building blueprints</strong>. Get <strong>relics</strong> that enhance your stats and offer unique effects. Upgrades are acquired for a whole world so they carry over to the following missions. Leverage your new powers to face the increased dangers as you cleanse more sectors of the world.<br/><br/><h3>WORLDS</h3><br/>Play <strong>procedurally generated worlds</strong>. Unlock various <strong>packs of starting technologies</strong> to explore different playthroughs. Activate <strong>doomed relics</strong> to increase the difficulty and challenge yourself. Get <strong>achievements</strong>. Discover all the <strong>entries of your journal</strong>.<br/><br/>", "metacritic": null, "released": "2023-11-02", "tba": false, "updated": "2023-11-03T20:20:19", "background_image": "https://media.rawg.io/media/screenshots/1cb/1cb7b17b41ab1528483de9f531ea1461.jpg", "website": "https://radiantsloth.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Radiant Sloth"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Radiant Sloth"], "esrb_rating": null}