{"id": 968824, "slug": "tsukumogamizu", "name": "ツクモガミーズ！", "name_original": "ツクモガミーズ！", "description": "<strong>■ABOUT THIS GAME</strong><br/>GameMagazine, which has serialized many popular works such as \"Angels of Death\" and \"Tsugunohi,\" and \"TSUKUMOGAMIS!\" is now available on Steam!<br/>This is a school gag game with bizarre characters.<br/>The game contains a total of 82 complete episodes, each of which can be played in about 15 minutes!<br/><br/><br/><strong>■SYSTEM</strong><br/>It is an orthodox ADV in which the story progresses through exploration of the map, conversations with characters, and events.<br/>The player basically controls Sumika, the main character, to advance the story, but there is a part where the player moves to the \"World of Tsukumogami gods\" and switches control to Musubi.<br/>In addition, you can challenge yourself with various mini-games such as quizzes, puzzles, and actions, which differ from episode to episode!<br/><br/><br/><strong>■STORY</strong><br/>Musubi, born of a Tsukumogami god father and a mother of kotodama, is a half-human who is neither one nor the other.<br/>In order to become a full-fledged man, Musubi possesses the mouths of humans in order to collect as many \"good words\" as he can, but the girl he possesses, Sumika Yorishiro, is a communicator who has forgotten how to speak!<br/>Sumika is a reclusive, trashy JK who lives for chatting.<br/>If this situation continues, instead of collecting \"good words,\" Musubi will collect only \"bad words,\" and he will become an evil spirit!<br/><br/>Sumika meets Musubi and decides to go back to school.<br/>This is a <strong>not-at-all-heartwarming gag game about Musubi, Sumika, and the strange and bizarre friends they meet at the school! </strong>", "metacritic": null, "released": "2023-11-01", "tba": false, "updated": "2023-11-03T19:52:57", "background_image": "https://media.rawg.io/media/screenshots/b15/b15797b0bec5a2220e626154dc2b87f5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vaka Game Magazine", "水松茶 茶々留"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Vaka Game Magazine"], "esrb_rating": null}