{"id": 968855, "slug": "alterium-shift", "name": "Alterium Shift", "name_original": "Alterium Shift", "description": "Embark on a retro-inspired adventure with Alterium Shift, a classic JRPG featuring immersive 2.5D graphics and pixel art combined with modern gameplay. Choose from three unique characters, each with their own skills and elemental powers to explore the living world of Alteria. Engage in turn-based combat and fun mini-games like fishing as you uncover the secrets of this magical land and shape the outcome of the story with your choices.<br/><br/>With dynamic quests and branching storylines, Alterium Shift offers a new experience with every playthrough. Get ready for a journey through Alteria, where magic and mystery await you.<h3>Characters:</h3><br/><strong>Pyra:</strong> A strict and loyal leader, Pyra steers her team as straight as she does her spear.<br/><br/><strong>Atlas:</strong> A young, shy, and nimble Archer, Atlas delivers every shot with deadly accuracy.<br/><br/><strong>Sage:</strong> A very talented weaver of Alterium Essence, with an ego that matches their skill.<h3>On-Map Abilities:</h3>Each character will have an on-map ability that allows them to explore areas the others can't. For instance, Pyra can slice through rocks and Atlas and shoot far off targets. Find hidden treasure or even experience story based elements!<br/><br/><h3>Combat:</h3>Alterium Shift has a full featured turn-based combat system with a turn-order display for important decision making! Exploit enemy weaknesses and gain experience to grow your party into an unstoppable force! Charge up your Burst Bar for powerful burst abilities! Of course, the loot you earn will also help you a long your journey as well.<br/><br/><h3>Exploration</h3>Explore the world of Alteria. Meet new and diverse people. Find loot and hidden treasure! Take on new quests. Go fishing! The world is at your fingertips!<br/>", "metacritic": null, "released": "2023-07-05", "tba": false, "updated": "2023-11-03T20:40:46", "background_image": "https://media.rawg.io/media/screenshots/97e/97e3592e402e27b049406a5356786f48.jpg", "website": "http://www.alteriumshift.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 4}, "playtime": 3, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Drattzy Games"], "genres": ["Adventure", "RPG"], "publishers": ["GRAVITY GAME ARISE Co"], "esrb_rating": null}