{"id": 968925, "slug": "quantum-derelict", "name": "Quantum Derelict", "name_original": "Quantum Derelict", "description": "\"Quantum Derelict\" is a rogue-lite, story-driven survival horror game set on a ship that unpredictably leaps across the cosmos. In this chilling Lovecraftian inspired nightmare, your mission is to endure, gather resources to repair your spacecraft, and find intelligent extraterrestrial life that might aid in your return to Earth.<br/><br/>Stranded alone on a damaged spaceship, survival seems impossible. Yet, as the ship's resourceful engineer, you utilize scientific drones on board, repurposing them as resource gatherers to mine and salvage the materials surrounding you in the vastness of space. These adaptable drones are also capable of being recoded to undertake crucial tasks, such as repairing weapons, maintaining life support, and upgrading communications. The ship's artificial intelligence, Ada, is your companion and guide in this daunting journey to reach out to the seemingly infinite expanse of space in hopes of finding a savior.<br/><br/>However, the situation grows dire as sinister entities lurk in the interstellar darkness, tracking and hunting you. Your survival hinges on your ingenuity to outmaneuver the ominous cult of VUGSHERYOG and the unspeakable horrors trailing in its wake. The game charts a harrowing tale of a plunge into madness as you grapple with maintaining your sanity in the face of these alien horrors. Your personal journal logs all events, including data uncovered by Ada from the ship's mainframe, serving as a lifeline for your mental wellbeing.  It might even bear testament to your ordeal if your journey ends in disaster.<br/><br/>In \"Quantum Derelict\" you mine resources, repair the ship and try to retain your sanity. Evade the lurking horrors, find your way home, and, hopefully, tell your tale.<h3>FEATURES:</h3><br/><ul><li><strong>Unfolding Horror Story!</strong> - Play through a Lovecraftian inspired horror story as you are trapped on a derelict spaceship trying to find a way back home.<br/></li><li><strong>Survive!</strong> - Manage your ship’s systems and your personal health while you search for rescue.<br/></li><li><strong>Mine!</strong> - Mine space debris and salvage derelict ships at each point of space to gather resources for your drones to fix the various systems of your ship and provide you with the care you need.<br/></li><li><strong>Drones!</strong> - Manage a fleet of drones to help you survive and find rescue.  Your drone fleet is your lifeline.<br/></li><li><strong>Defend!</strong> - Defend your ship against the cult of VUGSHERYOG as they hunt you with your turret systems and a quantum pulse that will defeat any enemy ship.<br/></li><li><strong>Dynamic Cosmic Horrors!</strong> - Entities are aware of you.  They are tracking you.  They want to destroy you.  Run, fight, survive!<br/></li><li><strong>Craft!</strong> - Craft new drones to add to your inventory and recharge existing ones with a low battery.<br/></li><li><strong>Unlock new abilities!</strong> - As resources on the ships computer become available, code and upgrade new software for your drones to give them new abilities to help you survive!</li></ul>", "metacritic": null, "released": "2023-07-05", "tba": false, "updated": "2023-11-03T22:21:45", "background_image": "https://media.rawg.io/media/screenshots/625/625062f8837ce2aacff6bdeee8fb5236.jpg", "website": "https://maxgamingstudios.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Ravenwood Interactive"], "genres": ["Action", "Adventure", "Strategy", "Casual", "Indie"], "publishers": ["Max Gaming Technologies"], "esrb_rating": null}