{"id": 968972, "slug": "town-girls", "name": "Town Girls", "name_original": "Town Girls", "description": "<h3>Overview</h3><br/>Choose whether to be a boy or girl, what you choose will affect the story path in various ways with differing text and actions.<h3>Boy</h3><br/>You've just moved to a small town because your parents are divorcing and want to start making friends with the local girls, maybe attract a love interest.<h3>Girl</h3><br/>You're attending a university in a small town but you recently came out as Lesbian to your old friends and you're worried of what the animals in this new town will think.<h3>Main Goal</h3><br/>Your main goal is to get all of the girls in the town to like you so you can get pictures, have sex with them, and steal their panties. You keep a drawer full of girl's pictures, items, and panties back at your house which you can freely look at any time you want. You will achieve this goal by going on dates with the local town girls, asking them questions and being a \"good person\" towards them. You can date multiple girls at the same time and there's no limit to which way you finish the game.<br/><br/><br/><br/>An arctic fox who likes playing guitar and is into satanism. In her spare time, she plays in a band called the Arctic Foxes. Works as a web designer for Peta and designs the t-shirts for her band. She is very outgoing, sometimes too much in the sexual department - has been caught masturbating to her band mates countless times, she says it doesn't help that they're all boys and she's the only girl. Secretly has a crush on the bass player, but doesn't know how to tell him.<br/>Visit their ClopPad profile: https://cloppad.com/profiles/satansqt_vi0.php<br/><br/><br/><br/><br/>A shy tabby cat who likes to read and keeps to herself. She works at the local convienience store and doesn't have many friends. Sometimes can't be arsed to put on underwear or lower-half clothing when going to work. She has been caught once when she was bending over to pick up a shelf item, but has yet to get fired for it, her best guess is that her boss likes her.<br/>Visit their ClopPad profile: https://cloppad.com/profiles/s3cr3tlyR3AD1N_.php<br/><br/><br/><br/>A red fox who likes to draw animal hentai and masturbate. She mostly spends her time at home where no one can see her, but sometimes likes exhibitionism. Does not like showing her breasts/feels embarrassed by them. Secretly likes storing her \"own brew\" in water bottles and doesn't throw them away. Visit their ClopPad profile: https://cloppad.com/profiles/gla55drawz_BK.php<br/><br/><br/><br/>- 16 dateable characters (3 already available!)<br/><br/>- 3 state time cycling (morning, afternoon and evening).<br/><br/>- Time skipping so you can date girls instantly, even if it's the wrong time.<br/><br/>- During the dates you will be given mini-games to complete so you can complete the date.<br/><br/>- Unlock and view photographs that girls give you in the gallery.<br/><br/>- Head to the local public toilets to peak on girls. (Coming Soon!)<br/><br/>- View your date progress using the clipboard in the hub.<br/><br/>- Point &amp; Click around various places you visit.<br/><br/>- Revisit places you've visited to collect items you've missed.<br/><br/>- Find collectables on dates and stash them in your drawer for later use.<br/><br/>- Hand-drawn assets made in Paint Tool SAI.<br/><br/>- A beautiful soundtrack fully composed by us.<br/><br/>Visit the in-game website: https://cloppad.com/<br/><br/>Join the Telegram: https://t.me/+KFLQNlKui3o2YzNk<br/><br/>Join the Discord: https://discord.windowslogic.co.uk<br/><br/>Support our work on Patreon: https://patreon.com/belliescolourcorner and get high-res versions of the assets used in our games, music, art and more!<br/><br/>You can also leave a review to say what you think about Town Girls!", "metacritic": null, "released": "2022-12-05", "tba": false, "updated": "2023-11-03T23:23:51", "background_image": "https://media.rawg.io/media/screenshots/c12/c12aea7be5fb1240eaa2f617925625d9.jpg", "website": "https://windowslogic.co.uk/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 269, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["WindowsLogic Productions"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["WindowsLogic Productions"], "esrb_rating": null}