{"id": 968968, "slug": "yi-xian-the-cultivation-card-game", "name": "Yi Xian: The Cultivation Card Game", "name_original": "Yi Xian: The Cultivation Card Game", "description": "<h3>Cards Building</h3><ul><li>You will draw a lot of cards on the path of cultivation.<br/></li><li>You need to choose the appropriate cards from them and build your deck.<br/></li><li>Exert biggest power of your cards by combining and collocating them.</li></ul><h3>Sub-Profession</h3><ul><li>In each game, you can choose a Sub-Profession.<br/></li><li>Each Sub-Profession has a set of exclusive cards.<br/></li><li>The same character can build different deck by matching different Sub-Profession, and obtain different game experiences.<br/></li><li>The mechanism of Character plus Sub-Profession can greatly increases the playability.</li></ul><h3>Destiny</h3><ul><li>Destiny is the gift of fate that the character receives on the path of cultivation.<br/></li><li>Every time you break through, multiple Destiny options will appear randomly according to the sect and character you choose. You need to choose your Destiny.<br/></li><li>The effects of Destiny are various, including card drawing, attribute increasing, and various passive effects, etc. Some Destines even require you to build a deck according to their effects.</li></ul><h3>Opportunities</h3><ul><li>On the path to cultivation, opportunities are also a part of strength. After each battle, there is a very small chance to encounter an Opportunity card.<br/></li><li>Through Opportunity cards, you can get Spiritual Pet cards, Talisman cards and Guild Secret Spell cards.<br/></li><li>These cards are very rare, and their strength may be similar to the regular cards of the same rank, but they often bring you new building ideas and help you create unique and rare decks.</li></ul><h3>Battle with Other Players</h3><ul><li>Each of your opponents are other players online, and everyone builds a deck from scratch.<br/></li><li>Every battle with your opponent will test your deck’s strength, and you will be eliminated if you lose multiple battles.</li></ul><br/>Devise strategies, climb to the top of cultivation, and wait for you to battle!", "metacritic": null, "released": "2022-12-06", "tba": false, "updated": "2023-11-03T23:18:16", "background_image": "https://media.rawg.io/media/screenshots/9cf/9cf0c285034ac24b1eace77d587131bd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 27}, "playtime": 22, "achievements_count": 34, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["DarkSun Studio"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Gamera Games"], "esrb_rating": null}