{"id": 968904, "slug": "deck-of-life-no-turns-individual-card-permadeath", "name": "Deck of Life: No Turns, Individual Card Permadeath", "name_original": "Deck of Life: No Turns, Individual Card Permadeath", "description": "<h3>Unblocked Enemy Attacks Permanently Remove Cards From Your Deck</h3>Enemy attacks destroy cards from your deck and they are not available in the next encounter.<h3>Protect your Cards while Destroying your Opponent's Hand</h3>Play cards on your side of the field to launch projectiles or construct defenses. Draw new cards from your deck automatically at an upgradable rate.<h3>Survive Each Run</h3>The cards in your hand are always physically on the field and can be attacked at any time with projectiles. You defeat the enemy if you destroy all the enemy's cards on the field. Your run ends if all your cards on the field are destroyed. <br/><br/><br/><h3>Choose Cards to Reinforce your Deck's Strategy</h3>As you clear enemies and events your deck gains cards unique to the floor. Each floor has a unique pool of cards that work well together.<h3>Choose a Path to Control your Deck's Evolution </h3>Each level you have a choice of 2 floors with a unique card pool. You always have the option to continue acquiring cards of the same type or to branch off into a different random card type. As you clear levels the random floors increase in difficulty.<h3>Unlock New Starting Decks</h3>Every floor you defeat you gain a new deck that you can start a run with. This new deck has cards specific to the floor's unique cards.<br/><br/><br/>", "metacritic": null, "released": "2023-07-04", "tba": false, "updated": "2023-11-03T21:51:58", "background_image": "https://media.rawg.io/media/screenshots/715/715602f1e913bf147f937e4c6db7cca5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Home Fire Games"], "genres": ["Strategy", "Indie"], "publishers": ["Home Fire Games"], "esrb_rating": null}