{"id": 968949, "slug": "jing-zhui-zheng-jiu-zhe-neck-savior", "name": "颈椎拯救者 Neck savior", "name_original": "颈椎拯救者 Neck savior", "description": "Introduction:<br/>\r\nA motion-sensing game, only needs a common USB camera, splendidly turns your computer into a fancy motion-sensing game station!<br/>\r\nProvides keyboard mode and motion-sensing mode. Through the keyboard mode, one can familiar with the gameplay. The motion-sensing mode will first open the camera of your computer which plays the role of sensor, swing the body or your head from side to side to control the movement of the little rabbit, with a smile to fire bullets to attack the her enemies!<br/>\r\nFor those who sit in front of the computer through the day, use this game to relax your body and sport your neck for saving your cervical vertebrae!<br/>\r\nFor those who don't have warmer at home or office, use this game to burn your fat and generate heat from it!<br/>\n<br/>\r\nInstructions:<br/>\r\n1. Keyboard mode: Press the direction key to control movement, press the space bar to launch bullets;<br/>\r\n2. Motion-sensing mode: First, make sure your computer is connected to a camera (USB camera or laptop camera). After entering the motion-sensing mode, the camera will automatically turn on, move your body or your head from side to side to control the movement, and fire bullets by a smiling face.<br/>\n<br/>\r\nFeatures:<br/>\r\n1. With the deployed computer vision algorithm, the camera can intelligently recognize the player's position and expression to control the protagonist's movement and firing bullets;<br/>\r\n2. Hand-drawn cartoon images, easy and lovely, help you to relax;<br/>\r\n3. Without high-end hardware, a computer with i3 CPU plus an ordinary camera can be happy to play.", "metacritic": null, "released": "2022-12-07", "tba": false, "updated": "2023-11-03T22:53:35", "background_image": "https://media.rawg.io/media/screenshots/aad/aad799d7f999667d7bfd0ae628560f41.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GXY"], "genres": ["Casual"], "publishers": ["GXY"], "esrb_rating": null}