{"id": 968944, "slug": "touchdown-girls", "name": "Touchdown Girls", "name_original": "Touchdown Girls", "description": "Your future awaits at Brigham University, an institution of higher learning known mostly for it's raging parties and beautiful female students! Embark on this epic adventure in a story-rich experience features hundreds of high resolution 1920x1080 still and animated shots (mostly naughty ones), and a detailed 3D rendered world, filled with collectible high resolution CG Centerfold galleries, booty calls, and an abundance of fun secrets and mysteries to uncover.<br/><br/><br/>The story follows an up-and-coming college football player, Mike Mueller, eager to become the starting quarterback for the Brigham Hornets. Along the way, he  will discover the ins and outs of Brigham University as well as earn the affection from the student body including 6 beautiful women. Touchdown Girls is a CG visual novel that contains detailed 3D rendered environments including study halls, libraries, classrooms, 100,000 seat football stadium, locker rooms, student dorms and of course secret sororities. Progress through the story to unlock special high resolution centerfold and still galleries of all the Touchdown Girls.<br/><br/><br/>Touchdown Girls features an epic story, spanning hours of detailed narrative, with fully animated scenes along the way. Become immersed in a sexy, yet compelling story with many twists and turns that will keep you wanting more. Each of the female characters in the game includes a NSFW 18+ fully animated sex scene that moves the story forward are rewards you for uncovering the secrets of Brigham University. <br/><br/>Touchdown Girls also includes a full game save system that allows you to continue from any place in the game that you have unlocked as well as other visual novel features such as autoplay, skipping, and story rewind. There is no shortage of action, lust, and drama to be found in Touchdown Girls. A truly one of a kind narrative experience!", "metacritic": null, "released": "2022-12-07", "tba": false, "updated": "2023-11-03T22:43:49", "background_image": "https://media.rawg.io/media/screenshots/808/808a0670dfa02af7de7c89414ffc5683.jpg", "website": "https://www.entropyadultgames.com/touchdowngirls", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 490, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Entropy Digital Entertainment"], "genres": ["Adventure", "Sports", "Casual"], "publishers": ["Entropy Digital Entertainment"], "esrb_rating": null}