{"id": 968924, "slug": "neon-parkour-2-2", "name": "Neon Parkour 2", "name_original": "Neon Parkour 2", "description": "Control a blue cube and complete challenging trails and puzzles to reach the target!<br/><br/>Watch out for platforms that fade when you press on them, red cubes that will destroy you the moment you touch them! Help the blue cube reach its destination in Neon Parkour, which has a minimal design. Jump, dash and swing to solve challenging trails!<br/><br/><br/><br/><strong>Harder, Faster, Better, Same Price</strong><br/><br/>With the same price as the first game, Neon Parkour 2 is even harder than the first game, which everyone says is very difficult! However, we have made the game more fluent and faster. And we’ve put Neon Parkour 2 in a situation where you’ll want to try your luck again instead of getting bored and shutting it down.<br/><br/>One of our biggest mistakes in the first game was that it took a long time to reload the level after death and the trails were not suitable for fast gameplay. In Neon Parkour 2, you are reborn as you are dead now and you don’t expect to be among the levels at all. We are also developing new trails by making them suitable for fast gameplay! <br/><br/><strong>For Both Challengers and Speedrunners</strong><br/><br/>If you are a fan of speedrunning, Neon Parkour 2 is the game you are looking for! See your stats with in-game time and death counters, and play again for a better score on your next try!<br/><br/>One of the upcoming innovations with Neon Parkour 2 is Challenger Mode. In challenger mode, a mode that pops up once you’ve finished the game, we’ve packed the entire game into a single scene. In this way, it will be possible to finish the game from zero to the end without any interruptions. The challenge is that there are only 1 checkpoints per 5 levels in this mode!<br/><br/><strong>Decorate Your Steam Profile</strong><br/><br/>You can use the achievements you will earn at the end of each episode to enhance and decorate your Steam profile!<br/><br/><strong>Control Is In Your Hands</strong><br/><br/>We've introduced some minor improvements to the game so you can play Neon Parkour 2 the way you want, and we've made some changes to some of the systems in the first game:<br/><br/>1) Visuality: If you think the visual style of the Neon Parkour 2 can make you tired, don’t worry! In the settings, you can make the visual as simple as possible or increase the value of the visual effects!<br/><br/>2) Camera: In the first game of Neon Parkour, the distance of the camera was constant. In NP 2, we left the camera distance control to the player. You can zoom in and out of the camera in any part of the game.<br/><br/>3) Music Player: We have replaced the music player that existed in the first game and made it more functional. We added more music options to the game and made sure that they were not a headache when they played for a long time while making the game musics.", "metacritic": null, "released": "2023-07-06", "tba": false, "updated": "2023-11-03T22:20:23", "background_image": "https://media.rawg.io/media/screenshots/c70/c70756363fcbd3880d2aece444b53bce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aquila Games Mini"], "genres": ["Casual", "Indie"], "publishers": ["Aquila Games"], "esrb_rating": null}