{"id": 969, "slug": "pocket-rpg", "name": "Pocket RPG", "name_original": "Pocket RPG", "description": "Nominated for GameSpot&amp;#39;s &amp;quot;Best mobile game of 2011&amp;quot;! Was one of the top five!<br/><br/>Works for both iPhone/iPod Touch and iPad.<br/><br/>Follow cm_games on Twitter for more updates on Pocket RPG and all of Crescent Moon Games other titles. Aralon and Gears are on sale now!<br/><br/>Enter a world overrun by hordes of monsters. Explore trap-filled dungeons and face mighty bosses. Collect piles of treasure and items and invest in dozens of abilities and unlockable equipment. Test your skills against the oncoming darkness.<br/><br/>Pocket RPG is a dual-stick action dungeon-crawler. In it you can choose from three distinct classes, each with their own combat style.<br/><br/>The Blade Master:<br/>A duel wielding melee specialist. He survives by clearing swathes of enemies with each of his mighty strikes. He has devastating special moves which skillful players will be able to use to decimate their foes.<br/><br/>The Dark Ranger.<br/>A deadly archer who can summon waves of arrows that bounce, seek and split. Perforate your enemies with dense walls of arrowy death.<br/><br/>The Battle Mage<br/>A powerful, but fragile, nuker who controls the forces of fire, ethereal, ice and lightning to obliterate groups of enemies. Charge up her spells to critical levels and unleash maximum destruction.<br/><br/>Each quest in Pocket RPG is a new adventure. The hero starts at level zero with an empty sachel and collects items and rapidly builds their strength to dizzying proportions. Pocket RPG is not a &amp;quot;my numbers beat your numbers&amp;quot; game. Items matter and the way you use them is even more important.<br/><br/>Pocket RPG provides hours of fantasy hack &amp;#39;n slash mayhem. And there are Game Center achievements and leaderboards if you do manage to make it to the end.<br/><br/>Expect updates with new content as well as gameplay improvements and fixes. We are working hard to give you the best experience we can.<br/><br/><br/>Features<br/>- Full iPad iOS Support<br/>- Random level generation.<br/>- Amazing stylized 3D environments, monsters and characters.<br/>- 3 Character classes 3 different playing styles.<br/>- Dual stick for moving and attacks.<br/>- Automatic skills/stat progression based on the items your character equips.<br/>- Lots of Looting.<br/>- Swarms of creatures to take out with devastating combo moves.<br/>- Boss encounters.<br/>- Leader Boards, Achievements and Unlockables.<br/><br/>Follow us for the latest info and game news!<br/><br/>• http://crescentmoongames.com/other-games/<br/>• http://facebook.com/crescentmoongames<br/>• http://twitter.com/cm_games", "metacritic": null, "released": "2011-07-14", "tba": false, "updated": "2019-10-22T14:37:23", "background_image": "https://media.rawg.io/media/screenshots/f66/f667fab673e6f87da373a70aa3530e06.jpg", "website": "http://crescentmoongames.com/other-games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 10, "beaten": 2}, "playtime": 0, "achievements_count": 26, "ratings_count": 1, "suggestions_count": 285, "game_series_count": 0, "reviews_count": 2, "platforms": ["PS Vita", "Android", "iOS"], "developers": ["Crescent Moon Games", "Tasty Poison Games"], "genres": ["Action", "Adventure", "RPG", "Arcade"], "publishers": ["Crescent Moon Games"], "esrb_rating": "Everyone 10+"}