{"id": 969087, "slug": "delusions-of-a-lost-soul-2", "name": "Delusions of a Lost Soul", "name_original": "Delusions of a Lost Soul", "description": "<strong>Delusions of a Lost Soul</strong> is a short adventure-mystery game that features puzzle-based dungeons and an immersive story with horror elements. Encounter the castle’s many spirits as you navigate your way through on your search for your partner, Ralph.<br/><br/><br/><br/><strong>FEATURES:</strong><br/><br/><ul><li>Delusions of a Lost Soul is a short, story-rich game.<br/></li><li>Atmospheric environments with beautiful 2D pixel art graphics and detailed lighting.<br/></li><li>Navigate the dark corridors of the castle using your trusty flashlight.<br/></li><li>Solve puzzles using items you find.<br/></li><li>Free the trapped souls you come across. Some may not be so friendly.</li></ul><br/><br/><br/><br/><strong>STORY:</strong><br/>Benjamin Farwell is a retired Paranormal detective. He and his partner, Ralph Hudson,  were experts in removing trapped souls from places all over the world. Having achieved great success and wealth, Benjamin was ready to retire from investigations, but Ralph wanted to do one last job together: Lansinet Castle. <br/><br/>They knew it was infamously host to hundreds of trapped souls, and anyone who dared venture inside never returned. Nevertheless, they bravely  sought out to find the truth and help release the spirits. Before they were able to complete their quest, Ralph was mysteriously killed, his soul trapped in the castle. Benjamin managed to escape with his life, but could hardly remember any details of the night. This troubled him to no end. He vowed to quit paranormal investigation for good. <br/><br/>Years later Benjamin suddenly felt Ralph’s spirit calling out to him from the castle. He was still there, enduring endless agony. Benjamin reluctantly returns to the castle in search of Ralph’s soul so he can finally put this memory to rest. Can Benjamin manage to survive the castle and unravel its many mysteries? Or will he fall victim like so many before him? There’s only one way to find out: head inside.<br/><br/>", "metacritic": null, "released": "2022-08-30", "tba": false, "updated": "2023-11-04T02:06:39", "background_image": "https://media.rawg.io/media/screenshots/f56/f56a1ec900776309663c1240da6150da.jpg", "website": "https://www.fathomquest.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["FathomQuest Games"], "genres": ["Adventure", "Indie"], "publishers": ["FathomQuest Games"], "esrb_rating": null}