{"id": 969001, "slug": "sex-adventures-swingers-cabin", "name": "Sex Adventures - Swingers Cabin", "name_original": "Sex Adventures - Swingers Cabin", "description": "An explicit erotic visual novel following the story of two friends swapping their lovely bisexual girlfriends after their casual game of truth or dare turns wild.<br/><br/><strong>Visual Novel Description</strong><br/><br/>Adam and Mike go way back. <br/>Their relationship might have started as a highschool rivalry, but it soon morphed into a beautiful friendship that lasted over the years. Whether it be a crammed condo in college, a cheap car or a wild hook-up in a dirty bar restroom, the boys used to share everything. That was until they met the girls of their dreams and decided to settle down, each at their own beautiful house, but sadly on opposite sides of the state.<br/>They don’t get to see each other as much as they want these days, but that doesn’t stop them from planning short getaways with their girls whenever their busy schedule allows them to. Fortunately, the ladies adore each other almost as much as they do.<br/><br/>The recent weekend finds them together at a beautiful cabin up in the mountains, where they decide to play a game of Spin The Bottle - Truth Or Dare, for old times sake. Awkward truths turn into inciting dares…and soon enough, the boys come with an interesting offer for the girls: to swap their partners and enjoy their bodies for the rest of the night…<br/><br/>Will the girls be interested in swapping their men?<br/>Follow the story and find out…<br/><br/><strong>Features</strong><br/><br/>- 50+ HD renders<br/>- Animations", "metacritic": null, "released": "2022-12-06", "tba": false, "updated": "2023-11-04T00:04:24", "background_image": "https://media.rawg.io/media/screenshots/689/6898819d24a63745edfab3e4fc00d363.jpg", "website": "http://www.exosyphen.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EroticGamesClub"], "genres": ["Casual", "Indie"], "publishers": ["EroticGamesClub"], "esrb_rating": null}