{"id": 969032, "slug": "rimward-basilisk", "name": "Rimward Basilisk", "name_original": "Rimward Basilisk", "description": "<strong>- Rimward basilisk is a precursor, inferior version of [Black Beacon Hill] </strong><br/> https://store.steampowered.com/app/2641070/Black_Beacon_Hill <br/>Development of Rimward Basilisk has been stopped. If you are interested in this game, or had played it before, i invite you to check out [Black Beacon Hill] instead. It contains entirely new story content and stages as well as completely reworked content of this game. <br/><br/><br/>~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/><br/>The 5 year war between Ulstania and Kostakovia was interrupted when the cyberweapon AI [Hellion] went out of control, and with its hordes of hijacked war machines, began to indiscriminately slaughter all human life within reach.<br/>  The resulting pandemonium reduced the two military superpowers into a scattered and orderless wave of desperate survivors in an all out scramble for escape as the mindless mechanical swarm chases from behind.<br/>  Caught amidst the chaos, the acting captain of Ulstanian submarine Rimward Basilisk made the drastic decision to rescue and cooperate with a retinue of Kostakovian soldiers. Gradually, the whole world closes in on them.<br/><br/><br/><br/>Features:<br/> - <strong>Esoteric and uniquely designed combat</strong> with <strong>extremely</strong> minimalistic controls.<br/>In this game, <strong> You have no control over the timing of any and all attacks, movements, and actions. They are all scripted (and timed to the soundtrack). The only control is aiming these actions with your mouse movement</strong> (not even mouse clicks)<br/>In each stage, you play as a specific character(s) each with their own unique attacks, abilities, and movement patterns. Enemies will also have a wide variety of actions and approaches against you. Expect extremely fast paced real time combat where you are constantly attacking, dodging, and countering everything that comes your way.<br/><br/> - A unique soundtrack for each and every stage by composer Chris Jay.<br/><br/> - There's a visual novel too. Expect a linear character driven story that plays out in between the combat stages.<br/>Visually, the art is hand drawn with an anime aesthetic, but the story leans more towards western media inspirations than anime.<br/>Due to it's scripted nature, the events of the combat stages are highly intertwined with the events of the story, so it is <strong>highly recommended</strong> to not skip the story... <br/>For those who are here just for the story, there is a story mode difficulty that makes you nigh invincible in the combat stages.<br/><br/> - New parts will be added.<br/>Each part will progress the story, introduct new characters and new combat mechanics.<br/><strong>Parts 1, 2, 3, and 4 (arc 1) will be released as free updates. </strong> Parts beyond that will be in the form of DLCs of ~4 parts each.", "metacritic": null, "released": "2022-12-07", "tba": false, "updated": "2023-11-04T00:54:45", "background_image": "https://media.rawg.io/media/screenshots/724/7243af46847a467f4dd870b6f25a26a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nowaki"], "genres": ["Action", "Indie"], "publishers": ["Nowaki"], "esrb_rating": null}