{"id": 969013, "slug": "space-shells", "name": "Space Shells", "name_original": "Space Shells", "description": "<h3>Add to wishlist</h3><br/><br/><strong>Space Shells</strong> is a rogue-lite sci-fi VR game following an intergalactic mercenary tasked with hijacking a fleet of stunningly designed spaceships. Eliminate enemy droids, making clever use of specialized robotic shells to complete each treacherous mission. Experience immersive gameplay with a story generated and shaped by the actions you take on every ship. Execute impressive maneuvers that will make you feel like the hero of a real space adventure.<br/><br/><br/><br/><strong>Randomly generated missions!</strong><br/>Endlessly respawn and begin each playthrough with a new shell and mission, hunting down enemies at different posts across a freshly generated spaceship.<br/><br/><strong>Choose your difficulty!</strong><br/>Up the ante and test your skills by adjusting the difficulty of a mission from smooth sailing to nightmarishly hard.<br/><br/><br/><br/><strong>Reveal secrets of the trans-galaxy corporation!</strong><br/>Dismantle corrupt powers one ship at a time, unlocking new weapons and shells along the way to assist in more challenging missions.<br/><br/><br/><br/><strong>Break into spaceships!</strong><br/>Crush your enemies to pieces with an arsenal of weapons or your bare fists. Upgrade the weapons and shells at your disposal to increase your strength and make your character even more lethal.<br/><br/><br/><br/><strong>Be Cautious!</strong><br/>You’re surrounded with highly combustible elements. One poorly aimed grenade or a stray shot too close to the fuel barrels can cause you to start a new life from the beginning.<br/><br/><br/><br/>Stunning graphics powered by <strong>Unreal Engine</strong>.<h3>Let the space journey begin!</h3>", "metacritic": null, "released": "2022-12-06", "tba": false, "updated": "2023-11-04T00:23:53", "background_image": "https://media.rawg.io/media/screenshots/672/672041d7107d88b93beeec889acddb06.jpg", "website": "https://www.mobirate.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 375, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mobirate"], "genres": ["Action", "Indie"], "publishers": ["Mobirate"], "esrb_rating": null}