{"id": 969011, "slug": "amber-battle-royale", "name": "AMBER Battle Royale", "name_original": "AMBER Battle Royale", "description": "<h3>Play AMBER - the next generation of free-to-play Battle Royale.</h3><br/>Jump from a plane to Misfit Island and land with a Jetpack. Collect weapons and destroy enemies in three PvP modes: Battle Royale, Elimination, Deathmatch. Collect first aid kits, shield, and fuel. Up to 200 players in one match!<br/><br/><strong>Battle Royale: </strong>Take on the next generation of Battle Royale with a drop by plane to an island! Land with the Jetpack and use it during battle to fly across the map. Avoid the zone, which constantly shrinks, building up tension during the game. Collect all the weapons, stock up on ammo and shields. Kill all enemies and score a royal victory<br/><br/><strong>Elimination:</strong> It's the same as in Battle Royale but this time you don't have to drop from the plane, instead you spawn on the map with 4 lives and your task is to survive and kill all the players. You and your enemies will be brought closer together by a constantly shrinking area. The bravest and toughest player will win<br/><br/><strong>Deathmatch:</strong> traditional combat mode where you fight against all other players. To win you need to accumulate 25 kills, Use a variety of weapons, grenades, and Jetpack to find your style of play and defeat all enemies.<h3>Features</h3><br/>- Up to 200 players in one match<br/>- Modern multiplayer servers with lag compensation<br/>- Fly across the map with Jetpack<br/>- A variety of weapons, from pistols to assault and sniper rifles<br/>- A fantasy world where modernity and antiquity meet", "metacritic": null, "released": "2022-12-06", "tba": false, "updated": "2023-11-04T00:21:09", "background_image": "https://media.rawg.io/media/screenshots/9cd/9cd3ceda3ab7fca1ead0858fa762fdf3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kobal Andrii"], "genres": ["Action", "Strategy", "Massively Multiplayer", "Indie"], "publishers": ["Kobal Andrii"], "esrb_rating": null}