{"id": 969078, "slug": "shadow-angel", "name": "Shadow Angel", "name_original": "Shadow Angel", "description": "<strong>Game Background</strong><br/>The Rosicrucianism is an elite team. Whenever an enemy invades, the Knights can successfully defeat the enemy. Until there were traitors in the organization to gain dark power. The forces of evil have been awakened and the Knights are disintegrating. You will be called to fight to the death with the power of darkness.<br/><br/><strong>Game Features</strong><br/>This game is a domestic third-person RPG action soul game, with a female protagonist.<br/><br/><br/>There are a variety of skill designs: Assassination, Backstabbing, Bounce, Counter Attack, Pursuit, Combos, and Active Skills. By unlocking new skills and using a variety of active and passive skills, you will become even more powerful<br/><br/><br/>The game has a wealth of scenes: mountains, woods, castles, dungeons, caves, snow, etc. The Unreal engine is used to increase the realism of the scene, and the game's design paid attention to detail: when the character passes through the vegetation, the vegetation will shake, and when passing through the snow, the ground will leave footprints.<br/><br/><br/>There are many kinds of enemies in the game: melee types, long-range attack types, magic types and giant creatures, different monsters have different attack characteristics, and mastering the enemy's attack characteristics is the key to your successful defeat of the enemy.<br/><br/><br/>Humanized design: After the heroine returns home, when she interacts with furniture such as sofa and bed, she can change her underwear and provide directional camera shooting and free camera shooting.<br/>", "metacritic": null, "released": "2022-09-30", "tba": false, "updated": "2023-11-04T01:52:04", "background_image": "https://media.rawg.io/media/screenshots/4ed/4ed63d5fa03f352dd00ca42d4d9753e1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 463, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bluecharm"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Bluecharm"], "esrb_rating": null}