{"id": 96904, "slug": "the-spicy-meatball-saves-the-day", "name": "The Spicy Meatball Saves The Day", "name_original": "The Spicy Meatball Saves The Day", "description": "<p>Take on the role of the Spicy Meatball and save the day in this super text adventure created in the in-development first person/text adventure hybrid engine Icicle.</p>\n<p>To play, select New Game from the main menu and after the introduction sequence ends, use the mouse or cursor keys to look around and read the text descriptions of the environment and objects around you. To view inventory and current score, right click or press the Tab key.</p>\n<p>When an action icon appears, this indicates that an object may be picked up or otherwise interacted with by pressing return or the clicking the left mouse button.</p>\n<p>Enjoy!</p>\n<p>- Cheese</p>\n\n<p><em><strong>Please note that though the game was initially created as \r\npart of a game jam, it has received further development and no longer \r\nreflects the hastily made prototype it once was (end-of-jam builds will \r\nstill remain available for posterity) ^_^</strong></em></p>\n<p>If you're interested, you can find a write-up over on my Patreon page with some musings on what I hoped to accomplish during Linux Game Jam 2017. Details of post-jam updates for the game's \"re-launch\" can be found here.<br/></p>\n<p>Big thanks to Inverse Phase\r\n for putting together some music (made with deflemask on Linux) at the \r\nlast second during Spicy Meatball's initial development for the jam,\r\n and for collaborating on additional audio for post-jam builds.<br/></p>", "metacritic": null, "released": "2017-03-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/572/57270c4a4bbb8c29ffd845476c4cfd46.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Cheeseness"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}