{"id": 969177, "slug": "nightly-maintenance", "name": "Nightly Maintenance", "name_original": "Nightly Maintenance", "description": "Nightly Maintenance is a single player psychological horror hidden object game that will take you on a journey through a creepy and abandoned factory. As Malcom, the maintenance worker, your task is to complete three randomly assigned tasks each night, but beware - an oversized and mysterious mannequin is watching your every move.<br/><br/>The tasks are not your typical maintenance duties and will require you to solve puzzles, find hidden objects, and navigate the dark and eerie factory to complete them. You may be tasked with testing all the light switches, picking up scattered pallets, or even ordering a pizza, but each task presents its own set of challenges and obstacles to overcome.<br/><br/>But that's not the only thing you need to worry about. The mannequin, with its haunting presence and malevolent gaze, adds a layer of tension and unease to your journey. You'll need to be quick and smart to avoid its wrath and complete your tasks without being caught.<br/><br/>As you progress through the game, the twists and turns of the factory's dark and twisted backstory will slowly be revealed. With immersive gameplay, atmospheric visuals and sound, and a gripping story that will keep you on the edge of your seat, Nightly Maintenance promises to be a chilling and unforgettable experience. So, if you're brave enough to face your fears and unravel the mystery of the abandoned factory, then step into Malcom's shoes and see where the night takes you.<br/><br/><strong>Notable Features</strong><br/><ul><li>Randomized tasks<br/></li><li> Unique Gameplay each round<br/></li><li>Replayability</li></ul>", "metacritic": null, "released": "2022-06-28", "tba": false, "updated": "2023-11-04T04:04:02", "background_image": "https://media.rawg.io/media/screenshots/6fe/6fe2a19989ba84adc33279f34e4fd108.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["twhippp games"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["TWhippp Games"], "esrb_rating": null}