{"id": 969102, "slug": "curse-of-black-bone", "name": "Curse of Black Bone", "name_original": "Curse of Black Bone", "description": "Adventure awaits in Port Royal, a town of treasures, mysteries and beautiful women! Embark on this epic, nautical adventure in a story-rich experience features hundreds of high resolution 1920x1080 animated shots (mostly naughty ones), and a large 3D world, filled with collectible treasures, booty calls, and an abundance of fun secrets and mysteries to uncover.<br/><br/><br/>The journey follows a young privateer, Billy Bones, eager to become the greatest pirate captain of the seven seas. Along the way, you will discover hidden areas and ancient treasure as well as earn the affection of 6 beautiful women. Curse of Black Bone contains RPG-like game play that allows you to control Bones throughout a detailed 3D setting including remote island beaches, hidden plantations and the town of Port Royal itself. Find hidden objects and hold them in your inventory for unlocking new and hidden treasures.<br/><br/><br/>Curse of Black Bone features an epic story, spanning hours and hours, with fully animated scenes along the way. Become immersed in a sexy, yet compelling story with many twists and turns that will keep you wanting more. Each of the female characters in the game includes a NSFW 18+ fully animated sex scene that moves the story forward are rewards you for uncovering the secrets of Port Royal. <br/><br/><br/>More than just a simple point and click adventure, Curse of Black Bone is an interactive visual novel that includes navigational raycasting, pathfinding, environment collisions and multiple 3D scenes that allow you to explore and discover the multiple objects that can be added to your inventory and unlock new dialogue and scenes from each female character. Additionally, the game includes a updated Quest Journal that further details your past conversations and gives you clues about what item is needed to move the conversation forward with each character. Curse of Black Bone also includes a full game save system that allows you to continue from any place in the game that you have unlocked. <br/><br/>There is no shortage of drama, lust, and intrigue to be found in Curse of Black Bone. A truly one of a kind adventure experience!", "metacritic": null, "released": "2022-08-31", "tba": false, "updated": "2023-11-04T02:24:58", "background_image": "https://media.rawg.io/media/screenshots/e57/e5793ad4c9106945b4017511522941b1.jpg", "website": "https://www.entropyadultgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 330, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Entropy Digital Entertainment"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Entropy Digital Entertainment"], "esrb_rating": null}