{"id": 969179, "slug": "redside-episode-1", "name": "REDSIDE episode 1", "name_original": "REDSIDE episode 1", "description": "In the exciting technotriller <strong>REDSIDE</strong>, the player will visit the Soviet side during the Cold War.<br/><strong>REDSIDE</strong> is a series of games related to one plot, characters, events and the universe. I present to your attention <strong>REDSIDE episode 1</strong> - the first game in the series.<br/><br/>During the operation to free Soviet citizens, the GRU special forces group receives information about the existence of an international channel for the supply of chemical weapons components. Intelligence assumes that someone is preparing a terrorist attack using a chemical warfare agent \"Sarin\". Neither the targets of the terrorist attack, nor the executors, nor the customers are known, which means that the consequences of such an attack are unpredictable. In the context of a new round of the Cold War gaining momentum, such an attack could lead to the beginning of the Third World War. To prevent the worst scenario, the GRU uses all its capabilities and conducts a number of special operations around the world. Will it be in time?<br/><br/><ul><li>A twisting plot will send the player on missions to Europe, Africa, and the Middle East. The game is set in 1996 during the Cold War.<br/></li><li>More than 20 types of weapons, from pistols to grenade launchers and sniper rifles, are available to the player for combat missions. Weapons have about 10 characteristics, such as weight, size, reload speed, killing power and others. Each weapon has its own advantages and disadvantages - with one it is convenient to suppress the enemy with fire, with another it is convenient to storm the premises.<br/></li><li>Where firearms are useless, ammunition and extra abilities will do the job.<br/></li><li>In addition to brute force, the player can use stealth and tactical elements. <br/></li><li>Emphasis on realism (of course, within the TDS genre). Your weapons, your actions in combat, the use of cover - everything will matter.<br/></li><li>How long have you been hunting terrorists from a drone, riding armored vehicles, or blowing up enemy patrols? Special missions and mini-games will make your adventure even more exciting.<br/></li><li>Dynamic difficulty level. Regardless of what difficulty level you play, if you experience problems, the game will begin to succumb to you. On the contrary, if it is too easy to play, it will resist you more.</li></ul>", "metacritic": null, "released": "2022-07-29", "tba": false, "updated": "2023-11-04T04:08:29", "background_image": "https://media.rawg.io/media/screenshots/69a/69adcb249971feb13825d90e475da877.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 518, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["energy milk"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["energy milk"], "esrb_rating": null}