{"id": 969180, "slug": "squish", "name": "Squish", "name_original": "Squish", "description": "Squish - A spoopy, colorful, and fast-paced party game where you and up to three gooey friends rave it up in an underground crypt as it collapses down on you. You must push blocks, dodge incoming hazards from all directions, and jump to survive the grave rave gone awry. Squish your opponents while avoiding the dangers that come your way. Last Skelegoo standing takes it all! <br/><br/><h3>Show Your Friends You’re the Best Raver</h3><br/><ul><li>Whether you’re looking to squish other players directly or trying to survive until the end while partying on the sides, there are many ways to rave it up.<br/></li><li>Partying is easy, but surviving a collapsing underground rave is hard!<br/></li><li>Squish is easy to learn, but hard to master! There are only a few controls to pick up before you can push blocks and dodge threats that come your way. </li><li>Mastering the controls and knowing exactly how to manipulate the terrain to survive, however, is another story.</li></ul><h3>5 Different Game Modes for Whatever Jiggles Your Jelly</h3>Not feeling a certain type of party today? Not a problem! There 5 different types of game modes to pick and choose from so you can party however you want!<h3>Discover Your Favorite Skelegoo Combination</h3>Skelegoos are multifaceted, and so are you. That’s why we have a bunch of different hats and skins so that you can find the perfect combination just for you and your goo.", "metacritic": null, "released": "2022-06-28", "tba": false, "updated": "2023-11-04T04:11:13", "background_image": "https://media.rawg.io/media/screenshots/a58/a584eafb962bf4e15c257f26d0e04bba.jpg", "website": "https://www.play-squish.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Grave Rave Games"], "genres": ["Action", "Casual", "Indie"], "publishers": ["PM Studios"], "esrb_rating": null}