{"id": 969146, "slug": "tracery-of-fate", "name": "Tracery of Fate", "name_original": "Tracery of Fate", "description": "<strong>Tracery of Fate</strong> is a fascinating VR trip in an incredible dark fantasy setting. The world of Alfira is almost dead, but it has own story, which unfolds for you with every new step. Solve mysteries of the world on the edge of destruction, which is so beautiful in its apocalyptic agony. Show your ingenuity in solving puzzles and avoiding traps, use your agility and good reaction to defeat evil when you face it. Improve various skills adjusting your character to your combat style, develop teamwork in a <strong>cooperative </strong>game and save Alfira’s world – since you are the last hope.<h3>Features</h3><ul><li> Dual wield axes, revolvers or use them with a shield.<br/></li><li> Explore Bastion dungeon, Ancient Deep, Deia Lower Town area and humid Grotto location.<br/></li><li> Collect Relics and Blueprints to unlock active abilities and consumable items.<br/></li><li> Loot Soul Crystals from your enemies to enhance your passive skills.<br/></li><li> Change your character build to try different styles.<br/></li><li> Activate Stones of Life to purify corresponding area from the Bane.<br/></li><li> Share your campaign progression with a friend and continue solo.<br/></li><li> Solve puzzles to gain access to new areas or possessions.</li></ul><h3>Story so far</h3>The game takes place in the dying world of Alfira. After a long confrontation with the invasion of demons, the goddess of Alfira weakened so much that she could not cope with the curse left by demons - <strong>Bane</strong>, which gradually devours all life. Cities fall into the ground, people, elves and orcs die from Bane poisoning or mutate into terrible monsters. As if that was not enough, a former ally, a mad necromancer, decides to become the new god of a dying world and turn all the living into his army of the undead.You are the <strong>Sentinel</strong> - the last hope of this world. A mysterious creature created by an ancient race to oppose demons. At the disposal of the Sentinels are melee weapons, shield, various superpowers and pistols. You are opposed by hordes of the undead and even other Sentinels enslaved by the necromancer. There are rumors around the world that the demons have returned and will soon begin their march through the world of Alfira again, devouring the remnants of the survivors.", "metacritic": null, "released": "2022-07-29", "tba": false, "updated": "2023-11-04T03:25:10", "background_image": "https://media.rawg.io/media/screenshots/48d/48d6626a0549c83e9369d77013d0dd6c.jpg", "website": "https://traceryoffate.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 537, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sign Narva"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Sign Narva"], "esrb_rating": null}