{"id": 969188, "slug": "hardcore-cruising-a-sci-fi-gay-sex-cruise", "name": "Hardcore Cruising: A Sci-Fi Gay Sex Cruise!", "name_original": "Hardcore Cruising: A Sci-Fi Gay Sex Cruise!", "description": "All aboard the HMS Size Queen! New crewman Milo Barre has started work on his first cruise. He always dreamed of working for this illustrious cruise line, but his big brother bullied him by saying he wasn't slutty enough to make it.  Can Milo prove him wrong and be the sluttiest cabin boy on the ship? His lifelong dream is on the line!<br/><br/><br/><br/>Hardcore Cruising is about a sci-fi gay sex ship that cruises the seas as well as the heavens.  The crew have normal jobs you'd see on any cruise ship, but are also enthusiastic sex workers there to make the guests naughtiest dreams come true.  Join Milo on his first cruise where he proves his worth and falls in love with one or two of his shipmates.  <br/><br/><br/><br/>Featuring numerous fully animated sex scenes, polyamorous or monogamous options in every route, and loads of sex between the crew and with the guests, Hardcore Cruising will take you away on an erotic voyage you'll never forget!<h3>Starring</h3><br/>He's as green as they come, and it's not from sea-sickness. Milo needs to learn the ropes fast so he can be the sluttiest cabin-boy possible! Will he have a chance for love and adventure too?<h3>Also Starring</h3><br/>This seasoned space explorer has taken a break from his science vessel for something more fun. Maybe he can finally find a husband to explore the universe with?<br/><br/><br/>This sage bartender has seen it all, and can teach Milo what he needs to know with kindness and patience.  Having tentacles for hair adds to his appeal too!<br/><br/><br/>Xellect is a perfectionist chef who's as high-strung as they come.  Maybe Milo can help teach him how to relax and enjoy the voyage?  What's got this guy so nervous? <br/><br/><br/>Harse is part of a work-release program from space prison.  What crime did he commit to get life locked up?  Can Milo find a crack in this tough criminal's  exterior?<h3>Guest Starring</h3><br/>Plumbottom is too busy being the ship's entertainment coordinator to be a possible love interest, but he'll be a great help to Milo all the same.<br/><br/><br/>Why is the ship's doctor so creepy?  And what's this magical treatment he's doing to everyone's butts?<br/><br/>Featuring<br/><ul><li> Four Sexy Routes!<br/></li><li> Poly or Monogamous Romance Options!<br/></li><li> Numerous Fully Animated Crew Sex Scenes and Static Guest Scenes<br/></li><li> Sex with Crewmembers and Guests<br/></li><li> An Original Disco Music Soundtrack!<br/></li><li> 20 Achievements<br/></li><li> Sex with Unique Humanoid and Non-Humanoid Aliens!<br/></li><li> Sex Positive Erotic Gay Fun!</li></ul><br/><strong>Press Ctrl-V to turn on the Text to Speech Option and have all game text read out loud!</strong>", "metacritic": null, "released": "2022-06-28", "tba": false, "updated": "2023-11-04T04:20:12", "background_image": "https://media.rawg.io/media/screenshots/c90/c90018e2d5cd8a4034f8897626b370eb.jpg", "website": "https://ypressgames.com/category/hardcore-cruising/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Y Press Games"], "genres": ["Simulation"], "publishers": ["Y Press Games"], "esrb_rating": null}