{"id": 969214, "slug": "influence-inc", "name": "Influence, Inc.", "name_original": "Influence, Inc.", "description": "Manage a digital influence agency in this strategy-simulation game about modern-day propaganda and advertising. <br/><br/>Manipulate social media and the mainstream news to promote celebrities, market products, and even sway elections. <br/><br/><strong>Research, share, leak, and target your way to influence.</strong><br/><br/><h3>Features</h3><ul><li> Control of a business that provides influence for hire, mostly through social media. <br/></li><li> Missions from a variety of clients: corporations, talent agencies, governments, and others. You choose who you want to work with and what types of jobs you're willing to undertake.<br/></li><li> A network of public attention, eager for the next scandal that you may choose to break</li></ul><br/><h3>???s</h3><br/>During your experience, you might reflect on questions such as:<br/><br/><ul><li> How does what we pay attention to and what we ignore shape reality?<br/></li><li> Who is manipulating our attention, and why?<br/></li><li> How is social media shaping news and journalism?<br/></li><li> How is media used to both promote and fight authoritarianism?</li></ul><br/>(Or, you might just blithely pursue profit and influence. The choice is yours.)<br/><br/>***<br/><br/>A first playthrough of Influence, Inc. generally lasts 2 -3 hours. However, different choices lead to different missions, so you are encouraged to play multiple times with different strategies.", "metacritic": null, "released": "2022-05-31", "tba": false, "updated": "2023-11-04T04:57:29", "background_image": "https://media.rawg.io/media/screenshots/e89/e897ac8e01a7688193cc5c0e4d1ad257.jpg", "website": "https://www.influenceincgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Curious Bird"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Curious Bird"], "esrb_rating": null}