{"id": 969224, "slug": "captain-of-industry", "name": "Captain of Industry", "name_original": "Captain of Industry", "description": "Your journey will start on an abandoned island with a small crew of loyal workers. In order to survive, you will need to mine raw materials from the earth, grow food, build factories, manufacture products, construct vehicles, research new technologies, explore your surroundings, and trade with other islands. If you do things right, you'll work your way up towards an industrial superpower and you can even start a space program! But this is no easy task and you will be put to the test to keep your settlement alive.<h3>Manufacture products</h3><br/>Start simple - smelt iron, mix concrete, create construction parts, and grow food. Soon you will be able to expand into crude oil processing, electronics, solar panels, data centers, and even rockets. There are over 150 unique products to explore and work with!<h3>Build vehicles and transport products</h3><br/>Logistics systems ensure that trucks will automatically deliver products where they are most needed. You can configure the logistics to make it more efficient. Don’t forget to build enough trucks or upgrade existing ones to keep things moving!<h3>Build conveyor belts and pipes</h3><br/>Use conveyor belts and pipes to route products efficiently and relieve stress on truck-based logistics. The transport system supports vertical stacking and auto-pathing for easy placement. Balancers and sorters also help organize your assembly lines by providing priority and sorting functionalities.<h3>Mine raw resources on fully dynamic terrain</h3><br/>Find the natural riches of your land and use them to expand your empire. Mine coal, iron, copper, gold, or pump underground oil and water! Make open-pit mines to extract valuable ores from underground, or just dump excess rocks into the ocean to create a new land to build on! Remember that no mountain is tall enough for your fleet of excavators!<br/><br/>Additionally, the dynamic terrain system allows you to create access to various levels of elevation throughout your island. Dig or dump terrain to create slopes between hard to reach places so that you can have the most efficient path for your vehicles.<h3>Farm your land</h3><br/>You need to feed your people by growing simple crops such as potatoes.  Later, you will be able to grow more advanced crops such as wheat or soybeans  and process them to make more kinds of food and products. You can also produce fertilizers and use greenhouses to keep up with the food demands.<h3>Grow your settlement and provide for your people</h3><br/>To staff your factories, farms, and vehicles, you need people, and lots of them. Build housing and provide essentials to your citizens such as food, water, electricity, healthcare, and household goods. Population will grow on its own depending on their health and happiness, but you can also recruit and rescue populations on the world map to help aid your island.<h3>Build complex oil and chemical refineries</h3><br/>Break crude oil down into different usable fractions using multiple refining stages. With the ability to stack pipes you can create compact and scalable plants that can make all the oil-based products you will need for your growing empire.<h3>Research new technologies</h3><br/>Research is a must have! Unlock new buildings and materials and make your factory more efficient. New technologies will change the course of your future. Your factory will grow more efficient and advanced with over 140 technologies to unlock.<h3>Import and export resources to and from your island</h3><br/>Establish shipping lanes with cargo ships to fill the gaps in your production by bringing in various products such as crude oil, wood, or quartz. While the resources on your island may be limited, the world is not! Later you will be also able to establish shipping contracts with other islands for periodic exchange of goods.<h3>Explore the world, trade with allies, fight pirates</h3><br/>Repair and upgrade your ship with better engines, armor, and weapons. Explore your surroundings, find refugees, allied settlements to trade with, discover more resources, and be ready for naval battles with pesky pirates!<h3>Get to space!</h3><br/>Research and develop your way to space flight. Launch a rocket as a true test of your settlement’s accomplishments.", "metacritic": null, "released": "2022-05-31", "tba": false, "updated": "2023-11-04T05:14:59", "background_image": "https://media.rawg.io/media/screenshots/a74/a74a739f9ccf3f714dc609d30763df6d.jpg", "website": "https://www.captain-of-industry.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 8}, "playtime": 9, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 592, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MaFi Games"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["MaFi Games"], "esrb_rating": null}