{"id": 969220, "slug": "love-of-magic-book-2-the-war", "name": "Love of Magic Book 2: The War", "name_original": "Love of Magic Book 2: The War", "description": "You have won her Love, and won your Throne... now it's time to win the War. Love of Magic is an Arthurian Urban Fantasy blending adult visual novel gameplay with a sandbox RPG. Explore, grow and enjoy the world, and prepare for your greatest test.. the War against the Outsiders. <br/><br/><br/><br/>Book 1 charted your rise from novice mage to King of Camelot; as Book 2 opens the Gates between worlds have been opened and the Outsiders have arrived. Millions lie dead across Central America, and modern weapons are unable to stop them... it is up to you to harness the Magic of your new home in defense of your old. Forge alliances with the Gods of the Old World, explore the mystery of Merlin's legacy and build an army that can destroy the Outsiders and their undead allies.<br/><br/><br/><br/><ul><li> Experience emotional and erotic moments with a cast of gorgeous girls and fun side characters. <br/></li><li> Explore the magical realm of Elsewhere, and discover its secrets and characters.<br/></li><li> Plot the path of the War through Kingdom Events and quests.<br/></li><li> Read books, train and build your character from a man into a god. <br/></li><li> Collect and construct different gem sets to customize your magic. </li></ul><br/>", "metacritic": null, "released": "2022-05-31", "tba": false, "updated": "2024-02-01T07:54:58", "background_image": "https://media.rawg.io/media/screenshots/bf2/bf2e418587472395053741492464526d.jpg", "website": "http://loveofmagic.net", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 47, "ratings_count": 1, "suggestions_count": 512, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "macOS", "PC"], "developers": ["Droid Productions"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Flexible Media"], "esrb_rating": null}