{"id": 969234, "slug": "mercenaries-rebirth-call-of-the-wild-lynx", "name": "Mercenaries Rebirth: Call of the Wild Lynx", "name_original": "Mercenaries Rebirth: Call of the Wild Lynx", "description": "Obtain the sword of victory together with Princess Kiera and the Wild Lynx Mercenaries!<br/><br/>Mercenaries Rebirth is a tactical RPG set in a fantasy world.<br/>Battles occur on quarter-view maps with height differences, wherein the front, back, and side of the map determine each battle’s outcome. Support effects depend on where allied characters from your party are in position, etc., features of high strategic maneuvers.<br/><br/>Talented Illustrator Makimura Shunsuke-san is the appointed character designer! Beautifully drawn characters play more active roles with rich facial expressions that vary from joy, sadness, anger, etc.<br/><br/>・Rebirth Exceed<br/>The gauge in the upper right corner of the screen builds up anytime the Player attacks and defends during battles. Store up enough power to activate a particular skill called “Rebirth Exceed”! Each character has unique talents, including dealing with godly damage to enemies and reviving fallen allies who cannot fight.<br/><br/>・Smooth Character Animations<br/>Animations play a more active role now. During battles, smooth animations were made by animating parts of the characters’ pixel art. Both human characters and monsters move a lot more vividly than ever compared to previous titles in the series!<br/><br/>・Battle Maps Transformed Into 3D<br/>3D models produce battle maps, and the camera angles can rotate during the Player’s Turn. Hidden items, etc., can be found by rotating the camera !?<br/><br/>・Full Options Setting<br/>Options settings include turning the Grid Display ON/OFF on the 3D Battle Maps, “Skill Easy Play,” and “Faster Movement Play,” etc., which are more suitable for repeat play value.", "metacritic": null, "released": "2022-06-29", "tba": false, "updated": "2023-11-04T05:31:47", "background_image": "https://media.rawg.io/media/screenshots/35f/35fd1a78b156cf5bd1455de84bed33bb.jpg", "website": "https://www.rideongames.com/mercerebirth/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 465, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ESQUADRA,inc.", "RideonJapan"], "genres": ["Strategy"], "publishers": ["Flyhigh Works"], "esrb_rating": null}