{"id": 969250, "slug": "psycho-bathroom", "name": "Psycho Bathroom", "name_original": "Psycho Bathroom", "description": "Wishlist the Sequel Now!<br/>https://store.steampowered.com/app/2431790/Cyber_Paradise/<br/><br/><h3>More reviews:</h3><br/>\"PB is an entertaining and very well put together game. I enjoyed the mechanics of this fighter and the story is one I believe should be heard.\"<br/>- The Paladin Club (Steam Curator)<br/><br/>“I love the story so far it's cute but also really tragic and relatable”<br/>- Mayshing, founder of Altabe Studio<br/><br/>\"Wasn't sure what I was getting myself in for with this one but it's great! It's a platformer that's all boss fights and quirky toilet humour. My only complaint? Needs to be longer! Should not be free.\"<br/>- CSH Picone (Steam Curator)<br/><br/>\"Worthwhile lessons about bathroom hygiene form the backbone of this fun, toilet-themed boss rush game with a surprisingly sweet story. Satisfying combat, good variety and challenge await.\"<br/>- indie recommendations (Steam Curator)<br/><br/>\"Psycho Bathroom is great, with a sense of humour added to it. as you take on a variety of boss fights which enhances your experience with a story that makes you feel more immersive within the game.\"<br/>- Weird F'n Games (Steam Curator)<br/><br/>\"A sentient toothbrush fighting against poop-based monsters to save the hygiene of his master, in a bizarre and addictive 2D action boss-rush with VN elements and quotes from scientific journals.\"<br/>- Crazy Bloody Action Games (Steam Curator)<br/><br/>\"It is fast, fluid and addictive; it is all made better by the fact that the game is free. Not free-to-play; free for life, like there are no extra costs, which surprised me because combat is robust.\"<br/>- Syndicate Y (Gaming media site)<h3>A boss rush game with a dark comedic storyline about outcasts, hopes and friendships.</h3><br/>In the bathroom you reside in, your toilet lid is broken. Every toilet flush is splashing aerosols all over the place. You, as a toothbrush, must eradicate the threat and protect your master. Along the way, you'll upgrade your gear, meet new buddies and learn the absurd world through your master's story.<h3>Swift combats</h3><br/>Toothpaste is your sword, and mouthwash is your holy water.<br/><br/>Slash the filthy enemies in their faces, attack them from below, hit and bounce on their heads (homage to Hollow Knight!) Perform combo streaks to activate your mouthwash for critical hits and speed buff.<br/><br/><br/><br/><h3>Unlock new skills, buy gear and upgrades</h3><br/>Win the battle and keep your master clean. In return, your healthy master will work hard and split his earnings with you. Use it to buy equipment, upgrade and unlock new abilities. If you want, get a new toilet lid to stop the filth from coming out once and for all (or not?).<br/><br/><h3>Friends With Unique Abilities</h3><br/>Along the way, you will meet new friends who will assist you in your battles. Put their unique abilities to good use!<br/><br/><h3>A black comedy about outcasts, hopes and friendships</h3><br/>Chat heart to heart with your master during the tooth-brushing session after every battle. Explore his bitter-sweet story - well, sweet only if you can beat the game. Otherwise, it’d just be a bitter story.<br/><br/><h3>Unlimited Levels</h3><br/>There’re 12 unique bosses. Every time you've beaten all of them, they will make a comeback. They will get stronger and probably with evolving move-sets. Your previous tactics may no longer work.<h3>How Long To Beat</h3><br/>It takes around  1- 1.5 hours to see the ending of the story. But the real fun starts after you’ve beaten the game!<h3>Game Features</h3><br/><ul><li>Information about real-life toilet plumes.<br/></li><li>Tight control allows you to move around and strike swiftly.<br/></li><li>12 bosses and numerous minions.<br/></li><li>Shop - buy equipment, upgrades, unlock new abilities.<br/></li><li>Unlimited levels with increasing difficulty.<br/></li><li>A dark but comic story.<br/></li><li>4 dumbfounding animated cutscenes.</li></ul><br/><br/><br/>", "metacritic": null, "released": "2022-04-29", "tba": false, "updated": "2023-11-04T05:57:00", "background_image": "https://media.rawg.io/media/screenshots/731/73171a9f62690f880d0e71e9982d88cf.jpg", "website": "https://ddmeow.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 17, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DDmeow Games"], "genres": ["Action", "Indie"], "publishers": ["DDmeow Games"], "esrb_rating": null}