{"id": 969242, "slug": "wei-zhi-ji-lu", "name": "未知记录", "name_original": "未知记录", "description": "Congratulations! Your test run has been successful and you have become a customer service AI for ANOVA. Your serial number is 22500814.<br/>Your first mission is ready. We are now updating the files.<br/>Please establish a connection with the client and complete the task of parsing and recording client product reviews, as well as resolve issues that the client might encounter in order to avoid adverse feedback.<br/>The company encourages diligent observation and record management. AIs that achieve excellence will potentially be granted a true body and identity information.<br/>Our goal is to help every client live a perfect life.<br/>—An unknown record, a cyberpunk ensemble. A choice of souls and reality, a story of the savior and the saved.<br/>Year 2250, Winter Lake City.<br/>Connect now.<h3>=====Game Feature=====</h3><br/><br/><ul><li><strong>Become the AI: HANA</strong></li></ul>Witness the future as the AI: HANA. Installed with a true soul, you shall journey in virtual dataspace.<br/><br/><ul><li><strong>Observe Life, Complete File Records</strong></li></ul>To aid someone in living the perfect life, or to unveil all secret trails—which will be your mission? Observe the to-and-fro of people's lives and collect information keywords about them. Combine, deduce—envision different lives to complete file records.<br/><br/><ul><li><strong>Multi-endings, Weave Destinies Together</strong></li></ul>An ensemble cast of characters with individual stories. Their paths seem not to intertwine, and yet are tightly linked. Decide their destinies through your choices.<br/><br/><ul><li><strong>Discover the Cybercity Secret</strong></li></ul>We all have secrets, and so does this city.<br/>Welcome to Winter Lake City in 2250, the birthplace of the multi-brand technology company of ANOVA. The corporation’s advancements in biotechnology, medicine, military, and more, breathed new life into this place.<br/>Explore this city. Reveal what it hides.<br/><br/><ul><li><strong>Before It Ends</strong></li></ul>Nine tales in waiting, eight people crying for help. As for the last remaining one…<br/>How would you live, HANA?<h3>=====Gameplay=====</h3><br/><br/><strong>1. Observe</strong><br/>Observe the lives of different characters through hidden cameras.<br/><br/><strong>2. Hack</strong><br/>Find and hack into communication devices of your clients. Leave no stone unturned in their messages, photo album, music playlist, browsing records, and more.<br/><br/><strong>3. Monitor</strong><br/>Monitor the conversations of your client. Discover and piece together their life story.<br/><br/><strong>4. Converse</strong><br/>Converse with your client as an AI and obtain information.<br/><br/><strong>5. Solve</strong><br/>Figure out the truth through compiling and processing the clues you found.<br/><br/><strong>6. Report</strong><br/>Report your findings to the company.<br/><br/><strong>7. Upgrade</strong><br/>Gain trust from the company and acquire functional upgrades. Step by step, become the best AI there ever is.", "metacritic": null, "released": "2022-04-28", "tba": false, "updated": "2023-11-04T05:45:36", "background_image": "https://media.rawg.io/media/screenshots/a6f/a6f4e07a7870d8e382e0764e35643476.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 31}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NetEase Games"], "genres": ["RPG", "Strategy", "Casual", "Indie"], "publishers": ["Netease"], "esrb_rating": null}