{"id": 969232, "slug": "clown-for-speed", "name": "Clown For Speed", "name_original": "Clown For Speed", "description": "<h3>From creators of iconic Clownfield 2042, we introduce you to: Clown For Speed.</h3><br/>Ready to own the streets? Clown For Speed is all about realistic drifting experience, detailed track cars, an array of aesthetic rides and open online lobbies to get lost into for hours on end. Immerse yourself in the real world of ultimate drifting experience. Pick your perfect ride and get ready to burn some tires!<br/><br/>Optimized for best PC experience. Get an unlocked frame rate and experience Clown for Speed at any resolution, only on PC. Plus, feel the thrill of going sideways with steering wheel and peripheral support from a range of manufacturers including Logitech, Thrustmaster and others.**<br/><br/><strong>GAME FEATURES:</strong><br/><br/><ul><li>Variety of rides, starting with JDM classics, American muscle with Euro legends.<br/></li><li>Realistic drifting system<br/></li><li>Carefully crafted tracks <br/></li><li>Points system<br/></li><li>Offline &amp; Online game-modes<br/></li><li>In-game radio system<br/></li><li>Optimized for PC</li></ul><br/>Let's recap that in a few words. Clown For Speed currently has over 20 cars to pick from, offline mode with handful variety of maps and an online mode with up-to 16 players. Realistic rides with realistic characteristics, beautifully handcrafted tracks, carefully handpicked and fully licensed soundtracks. What more would you need?<br/><br/>** Steering wheel and peripheral support is only available for in-game vehicle controls. Menu and pause functions need to be navigated through a mouse.", "metacritic": null, "released": "2022-06-29", "tba": false, "updated": "2023-11-04T05:29:02", "background_image": "https://media.rawg.io/media/screenshots/9d7/9d7e56fa82530c1ca3d0a81621b5f916.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 280, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RIVERSIDE SPORTS"], "genres": ["Simulation", "Racing"], "publishers": ["RIVERSIDE SPORTS"], "esrb_rating": null}