{"id": 969358, "slug": "mysteries-of-darkness", "name": "Mysteries Of Darkness", "name_original": "Mysteries Of Darkness", "description": "A roguelike single-player card game where you battle fierce creatures in turn-based combat.<br/>Win battles to improve your cards, and build a powerful deck capable of defeating the demon that opened the portal to hell.<br/><br/>•<strong> On your treacherous journey to the portal</strong>, you will discover ruins that may hide secret treasure chests. Beware: some contain hidden runes, but there are traps lurking to snag any would-be treasure hunters.<br/>﻿<br/>• <strong>Collect powerful runes!</strong> Forge different runes onto your cards to customize and strengthen your deck to suit your personal play style.<br/>﻿<br/>• <strong>Unlock more cards</strong> as you battle your way through your adventure! Exchange your experience points to choose the cards you want and improve your deck.<br/>﻿<br/>• <strong>Choose your champion!</strong> In the current version of the alpha, choose between our two heroes (more to come):<br/>﻿<br/><strong>Valkirian-The Warrior</strong> :<br/>This stoic defender uses protection cards to shield him from enemy attacks before dealing strong blows of his own. He can inflict bleeding damage which allows him to do damage through the armor of his enemies. An ideal class for beginners<br/>﻿<br/><strong>Elwin-The Witch</strong> :<br/>This spell-slinging sorceress harnesses the power of the four elements to overcome her enemies. Although she has less defense than the warrior, the witch has many spells in her arsenal to disable and weaken enemies to shift the tides of battle in her favor. Due to the large variety of spells at her disposal, the witch is recommended to more experienced players.<br/>﻿<br/><strong>Will you survive?</strong>", "metacritic": null, "released": "2022-01-31", "tba": false, "updated": "2023-11-04T08:22:39", "background_image": "https://media.rawg.io/media/screenshots/759/75978962a36c0577d3f18bb1c1f892e7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 321, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mercier Christophe"], "genres": [], "publishers": ["Mercier Christophe"], "esrb_rating": null}