{"id": 9693, "slug": "my-mom-is-a-witch", "name": "My Mom is a Witch", "name_original": "My Mom is a Witch", "description": "The Heroes<br/><br/><br/>One to four players can select one of seven heroes with different starting weapons, as well as Melee, Magic and Archery skill levels. Local co-op, LAN and online multiplayer mode are available. In the current Early Access version, five characters are already available:<br/><br/><ul><li> Knight (melee combat specialist, starts with armor that reduces damage)<br/></li><li> Sorceress (ranged magic attack, can create food to heal players)<br/></li><li> Druid (ranged magic attack, can add poison effect to any weapon)<br/></li><li> Pyromancer (shoot fireballs, immune to fire)<br/></li><li> Archer (master of bow and arrows, start with additional inventory slot)</li></ul> <br/>You can unlock characters by completing various quests in the game. The final version will have two more playable characters.Items, weapons and loot<br/><br/><br/>Boost your strength, magic and other abilities with new weapons, potions, scrolls and items you can discover on your adventure. Grab enemy weapons when they drop them or discover hidden treasure stashes. Here are some weapons and items already available:<br/><br/><br/><br/>The game already has over 100 items and weapons with different effects. Many items have synergies. For example drinking a Gold Diet potion allows you to eat gold, but if you find an Appetite potion as well it will boost the effect and enable you to restore a lot of health. Voodoo Doll allows you to hurt enemies from a distance, but if you combine if with a high-damage item like a Meteor Staff or a Bomb it can be much more effective.<br/><br/>Characters with good archery skills can combine different bows and arrows, for example:<br/><br/><br/><br/>Hitting an enemy would freeze it for a while, but after that passes, there's a chance he will also be slow and much easier to fight against. Saving special arrows for bosses and difficult enemies is a good strategy.Pets<br/><br/><br/>Adopt one of 25 different pet companions. Each has a different effect. The Penguin freezes enemies. The Ram knocks them down. The Bat attacks in the air. The Chicken shows you the path with least enemies. The Dog fetches hard to reach items and weapons. The Turtle acts as an unbeatable decoy and the Bird's feathers improve your archery skill. If you find a Wolf to lead the pack and keep them in order, you can adopt multiple pets at the same time.Always more to explore<br/>The game has permadeath. Once you die, you start a new game. A different world is created on each playthrough. The layout of the levels is different, there are different numbers and types of enemies; and different treasures and items sold in shops. There are many spells the characters can use, and archers have a wide assortment of special types of bows and arrows at their disposal. Because of this, each new game poses a new challenge. You will get a subset of weapons, items and enemies and might need to use a different strategy. Any two subsequent plays could be quite different.Various ways to complete levels<br/>There's a big boss at the end of each level. You can beat him up with a melee weapon, petrify him with Medusa Arrows, or use a magic scroll to turn him into a sheep. There are shops that you can try to loot if you can beat the shopkeeper's armed friends. Enemies drop usable items and weapons often. For example, a Goblin Shaman has a voodoo doll which you can use to mark enemies and hurt them from a distance. You can even toss the doll into a campfire and set enemies on fire, or anything else you can think of.Monsters and bosses<br/><br/><br/>The final game will feature seven areas: forest, battlements, the keep, dungeon, catacombs, caves and the frozen mountain. Each area will have a couple of specific bosses that randomly show up on different play-throughs.<br/><br/>Each area also has a different set of enemies, separated into the following factions:<br/><ul><li> Goblins<br/></li><li> King's Guards<br/></li><li> Thieves<br/></li><li> Undead (skeletons, zombies, vampires)<br/></li><li> Animals (wild boars you can ride, bugs that drop weapon upgrades, bats, hornets, etc.)</li></ul><br/>Each faction has regular units and special ones that are bigger and harder to beat. Like this barbarian that the shop keepers like to hire for security:<br/><br/>The Story<br/>You lived with your mother in a peaceful forest community. The mother was a witch who used her powers only for good. One day, the king's guards came and took her away. You decided to sneak into the castle and rescue her.<br/><br/>In the meantime, someone has stolen an ancient artifact from the goblins and escaped into the castle. As our heroes are trying to find their way in, the goblins are starting a siege.<br/><br/>Play the game to see how the story unfolds... Save the mother, discover the goblin artifact's power and the thief's agenda.Contact e-mail<br/>In case you want to contact me about the game: info@bigosaur.comMy Mom is a Witch<br/>In case you got here looking for it, the game has been named \"My Mom is a Witch\" previously.", "metacritic": null, "released": "2016-11-09", "tba": false, "updated": "2019-08-28T22:14:49", "background_image": "https://media.rawg.io/media/screenshots/d95/d9521f9ff58341fe1074dabf3930b0a6.jpg", "website": "http://bigosaur.com/witch", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 38, "beaten": 1, "dropped": 3}, "playtime": 4, "achievements_count": 123, "ratings_count": 5, "suggestions_count": 286, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC", "macOS", "Linux"], "developers": ["Bigosaur"], "genres": ["Action", "Adventure"], "publishers": ["Bigosaur"], "esrb_rating": null}