{"id": 969336, "slug": "winter-with-you", "name": "Winter With You", "name_original": "Winter With You", "description": "Our upcoming games:<br/>https://store.steampowered.com/app/2590770/Stolen_Memories/<br/>https://store.steampowered.com/app/2590790/Stolen_Memories_II/<br/><br/>This is a short (3-4 hours long) Japanese-style kinetic visual novel about Christmas. You'll meet two cute girls who won't let you spend Christmas alone!<h3>Story</h3>This Christmas night was supposed to be special for Naoki. He decided to surprise his girlfriend Miyuki  - he bought a bouquet of flowers and booked a restaurant. But when he went to her office, he saw Miyuki cheating on him with another guy. He immediately ran out of the office in anger. In Central Park, he meets Yume, a young guitarist who, like him, has no one to spend Christmas with. Her cheerfulness distracts Naoki for a while. But running away from the problem is not the solution.<br/><br/><br/>Romantic Christmas story, with 2 adorable girls with cute voices (and English voice-overs), awkward situations, and more than 12 CG, 6 tracks, and 5 backgrounds! Character sprites are animated - many different outfits and facial expressions, lip-sync, eye blinks, body and hair physics.<h3>Miyuki</h3>Date of birth: August 26, 23 years old.<br/>Naoki's childhood friend. Had known him since he was 11. Started dating him in high school. She is the opposite of Yume. She becomes shy when she stays <br/> alone with Naoki but usually, she's quite energetic. She feels embarrassed when Naoki shows his care in public. Miyuki is worried that she is not  \"interesting\"  enough for Naoki, and she is jealous that Yume and Naoki have a lot in common. <br/><h3>Yume</h3>Date of birth: January 10, 16 years old.<br/>Fun-loving, childishly open-minded girl. Originally from a county town, she moved to Tokyo to escape her parents' custody. She quarreled with her father because of her passion for guitar. He wanted her to learn guitar lessons when she was a child, but she refused and suddenly wanted to return at the age of 16 (which is too late by her father's standards). Admires Naoki.<br/><h3>Features</h3>Achievements have been added to the game! And there is also macOS support, with Linux versions coming soon.<br/><br/>https://store.steampowered.com/app/2124070/NoWorse/", "metacritic": null, "released": "2022-01-30", "tba": false, "updated": "2023-11-04T07:51:31", "background_image": "https://media.rawg.io/media/screenshots/a48/a48ab9dad5f87c93cac6a8267249cf5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Aleksey Izimov"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Aleksey Izimov"], "esrb_rating": null}