{"id": 969329, "slug": "fayburrow", "name": "Fayburrow", "name_original": "Fayburrow", "description": "Fayburrow won the Yugo BAFTA Student Award for games!<br/><br/>\"Fayburrow\" is a 3rd year student project from The Animation Workshop in Denmark.<br/><br/><strong>SYNOPSIS</strong><br/><br/>Play the role of amateur detective Beatrice as she and her curious fairy, Lu, unravel the secrets of their hometown Fayburrow. When Beatrice is urgently called home, she discovers that her childhood friend, Agnes, is missing. Join the two detectives in searching the town for clues about Agnes' whereabouts; find out the truth of Fayburrow's past and perhaps you will discover the key to its present.<br/><br/>\"Fayburrow\" is a third person mystery adventure game with an emphasis on characters and story. It's atmospheric visuals and charming character interactions will transport you a world of fairies and untold history.<br/><br/><strong>EXPLORE</strong><br/><br/>Explore Beatrice and Lu's home town Fayburrow and delve deeper into the clues left behind by her childhood friend. Lose your self in the mysteries beneath the Hawthorne school's foundations.<br/><br/><strong>DIALOGUE</strong><br/><br/>Peppered into every corner of \"Fayburrow\" are snippets of memories, lore and story around Beatrice and Lu's mysterious past. <br/><br/><strong>EXPERIENCE</strong><br/><br/>Make sure to take your time and enjoy the gorgeous vistas, accompanied by music composed by Tobias Dahl Nielsen and rich sound design by Frederik Riis-Jacobsen. We hope that you enjoy our story. <br/><br/><br/>Happy investigating!", "metacritic": null, "released": "2022-02-03", "tba": false, "updated": "2023-11-04T07:43:41", "background_image": "https://media.rawg.io/media/screenshots/3a7/3a727625b31dce5e5332601876898c30.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Fayburrow Troupe"], "genres": ["Adventure", "RPG"], "publishers": ["The Animation Workshop VIA"], "esrb_rating": null}