{"id": 969468, "slug": "our-hero-two", "name": "Our Hero! Two", "name_original": "Our Hero! Two", "description": "<strong>Previous chapter:</strong> 🡨 Our Hero! First<br/><strong>Next chapter:</strong> Our Hero! Last 🡪<h3>Features</h3><ul><li> Real time battle system<br/></li><li> 3 playable characters, each with his own skills and strengths!<br/></li><li> New special skills in battle for more varied combat!<br/></li><li> A lot of new weapons!<br/></li><li> Cute and funny characters to interact with<br/></li><li> 9 completely new acts, plus some sections from returning areas<br/></li><li> Minigames: Arena deathmatch, Shotput, Relay race!</li></ul><h3>The Heroes</h3><br/>This is Ourhero. He mows through baddies with his ginormous swords and heals himself by eating meat, par for the course.<br/><ul><li> Ourhero is the only party member capable of equipping swords to dispatch foes in battle!</li></ul><br/><br/>Then there’s Tay, a valuable helper to Ourhero! Tay is of no help in battle, but he possesses fundamental skills such as:<br/><ul><li> Detecting and using magical skipping puddles!<br/></li><li> Take control of enemies thanks to his Controller Crystal Amulet<br/></li><li> Activate the mystical Monoliths, allowing you to teleport between areas you’re cleared.</li></ul><br/><br/>And here’s Fury. Not so skilled with weaponry, he nevertheless packs some powerful prosthetics which can clear obstacles right out of the way!. Fury can:<br/><ul><li> Climb and cling on to certain walls<br/></li><li> Kick some rocks to bust them open<br/></li><li> Absorb Red Power Orbs</li></ul><h3>Red Power Orbs</h3>These orbs allow you to upgrade certain swords, and even transform them into new weapons altogether! You can obtain them by:<br/><ul><li> Absorbing them with Fury when they’re clumped together in the overworld<br/></li><li> Defeating baddies</li></ul><h3>Story</h3>Our beloved King Has died.<br/>A hitherto unknown party has laid his claim to the throne, but his intentions are all but benign.<br/>He plans to siphon the special powers of every weapon in the world and collect them all into a single sword: his own!<br/>If nobody can stop him, his plan could plunge the heroes’ world into ruin, and he seems to even have ulterior motives than those…<br/>Fortunately, before the King perished he managed to gather two more heroes, who will be accompanying and assisting Ourhero in his quest!<br/>Prepare yourself, the world of heroes needs you!", "metacritic": null, "released": "2021-10-29", "tba": false, "updated": "2023-11-04T10:55:08", "background_image": "https://media.rawg.io/media/screenshots/d8c/d8c9e6065328c789e34d55d68d6b1bf5.jpg", "website": "https://stesproject.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 335, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ste's Project"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Ste's Project"], "esrb_rating": null}