{"id": 969416, "slug": "liftoff-micro-drones", "name": "Liftoff: Micro Drones", "name_original": "Liftoff: Micro Drones", "description": "Explore the world of FPV like never before! In Liftoff®: Micro Drones any indoor area becomes an exciting aerial playground. Explore, customize and compete in this simulator dedicated to the micro drones class.<br/><br/>The third installment in the Liftoff® Drone Simulations series, Liftoff®: Micro Drones is a love letter to the FPV community. Learning from previous projects, Liftoff®: Micro Drones offers everything you love about Liftoff games and takes it to the next level: better graphics, lower system requirements, improved UI, and fewer loading screens.<h3>Early Access</h3>We do not recommend the Early Access version to those expecting a finished product. The game currently is limited in content and features. <br/><br/>The Early Access version of Liftoff®: Micro Drones offers both single player and multiplayer experiences. The first releases feature 6 frames, including a unique hoverdrone, that can all be modified in an accessible virtual Workbench. In this early stage, the game includes three completely unique environments, each with a day and night version that feel almost like unique levels. <br/><br/>Future updates are slated to bring a track editor, Steam Workshop integration, game modes, and new frames and environments to explore.", "metacritic": null, "released": "2021-11-30", "tba": false, "updated": "2023-11-04T09:44:26", "background_image": "https://media.rawg.io/media/screenshots/fb6/fb62822f3de8383a15a5c90f7aac9281.jpg", "website": "https://www.liftoff-game.com/our-products/liftoff-micro-drones", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["LuGus Studios"], "genres": ["Action", "Simulation", "Sports", "Racing"], "publishers": ["LuGus Studios"], "esrb_rating": null}