{"id": 969493, "slug": "dessert-tank-the-saga-of-hansel-and-gretel-prologu", "name": "Dessert Tank: The Saga of Hansel and Gretel Prologue", "name_original": "Dessert Tank: The Saga of Hansel and Gretel Prologue", "description": "Dessert Tank is a single-player real time strategy game. Players can combine different parts to create tanks that do different things and build their own army of tanks. Players must quickly adapt to the situation on the battlefield against waves of enemies in order to achieve victory.<br/><br/>Main Features<h3>1. Customizable Tanks</h3>The game provides over a hundred different stickers and ingredients for the player to build their own unique tank. There are plenty of options ranging from flags to memes that can be used. Dive into this world of candy and let loose your flames of creativity!<br/><br/><h3>2. What kind of fighting style do you have?</h3>What kind of player are you? An attacker? A defender? A balanced one? Players can customize what skills their tanks have and select a range of skills according to their style. The ingredients on the tank are also able to provide the tanks with additional effects and bonuses.<br/><br/><h3>3. You have to think quick</h3>Powerful enemies await the player in every stage. Players must manage their resources carefully to not be caught off-guard. Random bonuses will also appear, and players should make good use of these bonuses to turn back the tide to defeat the horde of enemies coming their way.<br/><br/><h3>4. Tower Challenge Mode</h3>If you feel like defeating individual stages of enemies is easy, then you might feel like testing your limit. In the Tower Challenge Mode, every stage will have additional restrictions on the player, so a single misstep may mean death. Players can take on the challenges repeatedly to get a feel of the enemies and figure out the way the victory. Will you take on this challenge?", "metacritic": null, "released": "2021-10-29", "tba": false, "updated": "2023-11-04T11:29:14", "background_image": "https://media.rawg.io/media/screenshots/afa/afa58dae77ab4b0f58db6a48ea571f34.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["firepillar2"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["firepillar2"], "esrb_rating": null}