{"id": 969497, "slug": "the-patient-s-remedy", "name": "The Patient S Remedy", "name_original": "The Patient S Remedy", "description": "An adult BL game featuring blinking and lip-syncing animations in Full HD, which expresses the emotions and charms of the characters in a lively manner.<br/>Presented by Mada labo &amp; Tougo Mito, who attracted a lot of attention in his first work, Naked Butlers.<h3>STORY</h3>Progressive Cell Degeneration - commonly known as candle disease, is a strange disease in which the body melts or hardens like a candle, and typically leads to death within 5 years.<br/><br/>Sota Sasaki was diagnosed with \"candle disease\" and became a patient himself.  However, it turns out that his semen might be a cure...!?<br/><br/>Due to his bodily fluids’ miraculous nature, and in exchange for participating in research, he was given a special privilege: he will be treated like a king within this closed-off hospital world.<br/><br/><br/>However…<br/><br/>it has no effect on myself...<br/><br/>Do you sacrifice yourself for others and save?<h3>CHARACTER</h3><br/>佐々木 空歌　Sasaki Sota<br/>CV.伊吹島太郎　Ibuki Shimataro<br/><br/>A university student, 22 years old. An ordinary young man who goes out with friends, loves making noise at drinking parties, and occasionally studies, too.<br/><br/>He was infected by candle disease one day, and through desperation from his illness, begins displaying a wicked sadism…<br/><br/><br/>三島 春輝　Mishima Haruki<br/>CV.姫咲遙　Himesaki Haruka<br/><br/>An 18-year old-boy, ephemeral as if he had come out of a painting.<br/><br/>Because he is naturally weak and shy, he has no friends and only reads books.<br/><br/><br/>皆川 学　Minagawa Manabu<br/>CV.並木澪遠　Namiki Mion<br/><br/>A 29-year-old elite office worker who works for a major management consulting company after having graduated from a prestigious private university.<br/><br/>He has incredible talents, but his personality is terrible. He always looks down on others.<br/><br/><br/>安田 光雄　Yasuda Mitsuo<br/>CV.床魔乱夢崇矢　Tokomara Musuya<br/><br/>A 40-year-old candle disease patient. He lost his beloved wife in a car accident and has no children, so he has resigned himself to his illness, saying \"I will have no regrets when I die.\"<br/><br/>He is more concerned about the wellbeing of the people around him than his own.<br/><br/><br/>渋澤 秀司　Shibusawa Shuji<br/>CV.平井達矢　Hirai Tatsuya<br/><br/>A 38-year-old doctor and research officer at the Okuseyama Institute of Medical Science Hospital's Clinical Research Department.<br/><br/>He has quite an attitude and a foul mouth to boot, which was why he was sent off to Okuseyama. However, he seems to be a sincere and skilled doctor who treats his patients passionately, without being afraid of catching their disease.<h3>SPECIAL CONTENTS</h3><ul> <li>Newly drawn digital poster<br/> </li><li>A new short story, \"Playing Doctor\".</li></ul><br/>*The bonus novel is in Japanese text only. Please understand.<br/>*The bonus content is stored in a directory folder when the game is downloaded.<br/>Library-&gt;患者Sの救済(Right click)-&gt;Properties-&gt;Local Files-&gt;reference-&gt;Special_Steam", "metacritic": null, "released": "2021-09-29", "tba": false, "updated": "2023-11-04T11:34:43", "background_image": "https://media.rawg.io/media/screenshots/24a/24a4d66b37755072545d3b99958553f6.jpg", "website": "http://madalabo.com/kranke-s/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 344, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Mada Labo"], "genres": ["Adventure", "RPG", "Simulation", "Indie"], "publishers": ["MADA labo"], "esrb_rating": null}