{"id": 969400, "slug": "i-am-on-fire-xiao-xiao-huo-shen", "name": "I am on Fire (小小火神）", "name_original": "I am on Fire (小小火神）", "description": "This is a role-playing action game. In the game, the player plays a character wearing a wooden helmet, searching, exploration, fighting, solving puzzles, and triggering the plot in the game. The game shows players a dangerous southern land from a third-person perspective.<br/>\r\nThis game is author's graduation project <br/>\r\nTypes of games and how to play:<br/>\r\nThe game is a third-person role-playing game, and the protagonist can perform ordinary hacking and slashing as well as different kinds of special attacks. Players need to use different skills to fight against different types of enemies. With each level, players will unlock new skills and new enemies. And the difficulty of the game will also increase. The decryption part of the game is not simply solving puzzles or finding clues. The game will have enemies interacting during the decryption process to increase the tension of the game.<br/>\r\nGame Features:<br/>\r\nAll the models in the game are very detailed, and the scene and lighting effects use the latest technology of the unreal engine. There are more physical interactions in the game to ensure a more interesting experience.<br/>\r\nThe style of the game is the ancient Chinese style of the author's personal characteristics, which is very unique.<br/>\r\nGame Control：<br/>\r\nGames can be controlled with keyboard and gamepad.", "metacritic": null, "released": "2022-02-02", "tba": false, "updated": "2023-11-04T09:20:18", "background_image": "https://media.rawg.io/media/screenshots/070/0702f7d2c369a039100aab27bf2b2d25.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bgame"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Bgame"], "esrb_rating": null}