{"id": 969464, "slug": "gefragt-gejagt-das-spiel", "name": "Gefragt Gejagt - Das Spiel", "name_original": "Gefragt Gejagt - Das Spiel", "description": "Chaser or chased - who will ultimately emerge victorious from the studio? It's up to you! Experience the show up close. Finally, you can compete as a contestant against one of the chasers or take on the role of the chaser yourself and show the contestants that you have what it takes to be a real chaser. Play with up to three friends and decide completely freely how you want to split up. All four of you want to compete against the chaser just like in the real show and beat Sebastian Klussmann, Sebastian Jacoby or Klaus Otto Nagorsnik? No problem! You want to prove to your friends that you are the real chaser? Then take their place and play against them. For this purpose, we have prepared a special chaser that you can take over to make the candidates really sweat. THE CHASER BEGINS!<br/><br/>The show is hosted by Alexander Bommes, just like in the original. The original voices of the chasers Klussmann, Jacoby and Nagorsnik are also present and give the game a real show feeling.<br/><br/><ul><li>Everything is possible: play as a candidate or chaser<br/></li><li>General knowledge: Over 4,500 questions from 25 categories: There really is something for everyone here.<br/></li><li>Pure adrenaline: Prove what you really know under time pressure. Here you feel like you're on the real show!<br/></li><li>All together: Play with up to three friends. Who takes on which role is up to you.<br/></li><li>\"Mr. Klussmann, you're wearing an interesting shirt again today\": The little teasing between the host and the chaser is also part of the game, of course.<br/></li><li>Original voices: Alexander Bommes as well as Sebastian Klussmann, Sebastian Jacoby and Klaus Otto Nagorsnik speak their characters personally.</li></ul>", "metacritic": null, "released": "2021-10-29", "tba": false, "updated": "2023-11-04T10:49:37", "background_image": "https://media.rawg.io/media/screenshots/0e5/0e5d74dd06603721ba6283dfc787dc8c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Beatshapers"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["bitComposer Interactive"], "esrb_rating": null}