{"id": 969510, "slug": "dungeon-coup", "name": "Dungeon Coup", "name_original": "Dungeon Coup", "description": "Dungeon Coup is not your typical dungeon crawler... It is a dungeon for adults, filled with bratty doms, horny subs, restraints and lots of sex!<br/><br/>You have been challenged to run through your whole dungeon and back to your throne, however you will have to do so with your hands tied, and your horny subds will take any opportunity to prevent you from completing the challenge. <br/><br/>Will you complete the challenge? or submit to the pleasure?<br/><br/><strong>What is Dungeon Coup?</strong><br/>Dungeon Coup is a 3D dungeon crawler, full of erotic adult content, and BDSM themes. The gameplay includes dynamic dungeons, traps, restraints, and a ton of customization options, both for character creation, and for gameplay options.<br/><br/><strong>Game Features</strong><br/><br/><ul><li>Play through 10 different themed levels, and meet up to 46 different enemies!<br/></li><li>Customize the erotic content: You will only see the content you choose! (including many options like hetero, lesbian (yuri), gay (yaoi), futanari, pegging, etc.<br/></li><li>Play with female, male, femboy or futanari characters! <br/></li><li>Over 90 different 3D real time, animated sex positions!<br/></li><li>Dominate, Resist or Escape from your opponents charms!<br/></li><li>Create and customize your own characters with over 300 clothing pieces!<br/></li><li>Additional options for content like: Clothed sex, Neko mode, Ahegao, Enemies putting restraints on you, dirty talk, sex-type themed floors, etc.<br/></li><li>Includes a Story mode (with romances) and an Arcade mode with level selection.<br/></li><li>And much more!</li></ul><br/><br/><br/><strong>Fetishes &amp; practices featured</strong><br/>Mild BDSM, Domination, Submission, Female Domination (FemDom), Male Domination (MaleDom), Futanari (Futa), Pegging / Futa on Male Strap-on on Female Strap-on on Male, Titjob, titfuck, Footjob, feet play, Oral sex, Vaginal sex, Spanking, Facesitting, Breast Smother / Ass Smother, Clothed Sex, Interracial, Vanilla, Latex, Pantyhose, Muscular man, Neko, Bunny Suit, Glasses, Catsuits, Uniform, Lingerie, Stockings, Cosplay, Leotard …<br/><br/><br/><br/><br/>All the characters in this game are at least 19 years old, are part of the dungeon association by their own, and have no blood bond between them.", "metacritic": null, "released": "2021-09-27", "tba": false, "updated": "2023-11-04T11:51:13", "background_image": "https://media.rawg.io/media/screenshots/b51/b518e3c11dedab10c2029a1c7331729c.jpg", "website": "http://mrzgames.wordpress.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mr Z Games"], "genres": ["Adventure"], "publishers": ["Mr Z Games"], "esrb_rating": null}