{"id": 969553, "slug": "anchor-up", "name": "Anchor Up", "name_original": "Anchor Up", "description": "Anchor Up is a calming strategy puzzle game about out-manoeuvring your opponent's ships by careful navigation and weapon placement. The weapons you choose, and where you place them on your boat are all part of the puzzle. <br/><br/><strong>To complete each puzzle, you must sink the enemies' ships whilst avoiding the same fate for yours. Can you outsmart your foes?  Can you escape the grasp of the Azarak forces?</strong><h3>What to Expect</h3><br/><br/>   -40 hand-crafted puzzles with diverse modes<br/><br/>   -10 unique weapons to unlock<br/><br/>   -New puzzle and movement mechanics introduced throughout the experience<br/><br/>   -Multiple locations with varying weather and visuals<h3>How to Play</h3>During your turn you can either move your ship or you can use one of your weapons. The enemy ships (AI) will all then take their turn with the same two options. In the next phase, if any weapons were used by the player or the enemy in the previous phases they will be triggered/updated, for example cannon balls moving or lasers firing. Where you place your weapons is also important, so you can correctly align your weapon with an enemy! These core gameplay mechanics are then built upon with new environmental objects, varying enemies/weapons and much more in order to add layers of complexity towards the end levels! <br/><br/><br/>The movement in Anchor Up is a key part of the puzzle: your ship takes up two tiles, the front of your ship and the back of your ship. This means that thinking ahead is key to victory. When moving tiles, your boat rotates to face the direction you just moved, careful manoeuvring and navigation is vital! If you get a hit by a weapon or an enemy is in an adjacent tile (your ship being boarded) you fail the level.", "metacritic": null, "released": "2021-08-31", "tba": false, "updated": "2023-11-04T12:52:31", "background_image": "https://media.rawg.io/media/screenshots/ef9/ef92a1439d1bb4415193a9e5d5027e00.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cameron Fox"], "genres": ["Strategy"], "publishers": ["Cameron Fox"], "esrb_rating": null}