{"id": 969561, "slug": "wanderlust-the-bermuda-secret-collectors-edition", "name": "Wanderlust: The Bermuda Secret Collector's Edition", "name_original": "Wanderlust: The Bermuda Secret Collector's Edition", "description": "<strong>Mad Head Games</strong> proudly presents an exciting journey to a land that few have seen, and none have escaped in this adventurous new installment in the Wanderlust series!<br/><br/>You've been an oceanographer for years, and you've logged dozens of research flights, but you've never seen anything like this! When your flight takes you into an ominous cloud bank, you soon find yourself hidden within the eye of a permanent storm at the center of the Bermuda Triangle, with no connection to the rest of the world, no supplies, and no hope of escape from a strange island! To make matters worse, you quickly become caught in the middle of a showdown between the survivors that live on the island, and those that live within the vast network of twisted metal that hangs frozen in the skies. But which side is right, and who knows the truth about the exotic island at the center of everything? Prepare yourself for an experience unlike any other in this awe-inspiring new Hidden-Object Puzzle Adventure game!<br/><br/>This is a special Collector’s Edition release full of exclusive extras you won’t find in the standard version. The Collector’s Edition includes:<br/><br/>* Play as Collins to save your beloved in the Bonus Game!<br/>* Navigate the dangerous sky villages with an official strategy guide!<br/>* Go on an exciting treasure hunt and take on the ultimate HOP!<br/>* Enjoy exclusive concept art, soundtracks, wallpapers, and more!<br/>* Replay your favorite mini-games to unlock challenging achievements<br/><br/>This is a Hidden Object Puzzle Adventure game, meaning a specific genre of story-driven, point &amp; click adventures. Throughout the game, players are tasked to find a list of objects hidden within a particular scene, and to occasionally complete various mini-games/puzzles.", "metacritic": null, "released": "2021-08-31", "tba": false, "updated": "2023-11-04T13:03:17", "background_image": "https://media.rawg.io/media/screenshots/23c/23cb44205361a7d5be9b5ed1ef3dc64d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 331, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mad Head Games"], "genres": ["Adventure", "Casual"], "publishers": ["Big Fish Games"], "esrb_rating": null}