{"id": 969502, "slug": "a-tale-for-anna", "name": "A Tale for Anna", "name_original": "A Tale for Anna", "description": "This colorful fairytale A Tale for Anna will transport you to an enchanting, mysterious world full of puzzles, magical creatures, and secrets. Enter a kingdom of magic and wonder as you learn the story of young Anna – the last remaining sorceress in the kingdom.<br/><br/><br/><br/>One day, Anna (who was raised by a talking cat called Tail) discovers that she has magical abilities. However, these abilities also attract the attention of the evil Queen, who's been spying on Anna through a magic mirror.  The Queen has a wicked plan to steal Anna's magic and bring about an age of darkness. She's already taken the first step by sending her servants to kidnap Tail!<br/><br/><br/><br/>Explore enchanting worlds with Anna, play tricky minigames, and collect items to help you on your travels. Along the way, you'll learn more about Anna's biggest secret: where she came from.<br/><br/>Help Anna to fulfill her destiny and stop the Queen!<br/><br/><h3>Features:</h3><br/><ul><li>Uncover the secret of Anna's origins across five captivating levels<br/></li><li>Dazzling art style<br/></li><li>Lots of challenging and original puzzles and minigames<br/></li><li>Find the items you need with the help of Anna's magical powers<br/></li><li>Colorful and picturesque fantasy locations full of interesting characters</li></ul>", "metacritic": null, "released": "2021-09-28", "tba": false, "updated": "2024-03-14T15:58:19", "background_image": "https://media.rawg.io/media/screenshots/675/6759ab16c2a2137da48acd79c534a295.jpg", "website": "https://steamcommunity.com/groups/alawargames", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["Far Mills"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Alawar Entertainment"], "esrb_rating": null}