{"id": 969646, "slug": "lollipop-2", "name": "LOLLIPOP!", "name_original": "LOLLIPOP!", "description": "<h3>New hentai game - \"LOLLIPOP!\" </h3><br/><br/><br/>LOLLIPOP! Is an addicting hentai puzzle game with delicious, sweet candy combinations!  In LOLLIOP! You will find many bright levels with hot girls and various visual effects, from this game you will just have a real sweet BOOM!<h3>BEAUTIFUL 100 ACHIEVEMENTS!</h3><br/><br/><br/>In this game you need to correctly match the same candies in a row so that they disappear (no matter in which direction), collect points, and open new levels. <br/>After each completed level, you will discover new pictures and animations of sexy, beautiful girls! Collect the required number of points and conquer one level after another with beautiful, hot girls! <br/><br/><br/>With \"LOLLIPOP!\" You will be able to breathe from difficult games, you will immerse yourself in the world of various, colorful candies and beautiful, sexy girls! <br/>Here you will find an amazing variety of new levels, a beautiful gallery, animation and pleasant music! <br/>Collecting colorful candies will become more and more interesting with each new level! Enjoy an interesting game and beautiful, hot girls at the same time! Many interesting levels with stunning graphics are waiting for you! <br/><br/><h3>What you can find in this game:</h3><br/><ul><li>Challenging and interesting levels at the same time. <br/><br/></li><li>Incredible graphics and animation.<br/><br/></li><li> Lots of sexy girls.<br/><br/></li><li> Incredible sound and visual effects. <br/><br/></li><li>At each level, new pictures and animations of girls<br/><br/></li><li> Relax and have a great time.</li></ul><h3>Artist: jagaimo </h3>", "metacritic": null, "released": "2021-05-31", "tba": false, "updated": "2024-04-19T18:59:08", "background_image": "https://media.rawg.io/media/screenshots/cfb/cfb902ccf2b506d0178352f2761a2b50.jpg", "website": "https://twitter.com/F430_", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 11, "beaten": 1, "toplay": 1}, "playtime": 4, "achievements_count": 100, "ratings_count": 1, "suggestions_count": 473, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["TheBoys", "430Games"], "genres": ["Casual", "Indie"], "publishers": ["430Games"], "esrb_rating": null}