{"id": 969691, "slug": "industry-idle", "name": "Industry Idle", "name_original": "Industry Idle", "description": "<h3>Feature Highlights</h3><br/>- 130+ different factories to build and manage<br/>- 90+ different resources to produce, buy and sell<br/>- Realistic market simulation that challenges your trading skill<br/>- 12+ Procedurally generated maps with both hex grid and square grid<br/>- Unlock 50+ powerful policies that drastically change the gameplay<br/>- Manage and optimize your economy with detailed charts and data tools<br/>- Offline earning based on your company's valuation<br/>- Prestige and unlock powerful upgrades<br/><br/><h3>Choose Your Own Play Style</h3>Each factory has a lot of tweaks that you can micromanage and optimize. Or you can just sit back, trust the game AI and watch the numbers go up, either way, you can enjoy the game with your own play style. And you even get earnings when you are offline!<h3>Optimize Your Economy</h3>There are a lot of tools in the game to help you analyze your production bottlenecks, wasted resources, and imbalanced resource distribution. There are powerful policies that allow you to take your economy to a whole new direction.<h3>Trade with Global Players</h3>Trade resources with global players in the real-time player market. Take advantage of lucrative deals from \"big sharks\" to advance in early games until you become a big shark and outsource your productions to other players.<h3>Prestige and Progress Further</h3>Prestige allows you to unlock new maps with new resources and endless possibilities. You also earn $wiss money to unlock permanent upgrades to help with start faster and expand bigger.", "metacritic": null, "released": "2021-03-29", "tba": false, "updated": "2024-04-09T09:06:42", "background_image": "https://media.rawg.io/media/screenshots/00e/00e950c833a7d8f3404fa61e7654c3bc.jpg", "website": "https://industryidle.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 59, "dropped": 1}, "playtime": 1, "achievements_count": 71, "ratings_count": 1, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "macOS", "PC"], "developers": ["Fish Pond Studio"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Fish Pond Studio"], "esrb_rating": null}