{"id": 96976, "slug": "solitary-voyage", "name": "Solitary Voyage", "name_original": "Solitary Voyage", "description": "<p>An important mission turns into a disaster. When the ISX-48 launched, nobody expected there to be such an accident with such horrible consequences.<br/></p>\n<p>A lonely escape pod remains and while trying to reach home, some of the mysteries surrounding the ISX-48 might be revealed.<br/></p>\n<p>Controlling the onboard computer of the almost broken pod, the player navigates through the vastness of space in this visual novel.</p>\n<p>Along the way, there are several encounters that determine the outcome of the story.</p>\n<p>Solitary Voyage is a short visual novel, that can be completed in about an hour, but also offers some replay value when experimenting with the different choices along the way.</p>\n\n<p><em>Available for Windows, Linux and macOS.</em></p>\n<p><strong>Note:</strong> The game has been developed and tested in Windows 7-10 32 and 64bit. Linux and macOS builds are offered, but not supported. Using Windows is highly recommended to ensure the best compatibility.</p>\n<p>This game was made for the Capstone Project in the 5-Course Game Design and Development Specialization by Michigan State University at Coursera.org.</p>\n\n\n<p><strong>Update version 1.0.6:</strong></p>\n<p>Did some minor adjustments and fixed a bug that would cause the player to be able to restart the current location from the beginning.</p><p><strong>Update version 1.0.7:</strong></p><p>Fixed some errors in the true (fourth) ending.<br/></p>", "metacritic": null, "released": "2018-04-22", "tba": false, "updated": "2019-08-28T23:25:32", "background_image": "https://media.rawg.io/media/screenshots/0dc/0dcd73cc94005b93b9857a3f574119ba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["FloppyTapeGames"], "genres": [], "publishers": [], "esrb_rating": null}