{"id": 969777, "slug": "lost-lands-redemption-collectors-edition", "name": "Lost Lands: Redemption Collector's Edition", "name_original": "Lost Lands: Redemption Collector's Edition", "description": "Who is scarier to Susan the Warmaiden: an evil and vengeful ancient deity, or her own angry and resentful son?<br/>\n<br/>\r\n“Lost Lands: Redemption” is an adventure game in the genre of Hidden Objects, with plenty of mini-games and puzzles, unforgettable characters and complicated quests.   <br/>\n<br/>\r\nSusan carelessly spends her time in the Lost Lands, trying to maintain order. But a dangerous relic has been discovered on Earth, so she must return to her homeland.<br/>\r\nHowever, as a result of the time difference between the two worlds, Susan was away much longer than she anticipated. Unfortunately, it didn't go unnoticed. Her son Jim is angry with his mother because of her sudden disappearance.<br/>\r\nSusan wants to solve the issue as fast as possible to restore the order in the world, but her simple plan will never work. Now Jim is involved in the adventures of his mother against his will.<br/>\r\nWill Jim forgive and accept his mother for who she is? Will Susan put her family above saving the world and a life full of endless adventures? <br/>\r\nWill mother and son establish a relationship while in the center of the disaster?<br/>\r\nIt's time to explore every corner of the Lost Lands! Find hiding spots and collect manuscripts full of ancient knowledge. Use your mind and wits to solve the mysteries of the magic temple and defeat the vengeful ancient deity.<br/>\n<br/>\r\nSolve the mysteries of the secret temple and find the magic artifact of an ancient deity.<br/>\r\nDefeat powerful villains with your attention and persistence!<br/>\r\nDive deep into new and dangerous adventures with old and loyal friends!<br/>\r\nThe vengeful deity broke free!  Stop him before he regains his power!<br/>\r\nFind the places safely hidden from prying eyes and reveal their secrets!", "metacritic": null, "released": "2020-12-30", "tba": false, "updated": "2023-11-04T18:07:28", "background_image": "https://media.rawg.io/media/screenshots/1c9/1c96ee8f41fe39902529ff9ba8a9d677.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 22, "ratings_count": 0, "suggestions_count": 600, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FIVE-BN GAMES"], "genres": ["Adventure", "Casual"], "publishers": ["FIVE-BN GAMES"], "esrb_rating": null}