{"id": 9697, "slug": "alien-swarm-reactive-drop", "name": "Alien Swarm: Reactive Drop", "name_original": "Alien Swarm: Reactive Drop", "description": "<p>Alien Swarm: Reactive Drop is a standalone expansion pack to Alien Swarm developed by Valve. The base game is included.</p>\n<h3>Setting</h3>\n<p>In distant future, the interplanetary travel was finally made possible. One planet was classified by the government for establishing a secret research base. It got overrun by aliens who were brought to the planet for research. A super elite squad was sent to deal with this problem.</p>\n<h3>Gameplay</h3>\n<p>Alien Swarm: Reactive Drop is a cooperative top-down shooter. While only four-player squads were present in the base game, the limit was brought up to eight for the expansion pack. </p>\n<p>The game&#39;s core mechanics are not much different from the base game. The player&#39;s squad has to reach the end of the level while completing objectives, that require teamwork. For example, one of the players has to weld the door while the others cover them.</p>\n<p>The game features a class-based mechanics. Every class is proficient in their own field and has to work in a team in order to succeed in the game. Four classes are present in the game featuring eight unique characters.</p>\n<p>It is also possible for the players to unlock new weaponry for their classes by progressing through the game. Players also get new items for leveling up. It is also possible to reset your progress after reaching max rank and earn a badge for your proficiency.</p>", "metacritic": null, "released": "2017-04-20", "tba": false, "updated": "2024-04-21T00:50:01", "background_image": "https://media.rawg.io/media/screenshots/4b3/4b3cbf42e305385dd6bdcde65daf7099.jpg", "website": "", "rating": 3.37, "rating_top": 4, "added_by_status": {"yet": 73, "owned": 1977, "beaten": 57, "toplay": 8, "dropped": 136, "playing": 9}, "playtime": 1, "achievements_count": 206, "ratings_count": 266, "suggestions_count": 426, "game_series_count": 0, "reviews_count": 267, "platforms": ["PC"], "developers": ["Reactive Drop Team"], "genres": ["Action"], "publishers": ["Reactive Drop Team"], "esrb_rating": null}