{"id": 969717, "slug": "shachibato-president-its-time-for-battle-maju-wars", "name": "Shachibato! President, It's Time for Battle! Maju Wars", "name_original": "Shachibato! President, It's Time for Battle! Maju Wars", "description": "An all-new Japanese SRPG based off “Shachibato! President, It's Time for Battle!”.<br/>Jump into battle with up to 5 teammates at once, featuring a 3D anime style and full 3D backgrounds!<br/>As the president of a modern-day adventuring company, hire and train new warriors to send out and conquer dungeons in a unique and innovative character development system!<br/>Randomly generated enemy groups and hidden treasure means infinite exploration!<br/><br/><strong>Story</strong><br/>You'll take control of our hero, a young entrepreneur who's in charge of an adventuring company. One day, as you're out shopping for some new adventuring gear, a massive earthquake rumbles throughout the city. Upon stepping outside, you notice that right where your company office once stood, a mysterious portal has appeared! Now you must delve into the dangerous business of dungeon exploration in order to rescue your employees and restore your business!<h3>Game Play Features</h3><strong>Incorporation:</strong> Start by incorporating your adventuring company to get your team of explorers up and running.<br/><br/><strong>Turn-Based Battles:</strong> Shachibato adopts a traditional turn-based SRPG battle system where players will take control of up to 5 units to battle against fierce enemies. You'll choose commands and execute actions for each of your units, who will learn a wide range of impressive skills to take down your opponents.<br/><br/><strong>Deadly Enemies:</strong> As you explore various dungeons, you'll encounter many different monsters, each of which has their own unique skills and attack styles. So you'll have to adapt on the fly if you want to win!<br/><br/><strong>Dungeon Exploration:</strong> Within dungeons are various treasures and items as well as specific missions to clear. Also your missing employees are waiting for your rescue, so explore the dungeon and search them out!<br/><br/><strong>Trap Panels:</strong> Dungeons will have floor trap panels that continuously change. Traps can hinder your way but also can be used to take advantage of. <br/><br/><strong>Hire New Talent:</strong> Through your HR department you can hire new adventuring employees. There are a variety of jobs such as warrior, cleric, wizard, and so on. Decide what skill sets you need most and interview your new recruits!<br/><br/><strong>Rebuild Your Company:</strong> You company has been crushed into the dirt with the appearance of a mysterious gate. You'll need to explore dungeons and gather valuable loot in order to build your company back up from scratch.<br/><br/><strong>Investments:</strong> The most important asset to a company is the employee. You can invest in your employees to teach them new skills and improve their stats.<br/><br/><strong>Shopping:</strong> Every company needs supplies to function. Spend the money you earn from exploring to purchase items from the shop that can help you continue to grow your company. (Naturally, the company will cover all shopping-related expenses.)<br/><br/><strong>The Toichi Gate:</strong> This mysterious gate appeared out of nowhere and leads to terrifying dungeons. The gate will open every 10 days, so before then you'll have use your time wisely to recruit and train a talented group of employees to send into it!<br/><br/>*Additional DLC like new playable characters and story chapters will become available as they are completed.", "metacritic": null, "released": "2021-03-30", "tba": false, "updated": "2023-11-04T16:38:55", "background_image": "https://media.rawg.io/media/screenshots/b3a/b3a7be71ced0809aeebf10f21db323f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 338, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PREAPP PARTNERS"], "genres": ["Adventure", "Strategy", "Simulation"], "publishers": ["Preapp Partners"], "esrb_rating": null}