{"id": 969797, "slug": "colonials-programme", "name": "Colonials Programme", "name_original": "Colonials Programme", "description": "Colonials Programme is a game about resource management and colony building. Inspired by games like Factorio, Mindustry and Anno.<br/><br/><h3>Make your mark, build your colony:</h3>With 12 different machines to choose from, construct colonies on a tile-based map. Each mission features differing terrain and layouts. Plan your placements wisely and make the most of your machines!<h3>Harness the power of the elements:</h3>Extract elements from the planet to fuel your colony's expansion! Utilize the elements to create essentials like power, water and oxygen.<h3>Juggle your needs in real-time:</h3>As your colony grows, so does its needs! Machines require resources for maintenance and power to run. Watch your pollution levels and the supply limit for machines. Stay attentive or you might find yourself quickly overwhelmed!<h3>Challenge yourself, accomplish your goals:</h3>Each mission presents a unique set of objectives to be completed. This can range from sheltering a number of colonists, launching rockets or even levelling the planet of its terrain!<h3>Embark on an interstellar adventure:</h3>Join two robots, AI &amp; Mimi, as they attempt to find their place in a vast universe. Colonials Programme features a Campaign Mode with over a dozen missions for you to explore.<h3>Become a master of worlds:</h3>Build your own custom maps to challenge yourself or your friends. Colonials Programme features a fully fledged Map Editor that gives you all the tools you'll need to design your own missions.<br/><br/><br/><strong>Features</strong>:- Colony building<br/>- 12 Different machines to build<br/>- 8 Different elements to utilize<br/>- Campaign Mode<br/>- Upgrades for AI &amp; Mimi<br/>- Map Editor<br/>- Custom soundtrack", "metacritic": null, "released": "2020-12-29", "tba": false, "updated": "2023-11-04T18:31:51", "background_image": "https://media.rawg.io/media/screenshots/4c1/4c160527845adc8eb23fedc15d19c1f1.jpg", "website": "https://colonialsprogramme.wordpress.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CookieLegends"], "genres": ["Simulation"], "publishers": ["CookieLegends"], "esrb_rating": null}