{"id": 969750, "slug": "evil-seal-2", "name": "Evil Seal", "name_original": "Evil Seal", "description": "Evil Seal is an action horror game inspired by the Apocalypse of St. John.<br/><br/><br/><br/>The story begins when the first of the Seven Seals is broken and the first of the Four Knights begin to spread confusion and destruction on Earth.<br/>The new Messiah, the devil's son, manages to create a new religious cult by performing initial miracles, with many followers. The \"miracle-people\" discover the price they have to pay soon: a few months after the miracle, their bodies are emptied of all traces of humanity. The new religious order followers will be transformed into beings with no rationality or control, hungry for human flesh and incapable of feeling.<br/><br/><br/><br/>Adam is a man deeply in love with his sweet half, Eve. But fate is cruel: when the first seal of the apocalypse is broken, Eve is kidnapped by dark forces.<br/><br/>Thus, with a broken heart and an incredible determination, Adam embarks on a desperate journey to find the love of his life. Along the way, he will face epic challenges and unveil dark secrets, battling evil creatures and overcoming insurmountable obstacles.<br/><br/><br/><br/>A real estate agent, with a past in the marines, helps Adam to find Eve in a city devastated by demons and infernal creatures.<br/>And the story continues...<br/>What will happen when the other seals are broken?<br/><br/><br/><br/>This game is the first of a trilogy that provides for the breaking of the 7 seals of the apocalypse.<br/><br/><br/><br/>Raffaele Mandese created this video game entirely on his own, covering all aspects from graphics, gameplay, sounds, to the story. The team Mandese Games is the name of the team he formed, but currently, it only has him as a member.", "metacritic": null, "released": "2021-02-08", "tba": false, "updated": "2023-11-04T17:27:12", "background_image": "https://media.rawg.io/media/screenshots/0d9/0d9c969420b1bc78253331189376882f.jpg", "website": "https://www.evilseal.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 508, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Raffaele Mandese"], "genres": ["Action", "Indie"], "publishers": ["Raffaele Mandese"], "esrb_rating": null}