{"id": 96980, "slug": "dinocide-demo", "name": "Dinocide demo", "name_original": "Dinocide demo", "description": "<p><strong>Description</strong></p>The protagonist has to save his love interest who was kidnapped by an evil and mysterious Dinosaur God. You are accompanied by your own tame Dinosaurs, who act as a mounts, brother in arms and a true friends. With their help, you can jump higher, run faster, swim, fly and do a lot more things that an ordinary primitive man would never be able to do by himself. To reach your goal, you will travel together through the lands inhabited by ancient creatures and unknown dangers. <br/><p><strong>Features</strong></p><ul><li>Dinosaur mounts make you faster, stronger and offer a variety of tactical abilities. </li><li>Non-linear progression by different routes leads to varied ways to complete your journey. </li><li>A multitude of different biomes to visit - deserts, jungles, forests, lava caves, oceans, ice plains and more! </li><li>Weird creatures. Ok, fine, we know about the dinosaurs. But millions of years ago there could be something else we have no idea about.</li><li>Unique time/life mechanic. One bar shared for both the time limit on the level and life of your character. </li><li>Full controller &amp; Steam Big Picture support. </li><li>Classic action. Don't think. Don't feel. Just go. React. Kill. Jump. Eat. Ride. Like in the good old times! You are not here to watch a movie! </li><li>The unmatched fun and drive of an 8-bit era game!</li></ul>", "metacritic": null, "released": "2015-12-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c96/c96174cea781d12a7bebd6d860013b8b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["AtomicTorch"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}