{"id": 969892, "slug": "d100-dungeon-computer-companion", "name": "D100 Dungeon Computer Companion", "name_original": "D100 Dungeon Computer Companion", "description": "D100 Dungeon is a game in which you will steer an adventurer through underground caves and dungeons, looking for lost treasures and completing dangerous quests.  With each game your adventurer will gain wealth, recognition and become stronger and increasingly skilled in their pursuits.   The Computer Companion has been carefully modeled after the pen and pencil version, which you will need in order to know the rules (which are available separately).  The game enforces all the rules and does all the bookkeeping for you.  It is not intended to replace the book version, but to provide a different means to enjoy D100 Dungeon.  it is possible to switch between the computer version and the book version mid-game by using the Print and Edit features.<br/>\n<br/>\r\nYour journey begins when you create an adventurer and start performing the dungeon training missions.  Once they have been successfully completed your Adventurer will be ready to face some greater challenges and begin questing in an endeavor to gain notoriety and wealth, rivaling that of royalty and who knows, one day their greatest exploits might even become stories and songs performed by bards in every tavern throughout the Kingdom.<br/>\n<br/>\r\nThe Computer Companion draws the maps and processes the adventure sheets, allowing you to sit back, relax and enjoy the story being created. Plus you will have professional looking maps to print out and keep for years to come.<br/>\n<br/>\r\nNote that it is necessary to purchase the pen and pencil version separately.  The Companion does not provide any of the documentation that comes with the pen and pencil version.", "metacritic": null, "released": "2020-09-14", "tba": false, "updated": "2023-11-04T20:39:11", "background_image": "https://media.rawg.io/media/screenshots/684/6844cd7516c196174043f158b69fa665.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Steve Weinrich", "Martin Knight"], "genres": ["Adventure", "RPG"], "publishers": ["Dungeon Software US"], "esrb_rating": null}