{"id": 969850, "slug": "under-domain-alien-invasion-simulator", "name": "Under Domain - Alien Invasion Simulator", "name_original": "Under Domain - Alien Invasion Simulator", "description": "Under Domain is a turn-based strategy game that invites you to create and execute an alien invasion plan directed to Planet Earth.<br/><br/><br/><br/>Transform yourself into the Reptilian leader that will lead your species to victory! Secretly influence human evolution by sabotaging their technologies, sending hybrids agents, executing operations of murder, mind-control, abductions, and virus contamination. Meanwhile, you build a powerful war fleet to attack at the right moment.<br/><br/>Under Domain accompanies human history from the 1900s until the year of 2020. The player has 10 movements each turn, and each movement represents one year of human existence, completing one decade at the end of each turn. Your actions must be accurate to avoid drawing the attention of humans. After all, possible alien spaceship sightings could reveal your existence to human Nations, and they can get ready to attack you first, increasing the difficulty level of the invasion phase. <br/><br/><br/><br/>The game offers you simple ways of planning and executing the invasion, though with highly strategic combinations of actions that can lead you to different possible winning scenarios. Under Domain is a strategy game easy to learn but hard to master completely.<br/><br/><br/><br/><br/><br/>Explore the energy coming from pyramids, seek rare volcanic minerals to build your war machines, and launch orbital and surface probes to capture and interfere in human history's relevant facts.<br/><br/><br/><br/><br/>Evolve your mothership and get access to new resources and instruments to raise your war power. Choose from 3 evolution pillars in each decision: Science, Military, or Infrastructure.<br/><br/><br/><br/><br/><br/>Replace key people on Earth's evolution. You have to choose wisely which specialists will be able to sabotage human war power. <br/><br/><br/><br/><br/><br/>Search, build, and enhance your spaceships. Spread them around Planet Earth, so in the moment of invasion, all of them rise in different locations to combat phase.<br/><br/>_", "metacritic": null, "released": "2020-10-22", "tba": false, "updated": "2023-11-04T19:41:15", "background_image": "https://media.rawg.io/media/screenshots/631/631c25993ac526ea96a3fe7387b5b81c.jpg", "website": "https://www.underdomain.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 305, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Playlearn"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Playlearn"], "esrb_rating": null}