{"id": 9698, "slug": "dark-passenger", "name": "Dark Passenger", "name_original": "Dark Passenger", "description": "<ul><li>    Navigate through a thrilling hostile confinement without the use of your sight!<br/></li><li>    Discover the mysteries of a twisted and horrifying location.<br/></li><li>    Stealth and agility will be your weapons of choice, use them wisely.</li></ul><br/>Can YOU rise up to the challenge? You've never had to be without your eyes before...<br/><br/>Enjoy a new experience with this Audio only game where you must learn to use your ears to survive.<br/><br/><br/>Setting<br/><br/>Dark Passenger starts you off in a morbid scenario of having a panic attack as your character adjusts to the fact that their eyes have been recently removed from their body. You are soon greeted by a mentally suspect man, who seems to take perverse, sadistic pleasure in your situation, yet tries to calm you down, promising to guide you to safety.<br/><br/>In order for you to navigate this unknown environment, you must use your ears to pin point items as well as dangerous enemies and obstacles so that you may progress. Soon, you will meet with alert guards who chase you down in escape sequences as well as encounter stealth situations, where you must make little noise and stay out of sight of patrols by using your ears to map out where enemies are going and use your cunning to create openings.<br/><br/>Experience new sensations as you use learn to use your ears and gradually learn how to face the challenges this presents. You will die, a lot. Enjoy.<br/><br/>", "metacritic": null, "released": "2017-03-31", "tba": false, "updated": "2019-08-28T22:14:49", "background_image": "https://media.rawg.io/media/screenshots/445/4455eece62f08472a175e7f3e2e9f46f.jpg", "website": "http://www.ideacabin.co.uk/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 59, "beaten": 1}, "playtime": 3, "achievements_count": 14, "ratings_count": 2, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "PC", "Linux"], "developers": ["Idea Cabin"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Idea Cabin"], "esrb_rating": null}