{"id": 969987, "slug": "test-of-courage-2", "name": "Test Of Courage", "name_original": "Test Of Courage", "description": "<strong>Test of Courage</strong> is a first-person horror game set in a abandoned school setting. The school is called Brave Wood Academy, and you play as Marco. Marco is a Brave Wood alumni along with his two friends, Ralph and Natalia. Shortly after your graduation, Natalia sent a letter and disappeared. One year later, Ralph discovered a message hidden within the letter. The only hint Natalia had given was the <strong>Courage Test</strong>.<br/><br/><strong>The Courage Test</strong> is a challenge that requires the challenger to explore the school after hours in search of 10 items while maintaining their sanity. <br/><br/><strong>World Setting</strong> In this game's universe, history diverges from our own near the end of World War 2. Thomas Crowder, a war journalist, discovers a new threat to humanity while documenting the aftermath of the atomic bombs dropped on Japan. Monsters had appeared near the ruins and were given the name Crowder's Buffers. After the war, Buffers began appearing after huge casualties caused by humans. They would never venture out past the area that they had appeared in, and it was impossible for humans to reclaim the lost territories. Over the past few decades, Crowder's Buffers would be left alone. Scientists and  experts would be sent in to learn more about these creatures. <br/><br/><strong>Brave Wood Academy</strong> was the school that Marco, Ralph, and Natalia all attended. It was a private school that had a program allowing gifted students to attend the academy tuition free. At the end of every year, the administration would select two seniors for a special program that would send them to the university of their dreams. Underneath the gleaming image of the school however, students spoke of dangerous rumors. Mysterious creatures had been sighted on campus after dark. After a sighting was documented, the creatures were identified as Buffers. Before the situation could get any worse, the school shut down before that information could be made public.<br/><br/><br/><strong>Game play</strong><br/>Throughout the game you'll have to maintain your sanity and health while venturing through the school. Find and take pills to restore sanity/health, or batteries and other items for light sources. Not everything you see is real, certain attacks from buffers are in your mind and will only reduce your sanity. Other attacks will be physical and will damage your health. Explore the school grounds and discover more about the school's dark history along with more information on Crowler's Buffers.", "metacritic": null, "released": "2020-10-26", "tba": false, "updated": "2023-11-04T22:48:00", "background_image": "https://media.rawg.io/media/screenshots/8f5/8f5a5f0dab55cb12194e310857e687dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Just Sauce Studio"], "genres": ["Adventure", "Indie"], "publishers": ["Just Sauce Studio"], "esrb_rating": null}