{"id": 969905, "slug": "successor-of-the-key", "name": "SUCCESSOR OF THE KEY", "name_original": "SUCCESSOR OF THE KEY", "description": "Successor of the Key is a side-scrolling shooting game where you control a magical girl and seal off \"the Spirit Tree\" that erodes the world.<br/>\r\nSakura, who was made a magical girl by Aminasia from another world, defeats \"the Spirit Tree\" using her special sword!<br/>\r\n 1. Story scene with beautiful graphics<br/>\r\n 2. Enemies launching various attacks<br/>\r\n 3. Bosses blocking the path of Sakura<br/>\r\n 4. What is waiting at the end of the story ...<br/>\n<br/>\r\nIn A.D.20XX, a gigantic tree emerged out of nowhere in the urban area of Tokyo and started soaking up the energy of life forms in the area.<br/>\r\nThe Japanese government named the tree the Spirit Tree and began their subjugation operations against the tree.<br/>\r\nBut even the Self-Defense Forces, that historically is used to deal with huge life forms, were annihilated over and over again when they took the field. There was nothing they could do when facing the Spirit Tree which can neutralize electronic machines.<br/>\r\nThe forces kept failing for about a year, and then the Spirit Tree suddenly became inactive. The government didn’t miss this chance and set the zone within a radius of 3.5 miles from the Spirit Tree as off-limits. All they could do was merely observing it while staying alert.<br/>\r\nThree years were on after the silence, people were leading their daily life being indifferent to the Spirit Tree towering over them.", "metacritic": null, "released": "2020-09-29", "tba": false, "updated": "2023-11-04T20:57:14", "background_image": "https://media.rawg.io/media/screenshots/fc0/fc0a7f4290e884022de8dbaf72cf0e70.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AKIBA-Willow"], "genres": ["Action", "Casual", "Indie"], "publishers": ["WILLPLUS"], "esrb_rating": null}