{"id": 969933, "slug": "dragus-puzzle-adventure", "name": "Dragu's Puzzle Adventure", "name_original": "Dragu's Puzzle Adventure", "description": "<strong>Prepare for Dragu's first puzzle adventure!</strong><br/><br/>From dutch artist <strong>Sebastiaan de Kimpe</strong> (The Netherlands) finally introducing a new 3D puzzle game from Yebbes Gamestudio. Since 1992 when Sebastiaan drawn Dragu as a little kid this little green dragon on primary school Dragu evolved to comics, newspapers and children books!<br/><br/><h3>Moving Blocks</h3>In a stunning colorfull 3D environment you must guide Dragu in moving blocks and finding treasure chests with keys. When you have collected all the keys you can complete the puzzle by moving to your Duck friend! Sounds easy? Take the challenge!<br/><br/><h3>Smart enemies</h3>The unique enemies with their properties will make this game even more challenging. Avoid attackers while collecting the keys! Except for just being in your way these enemies will spit fireballs, try to electrocute you or event hunt you down while you run for the finish!<h3>Stages</h3>Dragu's Puzzle Adventure offers 25 different stages in 5 beautifull themes. The puzzles needs to be solved in volcanoes, snowy mountain peaks and forests.<h3>Buy Once, No Worries</h3>The game is for all ages and there are no in-app purchases involved. There is no need for registration on another network or platform. Just simple: Buy once, play when you want: just like the old days ;-)", "metacritic": null, "released": "2020-10-21", "tba": false, "updated": "2023-11-04T21:33:43", "background_image": "https://media.rawg.io/media/screenshots/ac9/ac9ce7f118583c8ef946e9ed053e416b.jpg", "website": "https://www.yebbes.nl/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yebbes Gamestudio"], "genres": ["Adventure"], "publishers": ["Yebbes Gamestudio"], "esrb_rating": null}