{"id": 96999, "slug": "tiny-town-saga", "name": "Tiny Town Saga", "name_original": "Tiny Town Saga", "description": "<p>Play four fun mini-games as you explore the town, earning money as you go. Buy a house, sleep in your own bed - all the pleasures of free life, right in your pocket!</p><p><strong>Features:<br/></strong>- A whole bunch of fun games, from splitting logs to chasing chickens to keeping the town's streetlight's lit!<br/>- Buy a house and outfit it with nice things<br/>- Dozens of characters with unique lines of dialogue<br/>- Beautiful day / night cycle which will affect your mini-games<br/>- All original hand-drawn artwork<br/>- Two original compositions by @carlospazuzu</p><p>The game autosaves your progress whenever you win a game - you don't need to do a thing! Just re-load the game and start playing again!</p><p><strong>&gt;&gt;&gt;What's missing?<br/></strong>- The intro level, in which your Mom throws you out.<br/>- More minigames, natch.<br/>- More music. Carlos did amazing so late in the day, I wish he could have had time to write more songs! Check out @carlospazuzu if you need game music!<br/>- The day/night cycle was to affect more than just lighting etc - shops and jobs would close, others would open, some NPCs wouldn't be around etc.<br/>- One or two of the delivery missions are broken - only exposed this a few hours after the jam ended. Boo!</p><p><strong>Thanks</strong> to all on itch and Twitter for love and support during jam. Going to sleep now, for the first time in a week it feels!</p>", "metacritic": null, "released": "2016-10-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9f8/9f8c910b90fd162816df07cd104f1272.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["chilly_durango"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}