{"id": 970062, "slug": "fatcat-with-hat-reload-the-powergun", "name": "FatCat with Hat - Reload the Powergun", "name_original": "FatCat with Hat - Reload the Powergun", "description": "FatCat's life is relaxed. But one day his great love Mrs.Cat is kidnapped by the nasty FatDog. FatCat immediately sets out to save his beloved, but the cunning FatDog is prepared. He sends his henchmen to take out the unloved adversary.<br/>\n<br/>\r\nBut FatCat is cunning and so begins his little odyssey through the different parts of the world of FatDog! The hat always with you... and of course the Powergun.<br/>\n<br/>\r\nWhat awaits you:<br/>\r\n-------------------------------------------------------------------------------<br/>\n<br/>\r\nFatCat jumps and runs through the worlds. With the powergun at the ready FatCat can defeat all enemies. But the world of FatDog is mean, you will often need several attempts before you reach the boss.<br/>\n<br/>\r\nBoss Opponent:<br/>\r\nEach world has two bosses that try to take you down.<br/>\n<br/>\r\nOpponents:<br/>\r\nMany different enemies and types of enemies await you on your journey. Everyone needs a different strategy and some enemies are incredibly strong and will chase you all the time.<br/>\n<br/>\r\nPowergun:<br/>\r\nWith the power gun you can defeat any opponent. Collect powergun containers in the game to fire extra powerful shots that will instantly defeat almost any standard opponent or inflict heavy damage on bosses.<br/>\n<br/>\r\nGame modes:<br/>\r\nThe game has a story mode with 6 levels in total. You will need several attempts to succeed.<br/>\r\nIn the challenge mode you can test your skills. Here 40 bonus missions await you. <br/>\n<br/>\r\nControl:<br/>\r\nYou can play the game using your touch screen. We recommend that you connect a gamepad to make the controls more precise. We have slightly simplified the handling of the Powergun in the touch controls to create a frustration-free experience.<br/>\n<br/>\r\nLanguage: <br/>\r\nThe game is available in English and German. Choose a language at the beginning when you start the game.", "metacritic": null, "released": "2020-03-17", "tba": false, "updated": "2023-11-05T00:28:59", "background_image": "https://media.rawg.io/media/screenshots/df3/df3091f881acb68fbc30533ddb01432c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mathias Neubert"], "genres": ["Action", "Indie"], "publishers": ["Mathias Neubert"], "esrb_rating": null}