{"id": 970008, "slug": "the-harrowed", "name": "The Harrowed", "name_original": "The Harrowed", "description": "Explore the dying world of Ulm in The Harrowed, a new story-driven RPG from Salmon Raws, LLC. In a land torn asunder by magic, six adventurers find themselves embroiled in the endless dance of order and chaos. <br/><br/>The backwater village of Elkshire is beset by dark forces from all sides. 300 years after the cataclysmic Harrowing ravaged Ulm, rumors of witch's magic, vengeful spirits, and man-eating Worgen haunt this quaint logging town. Six outsiders find the survival of this community thrust upon their shoulders. It is up to you to guide these heroes as they strive to overcome the arcane horrors lurking in every shadow.<h3>Characters</h3>The party is led by Orena, a young nun of the Grand Church of the Allmother. Raised among other orphans by the Church, she has been tasked by the Clerics to hunt a renegade mage accused of murder. She is escorted by Sergeant Clive Beckett, a gruff career military man unable to escape past deeds, and Hargon Buckfield, the snarky footsoldier.<br/><br/>Along their journey, they are joined by Farryn Greatstalker, a pragmatic Half-Elven scout contracted to lead them through the dreaded Wightwood. The party is rounded out by Vlastok the pensive tribesman from the northern plains, and Suntori, one of the few remaining Elves left alive on Ulm.<br/><br/>With distrustful survivors, shape-shifting fiends, and arcane mischief around every shadowy corner, will you live to see another dawn in this Harrowed World?<br/><br/><br/><ul><li>Experience a 4-6 hour story-driven RPG exploring the arcane-ravaged world of Ulm.</li><li>Defeat vicious enemies in a battle system which juggles ability cooldowns and spell mana.</li><li>Master the abilities and strengths of 6 different heroes striving to uncover the mystery of the dark forces assaulting Ulm.</li><li>Collect Harrowed Shards to craft powerful Shardborne Artifacts.</li><li>All enemies can be seen on the map. With no random battles, you can pick and choose your fights.</li><li>Original pixel art gives life to Ulm's menacing creatures and  haunted heroes.</li></ul>", "metacritic": null, "released": "2020-05-14", "tba": false, "updated": "2023-11-04T23:15:14", "background_image": "https://media.rawg.io/media/screenshots/a35/a358a97fa483977a31d1871bb7e20847.jpg", "website": "https://www.salmonraws.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Salmon Raws"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Salmon Raws"], "esrb_rating": null}