{"id": 9700, "slug": "street-fighter-v-cfn-beta", "name": "Street Fighter V CFN Beta", "name_original": "Street Fighter V CFN Beta", "description": "Play STREET FIGHTER® V completely FREE for a limited time! This is an official PC Beta to test out the improved Capcom Fighters Network and online infrastructure. Only online modes will be available.<br/><br/><strong>Official STREET FIGHTER® V PC Beta Test schedule:</strong><ul><li><strong>5/11 3PM:</strong> Pre-load for the PC Beta starts<br/></li><li><strong>5/11 6PM:</strong> Servers open for play<br/></li><li><strong>5/14 6PM:</strong> PC Beta concludes</li></ul>All times are listed as Pacific Time (PT) and are subject to change.<br/><br/>The legendary fighting franchise returns with STREET FIGHTER® V! Stunning visuals depict the next generation of World Warriors in unprecedented detail, while exciting and accessible battle mechanics deliver endless fighting fun that both beginners and veterans can enjoy. Challenge your friends online, or compete for fame and glory on the Capcom Pro Tour. The path to greatness begins here: RISE UP!<br/><br/>For a full list of features available in the main game, please visit: http://store.steampowered.com/app/310950/<strong>FEATURES</strong><ul><li><strong>New and Returning Characters:</strong> Classic characters like Ryu, Chun-Li, Charlie Nash and M. Bison return! Many more new and returning characters will be added to the diverse roster, offering a wide variety of fighting styles for players to choose from.<br/></li><li><strong>New Strategies and Battle Mechanics:</strong> Highly accessible new battle mechanics, which revolve around the V-Gauge and EX Gauge, provide an unprecedented layer of strategy and depth to the franchise that all players can enjoy.<ul class=\"bb_ul\"><li><strong>V-Trigger:</strong> Unique abilities that use the entire V-Gauge, which allow players to turn the tide of battle.<br/></li><li><strong>V-Skill:</strong> Unique skills for each character that can be done at any time.<br/></li><li><strong>V-Reversal:</strong> Unique counterattacks that use one stock of the V-Gauge.<br/></li><li><strong>Critical Arts:</strong> Ultimate attacks that use the entire EX Gauge.</li></ul></li><li><strong>Next Gen Visuals:</strong> Unreal Engine 4 technology pushes the realism and next-gen visuals to new heights, making this latest entry the best looking and most immersive Street Fighter game of all time.</li></ul>", "metacritic": null, "released": "2017-03-28", "tba": false, "updated": "2023-01-21T07:34:15", "background_image": "https://media.rawg.io/media/screenshots/b60/b601cc7bc1159ba9993f35ccb4865938.jpg", "website": "http://www.streetfighter.com/", "rating": 2.16, "rating_top": 1, "added_by_status": {"yet": 20, "owned": 547, "beaten": 6, "dropped": 13}, "playtime": 1, "achievements_count": 0, "ratings_count": 51, "suggestions_count": 674, "game_series_count": 0, "reviews_count": 51, "platforms": ["PlayStation 4", "PC"], "developers": ["Capcom", "Capcom U.S.A"], "genres": ["Action"], "publishers": ["Capcom"], "esrb_rating": null}