{"id": 970097, "slug": "sector-assault", "name": "Sector Assault", "name_original": "Sector Assault", "description": "Sector Assault is a revolution of the classic Asteroids formula. In this inspired twist, your mission is to defeat an enemy armada with weapons and tactics as varied as your own. Your battle across the sector will include...<h3>14 Powerful Loadout Options</h3><br/>Wield any combination of four weapons and equipment. Fire swarms of missiles, get up close and personal with the Scattershot, or zap enemies from behind cover with Chain Lightning. Equipment offers even more tactical flexibility than weapons. Teleport, stun high-priority targets, or project an energy field that increases ramming damage.<h3>16 Deadly Enemies and Their Variants</h3><br/>The opposing fleet includes everything from phased cruise missiles to raiders that teleport in and out of play. Evade mobile mines and sweeping lasers as you exchange fire with heavily armed and armored juggernauts. Supercharged variants fire their special attacks continuously, giving even basic enemies the power to fill your screen with projectiles.<h3>30 Waves of Finely Crafted Mayhem</h3><br/>Enemies are capable of warping in formation or surrounding you without warning. Further testing your reflexes are endless combinations that complement each other or overwhelm with brute force. Even in the most chaotic moments, spawn timings are fine-tuned for a smooth and satisfying pace.<h3>The Beauty of Deep Space</h3><br/>Sector Assault's backgrounds have been selected from thousands of randomly generated combinations. Each one is streaked with vivid nebulas and enhanced by parallaxing for added depth. Rounding out the game's atmosphere are music and sound effects handpicked with equal care.<br/><br/>Choose your loadouts wisely, adapt faster than your enemy, and achieve victory in your mission to secure the sector!", "metacritic": null, "released": "2020-02-06", "tba": false, "updated": "2023-11-05T01:16:36", "background_image": "https://media.rawg.io/media/screenshots/3c0/3c003a227b0e72015fa49fe62444deb2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 21, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Brian Crandell"], "genres": ["Action", "Indie"], "publishers": ["Brian Crandell"], "esrb_rating": null}