{"id": 970010, "slug": "minoes", "name": "Minoes", "name_original": "Minoes", "description": "Minoes is a Tetris-like stack-em-up with a Rubik's Cube thrown in. It builds on the core gameplay of Tetris-likes and Match-3s and brings an innovative twist; you can only place as many minoes as you can catch. With it's colourful backdrops and blend of gameplay styles, it establishes itself as a unique arcade action puzzle game.<br/><br/><br/><br/><br/>The Adventure mode of Minoes includes over 100 levels across 12 environments. There are four game types within; finding shapes, getting points, comboing specific minoes and survival. There are also several special minoes to help with the clearing. You can clear a large area, sweep a whole row and column into a certain colour and even flip gravity!<br/><br/><br/>There's also an endless Arcade mode for when you need that  quick fix! The difficulty slowly increases, starting with single Ominoes and progressing to Pentominoes. The action also gets faster and faster, requiring players to think quickly and tactically.<br/><br/><br/><br/><br/><ul><li>Over 100 levels across 12 environments<br/></li><li>4 game modes to have fun with in Adventure mode and an Endless arcade mode for a quick fix of Minoes action<br/></li><li>Charming Synthwave soundtrack<br/></li><li>Supports Keyboard or Controller.<br/></li><li>Innovative fusion of Match-3 and Tetris-like games.<br/></li><li>Pleasing Flat Design art-style</li></ul>", "metacritic": null, "released": "2020-05-13", "tba": false, "updated": "2023-11-04T23:17:49", "background_image": "https://media.rawg.io/media/screenshots/10d/10d92e70ccc6d58fc31bedecee89ad33.jpg", "website": "https://www.modacodegames.com/minoes", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Moda Code Games"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Moda Code Games"], "esrb_rating": null}