{"id": 97013, "slug": "crazy-cart-chaos", "name": "Crazy Cart Chaos", "name_original": "Crazy Cart Chaos", "description": "<p>\r\n\tCrazy Cart Chaos was originally developed by 5 MFA students from the NYU Game Center on the 2nd annual \r\n\tTrain Jam – a 52 hour game jam that takes place on the historic California Zephyr train line from Chicago to San Francisco the week before GDC. They then continued working on it as their final project for Eric Zimmerman's Game Design 2 class.\r\n</p>\n<p>\r\n\tThe game is a frantic, fast-paced local multiplayer where four players share two controllers. Each player uses one half of a PS4 controller to play, using only the shoulder button and analog stick on their side. Players control train carts and have one minute to deliver as many passengers as they can to the correct stations. But players can steal passengers from others as well! The more a player is able to fill a station with passengers of their color, the more bonus points they will get when the station fills and is reset.\r\n</p>\n<p>\r\n\tWhile seemingly simple at first glance, an interesting strategic depth emerges after playing for a while. Players can choose to focus on picking up passengers or camping around drop-off points and try to steal from opponents more. Is it wiser to go try to fill one station, or spread your drop-offs out? Players must be able to predict where their enemies are planning to go to in order to avoid or intercept them correctly. Of course, all of this is happening within one minute – so split-second reaction timing is needed as well.\r\n</p>\n<ul>\n<li><em>Unique control scheme</em>: No other local multiplayer has four players using two controllers. Just like the original Pong arcade cabinet, we're intentionally bringing players closer together.</li>\n</ul>\n<ul>\n<li><em>Accessible but deep</em>: We've found that all kinds of people love the game. People who don't usually play games enjoy the simple controls and cute art style, while hardcore competitive players quickly pick up on the deeper strategies involved.</li>\n</ul>\n<ul>\n<li>Quick matches, high replayability: Each match only lasts a minute - we've found that players just can't stop playing after just one round.</li>\n</ul>\n<p>\r\n\tCreated by\r\n\t<br/>\r\n\tChris McGinnis - CS Wallace - Emma Wang - Mauricio Juliano - \r\n\tWyatt Yeong<br/>\n</p>", "metacritic": null, "released": "2015-03-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/dba/dba22f473f4e8f40d4b050b06fefb84e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["kroftee", "cswallace"], "genres": ["Action"], "publishers": [], "esrb_rating": null}