{"id": 970109, "slug": "fu-shi-mo-qian-zhi-qian-shi-jin-sheng", "name": "浮世万千之前世今生", "name_original": "浮世万千之前世今生", "description": "This game mobile game has synchronized end game, mobile game free, built-in sponsorship, like you can add group download, QQ group: 996164712<br/>End game main plot all over, to look forward to the work, the world of the third series of the world of the world love war first part<br/>Notice to players: This game is mainly about the plot, so most of the task information is suggested in the dialogue. If you don't watch the dialogue carefully, you may miss the plot hint and the game will progress slowly or stop.<br/>At present, new chapters: Refining qi, Zhu Ji, Jindan, Yuan Ying early chapter, Yuan Ying middle chapter, Yuan Ying late chapter, Hua Shen, Ying Changzhang, the final chapter<br/>Current game Duration: 30-130 hours (perfect)<br/>Note:<br/>1. At the beginning of this game design, it is carried out in accordance with the real world of cultivating immortals, so it is extremely difficult. Those who are prone to autism are not allowed to buy this game.<br/>2. The root of cultivating immortals is diligence and perseverance, there is no road to heaven.<br/>3. Every enemy has its own fixed way of attack, no patience, can not find the pattern, also can not kill.<br/>There are adventures and choices in this world, and that is why one step is wrong, and one step is wrong.<br/>Problem feedback:<br/>Official QQ communication group (group guide) : 456606490<br/>E-mail: 903516931 @qq.com Brief Introduction: [/]<br/>\"There are three things I love.Sun, Moon and Qing.The sun for the morning, the moon for the evening, and you for the morning and evening.\"<br/>A person, a sword, a love, a city, a home.Everyone has an indelible story in his heart, this is the story in my heart.<br/>Child: \"Are you immortal?\"<br/>Qiushen: \"Does that matter?\"<h3> Gameplay: </h3>1. Traditional turn-based combat mode<br/>2. School system<br/>3. Choice: Each choice will affect the subsequent development of the plot<br/>4. Unique skill training: Player: \"Why can skills be degraded?\"Author: \"This is how it should be!\"<br/>5. Featured institutions<br/>Explore 6.", "metacritic": null, "released": "2020-01-27", "tba": false, "updated": "2023-11-05T01:33:00", "background_image": "https://media.rawg.io/media/screenshots/08a/08a38d38261179176e634fc8ed063cd5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["飞天大胖喵"], "genres": ["Adventure", "RPG", "Strategy", "Casual", "Indie"], "publishers": ["飞天大胖喵"], "esrb_rating": null}