{"id": 970170, "slug": "armorgeddon", "name": "Armorgeddon", "name_original": "Armorgeddon", "description": "Test your skills and strategies as an armor commander in levels where the starting units change, landscapes are treacherous, and the enemy is tough in the war torn future that is Armorgeddon.  Armorgeddon is a unique and re-playable game where every each hand crafted battlefield is full of power ups and surprises.  Play each level and win to unlock further tests and trials in the campaign.       <br/>\n<br/>\r\nThere are 4 themes across 24 levels.  Desert, Forest, Mountain, and Apocalyptic.  Each time a level is started, units are randomly selected from a list of available units for that level making the game play different each time.  There are 9 units that have different abilities.  All units use action points to enable movement and ability to fire so use them wisely.  Sight range and attack ranges vary per unit and all units require a line of sight to hit.  <br/>\n<br/>\r\nArmorgeddon includes a perk system that increases your in game currency every time you are victorious.  The harder the level the more currency you earn.  Currency is used to purchase perks during the level adding abilities such as Repair Unit, Repair All Units, Restore Unit Action Points, Restore All Units Action Points, Air Strike, Buff Attacks, Buff Defense, 9 types of reinforcements and more!<br/>\n<br/>\r\nUse the power coins to energize your units with a short burst of special abilities to win the day.<br/>\n<br/>\r\nCustomize your units!  Use the camo painter to select one of 5 different camo patterns and more than a million color combinations.  You can save up to two paint schemes.<br/>\n<br/>\r\nThere are more than 50 in game achievements, try to collect them all!<br/>\n<br/>\r\nArmorgeddon is bringing the concept of a classic turn based hex board game into 3D life.  Mythopia Studios is committed to making a fun, re-playable experience that is challenging and enjoyable.   Armorgeddon was originally based on a paper and pencil turn based game.  The idea blossomed into a hex board game, but we wanted to take that concept one step further and bring it to life in 3D.", "metacritic": null, "released": "2019-12-11", "tba": false, "updated": "2023-11-05T03:05:50", "background_image": "https://media.rawg.io/media/screenshots/f5c/f5c6752024d1dfff7bd055e533761d87.jpg", "website": "https://mythopiastudios.yolasite.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Glenn Soderquist", "Nick Soderquist"], "genres": ["Action", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Mythopia Studios"], "esrb_rating": null}