{"id": 97010, "slug": "usurper-itch", "name": "Usurper (itch)", "name_original": "Usurper (itch)", "description": "<p><em>Usurper</em> is a Metroidvania Action-RPG that focuses heavily on gameplay - with a unique battle system and significant replayability. With the game inspired by <em>Symphony of the Night</em>, <em>Super Metroid</em> and the <em>Souls</em> series, your duty is to rid London of the Eldritch horrors unleashed by the Citadel.</p>\n\n<p> Gameplay </p>\n<p><em>Usurper's</em> battle system is built around Focus; allowing anyone to get into the game, yet still providing a high skill ceiling for those players looking for a challenge. With eight different stats to spec into, along with stat reallocation, countless varieties of character builds are possible. Usurper also features over 90 different weapons and spells; from swords, spears, axes, great swords, sycthes, whips, katanas, rapiers, daggers, bows, guns, rifles, canons, spells and summons.<br/></p>\n<p>If you're looking for even more content, then there are innumerable secrets, additional areas and optional bosses to discover. Or perhaps you'd rather set your own difficulty by activating special conditions such as; no focus mode, 1 HP mode, perma-death, or a built-in speedrunning mode.<br/><br/>However you choose to play, The Citadel is a massive and versatile interconnected world. There are countless shortcuts to uncover, and a variety of diverse areas; from human towns to alien landscapes, grand libraries to ethereal gardens, and from an eldritch engine to a crashed spaceship.</p>\n\n<p> Story </p>\n<p><em>Usurper</em> takes place in an alternative timeline of 1898 in London. The outer worldly Citadel has landed in the city causing massive panic and releasing the maddening Fog. Recently re-crowned Empress Eleanor has assembled the royal forces and her four most loyal Knights to enter the Citadel - in the hopes of learning more, and hopefully finding a way to rid London of this terror. Meanwhile, Waltham, the leader of the Veimar, uses his own forces to ascend the Citadel and challenge the Navigator for his own...<em>purposes</em>...<br/></p>\n<p><em>Usurper</em> is a sequel to  Shrouded in Sanity  , however, knowledge of the first game is not necessary.<br/><br/>For updates on how <em>Usurper</em> is progressing, feel free to follow us on Twitter</p>", "metacritic": null, "released": "2017-02-27", "tba": false, "updated": "2019-08-28T23:25:32", "background_image": "https://media.rawg.io/media/screenshots/fc5/fc515f1f7ad22906de0e1b1807d9c269.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 346, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pugware"], "genres": ["Action"], "publishers": [], "esrb_rating": null}