{"id": 970175, "slug": "devil-threats", "name": "Devil Threats", "name_original": "Devil Threats", "description": "Description : Years ago Professor Christopher was working on an important experiment that was near-impossible to accomplish. Things were not going as smoothly as he'd hoped... The experiment that a few subjects were included had failed and his friend named John betrayed him and made things worse. Shortly after the experiment, his daughter got lost and 2 years later he got a message that her daughter had written saying she was at her grandfather's house and she wants to be saved from there... After that, Cristopher hit the road to save his daughter<br/>\n<br/>\r\ndt Set in the same universe as the first game, but with different characters and a different setting, dt is a twisted new journey into the depths of the human mind and its dark secrets.<br/>\n<br/>\r\ndt introduces you to and his followers, who left our wicked world behind to give birth to deep in the wilderness and hidden from civilization. his flock are preparing for the tribulations of the end of times and you’re right in the thick of it.<br/>\n<br/>\r\nThe two of you are investigative journalists willing to take risks and dig deep to uncover the no one else will dare touch.<br/>\n<br/>\r\nThe investigation has lead you miles into the to a darkness so deep that no one could shed light upon it, and a corruption so profound that going mad may be the only sane thing to do.<br/>\n<br/>\r\nFps camera, puzzle, horror, survival game<br/>\n<br/>\r\nMain Features<br/>\n<br/>\r\nAtmospheric Musics<br/>\n<br/>\r\nA Deep and Tense story<br/>\n<br/>\r\nMade In Unreal Engine 4 With Great Graphics", "metacritic": null, "released": "2019-12-12", "tba": false, "updated": "2023-11-05T03:12:51", "background_image": "https://media.rawg.io/media/screenshots/ec1/ec19b88c93645534526adbd12abb77c8.jpg", "website": "https://www.instagram.com/afroksgamersstudio/?hl=tr", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AFROX GAME"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["AFROX GAME"], "esrb_rating": null}