{"id": 970139, "slug": "wizard-warfare", "name": "Wizard Warfare", "name_original": "Wizard Warfare", "description": "Wizard Warfare is a fantasy-themed, 4X-style, turn-based strategy game with a strategic empire management layer supported by a detailed tactical battle simulation layer. It is a game of exploration, conquest and magic.<br/><br/>The focus is a 'retro' graphical style coupled with deep, complex gameplay mechanics and heavy use of random/procedural generation to ensure extensive replayability.<br/><br/>The goal of Wizard Warfare is to defeat all opposing enemy Wizards. Each Wizard must settle and grow cities, build armies, hire spellcasters, research spells and wage war until only one Wizard remains standing!<br/><br/>Wizard Warfare consists of a strategic level (the World Map) and a tactical level (the Battle Map). Exploration, expansion, production, research and city management all happen on the World Map, while battles are simulated on the Battle Map.<br/><br/>Wizard Warfare focuses extensively on replayability. Maps are generated randomly from a variety of settings, although if you find a random map you like, it can easily be regenerated from the same initial settings and random 'seed' for use in future games.<br/><br/>With 3 distinct magical schools, 5 distinct magical paths and over 200 fantasy-themed units, from tiny insects to massive fire-breathing dragons, a huge variety of strategic and tactical options are available. Playing as a Holy mage will be a very different experience to playing as a Death mage!<br/><br/>The world of Wizard Warfare is hostile, with enemy Wizards, neutral cities and rampaging monsters beyond your borders.<br/><br/>Wizards start weak, with only a single city, a small military force, a few scouts and very little research. Choosing priorities wisely is essential. Focusing on exploration can yield crucial information about enemies’ strengths and weaknesses, and give early warning of attacks or reveal lucrative monster lairs to capture. Focusing on magic and research leads to more powerful magical spells which can overwhelm your enemies. Focusing on economic expansion can lead to huge empires supporting massive armies in the late game. Focusing on early military expansion can catch enemies by surprise if their attention is elsewhere, but be careful not to overextend! No single strategy is guaranteed to win every time.<br/><br/>It is not necessary to view every single battle to win a game of Wizard Warfare. However, understanding how your troops perform in different battle situations, along with their strengths and weaknesses against a variety of enemies will give you a significant advantage!<h3>Key Features</h3><ul><li>4X-style turn-based strategy</li></ul><ul><li>Strategic empire management</li></ul><ul><li>Balance exploration, economic growth, magical research and military conquest</li></ul><ul><li>Detailed tactical combat simulations</li></ul><ul><li>Over 200 distinct fantasy-themed unit types</li></ul><ul><li>3 schools of magic with 5 different paths -150 spells in total</li></ul><ul><li>Random map generation</li></ul><ul><li>Currently supports English language only</li></ul>", "metacritic": null, "released": "2019-12-13", "tba": false, "updated": "2023-11-05T02:22:35", "background_image": "https://media.rawg.io/media/screenshots/242/2428ae9d6bdc4c308cc3660c6fa54e0a.jpg", "website": "http://www.wizardwarfare.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 39, "ratings_count": 0, "suggestions_count": 320, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Psyanotek"], "genres": ["Strategy", "Indie"], "publishers": ["Psyanotek"], "esrb_rating": null}