{"id": 970103, "slug": "world-of-voidiaxu-ya-shi-jie", "name": "World of Voidia（虚亚世界）", "name_original": "World of Voidia（虚亚世界）", "description": "summary:<br/>\r\nYou wake up from the endless darkness, you get a chance to leave this boring world, you gain another life in a world full of swords and magic. A strange land is full of unknown adventures. Destroy the world or save it, it is your decision to make. In the edge of this world, something is waiting for you, a hidden secret. You will have to find the answer and the reason why you come to this world.<br/>\n<br/>\r\nIt is an open-world RPG game, you can only explore the first part of the land for now (The rest of lands are still developing).<br/>\r\nWe plan to create many main stories, based on the player's choices, the story may be different (The main idea we try to create for players).<br/>\r\nOf course, It also means multiple ends as well.<br/>\r\nWe plan to make stories and meanings for every NPCs, but it may take a lot of developing time to do so.<br/>\r\nThe game will have a huge amount of hidden quests, items and stories (We believe exploring is a key and interesting feature in open-world games).<br/>\n<br/>\r\nSome uncertain developing features (You may discuss and advise in the Steam Discussion Board):<br/>\r\nPlayers can choose their classes (player can paly any classes in the team)<br/>\r\nPlayers can have their own town or castle and may be able to improve it.<br/>\r\nA more complex fighting system, by mixing different classes, elements and so on to get higher damage.<br/>\r\nFeel free and welcome to tell us any other ideas and suggestions.<br/>\n<br/>\r\nYou can contact us on Steam Discussion Board or email us 1097630238@qq.com.", "metacritic": null, "released": "2020-01-31", "tba": false, "updated": "2023-11-05T01:26:36", "background_image": "https://media.rawg.io/media/screenshots/6c4/6c4bfe91a01c61c32ddf3d48942cf628.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Voidia Game"], "genres": ["Adventure", "RPG"], "publishers": ["Voidia Game"], "esrb_rating": null}