{"id": 9701, "slug": "beyond-despair", "name": "Beyond Despair", "name_original": "Beyond Despair", "description": "Beyond Despair is a multiplayer game in the survival horror genre with an emphasis on immersive gameplay and player interaction. It’s currently in alpha development, so bear with us.<br/><br/>The game takes place on Ansora Island, the epicenter of a paranormal catastrophe that took place two years before the events of the game’s main storyline. The island presents players with a highly dangerous and hostile environment full of monsters, anomalies, and various hazardous global events.<br/><br/>The player is thrust into the role of a New Light Corporation volunteer, tasked with taking the first steps in their new initiative involving ongoing research into the events that transpired on the island to ascertain the root cause of the catastrophe. Players will be able to piece together the island’s recent history through a variety of notes, audio records, and observable changes to the environment.<br/><br/>Your trial by fire (and more) on Ansora will begin on the island’s southern shore, as you come face to face with your new, perilous home away from home...<br/><br/>Gameplay<br/>The world of Beyond Despair is full of dangers. Every move may lead to unexpected results, and every critical decision you make on your journey may be your last.<br/><br/>Castaways survive on an island. Inhabitants of Ansora, however, have to survive the island itself, which is no easy task by any measure. Thousands of volunteers have been sent to Ansora by the New Light Corp. – will you be the one to conquer the chaos that lies before you and solve the island’s dark mystery?<br/><br/>Food and water won’t be the only things you need to survive. Violent weather patterns, global events, roaming monsters, former citizens of the isle, and even ghosts will test your body, while illnesses and anomalies will ravage your mind. Think you’re prepared? Others have thought the same, but Ansora had other plans for them.<br/><br/>Furthermore, to add a sense of purpose to the trying task of survival on Ansora, we’ve included a primary storyline and generated a series of missions for players to take up. As you take on the role of a volunteer for the New Light Corporation, these missions will serve as a vague guideline, yielding insight into the recent events responsible for turning the island into the terrifying place it has become.<br/><br/>Features<br/><ul><li><strong>FEAR</strong>: We want “horror” to be more than just a buzzword, so we’ve worked hard to really give our players a scare.<br/></li><li><strong>EXPLORATION</strong>: Immerse yourself into a unique setting based on industrialism, dieselpunk, and architecture from the first half of the twentieth century.<br/></li><li><strong>CRAFTING</strong>: Craft mods for guns and melee weapons, or make medical supplies, food and other consumables.<br/></li><li><strong>SURVIVAL</strong>: Watch out! Starvation isn’t your only threat. Your character can die from low temperatures and other harmful weather conditions, anomalies, global events, and the very wildlife inhabiting the island.<br/></li><li><strong>STORY</strong>: A variety of missions and dynamic scenarios coupled with an overarching main questline will further add variety to your gameplay as you learn more about the history of Ansora.<br/></li><li><strong>CUSTOMIZATION</strong>: Develop your character and choose perks that will boost your chances of survival.<br/></li><li><strong>STEALTH</strong>: Employ our robust stealth system to avoid enemies or take them down without riling up other threats.</li></ul><br/>Development plans<br/>Here’s our list of current and planned features. This entire list is slated to make it into the full release of the game this year. We want to hear your feedback, so don’t hesitate to drop us a line or engage with us on the Beyond Despair Steam Community page.<br/><br/><strong>Translations.</strong><br/>Ready: English and Russian version of texts and audio files.<br/>Planned: translation into German, French, Italian, Spanish and Chinese.<br/><br/><strong>Story.</strong><br/>Ready: first chapter of the story, generated missions, tens of notes and audio records.<br/>Planned: full story with an ending scene. Hundreds of notes and audio records from people who lived on the island. New types of generated missions.<br/><br/><strong>Crafting.</strong><br/>Ready: We have already added about 40 recipes and blueprints.<br/>Planned: about 60 recipes of weapons, mods, stimulators and food.<br/><br/><strong>Global &amp; Dynamic Events.</strong><br/>Ready: several global events influencing gameplay on the entire island, plus one dynamic event (think side quest that triggers in a specific location). <br/>Planned: 15 global events and several new dynamic events.<br/><br/><strong>Safe Zone &amp; Player Instances.</strong> <br/>Ready:  the Oasis Safe Zone that allows players to escape the ravages of the island for a while, plus your personal stash for storing items.<br/>Planned: NPCs for Safe Zones, such as item traders, and your own room with benches for crafting and spots for trophies collected throughout the island.<br/><br/><strong>Stealth System.</strong><br/>Ready: the system is fully implemented.<br/>Planned: balance changes and integration of perks and buffs. <br/><br/><strong>Character Development</strong><br/>Ready: part of the perk system added.<br/>Planned: perk system for your character, oriented towards helping you survive (won’t affect combat between players).<br/><br/><strong>Locations. </strong><br/>Ready: Ansora occupies a sizeable island split into numerous distinct locations of varying sizes, both on the surface and underground.<br/>Planned: possible addition of new islands around Ansora, plus additional content for current locations and addition of new locations. <br/><br/><br/><strong>Loot. </strong><br/>Ready: many variants of food and water, four types of clothes, many items for recycling, ingredients for crafting, two types of guns, 23 types of melee weapons, and several types of modifications.<br/>Planned: more of every type.<br/><br/><br/><strong>Unique interactions.</strong><br/>Ready: not yet implemented.<br/>Planned: ability to discover hidden stashes throughout the island and recover artifacts.<br/><br/><br/><strong>Creatures and anomalies.</strong><br/>Ready: three types of peaceful animals, six types of hostile creatures, two types of Screamers (the terrifying entities that haunt Ansora) , and seven types of anomalies.<br/>Planned: many new NPCs, including up to five peaceful entities, four Screamers, and eight types of hostile creatures.", "metacritic": null, "released": "2017-01-16", "tba": false, "updated": "2019-08-28T22:14:49", "background_image": "https://media.rawg.io/media/screenshots/622/622b1686142713ceb6c593b0df20290a.jpg", "website": "http://beyonddespair.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 33, "beaten": 1, "dropped": 1}, "playtime": 3, "achievements_count": 32, "ratings_count": 3, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["PixelMate"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Heatherglade"], "esrb_rating": null}