{"id": 97018, "slug": "super-trader-64", "name": "Super Trader 64", "name_original": "Super Trader 64", "description": "Gameplay:\r\nThe Goal:\r\n<p>Your goal is to keep trading items around until you get enough Yarn or Tennis Balls required to trade for the chocolate that you need.  <br/>New trading items are gradually introduced to the trading cycle, so it may take a while before any Yarn or Tennis Balls appear.  </p>\r\nInstructions:\r\n<p>To complete a trade, simply pick up items from your bag and drop them in the trader's paw. Items that you drop on the ground or that you give the trader will return to you if the trade is not completed successfully. If at any point you wish to pick up dropped items, simply press the \"Sweep\" button. You can also shuffle the items around in your bag by pressing the Shuffle button.  </p>\n<p>A timer activates when you are in a trade that gives you sixty seconds to complete the active trade. If you leave the trade, the timer will pause, but will continue once you return to the trade.  </p>\n<p>If you fail to complete a trade on time, the trader will lose their patience and will request a different set of items. If you fail a second time, they will require 2 minutes to cool off before requesting again. If a trade is successful, you will be rewarded with new items and this specific trader will take a little time before requesting a new trade.  </p>\r\nNintendo 64?\r\n<p>Yes! We purposely styled the game to look like an early N64 game! With camera controls similar to what you'd expect from the N64's \"c\" buttons.</p>\r\nLudum Dare theme?\r\n<p>Yes, this game was built during Ludum Dare 40! The theme was \"<em>The more you have, the worse it is</em>\" – The more items you have in your bag, the more hectic it is to find the items that you need to trade within the time limit. And the more items are added to the trading cycle, the less time you have to complete trades.  </p>\n\r\nPlay with any controller or keyboard+mouse!  \r\nControls:\r\nKeyboard + Mouse:\r\n<ul><li>WASD or Arrow Keys to <strong>move</strong></li><li>[ and ] or LMB and RMB to <strong>rotate the camera (while exploring)</strong></li><li>Space to <strong>interact (while exploring)</strong></li><li>E to <strong>open and close your bag</strong></li><li>Mouse to <strong>control the hand (while trading)</strong></li><li>Space to <strong>sweep (while trading)</strong></li><li>LMB to <strong>pickup and drop (while trading)</strong> [+ Hold down LMB to leave hand down in the bag]</li><li>RMB to <strong>shuffle (while trading)</strong></li><li>Q to <strong>quit the game (while viewing your bag)</strong></li></ul>\r\nControllers\r\n<p>* Left Analog Stick to <strong>move</strong><br/>* Shoulder Buttons or L1/R1 or Left/Right D-Pad to <strong>rotate the camera (while exploring)</strong><br/>* A (Xbox) or Cross (Dualshock 4) to <strong>interact (while exploring)</strong><br/>* B (Xbox) or Circle (Dualoshock 4) or Start/Options/Pause/Menu to <strong>open and close your bag</strong><br/>* Left Analog Stick to <strong>control the hand (while trading)</strong><br/>* Y (Xbox) or Triangle (Dualshock 4) to <strong>sweep (while trading)</strong><br/>*  A (Xbox) or Cross (Dualshock 4) to <strong>pickup and drop (while trading)</strong> [+ Hold down button to leave hand down in the bag]<br/>* X (Xbox) or Square (Dualshock 4) to <strong>shuffle (while trading)</strong><br/>* Q to <strong>quit the game (while viewing your bag)</strong> [Keyboard Only]</p>\n\r\nTips:\r\n<ul><li>Hold down the pickup button or key to keep your hand down in the bag and move it to shuffle stuff around.</li><li>Check your bag before entering trades to verify if you have the items they want. When doing so, you can pick up any item and the game will tell you how many of that item you have in your bag.</li><li>There is always at least one trade that definitely asks for something you already have in your bag.</li></ul>\n\r\nMissing features:\r\n<ul><li>Proper intro cutscene</li><li>Proper main menu</li></ul>\n\r\nKnown bugs:\r\n<ul><li>Weird glitches with the dirt road in some areas.</li><li>Items clip out of your bag when shuffling sometimes.</li></ul>\n\r\nSupport us on Patreon!", "metacritic": null, "released": "2017-12-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5cd/5cd680c17dc0da779c16ff3822464239.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Wild Gamut"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}