{"id": 970247, "slug": "air-attack-30-aerial-firefighting-game", "name": "Air Attack 3.0, Aerial Firefighting Game", "name_original": "Air Attack 3.0, Aerial Firefighting Game", "description": "Wildfires are bullies!  Look at what has happened in the western US this year alone!  We need good strategies and great training to combat this formidable foe!<br/>\n<br/>\r\nAir Attack 2 was built from the ground up using the latest graphics and physics techniques specifically designed for US government agencies charged with fighting wildland fires on the ground and from the air.  United States Forest Service built a world-class aerial firefighting training facility equipped with 9 flight simulators built by Los Angeles based ATC Flight Simulator company.  Presently it has 2 LATs/VLATs(Large and Very Large Air Tankers), 3 helicopter simulators, 2 Single Engine Turboprop Tankers(Air Tractors), 1 Lead Plane simulator and 1 Air Tac Kingair 200 simulator for training of their Air Attack teams.  Air TAC is the acronym for the aerial coordinator orbiting the fire at the higher altitude, typically 3,000 feet AGL, and directing pilots involved in the effort.<br/>\n<br/>\r\nThis year ATC Flight Simulator delivered the new version of their training software Air Attack 2 for the USFS and worked with training teams to tweak it to their specifications.  This facility is a network of more than 70 computers with up to 8 computers per simulator.  The aviators are EXTREMELY happy with the new software, as it meets and exceeds their requirements, and allows them to practice without being in danger.  This training has been invaluable to them in particular for the fire season this year, as it has been unprecedented.<br/>\n<br/>\r\nThrough a world Aerial FireFighters conference in Sacramento last March, many teams from all over the world have experienced Air Attack 2, and we are excited about the future for this ground breaking software.<br/>\n<br/>\r\nAir Attack 3.0, Aerial Firefighting Game on Steam is using this code base, and the experience gained, will translate to a realistic and unique flight simulator experience centered on Aerial Firefighting.  There are 8 planes and 7 helicopters meticulously modeled using real airfoil data and advanced physics.  This game is planned as a franchise, starting with Air Attack 3.0 Aerial Firefighting Game, but expanding to Air Attack 3 TEAM and Air Attack 3 EXTREME.  More to come on this.<br/>\n<br/>\r\nTo make Air Attack 2 into Air Attack 3 accessible to all and work as a stand alone and also a multiplayer game we will be working hard.  The networked TEAM version exists and is used by the USFS, but our initial release on STEAM will be the solo version.  This version is full featured, using as much of the original simulator as possible, all planes and helicopters.  There are 3 zones (with more to come) for Air Attack 3.  These are; ALPINE, RENO, and REDDING.  Alpine is the initial release zone, and there are 12 fires to fight with leader-boards on STEAM.  Any player can also create any fire in a zone that they want and fight it with any airframe they desire using PRACTICE mode.<br/>\n<br/>\r\nWe hope you enjoy this unique game, for it’s basis in reality, and it’s amazing play experience...", "metacritic": null, "released": "2019-12-25", "tba": false, "updated": "2023-11-05T05:16:12", "background_image": "https://media.rawg.io/media/screenshots/0bd/0bd753a30ff65907fab763563d667b9d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ATC Flight Simulator"], "genres": ["Simulation"], "publishers": ["ATC Flight Simulator"], "esrb_rating": null}