{"id": 970201, "slug": "atrofil-the-key", "name": "ATROFIL: THE KEY", "name_original": "ATROFIL: THE KEY", "description": "<strong>Gameplay</strong><br/>ATROFIL: THE KEY  - The computer game is for a single player in the horror genre, from the combined first and third persons, with a dark, scaring atmosphere and sound that keep in suspense throughout the game.<br/>Here you will find:<br/>- Travel by car.<br/>- Battles using melee and ranged weapons.<br/>- Search for keys and artifacts.<br/>  Using your mind in a battle with monsters for your own life!<br/><br/><strong>Summary</strong><br/>This is the story of Sonya that plunged into a world completely different from the one she was used to.<br/>The events of this game begin in a small town, after a massive fall of meteorites.<br/>Together with meteorites, a virus enters the planet that causes an epidemic among the human population.<br/>Sonya is surrounded by people infected with the virus.<br/>When she tries to get out of this town she has an accident.<br/>Having woken up in an unknown room with a headache, Sonya cannot remember what happened.<br/>The girl is placed in a separate house with some \"other\" people.<br/>On her desk is a note from Dmitry, the man who saved her.<br/>Sonya leaves the house in search of someone able to explain what happened.<br/> When she finds Dmitry, he tells her about the shocking facts - those \"others\" are no longer people at all, although they were once them. Now these are bloodthirsty monsters called Atrophils.<br/> Dmitry explains to her what is happening and teaches shooting.<br/> Sonya observe the difficult situation with the defense, she decides to help restrain the Atrophil attack along with the soldiers.<br/>After that, she becomes ill and Sonya returns to a safe place.<br/>In the future, everything gets out of control, and she has to leave the place, which Dmitry gave the name Home.", "metacritic": null, "released": "2019-12-16", "tba": false, "updated": "2023-11-05T04:00:14", "background_image": "https://media.rawg.io/media/screenshots/6c4/6c4e0641729b9458ceb3b4d80cd3f0fd.jpg", "website": "https://vk.link/atrofil", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["MiL_Puzzle"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["MiL_Puzzle"], "esrb_rating": null}