{"id": 970246, "slug": "aigor-escape-from-bishop", "name": "Aigor Escape from Bishop", "name_original": "Aigor Escape from Bishop", "description": "Help Aigor, a scoundrel zombie, to escape from the secret crypts of the perfidious Bishop Antoine Santolamazza. Explore the dungeons of the cathedral and solve the many riddles. Ally with the nefarious characters you'll come across during your escape and maybe you can regain your freedom!<br/>\n<br/>\r\nLeave the world of the \"alive\" and wear the putrid clothes of Aigor, a scoundrel zombie and lover of beautiful women!<br/>\n<br/>\r\nDrag your feet through the mysterious dungeons where you have been confined by the evil Bishop. Solve the many enigmas, allied with the bizarre characters that populate the dark crypts and reconquer your freedom.<br/>\n<br/>\r\nMake your way inside the dungeons using cunning and don't let the horrors that lurk in dark corners scare you.<br/>\n<br/>\r\nBe a brave zombie and face the challenges that await you room by room ... claim your freedom with a liberating grunt!<br/>\n<br/>\r\n'Demential dialogues!'<br/>\r\nTalk to the creatures confined to the dungeons and remember ... your choices can change your future!<br/>\n<br/>\r\n\"Find the way out!\"<br/>\r\nAs in the classic \"Escape Room\", your goal is to find the exit to escape from the diabolical clutches of Bishop Antoine Santolamazza!<br/>\n<br/>\r\n'Extreme sound'<br/>\r\nSynthesizers, atmospheric music in perfect 90's style and a dubbing dubbing. Be careful not to jump on the chair like any other little thing!<br/>\n<br/>\r\n\"Will you laugh or shudder?\"<br/>\r\nComedy and fright! In this game, laughter and horror mix perfectly!<br/>\n<br/>\r\n'Solitaire game'<br/>\r\nAs in a classic point and click you are completely alone in making your decisions. With Aigor everything is multiplied by 3D! Only intuition and your logic (maybe) will help you make the right choices in the darkness. Do your best!", "metacritic": null, "released": "2019-12-25", "tba": false, "updated": "2023-11-05T05:14:27", "background_image": "https://media.rawg.io/media/screenshots/0af/0af1f29c6220cf406434db2e29dd7952.jpg", "website": "https://aigorescapefrombishop.manakeep.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 421, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Emiliano Giuliante", "Adriano Cerroni", "Serena Aronica"], "genres": ["Adventure", "Indie"], "publishers": ["Emiliano Giuliante", "Adriano Cerroni", "Serena Aronica"], "esrb_rating": null}