{"id": 970375, "slug": "galactic-asteroids-patrol", "name": "Galactic Asteroids Patrol", "name_original": "Galactic Asteroids Patrol", "description": "The Galactic Asteroids Patrol is a modern fast-paced, asteroid shooting frenzy!<br/><br/>Navigate your spaceship in hectic asteroid fields while blasting dangerous &amp; unique space rocks and shooting down alien flying saucers.<br/>Use your ships' special abilities to avoid danger and maneuver with great skill to collect upgrades &amp; ammo.<br/>Choose from several types of multiplayer game types and play with or against your friends.<br/><br/>​Can you survive and reach the end of space?<br/>Can you win against your friends in a multiplayer match?<br/>Come play this reimagined classic!<br/><br/>The Galactic Asteroids Patrol is a nostalgic &amp; exciting re-imagining of the classic-style arcade games of blowing things up in outer space.<h3>Features:</h3><ul><li>Single &amp; Multiplayer gameplay: play with or against your friends online in 4 different multiplayer game types, including \"Asteroids Ball\"!<br/></li><li>4 types of spaceships: choose your ship based on its strengths, weaknesses &amp; payloads.<br/></li><li>12 weapons and abilities: each ship has access to specific subsets of weapons &amp; abilities.<br/></li><li>5 asteroid types: not just simple chunks of rocks floating in space, each asteroid poses a unique threat.</li></ul><br/><strong>Note:</strong><br/>The game is played with keyboard &amp; mouse.<br/>Movement with \"W\" \"A\" \"D\"<br/>Aiming &amp; shooting with the mouse<br/>For more details go to the game's website<br/><br/><h3>Back story:</h3>For over three decades since its founding The Galactic Asteroids Patrol has been blowing up asteroids in every asteroid-infested corner of the Galaxy.Once a new and proud initiative, the Patrol has now been reduced to a small, desolate, and underfunded department in a forgotten corner of the vast galactic bureaucracy.<br/>Of its once young and daring pilots, those who survived count their remaining years to retirement on a small government pension. Its spaceships, decades ago considered the pinnacle of spaceship design and technology, are almost space junk to modern eyes - barely kept in service through repeated retrofitting and cheap part replacements.<br/><br/>Welcome to The Galactic Asteroids Patrol!<h3>Personal Note:</h3>7 years ago we finished working on this lovely game but we never got to publish it properly. Back in the day we tried to publish on Steam Greenlight but by the time we got approved we had already moved on, we were tired and sadly gave up on the game.<br/><br/>Recently my dream of creating games has reawakened and I found our game lying around in one of my folders. At that moment I got really excited, opened the old Unity project and started poking around. I was reminded how fun it is to play and decided to re-launch it.<br/><br/>The game was made using Unity 3.5 and updating it to the the new Unity version is out of my scope right now. I will do my best to provide updates &amp; support for this game.<br/>If you enjoy the game and would like to support my future endeavors as an indie dev please consider buying a copy so I can invest in a future game. You are welcome to follow my development log.", "metacritic": null, "released": "2020-01-15", "tba": false, "updated": "2023-11-05T09:59:25", "background_image": "https://media.rawg.io/media/screenshots/40a/40acf13e0c16e3f31d2a8d50594630e8.jpg", "website": "https://www.asteroidspatrol.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Noam Toledano", "Amir Abiri"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Noam Toledano"], "esrb_rating": null}