{"id": 970499, "slug": "escape-the-manor-2", "name": "Escape The Manor", "name_original": "Escape The Manor", "description": "<strong><h3>Will you escape?</h3></strong><br/><br/>This puzzling horror that guarantees to have the hairs on the back of your neck standing on ends.<br/><br/>Trapped in a manor accompanied by ghosts of an evil past, which truant the corridors and the great halls. They are never far behind you. <br/><br/>Sending chills up your spine as your heart rate increases, this is a constant reminder that the ghosts are never far. <br/><br/>Your aim is to escape the manor through the front door, with the items that are scattered around for you to collect. However, its not just the items that you need to collect to escape, as the door also has some puzzle elements.<br/><br/>Any sound that you make will be heard by the ghosts, be careful to avoid standing on the broken glass and rubble as this will trigger the ghost to find you.<br/><br/>Lastly  the ghost can and will travel through walls, floors and doors, so there is no escape when she is on your tail. However, one old trick of hiding under the bed may keep you safe.<br/><br/>You have 5 lives, good luck!<br/><br/><br/><br/><strong><h3>Game modes</h3></strong><br/><br/>I have added a number of game modes to be enjoyed, and a practice mode to explore the manor and locate the items without the ghost.<br/><br/><ul><li>Practice<br/></li><li>Normal<br/></li><li>10 minute challenge<br/></li><li>Super challenge</li></ul><br/><br/>The game also has full controller support.", "metacritic": null, "released": "2020-01-28", "tba": false, "updated": "2023-11-05T14:29:33", "background_image": "https://media.rawg.io/media/screenshots/a94/a9474c78ee2dfe2f6b96eeb70be0f282.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Matthew lonsdale"], "genres": ["Action", "Indie"], "publishers": ["Matthew lonsdale"], "esrb_rating": null}