{"id": 970445, "slug": "path-of-zen", "name": "Path of Zen", "name_original": "Path of Zen", "description": "<ul><li>Designed to help people get acquainted with Meditation<br/></li><li>Offers mindful perspective to common problems<br/></li><li>Multi-interpretable issues applicable to a large variety of life situations<br/></li><li>Reflections with forward thinking and mindful solutions to several situation<br/></li><li>Contrasts the effects of negative thinking against mindful thinking</li></ul><h3>FEATURES</h3><br/><ul><li>A wonderful and large park to explore<br/></li><li>Many discoverable and hidden locations spread throughout the game<br/></li><li>Multiple routes with each their own mysteries to explore<br/></li><li>Vibrant natural environment with many different plants and animals.<br/></li><li>Beautiful vista's to sit down to and meditate by<br/></li><li>Audio and visual feedback on the effects of negative thinking</li></ul><h3>BENEFITS OF MEDITATION</h3><br/><ul><li> Reduce and build resilience to stress and increase overall well-being<br/></li><li> Highly restorative to both mental and physical health<br/></li><li> Promotes personal growth &amp; transformation</li></ul><h3>NARRATIVE</h3><br/><strong>We follow a business man from London, Julian works at a high profile accountant firm and has a busy job. The amount of energy the job requires causes him to struggle in his personal life. When the pressure from works seems to get the better of him, he hits the emergency button and takes a day off. We are there with him, listening in on what's on his mind.</strong><h3>FROM THE DEVELOPER</h3><br/>With Path of Zen, I want to share ways through which we can feel more in control of our own life and what we can do ourselves to gain that control. Mindful thinking and meditation have always been very useful tools in my life and have always helped me in dealing with difficult situations in my life. The intention is for  people to use this game and the perspective it offers in their own lives. To help people spend less time worrying about the future or the past and be more present in the moment they are in at that time.<h3>WHAT'S TO COME</h3><br/>I intend to spend more time on this game and continue to do updates if there is enough interest in the game. I am doing most of this by myself so it might take some time for updates to roll out. The game is done for now, but there is of course always the possibility to expand on the concept. If people enough people like the game I will dive back into development and based on demand I will build more levels and write more narratives.<br/><br/>I hope you like the game, with love from the Netherlands.", "metacritic": null, "released": "2020-01-20", "tba": false, "updated": "2023-11-05T13:12:56", "background_image": "https://media.rawg.io/media/screenshots/9c1/9c1475ea31ebbf7db810d3ac64990b3a.jpg", "website": "http://longestroadstudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 333, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Longest Road Studio"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Longest Road Studio"], "esrb_rating": null}