{"id": 970572, "slug": "godorevil1", "name": "GodOrEvil.1", "name_original": "GodOrEvil.1", "description": "<h3>Game content</h3>GodOrEvel. 1 is based on the previous work GodOrEvel. Beta, the first of the following orthodox series.<br/>As a knight, you will overcome obstacles in the unknown journey, use the card release skills in your hand, improve your strength by adjusting cards, upgrading advanced roles, activating fetters, and finally defeat boss. Introduction to operation            <br/>Press Q: pause the game to enter the menu            <br/>Click card at any time by S +: sell the card           <br/>In the card pack interface, press c + to click the card: switch between the card in the card pack and the card in the hand       <br/> <br/>  what's new [/]            <br/>Fetter system: activate different types of fetters according to different types of cards, so as to obtain strong effect of blessing. (move the mouse over the corresponding icon to display the corresponding type of fetters.)<br/> <br/> <br/> <br/> <br/><br/>Automatic use: when the card cooldown is lower than a certain value, it will enter the automatic use mode to avoid repeated click on the card.            <br/> <br/><br/>Altar level: after playing a level several times, the altar level will be opened on the map to explore more unknown.            <br/> <br/><br/>Invisible challenge: in the new version, there is a real sense of player death! The map will gradually reduce the level along with the clearance, please choose your clearance route carefully! game contains [/]            <br/>45 skill cards (including 3 upgrade cards and 2 upgrade cards, adding 1 special upgrade card will greatly improve the combat strength)            <br/>The map has 15 monster levels for you to challenge            <br/>The store has 8 cards for you to buy with game gold coins            <br/>4 new fetters", "metacritic": null, "released": "2020-02-09", "tba": false, "updated": "2023-11-05T16:10:46", "background_image": "https://media.rawg.io/media/screenshots/195/19506cb96457eb8a82cec5b68a26cdf2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JusticePartner Narka"], "genres": ["Adventure", "RPG", "Strategy", "Casual", "Indie"], "publishers": ["JusticePartner Narka"], "esrb_rating": null}