{"id": 970559, "slug": "jumplord", "name": "Jumplord", "name_original": "Jumplord", "description": "At the edge of a cavern, a small tribe discovers a brightly lit platform has appeared. Your strange ability to double-jump before hitting the ground makes you an ideal contender to venture outward. You find corrupted creatures, dangerous environments, mutated bosses and glowing relics that enhance your abilities. Just don't fall beneath the red glow...<br/><br/><strong>Gameplay</strong><br/><br/>Jumplord is an action platforming experience with rogue-lite and metroidvania elements. The gameplay focus is on staying in the air by jumping off enemies, using your weapon and knowing the environment to survive each area. By journeying through the chasms you will meet unique characters, find various weaponry and power-ups to change how you play, defeat bosses, stumble upon secrets and explore a vast interconnected world. <br/><br/><strong>Features:</strong><br/>- Fast paced action that rewards timing and reflexes<br/>- Swords, Shotguns, Boomerangs and numerous other weapons to change your play-style<br/>- Embed a stone into each hand to customize and change your character<br/>- Find a music player and the hidden tracks dispersed throughout the world<br/>- High Risk / Reward gameplay: powerful Relics will add to your abilities, but only until you fall. Master your environment and stack the power-ups!<br/>- Nostalgic pixel art visuals and an original soundtrack", "metacritic": null, "released": "2020-02-06", "tba": false, "updated": "2023-11-05T15:48:00", "background_image": "https://media.rawg.io/media/screenshots/7d7/7d7c92b5b44bd9cc560713dbb6f85737.jpg", "website": "http://www.fabagame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fabagame"], "genres": ["Indie"], "publishers": ["Fabagame"], "esrb_rating": null}