{"id": 9706, "slug": "paranormal-activity-the-lost-soul", "name": "Paranormal Activity: The Lost Soul", "name_original": "Paranormal Activity: The Lost Soul", "description": "Armed with a flashlight, you find yourself exploring what appears to be a quiet average looking home in a woodsy neighborhood. Before long, you discover you’re not alone as you unravel the mystery of what’s gone on in this house and struggle to survive the terror that begins to hunt you.<br/>\n<br/>\r\nThis original story, based on the mythology of the massively popular PARANORMAL ACTIVITY film franchise, is built from the ground up for VR.  You freely walk through the environment using Room Scale combined with several controller based movement options.  After the tutorial, you're on your own. Zero onscreen directions or HUD in your face, you’re never taken out of the immersion all the while exploring the multiple floors of this massive nightmarish house. <br/>\n<br/>\r\nGAMEPLAY LENGTH:<br/>\n<br/>\r\nGameplay length will vary on gameplay style. There are no Quicktime events in this game and its up to the player to discover and unravel the story. Its pretty much an open world in the house, so explore where you can. Completionist can be in this game for many many hours. Standard playtime will still be hours unless you knew exactly where every item was. So please don't share the location of items and ruin it for others. We will include some randomization of the in the future to make it more difficult.<br/>\n<br/>\r\nFEATURES:<br/>\n<br/>\r\nSurvival: With limited tools, you must run and hide or out smart your enemy. Good luck.<br/>\n<br/>\r\nRandom moments of terror means you never know when a haunting will strike, you must be alert at all times. Our proprietary Scare Randomizer system will create random scares beyond story moments. This means you never know when a scare is going to happen. This is like a real haunted house. sometimes there a bunch of scares and others times maybe very little or nothing at all. There is tremendous terror in the unknown. keep yours eyes open at all times, and be sure to wear headphones, the sound alone will make you crap your pants.", "metacritic": null, "released": "2017-03-14", "tba": false, "updated": "2023-03-29T01:38:48", "background_image": "https://media.rawg.io/media/screenshots/ac3/ac3fa13e5544d64a4a0fc0345287a158.jpg", "website": "http://www.pavrgame.com/", "rating": 3.46, "rating_top": 3, "added_by_status": {"yet": 3, "owned": 79, "beaten": 4, "toplay": 2, "dropped": 6}, "playtime": 3, "achievements_count": 36, "ratings_count": 13, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 13, "platforms": ["PlayStation 4", "PC"], "developers": ["VRWERX"], "genres": ["Adventure", "RPG"], "publishers": ["VRWERX"], "esrb_rating": "Adults Only"}