{"id": 970641, "slug": "comet-golf", "name": "Comet Golf", "name_original": "Comet Golf", "description": "Take a voyage to the outer space. Shoot a small comet through a colorful galaxy and use dark holes to warp you to the next level. Dodge asteroids and use planet gravitation, cosmic streams and other celestial bodies to influence the flight path of the comet. You need to estimate trajectory and force well to make it into the goal and unlock the next level. But don’t worry, you’ll get as many tries as you need. The levels are designed in a clear comic style for a relaxed pastime.<br/><br/><h3>Journey through unknown galaxies</h3><br/>On your journey there await you four different galaxies with different challenges. We collected some tips for what’s to come.<h3>Use gravitational forces</h3><br/>Shoot the comet past planets to get it into their gravitation field which deviates it and so changes its flight path. But caution: don’t come to near otherwise the comet will crash onto the planet!<h3>Shoot the comet through galactic flows</h3><br/>It may happen that galactic flows cross the path of your comet and it needs to fly through them. Forward planning is necessary: If the comet flies with their flow direction it gets faster, but if it flies against them it get’s pushed back and will be deviated.<h3>Caution, asteroids!</h3><br/>Some things in space should better been curcuited – like asteroids. Prove your feel for timing and wait for a gap to pass the comet safely through the asteroid belt.<h3>Just space junk?</h3><br/>On the journey through space you will come across human legacys, for example satellites. These may at first seem like obstacles but their solar cells look like they would make some good surfaces to bounce off ...", "metacritic": null, "released": "2020-02-20", "tba": false, "updated": "2023-11-05T17:36:27", "background_image": "https://media.rawg.io/media/screenshots/eb2/eb216a9a32d57738e33b725e4b954dfc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Comet Golf Project Team"], "genres": ["Casual", "Indie"], "publishers": ["LabOne48"], "esrb_rating": null}