{"id": 970603, "slug": "roads-of-time", "name": "Roads of time", "name_original": "Roads of time", "description": "A time travel adventure gone wrong! Brian and P.E.T. are thrown back in time after a miscalculation to the era of pharaohs in Ancient Egypt! Evil Anubis and his minions are terrorizing the people. Without a second thought, Brian and P.E.T. charge forward to stop the evil pharaoh’s plots!<br/>\n<br/>\r\nGet ready for a wild adventure across ancient Egypt full of ancient relics and mysterious artifacts. Roads of Time is the exciting casual strategy game you’ve been waiting for!<br/>\n<br/>\r\nTons of different tasks, more than 40 levels, a fun plot, simple and exciting gameplay, and a huge fantasy world… What more could you want! Hunt for treasure, restore historic monuments, look for mysterious artifacts, fight Anubis’ evil henchmen, battle to the end and manage your resources. Simple controls and a clear tutorial will help you dive right into the game!<br/>\r\nRoads of Time — save time from collapse!!<br/>\n<br/>\r\n-A fantasy world full of mythical creatures and ancient artifacts, from totems and hyroglifics to pyramids, to help you uncover the secret of Anubis<br/>\r\n-A fun plot with cool comics and unforgettable characters!<br/>\r\n-Tons of different tasks you’ve never seen before<br/>\r\n-40+ unique levels<br/>\r\n-Dangerous enemies: Anubis’ henchmen, warrior animals, and dangerous scarabs<br/>\r\n-4 fun locations: Ocean beaches, lush valleys, mystical oases and the hot savannah<br/>\r\n-Helpful bonuses: Walk and work speed boosts, building upgrades, treasure hunts and time travel<br/>\r\n-Simple controls and a clear tutorial<br/>\r\n-More than 20 hours of fun gameplay for any age<br/>\r\n-Awesome music and sounds", "metacritic": null, "released": "2020-02-16", "tba": false, "updated": "2023-11-05T16:49:30", "background_image": "https://media.rawg.io/media/screenshots/990/990aaed547853bbf3b57f40a5d5c665c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 19, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GameOn Production"], "genres": ["Adventure", "Strategy", "Casual", "Indie"], "publishers": ["8Floor"], "esrb_rating": null}