{"id": 970706, "slug": "mistaker", "name": "Mistaker", "name_original": "Mistaker", "description": "Journey deep underground and explore fantastic places filled with all manner of monsters, traps, and treasure. Collect gold, diamonds and power-ups. Travel through vast mines. Resist monsters and powerful bosses.  Destroy the environment and change the appearance of the environment. Face the unknown and find a way out of the extensive mines.<br/><br/><strong>Key Features</strong><br/><ul><li>3 large vast mines - destructible levels with danger enemies and traps.<br/></li><li>Fight powerfull bosses! - take on mine guards and win them. Powerful bosses are waiting for daredevils ready to fight them. Stand up to the fight and win!<br/></li><li>Defeat enemies! - defeat all enemies and clear the passage. Fight different enemies: flying and walking. Don’t be surprised and be ready to repel any attack!<br/></li><li>Locations! - earth, ice and clay mine. These are extensive stages that you must discover and comb in search of passages to their further parts. Explore them and destroy fragments susceptible to damage. Find treasures and HP drinks. Each environment delivers a specific type of danger, and new inhabitants to encounter.<br/></li><li>Items &amp; Treassure -  items will be invaluable in the pursuit of victory. Collect everything you find, from treasures to HP potions and more. You can later exchange them in the store with items for power ups, such as life.<br/></li><li>Destructible environment - destroy everything you can. Change the look of the surroundings and find the treasures hidden there.<br/></li><li>Suprise chest - find surprise chests and see what they are hiding!</li></ul>", "metacritic": null, "released": "2020-02-28", "tba": false, "updated": "2023-11-05T19:07:05", "background_image": "https://media.rawg.io/media/screenshots/26b/26bfa0b85c93ce38fba0c13e530540a1.jpg", "website": "http://raiviken.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 323, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RASK2 Games"], "genres": ["Indie"], "publishers": ["Raiviken Games"], "esrb_rating": null}