{"id": 97088, "slug": "bolt-riley-a-reggae-adventure-chapter-1", "name": "Bolt Riley - A Reggae Adventure, Chapter 1", "name_original": "Bolt Riley - A Reggae Adventure, Chapter 1", "description": "<p>Bolt Riley is a a classic 2D point and click Jamaican Reggae adventure game where you play as Bolt Riley, a poor boy from Trenchtown, Jamaica, on his pathway to stardom. Bolt is struggling to survive and has to deal with a gang of Rude Boys.</p>\n<p>Bolt is struggling to survive and has to deal with a gang of Rude Boys. You go through a journey of self discovery, of love, friendship, and inspiration where you are introduced to Reggae music, you have to form your band, get inspiration, write and produce your songs and then perform them. The story consists of different chapters each focusing on a different aspect of Bolt Riley's passage into becoming a Reggae legend. <br/></p>\n<p>This is the story of the underdog who breaks out and becomes a worldwide sensation. <br/><br/>The game features hand drawn 2D background artwork and hand drawn cel animation. It combines all the elements of a classic point and click adventure game and includes funny dialog puzzles, exploration, wacky inventory items, and of course, a rope. Bolt can use special Inspirational powers he learned during his journeys. <br/>All the music of the game was originally composed especially for it. <br/><br/><br/>Bolt Riley chapter 1 – is only the first installment in the story of Bolt Riley, and only the beginning of a longer story. <br/><br/>Bolt Riley was funded through Kickstarter, and by purchasing Bolt Riley Chapter 1 you help support indie game development and help fund the following chapters. A Steam key is also included with purchase.<br/></p>", "metacritic": null, "released": "2016-04-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/972/972ef1ba12d907a536736020bc3ba3cb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 317, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Corbomite Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}