{"id": 970844, "slug": "fatal-evidence-the-missing-collectors-edition", "name": "Fatal Evidence: The Missing Collector's Edition", "name_original": "Fatal Evidence: The Missing Collector's Edition", "description": "Domini Games brings you the newest gripping case in the Fatal Evidence series!<br/>\n<br/>\r\nYour best friend’s bad luck takes a disastrous turn when his wife goes missing. Just when things seem like they can’t get any worse, he’s arrested for her kidnapping! But this is no open and shut case, and you quickly find evidence of foul play. The question is, who would want to frame your friend and why? It’s up to you to crack the case and clear his name before it’s too late. Do you have what it takes? Find out in this riveting Hidden-Object Puzzle adventure!<br/>\n<br/>\r\nThis is a special Collector's Edition release full of exclusive extras you won't find in the standard version. The Collector's Edition includes:<br/>\n<br/>\r\n•\t  The Dark Hunter is threatening you and your family with deadly explosions - can you stop him in time?<br/>\r\n•\t  Play - and re-play! - more challenging HOPs and mini-games!<br/>\r\n•\t  Earn Achievements, outfit your Kitchen, and collect all the photos and statuettes! <br/>\r\n•\t  Replay videos and download original concept art, wallpapers, and soundtracks!  <br/>\r\n•\t  Don't go it alone - take along the helpful Strategy Guide! <br/>\n<br/>\n<br/>\r\nThis is a Hidden Object Puzzle Adventure game, meaning a specific genre of story-driven, point &amp; click adventures. Throughout the game, players are tasked to find a list of objects hidden within a particular scene, and to occasionally complete various mini-games/puzzles.", "metacritic": null, "released": "2020-03-20", "tba": false, "updated": "2023-11-05T22:08:03", "background_image": "https://media.rawg.io/media/screenshots/8be/8be262b83e8f04c6fd98fa9188190558.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 494, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Domini Games"], "genres": ["Adventure", "Casual"], "publishers": ["Big Fish Games"], "esrb_rating": null}