{"id": 9709, "slug": "shroud-of-the-avatar-forsaken-virtues", "name": "Shroud of the Avatar: Forsaken Virtues", "name_original": "Shroud of the Avatar: Forsaken Virtues", "description": "<strong>WARNING: THIS GAME IS IN EARLY ACCESS. PLEASE DO NOT PURCHASE IT UNLESS YOU WANT TO ACTIVELY SUPPORT DEVELOPMENT OF THE GAME VIA CROWD FUNDING, BUG TESTING, AND FEEDBACK. PLEASE ONLY PURCHASE IF YOU ARE ALSO PREPARED TO HANDLE SERIOUS ISSUES AND INCOMPLETE CONTENT. PLEASE READ THE NEGATIVE REVIEWS PRIOR TO PURCHASE, MANY OF WHICH WARN YOU OF THE CURRENT UNFINISHED STATE OF THE GAME.</strong><br/><strong>SUMMARY:</strong><br/><strong>Shroud of the Avatar: Forsaken Virtues</strong> is a new type of third person fantasy RPG that combines a single player narrative with a sandbox MMO. It is being created by a team that includes: <strong>Richard \"Lord British\" Garriott</strong> the creator of the Ultima series, <strong>Starr Long</strong> the original Director of Ultima Online, and <strong>Tracy Hickman</strong> the author of the beloved Dragonlance Novels and Dungeons &amp; Dragons modules.<br/> <br/><ul> <li><strong>Episodic Content:</strong> Shroud of the Avatar will consist of five episodes that will tell a series of virtue based stories created by Richard Garriott and Tracy Hickman. All supported by a series of prequel novels starting with Blade of the Avatar. Forsaken Virtues is the first episode (this is what you are purchasing access to). <br/> </li><li><strong>Single Player Offline Mode:</strong> Players will adventure through over 40 hours of story in an interactive world where their choices have consequences, ethical paradoxes give them pause, and they play a vital part in weaving their own story into the immersive world and lore surrounding them.<br/> </li><li><strong>Selective Multiplayer Modes:</strong> If you want to go through the story online you can play with everyone in a single world with three different online modes (Single Player, Friends, and Open). All items available in these multiplayer modes are also available in single player offline via purchase in in-game gold or other resources.<br/> </li><li><strong>Classless Character System:</strong> Vast customization options with hundreds of skills and spells in over 20 different skill trees.<br/> </li><li><strong>Skillful Combat:</strong> A new way to prepare and fight in an RPG by building custom decks of skills and dynamically activating them in combat.<br/> </li><li><strong>PVP:</strong> Consensual with Open PVP flags, zones, and Guild Warfare.<br/> </li><li><strong>Player Housing:</strong> Non instanced, finite, and embedded in the world with multiple group living options.<br/> </li><li><strong>Player Driven Economy:</strong> Deep crafting system where the best items are made by players and player items are the main source of loot found in the game.<br/> </li><li><strong>Pay Once to Play:</strong> No subscription fees. Each episode is a one time fee and everything in the game can be purchased with in game gold that can be earned (except for some exclusive backer rewards).<br/> </li><li><strong>Social:</strong> Full Guild System, Highly Active Community and Player Owned Towns.<br/> </li><li><strong>Crowd Sourced &amp; Funded:</strong> Support the project by purchasing items in the add-on store or participate in telethon stretch goal exclusive item events! These online enabled add-ons and pledge items are also available to all players in offline mode.<br/> </li><li><strong>Open Development:</strong> Players help shape the game by giving feedback on monthly early access releases, videos, weekly updates, blog postings, forums, chat, etc.</li></ul><br/><strong>DEVELOPMENT ROADMAP</strong><br/><strong>Shroud of the Avatar: Forsaken Virtues</strong> is currently in Early Access, so there are a lot of features and content still to be built. Even the current content needs polish and balance. On the last Thursday of every month we release a major update to the game that includes new features, new content, and bug fixes. We update the schedule for these on a quarterly basis with a final update for each release the day before it goes live.Current Version<ul> <li><strong>Housing:</strong> Purchase property and a wide variety of buildings to place there. These can be customized with hundreds of items (paintings, crafting stations, chairs, tables, food, plants, fountains, statues, lights, etc.). Players can also set permissions that allow them to share this property with other players. Higher level pledges begin the game with property and house deeds. (Find out more at www.shroudoftheavatar.com)<br/> </li><li><strong>Crafting:</strong> Gather and refine resources to craft a wide variety of objects including weapons, armor, potions, food, and furniture.<br/> </li><li><strong>Player Trading:</strong> Trade with each other for items or gold.<br/> </li><li><strong>PVP (Duels and Zones):</strong> Fight other players in Open PVP zones of the map or 1 on 1 duels in any location.<br/> </li><li><strong>Dual Scale Map:</strong> Explore the world by walking across a map (aka The Overworld) like old school RPGs with random and roving encounters mixed among named points of interest.<br/> </li><li><strong>Combat and Magic Skills:</strong> We have over 100 skills in a wide variety of combat and magic schools including Blades, Fire, Water, Life, Polearms, Shields, etc.<br/> </li><li><strong>Multiple Online Modes:</strong> Play how you want in one of two modes: Single Player Online or Open Multiplayer Online.<br/> </li><li><strong>Character Customization:</strong> Customize your character's facial features, hair style, hair color, facial hair, skin tone, and gender. Also express yourself with a vast array of different gear that when equipped shows on your character. (cloaks, armor, weapons, hats, tools, torches, etc.)<br/> </li><li><strong>AI Behaviors:</strong> Archers will try to maintain distance, warriors will try to surround you, Liches will summon skeletal allies, and villagers will turn on lights when night falls.<br/> </li><li><strong>Advancement:</strong> As you gain experience fighting and questing you gain levels which give you skill points that you can use with a trainer to purchase new skills or to raise your attributes. <br/> </li><li><strong>Hint System:</strong> Each time you attempt something for the first time a hint will appear with basic instructions (this can be disabled in options)<br/> </li><li><strong>Fully Interactive World:</strong> Every attempt is made to make the world respond to you. All the lights you see can be turned on and off, doors can be opened/closed/locked/unlocked, objects can be taken from shelves/tables/etc.<br/> </li><li><strong>Dynamic Lighting:</strong> Time of day changes as you play along with all light sources casting light in a realistic fashion.<br/> </li><li><strong>Summoned Allies:</strong> Certain schools of magic can summon allies including Ice Elementals, Fire Elementals, Liches, and Skeletons.<br/> </li><li><strong>Control Points:</strong> Grab control of Vertas Pass and see how long you can hold it against ever increasing waves of Dark Elves.<br/> </li><li><strong>Emotes:</strong> Express yourself with a wide variety of emotes including dances, bows, laughs, bows, yawns, etc.<br/> </li><li><strong>Guilds:</strong> You can form or join a guild<br/> </li><li><strong>Banks:</strong> Store all your gear and loot when it gets too heavy to carry around.<br/> </li><li><strong>Character tied to Pledge:</strong> All versions of the game (aka pledges) come with special rewards (gear, houses, titles, emotes, etc.).<br/> </li><li><strong>Player Owned Towns:</strong> Players can purchase and customize from templates their very own town.<br/> </li><li><strong>Player Vendors:</strong> You will be able to set up NPC vendors to sell the goods you have crafted or found adventuring.<br/> </li><li><strong>Player Made Books:</strong> Write your own book in the game and pay in game gold to have it published widely.<br/> </li><li><strong>Dye-able Gear:</strong> Customize your gear by changing the colors.<br/> </li><li><strong>Crowd Sourcing</strong> Create content for the game (music, sound effects, and art) and be paid for it.</li></ul>Future Updates<ul> <li><strong>Story:</strong> A rich narrative that presents you with complex moral choices will come online closer to launch.<br/> </li><li><strong>More Scenes:</strong> Many additional scenes will come online including cities, dungeons, deserts, arctic areas, swamps, fortifications, battlegrounds, etc.<br/> </li><li><strong>Performance:</strong> Continued optimizations as well as sophisticated fallback routines will greatly improve performance.<br/> </li><li><strong>More Magic &amp; Combat Skills:</strong> More skills will be coming including the Chaos Magic School. <br/> </li><li><strong>Localization:</strong> Support for multiple languages.<br/> </li><li><strong>More Creatures:</strong> More creatures along with multiple variations and new behaviors.</li></ul><br/>We estimate reaching a Beta version with all features and content sometime in late 2017. All features and plans listed here are subject to change. We may modify, add or remove features as we see fit during the development process.<br/><br/>Website for more information: <strong>www.shroudoftheavatar.com</strong>", "metacritic": null, "released": "2014-11-24", "tba": false, "updated": "2023-07-30T17:44:38", "background_image": "https://media.rawg.io/media/screenshots/210/21038e23edd9e998357535c93a740c0e.jpg", "website": "https://www.shroudoftheavatar.com", "rating": 2.31, "rating_top": 1, "added_by_status": {"yet": 5, "owned": 367, "toplay": 3, "dropped": 9, "playing": 3}, "playtime": 2, "achievements_count": 29, "ratings_count": 26, "suggestions_count": 601, "game_series_count": 0, "reviews_count": 26, "platforms": ["macOS", "PC", "Linux"], "developers": ["Portalarium"], "genres": ["RPG", "Massively Multiplayer"], "publishers": ["Portalarium"], "esrb_rating": null}