{"id": 970977, "slug": "gunbird-2020", "name": "GUNBIRD (2020)", "name_original": "GUNBIRD (2020)", "description": "<strong>\"Marion\" the little great wizard in the steampunk world.<br/>The masterpiece of the \"Psikyo Shooting\"!</strong><br/><br/>GUNBIRD is a vertical-scrolling shooter game that first appeared in arcades in 1994.<br/><br/>A comical story about the \"magical mirror\" that makes wishes come true.<br/>You can see the dialogue demos that unfold during the intermission and when the boss appears,<br/>and the dialogue between the characters that changes when the 2 players mode.<br/><br/>You can set the difficulty level, life, number of continues, <br/>controls, screen orientation, and more.<br/><br/>In addition, now we have online rankings!<br/>Be the world's best GUNBIRD!<h3>Characters:</h3><ul><li>You like it, don't you? - \"Marion\" The Little Great Wizard<br/></li><li>One strike, one kill, one rocket punch! - \"Barnas\" The Flying Robot Warrior<br/></li><li>The offensive and defensive ruyi stick! - \"Yang Nyan\" The Chinese Magician Girl<br/></li><li>Power is No. 1! - \"Tetsu \"The Lovely Carpenter<br/></li><li>Speed is No. 1! - \"Ash\" The Sky Explorer</li></ul><h3>Planes:</h3><ul><li>Power up with \"P\" items, with sub-weapons also added.<br/></li><li>Get bombs with the \"B\" item to wipe out enemy bullets and evade your foes!<br/></li><li>Unleash the charge shot to take down your enemies!</li></ul>Arcade mode:<ul><li>7 levels of difficulty can be selected for beginners.<br/></li><li>Now players can really test out their skills with a \"HARD\" and \"VERY HARD\" mode. We're looking for recruits who are up for the test.<br/></li><li>Local rankings will support all difficulty levels and your own planes.</li></ul>Options:<ul><li>The vertical screen mode that allows you to play in arcade style like back in the day.<br/></li><li>Select the screen filter from the normal +2 version.<br/></li><li>You can set the number of lives from 1 to 9 and the number of continues from 0 to unlimited.<br/></li><li>Assign \"Shot\", \"Auto Shot\" and \"Bomb\" in the key configuration.<br/></li><li>The vertical screen mode can be operated in the horizontal mode as well! Now enjoy a completely different gameplay.</li></ul>Score Attack:<ul><li>This is a new feature that has a very severe mode with a fixed difficulty level and number of lives.<br/></li><li>Compete in high scores and score attacks against players from all over the world!<br/></li><li>Online rankings can be viewed from the options menu.</li></ul>", "metacritic": null, "released": "2020-05-10", "tba": false, "updated": "2023-11-06T01:11:14", "background_image": "https://media.rawg.io/media/screenshots/2fa/2fa7c34aa19a6da953208f033c3c7bff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zerodiv", "CITY CONNECTION"], "genres": ["Action"], "publishers": ["CITY CONNECTION"], "esrb_rating": null}