{"id": 970996, "slug": "trump-and-virus", "name": "Trump and Virus", "name_original": "Trump and Virus", "description": "At the beginning of a disaster, those seemingly unimportant warnings will always be felt that this is not serious, such as the invasion of viruses.<br/><br/>This is a fast start leisure game. In this game, you will see a virus that may infect the whole human race. You will fly a plane to fight against the virus in different ways. Your choice and ability in the fight is particularly important. It will directly affect the scope of virus infection, including whether it will affect Mr. President, and whether human beings can defeat the virus in the end. Each of them is different The choice will bring different results.<br/><br/>Of course, you can also go through all the results, so that when you face the real virus, you may get more courage and make more correct choices.<h3>Gameplay:</h3>The game supports two modes of VR and 2D. In the game, players can choose the first-person or third-person perspective to drive the aircraft to shoot or avoid obstacles, and unlock different endings according to each level score.<h3>DISCLAIMER:</h3><br/>The game is fictional, with names, characters, places and events created by the author's imagination. Any resemblance to a real person or event is purely coincidental.", "metacritic": null, "released": "2020-05-12", "tba": false, "updated": "2023-11-06T01:38:19", "background_image": "https://media.rawg.io/media/screenshots/3cd/3cd0e89b2367284362c50885760ac7d0.jpg", "website": "http://www.ugug.com/portal.php", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["UG Virtual Reality Technology Co.,Ltd."], "genres": ["Action", "Adventure", "RPG", "Simulation", "Sports", "Racing", "Casual", "Indie"], "publishers": ["UG Virtual Reality Technology Co.,Ltd."], "esrb_rating": null}