{"id": 971, "slug": "spider-rite-of-the-shrouded-moon", "name": "Spider: Rite of the Shrouded Moon", "name_original": "Spider: Rite of the Shrouded Moon", "description": "\" A secret society built Blackbird Estate for a specific purpose..<br/>..Not even the family living there today knows what it was.\"Web Crafting, Insect Hunting Gameplay You are a spider on the hunt!  Build webs of your own design to trap and eat a wide variety of dynamic insects, each with its own behaviors and vulnerabilities. You must possess the agility and cunning of a spider to master the deep scoring system and top the per-level leaderboards in this unique, innovative blend of action, strategy, and puzzle gameplay.Your Real World Time and Weather .. Inside The Game! Prepare to be immersed as never before. Spider uses your location to reflect the time of day and weather in the game with that outside your window. Moths, fireflies, and crickets only come out at night. When it rains in real life, the rain also falls on Blackbird Estate. Play on a stormy night when lightning electrifies the top of the tower, or explore during a full moon when rare moths can be found.Hours and Months of Replayable Content Over 30 unique levels, each of which features redesigned gameplay in all 4 conditions, along with shuffled content and multiple areas, leading to countless combinations of challenges, collectibles, environments, secrets to discover, and high scores to master. Collect dozens of insects, multiple spider skins, and 48 achievements of increasing difficulty.Solve Cryptic Puzzles and Unravel the Mystery Welcome to Blackbird Estate, an abandoned mansion built long ago by an enigmatic secret society for a mysterious purpose, unknown even to the family who until recently lived here. Use the map to explore the grounds, collecting clues that can be pieced together to open hidden passages, decrypt secret messages, and uncover long-buried secrets. The clues may help you solve the estate's 7 puzzles, but you're on your own when it comes to the ultimate mystery: The Rite of the Shrouded Moon!A Story of Spider Proportions What really happened at Blackbird Estate? Slip under the floorboards and through keyholes for a spider's unique perspective on this dramatic story told in the background without text or dialog. Piece together the tattered tale of a mad inventor, a brave child, and an adventurer of the high seas who hides a dark secret. Search for clues at a crime scene, a faulty time machine, and a graveyard full of unexpected surprises.Two Games In One Play for high scores and the story won't slow you down. Or if you prefer to solve the mystery, you can ignore the leaderboards entirely. Do both for the greatest challenge, or neither to breeze your way to the exciting conclusion.  Spider allows you to seamlessly customize your experience and decide what kind of gameplay you're in the mood for.<br/><br/><br/><strong>The Steam Version</strong> features precision aiming mechanics designed for both gamepad and mouse/keyboard, along with a wide, high resolution view, essential tools for topping the leaderboards.", "metacritic": null, "released": "2015-08-06", "tba": false, "updated": "2023-01-06T09:06:50", "background_image": "https://media.rawg.io/media/screenshots/c79/c7935080d06e2f8c1119ac2386e26f0b.jpg", "website": "http://www.shroudedmoon.com", "rating": 2.56, "rating_top": 1, "added_by_status": {"yet": 14, "owned": 180, "beaten": 3, "toplay": 2, "dropped": 3}, "playtime": 1, "achievements_count": 195, "ratings_count": 9, "suggestions_count": 396, "game_series_count": 0, "reviews_count": 9, "platforms": ["PlayStation 4", "PS Vita", "PC", "Linux", "iOS", "Android", "macOS"], "developers": ["Tiger Style"], "genres": ["Action", "Adventure", "Indie", "Puzzle"], "publishers": ["Tiger Style Games", "Tiger Style"], "esrb_rating": "Everyone 10+"}