{"id": 971013, "slug": "zen-universe", "name": "Zen Universe", "name_original": "Zen Universe", "description": "<strong>Zen Universe</strong><br/><br/>The Zen Universe brings the world to you through the magic of VR. Immerse yourself into high-detail realistic 3D environments powered by ground-breaking virtual reality technology. Visit real-life locations and discover hidden natural treasures wherever you are. Discover ruins of ancient civilizations, explore the past and the present.<br/>Take your picks from a library of real and unreal experiences, all developed in Unreal Engine 4.  Whether it’s the most famous landmarks you’ve never dreamt of visiting or places of fiction you’ve always dreamt of going to, the power of virtual reality will take you there. Our state-of-the-art technology raises the industry bar in realism, entertainment, and interactivity. Explore the many worlds of ZenArt VR to marvel, relax, learn or play.<br/><br/><strong>Hyper-realistic visuals</strong><br/><br/>ZenART VR is on the cutting edge of 3D-scanning technology. Our wide range of surfaces, textures, and materials, not only look stunning at first glance but hold up on close inspection. We use powerful tools to render photoreal images in real-time, while our post-processing technology allows us to put the finishing touches for Hollywood-grade image quality.<br/><br/><strong>Historical guide</strong><br/><br/>You are never alone. Our virtual guides are always there to help you with tips and suggestions. Learn about a location’s history and relive it from the perspective of the people who were there when it happened. Then tap into the world of magic by exploring the myths, legends, and unsolved mysteries throughout the millennia.<br/><br/><strong>Dynamic weather</strong><br/><br/>Every aspect of a Zen Universe location is fully rendered in-engine and adaptive to the dynamic weather system. Watch the rain pour down, snow cover the distant hills in the background and the rays of light play in the sky, piercing clouds and treetops moved by the wind.<br/><br/><strong>Day &amp; Night Cycle</strong><br/>Discover beautiful virtual worlds as they change before your very eyes. The Zen Universe day &amp; night cycle and dynamic lighting technology give an accurate representation of the effects of time on the environment, but also allow us to create a larger-than-life movie-like atmosphere for you to immerse yourself in.<br/><br/><strong>Real-life</strong><br/><br/>Explore the world’s most renowned landmarks without leaving the comfort of your home. Our team travels there for you and spends countless hours recreating the locations as accurately as possible so you can feel like you’re actually there. The line between reality and virtual simulation has never been so narrow.<br/><br/><strong>Early Access</strong><br/>This is an exclusive first look at the Zen Universe. Supporting us on Early Access will grant you access to 2 of 4 planned destinations: Tales of the Rocks - an ancient fortress and a natural marvel, and Olympus: Home of the Gods - a mythical quest for knowledge. This bundle will be upgraded to feature all 4 destinations FOR FREE when the complete Zen Universe is released.", "metacritic": null, "released": "2020-05-13", "tba": false, "updated": "2023-11-06T01:59:41", "background_image": "https://media.rawg.io/media/screenshots/c30/c3061c90392662af43a2da942a038baf.jpg", "website": "https://www.zenartvr.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 489, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ZenART"], "genres": ["Adventure"], "publishers": ["ZenART"], "esrb_rating": null}