{"id": 971060, "slug": "night-spasm", "name": "Night Spasm", "name_original": "Night Spasm", "description": "<strong>This is an ongoing project and the first phase of a multi-chapter game. Chapter 1 is completable, but the content is subject to change until the release of Chapter 2!</strong><br/><br/><strong>WELCOME TO THE ISLAND!</strong><br/><br/>Night Spasm is a single-player philosophical role-playing video game that prompts you to make in-game decisions based on your real-life philosophies and worldviews. Designed for casual and non-casual players, Night Spasm is both an entertaining adventure of quests and combat but also a personal learning experience that tells a lore-rich story you can study, question, and interpret limitlessly.<br/><br/>The story follows the lives of three main characters, Theodore, Vander, and Evana, three air pilots who have found themselves in a mysterious world after seemingly dying from a plane crash. Saved from death by a wise and friendly mage known as MOG, the pilots find themselves in “The Island”, a once beautiful world designed to save the lives of those meeting an unfortunate end, now locked in war by an ambitious and terrifying enemy. Inevit, a phantom of unknown motivations, has captured a mystical entity called “The Rechance”, the source of magic power responsible for saving the lives of countless creatures, including the pilots. <br/><br/>As the player, you are responsible for guiding the pilots in forming a colony to take down the phantom and restore The Island to its former glory. Or perhaps, you may even have a different plan in mind for these characters…<br/><br/><strong>GAMEPLAY</strong><br/><br/>The gameplay is fairly simple but can become more complicated depending on the answers you seek. Exploring allows you to expand your colony via your base where you can interact with recruits, craft items, cook food, receive daily rewards, and more. The game features turn-based yet hectic battles, often presenting chances to greatly alter the storyline. Strategy and resourcefulness are the keys to defeating your enemies, whoever they may be, as you teach your colony members new skills, give them equipment, and bring them through an assortment of strange locations and societies.<br/><br/>There are many opportunities to befriend, kill, or even betray a colorful cast of characters through the battle system, each outcome significantly altering your playthrough one way or another. The game is open-world too, meaning most of the story alterations, big or small, are optional and can be done in the order of your desire, opening even more outcome possibilities.<br/><br/>Music plays an important role in Night Spasm. Composed by many contributing artists you may be familiar with, the soundtrack uses leitmotifs and recurring melodies to establish connections between certain in-game stories.<br/><br/><strong>THERE IS NO SUCH THING AS A SMALL DECISION...</strong><br/><br/>Night Spasm is an extremely choice-based game that emphasizes how the smallest of choices can make big impacts on yourself and the world around you. However, the unique part about Night Spasm is that you, the player, are not directly in control of anything within The Island, but instead nothing more than an influence. Parallel to real life, we aren’t in control of everything that happens around us, as nice as it would be. The same rules apply to Night Spasm. Your only way to change the course of time is to manipulate what the characters think rather than manipulate what the characters do, meaning it’s up to the characters to decide how they react to your influence. Sometimes you’re given the option to choose what a character says but not how they say it. Sometimes you’re given the option to choose what a character talks about but not directly what they say… or even who says it sometimes.<br/><br/><strong>A WORLD FILLED WITH TRIALS OF THE SOUL...</strong><br/><br/>Night Spasm is also a major personal experience. Through the game’s characters, lore, world, and choices available to you, Night Spasm deals with deep/sensitive topics and concepts seen in our modern society and in history. Night Spasm prepares you for real-world challenges and accurately applies your beliefs to the game, turning the tide of your playthrough. It’s up to you how you let your beliefs affect the storyline, but no matter what you choose, there will always be characters supporting your beliefs or fighting against them.<h3>NIGHT SPASM IS A GAME ANYONE CAN PLAY... YET IS A GAME THAT PLAYS WITH YOU...</h3><br/><br/><br/><strong>Chapter 1 is free to play, and Chapter 2 is in development!</strong><br/><br/>Chapter 1 includes over 30 hours of content and is designed for infinite replayability. Whether you're new to the psychological-adventure genre or a total RPG fanatic, there's an adventure calling your name... and perhaps, there's more to this game than meets the eye...<br/><br/><strong>THANK YOU FOR CHECKING OUT THE NIGHT SPASM STORE PAGE!</strong><br/><br/>For more information, subscribe to our YouTube channel and follow our team on Twitter (@master_moes). Be sure to join the Night Spasm Discord server too!<br/><br/><strong>Night Spasm Website</strong><br/><strong>Join the Night Spasm Discord server!</strong> <br/><strong>Twitter</strong><br/><strong>Instagram</strong><br/><strong>Night Spasm YouTube channel</strong><br/><strong>My personal YouTube channel</strong><br/><strong>Twitch channel</strong><br/><br/><strong>Chapter 1 OST download</strong>", "metacritic": null, "released": "2020-05-15", "tba": false, "updated": "2023-11-06T03:02:41", "background_image": "https://media.rawg.io/media/screenshots/163/163f2f92a3aa98e922f80f68293895c5.jpg", "website": "https://www.nightspasm.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gideon Moes"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Gideon Moes"], "esrb_rating": null}