{"id": 971082, "slug": "bishoujo-battle-hanafuda-koi-koi", "name": "Bishoujo Battle Hanafuda Koi-Koi", "name_original": "Bishoujo Battle Hanafuda Koi-Koi", "description": "The Bishoujo girls from \"Rick G Earth\" mobile military turn-based strategy game from Japan are here! And they want to play Koi-Koi, the most famous Japanese flower card game with you.<h3>◆Optimized for Hanafuda Beginners</h3>Even if you have never played with hanafuda (flower cards from Japan), play through the easy-to-follow tutorial and learn the basic rules of Koi-Koi, the most popular hanafuda game in Japan.<br/><br/>Each turn, play a card from your hand and you collect any pairs you create with your card. You earn points by forming a Yaku (point scoring card combination). When you form a Yaku before the opponent, stop or call “koi koi” to continue the round, potentially increasing your winning at the risk of the opponent stealing the point from you by forming a Yaku before you.<h3>◆Beautiful Japanese Design</h3>Cards feature floral and animal designs from the Japanese folklore evoking a sense of “wabi sabi” – traditional Japanese aesthetic.<h3>◆ Bishoujo Girls are here!</h3>Featuring combat girls and anthropomorphic weapons from the \"Rick G Earth\" universe, battle against the bishoujo girls in single player mode: win battles all across Japan and collect unique character cards and achievements.<h3>◆ Multiplayer support!</h3>For an even greater challenge, hop onto the multiplayer mode to play against players from all over the world. Find out how you rank against the Koi-Koi masters.", "metacritic": null, "released": "2020-05-18", "tba": false, "updated": "2023-11-06T03:39:09", "background_image": "https://media.rawg.io/media/screenshots/b6e/b6e0c25c00dc4ffbf985e58a4272f6af.jpg", "website": "https://game.zoo.jp/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zoo"], "genres": ["Casual"], "publishers": ["Zoo"], "esrb_rating": null}