{"id": 971147, "slug": "shi-jian-qia-pai-timelinecard", "name": "时间卡牌 TimelineCard", "name_original": "时间卡牌 TimelineCard", "description": "This is a card action martial arts Jianghu game: &gt;<br/>By constantly strengthening ourselves, we can defeat the incredible enemies, even justice or evil.<br/>Nearly one hundred martial arts moves, find the enemy's weakness, equip your luck and defeat them with your strategy.<h3> features:</h3><ul><li>Eight sects' unique skills and Jianghu starting skills, 74 moves in total;<br/></li><li>Store system with limited resources, you may have to save money;<br/></li><li>There are four common attributes related to attack and defense in martial arts, which not only affect the attack but also the defense. If the boss defense is low, it is possible to pass the customs with one stroke;<br/></li><li>When starting other time lines, the hidden functions such as card selection will be enabled, making it easier to trigger continuous technology;<br/></li><li>Open play, can attribute build, card build, or weaken any enemy;<br/></li><li>Random enemies, random treasures, random store items;<br/></li><li>It is strategic and easy to operate, but the game is difficult.</li></ul><h3>strategic </h3>It focuses on strengthening the combat system, four states are related to card damage, and four kinds of defense breaking effects have a greater impact on the combat (when the enemy's power is negative, the defense breaking).<br/>Martial arts moves of the same sect will trigger cost reduction. Each sect has its own unique skills: you can kick the head, injure, poison attack, internal skill, Dodge, double critical hit, triple critical hit, heal yourself and stun the enemy.<h3>easy to operate</h3>3D world, 2D UI. There are hundreds of moves and dozens of special effects for players and enemies. It's easy to operate, just use your brain.<h3>world view</h3>You may be looking for something, a father you haven't seen for a long time, stronger , or a secret of time. The end seems to be the starting point. When you get there, there may be a clue.", "metacritic": null, "released": "2020-05-26", "tba": false, "updated": "2023-11-06T06:36:00", "background_image": "https://media.rawg.io/media/screenshots/ec7/ec7e6aee39ad6f9db70660a3f8264317.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 275, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bayun"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Casual", "Indie"], "publishers": ["Bayun"], "esrb_rating": null}