{"id": 971178, "slug": "enthrean-radiance-prologue", "name": "Enthrean Radiance: Prologue", "name_original": "Enthrean Radiance: Prologue", "description": "On her way to Offelia City, Millia had a fateful encounter with the combat expert Razh. Determined to reach her destination, the girl then enlisted Razh as her bodyguard. Little did they know, what started as a simple contract would eventually bring them to a thrilling and unforgettable journey.<br/><ul><li><h3>Characters</h3></li></ul><strong>Razh Avandrey - </strong>“It’s interesting.”<br/>A very competent and foul-mouthed mercenary who’s really strict with money. Has serious illness related to his memory. At many several times he keeps bounded with Millia mostly because of money, but later he finds his very own reason to follow her.<br/><br/><br/><strong>Millia Melody</strong> <strong>-</strong> “Never give up before you give any struggle!” <br/>A clumsy yet optimistic girl and somewhat perverted. She’s a special agent of a planet-recovery organization known as SOFRA. She is given a duty to recruit potential people to join the organization project. She faithfully work for the organization because she simply wants to save Enthrea.<br/><ul><li><h3>Features</h3></li></ul><h3>Classic Action Battle System</h3>Take on your enemies in a fast-paced combat and switch your character on-the-fly for strategic advantages!<h3>Dual Protagonists</h3>Enjoy the story as it is told through two different character perspectives.<h3>\"Hexa Battle\" Mini-Game</h3>A popular card battle in Enthrean, perfect as a distraction from the burden of saving the world.", "metacritic": null, "released": "2020-10-28", "tba": false, "updated": "2023-11-06T08:08:48", "background_image": "https://media.rawg.io/media/screenshots/980/980d7c40091954d0e8c298eb2aa34b1a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["stellarNull", "Enthrean Guardian", "Eggion"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Eggion"], "esrb_rating": null}