{"id": 971171, "slug": "dont-wake-the-night", "name": "DON'T WAKE THE NIGHT", "name_original": "DON'T WAKE THE NIGHT", "description": "A 2D point-and-click game, <strong>DON’T WAKE THE NIGHT</strong> is a visual novel-inspired game based on elements of community, witchcraft, and ancestry.<h3>WHAT CAN YOU DO IN DON'T WAKE THE NIGHT?</h3><br/>As the player, you navigate the story as the spirit, an entity summoned by a community of witches who are in the middle of handing out judgement, which they leave up to you to decide. Having no memories of the world of the living, you must gather as much information as possible before making your decision. The witches themselves cannot see or hear you — for those who are not given the responsibility of speaking with spirits cannot approach them. <strong>DON’T WAKE THE NIGHT</strong> is a collection of honest conversations between individuals belonging to the same community, and the heartache that comes with doubt and brewing tensions.<br/><br/>With a soundtrack by Halina Heron and songwriting by TV-MA, you will become entrenched in a foreboding and ominous environment, with visuals and narrative based on creator Santo Aveiro-Ojeda's Guarani spiritual and community teachings.<h3>GAMEPLAY</h3><br/><br/><br/><ul><li>Interact with objects in the environment by clicking and watching the reactions of each character<br/></li><li>Eavesdrop on conversations and pick up on keywords that will reveal hidden text<br/></li><li>Make a decision that will forever change a community you do not belong to</li></ul>", "metacritic": null, "released": "2020-10-28", "tba": false, "updated": "2023-11-06T07:46:32", "background_image": "https://media.rawg.io/media/screenshots/618/618c3ee2d56e42da0574e499b64b8998.jpg", "website": "https://brujeriaatwerk.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Brujería @ Werk"], "genres": ["Indie"], "publishers": ["Brujería @ Werk"], "esrb_rating": null}