{"id": 971160, "slug": "trivia-tricks", "name": "Trivia Tricks", "name_original": "Trivia Tricks", "description": "Trivia Tricks is the ultimate online quiz game, supporting up to 8-players and all your friends can join for free!<br/><br/><br/><br/>Trivia Tricks includes thousands of questions across 13 categories, from trivia staples like Music and Geography to specialist subjects like Video Games and Anime. User-created Quiz Packs can also be downloaded from the Steam Workshop in just a single-click, so you’ll never run out of trivia topics!<br/><br/><br/><br/>Trivia Tricks isn't just competitive, it's co-operative! Team up with your buddies and face off against eight trivia bosses, all with their own rule sets and specialist subjects.<br/><br/><br/><br/>On top of showing off your big brain, let everyone know you can accessorize too! Your trivia achievements will unlock cosmetics to use in the character creator. Prove you're one smart cookie before the gameshow even starts!<br/><br/><br/><br/>During Chance Round you’ll be given the opportunity to risk your hard-earned points to gain game-changing items and claw an edge on the competition. Alternatively, if you want a pure test of brain mettle, you can turn Chance Round off!<br/><br/><br/><br/>Can you outsmart Twitch Chat? Invite your audience into your online lobby and see if you can conquer their collective voting! Up to 4 streamers can add their entire chatrooms for intense Chat vs Chat matchups.", "metacritic": null, "released": "2020-10-27", "tba": false, "updated": "2023-11-06T07:16:50", "background_image": "https://media.rawg.io/media/screenshots/368/36854ce7a5ea66f1c23007b23c6df8d0.jpg", "website": "https://www.triviatricks.net", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 3, "achievements_count": 42, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["3-Tricks"], "genres": ["Strategy", "Casual"], "publishers": ["3-Tricks"], "esrb_rating": null}