{"id": 971125, "slug": "virtual-presenter-pro", "name": "Virtual Presenter Pro", "name_original": "Virtual Presenter Pro", "description": "Virtual Presenter Pro is a VR game designed to make you a better public speaker without leaving your home.<br/><br/><br/><br/>You develop your presentation skills by practicing in a variety of environments, where your speech is monitored and assessed, giving you personalized feedback. Choose from three random topics to challenge your ability to think on your feet or recite a pre-written speech. By measuring several distinct metrics, the analysis of your speech will let you know where you excel, and where there’s room for improvement.<br/><br/><br/><br/>Honing your skills and letting you get more comfortable with being the center of attention are the reason this program was built. With settings ranging from a university lecture hall to a corporate board room, you can practice your speech or presentation in an immersive environment where you’re free to make mistakes without judgement.<br/><br/>Key Features:<br/>*In-depth analysis of your speech with 7 different metrics being measured at all times.<br/>*Responsive audience <br/>*Four different environments that recreate places where you’re likely to be giving a speech or presentation in full VR<br/>*… and much more to come<br/><br/>Please note that in order for the program to work properly, your Windows settings must have Windows Dictation Recognizer activated. Without this, your speech cannot be properly analyzed.", "metacritic": null, "released": "2020-05-22", "tba": false, "updated": "2023-11-06T05:25:39", "background_image": "https://media.rawg.io/media/screenshots/b02/b0247d8a95544dd08ece1c38eb801d1b.jpg", "website": "http://www.anxioussoftwareinc.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Anxious Software"], "genres": ["Simulation", "Indie"], "publishers": ["Anxious Software"], "esrb_rating": null}