{"id": 971179, "slug": "tramsim-vienna-the-tram-simulator", "name": "TramSim Vienna - The Tram Simulator", "name_original": "TramSim Vienna - The Tram Simulator", "description": "Pure photorealism, highly realistic graphics and highly detailed buildings let you dive into the virtual city as if you were right there! In addition, highly realistic controls and many functions and details just as they exist in reality round off the simulation experience perfectly.<br/><br/><br/> <br/><br/>Driving a tram is not complicated! You can start with the beginner mode and activate controls for advanced &amp; professional users. Steer with great precision through the traffic and get your passengers to their destination. All of this with incredible graphics and great fun!<br/><br/><br/> <br/><br/>Discover the heart of Vienna - one of the most beautiful and greenest cities in the world! The historic city center with the magnificent Ringstrasse, countless sights, classical buildings and a wonderful ambience. At any time, from anywhere in the world.<br/><br/><br/><br/><br/><br/><br/>On an area of almost 4,000,000 m² the map with the tram network in TramSim extends around the famous Ringstrasse, the heart of Vienna to the green Prater as well as to the south of Vienna. Many sights are waiting to be discovered by you!<br/><br/><br/> <br/><br/>We have implemented the brand-new tram generation „Flexity“ of the Vienna transport company Wiener Linien down to the last detail, with outstanding sound and driving dynamics - exactly like the real thing. On a route network of almost 25 km in length in a densely built-up area of Vienna's inner city, you can put your driving skills to the test.<br/><br/><br/><br/><br/>Whether open-world, scheduled service with timetable, level ranking or our tram-challenges - there is something for everyone! Take your passengers safely to their destination and prove your driving skills at the tram-challenges. Many hours of fun, entertainment and wonderful impressions await you!<br/><br/><br/> <br/><br/><br/><br/><br/>You will never cease to be amazed by the quality of our buildings. With great attention to detail, several hundreds of buildings have been reconstructed true to the original and equipped with many small extras.<br/><br/><br/> <br/><br/>For all enthusiasts we have not spared to implement all operational objects correctly and in detail. Exact track geometry, original switch point models of various designs and many other details at all corners and ends along the track can be discovered.<br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/>Shortly before the end of 2017, the prototype of the new tram for Vienna was completed and handed over to Wiener Linien in 2018. The new low-floor trams will successively replace the last high-floor models of the Wiener Linien. The Flexity convinces with its low energy consumption, for example through LED lighting or air conditioning, which is energy-savingly adjusted to the number of passengers in the tram.<br/><br/>The interior of the new tram is flexibly designed. Generous multi-purpose areas, some of which are equipped with folding seats, provide more space for baby carriages and wheelchairs, which also makes it easier to get on and off the tram quickly. This shortens the time spent at the tram stop and allows the vehicles to be on time. Experience the vehicle novelty and test your skills!<br/><br/><br/><br/><br/><br/>The E2 was put into service for the first time in August 1978 and has been a prominent feature of the Viennese cityscape ever since. The E2 is based on the Mannheim type and differs from the E1 in several technical innovations, such as swing-out steps and a newly designed interior and is used almost exclusively in conjunction with the c5 sidecar. Production of the E2 vehicles was discontinued in 1990, but the vehicles are still in use in large numbers in tram operations in Vienna.<br/><br/>The articulated railcar is equipped with \"chopper control\". The \"chopper control\", also called pulse control, is a circuit for controlling motors. Here, the motor current is controlled by transistor pulse controllers. This transistor equipment primarily ensures that the car starts up and brakes quickly.<br/> <br/><br/><br/><br/>Discover the central route network of the Vienna city center.<br/><br/><br/><br/><br/> <br/><br/>With its track around the Ringstrasse, the Vienna Tram forms the heart of public transport in Vienna. Although primarily a daily means of transport, the well-developed tram network of the Wiener Linien connects the most diverse districts of Vienna with each other and is therefore ideal for discovering the city and its sights.<br/><br/><br/> <br/><br/>You can look forward to many more features in the coming years, more content from us and external developers and modders, and the opportunity to get creative yourself. This is just the start of the most modern simulation for urban transportation.<br/><br/><br/>", "metacritic": null, "released": "2020-10-29", "tba": false, "updated": "2023-11-06T08:20:22", "background_image": "https://media.rawg.io/media/screenshots/beb/beba6f02cd2134af9469a1b7d0d490f2.jpg", "website": "https://www.tram-sim.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 14, "achievements_count": 21, "ratings_count": 0, "suggestions_count": 284, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ViewApp"], "genres": ["Simulation", "Casual"], "publishers": ["Aerosoft"], "esrb_rating": null}