{"id": 971163, "slug": "pretty-girls-mahjong-solitaire-green", "name": "Pretty Girls Mahjong Solitaire [GREEN]", "name_original": "Pretty Girls Mahjong Solitaire [GREEN]", "description": "The Pretty Girls are back again with a new version!! <br/>Enjoy this newest installment in the Pretty Girls Mahjong Solitaire universe!<br/>Let's go GREEN and get back to nature!<br/>This time all of the anime girls have animal features.  How exciting!<br/><br/>Clear the tiles to reveal their sexy costumes.<br/>Do you have what it takes to clear all the tiles for more Pretty Girl surprises?!<h3>■ Classic Mahjong Solitaire rules</h3>Find pairs of tiles to delete them.<br/>Delete all tiles before time runs out to clear a round.<br/>Think strategically when deleting tiles, or you might run into a dead end!<br/><br/>Adding over 60 patterns of tiles.<br/>The tiles get shuffled every time you play, making it fun to play again and again.<h3>■ Pretty Girls are waiting for you to come play!</h3>Five characters appear in this game.<br/>Once you make it to the third round, a girl in a sexy costume begins to reveal herself as you delete tiles...<br/>As you clear stages, the girls get sexier and sexier!<br/>All characters have recorded voices!<h3>■ Character Introductions</h3><ul><li>PRIMINA<br/>The daughter of a dog-human mother, she has pleasant features with an easy going and obedient personality.<br/></li><li>SUMIRE<br/>A youkai, animal spirit in human form.  She's a fox spirit with a devious mind but also a gentle older sister.<br/></li><li>SHERIRA<br/>A cat-girl with strong features and a powerful, tsundere personality.<br/></li><li>NAZUNA<br/>A racoon spirit in human form, she has a quiet personality and lives life at her own pace.<br/></li><li>LATY<br/>She's a dog-girl with a friendly personality that matches her soft and fluffy features.</li></ul><br/>※This is a puzzle game with sexy characters (no nudity). Characters and character images used under license from their respective owners.", "metacritic": null, "released": "2020-10-27", "tba": false, "updated": "2023-11-06T07:24:11", "background_image": "https://media.rawg.io/media/screenshots/8e0/8e07077dd9397f0b9d59d03669981eec.jpg", "website": "https://game.zoo.jp/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 324, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zoo"], "genres": ["Casual"], "publishers": ["Zoo"], "esrb_rating": null}