{"id": 971105, "slug": "bishoujo-battle-mahjong-solitaire", "name": "Bishoujo Battle Mahjong Solitaire", "name_original": "Bishoujo Battle Mahjong Solitaire", "description": "The Bishoujo girls from \"Rick G Earth\" mobile military turn-based strategy game from Japan are here! And they want to go head to head in a battle of Mahjong Solitaire.<h3>■Puzzle game \"Mahjong solitaire\"</h3>Find pairs of Mahjong tiles to remove them from the board. Time will run out if you are too slow, or if you didn’t plan your moves ahead. <br/>Over 100 different tile layouts are available, with randomized patterns for endless replayability.<h3>■Characters from “Rick G Earth\"</h3>Popular characters from the mobile bishoujo strategy battle game “Rick G Earth\".  A total of 10 girls are showcased. <br/>Every 3 rounds of play, you unlock a new costume that and more is revealed as you progress deeper into the game.<h3>■Character Introductions</h3><ul><li>Shizuka Sabae [Garrison Girl] <br/>One of the best spotters in a garrison filled with spotters. No one can escape from her gaze, as long as her glasses aren’t fogged up. <br/></li><li>Karin Kanazawa [Garrison Girl] <br/>Ordinary child in a normal garrison, she enjoys taking unusual actions because she is easily bored with the status quo. <br/></li><li>Tomoka Sendai [Garrison Girl] <br/>Usually full of love and gentle like a goddess: but can become extra scary when angry.<br/></li><li>Matsuri Hisai [Garrison Girl] <br/>Daughter of famous celebrity couple, she wears kimono even at home.<br/></li><li>AH-64D [Weapon Girl] <br/>Finest of the Apache Longbow, gorgeous and deadly.<br/></li><li>AH-64D (3ath.) [Weapon Girl] <br/>Member of the 3rd Antitank Helicopter Corps. Blond hair and pale skin girl. <br/></li><li>Type 10 tank (8tk.) [Weapon Girl] <br/>Latest addition to the 8th Tank Battalion of the Ground Self-Defense Force, she is a serious and elite trained rookie. <br/></li><li>Heavy tank No.80 Beleza [Magma Army] <br/>Gas turbine powered, this weapon requires a lot of food. <br/></li><li>Unlock 2 hidden characters</li></ul>", "metacritic": null, "released": "2020-05-20", "tba": false, "updated": "2023-11-06T04:22:50", "background_image": "https://media.rawg.io/media/screenshots/5be/5be08511c9c101d03cc0d1bcc2b38509.jpg", "website": "https://game.zoo.jp/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 39, "ratings_count": 0, "suggestions_count": 259, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zoo"], "genres": ["Casual"], "publishers": ["Zoo"], "esrb_rating": null}