{"id": 971268, "slug": "pick-me-up-rescue-rangers", "name": "PICK ME UP! - Rescue Rangers", "name_original": "PICK ME UP! - Rescue Rangers", "description": "20XX - The peace of the people is being threatened by the invaders, 'Disalien' who have flown from space.<br/>\r\nThe future of mankind has been entrusted to the \"Flying intelligence control organization\" owned by Buster Ranger.<br/>\r\nAs a member of the rescue team, which is a subordinate organization of the institution, you will be contributing to save the people attacked by the invaders ...!<br/>\n<br/>\r\nPICK ME UP! -Rescue Rangers- is an action puzzle game where you drive a rescue car and help people in need on the map.<br/>\r\nYou can get the people that are in need of help in the car by stopping near them.<br/>\r\nYou can transport them by stopping near the safe area and get points in exchange.<br/>\n<br/>\r\nRescue as many people as possible and aim for a high score within the time limit.<br/>\n<br/>\r\nPeople are seeking your help in the awaiting 25 stages.<br/>\r\nTo break through the obstacles that block your path, you need to transform into a special vehicle with the help of your organization.<br/>\r\nWill you be able to rescue them? It all depends on your good judgment and rescue soul!<br/>\n<br/>\n<br/>\r\n-Techniques for aiming for a high score-<br/>\n<br/>\r\n1. Transport and build combos by rescuing multiple people in need at the same time<br/>\r\nThe score will be bonused by combos.<br/>\r\nYou can get up to twice the efficiency, so let's actively aim for combos!<br/>\n<br/>\r\n2. Transport the person in need of help to a safe area of ​​the same color<br/>\r\nWhen you get a color matching bonus, you can get an SRM gauge as well as an extension of the time limit.<br/>\n<br/>\r\n3. Burn the rescue soul! Super rescue mode (SRM)<br/>\r\nWhen the SRM gauge reaches its maximum, it enters Super Rescue Mode (SRM) for 10 seconds.<br/>\r\nDuring this mode, the rescue capability is greatly increased, allowing people in need of rescue to be placed in the car and transported to the safe area without stopping the car.<br/>\r\nIt also has a very high bonus effect on your score.<br/>\r\nTo aim for a high score, it is essential to use Super Rescue Mode (SRM).", "metacritic": null, "released": "2020-11-04", "tba": false, "updated": "2023-11-06T11:31:12", "background_image": "https://media.rawg.io/media/screenshots/f6f/f6fe4742ad65055c6ac0c300b2da0018.jpg", "website": "https://www.rf-games.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["R-FORCE ENTERTAINMENT"], "genres": ["Action", "Casual", "Indie"], "publishers": ["R-FORCE ENTERTAINMENT"], "esrb_rating": null}