{"id": 971240, "slug": "foglight", "name": "Foglight", "name_original": "Foglight", "description": "<strong>Brief history of the game.</strong><br/>Foglight is the first Unreal Engine game from DangerousBob. If you are visiting this store page you are one of the few to have discovered this little horror game that helped build the foundation for DangerousBob Studio LLC. <br/><br/><br/><br/><strong>Foglight </strong>is a single player horror game set around a pursuer, Farberto, that pushes the player to fight for their life. All the while you play, Farberto is learning and getting stronger. <br/>You play as a new Lighthouse Keeper, known as a Wickie, that finds out they are not alone on the night's watch. Open world, the game has multiple endings depending on how you play. Best of luck!<br/><br/><strong>Features: </strong><br/><br/><strong>An AI that does not \"Cheat\"</strong><br/>Unlike in other horror games, this AI plays by the same rules as you. The AI gets harder as time goes on, and reacts to your actions.<br/><br/><br/><strong>Free Roam</strong><br/>The game is set on an open Island, that you are free to explore. Save spots are rare, as the game was intended to be very challenging. <br/><br/><strong>Survival Horror</strong><br/>You will be faced with a Foe that will never stop coming after you. Never. The AI is on a bell curve that will make it try harder as time goes on. Jump scares naturally happen, and you have to stay alert at all times.<br/><br/><br/><strong>Challenging Puzzles</strong><br/>The Island is packed full of secrets and puzzles for you to explore. Take note that these puzzles are not for the faint of heart, and can be difficult even to seasoned horror game players.<br/><br/><strong>Replay Value</strong><br/>As you roam the island, you will set into motion one of several endings that vary widely from the other. Players are encouraged to post which playthrough they got first and play again to get a new one.<br/><br/><br/><strong>Story and Atmosphere</strong> <br/>The game is packed full of lore, notes and clues, for the player to explore and read up on. Turn the lights off, pull your chair up, and be ready to get scared!<br/><br/>Note: Youtubers are welcome to make videos or broadcast of this game. Please link to the Steam store in the description. <br/><br/><strong>Players are encouraged to wear headphones.</strong><br/>Sound is not only a big part of the scare factor, it is important for the gameplay.", "metacritic": null, "released": "2020-11-02", "tba": false, "updated": "2023-11-06T10:34:38", "background_image": "https://media.rawg.io/media/screenshots/427/427e8db9e0a18b38c60e09682af4b697.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 294, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DangerousBob Studio"], "genres": ["Action", "Indie"], "publishers": ["DangerousBob Studio"], "esrb_rating": null}