{"id": 971201, "slug": "cybertaxi", "name": "CyberTaxi", "name_original": "CyberTaxi", "description": "<strong>CyberTaxi</strong> is an action-packed driving first-person shooter and taxi simulator set in a grim vision of the future. You play as a <strong>cab driver</strong> who works in a dark-noir Hindenburg city and strives to escape this hellish location. <br/><br/>As a <strong>taxi driver</strong> you have to <strong>complete dozens of various missions</strong> for different factions and gain access to further districts of Hindenburg city. During your dangerous roam you will have an opportunity to <strong>buy various weapons, shields and gadgets</strong> for your taxi. During your journey you will <strong>come across hundreds of customers - talk with them in order to get valuable information</strong>. Perhaps you may have a chance to survive and escape this unsafe post-apocalyptic urban area.<br/><br/><strong>KEY GAME FEATURES</strong>:<br/><br/> <ul><li> Complete over 300 random missions in 4 different districts!<br/></li><li> Earn money to purchase dozens of weapons and repair your cab!<br/></li><li> Select your favorite cab color and customize your taxi!<br/></li><li> Gigantic playing environment set in a dark-noir futuristic city!<br/></li><li> Speak with various customers to find out more about dystopian future!<br/></li><li> An ironic comics-like graphics style and humorous visuals!<br/></li><li> Combines best elements of FPS, car racing games and demolition derbies!<br/></li><li> Search for hidden collectibles and additional activities around the city!<br/></li><li> Cool, cyber-punk and funky synth-wave music tracks included!<br/></li><li> Fatally eject customers who offend you!<br/></li><li> Dozen of amazing effects like refractive rain drops &amp; dynamic lens flares!<br/></li><li> All above… and a lot more awaits!</li></ul><br/>Year 2128. The corrupted Gambricorp organization has led mankind to the verge of self-destruction due to new types of drugs which turned residents of European cities into lunatic maniacs. Once a noble town, Hindenburg city transformed into ruined metropolis which has been contaminated by overwhelming level of pollution, high crime rate and illegal drugs. In their madness, residents have equipped their hover vehicles with deadly weapons and explosive charges in order to wreak havoc on the littered streets of Hindenburg. Many people have decided to become criminals and forgot about their conscience... <br/><br/>PS One more thing, you can buy a buzzsaw and mount it on the hood of your cab! Sounds good, right? :)<br/><br/><strong>Have a nice night!</strong><br/><br/><strong>IMPORTANT NOTE</strong>: The game will receive additional language packs after the release in a patch. Currently, English is the only supported language of the game.", "metacritic": null, "released": "2020-10-30", "tba": false, "updated": "2023-11-06T09:32:40", "background_image": "https://media.rawg.io/media/screenshots/da2/da2b58f2d8e945a6d240846f67eff65a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 15, "ratings_count": 0, "suggestions_count": 292, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Projects from Basement"], "genres": ["Action", "Simulation", "Racing", "Indie"], "publishers": ["Ultimate Games"], "esrb_rating": null}