{"id": 971208, "slug": "lights-camera-reaction", "name": "Lights, Camera, Reaction!", "name_original": "Lights, Camera, Reaction!", "description": "<h3>No virtual reality? No problem!</h3><br/>Play <strong>Lights, Camera, Reaction! IRL Edition</strong> head to head with family and friends in real life with this non-VR version of the game!<br/><br/>IRL Edition features 6 selectable game modes for you and some friends to compete in.  Act out words, draw pictures, battle with jelly blobs, cock block friends, and more in this online smartphone interactive battle!<h3>Featuring 3 different VR game modes:</h3><br/>- <strong>Solo / Single Player </strong>- A progressively faster and faster reaction mode with over 50+ mini-games.  Slow down time, use power ups, fight bosses, and complete as many consecutive reactions as possible.  Some of these reactions include mowing down zombies, sniping targets, chopping off man buns, playing retro 2D platformers, and more!<br/><br/>- <strong>Local Multiplayer (VR / keyboard / controller)</strong> - A game show themed local multiplayer blast with 2-6 players. Each get a turn in the VR headset and play 1 of 6 unique game modes. The VR player will collaborate with local players, or play against them! Great to play with friends and family at parties using a controller, keyboard, and TV.<br/><br/>- <strong>Online Multiplayer (VR / smartphone)</strong> - A modern take on some of the timeless and fun party game classics.  The party leader plays the entire match from the headset, while 3-8 players connect from smartphones. Great to play with friends and family at parties using smartphones and a TV.<br/><br/>", "metacritic": null, "released": "2020-10-30", "tba": false, "updated": "2023-11-06T09:49:04", "background_image": "https://media.rawg.io/media/screenshots/35f/35f99860f432fb35be3ccb2597b91bc3.jpg", "website": "https://www.fluxean.com/games/lights-camera-reaction", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fluxean"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Fluxean"], "esrb_rating": null}