{"id": 971342, "slug": "delta-light-2", "name": "Delta Light", "name_original": "Delta Light", "description": "<h3>Description</h3><br/>Delta Light is a retro Arcade strategy/puzzle game where you play as Delta, the ghost. Each level you draw lines to remove parts of the field while enemies try to stop you. Combine your speed and insight to out maneuver and puzzle your way around the enemies to complete the many levels! The game is easy to learn and addictive. Pick it up and have a go!<h3>Game Modes</h3><br/><br/><ul><li><strong>Campaign </strong>- Play through more than unique 75 campaign maps.<br/></li><li><strong>Infinite mode</strong> - Rank Up by playing pseudo randomly generated maps with fresh affixes (New in 1.1 patch!)<br/></li><li><strong>Level Editor</strong> - Use the simple ingame level editor to Create Custom maps and Share them with anyone using a simple sharing string.</li></ul><h3>Fruit Pickups</h3><br/>During the course of the game you will encounter healthy snacks to pickup to boost your stats. Pick up the fruits to gain stackable bonuses, gain the power of Cherries for super speed or the power of Melons to make you tough as nails!<br/><br/><h3>Unlockable Characters</h3><br/>Unlock 10 (+1 since 1.1 patch!) characters each with their own unique passive effect and retro visuals. All unlockable by just playing the game &lt;3 Each Character is playable in any play mode and you can switch your character each map.<br/><br/><h3>Steam features</h3><br/><ul><li>Steam Achievements <br/></li><li>Steam Statistics<br/></li><li>Steam Cloud<br/></li><li>Steam Community</li></ul><h3>Controls</h3><br/>Delta Light supports the Up/Down/Left/Right scheme, the W/A/S/D scheme, and Controller input. Pretty much enything with directional keys is suported at this point.<br/><br/>", "metacritic": null, "released": "2020-11-09", "tba": false, "updated": "2023-11-06T14:08:10", "background_image": "https://media.rawg.io/media/screenshots/fcb/fcb9bb8507a044367c11775de074f879.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FlapBox Studios"], "genres": ["Strategy", "Indie"], "publishers": ["FlapBox Studios"], "esrb_rating": null}