{"id": 97136, "slug": "ebony-spire-free", "name": "Ebony Spire - Free", "name_original": "Ebony Spire - Free", "description": "<p>The demo contains the first 5 levels (and the corresponding portal worlds) of the full game! Once level 5 is beaten the game takes you back to the main menu! You can purchase the full game on itch.io or steam! No content is locked and all features are there with just a 5 level limitation. You can play through the original hand-crafted levels or via the procedural ones from the Infinite Heresy update! Have a blast and remember - buy the full game if you enjoy it!</p>\n<p><strong>CHOOSE THE WAY YOU WANT TO PLAY</strong>\n</p>\n<p>Try out the <strong>Classic Mode</strong> which allows you to explore the game via hand-crafted levels and carefully placed encounters or test your skill and luck in the <strong>Infinite mode</strong> which features procedurally generated levels!</p>\n<p><strong>KEY FEATURES</strong>\n</p>\n<ul><li>All items can be used by and against the player. Enemies have access to the same abilities as you do</li><li>Character development revolves around the items that can be obtained. There are no classic stats or XP grinding </li><li>Turn-based combat in a very roguelike fashion</li><li>Portals that will lead you outside the tower for a quick item hunting session: Cities, Harbors, Dungeons and Arenas can be explored</li><li>Two game modes: Classic and Infinite Heresy - toggle between them with a simple visit to the options menu!</li></ul>\n\n<p><strong>WHY YOU MIGHT NOT LIKE THIS GAME</strong>\n</p>\n<p><strong>Ebony Spire: Heresy </strong>is a niche game that blends roguelike mechanics with old-school first person dungeon crawlers. The game is designed as a coffee-break game (short play sessions) and may be a deal-breaker for some players while others might enjoy the quick level-to-level progression while they are queueing in an online game.</p>\n<p><strong>MAKE THE GAME YOUR OWN</strong></p>\n<p>The source code for the game is available under the <strong>MIT license</strong>. Feel free to use it to create your own adventure. And since the code is easily accessible you can mod it, add items, enemies and levels to your hearts content. The game arrives with TileD integration and you can use the supplied spritesheet to create your own levels and puzzles and share them with the community. Or use the integration and your own assets to create your own game. It's up to you what you do with the source code.</p>", "metacritic": null, "released": "2017-11-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/73b/73b2ca0205f8c2f919b57eb25e404aef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Bacioiu Ciprian"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}