{"id": 971391, "slug": "don-flatus-poop-hunter", "name": "Don Flatus: Poop Hunter", "name_original": "Don Flatus: Poop Hunter", "description": "<strong>GAME PLAY</strong><br/><br/> <ul><li>Chase the Mutant Poops and squish the GlutBugs before Don Flatus runs out of oxygen and suffocates from the stench.</li></ul> <ul><li>Chasing the Mutant Poops for too long will result in them giving Don a trump scare!</li></ul> <ul><li>Mission control will guide you through secret corridor combinations to reveal the hidden crystals.</li></ul><br/><strong>CONFLICTING OBJECTIVES</strong><br/><br/>Collecting the GlutBugs is easy! Collecting the GlutBugs and finding the hidden content is hard! The need to chase the Mutant Poops will take you one way but the hunt for the hidden crystals will take you in another. Should you choose to find the hidden crystals, you will then have to find where the Mutant Poop has gone and collect its GlutBugs before you suffocate from the stench!<br/><br/><strong>FEATURES</strong><br/><br/><ul><li>60 unique maze levels each with its own theme tune.</li></ul><ul><li>60 extended EDM/Dance tunes (1 for each level).</li></ul><br/><strong>BACK STORY</strong><br/><br/>The year is 2147. After years of sending probes to Uranus, all the debris is now orbiting the planet as a ring of junk.<br/><br/>The interplanetary commission has now sent a crack cleanup crew (the Fecal Assault &amp; Resistance Team, F.A.R.T for short) to clean the ring around Uranus. The team, comprising of Don Flatus, Gus Etsniffer and Skidzinya Shortz arrive at the planet and find that they are not the first to inspect Uranus's dirty ring!<br/><br/>In an unexpected turn of events it is clear that Uranus has been invaded by an alien presence. Communications back to Earth are jammed so the crew can not inform Mission Control that the situation at Uranus is far bigger than expected!", "metacritic": null, "released": "2020-11-27", "tba": false, "updated": "2023-11-06T15:29:41", "background_image": "https://media.rawg.io/media/screenshots/13c/13c196b319a976fa816af4bbda6f477b.jpg", "website": "https://DonFlatus.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 12, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Uridium", "Scott A. Cooke"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Uridium"], "esrb_rating": null}