{"id": 971324, "slug": "chasing-tail", "name": "Chasing Tail", "name_original": "Chasing Tail", "description": "<h3>Welcome to Chasing Tail!</h3><br/>A fantasy of creatures big and small in all shapes and sizes peacefully living among one another. But a quiet danger threatens the tranquility of life, and could potentially throw the balance into chaos. Who will stick by your side? What bonds will hold true to the end? Will love help you prevail or will hate end us all?<h3>So what’s in this game?</h3><br/>This game contains a full adventure! One main overarching story and 10 main characters to date and possibly romance with. Each main character contains their own story with different branches and scenes to see depending on your actions. Your actions and answers to questions will affect who you spend time with, and each character's affection towards you. Based on your decisions things may turn out great for you and others, or maybe not. There are multiple side characters to meet on your adventure as you play through the game's main story and even some additional bonus scenes and romance options!<h3>Can I help or contribute?</h3><br/>Contribution is completely 100% optional. Just reading this page means a lot. The biggest thing you can do is share my content or the link to the game. <br/><br/>If you play it, give feedback! Tell me things you’d like to see or things you think would make it better. Let me know what errors you find (spelling specifically) or what would make it better.<br/><br/>This game will always be free to play and I will be working on it in my spare time to push out constant updates.<h3>Is this early access? </h3><br/>Nope! The game is released and playable until the end. Development is ongoing and I'm working on adding more and more bonus content. I'll also be constantly fixing bugs or errors found by myself or the community.", "metacritic": null, "released": "2020-11-06", "tba": false, "updated": "2023-11-06T13:38:54", "background_image": "https://media.rawg.io/media/screenshots/770/7700d6d04a5807723d2fabd96365c6a8.jpg", "website": "https://www.scylez.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 30, "ratings_count": 0, "suggestions_count": 351, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Scylez Studios"], "genres": ["Casual"], "publishers": ["Scylez Studios"], "esrb_rating": null}