{"id": 971394, "slug": "s-h-r-i-m-p", "name": "S H R i M P", "name_original": "S H R i M P", "description": "<strong>The Darkness Confessed.</strong><br/>S H R i M P is a third person platformer where you play as a Shrimp set in a world of abstract darkness. You take on the mantle of completing a ritual that had been abandoned. Only the first step is clear of this ritual which is to collect all the cars. During this journey of collecting cars on levels you come across horrific entities roaming around trying to prevent you from completing the ritual. You cannot fight back or engage into combat. Best you can do is use your abilities to escape from the entities or calm the Shrimp from gaining too much anxiety. Will you be able to complete the ritual? Are you brave enough to persevere till the end in this forsaken world?<h3>Game Features:</h3><br/>Basics<br/>The full game includes 20 levels total with loads of skins and headwear for the Shrimp (Currently still developing cosmetics). You can find some skins/headwear hidden on levels and buy them in the store with coins you pick up. There are three difficulties present in the game. There is Endurance, Purgatory and Sinner. Each difficulty adds a new challenge. These new challenges are detailed within the game’s difficulty screen. <br/><br/>Mechanics<br/>The Stereo is the most important element to calming the Shrimp taking away the anxiety. Listening to music on the stereo is not mandatory on all levels while on some it is crucial you do. Anxiety plays a significant role on levels that contain entities such as the Porcelain Ghost and False Car. Another mechanic that will come to use is playing dead. Porcelain Ghost will ignore you when you play dead. Keep in mind if you do not play dead on time you will suffer the consequence. Shrimp is able to evolve and gain newer abilities progressing further into the game. These abilities will help you traverse levels efficiently.", "metacritic": null, "released": "2020-11-16", "tba": false, "updated": "2023-11-06T15:35:14", "background_image": "https://media.rawg.io/media/screenshots/987/987ea01fe64ac2b3f3616b9910002403.jpg", "website": "https://www.seniattusstudios.com/shrimp", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Seniattus Studios"], "genres": ["Indie"], "publishers": ["Seniattus Studios"], "esrb_rating": null}