{"id": 971323, "slug": "mechblaze", "name": "MECHBLAZE", "name_original": "MECHBLAZE", "description": "Machine guns mow down wave after wave of advancing steel.<br />\nPile Bunkers send deadly lances piercing through giant foes.<br />\nThen, from the flaming rubble...an invincible super robot is reborn!<br />\nSuper Mechs born of advanced science and modern weaponry battle in heavy weight run-and-gun mech shooter!!StoryThe year is 1989 AD.<br />\nThe extraterrestrial invasion from the &quot;Gogoh Army&quot; has been crushed, and humankind is finally beginning to return to peace and prosperity.<br />\nBut then, a powerful secret society known as the &quot;Neo Roland Party&quot; rises up and executes synchronized attacks across the globe plunging the world into chaos once again.<br />\nThe remaining military forces have now re-mobilized, and are poised to boldly fight back against the rampaging Neo Roland Party...<br />\nThis is the saga of another epic battle that took place at the same time as the events in ARMED SEVEN.Playable CharacterSER-28 Vostok<br />\nA 6.1 meter tall small type MCR (Manned Combat Robot).<br />\nDeveloped by professor Amamori as a hobby project, it serves as a shining testament to the technological prowess of his research lab.<br />\nDespite its small size, ultra-thick armor and an ability to wield a wide variety of weapons puts its combat effectiveness on par with even heavy class MCRs.<br />\nIt has many auxiliary attachments as well, however most of them were destroyed during heavy fighting.Features6 Unique stages of robo combat action!<br />\n13 types of weapons to meet any situation<br />\n5 difficulty levels: Easy to INSANE!<br />\nCreated by ASTRO PORT<br />\nASTRO PORT is a veteran Japanese development team whose collective message to the world is, ‘This is how fun action shooting games can be!” ASTRO PORT’s deep catalog of rock solid shooting games also features ARMED SEVEN, GIGANTIC ARMY, SATAZIUS, and STEEL STRIDER.</p>", "metacritic": null, "released": "2020-11-06", "tba": false, "updated": "2024-03-11T20:08:57", "background_image": "https://media.rawg.io/media/screenshots/6c5/6c5a9c88faf05f1d5ec71cdb469ad7c6.jpg", "website": "http://www.interq.or.jp/saturn/takuhama/mb.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 436, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Nintendo Switch"], "developers": ["ASTRO PORT"], "genres": ["Action", "Indie"], "publishers": ["Henteko Doujin"], "esrb_rating": null}