{"id": 971483, "slug": "3d-double-dealing-character", "name": "3D Double Dealing Character", "name_original": "3D Double Dealing Character", "description": "This game is the second creation of Oriental project<br/>\n<br/>\r\n3DHzc is a flying shooting game from a free perspective. You will operate bolilingmeng, fog and rain magic Lisha, and go 16 nights to find and defeat the culprit of the change<br/>\n<br/>\r\nThis game will reproduce the story of the original Huizhen city. The props of Lingmeng, Malisha and Jiye seem to be a little different, so the three people embarked on the journey of investigation<br/>\n<br/>\r\nThe omni-directional operation mode is no longer limited to vertical and horizontal screens. The full screen three-dimensional bullet screen will bring you a different experience<br/>\n<br/>\r\nThe movement mode of the characters has changed from the original up, down, left and right to the front, back, left and right up and down, which can make you experience the fun of flying and avoid the barrage more happily and easily<br/>\n<br/>\r\nSubvert the traditional barrage method<br/>\n<br/>\r\nIn the past, a large number of three-dimensional barrages will consume a lot of computer performance, but with the cooperation of unity's ECS + jobs + burst, we can show as many barrages as possible in a very high-performance way<br/>\n<br/>\r\nAfter testing, gtx1060 graphics card can maintain smooth operation for 100W barrage (20 frames)<br/>\n<br/>\r\nTherefore, we can let go of the design and try to match the original barrage<br/>\n<br/>\r\nStreamlined game system<br/>\n<br/>\r\nFrom the beginning of design, this game has abandoned complex equipment, props and cultivation system, so that players can free themselves from the boring brush game and relax and experience the happiness of the game", "metacritic": null, "released": "2021-09-30", "tba": false, "updated": "2023-11-06T18:09:45", "background_image": "https://media.rawg.io/media/screenshots/464/4640dfcd38fe379ebcad1ab98015411c.jpg", "website": "https://space.bilibili.com/386884047", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ST.Games同人游戏社团"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["ST.Games同人游戏社团"], "esrb_rating": null}