{"id": 971435, "slug": "di-wu-jian-yi-liu-wu", "name": "第五件遗留物", "name_original": "第五件遗留物", "description": "<strong>\"As long as you can collect all the belongings, you can go back to the world. \"</strong><br/><br/>This is an AVG adventure game. In the game, the player will play as \"Thomson\", looking for his way home in a world full of monsters. Every choice of the player may affect his fate. There are all kinds of puzzles in the game: you need to collect props through jigsaw puzzles, organize a messy cabinet, and even you need to know a little music. <br/>With a deep script of 100000+ words, the game tells about an adventure story with gorgeous and unique ukiyo painting aesthetic style.<h3>Overview Of the story</h3><br/>With some special reasons, Tang Sheng, a human being, fell into a world of monsters between the underworld and the human world. At the same time, he found that he had lost his memory. He learned that he had to find all the \" belongings \" when he fell down to return to the world. In the process of searching, he has been faced with the threat of Monster Chaos that devours human souls. He also met various monsters with different personalities. <br/>In the game, you can help him to piece together his identity in the world through the acquisition of belongings, and collect various unexpected endings.<h3>Main Character</h3><h3>Tang Sheng</h3><br/>He woke up and find himself naked in a big hot pot, memory lost. In order to retrieve his memory and return to the human world, he has to work in the hotel \"Fushi\" which full of monsters.<h3>Bones White</h3><br/>A skeleton monster who also works in Fushi Hotel. <br/>She looks cheerful and acted optimistically, but seems that there was a deep past in her.<h3>Boss Luo</h3><br/>The boss of Fushi Hotel , which is a Nine Tailed Fox demon. He is irritable and seems to have a deep prejudice against human beings. He always threatens to throw Tang Sheng away to feed Monster Chaos.", "metacritic": null, "released": "2021-02-08", "tba": false, "updated": "2023-11-06T17:04:44", "background_image": "https://media.rawg.io/media/screenshots/9a1/9a194c3a40b13e677b4a7da4edefad7d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 19, "ratings_count": 0, "suggestions_count": 469, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["狼烟游戏studio", "雪糕棒"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["NiceBoat", "狼烟游戏studio"], "esrb_rating": null}