{"id": 971449, "slug": "playground-vr", "name": "Playground VR", "name_original": "Playground VR", "description": "<strong>Playground VR</strong> It is an open world game where you can experience the beautiful <strong> essence of VR. </strong><br/>Do you want to fly a balloon? <strong>Fly!</strong> Are you not afraid of being fired from cannon?<strong> Launch yourself!</strong> Do you want to take to the sea waves?<strong> Swim! </strong> Do you want to climb the building? Freeway! Maybe some football? <strong>Get the ball rolling!</strong> <strong>Yes you can do it all!</strong><br/><br/>This is <strong> Playground VR </strong>where you can freely do whatever you want!<h3>Features:</h3><ul><li>A lot of vehicles (Even almost tesla car similar to autopilot)<br/></li><li>Many different weapons (RPG, Guns, Lasers, Swords, bows)<br/></li><li>Ability to play with ragdolls (We don't tell you to hit them right away, but maybe nobody will notice)<br/></li><li>Uncountable amount of strange easter eggs and surprises<br/></li><li>Ferris wheel (Please no silly ideas)<br/></li><li>Realistic sea waves (Watch out!)<br/></li><li>Exploring the city (That's what this game is all about)<br/></li><li>Freedom (Nobody is standing over your head)<br/></li><li>Possibility to slow down time (Then make explosions!)<br/></li><li>Minigames (Basketball, parkour on time, scoring points on the motorboat)<br/></li><li>Plenty of achievements to unlock (For example, don't jump off the roof)<br/></li><li>Cannons (Guidance system, just take the aim (That's what she said))<br/></li><li>Windmills (Eat a lot so you don't blow up)<br/></li><li>Jetpacks (Do not fly off the map)<br/></li><li>Too many places to visit (Office, Gym, Soccer field, a basketball court)</li></ul><br/>I'm not writing anything more! Just buckle up! And you have to see for yourself!", "metacritic": null, "released": "2021-02-26", "tba": false, "updated": "2023-11-06T17:20:41", "background_image": "https://media.rawg.io/media/screenshots/b16/b163f56ef51e7035cf5601055f3fc5f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 294, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blacer Studio", "ROOM505", "Source Byte"], "genres": ["Action", "Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Source Byte"], "esrb_rating": null}