{"id": 971439, "slug": "game-kun-input-challenge", "name": "Game-Kun: Input Challenge", "name_original": "Game-Kun: Input Challenge", "description": "Game-Kun: Input Challenge is a reaction-based hiscore mini game. Test your reflexes with your gamepad. Earning badges aids your progress through a course of challenge levels. Unlock skins and other characters to enhance the fun! Can you reach the final level and compete for the ultimate hiscore?<br/>\n<br/>\r\n*Over 30 Skins to unlock at Launch and more Coming Soon!*<br/>\r\nUnlock \"Game-Kun\" alternate colours and other characters along the way, can you collect them all?<br/>\n<br/>\r\nWe hope you like pressing buttons!<br/>\r\nThis game is not for \"passive-gamers\" or \"screen watchers\"!<br/>\r\nGet ready to increase your reaction times, improve your controller skills and level up your brains!<br/>\n<br/>\n<br/>\r\nPerfect for quick pick up and play sessions, or for playing while waiting for that pesky update to download...<br/>\r\nTons of replay value and potentially hours of play time while you compete to dominate the leaderboards!<br/>\n<br/>\r\nGame-Kun: Input Challenge features a number of brain-busting input challenges including:<br/>\r\nRegular Inputs<br/>\r\nDon't Press Inputs<br/>\r\nColour Trick Inputs<br/>\r\nDouble Inputs<br/>\r\nTriple Inputs<br/>\r\nMulti-Combination Inputs<br/>\n<br/>\r\nDeveloper: We are a small 2 person team trying to provide people with fun games that won't exist unless we make them...<br/>\r\nIf you pick up a copy of this game that would be awesome, we really appreciate your support!", "metacritic": null, "released": "2021-02-09", "tba": false, "updated": "2023-11-06T17:09:57", "background_image": "https://media.rawg.io/media/screenshots/877/877a914f0902ee6b0b8f33f0a525a3e5.jpg", "website": "http://www.kasaon.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kasa On"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Kasa On Ideas"], "esrb_rating": null}