{"id": 971474, "slug": "operation-thunder", "name": "Operation Thunder", "name_original": "Operation Thunder", "description": "Operation Thunder is a top-down shooter with a tactical twist and destructible walls. <br/><br/>Approach situations with a variety of gadgets and guns to overcome any challenge in your way. Fight through 45 handmade levels to save the day. Take on levels however you want to. Take it slow and plan out every move, or go as fast as your trigger finger can take you and adapt on the fly.<br/><br/>Operation Thunder follows the story of an agent known as Falcon 1 as he is faced with a larger threat than anything he has faced before. As part of a group of elite soldiers, you will take on levels that will put you against an army of enemies. With each enemy you defeat, you'll get closer to victory, and eventually defeating the man behind it all. Along the way, you may find yourself wondering if the barrel of a gun is the best tool for solving problems. But we can worry about philosophy later, right now you have a job to do.<br/><br/>Good luck, Soldier.<br/><br/>Operation Thunder is made by a team of 2 people. We have worked hard to bring this game to life and we hope you enjoy playing it as much as we did making it.<h3>Key Points:</h3><br/><ul><li>2D Top-Down Shooter<br/></li><li>45 Levels<br/></li><li>Single Player<br/></li><li>Captivating Story <br/></li><li> Pixel Art Graphics</li></ul><br/>Operation Thunder has also received a free WINTER UPDATE. This free update includes:<br/><br/><ul><li>6 new levels<br/></li><li>Festive versions of the Pistol, Shotgun, SMG, and AR<br/></li><li>Some more story and jokes to enjoy<br/></li><li>2 new achievements to unlock</li></ul>", "metacritic": null, "released": "2021-09-29", "tba": false, "updated": "2023-11-06T17:54:46", "background_image": "https://media.rawg.io/media/screenshots/676/676170eef893c07a46a1608294a17bf4.jpg", "website": "https://www.flashblackgames.com/about", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 15, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Flashblack Games"], "genres": ["Action", "Indie"], "publishers": ["Flashblack Games"], "esrb_rating": null}