{"id": 971532, "slug": "unstrong-space-calamity", "name": "Unstrong: Space Calamity", "name_original": "Unstrong: Space Calamity", "description": "<strong>As you drift through space, you think ... \"just who exploded the world?\", \"floating at the same speed in the same direction for eternity should really be more fun\", and \"Blarg\". But suddenly, you feel the pull of gravity, and you can feel a big adventure ahead! Planets, Asteroids and countless oddities like mini-planets, grind rails, anti-gravitational bubbles, gravity fields, speed rings and -- unfortunately -- other people await! Ride that StarScooter and kick some starman butt!</strong><br/><br/><br/><br/>Unstrong: Space Calamity is a 3d platformer all about planets, weird gravity and the secrets of outer space. Explore or follow the main storyline -- it's all up to you!<br/><br/><strong>Story:</strong><br/><br/>A long time ago, the star people of the Sun City Pyrmia made sure that nothing would go wrong with the sun. But then they disappeared, and whatever happened remains a mystery. Many centuries later, a star-shaped world held together by chains was torn apart, and its debris sent drifting through space.<br/><br/>One of the inhabitants of the destroyed world, Glasses Unstrong, plans to put the old world back together with the help of her new friend, Flounder the star child. It's not gonna be easy, but mad scientists like Glasses always find a way to get what they want!<br/><br/><strong>Features:</strong><br/><br/>●Explore planets, moons and asteroids in outer space!<br/>●Explode blocks with bombs, pick up veggies or hit baddies with your trusty star friend Flounder!<br/>●Play around with grind rails, speed rings and zoom points.<br/>●Attempt to find hidden and often challenging 2d levels.<br/>●Follow optional quests or play the main story!<br/>●Explore many optional areas.", "metacritic": null, "released": "2021-12-07", "tba": false, "updated": "2023-11-06T19:15:35", "background_image": "https://media.rawg.io/media/screenshots/6de/6de4b0bf5efcc768959b78d346b03533.jpg", "website": "https://www.origamihero.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["origamihero games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["origamihero games"], "esrb_rating": null}