{"id": 971514, "slug": "the-infecting-3", "name": "The Infecting 3", "name_original": "The Infecting 3", "description": "Fight zombies, customise your character or your ride and try to survive!<br/>The Infecting 3 carries on the story of Alex, Rudi, Avery, Dominik, Leanna and Paul from the second choice (canon) ending of The Infecting 2. After fleeing from the military at the end of the second game, Paul tries to fly the helicopter to a place he promises will be safe. He is confused by how the fuel meter seems to never go down, but once he realises the gauge is broken, it's already too late, and the group crash land on a mysterious island. In search of the others and the truth behind the outbreak, Rudi, Alex and Leanna explore the island and its dark depths below the surface.<br/>The gameplay includes fighting and driving action.<br/><strong>Shooting</strong><br/>Guns vary massively in damage and fire rate, you must learn how to handle the weapons and conserve ammo, you will only get just enough to survive. If you run out of ammo in your primary weapon, you can always switch to your secondary, but this is usually a last resort.<br/><strong>Slashing</strong><br/>Melee weapons usually do a high amount of damage, you have to make sure to keep as far away from the infected as possible to stay safe, but stay close enough to hit. They are a high risk to use, but will never run out of ammo.<br/><strong>The Infected</strong><br/>The standard infected will try to bite you, killing you instantly, so make sure you keep your distance. Other evolved or modified infected may be faster or be able to attack with ranged projectiles, so make sure you are prepared to fight whatever is thrown your way.<br/><strong>Driving</strong><br/>Driving vehicles is a great way to get through a huge horde as you are safe inside, but this does not mean it will be easy. Infected with defences such as a riot shield may take two rams to take down, and evolved infected may take many hits before dying.<br/><strong>Human Enemies</strong><br/>Human enemies may be stronger than you, but lack the ability to focus their aim. Make sure you duck and dodge around bullets or swings before returning fire.<br/><br/><strong>Key Features:</strong><br/><ul> <li>Campaign that explores the deep levels of the island.<br/> </li><li>Custom survival mode which allows you to fight your way.<br/> </li><li>24 fully customisable characters with different skillsets.<br/> </li><li>32 fully customisable cars that prioritise either speed or damage.<br/> </li><li>Various challenges and modes to complete. (The Lambdatrials, Be the Zombie)<br/> </li><li>Sandbox to test out weapons, characters, AI, perks and more.</li></ul>", "metacritic": null, "released": "2021-11-30", "tba": false, "updated": "2023-11-06T18:53:23", "background_image": "https://media.rawg.io/media/screenshots/d42/d421c4271626dd695e42f6b9b98453d9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 284, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Immure Creations®"], "genres": ["Action", "Indie"], "publishers": ["Immure Creations®"], "esrb_rating": null}