{"id": 971597, "slug": "locked-up-2", "name": "Locked Up", "name_original": "Locked Up", "description": "<h3>General Information</h3><br/>Every autumn Snezhana goes to the woods for mushroom hunting. It has become her personal tradition — a tribute to her departed grandparents. Driven by a love for the woods that they had planted in her, she takes her dog, Ayda, and goes to their secret place. But, seeing that it had been emptied, she drives further, exploring an unknown, mysterious area.<br/><br/>The story takes place in 2007, when Soviet cars had not yet lost their relevance. You will experience together with the heroine the fear and loneliness alone with unfriendly nature.<br/>Only the faithful dog will always keep you company.<br/>Always?<h3>Game description</h3><ul><li>This visual novel is kinetic, meaning that there is no choices and only one ending.<br/></li><li>You don't have to do anything but enjoy the story.<br/></li><li>You can enable or disable auto-text playback.</li></ul><h3>Features</h3><ul><li>The narrative is in the first person. The main character has no sprites, but she appears during cutscenes.<br/></li><li>The pace of the narrative grows gradually and keeps the intrigue to the very end.<br/></li><li>The game contains 18 illustrations, 12 of which are not variations of the same scene.<br/></li><li>The sounds and music are integral and add to the immersion of the story.<br/></li><li>A gallery that allows you to watch your progress, as well as help you remember the bright moments.</li></ul>", "metacritic": null, "released": "2022-03-31", "tba": false, "updated": "2023-11-06T20:49:12", "background_image": "https://media.rawg.io/media/screenshots/a44/a445b5edf51fb72e7a147f00ac7e087c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Coyote's Corpse"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Akiyamy"], "esrb_rating": null}