{"id": 971510, "slug": "base-wars-2021", "name": "Base Wars (2021)", "name_original": "Base Wars (2021)", "description": "<h3>THE TURN BASED RTS </h3><br/>Base Wars goes where no other game has gone before and melds the big picture strategy of RTS games with the thoughtful pacing of TBS games. The result? Tactical perfection!<br/>Build up your territory, create a brand new army composition, take control of the land, and strike down whoever stands in your way! This game feels familiar, yet entirely novel through its boundary breaking landscape and fluid chess-like combat.<br/><h3> FIGHT YOUR FRIENDS </h3>Base Wars is balanced around multiplayer gameplay. Queue up for some casual Unranked matches online, or play against your friends directly! <br/>Do you like to test out new builds? The Singleplayer AI will put up a fight. <br/>Want a more serious experience? A Ranked Ladder system is on the way right now!<h3> EXPRESS YOURSELF </h3>Don't like the default look? That's okay! Base Wars includes a Unit Skin system letting you completely change how your units appear to you and your friends. Alongside this, we've also included a Map Editor to help get the creative juices flowing. Community made maps are even considered for base-game inclusion with future updates!<br/><h3> FIND A COMMUNITY </h3>Since Base Wars just released, the community is still small and tight-knit. We like to hang out in the Discord server and discuss build variants or possible balance changes for the next patch. Want to see more of something specific ingame? The Dev team is active and very receptive to your ideas!<h3> DEVELOP THE META </h3>Several years of playtesting with friends have lead to an extremely well balanced game. Even still, there's always interesting new builds and tactics discovered that provide opportunity for improvement! Crush the opponent with an early aggression, or defend and win by technological development- How will you choose to play?<br/>", "metacritic": null, "released": "2021-10-31", "tba": false, "updated": "2023-11-06T18:47:11", "background_image": "https://media.rawg.io/media/screenshots/cdc/cdc3facca532273e9831439fe0a95b4c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Everlasting Games"], "genres": ["Strategy", "Casual"], "publishers": ["Everlasting Games"], "esrb_rating": null}