{"id": 971547, "slug": "artisan", "name": "ARTISAN", "name_original": "ARTISAN", "description": "\"A young man finds himself trapped in an otherworldly museum where he is forced to fight in a battle royal using strange ghost-like creatures called Artisans.\"<br/><br/>**** <strong> THE STORY</strong> ****<br/><br/>In ARTISAN, Link awakens trapped in a bizarre museum. A mysterious woman named Lisa tells him that, in order to go home, he would have to find and kill seven other people in the museum before they can kill him. If he can't complete this task, he'll be placed on display in the museum forever. The situation only gets more bizarre when he discovers he is able to summon a ghost-like entity called an Artisan, a sentient weapon that he can command at will. The real problem is that the people hunting him can also summon Artisans of their own. Can Link survive this deadly game and figure out a way to escape the museum? Only you can decide his fate.<br/><br/>ARTISAN is a Japanese style visual novel with choice-based dialogue and the first release from STARRYWARE. It contains adult language, suggestive sexual themes and violence. Not suitable for minors.<br/><br/>**** <strong>ARTISAN GAME FEATURES </strong>*****<br/><br/><ul><li>FULLY ANIMATED 2D CUTSCENES</li></ul><ul><li>MULTIPLE ENDINGS</li></ul><ul><li>CHOICE-BASED DIALOGUE</li></ul><ul><li>AN ORIGINAL STORY WITH A DYNAMIC CAST OF CHARACTERS AND A UNIQUE ANIME STYLE</li></ul>", "metacritic": null, "released": "2022-02-03", "tba": false, "updated": "2023-11-06T19:38:41", "background_image": "https://media.rawg.io/media/screenshots/f80/f80d85662968c460de017de68a12cc0a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Starryware", "The Order Of The Frame"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["STARRYWARE"], "esrb_rating": null}