{"id": 971564, "slug": "g-darius-hd", "name": "G-Darius HD", "name_original": "G-Darius HD", "description": "Taito's Darius series began with the titular arcade game, Darius, in 1986 and comprises numerous side-scrolling shooting games released in arcades, many of which were later ported to game consoles.<br/>G-Darius is the 4th arcade game in the Darius series of horizontally-scrolling shooting games, which sees the Silver Hawks battling against huge, space-faring warships who resemble various aquatic life-forms. <br/>G-Darius HD features 5 versions of G-Darius: arcade-perfect ports of G-Darius and G-Darius Ver.2 and an HD version of each, along with the console port of G-Darius, coupled with an Steam-exclusive widescreen bonus mode!<br/><br/><strong>G-Darius/G-Darius HD</strong><br/><br/>The original arcade game, faithfully recreated with a host of extra features to enhance your enjoyment! <br/><ul><li>Use the Capture Ball!<br/>Capture most enemies and turn them against their allies.<br/></li><li>Fire the α Beam!<br/>Release captured enemies in an all-powerful burst of destructive energy.<br/></li><li>Boss Beam Battles!<br/>Counter a boss's β Beam with your own α Beam to unleash an even more deadly Counter Beam.<br/></li><li>Branching paths!<br/>Choose your route as Zones branch midway and after each boss.<br/></li><li>Capture Gallery!<br/>Check which enemies you still need to capture.<br/></li><li>Subwoofer compatible! (Steam only)<br/>Re-create the legendary in-seat speaker of the arcade cabinet.<br/></li><li>Gadgets galore!<br/>Dive deeper into the game with extra info to aid you in your battle.</li></ul><br/><strong>G-Darius Ver.2/G-Darius Ver.2 HD</strong><br/><br/>All the features of G-Darius and more, in this update to the original arcade game!<br/><ul><li>Beginner mode<br/></li><li>Rapid fire button added<br/></li><li>Game speed adjustments<br/></li><li>Enemy endurance adjustments<br/></li><li>Player shield capacity adjustments<br/></li><li>Mid-bosses added to some zones<br/></li><li>Boss timer &amp; timer bonus system<br/></li><li>New and adjusted boss attack patterns</li></ul><br/><strong>G-Darius CS</strong><br/><br/>A faithfully emulated console port with all the extra features which that release boasted! <br/><ul><li>Fight any or all of the 30 bosses in VS BOSS mode!<br/></li><li>Practice your skills using the beginner’s mode.<br/></li><li>View the opening and endings from the options menu.</li></ul>Note: this is the Japanese version of the game features no gadgets or enhancements from the other versions included here.<br/><br/><strong>Exhibition</strong><br/>Peek at what might have been if G-Darius was developed as a dual screen arcade cabinet! Battle a handful of selected bosses in wide-screen glory in this PC-exclusive bonus mode!", "metacritic": null, "released": "2022-03-30", "tba": false, "updated": "2023-11-06T20:03:15", "background_image": "https://media.rawg.io/media/screenshots/71e/71e6be862ff64e4b4cfd72fa0da2e2f4.jpg", "website": "https://darius.jp/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 1}, "playtime": 0, "achievements_count": 107, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Taito", "M2"], "genres": ["Action"], "publishers": ["Taito"], "esrb_rating": null}