{"id": 971685, "slug": "divine-pig", "name": "Divine Pig", "name_original": "Divine Pig", "description": "This is a 3D game full of magical set adventure, strategy, and combat.https://partner.steamgames.com/gfxproxy/gfx/apps/2620290/extras/datu4.png?t=1697757336<br/>\r\nThe game consists of multiple levels, each with different obstacles and enemies, and players need to complete the tasks of each level by obstacles and defeat enemies before moving on to the next level.<br/>\r\nPlayers will gain different character images and skills through levels, and will have different game styles and game experiences.<br/>\r\nPlayers complete mission challenges from the perspective of the first person, so they will see clearly. 3D game screen, rich real scene, bring more exciting operation methods, give us a better game experience.<br/>\r\nUse different techniques to find the ultimate true idea. As the levels change, the difficulty of the game increases.<br/>\r\nThe basic plot of the game: The player is an ordinary warrior who is turned into a pig in the battle with the water monster. In order to become a human again, players need to pass different levels<br/>\r\nStep by step, turn into human form and gain skills.<br/>\r\nPlayers who transform into human form must go to the land of demons (water dragon kings) to defeat the demons' men and improve their abilities.<br/>\r\nDefeat demons through the ultimate effort and become human.<br/>\r\nThis game will make players feel good and react quickly!", "metacritic": null, "released": "2023-11-06", "tba": false, "updated": "2023-11-07T05:35:51", "background_image": "https://media.rawg.io/media/screenshots/229/22925253b521320a866bdab98dde2e13.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 282, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["liugao"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Indie"], "publishers": ["liugao"], "esrb_rating": null}