{"id": 971699, "slug": "back-to-the-dawn", "name": "Back to the Dawn", "name_original": "Back to the Dawn", "description": "In Back to the Dawn, you play a reporter caught up in a dark conspiracy and who got thrown into a maximum-security prison for not playing ball. Gather your wits and learn how to survive in this hostile environment. Explore every inch of the prison and exploit any weakness you find. Make friends (or foes) with your fellow inmates and with their help, break out of prison. It's not just your life you are saving, but the entire city!<br/><br/><br/><br/>You play the role of a framed journalist trying to survive and escape prison. Working with your attorney friend on the outside, you must collect evidence to save yourself and the city from grave danger.<br/><br/><br/><br/><br/><br/><br/>It's an enormous prison with lots to do and many places to explore, but make sure you follow the rules, or at least try not to get caught! You’ll encounter all kinds of challenges as you explore your new environment. But will you be a model prisoner and just try to keep your head down, or will you leave a trail of chaos and destruction in your wake? It’s all up to you.<br/><br/><br/><br/><br/><br/><br/>There is a colorful cast of fellow inmates in your prison, each with an interesting story to tell. You can either make them your friends or fight, bully and rob them into submission. Decide too if you want to be part of a gang or a cunning lone wolf who maneuver your way around everybody. It's tough, but hey, you are in prison!<br/><br/><br/><br/><br/><br/><br/>Are you a tough guy who lets his fists do the talking, a thief who hides in the shadows, or perhaps a smooth talker with some nifty hacking skills? You can be whoever you want to be in this game. Learn all kinds of skills, craft tools of various trades and go from being 'new fish' to 'top dog'!<br/><br/><br/><br/><br/><br/><br/>From the laundry room to the infirmary, to the sewers and even the parking lot, every inch of the place is a piece in your intricate jailbreak puzzle. Discover the secrets of each location and use them to your advantage. In your bid for freedom, your imagination will be the most powerful weapon.<br/><br/>", "metacritic": null, "released": "2023-11-02", "tba": false, "updated": "2024-02-26T17:59:29", "background_image": "https://media.rawg.io/media/screenshots/68d/68d028bbc22e2bf12f3755c04ceacfe2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3, "toplay": 4, "dropped": 2, "playing": 1}, "playtime": 1, "achievements_count": 18, "ratings_count": 3, "suggestions_count": 352, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Metal Head Games"], "genres": ["Adventure", "RPG", "Strategy", "Simulation", "Indie"], "publishers": ["Spiral Up Games"], "esrb_rating": null}