{"id": 971622, "slug": "explosion-2", "name": "Explosion", "name_original": "Explosion", "description": "This game was made on Godot and funded on Catarse. Thank you guys!<br/>Explosion™ is an indie puzzle game where your objective is to turn sad little houses into beautiful holes of destruction :D . But it's not all work: while you blow things up in some creative ways, your supervisor/friend/maybe more than friend Amber uncovers the mysteries behind the Corporation, putting you on a variety of adventures together. Are you ready for this ~explosion~ of emotions?<br/><br/><br/>The Explosion™ game is special as it excels in two distinct gameplay areas: Puzzles and Dialogues. In the puzzles, the satisfying animations, the creative and fun levels, the carefully thought out mental challenges and the cartoon aesthetic make the experience of destroying the little houses something relaxing and satisfying. In the dialogues, the light and humorous tone, the comfortable intimacy of the conversations and the deep and surprising story hold the player's attention and provide remarkable and intense emotions. More on these below.<h3>Puzzles</h3><br/>In Explosion™, your objective is simple: to destroy all the houses on the map. To complete your mission - and make it more exciting, you will receive very creative combinations of explosives, different and unexpected mockups (levels), and beautiful and well thought out puzzles. Every 12 levels, you are introduced to a different mechanic, where the game gradually familiarizes you with it and prepares you for more challenging scenarios at the end. As you advance through the 44 levels in total, you will come across other sub-mechanics, which alter or subvert the rules of the game, adding even more complexity and reasoning to the proposed challenges.<h3>Dialogues</h3><br/>In addition to the puzzles, another crucial element of Explosion™ is the story - which is told through dialogue, like a visual novel. Amber, your head supervisor (and maybe a little more than that) is the one who welcomes you at the company and introduces you to your work. However, as time passes and you become more intimate, the work in the Corporation™ only gets more mysterious. Why are these houses being destroyed? Who is behind all these demolition orders? These are questions you and Amber intend to answer when you board on this great adventure. Conversations are well distributed throughout the beginning of the game's levels, and at each level #12 there is a unique mockup for important milestones and advancements in the story (with cute and stylized art too :3).<br/><br/>Want to know even more? (Or just chat as well) :D<br/>Please get into our Discord Server - the button below the Parental Rating.", "metacritic": null, "released": "2022-06-30", "tba": false, "updated": "2023-11-06T21:25:34", "background_image": "https://media.rawg.io/media/screenshots/ceb/ceb2449bdeeb40e40c4e48eab0c3c2c9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Lfzinho"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Lfzinho"], "esrb_rating": null}