{"id": 971653, "slug": "blade-crusade", "name": "Blade Crusade", "name_original": "Blade Crusade", "description": "<strong>Blade Crusade</strong>, the mysterious game originally found on Osama Bin Laden's hard drive, is now available in the west for the first time!<br/><br/>It is the year of our Lord XX06. Legions of skeletal warriors have risen at the behest of an unlicensed wizard in the Mirabi desert, threatening the civilized world once again. Infiltrate and ascend the wizard's mountain fortress level by level, slay his vile menagerie of minions, and put an end to the dance macabre once and for all!<h3>OCCUPATIONAL HAZARDS</h3><br/>Spikes, saws, lava, automatic crossbows and all sorts of OSHA violations await you, but fear not! Weighty physics, tight controls and time manipulation let you jump, bounce and glide past obstacles with deft precision.<h3>HISTORY IS WRITTEN BY THE VICTORS</h3><br/>Fight your way through waves of enemies and unique bosses! Use your movement skills to your advantage as you outmaneuver and juggle your foes. Slide, slash, dash and parry your way to victory!<h3>ONE DEATH IS A TRAGEDY. A MILLION DEATHS ARE A STATISTIC.</h3><br/>A single missed step, mistimed jump or slow reaction can mean the difference between life and death. And rest assured, there will be plenty of death! Death markers will show you where other players have perished; learn from their mistakes, or be doomed to repeat them!<h3>TIME IS MONEY</h3><br/>Find and perfect the fastest route through each level, making sure to gather every collectible. Race against other players and work your way up the leaderboards!", "metacritic": null, "released": "2022-09-30", "tba": false, "updated": "2023-11-06T22:11:58", "background_image": "https://media.rawg.io/media/screenshots/d5f/d5fd9130610aec4a3016bb409aa85ba3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Crab Bucket Software"], "genres": ["Action", "Indie"], "publishers": ["Crab Bucket Software"], "esrb_rating": null}