{"id": 971656, "slug": "lethal-honor-order-of-the-apocalypse", "name": "Lethal Honor - Order of the Apocalypse", "name_original": "Lethal Honor - Order of the Apocalypse", "description": "Lethal Honor - Order of the Apocalypse is a challenging action-adventure roguelite, featuring precise and strategical combat against eldritch creatures, using melee combat and tons of different abilities in many different locations. Be part of a secret organization that operates within the realm of impossibilities an investigates - but most importantly - destroys paranormal events and interdimensional inconveniences.\n<br/>\n<br/>\nPrepare to discover the truth!\n<br/>\n<br/>\n<br/>\n<br/>\nLethal Honor's progression model is a new take on roguelites. Hand-drawn comic panels are seamlessly integrated into the gameplay to structure your routes passing procedural runs. With every run and every death, you come closer to waking one of the main characters each with their own story to play. Intense and brutal but rewarding close quarter melee combats will test your skills.  Attacking relentlessly will only lead to your early demise. Kill or be killed, run or be run over, give in return but never give up!\n<br/>\n<br/>\nTravel through different zones with an original progression system, that will encourage you to revisit scenarios and grant you access to content that was previously hidden. Mixed with hundreds of items, relics, and artifacts that will force you to adapt your combat style to maximize their benefits. \n<br/>\nExplore and unravel a mature and dark story full of secrets. Each main protagonist will move the events forward with a complex story told through comics and events with a strong and deep emotional burden.\n<br/>\n<br/>\n<br/>\n<br/>\nThey don’t have to fight for themselves though as they will be assisted by several allies, non-playable characters the protagonists will rescue. In return, they will help them from the Awakening Room, the game's main hub before each run. Allies will send your avatar on new missions, requests, and story events. Don’t take the Awakening Room lightly or you miss out on some crucial details. \n<br/>\n<br/>\nLethal Honor features a dozen different scenarios, each completely different from the others, with their unique enemies, events, traps, and items. Scavenge through futuristic laboratories, slice your way through forests swarming with insect-type demons, flooded caves, abandoned mines, razed cities…\n<br/>\nAll and everyone will hint a story that will help you understand this grim world, linked together in a storyline that spans for more than a thousand years.  \n<br/>\n<br/>\n<br/>\n<br/>\nWelcome to Lethal Honor – Order of the Apocalypse!\n<br/>\n<br/>\n<ul><li>\t    Brutal isometric Hack and Slay rogue-lite gameplay\n<br/>\n</li><li>        Gritty hand-drawn dark age graphic novel art style combined with 3D scenarios: CONFRONT THE COMIC!\n<br/>\n</li><li>        Several different biomes and main characters with their own storyline, abilities, and playstyles\n<br/>\n</li><li>        A mature, dark, and complex story\n<br/>\n</li><li>        Procedural Content</li></ul>\n<br/>", "metacritic": null, "released": null, "tba": false, "updated": "2023-11-06T22:16:20", "background_image": "https://media.rawg.io/media/screenshots/dbf/dbffb5842617d64e70fe5b4c63f39c26.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 538, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Viral Studios"], "genres": [], "publishers": ["HandyGames"], "esrb_rating": null}