{"id": 971657, "slug": "bzzzt", "name": "Bzzzt", "name_original": "Bzzzt", "description": "Bzzzt is a fast-paced \"jump-dash-run\" retro game with a fresh and modern design made almost single-handedly by one solo developer, Karel Matejka, known as Ko.dll.<br/><br/>Inspired by the 80's tech revolution, this beautiful pixel-art precision platformer transports you back in time with a brand new adventure, paying homage to the popular and much loved gaming designs of the past.<h3>And what can you expect more?</h3><br/><ul><li>Pick a difficulty from casual to hardcore and choose a gameplay style that suits you the best.<br/></li><li>Enjoy extremely precise and intuitive controls.<br/></li><li>Push your limits in time challenges.<br/></li><li>Compete with others in global and friends leaderboards.<br/></li><li>Experience rich environments with ever-changing game mechanics.<br/></li><li>Survive and adapt your style for intense boss fights.<br/></li><li>Optional permadeath mode.<br/></li><li>Immerse yourself in the beautiful retro soundtrack made by Martin Linda, the creator of Rytmik Ultimate/Studio.</li></ul><br/><h3>The year is 4096.</h3>In a top-secret laboratory, inventive Doctor Emily and world-renowned Professor Norbert are working on a highly classified project. Through their joint research and intellect, they finally created a tiny robot with a big AI personality! No larger than a regular household toaster, but with some extraordinary skills, ZX8000 is ready to save the world, one platform challenge at a time!<br/><br/><br/><br/><br/>Meanwhile, other dark influences are at play in the world of Bzzzt. The evil mad scientist, Badbert, prepares to unleash his nefarious plans upon an unsuspecting world as soon as he finds the perfect equilibrium of darkness, malice and madness. Bwahahaha.<br/><br/>Grab your controller or keyboard and navigate ZX8000 to complete his missions and thwart Badbert's evil plans!<br/><br/><h3>Be the robot that rescues the world!</h3><br/>", "metacritic": null, "released": "2023-11-13", "tba": false, "updated": "2024-03-15T09:12:07", "background_image": "https://media.rawg.io/media/screenshots/bbd/bbd0c68bc8169f0bb9134cc0e01539c2.jpg", "website": "http://cinemax.cz/bzzzt-steam", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 5, "toplay": 2, "dropped": 1, "playing": 1}, "playtime": 3, "achievements_count": 22, "ratings_count": 3, "suggestions_count": 385, "game_series_count": 0, "reviews_count": 3, "platforms": ["Linux", "macOS", "PC"], "developers": ["KO.DLL"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Cinemax"], "esrb_rating": null}