{"id": 971650, "slug": "brightseeker", "name": "BrightSeeker", "name_original": "BrightSeeker", "description": "BrightSeeker is an action RPG set in a futuristic fantasy world where people and their mechanical constructs rose up against their gods. Fight your way through hordes of deadly mechanical soldiers as the Seeker — the last descendant of the ancient gods — who lost their only companion to these machines. Take your revenge and find a way to bring your loved one back to life...<br/><br/><br/><strong>Shoot, slash and dash to defeat numerous enemies.</strong><br/><br/><strong>Block projectiles with your shield. Time your blocks well and deflect the projectiles back at your enemies.</strong><br/><br/><br/><br/><br/><strong>Upgrade and modify your abilities to suit your own play-style and make them even more powerful.</strong><br/><br/><br/><br/><br/><br/><strong>Journey through the futuristic neon-drenched world, explore different locations, meet new characters and uncover hidden secrets.</strong><br/><br/><br/><br/><br/><strong>In BrightSeeker, harder difficulty doesn't mean enemies will have unfair advantages or become bullet sponges. Instead, you can adjust the difficulty to suit your own play-style and decide what benefits you or your enemies will get. </strong><br/><br/><strong>Unlock new abilities for enemies to make them more challenging to defeat or give yourself boosts to make the game easier. The game will be only as difficult/easy as you make it.</strong><br/><br/><h3>KEY FEATURES</h3><ul><li>Shoot, slash and dash to defeat deadly enemies.<br/></li><li>Block and deflect projectiles with a shield.<br/></li><li>Unlock powerful special abilities.<br/></li><li>Customize your weapons in The Ability Forge.<br/></li><li>Vanquish challenging bosses.<br/></li><li>Play at your own difficulty level.<br/></li><li>Explore the futuristic world.</li></ul>", "metacritic": null, "released": "2022-09-30", "tba": false, "updated": "2023-11-06T22:07:45", "background_image": "https://media.rawg.io/media/screenshots/879/87972bcee0000046deea58066e859aae.jpg", "website": "http://www.zakroutil.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 377, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Miroslav Prokop"], "genres": ["Action", "RPG"], "publishers": ["Miroslav Prokop"], "esrb_rating": null}