{"id": 97172, "slug": "pixel-vision-8-jump-n-shoot-man-ludum-dare-41", "name": "Pixel Vision 8: Jump N' Shoot Man Ludum Dare 41", "name_original": "Pixel Vision 8: Jump N' Shoot Man Ludum Dare 41", "description": "Pixel Vision 8: Jump N' Shoot Man LD 41 Edition\r\n<p>What happens when you take one of the best platformers ever created and strip away the ability to move or stop? You get Jump N' Shoot Man!  He has two abilities, jump (X key) and shoot (C key). Make your way through endless waves of randomly generated levels to see if you can get the best high score. Watch out for 3 different enemies, exploding spike balls and bottomless pits. You will have to manage your health and energy meters wisely and keep on the lookout for refueling pods dropped by defeated enemies. The fun never ends... literally, the game will keep generating new levels as long as you are willing to play!</p>\n<p>Jump N' Shoot Man is a classic platformer build for the Pixel Vision 8 Fantasy Console in 72 hours during Ludum Dare 41. <strong>The Game Creator</strong> is a full development environment for authoring 8-bit games and is built on top of the open source Pixel Vision SDK framework. It contains project management, asset creation, and coding/debugging tools. This all in one solution enables complete end to end development allowing anyone to create desktop games, share them and even build custom tools.</p>\r\nPlease note, the HTML5 version is there for people that don’t want to run the game locally on their computer. There are some known issues with sound and performance depending on the browser. For the full experience, please download one of the desktop builds.\r\n<p>Created by @jessefreeman, art by @2dheroes and built with @pixelvision8</p>", "metacritic": null, "released": "2018-04-23", "tba": false, "updated": "2019-08-28T23:25:31", "background_image": "https://media.rawg.io/media/screenshots/110/110dc06279adb311c9ab0475a1b9b515.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Pixel Vision 8"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}