{"id": 971750, "slug": "witchcraft-survivors", "name": "Witchcraft Survivors", "name_original": "Witchcraft Survivors", "description": "<strong>Witchcraft Survivors</strong> is an action roguelite rpg where you slay hordes of monsters while enhancing your characters with more and better spells and upgrades to kill even more foes! Instead of dodging bullets of your enemies, you play as the powerful bullet hell that fills the screen with your spectacular witchcraft!<br/><br/><br/><br/><ul><li><strong>Unique Heroes</strong> - Play different heroes, each with their own spells, builds, upgrade paths, strengths and weaknesses. You are rewarded for playing all of them individually and no hero plays like the other!<br/></li><li><strong>Three different meta progression systems</strong> - After each run, become stronger permanently in three different ways. Get powerful rewards by unlocking achievements, spend character xp on character specific progression paths and use gold to buy general upgrades in the shop.<br/></li><li><strong>Casual Playtime</strong> - Runs take usually only between 10 - 25 min, during which your heroes get from weak to godlike in no time!<br/></li><li><strong>Different Stages</strong> - Each Stage has their own Monsters and Bosses with their own behaviour.</li></ul><ul><li><strong>Difficulty Settings</strong> - Adjust the difficulty to make each stage easier or harder. The harder the difficulty, the greater the rewards!</li></ul><ul><li><strong>Different Game Modes</strong>  - You can play different Modes in each Stage, resulting in a different playstyle.<br/></li><li><strong>Endless Onslaught</strong>  - The Desert Stage never ends, how long can you survive with ever stronger waves of enemies?<br/></li><li><strong>Endless Progression</strong> - Upgrade your characters without limit.<br/></li><li><strong>And More</strong>  - Hunt treasure rats for their loot, get cursed relics at the blood altar and buy up to 6 different cats!<br/><br/> </li></ul>", "metacritic": null, "released": "2023-11-06", "tba": false, "updated": "2023-11-07T07:32:18", "background_image": "https://media.rawg.io/media/screenshots/939/9394ad355a651e07b44ab6539518a99b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Catpix Studios"], "genres": ["Action", "Indie"], "publishers": ["Catpix Studios"], "esrb_rating": null}