{"id": 971788, "slug": "gutasaga", "name": "Gutasaga", "name_original": "Gutasaga", "description": "<strong>Gutasaga </strong>- 2D Strategy RPG pre-viking era game<br/><br/><strong>HISTORICAL WORLD</strong><br/>The game is set in the 6th century AD. The map is based on historical prototypes of that time, and all locations, buildings, ships, and items are inspired by historical findings. If you are interested in the historical background of anything in the game, it is ready to provide you with answers.<br/><br/><strong>FIRST-PERSON NARRATIVE</strong><br/>Immerse yourself fully in the game. Everything that happens in the game is described from the perspective of the main character of that time. Paganism, which would later be replaced by other religions, was the dominant belief at that time, and the game allows you to see the world and historical events from a different angle.<br/><br/><strong>EXPLORATION</strong><br/>A vast territory is open for exploration from the very beginning, without limiting your actions. The world is filled with historically unique locations, goods, and factions. Explore the world and discover rare artifacts that will aid you in the game.<br/><br/><strong>TRADE SYSTEM</strong><br/>Trade with various factions throughout the map for profit or the development of your settlement. Find unique goods that are not available in other settlements or even discover items for which others are willing to pay five times the price.<br/><br/><strong>RAIDS AND PIRACY</strong><br/>If you need to quickly acquire different resources, goods, coins, or artifacts, remember the path of force. Gather a crew and raid other settlements along the coast or along rivers. Study the routes of trading vessels to launch surprise attacks and seize ships.<br/><br/><strong>REAL-TIME COMBAT SYSTEM</strong><br/>Engage in battles with your assembled team against enemies from different factions. Use various artifacts and items in combat to achieve success. If a challenging battle takes place on the water, knowledge of your own and the enemy's ship will play a decisive role.<br/><br/><strong>SANDBOX</strong><br/>Buildings in settlements will be randomly generated at the start of the game. This means that each new game will be unique, providing a fresh gameplay experience. You will have to make decisions regarding the placement of your buildings, considering the availability and demand for goods in other settlements.<br/><br/><strong>LIVING WORLD</strong><br/>Both you and NPCs will influence the development of all settlements. The more you trade and satisfy the needs of a specific tribe, the faster it will progress. Resources obtained by NPCs do not disappear from the game but remain with them and can be used for the development of their own settlements. Each settlement has a level that determines the amount of available land for buildings, and each building has its own level, which improves its functions with development.<br/><br/><strong>SHIP MANAGEMENT</strong><br/>Journeys need to be well-planned and prepared; otherwise, they can end in disaster. Consider the carrying capacity of your ship, efficiently manage your supplies, allocate funds for the maintenance of the crew, and monitor their health.<br/><br/><strong>UPGRADING YOUR SETTLEMENT</strong><br/>You will have the opportunity to build your own settlement, but remember that its territory is limited, and you cannot have all the buildings at once. Prioritize wisely and develop your settlement to increase the construction area and gain access to unique goods and artifacts.<br/><br/><strong>CRAFTING</strong><br/>If you have a desire to create something with your own hands, you can do so in one of the dedicated crafting buildings, such as a forge, weaving workshop, shipyard, carpentry workshop, or tannery. You will need to find all the necessary components for crafting, which won't be easy, but the resulting items will have better stats.<br/><br/><strong>COMPANIONS</strong><br/>A unique companion - slave, wife, or other character- will assist you in everyday tasks to make your gameplay easier. You can assign this unit to a building to improve its stats. Additionally, companions will help you with weekly tasks that appear in the settlement.", "metacritic": null, "released": "2023-11-06", "tba": false, "updated": "2023-11-07T08:49:31", "background_image": "https://media.rawg.io/media/screenshots/dcf/dcf400430e7a019147312d88d8db8fc8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 324, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Veles"], "genres": ["RPG", "Strategy"], "publishers": ["Veles"], "esrb_rating": null}