{"id": 971745, "slug": "dreamworks-all-star-kart-racing", "name": "DreamWorks All-Star Kart Racing", "name_original": "DreamWorks All-Star Kart Racing", "description": "All-Star Cast, All-Star Fun!<br/>\n<br/>\r\nAn all-star cast of some of your favorite DreamWorks characters brings the fun and hilarity to high-speed kart racing action like never before! Race on 20 different DreamWorks-themed tracks, including Shrek’s Swamp, New York City Zoo from Madagascar, Isle of Berk, and more! 20 of the most iconic DreamWorks characters: Shrek, Po, Tigress, Puss in Boots, Hiccup, Astrid, Boss Baby, and other top favorites all come together in a kart racing experience like no other.<br/>\n<br/>\r\nKey Game Features:<br/>\r\n- ALL-STAR CAST OF DREAMWORKS CHARACTERS: Who will you choose? With favorites such as Shrek, Po, Tigress, Boss Baby, Puss in Boots, Hiccup, and Astrid, it’ll be hard to choose just one.<br/>\n<br/>\r\n- 20 AWESOME KARTS: Each kart draws its distinct design from the unique personality of its DreamWorks character-driver! Put your very own twist on the kart with hundreds of parts and accessory combinations to level up! <br/>\n<br/>\r\n- RACE THROUGH ICONIC LOCATIONS: Be transported into fantastical worlds as you speed, shift, jump and drift through tracks inspired by your favorite DreamWorks movies: The Kingdom of Far Far Away from Shrek, Bergen Town from Trolls, Baby Corp from The Boss Baby, New York City Zoo from Madagascar, and many more!<br/>\n<br/>\r\n- TROLLS AS RACE HOSTS &amp; POWER-UPS: Poppy, Branch, Barb, Cooper and others from the colorful world of the DreamWorks Trolls are not only rockin’ it as your hosts for each race, but also help you hit the right notes for your racetrack success with their power-up potential. Collect them to ride along with you throughout each race for special surprises! <br/>\n<br/>\r\n- HARNESS THE POWER MAGIC PATHS: Hit magical switches on the track to uncover hidden shortcuts. Extend these magical paths by hitting more switches in series!<br/>\n<br/>\r\n- MULTIPLE RACING MODES: Awesome online and split-screen local multi-player for non-stop action the entire family will love.", "metacritic": null, "released": "2023-11-03", "tba": false, "updated": "2023-11-07T07:24:01", "background_image": "https://media.rawg.io/media/screenshots/29d/29d17a81c1dd44c0ec27024da78a91ea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 348, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bamtang Games"], "genres": ["Racing"], "publishers": ["GameMill Entertainment"], "esrb_rating": null}