{"id": 971760, "slug": "chimeras-price-of-greed-collectors-edition", "name": "Chimeras: Price of Greed Collector's Edition", "name_original": "Chimeras: Price of Greed Collector's Edition", "description": "Elephant Games proudly presents Chimeras: The Price of Greed – the next mystifying chapter in the popular Chimeras series!<br/>\n<br/>\r\nPeople are disappearing left and right amidst otherworldly incidents in the Carrington Mansion. First the butler, then the head of the family himself, Edgar Carrington. The police are baffled, so Gordon, the heir to the Carrington fortune, calls in an expert investigator – YOU! Sort through the secrets and lies to uncover the truth about the disappearances and the remarkable discovery that set this diabolical plot in motion. But hurry, before you’re the only one left!<br/>\n<br/>\r\nThis is a Hidden Object Puzzle Adventure game, meaning a specific genre of story-driven, point &amp; click adventures. Throughout the game, players are tasked to find a list of objects hidden within a particular scene, and to occasionally complete various mini-games/puzzles.<br/>\n<br/>\r\n•\tInvestigate mysterious disturbances and find out what lurks beneath Carrington Mansion in the bonus game!<br/>\r\n•\tEarn a variety of unique achievements! <br/>\r\n•\tTons of morphing objects, collectible cards, and puzzle pieces to find! <br/>\r\n•\tEnjoy replayable HOPs and mini-games, exclusive wallpapers, soundtrack, concept art, and more! <br/>\r\n•\tNever get lost with the strategy guide!", "metacritic": null, "released": "2023-11-03", "tba": false, "updated": "2023-11-07T07:49:42", "background_image": "https://media.rawg.io/media/screenshots/634/634f2084ed62c71a6bd51bb5230cb39b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 517, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Elephant Games"], "genres": ["Adventure", "Casual"], "publishers": ["Big Fish Games"], "esrb_rating": null}