{"id": 971878, "slug": "spirit-city-lofi-sessions", "name": "Spirit City: Lofi Sessions", "name_original": "Spirit City: Lofi Sessions", "description": "<p>Spirit City: Lofi Sessions invites you to start your productivity journey, or simply relax in the cozy world of Spirit City. In this idle game, you start by setting the perfect vibe for your day with calming lofi beats, mixing in your favorite background sounds to create a soothing soundscape, and customizing your character and your spirit companion.</p>\n<p>As time goes on, cute spirits will start showing up if you have the right combination of settings to lure them! They&#39;re then added to your growing collection of spirit discoveries and you can use them as your companion for your next sessions to learn and unlock more about them.</p>\n<p>Key Features:</p>\n<pre><code>Calming lofi beats: Sit back and relax as you listen to a carefully curated catalog of lofi tracks and themed playlists for every mood and occasion. Feel the stress melt away and sharpen your focus with this popular music genre.\n\nAmbient soundscapes: Transport yourself to a different world as you further tailor your experience with immersive soundscape options. Dynamically adjust your audio settings and watch as they change the visuals to suit your desired mood, from the pitter-patter of rain on a window to the crackling of a toasty fireplace.\n\nAvatar and spirit companion customization: Create and personalize your own avatar, expressing your unique style and vibe. Choose from a variety of hairstyles, outfits, custom colors, and more to bring to life your own unique Spirit City persona. You can also choose from the Spirits you unlock and assign it as your work companion.\n\nPersonalize your Space: Customize your room with a large variety of lighting, floor, wall and furniture options! Make your space reflect your mood and create your perfect cozy environment.\n\nAdorable hidden spirits: Decipher in-game hints to find the right combination of soundscapes and activities to lure cute spirits out into the open, unlocking them as your companions. Push your research further on a specific spirit by equipping it to unlock more information or customization options.\n\nProductivity tools: Use the built in to-do list and pomodoro timer functions to keep yourself on schedule and to remind yourself to take regular breaks while providing positive energy for your work sessions.\n\nEarn Rewards: Earn XP while spending time in game, increasing your Spiritographer level. With each level comes exciting unlocks in the form of customization options and bits of lore about Spirit City.\n\nDistraction free space: Spirit City: Lofi sessions is designed to let you focus for as long as you want, and will never throw in distracting bits or notifications. Time to settle in for some productive work sessions, without any distractions, and get work done.\n</code></pre>", "metacritic": null, "released": null, "tba": true, "updated": "2024-04-16T07:26:00", "background_image": "https://media.rawg.io/media/games/0f4/0f400efba9803aa39f9b94b838b1b04e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 10, "ratings_count": 2, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Mooncube Games"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Mooncube Games"], "esrb_rating": null}