{"id": 97181, "slug": "forever-loot", "name": "Forever Loot", "name_original": "Forever Loot", "description": "<p>\r\n\tForever Loot is a twin-stick-shooter with Diablo-style RPG elements. Shoot your way through the hordes of evil in your quest for increasingly better loot. And you save the world along the way too. Still in development.\r\n</p>\n\n<p>\r\n\tThe game is in pre-alpha phase and gameplay features are constantly being added and updated. The default mode runs through three normal levels of the same environment followed by that environment boss level. After defeating the three normal bosses, you will face three normal levels of the desert environment (which can spawn any normal enemy), followed by the final boss level to finish the game. With endless mode you can go forever, cycling through bosses and levels at random. \r\n\t<br/>\n</p>\n\n<ul>\n<li>Customizable difficulty: full control of the increase of power of items and enemies.</li>\n<li>15 different standard enemies, 4 bosses plus some hidden enemies.</li>\n<li>Both loot and enemies can be of magic, rare or epic quality, each step adding more stats.</li>\n<li>13 legendary items with unique properties (more on the way).</li>\n<li>13 different skills to use (more on the way).</li>\n<li>Randomly generated levels, chests, traps and loot.</li>\n<li>Gamepad support and rebindable keyboard and mouse controls (mouse and keyboard are recommended).</li>\n</ul>\n\n<p>\r\n\tKeyboard and mouse (rebindable):\r\n</p>\n<ul>\n<li>WASD: move around.</li>\n<li>Left mouse: shoot.</li>\n<li>Right mouse: skill 1.</li>\n<li>1-4: skill 2-5.</li>\n<li>E: pick up loot and open chests.</li>\n<li>Q: exit level when near an exit.</li>\n<li>Escape: pause menu.</li>\n</ul>\n<p>\r\n\tGamepad (X360 controller):\r\n</p>\n\n\n<ul>\n<li>Pathfinding and collision detection aren't final and can currently cause problems like the player or the enemies getting stuck in walls.</li>\n<li>Minor framerate drops can be expected. The game needs more optimization. Modern game systems should reach a framerate of 60 most of the time.</li>\n<li>Some crashes and smaller bugs can be expected.</li>\n<li>Game balance is not final.</li>\n<li>Save games made on older versions might be corrupted on newer versions.</li>\n</ul>\n\n<p>\r\n\t0.0.5.5 (January 18th 2018):</p>\n<ul><li>Added a new legendary item.\r\n  </li><li>Added a new passive skill: Gamble.\r\n  </li><li>Changed the way incoming damage is calculated. This should make armor more important.\r\n  </li><li>Some bugfixes regarding incoming damage.\r\n  </li><li>Fixed a bug with life regeneration not working properly.\r\n  </li><li>Fixed some crashing with saving and loading a game.</li></ul>\n<p>\r\n\tFull changelog: \r\n\thttp://pastebin.com/ziR5g3x4\r\n</p>", "metacritic": null, "released": "2015-12-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d6a/d6a33b58b066308dd702321c4c501f8b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gundogan"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}