{"id": 971832, "slug": "bullet-town", "name": "Bullet Town", "name_original": "Bullet Town", "description": "In the distant days of the Wild West, cow-boys were quick to jump the gun. Yet those who survived were not the fastest ones, but the ones who took the time to aim carefully. Will you manage to keep your cool and shoot your way to the final boss through wave after wave of bandits?<br/>Get stronger and stronger as your enemies get bigger, badder and funnier in this roguelike with a generous amount of powerups.<h3>Dynamic, accessible game</h3><br/><ul><li><strong>Minimalistic and unique gameplay</strong>: Experience shooting at its purest : the feeling of squeezing the trigger at the right time and the satisfaction of reaching your target.</li><li><strong>No need to aim</strong>: A self-moving crosshair makes the controls very simple and intuitive. Let your instinct guide you.</li><li><strong>Every fight is different</strong>: Dynamic gameplay forcing you to adapt to the crosshair’s movements and teaching you to take advantage of every opportunity.</li></ul><h3>Unbridled roguelike</h3><br/><ul><li><strong>Upgrades-rich game</strong>: Acquire new powers frequently and refine your playstyle to tailor your character to your liking.</li><li><strong>Many different powers</strong>: Collect more than fifty different abilities to improve your aim, your damage, your defense etc.</li><li><strong>Eccentric special bullets</strong>: Load special bullets in your six-shooter, such as the one-shot-kill golden bullet, the gigantic mammoth bullet or the burst-fire machine gun bullet.</li></ul><h3>Good guys, bad guys, and ugly guys</h3><br/><ul><li><strong>Flamboyant characters</strong>: Fight and impersonate a whole clique of cow-boys, bandits and the like straight from the greatest spaghetti westerns.</li><li><strong>Win new heroes to your cause</strong>: Complete achievements to unlock new, more powerful characters.</li><li><strong>Dreadful bosses</strong>: Reach the end of the level alive to enter the saloon and face bosses using sneaky and surprising tactics, but be mindful of the henchmen protecting them!</li></ul><h3>Rich and diverse playthroughs</h3><br/><ul><li><strong>Ever-changing tactics</strong>: Choose your targets wisely and set your priorities right. Should you take care first of the gunslinger threatening you with two guns, or pick up this tantalizing bag of dollars?</li><li><strong>Lots of interactive items</strong>: Take advantage of opportunities offered by background objects (gong that stuns your foes, horseshoe making the bullets ricochet around…).</li><li><strong>Procedural environment</strong>: Learn to adapt to a procedurally generated architecture. Watch out for foes taking cover behind a window, or aiming at you from a balcony!</li></ul><h3>Shoot, laugh, and be open to surprises</h3><ul><li><strong>Pervading humour</strong>: Be ready to laugh out loud when you see hats taking flight or cow-boys dancing to a piano tune!</li><li><strong>Crazy cartoonish world</strong>: Come and discover the many surprises that the Wild West of Bullet Town has in store for you!</li></ul>", "metacritic": null, "released": "2023-11-06", "tba": false, "updated": "2023-11-07T09:46:30", "background_image": "https://media.rawg.io/media/screenshots/23a/23a9da78d2b3f92a3f34ac1e2b3b9f0a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["François Provansal"], "genres": ["Action", "Indie"], "publishers": ["Lotus Game"], "esrb_rating": null}