{"id": 971889, "slug": "spells-secrets", "name": "Spells & Secrets", "name_original": "Spells & Secrets", "description": "Use the numerous spells in creative ways to fight off magical creatures or to solve puzzles.<br />\nIf you&#39;re tired of venturing alone, ask a friend to join you and discover the world of &quot;Spells &amp; Secrets&quot; in local co-op or online via Steam-Remote!<br />\n⚠️For co-op, two controllers are required.  ⚠️<br />\nDive deep into character customization and unlock more possibilities with a variety of options:<br />\nSelect a unique body type that represents you best.<br />\nDress in your preferred clothes, offering freedom beyond gender boundaries.<br />\nCraft your face from a vast selection: pick your eye color, shape of eyebrows and more, all designed to be gender-neutral.<br />\nYour nose and eye shapes adapt based on your facial selections.<br />\nPlay with hair colors: mix and match up to two shades for a distinctive look.<br />\nFind the perfect skin tone from our diverse range.<br />\nAccessorize with an array of items to enhance your style.<br />\nAdjust height to suit your vision of the character.<br />\nApply makeup that complements your chosen features.<br />\nUse your spells creatively against magical creatures or to solve puzzles.<br />\nCreate your character from extensive options and unlock more possibilities.<br />\nSave and help your classmates.<br />\nExplore the ever-changing school castle Greifenstein.<br />\nFind many clues about the world &amp; its inhabitants.<br />\nImprove your character permanently.<br />\nFind powerful artifacts and use useful potions.<br />\nPlay in 2-player local co-op mode or online via Steam Remote Play.<br />\nExperience optimized controller and mouse &amp; keyboard controls.<br />\nIn “Spells &amp; Secrets”, you are a first-year student of the magic arts, arriving at the Academy of Greifenstein. Set in a world and time like ours, you are excited to live and learn together with your fellow students and professors at the impressive magical castle.<br />\nA strange incident on your first day throws the school into turmoil. It’s up to you to save the ever-changing castle and rescue your lost schoolmates. Use your spells creatively to fight off magical creatures, explore the school grounds and uncover the castle’s secrets to reveal the mystery surrounding it.</p>", "metacritic": null, "released": "2023-11-09", "tba": false, "updated": "2024-01-21T08:50:28", "background_image": "https://media.rawg.io/media/screenshots/b71/b717a6ebd811a790f4478be84087f7d2.jpg", "website": "https://www.rokaplay.com/spells-secrets", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 421, "game_series_count": 0, "reviews_count": 0, "platforms": ["Xbox Series S/X", "Nintendo Switch", "PC"], "developers": ["rokaplay", "Alchemist Interactive"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Sports", "Casual", "Indie"], "publishers": ["rokaplay"], "esrb_rating": null}