{"id": 971847, "slug": "come-on-be-with-you", "name": "Come on-be with you", "name_original": "Come on-be with you", "description": "Suddenly, we were caught in the crisis of virus transmission. People's hearts were tense. Although we could not fight with front-line workers, our hearts were always with them. I believe we will defeat the virus. Please do n’t go to crowded places during the epidemic period. Protect yourself and others. This is a game that simulates the elimination of viruses. We play a therapeutic drug, enter the lungs, come into contact with viruses, and destroy them. Of course, we must be careful of the body ’s autoimmunity. Cells can use immune cell tracking to indirectly help eliminate the virus. There is a little knowledge of epidemic prevention in the game, and a letter from wild animals to human beings, we will definitely get through it! !! !!<br/>\r\nGame Features:<br/>\r\n0. Epidemic prevention knowledge and a letter from wild animals expressing their wishes.<br/>\r\n1.The game has 10 levels<br/>\r\n2.The virus growth rate is different in each round<br/>\r\n3.The attack power and health of each victory will increase.<br/>\r\n4.Each round will randomly generate a different amount of blood energy<br/>\r\n5.Each round will randomly generate a different number of autoimmune cells, but the immune cells only track the invaders who will move<br/>\r\n6, can use the tracking of immune cells to eliminate the huge virus that may be encountered<br/>\r\n7. Therapeutic drugs, viruses, and immune cells will harm each other, and the way of harm is that near a certain range will cause harm.<br/>\r\n8. Complete a level and unlock new levels<br/>\r\n9. The game fails when the health bar is 0.<br/>\r\n10. The number of viruses is greater than or equal to 50, and the game fails.<br/>\r\n11. When the number of viruses reaches zero, the game wins", "metacritic": null, "released": "2020-02-13", "tba": false, "updated": "2023-11-07T10:05:31", "background_image": "https://media.rawg.io/media/screenshots/f78/f78940e453dc52665c739529b6a128aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["yunizaiyiqi"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["yunizaiyiqi"], "esrb_rating": null}