{"id": 971915, "slug": "franchise-hockey-manager-10", "name": "Franchise Hockey Manager 10", "name_original": "Franchise Hockey Manager 10", "description": "Celebrating ten years with our fans, The <strong>Franchise Hockey Manager</strong> series returns for the 2023-24 season with plenty of new additions to the deepest, most authentic hockey strategy gaming experience you can find.<br/><br/>Choose one of dozens of leagues around the world and select a team to guide to glory, including a chance at the ultimate prize: FHM 10 is licensed by the NHL®, allowing you to take the reins of your favorite franchise to capture the Stanley Cup®.    Take control of a national team and try for international supremacy.  Choose a historical game, where you can begin in any year in  NHL® history, or play in a legendary international tournament.   Or if you'd like to create your own customized league, you can do that as well!  Or if you've been playing FHM9 and can't bear to part with your team, import the save into FHM10 and carry on with the addition of FHM10's new features.<br/><br/>However you choose to play, you have control of your team and can oversee finances, select strategies, hire your staff, make trades, sign free agents, and draft the newest generation of stars as you try to build a championship team - and then make it into a dynasty!  <br/><br/>All new for Franchise Hockey Manager 10:<br/><br/><ul><li>Big custom league changes: promotion/relegation systems can now be included in custom leagues, and we've added the ability to import leagues directly from our databases into a custom game, including many leagues that aren't normally playable.  Historical and single-team importing is included as well, so you can build a league from the greatest teams in history, or put together a modern superleague.<br/></li><li>Gain more control with our reworked trade system – you can now specify your team needs and search for players that fit them, and the player shopping system has been entirely reworked with a new interface and options.<br/></li><li>Media management has been added to the game - the local media will now cover your team, but won't shy away from criticism, and you may find yourself having to defend your players that find themselves in the spotlight.  But be careful what you say - if the media turns on you, your job security may be jeopardized!<br/></li><li>2D mode follows up last year's special teams improvements with refinements to breakout and neutral zone play.<br/></li><li>Historical mode now extends back to 1909 with the addition of the National Hockey Association!  Go back to the dawn of professional hockey and see the rise of legendary franchises, complete with six skaters on the ice with the addition of the rover position.<br/></li><li>Also in historical mode, you can now start a game as a historical expansion team with the real expansion draft in their first year - no need to go back and replay the previous season first, you can begin by choosing from the exact players that were available to the team in their debut season.<br/></li><li>Last year we introduced American college hockey to FHM, this year we've added the Canadian version!  35 Canadian universities are now playable, including the playoffs and national championship tournament.  And on the American side, teams now need to contend with the transfer portal - if you can't keep your players happy and supplied with enough icetime, they'll be able to move elsewhere!<br/></li><li>New scouting options include the ability to scout tournaments, which now include a large number of new youth tournaments.  Scout rising superstars through their early years before making your claim to them!<br/></li><li>Kick off the preseason with a Prospect Tournament to get to know your up-and-coming players and see how they perform against the best young players in the rest of your league!<br/></li><li>Interface improvements make it easier to access information about your players, including a new contract quality indicator and a quick option to review your team's stats.<br/></li><li>Awards have been revamped with a large number of new player award options, and historical mode now includes accurate date ranges for each award.<br/></li><li>Improvements in the player development routines now produce a more realistic pool of players as the years go by.<br/></li><li>Playoff scheduling has been improved with series alternating days so the playoff hockey never takes a break!<br/></li><li>As always, complete team and player updates for the new 2023-24 season.<br/></li><li>In addition to all of that, there are the usual large variety of smaller changes, tweaks, and other improvements!</li></ul>", "metacritic": null, "released": "2023-11-07", "tba": false, "updated": "2023-11-10T06:12:36", "background_image": "https://media.rawg.io/media/screenshots/843/843f18977e83ac3e05a655f71834be18.jpg", "website": "https://www.ootpdevelopments.com/franchise-hockey-manager-home/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Out of the Park Developments", "game54 Software"], "genres": ["Strategy", "Simulation", "Sports"], "publishers": ["Out of the Park Developments"], "esrb_rating": null}