{"id": 971957, "slug": "pretty-overseer-dating-sim", "name": "Pretty Overseer - Dating Sim", "name_original": "Pretty Overseer - Dating Sim", "description": "In Pretty Overseer, immerse yourself in a captivating world of magic, romance, and challenging choices. You are a young lieutenant tasked with overseeing the correction of magically talented individuals within the confines of an isolated complex at the military Academy.. Under the watchful eye of your mistress, Neoma, you must maintain order, train your recruits, and navigate a complex web of personal and professional relationships. Will you succumb to the witch's will, or will you find your own path, embracing romance and intimacy along the way?<br/><br/>Subordinate recruits to you have outstanding magical abilities that exceed your own potential, so you must be extremely careful with them - in moments of stress they completely lose control of their magic.<br/><br/><strong> Features: </strong><br/><ul> <li> Four Unique Romance Options: Form deep connections with four distinct girls, each with their own personalities, backgrounds, and enthralling storylines.<br/> </li><li> Full HD Animated Characters and Cut-scenes: Experience the game's narrative with stunning visuals and fully animated sequences.<br/> </li><li> Life Management: Balance your duties and personal life as you make crucial decisions that impact the story's outcome. <br/> </li><li> Immersive Atmosphere: Immerse yourself in the enchanting world of the game, complemented by a superb soundtrack and beautiful backgrounds.</li></ul><br/>“You must help them to control their talents at will, using different methods to pass the final test. Recruits who will not be able to suppress their talents at their will will be isolated from society as extremely dangerous individuals.<br/>Don't be afraid to be too harsh with them – they're not in any position to complain, we're already spending a huge amount of money on training battle mages. Any form of protest and resistance must be brutally suppressed, use your squad if necessary.<br/>For further briefing, lieutenant, I'm waiting for you in my office, Neoma.“<br/><br/>Be wary of the Witch Neoma, she is extremely authoritarian and slightly... insane.<br/>In general, you do not approve of her methods of leadership, but you do not always have the spirit to contradict her directly. She gets sadistic pleasure in punishing the guilty, and if you do not do your duties, her punishment awaits you.<br/>You feel sympathy for your recruits, but the only thing you can do is do your job well.<br/><br/>In your free time, you can try to have a romantic relationship with one of your peers, or if you are bold enough to take the risk maybe you can be lucky enough to invite your mistress on a date?", "metacritic": null, "released": "2023-11-08", "tba": false, "updated": "2023-11-10T07:07:04", "background_image": "https://media.rawg.io/media/screenshots/666/666f15852502f09741eab06db9fbb171.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 526, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Flaming Firefly"], "genres": ["RPG", "Simulation", "Indie"], "publishers": ["Flaming Firefly"], "esrb_rating": null}