{"id": 971920, "slug": "heyman-born-in-the-electric", "name": "HeyMan - born in the electric", "name_original": "HeyMan - born in the electric", "description": "\"Hey, Man! - Born in the Electric\" is a fun 2D platform puzzle game in which a main character born by electricity in a city ventures to find what he sees. The game will provide users with a new experience with interesting stories and unique gameplay.<br/>\n<br/>\r\n--<br/>\n<br/>\r\n1972 in a high street in New York,<br/>\n<br/>\r\nSteve, who collapsed in an unknown electric shock accident, soon came to his senses. Then, his body transformed into a glowing line and black.<br/>\n<br/>\r\nSurprised by the strange change, Steve cannot understand what happened. Like the main character in the movie...<br/>\n<br/>\r\nIn the meantime, New York was transformed into a dark city where electricity was cut off. People wander in panic, and all of a sudden, a company called \"Porco Electric\" starts supplying electricity extensively.<br/>\n<br/>\r\nThe company's founder, \"Rino Porco,\" was known for his insistence on his own style. Those suffering from the absence of electricity are becoming increasingly dependent on electricity from the 'Porco Electric'.<br/>\n<br/>\r\nAs Steve adapts to his new ability, he realizes that he can quickly pass wherever electricity flows.<br/>\n<br/>\r\nThen one day, Steve hears a rumor that Porco Electric could be behind all this chaos.<br/>\n<br/>\r\n\"I have to find my true self!\" Steve decides. And his adventure begins at the door of Porco Electric.<br/>\n<br/>\r\nNow, are you ready to join Steve on his journey to unravel his secrets?<br/>\n<br/>\r\n-----------------------------------------------------------------------------------------------<br/>\r\nOur main character is born from electricity, and has the ability to pass wherever it flows.<br/>\n<br/>\r\nThe game is made up of many levels, each of which is composed of various stages with unique puzzles and obstacles. Users must use their electricity-based superpowers as the main characters in these stages to solve puzzles, press buttons or operate switches to escape the room.<br/>\n<br/>\r\nThe fun of games is to use electricity and use various tools. You can use laser beams to carve out new paths, or you can move through the socket where you can't go. In addition, the story of the main character and the secrets of the city will be revealed as the game proceeds to eliminate or avoid the enemy who protects the room with each key.", "metacritic": null, "released": "2023-11-07", "tba": false, "updated": "2023-11-10T06:19:10", "background_image": "https://media.rawg.io/media/screenshots/3f7/3f7e27b74b02da2099f78d1507f1098b.jpg", "website": "https://codewapoly.io/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["MungChi Games"], "genres": ["Indie"], "publishers": ["MungChi Studio"], "esrb_rating": null}