{"id": 971944, "slug": "storage-hustle", "name": "Storage Hustle", "name_original": "Storage Hustle", "description": "<strong>Storage Hustle</strong> is a game where you take risks and buy storages that are forgotten and contains many <strong>hidden treasures</strong>. Get in your truck, bring your luck and reveal the items in the storages you bought. But getting lucky won't be enough, you have to master your haggle ability to sell your foundings for great profit. So, what do you say? Are you ready to become the best dealer?<br/><br/><br/><br/><strong>Hunt </strong>for the best storage, pick the one you want and go for it! Join the <strong>Storage Auctions</strong> but be ready for a bid war. Become the best bidder amongst others to reveal the mysteries in the storage units.<br/><br/><br/><br/>In storages you can find over <strong>300 </strong>items with <strong>4</strong> different rarities and<strong> 5 </strong>categories. You can rename them when you are selling and adjust the price to your liking. From <strong>Common </strong>items to <strong>Legendary </strong>ones, they are waiting to be found.<br/><br/><br/><br/>Every storage is <strong>random generated</strong>, so you won't see the same storage twice. With 4 different Storage Areas, the possibilities are limitless. Open up these beauties, hopefully with the right storage you might become the biggest trader in town.<br/><br/><br/><br/>Gain experience by hustling, and level up your character. Unlock new <strong>Character</strong> and <strong>Trader</strong> skills to make your life easier and your wallet heavier.<br/><br/><br/><br/>Repair broken items to make them pricier. Scan them to know their perfect price. Upgrade your tools to get the best of them. But still, your best tool is your ability as a salesman!<br/><br/><br/><br/>Increase your life quality to get into the sigma entrepreneur mindset. Buy a house, upgrade your car, live life to the fullest.", "metacritic": null, "released": "2023-11-08", "tba": false, "updated": "2024-02-01T17:06:54", "background_image": "https://media.rawg.io/media/screenshots/dcd/dcdd6d7b95a586b011bca35cfd58ab0a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "dropped": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Broken Clock"], "genres": ["RPG", "Simulation", "Casual", "Indie"], "publishers": ["Broken Clock"], "esrb_rating": null}