{"id": 971958, "slug": "artifice-war-tactics", "name": "Artifice: War Tactics", "name_original": "Artifice: War Tactics", "description": "A turn-based strategy set in a medieval fantasy world where victory is earned through cunning tactics and skillful execution. Outwit your enemies by setting deadly traps and unleashing devastating combos with allies. Survive waves of relentless foes and conquer strongholds by defeating their powerful bosses.<br/><br/><h3>FEATURES</h3><ul><li><strong>Set overwatch: </strong>Strategically place units to set up hidden Overwatch attack zones. When enemies enter an Overwatch, your champions attack! <br/></li><li><strong>Let none escape:</strong> Ensnare and eliminate enemies using unique movement patterns and skills.<br/></li><li><strong>Trigger chain reactions:</strong> Assemble an array of champions to pierce, burn, poison, and pull enemies into other Overwatches – creating an explosive chain reaction. <br/></li><li><strong>6 playable champions</strong>: Unlock new champions. Upgrade their traits, stat bonuses, and new abilities as the campaign progresses.<br/></li><li><strong>Spoils of war:</strong> Bolster your squad by pillaging enemy provinces for unique loot.<br/></li><li><strong>2 Stronghold bosses</strong>: Challenge bosses in their strongholds to claim new territory. <br/></li><li><strong>3 biomes</strong>: Unique biomes each with their own hazards that can disrupt enemy and player forces alike.</li></ul>", "metacritic": null, "released": "2023-11-08", "tba": false, "updated": "2023-11-10T07:08:39", "background_image": "https://media.rawg.io/media/screenshots/dfb/dfb949189c2a86a942eaafb0cc9146f1.jpg", "website": "http://www.artificewartactics.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 434, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Silvine Game Studios"], "genres": ["Strategy", "Indie"], "publishers": ["Silvine Game Studios"], "esrb_rating": null}