{"id": 971961, "slug": "cobalt-core", "name": "Cobalt Core", "name_original": "Cobalt Core", "description": "Cobalt Core is a sci-fi roguelike deckbuilder with a unique single-axis combat system that will throw you for a loop. Many loops! <br/><br/><br/><br/>Give orders to your crew by playing cards: Will you <strong>raise shields</strong> to protect your ship, <strong>dodge</strong> incoming missiles and cannon fire to avoid damage outright, or <strong>strike</strong> preemptively to disable your enemy’s weapons? Outmaneuver your foes to stay just ahead of impending calamity, and reach the Cobalt Core!<br/><br/><br/><br/><ul><li><strong>Fresh new spin on tactics –</strong>  dodge attacks and target weak points in this unique single-axis take on tactics combat. Outwit the enemy in a high stakes game of cat and mouse!<br/></li><li><strong>Customize your deck –</strong> hundreds of cards and split upgrade paths means no two runs will be the same. Find that perfect combo that brings your deck from powerful to overpowered.<br/></li><li><strong>Get to know your crew –</strong> each character comes with a completely unique playstyle and their own personal story. Bring 3 along, mix and match their decks, and see how these little goobers get along with each other.<br/></li><li><strong>Tons of replayability –</strong>  hundreds of different character+ship combinations before you even hit “start run”. Crank up the difficulty and really test your skills!<br/></li><li><strong>Forward momentum –</strong> untangle a narrative and unlock more playstyles as you go. Is there any escape from this time loop?</li></ul><br/><br/><br/>By the makers of Sunshine Heavy Industries, recipient of IGF's <strong>Honorable Mention for Excellence in Design 2022</strong>.", "metacritic": null, "released": "2023-11-08", "tba": false, "updated": "2024-02-17T20:10:48", "background_image": "https://media.rawg.io/media/screenshots/4ae/4aed87e58504b496ef028b0f8ac57982.jpg", "website": "https://braceyourselfgames.com/cobalt-core/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 7, "toplay": 4, "dropped": 2, "playing": 2}, "playtime": 4, "achievements_count": 10, "ratings_count": 2, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Rocket Rat Games"], "genres": ["Strategy", "Indie"], "publishers": ["Brace Yourself Games"], "esrb_rating": null}