{"id": 971948, "slug": "gems-and-knight", "name": "Gems And Knight", "name_original": "Gems And Knight", "description": "After three days of sea travel, I finally found the black dragon's lair. Just when I thought I was about to face a powerful enemy, a bolt of lightning hit my boat...<br/>\n<br/>\r\nWhen you first play Gems and Knight, you may think it is an ordinary elimination game, but if you continue to play, you will find that the combat strategy is very strong. The game requires understanding the enemy's attributes and behavior habits, and matching equipment, skills, etc. outside of combat, and using them in combat.<br/>\r\n         Moreover, the timing of the operation itself is also very important. There is even a system in the game to watch the enemy's actions and block and counterattack.<br/>\r\n﻿<br/>\r\n         In addition to combat, the game's chapter design is also distinctive. It is not just about eliminating gems, but also combines gems of different colors and monsters to create various small tasks, which feels like solving a problem. There are also many chapter modes, from the main mode in the early stage, to the adventure mode that is opened after obtaining a certain prop, to the free exploration that is opened after meeting the conditions in the adventure mode, and there are several modes to be developed by players later.<br/>\n<br/>\r\nVarious level modes to play<br/>\r\n         There are chapters and battles, and there must be good growth gameplay to support it. Almost every level in the game has new things opened up, including equipment, skills, talents, inlays and other systems that only appear in role-playing. In the mid-term, there is a companion system, which can persuade enemies to join the team. Later, even BOSS-type enemies can be collected, and the most powerful thing is that BOSS-type companions will change the way the battle is played. Anyway, comparing the beginning of the game and the later stage, the gameplay will become refreshing with various powerful systems and equipment bonuses.<br/>\n<br/>\r\nWe will be happy to hear your suggestions to make Gems and Knight better, what problems you encounter in the game, and even have ideas for future updates of the game.", "metacritic": null, "released": "2023-11-08", "tba": false, "updated": "2023-11-10T06:56:14", "background_image": "https://media.rawg.io/media/screenshots/76f/76f90d852372726c156b0053b147d914.jpg", "website": "https://twitter.com/ki1ki2023", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OY Kin"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["OY Kin"], "esrb_rating": null}