{"id": 971910, "slug": "fellowship", "name": "Fellowship", "name_original": "Fellowship", "description": "<strong>Fellowship </strong>is a survival action-roguelike game where you assemble a party of 5 heroes to combat hordes of monsters. Utilize unique skills, formations, and synergies to liberate the world of Eldrida from the shadow cast by Goltar, the dark sorcerer.<h3>Forge an Unstoppable Party</h3>Construct a team of five distinct heroes, each boasting unique skills, personalities, and combat styles. As you progress, discover and free new heroes, experimenting with varied party combinations in each run, ensuring no two adventures are alike.<br/><h3>Conquer Through Formations</h3>Adapt and select the optimal formation in real-time. Unlock special party buffs to bolster your heroes against enemy hoards. Alternate between offensive and defensive stances, recognizing that each formation offers its own advantages. Use the right formation at the right time.<br/><h3>Discover Ultimate Party Synergies</h3>Enhance your heroes' abilities and unearth potent skill synergies. Depending on your party's composition, activate powerful combo skills that can devastate your foes.<br/><h3>Loot, Customize, Conquer</h3>Scour your surroundings! Gather resources, magical stones, and other valuable items to fortify your heroes. Upgrade your gear, grow stronger, and craft a legendary party ready to challenge the monstrous hordes.<br/><br/><br/>Are you prepared to guide your party and rescue Eldrida from the encroaching darkness?", "metacritic": null, "released": "2023-11-07", "tba": false, "updated": "2023-11-10T06:05:03", "background_image": "https://media.rawg.io/media/screenshots/11a/11a8b0ff815d13d67031286af58d0b21.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 444, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Elraim Studio"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Elraim Studio"], "esrb_rating": null}