{"id": 971997, "slug": "dont-die-in-the-west", "name": "Don't Die In The West 🤠", "name_original": "Don't Die In The West 🤠", "description": "<strong>Don’t Die in the West</strong> is an open-world cowboy-life RPG for 1-4 players. Start a new life on the prairie, explore the frontier, and build a ranch of your own. Explore the open prairie, the ramshackle town Tumbleville and the definitely-not-haunted mineshafts. Craft adventuring gear and tools, deadly six shooters, dynamite and a saddle for your mustang. Build a big beautiful ranch or a massive hideout for your gang.<br/><br/><br/>Adventure through the beautifully cruel world of the old west. Visit the local town of Tumbleville and ask for the latest rumors from Nellie the Saloon owner. Gritt Corp. is expanding their evil oil empire to the west of town and the Dawson gang keeps robbing the stage coaches. Word has it there’s a wise (and possibly crazy) hermit living on top of the mountain - he might know more about their whereabouts. Travel by foot or lasso a wild stallion to make it your trusty steed. Whoa there!<br/><br/><br/>Few things are as important for a cowboy, as building up a reputation. Your choices and actions have consequences so it’s up to you how you want to be remembered. As the friendliest gun in the west or as a notorious and brutal desperado? A traveling journalist has settled down in Tumbleville to document history as it unfolds. If you make an impression, your legend will be told for years to come.<br/><br/><br/>Gather resources across the plains and turn it into weapons, clothes and equipment needed to thrive in the west. Venture down the mineshafts and dig for hidden treasure and discover the rarest and most valuable resources. Hunt wild game for food or shoot some potatoes to make a stew - there’s no problem a revolver can’t solve.<br/><br/><br/>A cowpoke like you need a place to hang up your spurs after a long day of adventure. Build the ranch of your dreams and outfit it with a workshop for crafting, a stable for your horses, a whiskey distillery and even a card table. There’s plenty of open space to expand your homestead.<br/><br/><br/>Play as a lone ranger or team up with up to 3 other players to form a gang. Work together to gather resources and build the finest hideout in the west. Take on the biggest and baddest outlaws with your fellow cowboys, and share a horse to ride tandem into the sunset.<br/><br/><br/>Keep an eye on this page as we continuously reveal new features from the game.<br/><br/>Join our Discord", "metacritic": null, "released": "2023-11-09", "tba": false, "updated": "2023-11-10T08:01:32", "background_image": "https://media.rawg.io/media/screenshots/b19/b197bf8e06d31b553ae8262ae9680510.jpg", "website": "https://www.dontdieinthewest.gg", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Funday Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Funday Games"], "esrb_rating": null}