{"id": 971977, "slug": "incredible-dracula-dark-carnival", "name": "Incredible Dracula: Dark Carnival", "name_original": "Incredible Dracula: Dark Carnival", "description": "HISTORY:<br/><br/>In Incredible Dracula Dark Carnival you’ll face a magical conundrum like no other! Elizabeth, Dracula’s beloved wife, has been cursed by the mischievous and legendary magician, Bestby. Her head was transformed into a pumpkin, and Dracula must embark on a quest to break the curse before it's too late.<br/><br/><br/><br/>Bestby awakens only sporadically, but each time he does, he wreaks havoc and seeks extravagant celebrations. This time, he's chosen Halloween as his backdrop, and he's demanding a grand feast that the entire county will remember. You will step into the shoes of Dracula, determined to meet Bestby's demands and break the curse. Your journey will find you needing to create a Halloween extravaganza filled with zombies, spiderwebs, scary pumpkins, and all things eerie to satisfy Bestby's whims.<br/><br/><br/><br/>But it won't be a walk in the park. Bestby has accumulated immense magical power over the centuries, making breaking the curse a daunting task. You'll need to gather resources and undertake various challenges to create the perfect feast. Along the way, you'll encounter the many inhabitants of the county and explore many areas, all while racing against the clock.<br/><br/><br/><br/>As you work tirelessly to organize an unforgettable Halloween feast, Elizabeth’s fate hangs in the balance. Can you meet Bestby's demands, break the curse, and ensure that Dracula’s wife returns to her true form? Dive into the enchanting world of Incredible Dracula Dark Carnival and find out!<br/><br/><br/><br/>Upsell Features<br/>65 exciting levels<br/>Step-by-step level guide<br/>Catchy downloadable Original Soundtrack<br/>Collection of rare cards<br/>Collect dishes for the holiday table<br/>Collect the parts of the magic clock<br/>Achievements", "metacritic": null, "released": "2023-11-08", "tba": false, "updated": "2023-11-10T07:36:40", "background_image": "https://media.rawg.io/media/screenshots/d75/d75efeedb0061ed460178d55a071884d.jpg", "website": "https://steamcommunity.com/groups/alawargames", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Game Mixer"], "genres": ["Adventure", "Strategy", "Casual", "Indie"], "publishers": ["Alawar Entertainment"], "esrb_rating": null}