{"id": 971928, "slug": "champion-shift-prologue", "name": "Champion Shift: Prologue", "name_original": "Champion Shift: Prologue", "description": "Fight. Shift. Escape. <strong>Champion Shift: Prologue</strong> is a unique online co-op action roguelike where powerful Champions fight the endless forces of the Dominion, in an eternal battle to save our realm. Experience the first chapter of our Champions’ daring escape from Dominion captivity, recapturing your long lost celestial abilities along the way.<br/><br/>Head over to Champion Shift's main page for all the full game features!<br/><br/><h3>Prologue Features</h3><ul><li>Unleash Sun Wukong, Athena and Gilgamesh as Champions!<br/></li><li>Shift forms between Vehicle and Hero, each with their own playstyles, strengths and weaknesses.<br/></li><li>Intuitive controls with default auto attacks and the option to manually aim.<br/></li><li>Survive challenging and rewarding enemy encounters that test your playstyle and strategy.<br/></li><li>Upgrade abilities and powers that allow you to construct your perfect run.<br/></li><li>Three unique locations, with stage variations and day/night versions, each with its own challenges.<br/></li><li>Play solo or co-op with up to 4 players.</li></ul><br/><br/><br/><br/>Challenge yourself to a solo run, or join your friends in online co-op play! Up to 4 players can band together, leveraging each other’s strength and powers to go on a massively powered run.<br/><br/><br/><br/><br/><br/>While escaping from captivity, our heroes obtained the ability to transform into powerful vehicles with impressive weaponry. This VERY unique take on the genre opens up countless strategies for you and your friends to try out.<br/><br/><br/><br/><br/><br/>Experiment with different skills and abilities, which combined with the strengths of each Champion, create a unique playthrough on each run. Complete missions and defeat Dominion bosses to earn Tech Caches and Heroic Gifts that power-up your hero to insane levels!", "metacritic": null, "released": "2023-11-07", "tba": false, "updated": "2023-11-10T06:31:19", "background_image": "https://media.rawg.io/media/screenshots/7df/7df1c5444f455672a6bb2b7c92ab358c.jpg", "website": "https://championshiftgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 547, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SRG Studios"], "genres": ["Action", "RPG", "Casual"], "publishers": ["SRG Studios"], "esrb_rating": null}