{"id": 972065, "slug": "night-stroll", "name": "Night Stroll", "name_original": "Night Stroll", "description": "The ordinary girl named \"Suzuki Rika\" .<br/>She leads a plain and peaceful life. <br/>One day, while browsing through an SM magazine at a convenience store, <br/>she is influenced by an article about flash. <br/>She starts imitating the exhibitionism.<br/><br/><br/><br/>At first, she only takes off her miniskirt, wore underwear and tight pants, <br/>and walked around in a hoodie, engaging in mild flash.<br/>She asks herself, \"Should I try something bolder?\"<br/>She gradually escalates her actions, leaving only her underwear on her body,<br/> and finally walked around without pants at all, leaving her lower body exposed. <br/>The shame of the flash quickly led her to become addicted to the pleasure.<br/><br/><br/>PM 21:10<br/>Rika just woken up from a nap, begins a endless and trembling night...<br/><br/><br/><br/><br/><br/><ul><li>Room: Make sure of your appearance before going out.<br/></li><li>Residential area: The streets that were once ordinary become dangerous areas due to different clothing.<br/></li><li>Utility pole: Stand under a street lamp, illuminated by weak light, and continue forward.<br/></li><li>Convenience store: Bright and tidy store. Perhaps there are adult magazines in the magazine section...?<br/></li><li>Vending machine: Squatting in front of a brightly lit vending machine to pee.<br/></li><li>Apartment: Masturbating in front of the entrance to an apartment rented by unscrupulous men.<br/></li><li>Park: Using the monkey bars and a forgotten jump rope, engage in self-restraint play.<br/></li><li>Park toliet: Masturbating naked in a male restroom stall entered to avoid detection.<br/></li><li>Mansion: Dangerous even if just staying naked in the wide lobby corridor, with maximum danger.<br/></li><li>Elevator: Riding the elevator completely naked, forcibly moving without knowing the situation outside, with no escape, an absolutely hopeless environment.<br/></li><li>Delusion: Fantasizing about exhibitionism acts that cannot be realized, which may also affect reality...</li></ul><br/><br/>The main character is an ordinary girl \"Suzuki Rika\". <br/>One day, she stumbled upon the 'Flash' column in an SM magazine while flipping through it at a convenience store.<br/>Influenced by it,she starts to be a flasher.<br/>The city, where this story unfolds, consists of a total of 10 areas.With the different places they are different way to flash.<br/>The main character will attempt to flash herself in various places; initially, it might be mild flash, but once she experiences the pleasure of flashing, things are getting out of control.<br/>You can control the Suzuki Rika's fate:\"Escape?!\" \"Stay in place!?\" There are several scenes in the game where you must make choices.<br/>Naturally, you'll have to pay the price for being found flashing by someone.<br/><br/><br/><ul><li>(1) Every \"Suzuki Rika\" scene is fully voiced.<br/><br/></li><li>(2) \"Escape?!\" \"Stay in place!?\" There are several scenes in the game where you must make choices. <br/>Your hands will determine Rika's fate. <br/>If you make the wrong choice... you will personally experience the consequences of exhibitionism play through her body.<br/><br/></li><li>(3) There are no troublesome elements such as battle scenes or accumulating experience points.<br/>Enjoy a relaxing experience of the story.<br/><br/></li><li>(4)CG Viewing &amp; Event Replay Mode<br/>You can replay any H events you have seen at any time. </li></ul>", "metacritic": null, "released": "2023-11-10", "tba": false, "updated": "2023-11-13T06:11:13", "background_image": "https://media.rawg.io/media/screenshots/191/19170f8931111f501ef837d722f93339.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 367, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SUPERBAD"], "genres": ["Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["072 Project"], "esrb_rating": null}