{"id": 972073, "slug": "battlethorne", "name": "Battlethorne", "name_original": "Battlethorne", "description": "<strong>Battlethorne is a third person Conquest game with rpg elements and large scale battles.</strong><br/><br/><br/><br/>Choose from six weapon classes each with its own unique abilities and fight across a large open world conquering bases, gaining loot and vanquishing your foes.<br/>Fight against multiple factions, both human and beast, with over a hundred allies in a four way war across a 4.5 km2 open world. <br/><br/><br/>------------------------------------------------------------------------------------------------------------<br/><strong>Six Weapon Classes, each with unique skills</strong><br/>------------------------------------------------------------------------------------------------------------<br/><br/><strong>Warrior/Two handed Axe.</strong> Capable of \"zooming/warping\" to targets, knocking the enemy down and lighting enemies on fire.<br/><br/><br/><strong>Paladin/Sword and Shiled.</strong> Puts down a Barrier for for self and allies, pulls targets towards them and can even charges forward knocking down enemies.<br/><br/><br/><strong>Assassin/Daggers.</strong> The epitome of guerilla warfare, can go invisible to strike enemies without their knowledge, puts down mines to knock down foes and even <br/>has a long range strike.<br/><br/><br/><strong>Archer/Bow.</strong> The best at long range damage, both single target and AOE(Area of effect). Can chain enemies to the ground not allowing them to move. Also has multishot finishing move for massive damage.<br/><br/><br/><strong>Mage/Staff.</strong> Heals all allies around him. Crucial for pushing towards the enemy as a group. Can call an ice meteor for AOE damage and also freeze<br/>enemies in place if they get too close.<br/><br/><br/><strong>Summoner/Wands.</strong> Summons a wolf for single targets and spiders for big AOE blasts. Best of all it can warp/dodge avoiding damage while leaving behind a spirit that attacks enemies if they too get close.<br/><br/><br/>-----------------------------------------------------------------------------------------------------<br/><strong>Large scale battles</strong><br/>-----------------------------------------------------------------------------------------------------<br/>Fight in large scale battles with hundreds of units amoung four factions, each vying for supremacy across a 4.5 km2 map with dozens of Conquest Bases.<br/>Use your trusty stead to cover large distances in less time and get to the fight quicker.<br/><br/><br/><br/><br/>-----------------------------------------------------------------------------------------------------<br/><strong>Progression and Loot System</strong><br/>-----------------------------------------------------------------------------------------------------<br/><br/>Upgrade your character with loot from your slain enemies and treasure chests strewn across the wold. With six armor types, each with their own properties like increased damage, more health to tank and reduced cool-down to make abilities more effective. Six weapon class types each with its own unique abilities, make your own build or change it on the battlefield to suit your play style and objectives.<br/><br/><br/>------------------------------------------------------------------------------------------------------<br/><strong>Beasts that fight against everyone on the battlefield.</strong><br/>------------------------------------------------------------------------------------------------------<br/><br/><br/><br/>Among the four factions are two beast factions that can conquer bases and make others change their strategy in a four way war.", "metacritic": null, "released": "2023-11-10", "tba": false, "updated": "2023-11-13T06:22:08", "background_image": "https://media.rawg.io/media/screenshots/79c/79cd36f7a2d85d0c9577e2e13b218cd0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 525, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Primarch Interactive"], "genres": ["Action", "RPG", "Strategy", "Indie"], "publishers": ["Primarch Interactive"], "esrb_rating": null}