{"id": 972094, "slug": "tian-yuan-hua-jing-pastoral", "name": "田园画境 Pastoral", "name_original": "田园画境 Pastoral", "description": "《Pastoral》is a casual simulation, placement of hang-up + oil painting style healing system placement game.<br/>The breeze is quiet and the sun is fine! Let's get away from the hustle and bustle and enjoy a moment of idyllic beauty in the game.<br/><br/><strong>【Game Play】：</strong><br/><strong>1, planting vegetables and fruits:</strong> dozens of vegetable fruit trees for you to plant, upgrade;<br/><br/><strong>2, raising animals: </strong>you can raise different animals in the garden, their output content, range of activities, movement performance will give you a different experience;<br/><br/><br/><strong>3, recruit farmers:</strong> they will automatically help to harvest vegetables and fruits; They can also be equipped with farm tools to improve their work efficiency; The farmers are tired from their work and need a rest. Don't disturb them.<br/><br/><br/><strong>4, garden decoration: </strong>you can plant flowers in the garden, mushrooms, sunflowers, lotus, reed, etc., dozens of different kinds of flowers and plants to enrich your garden scenery;<br/><br/><br/><strong>5, place buildings:</strong> fences can resist monsters to steal vegetables and fruits, build nests for animals can make small animals grow faster, scarecrows can drive away crows...<br/><br/><br/><strong>6, learn science and technology: </strong>as the level rises, you can aquaculture, fish dock, aircraft automatic fertilization, etc., so that your garden becomes automated, waiting for harvest;<br/><br/><br/><strong>7, small games:</strong> catch butterflies, whack-a-mole, drive away monsters, tidy up the countryside, repair damaged fences and buildings, fish farming, tree blessing and other daily care!<br/>", "metacritic": null, "released": "2023-11-10", "tba": false, "updated": "2023-11-13T06:52:37", "background_image": "https://media.rawg.io/media/screenshots/fa1/fa1feb5ad0bd06fbfc05d5aacc91cf1d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Easy Joy"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Easy Joy"], "esrb_rating": null}