{"id": 972002, "slug": "higurashi-when-they-cry-hou", "name": "Higurashi When They Cry Hou+", "name_original": "Higurashi When They Cry Hou+", "description": "The tragedy of Hinamizawa is over. Those held captive within its grip are free from the fate that bound them to June 1983. Yet the tale of Hinamizawa is not truly complete. There are many worlds not yet explored. <br/><br/>Higurashi When They Cry Hou+ is the final installment of the Higurashi When They Cry Hou franchise featuring 4 new chapters.<h3>Higurashi When They Cry Outbreak</h3><br/>Keiichi and the others face a brand new tragedy. The mysterious virus and the panic it creates are such laughable sights.<h3>Higurashi When They Cry Kamikashimashi Chapter</h3><br/>The tragedy spreads to Okonomiya, with no end in sight. Who is behind all of this, and for what purpose? Can it be stopped? The tale of Higurashi Outbreak concludes here.<h3>Hinamizawa Bus Stop: Higurashi When They Cry Origin</h3><br/>Welcome to Hinamizawa. This is a slightly unusual fragment. The original fragment which would eventually grow into Higurashi When They Cry.<h3>Higurashi When They Cry Mehagashi Chapter (Hou+ Additional Scenario)</h3><br/>Tragedy that could destroy not only all of humanity, but the galaxy itself draws near...<br/>Keiichi Maebara! <br/>Go beyond the girls' swimsuits to defend the universe! <br/>However, can Keiichi possibly win against the club members all by himself...?<br/><h3>Gameplay</h3>Higurashi When They Cry is a sound novel. The music, backgrounds and characters work together to create a world that is the stage of a novel for the user to read. They laugh and cry and get angry. The user takes the point of view of the protagonist to experience the story.", "metacritic": null, "released": "2023-11-09", "tba": false, "updated": "2023-11-10T08:09:08", "background_image": "https://media.rawg.io/media/screenshots/578/578b9e9bd35c83778b4af3d2914de6e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["07th Expansion"], "genres": ["Adventure", "Indie"], "publishers": ["MangaGamer"], "esrb_rating": null}