{"id": 972053, "slug": "horizon-to-crinoa-have-faith-in-radiance-prototype", "name": "Horizon To Crinoa: Have Faith in Radiance -Prototype", "name_original": "Horizon To Crinoa: Have Faith in Radiance -Prototype", "description": "<strong>Horizon To Crinoa: Have Faith in Radiance -Prototype-</strong> is a small scale, prototype, anime action RPG showcasing some of the general ideas, aesthetics and gameplay style we’re hoping to achieve with our future game projects! It’s a high speed, stylish, action game with major RPG elements, skills and abilities inspired by classic Japanese RPGs! <br/><br/>Follow the simple story of our main character, Yellette, set in the world of Crinoa, on a small excursion in order to find ingredients for cooking. What was assumed to be nothing more than a simple quest, transforms into more trouble than she could have seen coming!<br/><br/>Make your way through a small section of the Island of Ezelpor, where the local Jeletan Season has spread wild Jeletan throughout, and take down the few species of these beasts you find with cool, stylish combos and flair! <br/><br/><strong>Main Features:<br/><br/>-Stylish Action Gameplay </strong><br/>By chaining skills together with the game's unique systems and mechanics, you can unleash devastating combos and skills on enemies to show off your abilities in order raise your 'Flair Meter' higher and higher for better rewards!<br/><br/><br/><br/><strong>-Active Character Switching and Assists</strong><br/>For this prototype, you will be able to control and play as two characters; the fully fleshed out main character, Yellette, and the simpler character, the Jeletan, Ermli! By tapping the 'character switch' button you can instantly switch characters in the middle of a combo or chain to further extend your combos and show just how much flair you can pull off with the techniques available! <br/><br/>Furthermore, by holding the \"Switch\" button, combos can also be extended by instantly calling your non controlled party member to activate an assigned \"assist skill\" for them to perform on a target. <br/><br/><br/><br/><strong>-Simple story with in depth lore and an in game glossary</strong><br/>Though the story is simple and sweet, it is used to set up the personality of Yellette, our main character, and to further set up the world and setting around her for future titles. Enjoy the voiced main story cutscenes and partially voiced sidequest stories to get a true feel for our characters and world! And then delve into the many terms, places, people and ideologies of the world of Crinoa!<br/><br/><br/><br/>Venture into the World of Crinoa and show us just how stylish you can be and just how much flair you can bring forth as a 'Hero of the World'!", "metacritic": null, "released": "2023-11-10", "tba": false, "updated": "2023-11-13T05:56:57", "background_image": "https://media.rawg.io/media/screenshots/0b5/0b5973e1d6d0443e88f4203fc44696fd.jpg", "website": "https://www.secondmorningworks.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Second Morning Works"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Second Morning Works"], "esrb_rating": null}