{"id": 972017, "slug": "fetish-locator-week-one", "name": "Fetish Locator Week One", "name_original": "Fetish Locator Week One", "description": "Play as a young college student exploring love, lust, and sexual fetishes with the hottest women in town. Score points in the Fetish Locator app, which has taken the campus by storm. Make choices and decide the fate of the story in Fetish Locator!\n<br/>\n<br/>\n<br/><br/>\nAs you play through the story you will get to know many different girls! Many of them are also using the Fetish Locator app, and maybe you can convince them to help you with your challenges. Which one is your favorite?\n<br/>\n<br/>\n<br/><br/>\nThe Fetish Locator app is an in-game app that challenges users to send pictures of themselves doing activities related to what it calls the “fetish of the day”! The points will be worth some rewards, like an invitation to a wild fetish party. How many points can you get?\n<br/>\n<br/>\n<br/><br/>\nThe story is completely tailored by the choices you make along the way. On one playthrough you might get to know some girls very intimately. On the next one, you may not even talk to them very often. There are many possibilities, will you be able to reach every single ending?\n<br/>\n<br/>\n<br/><br/>\nExperience the best sex scenes you’ll ever see! And the best part is: you can explore several fetishes like exhibitionism, domination, cuckold, blindfolded sex, watersports and more!\n<br/>\n<br/>\n<br/><br/>\n<br/>\nYou will have the chance of attending a fetish party, full of sexy events and even sexier women! Which events will you choose to take part in?\n<br/>\n<br/>\n<br/><br/>\n<br/><br/>\n<p>This Game may contain content not appropriate for all ages or may not be appropriate for viewing at work.</p>", "metacritic": null, "released": "2020-07-26", "tba": false, "updated": "2023-11-10T08:32:21", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["ViNovella Games"], "genres": [], "publishers": ["ViNovella Games"], "esrb_rating": null}