{"id": 972051, "slug": "the-grand-adventures-of-leo", "name": "The Grand Adventures of Leo", "name_original": "The Grand Adventures of Leo", "description": "Long time ago, in the almost forgotten past, were two best friends: Leo the dog and Chubby the cat. On one fateful morning their owner, left their humble abode, forgetting to close the door behind her. Chubby and Leo decided they needed an adventure and ran after her but somehow Chubby ended up getting lost in the city.<br/>\n<br/>\r\nWeeks later, after looking aimlessly for Chubby, Mommy and Leo retired from their search with great sadness. Chubby felt neglected and alone, he thought Mommy and Leo didn't want him anymore. While in the city Chubby ran into Smokey, the leader of the Cat Mafia. Smokey became enraged when we heard Chubby's mother had abandoned her cat and vowed he would seek revenge for Chubby by declaring war between cats and dogs! Smokey convinced Chubby to become a member of the Cat Mafia, as the Mafia would never forsake him! Consumed by rage and revenge, Smokey began his triad by recruiting all the lost city cats into his gang. THE CAT MAFIA!<br/>\n<br/>\r\nPresent day has arrived, and Leo waits for Mommy to feed him, alas it's been 2 hours and there was still no sign of his Mommy or his food. Leo retreats to his mom's room where he finds a ransom note: \"I have kidnapped your precious Mommy: the clock is ticking!\" signed THE CAT MAFIA.<br/>\r\nCan Leo reach Mommy in time? Who is the cat mafia and what exactly do they want? Help Leo get through the city and past all obstacles in order to find the CAT MAFIA and save his beloved, Mommy before it's too late.", "metacritic": null, "released": "2023-11-11", "tba": false, "updated": "2023-11-13T05:54:03", "background_image": "https://media.rawg.io/media/screenshots/d93/d938906422deea9a13928174ee8c4dac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ori 3D"], "genres": ["Action", "Adventure"], "publishers": ["Ori 3D"], "esrb_rating": null}