{"id": 972071, "slug": "shave-stuff", "name": "Shave & Stuff", "name_original": "Shave & Stuff", "description": "Take on the role of a barber and tattoo master. To succeed, you’ll need not only to cut hair, but also make it grow! Use all the tools at your disposal in Shave &amp; Stuff to make your clients look more beautiful than ever. They’ll tell you the hairstyle they want, and you’ll try to make their wish come true. But of course, there are times when you feel inspired, right? On days like that, your clients’ wishes can take a back seat—instead, use your imagination to create something special! But wait, there’s more! You can also unlock a tattoo salon, where you tattoo your clients with designs they’ll carry with them for life. So if you’re going to get creative here, put the tattoo somewhere no one can see it!<br/><br/>Want to make <strong>someone bald?</strong> You got it! Not everyone wants their hair to look fantastic—some people are just too lazy to comb their hair in the mornings.<br/>Want to create a <strong>colorful punk hairstyle?</strong> You got it! Tastes differ, and beauty’s in the eye of the beholder! Use the color sprays at your disposal to create an eye-catching, head-turning masterpiece! <br/><br/>Want to regrow <strong>hair from scratch?</strong> That’s right—you got it! This is no magic trick. Did you make a mistake during a haircut, or do you just want to make a spectacular toupee? Well, we’ve invented a spray that makes hair grow!<br/><br/><br/><strong>Cut hair your way with trimmers! </strong><br/><ul><li> You can use a variety of trimmers to gradually thin hair or even create spectacular gradients so that your clients leave with a completely fresh, new style.</li></ul><br/><br/><strong>Hair growers really do exist!</strong><br/><ul><li> Our newest invention will help you grow your client’s hair faster than ever. If you’re a clueless hairdresser, you’ll want to keep it on hand! You’ll be able to correct those bald spots or simply make your haircuts look great.</li></ul><br/><br/><strong>Use the razor blade to shave your customer’s beard or head! </strong><br/><ul><li> Relax by giving your clients a calming, ASMR-worthy trim. Don’t be surprised if they fall asleep!</li></ul><br/><br/><strong>Create perfect, neat tattoos! </strong><br/><ul><li> But don’t worry if you get it wrong: we’re prepared for anything. Just use the roller to clean up the tattoo and the areas where you messed up, and everyone will be happy!</li></ul><br/><br/><strong>Add color and shape to hairstyles to make them look even more polished. </strong><br/><ul><li> You can shape hair with the razor blade and trimmers, but try out our shaping sprays too. Your clients will love their look and recommend your salon to their friends!</li></ul><br/><br/><strong>Create whatever your heart desires on your clients’ hair and skin! </strong><br/><ul><li> Your clients are blank canvases for your greatest hairstyle ideas and tattoo designs. Let your imagination run wild and create the craziest hairstyles you can imagine! Discover all Shave &amp; Stuff’s tools and give your clients an experience to remember in your barbershop!</li></ul>", "metacritic": null, "released": "2023-11-10", "tba": false, "updated": "2023-11-13T06:19:06", "background_image": "https://media.rawg.io/media/screenshots/eae/eaeb19834eada0816a04324991c54e25.jpg", "website": "https://shavenstuff.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HyperVR Games"], "genres": ["Action", "Simulation", "Casual"], "publishers": ["HyperVR Games"], "esrb_rating": null}