{"id": 972063, "slug": "ying-xiong-yuan-zheng", "name": "英雄远征", "name_original": "英雄远征", "description": "Join us on an epic journey in this fantastical world, where you become the hero of your own destiny. This magical idle game brings you an unparalleled gaming experience.<br/>\n<br/>\r\nFirst and foremost, the game offers the unique feature of freely combining skills. You have the freedom to choose from various skills and create your own extraordinary combat style. Whether it's powerful attack skills or healing abilities to support your teammates, you can gain the upper hand in battles by customizing your skillset.<br/>\n<br/>\r\nFurthermore, the game allows you to freely choose talents. As you embark on your adventure, you'll earn growth points that can be used to unlock and enhance a wide range of talents. These talents greatly enhance your attributes and skill effects, making you even more formidable in battles. Moreover, you can adjust your talents as per the requirements of different battles, allowing you to adapt and overcome various challenges.<br/>\n<br/>\r\nThe game also features a fun cast of companions awaiting your recruitment. Each companion possesses unique skills and combat styles, and they continue to grow alongside you. You can train and level up your companions, making them essential assets in your battles.<br/>\n<br/>\r\nIn addition, you have your own territory. By completing tasks and challenges, you gather resources to develop your territory. Within your territory, you can construct diverse facilities and buildings to level up and increase your fighting capabilities. Your territory serves as both a base for your battles and a symbol of your strength and status.<br/>\n<br/>\r\nThe game offers a plethora of thrilling challenges. Whether it's solo missions or team collaborations, the excitement and surprises never cease. Conquer various boss dungeons, participate in cross-server battles, and engage in friendly duels with other players to showcase your combat skills and wit.<br/>\n<br/>\r\nMoreover, the game incorporates a variety of life skills. During your leisure time, you can choose to cultivate skills such as cooking, potion-making, and forging. These life skills not only provide additional income but also offer valuable support on your journey. Most importantly, these skills help forge connections with other players, fostering social interactions within the game.<br/>\n<br/>\r\nLastly, enjoy the simplicity of this idle game with just one tap to play. Whether you're working, studying, or sleeping, you can confidently let your character automatically carry out quests and battles while experiencing the ultimate pleasure of the game. Join this enchanting world and become the legendary hero!<br/>\n<br/>\r\n(Note: Please note that the translation is provided to the best of my abilities, and there might be slight variations in the interpretation and style of the text.)", "metacritic": null, "released": "2023-11-09", "tba": false, "updated": "2023-11-13T06:09:00", "background_image": "https://media.rawg.io/media/screenshots/1c3/1c357b96776e32617027cb6605a14358.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["新吴梦游游戏工作室"], "genres": ["Adventure", "Strategy", "Casual", "Indie"], "publishers": ["新吴梦游游戏工作室"], "esrb_rating": null}