{"id": 972111, "slug": "draft-day-sports-pro-basketball-2024", "name": "Draft Day Sports: Pro Basketball 2024", "name_original": "Draft Day Sports: Pro Basketball 2024", "description": "Draft Day Sports: Pro Basketball 2024 gives you the opportunity to live out your dream of becoming general manager of your favorite team and delivers the most immersive and in-depth franchise mode experience of any basketball game today! <br/>\n<br/>\r\nTake over your favorite team and draft, trade, sign free agents and make strategic decisions to set them on a course to be the next great dynasty in this career based simulation. Enjoy the immersive, simulated gameplay and rich almanac storing an archive worth of stats and records while you make the day to day decisions to guide your franchise to the top of the basketball world. Check out the insanely detailed draft - you'll feel as if you're right in the middle of the real thing. <br/>\n<br/>\r\nAmong the new additions to the game this year is the in-season tournament for standard sized leagues. See where your team ends up in the draw and compete for the in-season tournament championship on your way to the ultimate goal of the playoffs and league championship. Take care in building your roster as this is the only basketball game where you have to build a cohesive roster based on individual play styles, talent and player personalities. It's the ultimate in franchise mode gaming!", "metacritic": null, "released": "2023-11-10", "tba": false, "updated": "2023-11-13T07:13:37", "background_image": "https://media.rawg.io/media/screenshots/21e/21e82e77209e9d2cde36acf517a38b1f.jpg", "website": "http://www.wolverinestudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 345, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wolverine Studios"], "genres": ["Strategy", "Simulation", "Sports", "Indie"], "publishers": ["Wolverine Studios"], "esrb_rating": null}