{"id": 972185, "slug": "estate-agent-simulator", "name": "Estate Agent Simulator", "name_original": "Estate Agent Simulator", "description": "<strong>Estate Agent Simulator</strong> is a property buying, selling and renting game. Buy houses in the city, decorate them and increase their value. Earn income by advertising these houses for rent or for sale. Don't forget to use your bargaining skills!<br/><br/><br/>Construction Vacant land is opportunity! Buy these plots and build your dream house! Construction workers will help you build the house you want.<br/><br/>Customers are coming! Negotiate and try to get the best offer. Try to deal with reputable clients. When the rent day comes, you have to go to the houses and collect the rent money from the tenants, but some customers may not pay the rent. However, if you have a bank account, the rent money will be deposited into your account. Don't forget to check regularly. If you have a problem with a tenant, you can contact a lawyer and sue or try to collect the rent money in other ways. You can even beat them up!<br/><br/><br/><br/><br/>News Centre You need to keep up with what's happening in the city. Neighbourhood factors affect rental prices. If a new school opens in the city, house rents in the neighbourhood may rise. Don't forget to look at newspaper adverts. You can get news about the city by talking to people. Go for a drink. Maybe it will help you to hear what is being said at the next table.<br/><br/><br/>After a tiring day, watch your favorite movie, relax and raise your relationship level with your partner.<br/><br/><br/>Can you drive a van? Go to the dealer in the city, buy the stuff and increase the value of the house you want to rent out. Be careful not to forget to take your lorry with you, the stuff is quite heavy.<br/><br/><br/>Entertainment: You deserve to have some fun too! Try to discover the venues in the city. In some places you will have fun and earn money at the same time.", "metacritic": null, "released": "2023-11-13", "tba": false, "updated": "2023-11-17T06:23:02", "background_image": "https://media.rawg.io/media/screenshots/dc1/dc1217955585df6fdd4d4911a4a4088a.jpg", "website": "https://estateagentsimulator.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 348, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kiki Games"], "genres": ["Simulation", "Indie"], "publishers": ["KIKI GAMES"], "esrb_rating": null}