{"id": 972193, "slug": "tau-cubis", "name": "Tau Cubis", "name_original": "Tau Cubis", "description": "<strong>They are coming !<br/>Discover the perfect strategies to fend off hordes of crazy robots!<br/><br/>Tau Cubis is a 3D Sci-Fi Tower Defense game, taking inspiration from the classic 'Defense Grid' with extra features (collaborative Towers, instant global targeting, truly autonomous enemies).<br/><br/>At first, choose a simple strategy to succeed in each Challenge. And maybe a different one to take the lead in the game's online rankings !</strong><h3>Smart Towers</h3><ul><li> Your Towers collaborate, buffing each other.<br/></li><li> Your Towers can be assigned a global priority target type in real time :<br/>Just one click for all Towers to specifically target the fastest enemy, or the one closest to the base, or ...<br/><br/><h3>\"Mazing\" Tower Defense game</h3></li><li> Each enemy is truly autonomous and there is no predefined path ! <br/></li><li> Your choices immediately modify the dynamic of the fight for the whole map.<h3>110+ challenges !</h3></li><li> Each map is playable in 4 to 8 Modes for more than 110 challenges ! <strong>Leaderboards</strong></li><li> Compare Your score to the best scores or just your Friends' through the Steam Leaderboards.<h3>Notes from me :)</h3></li><li> Please, keep in mind, Tau Cubis is a solo game development, is not story driven and does not feature cinematic.<br/></li><li> The more challenges you complete, the more Towers, Enemies and Maps you unlock.<br/></li><li> Tau Cubis is inspired by other games and especially the amazing franchise : Defense Grid.<br/></li><li> I'd like to offer you a minimalist strategic Tower Defense game with colorful graphics and smart mechanics :)<br/></li><li> Full Gamepad, Keyboard only, Mouse and Keyboard (FPS control or classic ) : your choice !<br/></li><li> Quick to learn, easy to play for intense 20 minute session.<br/></li><li> Online leaderboards, but you still can play offline and upload your scores later.<br/><br/>Don't hesitate for any questions or feedback at taucubis@cubemandarine.com or in Steam Discussion section !<br/><br/>https://store.steampowered.com/app/1001930/Tau_Cubis/</li></ul>", "metacritic": null, "released": "2023-11-12", "tba": false, "updated": "2023-11-17T06:33:38", "background_image": "https://media.rawg.io/media/screenshots/5d1/5d1a3d2603592e6e4f41579b9678c383.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Cube Mandarine"], "genres": ["Strategy"], "publishers": ["Cube Mandarine"], "esrb_rating": null}