{"id": 972188, "slug": "star-stone-splash", "name": "Star Stone Splash", "name_original": "Star Stone Splash", "description": "<strong>Simple operation, extremely addictive. All you need to do is click, click, click.</strong><br/><br/>《Star Stone Splash》 is an exciting elimination game that tests your reaction and observation skills.<br/><br/>In the game, players will face a grid chessboard that constantly generates rune stones. By clicking on the blank grid area, the player will eliminate the same type of stones that can be touched on the cross line. The more stones you eliminate each time, the more points you will score. At the same time, the eliminated stone fragments will be used for charging. When the charging is completed, you can click the skill button to cast the skill to eliminate a certain type of stone on the board, providing you with Lots of space.<br/><br/>Note that each click will also generate new stones. The newly generated small stones are not regarded as obstacles and will not affect the connection during elimination. When the new stone grows up once, it becomes an obstacle, and when it grows up a second time, it becomes a stone that can be eliminated. Every time you get a certain score in the game, the difficulty of the game will be upgraded, and new stones will be generated faster and faster.<br/><br/>Pay attention to the rhythm of clicking and try to eliminate more than two stones with each click. If your reflexes are excellent, you will have a pretty high position on the leaderboard.", "metacritic": null, "released": "2023-11-12", "tba": false, "updated": "2023-11-17T06:27:06", "background_image": "https://media.rawg.io/media/screenshots/496/496a26ac03d7902b2e669227037339e0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nimanggi Productions"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Nimanggi Productions"], "esrb_rating": null}