{"id": 972107, "slug": "gym-simulator-24", "name": "Gym Simulator 24", "name_original": "Gym Simulator 24", "description": "https://store.steampowered.com/app/2248760/Car_For_Sale_Simulator_2023<br/><br/>Key Features:<br/><br/>🏋️‍♂️ Clean and Customize Your Space: Start with a dingy gym and take the first step towards transforming it into a stunning fitness sanctuary. From wall colors to carpet patterns, the power to personalize every detail is in your hands.<br/><br/>💪 Diverse Array of Workout Equipment: While you'll begin with a limited selection of workout gear, you'll gradually enhance your gym with state-of-the-art equipment to cater to every client's needs. A wide range of exercise machines awaits your customization.<br/><br/>🥊 Boxing Arena and Betting Thrills: Elevate your gym to new heights by adding a boxing arena. Train athletes to become champions and enthrall audiences with thrilling matches. Open up betting opportunities to boost your earnings.<br/><br/><br/><br/><br/>🧖‍♀️ Luxurious Amenities: Elevate customer satisfaction by providing a touch of luxury with amenities like saunas and massage rooms. Deliver an unforgettable fitness experience to your clientele.<br/><br/>👗 Apparel Change Area: Create an apparel change area for clients seeking relaxation and rejuvenation post-workout. Offer the latest sportswear trends, making your gym a hub for both fitness and fashion.<br/><br/>Craft Your Dream Gym with Gym Simulator 24!<br/><br/><br/><br/><br/>Gym Simulator 24 breathes new life into the world of fitness simulation games. Build your empire, delight your clients, expand your revenue streams through additional services, and curate the finest fitness facility. The power to deliver an unparalleled fitness journey lies within your hands!", "metacritic": null, "released": "2023-11-10", "tba": false, "updated": "2023-12-15T21:02:53", "background_image": "https://media.rawg.io/media/screenshots/6d2/6d2a26c778c9ca896818981ffa1ed9a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 2, "achievements_count": 14, "ratings_count": 2, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Quatech"], "genres": ["Simulation", "Sports", "Indie"], "publishers": ["Red Axe Games"], "esrb_rating": null}