{"id": 972249, "slug": "saraman-union", "name": "Saraman Union", "name_original": "Saraman Union", "description": "* Story<br/>\r\nYou, a very ordinary traveling merchant, unexpectedly inherited land one day from your aristocratic uncle who passed away suddenly. Now, you have become the lord of that land. However, it was not a territory governed by humans, but a domain of the demon nation called Nova Roma Empire, known as the strongest on the continent! Moreover, the inheritance was not from an ordinary aristocrat but from Duke Saraman, one of the four major noble families of the empire. Without any time to be surprised by the abrupt transition from a human merchant to a great demon noble, the daily duties of being a duke swiftly approach.<br/>\n<br/>\r\n*Content<br/>\r\nTerritory Management x Strategy SLG<br/>\r\nAs a duke, your everyday life involves managing Saraman Duchy along with your subjects and citizens, while confronting threats from foreign nations. Besides the protagonist, there are various forces present on this continent: the vassals of Nova Roma Empire, human nations like Berlia Kingdom and Zorgusta Empire, Ice Sea Union in the north, the nomads and centaur tribes of the eastern great plains, and the elves guarding the sanctuary. This continent is far from peaceful with so many factions. Will you focus on military and technological advancements to conquer all other factions and achieve continental domination? Or will you leverage politics and diplomacy to forge alliances and protect peace from ambitious conquerors? It's all up to the player.<br/>\n<br/>\r\nHigh Freedom × Multiple Endings<br/>\r\nEvery character introduced has multiple potential endings. You have the option to elevate a girl to the esteemed position of a duchess or confine her in the basement as your sex slave. It's possible to marry a female character and even have affairs later on. Harem play is also available.<br/>\n<br/>\r\nOver Female Characters 20<br/>\r\nOver 50 H-Scenes", "metacritic": null, "released": "2023-11-14", "tba": false, "updated": "2023-11-17T07:49:22", "background_image": "https://media.rawg.io/media/screenshots/fd7/fd71d4bfa1e789446a00032e927807e1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 351, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PastureSoft"], "genres": ["Strategy"], "publishers": ["PastureSoft"], "esrb_rating": null}