{"id": 972297, "slug": "santa-world", "name": "Santa World", "name_original": "Santa World", "description": "Welcome to Santa World, the ultimate festive platformer game that immerses you in the enchanting world of Santa Claus. In this delightful adventure, you step into Santa's boots, dashing and leaping through a multitude of captivating levels adorned with thrilling obstacles and mischievous adversaries.<br/>\n<br/>\r\nSanta World transports the magic of the holiday season directly to your device, casting you as the guiding hand for Santa as he embarks on a journey from the enchanting North Pole to far-reaching realms. In your role as Santa, you must gather an array of presents while deftly navigating treacherous hazards such as menacing ice spikes, animated snowmen, and misbehaving elves.<br/>\n<br/>\r\nThis whimsical game boasts a visual spectacle of vivid and lively graphics, beautifully capturing the essence of the holiday season. Its charming and evocative holiday theme will instantly immerse you in the heartwarming spirit of Christmas. What's more, the controls are not only intuitive but also exceptionally user-friendly, ensuring that players of all ages can effortlessly dive into the world of Santa.<br/>\n<br/>\r\nWith a plethora of diverse levels to explore and an array of unique adversaries to conquer, Santa World offers a plethora of entertaining and challenging gameplay, guaranteeing hours of enjoyment. Whether you have a penchant for platformers or simply adore the holiday season, Santa World is a gaming gem that you absolutely cannot afford to miss. So, don your controller, and join Santa on a quest to save Christmas!<br/>\n<br/>\r\nKey Features of Santa World:<br/>\n<br/>\r\n🎅 - Four Enchanting Worlds: Traverse through four distinct and magical worlds - Santa's snowy realm, the mysterious Underground, the limitless Sky, and the scrumptious Candy world.<br/>\n<br/>\r\n🎁 - Ten Attempts: You have ten chances to conquer each level, adding an element of excitement and strategy to your gameplay.<br/>\n<br/>\r\n🛍️ - Skillful Shopping: Visit the in-game shop and acquire various skills that will empower Santa, enhancing his ability to overcome challenges and adversaries.<br/>\n<br/>\r\nJoin the festive adventure and help Santa Claus in his quest to save Christmas in this captivating platformer game, Santa World!", "metacritic": null, "released": "2023-11-15", "tba": false, "updated": "2023-11-17T09:00:21", "background_image": "https://media.rawg.io/media/screenshots/c43/c43f498e8c6292e742ee173340a42e40.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AFabrik"], "genres": ["Adventure", "Strategy", "Simulation", "Sports", "Casual", "Indie"], "publishers": ["AFabrik"], "esrb_rating": null}