{"id": 972250, "slug": "dream-knight-2", "name": "Dream Knight", "name_original": "Dream Knight", "description": "<h3>A story about this game</h3>       This is a fantasy world, thanks to rich minerals and powerful magic. This world used to be peaceful and prosperous, but somehow it was coveted by a different world that controlled the dark power. One day, the dark power that suddenly appeared destroyed the balance of the whole world. The scary thing about dark forces is that they devour life through dreams, no one can stay awake forever, and those who fall asleep will be drawn into the dream world, and those who are drawn into the dream can only survive this dangerous dream through fighting Survive, the winner will return to reality, and the loser will fall into a dream forever!<br/><br/>       More and more people are trapped in dreams and cannot return to reality. In order to save the world, the Fantasy Knights came into being. This is a team of people who have the ability to resist the erosion of dark forces. The special ability endowed them with the ability to freely enter the dream world, so they explored the truth of the dream world again and again, looking for ways to defeat the other world.<br/><br/><h3>Game features</h3><br/>This is an ACT+Roguelike game. The game combines the gameplay and style of classic arcade games. Players enter the dream world to fight again and again. The game will have the high replayability of Roguelike games and the refreshing combat experience of arcade games.<br/><br/>Every death is not meaningless. You can bring back some items from the dream to improve panel attributes or activate elf skills to make yourself stronger.<br/><br/>Every time you enter a level, it is a different experience, because the levels and wild monsters in the dream appear randomly, and clearing hidden levels can also bring you unexpected surprises.<br/><br/><h3>four heroes</h3><br/>There are a total of 4 heroes to choose from in the game. Their default weapons are Miao Dao, bow and arrow, battle axe, and lightning whip. The samurai protagonist can also unlock 3 new weapons, giving you more options in battle.<br/><br/><br/>", "metacritic": null, "released": "2023-11-14", "tba": false, "updated": "2023-11-17T07:50:38", "background_image": "https://media.rawg.io/media/screenshots/c8b/c8b2040c93ad3e7110b759f7640307e6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 237, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Starword Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Starword Games"], "esrb_rating": null}