{"id": 972246, "slug": "loco-sort", "name": "Loco-Sort", "name_original": "Loco-Sort", "description": "Loco-Sort is a puzzle-solving indie game, set in the railroads of the 1880s America. You are the unsung hero of the railroads, the yard engineer, that has the important goal of assembling trains.<br/><br/>Across 30 challenging levels spanning the wide variety of America's greatest landscapes: from the Grand Canyon to the Rocky Mountains, from Monument Valley to the Florida Keys. Play, during the railroads golden age, through forests, deserts, lakes, swamps, frontier towns and much more!<br/><br/><br/><br/>You control a small locomotive with the goal of coupling several railroad cars to a big locomotive across a maze of rail tracks and switches. Each car is numbered, and you have to couple them in ascending order: 1, 2, 3, 4, 5, etc. There are also secondary goals, like parking cars in a workshop or loading/unloading them in a factory or mine.<br/><br/><br/><br/>The challenge is to accomplish all your goals under a certain amount of time. It may vary from a few minutes to 15 minutes. In the very last minute, you have a chance to get some extra time.<br/><br/>But there is a lot more: get new locomotives, unlock paint jobs for them, upgrade their power and speed. While playing, use goodies that give special powers, turn the turntable around, light the locomotive's lantern to see into the darkness and even blow her steam whistle until your heart's content.<br/><br/>Are you ready to be the hero?<br/><br/><strong>Main Features:</strong><br/><ul><li>30 challenging levels + 3 tutorial levels<br/></li><li>9 playable locomotives<br/></li><li>7 paint jobs per locomotive<br/></li><li>10 types of interactive structures connected to the railroad<br/></li><li>21 types of railroad cars with several cargoes/liveries<br/></li><li>Functional lantern in 5 of the playable locomotives (useful for night/dusk levels)<br/></li><li>Functional whistle for all 9 playable locomotives (each one has her distinct whistle)<br/></li><li>Functional turntable<br/></li><li>Western/Country professional composed soundtrack with 132 songs<br/></li><li>30 achievements + 2 hidden achievements<br/></li><li>Quick Reference Guide in PDF</li></ul><br/><br/><br/>", "metacritic": null, "released": "2023-11-14", "tba": false, "updated": "2023-11-17T07:46:35", "background_image": "https://media.rawg.io/media/screenshots/d35/d358078e4f95c985990e1b545e36182f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 440, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Martins 14 Games"], "genres": ["Indie"], "publishers": ["Martins 14 Games"], "esrb_rating": null}