{"id": 972269, "slug": "nothing-is-forever", "name": "Nothing is Forever", "name_original": "Nothing is Forever", "description": "A bright young psychology student finds his dream job as a sexologist and has a great future ahead of him... until some inappropriate behavior throws everything out of the window. Now, plagued with regrets and self-doubt, he tries to start anew.<br/><br/>Amidst a group of friends old and new, and facing temptations and choices that could undo all the progress he has made, he will have to fight his inner demons and decide what kind of man he wants to be.<br/><br/>Enter the mind of a brilliant but troubled psychologist and determine how he will interact with the people around him, all the while using his psychological knowledge to understand the needs and kinks of potential love interests he finds along the away.<br/><br/>Possible partners include: an old friend with unresolved feelings, the bossy personal trainer from his gym, a painfully shy college girl who is hiding a secret desire… or the one girl that’s absolutely off-limits. Will he repeat the same mistakes of his past?<br/><br/><br/><ul><li>Every choice you make will shape the main character’s personality in four stats: Honor, Cunning, Sensitivity or Manliness.</li></ul><ul><li>Each girl will subconsciously give you hints about their sexual kinks. Use the hints to guess their kinks to unlock sexy scenes with them.</li></ul><ul><li>Use your personality points to acquire different Kink Skills. Your lewd scenes will be different depending on the skills you have. For example, in some scenes you can choose to be dominant or submissive.</li></ul><br/><br/><br/>", "metacritic": null, "released": "2023-11-14", "tba": false, "updated": "2023-11-17T08:19:13", "background_image": "https://media.rawg.io/media/screenshots/237/2371000c9745b60df8b250403cc1cdf3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 416, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Mad Silver Lab Games"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Mad Silver Lab Games"], "esrb_rating": null}