{"id": 972263, "slug": "ufo-robot-grendizer-the-feast-of-the-wolves-2", "name": "UFO ROBOT GRENDIZER – The Feast of the Wolves", "name_original": "UFO ROBOT GRENDIZER – The Feast of the Wolves", "description": "<strong>For the first time in video game history, climb aboard Grendizer the Legendary Robot and fight the forces of evil to defend our planet Earth! </strong><br/><br/>Get ready to experience an unforgettable adventure with Grendizer, the famous giant robot. This action/adventure game adapted from the cult animated series will immerse you in the heart of the universe of its creator, Go Nagai, and will give you the chance to pilot the most powerful robot and fight the forces of evil.<br/><br/>After Planet Fleed is destroyed by the Empire of Vega, Daisuke takes refuge on our planet. Taken in and adopted by Genzo Umon, he lives at the Shirakaba Farm. While Vega's invasion of Earth is imminent, Daisuke will defend the planet Earth with the help of Grendizer, the titanic robot hidden deep inside Genzo Umon's observatory. With the help of Kôji Kabuto, the prince of Planet Fleed will constantly repel Vegas' attacks and fight his terrible robots, the Monstronefs, which were sent to destroy him.<br/><br/>Play as Umon Daisuke and his colossal robot while fighting in epic battles with multiple gameplays: Piloting the Spazer (flying module where Grendizer is housed), vertical shoot-them-up in the Kôji Kabuto’s TFO, and 3rd person action/combat by controlling Grendizer. Use his iconic and devastating attacks to destroy the terrifying Monstronefs and save the earth.  <br/><br/>Find yourself in Umon Daisuke's shoes and meet many essential characters during dialog sequences in the iconic environments of the series, which was so diligently reproduced in accordance with the designs of the original series. <br/>And finally, earn experience points while completing missions to achieve new abilities and upgrade your powers.<br/><br/>Broadcasted for over 40 years, the cult animated series Grendizer has marked several generations with its history, which is so rich in twists and turns. Million people around the world still remember his metamorphoses and lightning fists. <br/><br/><strong><h3>FEATURES</h3></strong><br/><ul><li>For the very first time, play as Grendizer and Umon Daisuke in this action/adventure game, which is all about the metal colossus. <br/></li><li>Execute and improve the famous must-have attacks of the giant robot<br/></li><li>Find all the characters, iconic places, and enemies of the TV series.<br/></li><li>A new gaming experience is offered to you in multiple game phases: Action/Brawler, 3rd person Shooter, Shoot Them Up and Exploration.<br/></li><li>Rediscover the iconic themes of the animated series, reimagined by <strong>Marcin Przybyłowicz</strong> (The Witcher 3: Wild Hunt) and <strong>Magda Urbańska</strong> (Gwent: Rouge Mage).</li></ul>", "metacritic": null, "released": "2023-11-14", "tba": false, "updated": "2023-11-17T08:07:59", "background_image": "https://media.rawg.io/media/screenshots/01b/01b136d8ff12f499503256a0923a7316.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ENDROAD"], "genres": ["Action", "Adventure"], "publishers": ["Microids"], "esrb_rating": null}