{"id": 972210, "slug": "minigame-madness-3", "name": "Minigame Madness", "name_original": "Minigame Madness", "description": "<strong>Minigame Madness</strong> is a frantic multiplayer party game where you compete against friends and strangers in a massive, ever-growing collection of unique free-for-all minigames to earn awesome loot and shiny badges!<h3>KEY FEATURES</h3><ul><li>Massive, ever-growing collection of fun and unique free-for-all minigames!<br/></li><li>Back-to-back minigames in Arcade, last-man-standing in Royale, and co-op in Teams!<br/></li><li>First- and third-person gameplay with keyboard and controller support!<br/></li><li>Customizable player avatar with unlockable faces, clothes, accessories and more!<br/></li><li>Daily challenges, global leaderboards, achievements and badges!<br/></li><li>Detailed gameplay statistics to track and compare with friends!<br/></li><li>Players vote which minigame is played before each round starts!<br/></li><li>Custom private servers with personalized minigame playlists!<br/></li><li>Frequent updates with new content and features from two very involved devs!</li></ul><br/><br/><h3>THE MINIGAME MEGA-LIST</h3>A massive, ever-growing collection of frantic free-for-all minigames! Knock friends into the abyss in Sumo Shamble, dodge hundreds of giant bullets in Blazing Bullets, and pass the bomb in Explosive Exchange. New minigames of all types and genres will be added regularly!<h3>PLAY HOW YOU WANT</h3>Play casual minigames back-to-back in Arcade, be the last one standing in Royale, or join forces with your friends in Teams! Designed to be played with up to 16 players online, or solo with bots! Experience the madness in first- or third-person mode, with keyboard or controller.<h3>PERSONALIZE YOUR MUB</h3>Earn coins by playing, get gems by winning! Coins can be spent to randomly unlock awesome faces and stylish clothes; while gems can be used to design the Mub of your dreams! Finish the daily challenge to spin the Wheel of Madness and win epic capes, cute pets and more!<h3>UNLOCK ALL ACHIEVEMENTS</h3>Numerous challenging achievements to unlock, shiny badges to earn and cool statistics to showcase on your customizable player profile. Compare with friends to see who's the best, and check your ranking for each minigame daily on the global leaderboards!<br/><br/><h3>VOTE ON MINIGAMES</h3>All players get the chance to vote for one of three minigames before each round begins. The three options are randomly picked based on worldwide popularity of the minigames and the players in the server. The minigame with the most votes gets played!<h3>HOST PRIVATE SERVERS</h3>Official servers are hosted by us all around the world, but you can also host your own private gameroom just for you and your friends. Customize the madness in your server to taste by creating a personalized playlist containing only your favorite minigames!<h3>OUR FOREVER-GAME</h3>We plan to continue expanding Minigame Madness in content and features indefinitely. We even have some crazy luxury ideas, including 16+ player support, competitive single-player bots, new modes like Ranked with skill-based matchmaking and reaching 100+ minigames!<br/><br/><strong>The growing scope may cause the price to increase in the future, but once purchased you will always have access to Minigame Madness. Excited to have you along for the ride!</strong><br/><br/>https://store.steampowered.com/app/1408080/Minigame_Madness<br/><br/>More Madness? Check out these awesome games we're often compared to:<br/>Fall Guys, Stumble Guys, Crab Game, Roblox (Minigames), Minecraft (Hypixel &amp; Mineplex) &amp; Pummel Party. Have fun!", "metacritic": null, "released": "2023-11-13", "tba": false, "updated": "2023-11-17T06:56:21", "background_image": "https://media.rawg.io/media/screenshots/031/031b464f3811d55fc49c3e5e9a4a660f.jpg", "website": "https://minigamemadness.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 231, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chaotic Entertainment"], "genres": ["Action", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["Chaotic Entertainment"], "esrb_rating": null}