{"id": 97227, "slug": "dopple-trouble", "name": "Dopple Trouble", "name_original": "Dopple Trouble", "description": "<p>Take control of a doppelganger mimicking human form during the day to infiltrate a city and devour isolated victims. <br/>At night, your true nature and strength is revealed and you have to defend your hideout from invading monsters! <br/><br/>The game progresses a bit more each day ( the city guards react to your crime and increases security). More and fiercer monsters come to challenge you every night. <br/><br/>Game, art and Sfx by me. <br/>The music under CC license used in the game was made by \"Lately kind of yeah\" (was not made for this jam) <br/>(http://freemusicarchive.org/music/Lately_Kind_of_Yeah/) <br/><br/>&lt;- -&gt; to move <br/>infiltration phase: <br/>up and down to take stairs. \"C\" to eat people ( make sure you're not in the same room as other humans!) <br/><br/>defend phase: <br/>\"x\" to jump. \"C\" to attack <br/><br/>Can you become the new king of the land? <br/>Can you find and defeat the terrible Gazer? <br/>Can you get a really hi-score and tell me how much it is? <br/>Such questions can only be answered in... DOPPEL TROUBLE! *theme music starts* <br/><br/>content: <br/>- 4 endings <br/>- 8 enemy types ( 4 humans, 4 monsters) and an extra boss monster for a bonus challenge. <br/>- level up points depending on how many people you ate to upgrade your doppelganger. <br/>- possibility to keep going without activating the ending to get a better hi-score (game keeps getting harder). </p>", "metacritic": null, "released": "2016-04-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/145/14506b59d09b7356640d0fef485735de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["brobbeh"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}