{"id": 972200, "slug": "phantom-thief-sylphy-2-the-collector", "name": "Phantom Thief Sylphy 2 - The Collector", "name_original": "Phantom Thief Sylphy 2 - The Collector", "description": "In this long awaited sequel to Phantom Thief Sylphy, our busty bespectacled phantom thief finds herself trapped in the realm of a demon known as <br/>The Collector. <br/>She is tasked with conquering 4 scenarios designed to appeal to her baser instincts and corrupt her.<br/>Can she beat his challenge and escape, or will she succumb to the sweet torment he offers. You decide!<br/><br/><strong><h3>Features</h3></strong><ul><li>A simple and fun erotic game.<br/></li><li>A hardcore story filled with delightful downalls.<br/></li><li>A variety of lewd animations made with Live2d.<br/></li><li>A bunch of fun minigames, from a rhythm game to dance naked in a club, to mashing to squish man's head between thicc thighs.<br/></li><li>Each scenario has it's own varied gameplay style, and sylphy dons different outfits in each.<br/></li><li>Multiple endings, based on how much Sylphy indulged herself and a few choices made during gameplay.<br/></li><li> Casual Difficulty - sylphy is returned to the hub if she triggers a bad ending in any of the scenarios, free to try again. it takes a lot to trigger the main bad ending</li></ul><br/><br/>The 4 scenario's Sylphy needs to conquer are as follows;<br/>The temple of lust - a stone temple dedicated to the minotaur from the first game, filled with lewd traps, cultists, and puzzles to solve for Sylphy to succeed.<br/><br/>The office - Sylphy finds herself in an office building, she has to find a way down into the basement and discover what secrets lie there.<br/><br/>The PussyCat Club - Sylphy is a debt slave in a cyberpunk strip club, she has to dance, seduce, and satisfy her way to freedom.<br/><br/>The RPG - Sylphy stars as a witch and gets to wipe out a goblin cave in a simple rpg roguelite.<br/><br/><br/><br/><br/>Expected playthrough time - 2 hours.", "metacritic": null, "released": "2023-11-13", "tba": false, "updated": "2023-11-17T06:42:35", "background_image": "https://media.rawg.io/media/screenshots/f1f/f1f1b13ea50e1a4026b59d15b4712513.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 256, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Azurezero"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Azurezero"], "esrb_rating": null}