{"id": 972357, "slug": "lucky-hero", "name": "Lucky Hero", "name_original": "Lucky Hero", "description": "Lucky Hero: A Fantasy Adventure Weaving Wisdom, Exploration, and Strategy! <br/><br/>Welcome to the world of \"Lucky Hero\"! This is a deckbuilder game that perfectly combines roguelike adventures and strategy. Engage in battles with a variety of enemies by spinning the wheel of fortune, collecting, and combining various symbols and skills!<br/><br/><br/><br/><strong>Character：</strong><br/>3 distinct characters: the hefty Warrior, the elusive Assassin, and the enigmatic Summoner, offering varied gameplay experiences.<br/><br/><br/><br/><br/><strong>Symbol：</strong><br/>Over 300 enigmatic symbols are to be collected. By purchasing and deleting them, you build your strategies against enemies.<br/><br/><br/><br/><strong>Skill:</strong><br/>Over 30 active &amp; passive skills. When matched with appropriate symbols, skills leads to different builds.<br/><br/><strong>Enemy:</strong><br/>Unique enemies and Bosses with diverse abilities are to be challenged! They will relentlessly assail you. Some may hinder you in ways you are unable to expect. Observe, study, then beat them with your wisdom.<br/><br/><br/><br/><strong>Area Effect:</strong><br/>Over 10 effects for different areas provide unique experiences for every run! Some positive area effects may lead to a less bumpy road, but a negative area effect often has rewards in store for the brave The decision is in your hands.<br/><br/><strong>Random Event:</strong><br/>The game teems with random events, providing a plethora of surprises and unforeseen developments. Will you stumble upon overnight riches or get stripped to bare bones? Are you daring enough to take a punt?<br/><br/>Navigate your journey with deliberation, collect gold, strategize your builds, vanquish formidable enemies, and liberate your kingdom! <br/><br/>", "metacritic": null, "released": "2023-11-16", "tba": false, "updated": "2023-11-17T10:29:12", "background_image": "https://media.rawg.io/media/screenshots/131/131efaf1d53e17323e73dcccd95e831f.jpg", "website": "https://nlentmt.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["mora churrasco studio"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Neverland Entertainment"], "esrb_rating": null}