{"id": 972319, "slug": "night-pact-azuru", "name": "Night Pact: Azuru", "name_original": "Night Pact: Azuru", "description": "\"Night Pact: Azuru\" is an adventure with action and exploration elements, along with puzzles. In this game, you assume the role of Jack Alestrad, an aging private investigator who, somehow, has found himself working for the local mafia.<br/><br/>The latest assignment appeared simple at first, but it quickly leads you to places where success demands both sharpshooting and clever thinking. These challenges are essential as you venture deeper into the heart of the cult.<h3>Explore the environment</h3>Investigate and interact with various objects to unveil the suspicious secrets held by this group of cultists. You'll also discover supplies that are crucial for your survival.<br/><h3>Make your way</h3>The cult won't let you uncover its secrets easily, but your revolver has something to say about it. Take careful aim before shooting to preserve your limited supply of cartridges.<br/><h3>Not everyone wants to kill you</h3>Along your perilous journey, you will also encounter characters you can engage in conversation with. Choose your words wisely, as they might provide valuable information.<br/><h3>Use your wits</h3>Don't overlook any details while investigating your surroundings. What you need to solve the various puzzles that will arise on your path might be hidden in plain sight.<br/><h3>Every body needs a mind</h3>Venturing into the darkness and uncovering hidden truths comes at a cost. Keep a close eye on your mental stability, as it could lead to your downfall in the face of adversaries. Fortunately for Jack, he has his own means to remain composed...<br/>", "metacritic": null, "released": "2023-11-15", "tba": false, "updated": "2023-11-17T09:32:36", "background_image": "https://media.rawg.io/media/screenshots/67e/67e6e21da0aea4e38089536b45e4326b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Víctor Córcoles"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Víctor Córcoles"], "esrb_rating": null}