{"id": 972353, "slug": "edge-of-dead-under-a-uranium-sky", "name": "Edge Of Dead: Under A Uranium Sky", "name_original": "Edge Of Dead: Under A Uranium Sky", "description": "<ul><li>Pickup and throw the furniture or grenades.<br/></li><li>Unique weapons like the Porcupine Shotgun.<br/></li><li>Secondary items such as shields and shoulder cannons.<br/></li><li>Backpack items. Power-ups when you need them.<br/></li><li>A shop and vending machines.<br/></li><li>Unique enemies. Fight a nest of bone spiders, a walking cactus and more.<br/></li><li>A newly generated level every run.</li></ul><br/><br/>There heaps of weapons waiting to be found. Take out sentry bots with an anti armor gun. Cause chaos with explosive crossbow bolts. Light up enemies with the Navy Laser, or go old school with a revolver. Slice away with a katana, crush bone spiders with a skull club, or bash robots with a wrench. Shotgun your way through infected insects. Snipe from a distance or get in close with an industrial saw.<br/><br/><br/>Block and deflect incoming projectiles with shields. Activate shoulder firing support drones or deploy automated sentries while you lob explosives at attackers. Stop enemies cold with a freeze grenade, then destroy them with fire. Power up your weapon and more.<br/><br/><br/>Pickup food and medical supplies along your journey. Activate cybernetic implants. Run faster with Injection 9 a prewar drug developed for soldiers. Desperate for health? Take a chance on rancid meat, or a radioactive pepper. Increase your health but decrease your accuracy with Wild Fire Wine. Tons of backpack items lay scattered throughout the system.<br/><br/><br/>Stranded onboard a stricken ore freighter and adrift in the outer reaches of the Dorado star system you and your crew mates listen to chaotic reports of a giant alien invasion. Armies of creatures and machines descend from orbiting alien carriers to the unsuspecting worlds below. One after another the worlds of the Dorado system fall silent. Who is this enemy? What happened to the people of an entire star system? It’s up to you to find out. Choose a crew member, grab a weapon, and prepare for chaos in Edge Of Dead: Under A Uranium Sky!", "metacritic": null, "released": "2023-11-16", "tba": false, "updated": "2023-11-17T10:22:48", "background_image": "https://media.rawg.io/media/screenshots/838/8385a5fe24d7ca3409191502002eac1d.jpg", "website": "http://infernomuse.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Inferno Muse Interactive"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Inferno Muse Interactive"], "esrb_rating": null}