{"id": 972413, "slug": "frayspace", "name": "Frayspace", "name_original": "Frayspace", "description": "Frayspace is a fast-paced and physics-based space arena fighting game where you battle in fully destructible maps. You have several fighter ships to choose from and a wide range of weapons at your disposal to destroy your enemies. The arenas have unique environmental hazards which add more excitement to the battles.<br/><h3>The fast-paced action is easy to pick up</h3>But mastering it requires skill. You can choose to challenge your friends to all-vs-all combat or fight in teams in multiple game modes – deathmatch, last man standing, capture the flag and conquest. The AI players offer quite a challenge too! <br/><h3>Split-screen and shared screen local multiplayer</h3>All game modes are playable in split-screen with up to 4 players, but the chaos deathmatch mode allow up to 8 players to join the fight on a shared screen. Frayspace supports Steam Remote Play, so remote matches are an option too!<br/><br/><h3>Mechanics</h3>Each fighter ship has unique specs including health, shield, speed, and weapon damage. They are equipped with an active shield that can block enemy attacks but timing is everything, as its effective use depends on using it at the right moment. The weapons inflict distinct damage to both health and shield of the fighters. Choose your weapon wisely, as the shield halves the damage inflicted to health. You can find many kinds of power-ups like time control, the shockwave and the nuke in the maps and use them to your advantage.<br/><h3>Key Features:</h3><ul><li>Fast-paced player-vs-player twin-stick battles<br/></li><li>Local multiplayer: split-screen for 4 and a shared screen Chaos deathmatch mode for 8<br/></li><li>Physics-based fighter ship controls<br/></li><li>Fully destructible maps reshape as the combat goes on<br/></li><li>Nine fighter ships with active shield mechanics<br/></li><li>A bunch of weapons from spitfire to lasers, bombs, and seek'n'destroy<br/></li><li>Power-ups like time control, shockwave, and the melter<br/></li><li>Game modes: deathmatch, last man standing, capture the flag and conquest<br/></li><li>Modifiable settings, such as damage, friendly fire, and respawn time</li></ul><br/>Music by Alexey Kasyanchuk (DEgITx) (CC license)<br/>", "metacritic": null, "released": "2023-11-17", "tba": false, "updated": "2023-11-20T02:24:44", "background_image": "https://media.rawg.io/media/screenshots/65d/65d0e74c1f0a2cce20b1e7008199132c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 509, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["MTTHKL"], "genres": ["Action", "Casual", "Indie"], "publishers": ["MTTHKL"], "esrb_rating": null}