{"id": 972419, "slug": "my-douchey-boss-has-a-gentle-twin-brother-bl-visua", "name": "My Douchey Boss Has a Gentle Twin Brother?! - BL Visual Novel", "name_original": "My Douchey Boss Has a Gentle Twin Brother?! - BL Visual Novel", "description": "When Kyle gets a new job at a fashion company, he meets Vincent Zircon, who happens to be his eccentric boss. Vincent, being quite mischievous, often teases the newcomer, Kyle, causing him to think that his boss is odd. One day, he bumps into his boss after work and is surprised when his superior acts kind and gentle, even offering to buy lunch for him. Kyle starts to wonder if his boss is messing with him again. But after confronting the man about his change in behavior, Kyle realizes that the kind and gentle version of Vincent is actually someone else. Someone named Vernon Zircon, Vincent's twin brother. <br/>As Kyle gets closer to the twin brothers, he finds out that they are estranged. The two are very different individuals with different values, making it hard for them to get along. So what will happen when they both start to develop feelings for the same person...?<br/><br/><br/><br/><br/>The character you are playing as. Kyle is an average employee who just wants a normal job and a normal life. <br/><br/><br/>Vincent is outgoing and playful, but he's serious when it comes to his job. He works hard to maintain his fashion company. He has a bad habit of lashing out at people when he's feeling stressed. Vincent doesn't like relationships within the office. He especially dislikes it if an employee has a crush on him. Due to his busy schedule, he hasn't gotten the time to relax and go out with someone.<br/><br/><br/>Vernon is gentle and considerate of others. After his father retired, Vernon took over the business. Although he is talented when it comes to his job, he isn't passionate about it. Since he feel like his life is empty, he tends to visit a café to escape from it all. Being a CEO of a company, Vernon feels as though he doesn't have a genuine connection with anyone. He just wants a real friend.<br/><br/><br/><br/>- Around 30K Words (2-3 Hours Playtime)<br/>- 3 Endings (Neutral Ending, Vincent's Ending, Vernon's Ending)", "metacritic": null, "released": "2023-11-16", "tba": false, "updated": "2023-11-20T02:32:11", "background_image": "https://media.rawg.io/media/screenshots/0b4/0b4dadb346558f66b0bd1156415f74e8.jpg", "website": "https://chanimk19.wixsite.com/chanimk", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 3, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["ChaniMK"], "genres": ["Simulation", "Indie"], "publishers": ["ChaniMK"], "esrb_rating": null}