{"id": 972551, "slug": "the-dark-survivors", "name": "The Dark Survivors", "name_original": "The Dark Survivors", "description": "This game combines survival, Diablo-like elements and randomness in a rogue-lite experience where players take on the role of survivors with various talents who use different weapons and abilities to fight off hordes of monsters. Players can permanently keep the equipment they gather to build their own unique loadouts and ultimately eliminate all enemies lurking in the darkness.<br/>QQGroup NO.:859674086<br/><ul><li>The Dark Survivors is a casual RPG game that combines gothic horror and roguelike elements. By defeating the demons in the dark dungeon again and again to obtain more powerful equipment, you can make yourself stronger and fearless even in the midst of monsters.</li></ul><ul><li>In the game, players experience monster hunting and survival in the dark, build their own equipment combinations, and create the strongest BD.</li></ul> <ul><li>In the game, each scene experience of the player is randomly generated. Every time the player starts the game again, the character they build can gain a new experience. You can find hidden equipment and unique stylish moves in various randomly generated scenes.</li></ul><ul><li>The game is currently in the early access stage, and I will gradually improve the game by fixing bugs, adding more content and gameplay over a long period of time. Thank you for your support! I will work hard to make the game better.</li></ul><br/>This game supports mouse and keyboard.", "metacritic": null, "released": "2023-11-21", "tba": false, "updated": "2023-11-24T05:58:32", "background_image": "https://media.rawg.io/media/screenshots/006/006fc4a7fd772b3a05c2374f17e2de24.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ByDesignk"], "genres": ["RPG", "Indie"], "publishers": ["ByDesignk"], "esrb_rating": null}