{"id": 972548, "slug": "how-i-learned-to-stop-worrying-and-enjoy-the-end-o", "name": "How I Learned to Stop Worrying and Enjoy the End of the World", "name_original": "How I Learned to Stop Worrying and Enjoy the End of the World", "description": "My game is a turn-based RPG Maker game where the Saturn-worshipping Rich Ruling-Elite unleash military, hospital personnel, government agencies and hordes of Saturnalian Monsters onto the Earth for the purpose of eradicating the poor, huddled masses and it is up to you to survive this hilarious adventure?<br/>\n<br/>\r\nStop worrying, enjoy the \"end of the world\"!<br/>\n<br/>\r\nHILTSWAETEOTW employs a survival-horror inspired turn-based combat system. Use your guns until your enemies display enough damage to cue you into switching over to melee weapons and take them down without using too much ammo. You'll need that ammo for the sick bosses that populate the world. Better yet? Avoid enemies and save as much as ammo as you can for bosses!<br/>\n<br/>\r\nHave \"angels\" unlock your hidden human potentials. (Chakra System) <br/>\n<br/>\r\nEnjoy a traumatic yet, hilarious story about the few poor people smart enough to take on the rich and their world dominating agenda. The humor is perfect for anyone who enjoys adult cartoons. Take on the evil Gil Bates and his secret society of inbred rich misfits to restore some semblance of peace in the world. <br/>\n<br/>\r\nFoods and drugs affect the body in both positive and negative ways, explore which work best for you.  <br/>\n<br/>\r\nSave the kids from torture then turn them loose onto the world to make it better place! Hint: Save the kids! <br/>\n<br/>\r\nFinish your path down the dreaded \"Spirit Journey\" in the \"3d\" realm so you don't have to reincarnate again. Meet God and have God smack you across the effing head! Enjoy multiple endings depending on your choices!", "metacritic": null, "released": "2023-11-22", "tba": false, "updated": "2023-11-24T05:54:37", "background_image": "https://media.rawg.io/media/screenshots/df3/df37ba7529252d0fd5c201c758717b93.jpg", "website": "https://psagames.wixsite.com/games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PSA Games", "Brandon S. Truster"], "genres": ["RPG"], "publishers": ["PSA Games"], "esrb_rating": null}