{"id": 972563, "slug": "new-earth-2", "name": "New Earth", "name_original": "New Earth", "description": "<strong>Story Plot:</strong> In <strong>2121</strong>, interstellar travel isn't a problem anymore. A group of friends won a prize to travel to <strong>Kepler-452</strong> star system. But right before they could go back to <strong>Earth</strong>, they received a transmission that <strong>Earth</strong> had just been destroyed by a worldwide cataclysm. They had to land on <strong>Kepler-452b</strong>, a habitable planet. You are the leader in this story. Your mission is to help everyone start a new life and populate <strong>New Earth</strong>. Depending on how you play, you can have a happy ending (<strong>Harem Ending</strong>), a neutral ending (<strong>Sharing Ending</strong>) or a sad ending (<strong>Netorare Ending</strong>). As for <strong>BDSM</strong> &amp; <strong>Pregnancy</strong>, these kinks are also avoidable like <strong>NTR</strong> (<strong>Netorare</strong>).<br/><br/><strong>New Earth</strong> is an <strong>Erotic Visual Novel</strong> (<strong>Eroge</strong>) with multiple routes and multiple endings:<br/><ul><li>If you hate <strong>NTR</strong> (<strong>Netorare</strong>), you only need to be a model leader.<br/></li><li>If you're okay with sharing and swinging couples, you can let the other guys have fun with your women.<br/></li><li>But if you let everything get out of your control, you'll lose everything!</li></ul><br/><strong>Notice:</strong><br/><ul><li><strong>NTR</strong> (<strong>Netorare</strong>), <strong>Pregnancy</strong> &amp; <strong>BDSM</strong> are avoidable by making choices in game.<br/></li><li>If you can't have the endings you want, please use the walkthroughs: one with preview images (you will be able to know how to reach the scenes you want faster) or one without preview images (it won't spoil the story). The walkthroughs are in the game folder. The default location on Windows is: C:\\Program Files (x86)\\Steam\\steamapps\\common\\New Earth.<br/></li><li>At the moment, I'm working to improve the animations in <strong>New Earth</strong>. Around <strong>Summer of 2024</strong>, I will release a new version with better animations.</li></ul><br/><strong>New Earth</strong> is an <strong>Erotic Visual Novel</strong> (<strong>Eroge</strong>) so it contains a lot of erotic scenes. There are more than 13,000 images (including more than 250 erotic animations). Depending on how you play, the game length will be around 4-5 hours.<br/><br/>Thank you for playing <strong>New Earth</strong>.<br/><br/>I'm very appreciative of your feedback after playing so I can make it better in my future projects.<br/><br/>Regards!", "metacritic": null, "released": "2023-11-20", "tba": false, "updated": "2023-11-24T06:14:40", "background_image": "https://media.rawg.io/media/screenshots/ce4/ce46a11c2d4559919313630359c7d537.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 387, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["MiZtyl"], "genres": ["Indie"], "publishers": ["Corn Pop Games"], "esrb_rating": null}