{"id": 972598, "slug": "oxytone", "name": "Oxytone", "name_original": "Oxytone", "description": "<h3>Oxytone</h3>Are you ready for a unique adventure like no other? Oxytone invites you to explore the depths of your mind while offering a tranquil escape from the hustle and bustle of everyday life for those seeking relaxation. For more determined players, there are 99 challenges, colorful themes to unlock, and 12 meticulously designed maps. Oxytone is the ultimate puzzle game, equally easy to learn and challenging to master.<h3>How to Play</h3>Strive for the highest scores by creating the longest paths and achieving impressive combinations. Every move matters, and success depends on strategy and planning. You can discard tiles that don't fit your plan, but this reduces your pool of available tiles. To refresh it, you must fill tiles by guiding paths through them six times, deepening the mechanics further.<br/><br/><h3>Sound</h3>Sound is an integral part of Oxytone, so I recommend playing with headphones. This will immerse you even deeper into the game. The sound design has been crafted with great care to create a unique and relaxing atmosphere, yet it can also deliver powerful moments when needed.<h3>Free Demo</h3>The game originated as a prototype in early 2023, winning a competition organized by Opera GX. To date, over 150,000 players have experienced the prototype, which featured only 2 levels. Naturally, the next step was to make the demo even more captivating. I am convinced that for many players, the demo version will provide hours of enjoyment. However, for those seeking a more challenging experience, the full version awaits, scheduled for release this year (2023). The demo will also be available after the festival and game launch.<br/><br/><h3>In Short, For Those Who Dislike Paragraphs</h3><ul><li>Relaxation Mode For Players Who Just Want to Play<br/></li><li>99 Challenges For Players Seeking Challenges<br/></li><li>Unlockable themes By Completing Challenges<br/></li><li>12 maps in 4 thematic groups, each carefully designed for a unique experience<br/></li><li>Easy to learn, hard to master</li></ul>", "metacritic": null, "released": "2023-11-22", "tba": false, "updated": "2023-11-24T06:58:11", "background_image": "https://media.rawg.io/media/screenshots/ccd/ccddddca6fa3f1b6dc35349ea02b3030.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["OxGames"], "genres": ["Strategy", "Indie"], "publishers": ["OxGames"], "esrb_rating": null}