{"id": 972582, "slug": "supermarket-security-simulator", "name": "Supermarket Security Simulator", "name_original": "Supermarket Security Simulator", "description": "<strong>Welcome to your first day of work</strong> at our supermarket.<br/>I know this is your first time working security so listen up. <br/><br/><strong>As security you will have to:</strong><br/>Keep an eye on people so they don't steal, which entails searching old ladies, keep an eye out for gypsies (and not so gypsies) stealing from you.<br/>If a thief tries to flee, don't be afraid to hit him with the truncheon or electrocute him with the taser.<br/>Check the ticket and if he has something he didn't buy you handcuff him and put him in the dungeon. <br/>Check the security cameras, which will alert you if they detect someone stealing. They are shitty and sometimes fail, you will have to hit them with the broom to fix them... <br/>Watch out for the trolleys, the old ladies are trying to take them home.<br/>Kids are bastards... Some of them come to eat whatever they want and then they leave the packages empty.<br/>They often come to rob the supermarket, so be alert and when you see a robber you neutralize him with a punch.<br/>You will also have to work at night so don't be afraid and if some robbers come you can shoot them.<br/><br/><strong>As for the work as such:</strong><br/>The supermarket manager will keep an eye on you, so be careful what you do.<br/>At the end of your day you will have to give a report on how your day went so work hard and you will earn more money, shit and you will earn less.<br/>Manage your money well to keep your family happy and be careful with the decisions you take, lest your wife or child die...<br/>Get improvements for your job<br/><br/>Well, as you can see, this job is not difficult, whoever makes a fool of you, slap him with an open hand and that's it.<br/><br/>Back to work, Team Leader to the top!", "metacritic": null, "released": "2023-11-20", "tba": false, "updated": "2023-11-24T06:39:12", "background_image": "https://media.rawg.io/media/screenshots/e68/e680c5b6a645e4301cbe99c848241cdc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 389, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pigeon-G"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["Pigeon-G"], "esrb_rating": "Adults Only"}