{"id": 972575, "slug": "shadows-of-revenge", "name": "Shadows of Revenge", "name_original": "Shadows of Revenge", "description": "Enter the shadowy realm of \"Shadows of Revenge,\" a gripping roguelike deckbuilding game set in the treacherous mafia underworld of Manhattan. Assume the role of a disgraced family boss, driven by the thirst for power and redemption, as you engage in intense neighborhood-by-neighborhood combat, plan daring heists, and fend off rival mafia families seeking to reclaim their territories. Craft a cunning deck of loyal gang members, navigate through a city tainted by corruption, and decide the fate of your family in this strategic, blood-soaked journey to rule the mafia realm.<h3>Overview</h3><br/>Shadows of Revenge puts you into the sinister heart of a mafia-dominated Manhattan. As the boss of a once-proud family now fallen into disgrace, your journey to reclaim the city will test your wit, resourcefulness and determination.<h3>Key Features</h3><br/><ul><li><strong>Deck Building:</strong> Craft a lethal deck of unique cards, each representing a key member of your \"famiglia\" or a weapon. Utilize their distinct abilities to gain an edge in intense turn-based battles.<br/><br/></li><li><strong>Map Strategy and Domination:</strong> Strategize your takeover of Manhattan's neighborhoods, engaging in tactical combat per territory. Survey the city map, plan your moves, and dominate rival mafia factions to extend your influence.<br/><br/></li><li><strong>Heists:</strong> Dive into the clandestine world of heists, where story-based missions can elevate your resources or plunge you into ruin. Give your cards unique combination of resources specifically for these missions.<br/><br/></li><li><strong>Run Businesses and Earn Money:</strong> Establish and manage businesses in conquered neighborhoods to generate revenue and expand your criminal empire. Invest wisely and ensure a steady flow of income to support your revenge.<br/><br/></li><li><strong>Defend Conquered Neighborhoods:</strong> Be aware that after you conquer a territory, \"they\" will want to get it back.<br/><br/></li><li><strong>Replayability:</strong> We're working our best to give you unlimited replayability. The map changes every run you play and your strategy should adapt to it.</li></ul>", "metacritic": null, "released": "2023-11-20", "tba": false, "updated": "2023-11-24T06:28:58", "background_image": "https://media.rawg.io/media/screenshots/778/7787166c0504db13606241d3331a3924.jpg", "website": "https://shadowsofrevenge.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bedrock Fungi Games"], "genres": ["Strategy"], "publishers": ["Bedrock Fungi Games"], "esrb_rating": null}