{"id": 972603, "slug": "japanese-style-tien-gow", "name": "Japanese Style Tien Gow", "name_original": "Japanese Style Tien Gow", "description": "Introducing \"Tien Gow,\" a game played by four players using Tien Gow tiles. Known in the Chinese-speaking world as a traditional game that combines the aspects of \"Daifugo\" or \"Poker,\" it offers enjoyment through luck and strategic moves.<br/><br/>We've made the game \"Tien Gow\" more accessible, presenting the \"Japanese-style Tien Gow!\"<h3>Simple Rule Explanation:</h3>Each player is dealt eight tiles, and in a counterclockwise direction starting from the dealer, all four players take turns playing tiles. The player who plays the strongest tile gains the right to play first in the next round, and this continues until all tiles are played. The player who played the strongest tile in the last round wins the game!<br/><br/>Although this explanation may seem simple, there are some rules, such as the possibility of playing up to four tiles at once, the existence of tile combinations that form the strongest set, and more.<br/><br/>Even if you think, \"this seems a bit complicated...\" - no worries! We've equipped the game with a comprehensive tutorial that covers basic strategies and how to play. Even if you know nothing about Tien Gow, you can play while learning the rules step by step.<br/><br/>Additionally, during play, there is a tile strength guide feature that allows you to check the strength of tiles at any time. Even when you're unsure whether the tiles on the table are strong or weak, you can grasp the strength of your tiles and the tiles on the table while playing.<h3>Features for Enjoyable Gameplay:</h3><br/><ul><li>Various functions are provided for your enjoyment even after you have learned how to play in the tutorial<br/></li><li>Various AI personalities as opponents<br/></li><li>Statistical recording of gameplay, with the ability to view aggregate results<br/></li><li>Features customizable rules, aligned with Mahjong, such as \"Quarter Game(4G),\" \"Half Game(8G),\" \"Full Game(16G),\" and options for continuing or ending the game with a score below 0<br/></li><li>Rating system that scores your play across games, based on your performance<br/></li><li>Over 30 achievements</li></ul>", "metacritic": null, "released": "2023-11-21", "tba": false, "updated": "2023-11-24T07:03:46", "background_image": "https://media.rawg.io/media/screenshots/efe/efec5540bc07a6d81e4018bf2c3a8333.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Castle Box Games", "Arpaggers"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Castle Box Games"], "esrb_rating": null}