{"id": 972620, "slug": "hedra", "name": "Hedra", "name_original": "Hedra", "description": "<strong>Hedra </strong>is an experimental journey into the possibilities of geometric gaming. Powered by Unreal Engine 5, this early access title presents an ever-expanding universe built entirely of Tetrahedra and Octahedra.<br/>(If low-poly graphics like in Minecraft aren't your thing, this game might not be for you :) )<br/>Dive into a dynamic <strong>sandbox </strong>where you can shape, shatter and expand the world at will, navigate across various islands, each is a playground for different game modes like survival challenges and puzzles. As the game is being developed, new game modes will be available.<br/><br/>Key features:<br/>Dynamic sandbox environment to carve sculptures, shatter your enemies, dig tunnels and build your own environment, use your imagination in a world that responds to your touch.<br/>Navigate between different islands to switch between game modes: Sandbox, Puzzle, Survival, with other game modes and features in the works.<br/>Experiment with various materials like steel, concrete, and grass to shape and dress the world around you differently.<br/><br/><strong>Hedra </strong>is an early access title, priced at a discount rate to encourage an interactive development process. Your feedback helps determine the game's future direction and which features resonate most with the community. This isn't just a game; it's an ongoing experiment in game design, one where your voice helps shape the end product.", "metacritic": null, "released": "2023-11-22", "tba": false, "updated": "2023-11-24T07:23:35", "background_image": "https://media.rawg.io/media/screenshots/114/114f6a4e52937eebdb08a594bf5e3ad7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ernő Király"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Ernő Király"], "esrb_rating": null}