{"id": 972601, "slug": "sabbath", "name": "Sabbath", "name_original": "Sabbath", "description": "PLOT<br/>\r\nThe Sabbath Inc. is a company where not only humans work, but also mummies, robots, anthropomorphic onions and who knows what else. Paul is a humble employee and his dream is to become the president of Sabbath, but to do so he will have to defeat one by one the executives who hinder his career. Will you be able to meet the President and discover the secret behind Sabbath incorporated?<br/>\n<br/>\r\nGAMEPLAY<br/>\r\nThere are no \"normal enemies\" in Sabbath, but only bosses, represented by the company’s executives , each with his dedicated music track. <br/>\r\nTwo different combat systems will allow you to face them:<br/>\r\n-The first type consists in moving between four lanes to avoid the opponent attacks.<br/>\r\n-The second type allows you to move freely in the battle arena in a shoot em up style battle.<br/>\r\nThe controls are really simple, and the battles very short, but also very tough and intense. Don’t worry though, every time you lose it will be just a “click” to instantly start the battle again and do your best.<br/>\n<br/>\r\nSome other features:<br/>\r\n- Learn new combat techniques on each floor, such as the parry, which will allow you to block pink bullets.<br/>\n<br/>\r\n- Buy beverages at the coffee vending machine to enhance Paul. Beverages aren’t just one-time usable items, but they work more like equippable badges, and there’s no better one than the other, it all depends on your approch against the boss. A beverage wisely used can really change the match.<br/>\n<br/>\r\n- -The Sabbath inc.  vending machine is a bit strange, and it also sells weapons. Don’t mind buying a more powerful one as soon as you have a few coins in the pocket of your suit.<br/>\n<br/>\n<br/>\r\nLANGUAGE<br/>\r\nThe game is only available in english, however it is very simple english, so unless you have zero knowledge of this language you should not worry about that.", "metacritic": null, "released": "2023-11-21", "tba": false, "updated": "2023-11-24T07:00:49", "background_image": "https://media.rawg.io/media/screenshots/186/18660a5aee129bb05fb57d5e23616f81.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Claudio Moltedo"], "genres": ["RPG", "Indie"], "publishers": ["Claudio Moltedo"], "esrb_rating": null}