{"id": 972602, "slug": "hungry-humphrey-eat-the-world", "name": "Hungry Humphrey: Eat The World", "name_original": "Hungry Humphrey: Eat The World", "description": "Join Humphrey, the insatiable hero, on a culinary journey like no other! Embark on a gastronomic adventure as he feasts his way through farm fields, cookie factories, and thrilling theme parks. But beware, cunning enemies are hot on his heels, and it's your mission to safeguard Humphrey as he indulges in mouthwatering treats. With a whopping 45 levels, relentless AI foes, an extensive soundtrack, mind-bending mini-games, and awesome power-ups and upgrades, this game promises an unforgettable feast for your senses.<br/><br/>Key Features<br/><br/><strong>Explore Delicious Worlds!</strong> Traverse lush farms, explore cookie factories, and dive into the excitement of theme parks, each with its unique challenges and culinary delights.<br/><br/><strong>Feast Your Way to Victory</strong>! Guide Humphrey as he devours his favorite foods. Can you help him clear each level without getting caught?<br/><br/><strong>Crafty AI Enemies!</strong> Get ready for a thrilling chase! Enemies collaborate, employing cunning strategies to capture Humphrey. Stay sharp to outsmart them.<br/><br/><strong>Soundtrack with 59 Tasty Tunes!</strong> Immerse yourself in the game with an extensive soundtrack featuring 59 songs that'll keep your adrenaline pumping.<br/><br/><strong>9 Flavorful Mini-Games!</strong> Take a break from Humphrey's food frenzy and tackle a variety of mini-games that challenge your skills and offer delectable rewards.<br/><br/><strong>Power-Ups and Upgrades!</strong> Collect power-ups to give Humphrey the edge, and unlock upgrades to enhance his abilities. Turn the tables on your pursuers!<br/><br/>Are you prepared to join Humphrey on a gastronomic escapade like no other? It's time to showcase your foodie skills, outwit intelligent foes, and experience the ultimate munching madness.<br/><br/>Start feasting. Play Hungry Humphrey Eat The World now!", "metacritic": null, "released": "2023-11-21", "tba": false, "updated": "2023-11-24T07:02:26", "background_image": "https://media.rawg.io/media/screenshots/e4e/e4e2c627b8409940f6589b883f873e6e.jpg", "website": "https://www.limgamesstudio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lim Games Studio"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Lim Games Studio"], "esrb_rating": null}