{"id": 972618, "slug": "avo-escape-space", "name": "Avo Escape Space", "name_original": "Avo Escape Space", "description": "🏆Winner Very Big Indie Pitch Awards  (Dubai)<br/>\n<br/>\r\nAVO Escape Space is a dystopian, story-driven escape the room style VR game set in outer space! Take on the role of PatientZ, the last remaining passenger aboard a spaceship hurtling through a deadly meteor storm. Assisted by AVO, the spaceship's AI system, you embark on an extraordinary journey, striving for freedom from the doomed vessel and the prospect of another day. To do so, you must engage your mind with a series of intricate and mind-bending puzzles. As you progress through the game, uncover the unsettling truth behind the spaceship's purpose, but remember, this revelation is only the start of your adventure.<br/>\n<br/>\r\nFor enthusiasts of escape the room games, AVO is an absolute must-play, offering a thrilling challenge through its intricate puzzles. Depending on your puzzle solving skills, it may take you more than 4 hours to complete! However, superstar testers have been known to finish it within 2 to 3 hours ✨ <br/>\n<br/>\r\nGame Cooks is a small independent game studio based out of Lebanon. We’ve been developing VR games since 2017. We're big fans of the Escape The Room genre in real life and have poured our heart into replicating that experience in VR. We hope you enjoy it as much as we’ve enjoyed working on it!", "metacritic": null, "released": "2023-11-22", "tba": false, "updated": "2023-11-24T07:21:45", "background_image": "https://media.rawg.io/media/screenshots/7cd/7cdd5eb983b14da03c0baf79a2b23cae.jpg", "website": "https://www.avovr.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Game Cooks"], "genres": ["Adventure", "Strategy", "Casual", "Indie"], "publishers": ["Game Cooks"], "esrb_rating": null}