{"id": 97262, "slug": "this-room-leads-to-happiness", "name": "This Room Leads To Happiness", "name_original": "This Room Leads To Happiness", "description": "Team BroRawr's first Ludum Dare ever! <br/><br/>I want to start by thanking everyone of you for leaving nice comments and genreally making our first Ludum Dare a joyful experience! <br/><br/>Stress and panic aside, me and my teammate, Granlord, really pushed ourselves to our limits with this one. <br/>Halfway in we scrapped one project and changed the whole core concept of the game and went from pixelart to 3D (a field I'm not so comfortable with tbh..) <br/>All things considered, I am glad we changed approach and went for the 3D route. <br/>This way we can more effectively tell the story we want to share with you :) <br/><br/><br/><br/>Ok, So the general idea with this game is: <br/>Humans are gone, everything is run by machines, you are under the control of the FryNet™. <br/>You play as a hen, waiting on a large treadmill with your buddies to enter what you think is \"The room that leads to happiness\". <br/>However, right before your turn, the doors glitch out and you witness all the horrors going on behind these walls. <br/>This is where you decide to break free and fight the system! <br/><br/>Due to our limited time we never got to tell this story in game. <br/>The player starts off right after the hen breaks free and gets her wings on a grenade launcher. (I know, awesome, right?! :D) <br/>She is now in the lower levels of the building where the overlord of FryNet sends manager bots after her! <br/><br/><br/><br/>We found inspiration from: <br/>*Doom - Music and FPS feel <br/>*Stanley Parable - Humour <br/>*Portal - Humour <br/><br/><br/>Tools we used: <br/>*Unity <br/>*Blender <br/>*Pyxel <br/>*Audacity <br/>*Adobe Creative Suite <br/><br/><br/>These are some bugs I have noticed since I posted this build: <br/>*Bots are stacking when spawning <br/>*Bots lights are not triggering properly, should be red only when targeting player <br/>*Bots voicelines are gone, dafuq? <br/>*Difficulty is broken, only hard works atm.. (Dont worry its not that hard) <br/>*Gui is a little bit squished <br/><br/>Examples of missing bot voicelines: <br/>https://instaud.io/F2e <br/>https://instaud.io/F2m <br/>https://instaud.io/F2o <br/><br/><br/>We are very open to criticism, we entered this competition to grow as a studio and to learn, regardless of our results.. I think we have :) <br/><br/><br/>PS: <br/>I am sorry Linux/Mac people, my programmer is fast asleep (he worked like a real champ these last hours &lt;3). <br/>Downloads to other OS's will therefore be up tomorrow! <br/>Same goes for a Web build! <br/><br/>Oh, btw.. <br/>We will go back and complete this game after the event! <br/><br/>-Bejk and Granlord", "metacritic": null, "released": "2016-12-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a98/a98e0e996582efab96d32538f67e0257.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BroRawr Studios"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}