{"id": 972719, "slug": "cyber-avenger", "name": "Cyber Avenger", "name_original": "Cyber Avenger", "description": "<strong>Cyber Avenger</strong> is a top-down action game where you take on the role of a highly skilled covert operative on a dangerous mission to stop a group of terrorists who have obtained a groundbreaking invention with catastrophic potential. The government has tasked you with neutralizing the threat without drawing any attention, as the consequences of failure would be disastrous. Alone and under the cover of secrecy, you must navigate through five challenging sci-fi maps, facing a variety of enemies, including shotgunners, snipers, melee fighters, kamikazes, and more.<br/><br/><h3>OPERATION UNDERCOVER</h3>Your mission is to infiltrate the heavily guarded terrorist base, hidden deep within remote sectors of the galaxy. The government's top priority is to maintain complete secrecy, which means you must avoid raising any alarms or alerting the enemy of your presence. <br/><br/><h3>WEAPONS AND TACTICS</h3>As an experienced operative, you have access to a wide array of weapons, including shotguns, rifles, and sniper guns, enabling you to adapt your approach to various combat scenarios. Beware of kamikaze enemies, who will stop at nothing to take you down, making your mission even more perilous.<br/><br/><h3>VARIED MISSION OBJECTIVES</h3>Throughout the five sci-fi maps, you'll encounter different challenges and objectives. From sabotaging enemy installations to defeating electric systems, each mission will require strategic thinking and precision.<br/><br/><h3>GAME FEATURES:</h3><ul><li>Engaging top-down action with guns<br/></li><li>Diverse and challenging enemy types<br/></li><li>Multiple weapon choices for versatile combat strategies<br/></li><li>Varied mission objectives for thrilling gameplay<br/></li><li>Immersive sci-fi settings and environments<br/></li><li>An intense storyline</li></ul>", "metacritic": null, "released": "2023-11-24", "tba": false, "updated": "2023-11-27T05:56:38", "background_image": "https://media.rawg.io/media/screenshots/e51/e513c6181c7cd4c86786c945f3bb6a1c.jpg", "website": "https://store.steampowered.com/app/755980/_DEPLOYMENT/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Whale Rock Games"], "genres": ["Action", "Adventure", "Strategy", "Sports", "Casual", "Indie"], "publishers": ["Whale Rock Games"], "esrb_rating": null}