{"id": 972741, "slug": "i-am-a-fish-online", "name": "i am a fish Online", "name_original": "i am a fish Online", "description": "<strong>Protect the ocean and love nature. </strong><br/><br/><br/>\"If you are a person who likes a casual, simple and cute game atmosphere, chatting, collecting, unlocking achievements, and loving nature, then you can give yourself a chance to become a fish, and the fish school welcomes you.\"<br/>This is a multiplayer online RPG simulation survival game. Thank you for supporting independent games. I hope the game can bring you a little happiness and joy. Thank you Fish, you are a fish. You need to eat food, stay happy, and sleep. , there are beautiful music and wonderful scenes here, you are a little fish. Start your adventure with a fish egg. You can become a fish hero and mermaid. Sharks, crocodiles, various characters, collect various fish and fish hero characters, collect various weapons, various exquisite backpack styles, small fish can be upgraded and evolved, and finally you can get the fish species and mermaid you want. The adventure is divided into several maps and a home. The game has a huge map, and the adventure map also contains many dangers. Some humans will capture you and put you in a fish tank, some UFOs will capture you for study, some birds will take you away and fly into the sky, there will be human harpoons that will catch you and dry you out, Let you turn into a dried fish, a big fish will eat you, and you will also enter the belly of the fish. You can even chat in the belly of the big fish. There are many interesting random events in the huge map world waiting for you to explore. After we return home from our adventure, we can socialize and chat, take a shower, sleep, and recover. We can also go on adventures together to get treasure rewards. Once we have good weapons, we can play team copies together. We can trade treasure dropped by dungeon bosses at home. There are also many grocery items available for sale and trade. The game has a wide variety of weapons and a very interesting backpack. Items and weapons are divided into: green, blue, purple, orange, various levels. When you feel tired from taking risks, you can go home to chat, socialize and make friends, and share your own growth. I hope you will gain something in this world, make new friends, and expand your own adventure stories. Schools of fish are waiting for your arrival.<br/><br/><br/><strong> Author's Quotes: We pay tribute to and miss \"Bullfrog Game Studio\". Their games have always deeply influenced us. We will work hard to move forward. Thank you very much. ^_^ </strong><br/><br/><br/>Game features:<br/>* Love environmental protection.<br/>* More than 90 kinds of fish and 20 heroic characters waiting to be unlocked.<br/>* 70 achievements to unlock.<br/>* Set up stalls to trade items.<br/>* Fish news announcer (artificial online NPC) GM broadcasts fish news online.<br/>* Collect various backpack styles, groceries, and weapons of different qualities.<br/>* Simple collection of style and humor.<br/>* Various achievements.<br/>* Like all kinds of fish and various characters.<br/>* Fish schools attack the Boss together to get rewards.<br/>* In a daze among the fish.<br/>* Online chatting, socializing and making friends, multiplayer online games.<br/>*Hide in the corner and watch various players swimming around in schools.<br/>* The game is simple, relaxing and cheerful, and the game operation is simple WADS JKL + mouse click.<br/>* role play.<br/><br/><strong> Warm reminder: The Asian servers are currently smooth. You are willing to pay the price of a cup of milk tea to support our independent games. Thank you for supporting us. We will continue to work hard to create, care for life, and protect nature. Welcome to the fish school. ^_^ Thanks Thanks. </strong><br/><br/><br/>Part of the Fun Player Own Stall Grocery Display<br/><br/>Some interesting fish displays<br/><br/>Display of some heroic characters<br/>", "metacritic": null, "released": "2023-11-24", "tba": false, "updated": "2023-11-27T06:27:16", "background_image": "https://media.rawg.io/media/screenshots/e2e/e2eb83b359aedf2ce132c34a4834a4a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 398, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Snowball Games"], "genres": ["Adventure", "RPG", "Simulation", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["Snowball Games"], "esrb_rating": null}