{"id": 972796, "slug": "scary-school-simulator-2", "name": "Scary School Simulator 2", "name_original": "Scary School Simulator 2", "description": "Dive into the spine-chilling world of Scary School Simulator 2, where the serene facade of Sakura High School conceals dark secrets and eerie mysteries. Immerse yourself in this heart-pounding anime horror simulation that combines the thrill of high school life with the terror of a yandere ghost's obsession. Unravel the mysteries, survive the doki-doki moments, and escape the sinister ghosts.<br/>\n<br/>\r\nPlay the game as Sakura and her friend Sara, the Japanese schoolgirls on livestream that trapped in a cursed and abandoned academy, where you must navigate the dark corridors of a haunted school, solve chilling mysteries, and survive terrifying encounters with spooky creatures and zombies.<br/>\n<br/>\r\n🌟 Key Features:<br/>\n<br/>\r\n🔪 Survive the Haunted School: Navigate the spooky halls of Sakura High School, where creepy ghosts lurk around every corner, ready to haunt you into a world of terror. Can you escape their killing desires and survive the nightmare?<br/>\n<br/>\r\n🌸 Explore Sakura High School: Discover the hauntingly beautiful 3D surroundings of Japanese high school, complete with swimming pool, art club, and abandoned classrooms. But beware, as darkness hides behind every corners.<br/>\n<br/>\r\n👧 Interact with Friends: Meet with a variety of students, each with their unique personalities and secrets. Build love relationships or face the consequences of rejection, as the yandere ghost are always watching you.<br/>\n<br/>\r\n👹 Evil and Angry Teacher’s Wrath: The beautiful teacher is not what they seem. Avoid seek their attention, scare her by prank teachers, solve puzzles, and escape their evil plans to trap you in the haunted high school forever.<br/>\n<br/>\r\n🎮 Realistic Simulator Experience: Experience the thrill of a realistic high school simulator with a terrifying twist. Attend classes, prank your friends, and interact with stuff, all while being on the lookout for popping jump scares.<br/>\n<br/>\r\n😱 Heart-Pounding Doki Doki Story: Feel your heart race during intense chapters, where your choices could mean the difference between survival and death. Can you keep your composure and outwit the evil ghost trying to kill you?<br/>\n<br/>\r\n👻 Anime Horror Atmosphere: Immerse yourself in the captivating anime horror game atmosphere of Scary School Simulator 2. The chilling soundtrack, eerie jumpscare, and unsettling ambiance will keep you on the edge of your seat.<br/>\n<br/>\r\n🏃 Escape the Horror: Your last goal - escape from Sakura High School with your boyfriend before it consumes your soul. Use your eyes, mobile phone, and playtime to find a way out of this nightmare.<br/>\n<br/>\r\nSurvive the horror school, outsmart your pursuers, and escape Sakura High School before it's too late. Can you evade the hordes of the supernatural being in this terrifying anime horror simulation game?", "metacritic": null, "released": "2023-11-30", "tba": false, "updated": "2023-12-01T05:48:54", "background_image": "https://media.rawg.io/media/screenshots/bf3/bf3fc2e690f19a265918ea0a3a868817.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Scary Creepy Pasta"], "genres": ["Action", "Adventure", "Simulation"], "publishers": ["Scary Creepy Pasta", "Spooky Horror Game Foundation"], "esrb_rating": null}