{"id": 972794, "slug": "assembly-line-2-mobile-version", "name": "Assembly Line 2 Mobile Version", "name_original": "Assembly Line 2 Mobile Version", "description": "Welcome to Assembly Line 2, the sequel to the factory-building and managing game.<br/>\n<br/>\r\nAssembly Line 2 combines elements from idle and tycoon games. Make the most money by using different types of machines to build an assembly line to craft resources and sell them. Unlock upgrades to make it more efficient and expand your factory.<br/>\n<br/>\r\nThe goal is simple, build resources and sell them. Starting with a few machines and very basic resources, and using them with more advanced machines to craft and create more complex resources.<br/>\n<br/>\r\nYour factory will continue generating money even when you are offline. When you return to the game you will have piles of money waiting for you, but don't spend it all in one place!<br/>\n<br/>\r\nWhile Assembly Line 2 is an idle game, because you make the layout of your factory, it is up to you to optimize it to make the most money possible.<br/>\n<br/>\r\nDon't worry if you get lost with all those machines to build, the game offers an information menu so you can see what each machine does at any time. It also offers information on each resource price, so you can make decisions on what to craft. You can also see stats on the amount you are producing.<br/>\n<br/>\r\nFeatures:<br/>\r\n- 20+ different machines to build and optimize the best factory.<br/>\r\n- Tons of upgrades to increase productivity.<br/>\r\n- More than 50 different unique resources to craft.<br/>\r\n- Multi-language support.<br/>\r\n- Back up your progress.<br/>\r\n- No internet required.", "metacritic": null, "released": "2023-11-30", "tba": false, "updated": "2023-12-01T05:46:19", "background_image": "https://media.rawg.io/media/screenshots/9a8/9a818a6fcbb0706e66a13768ccd03daf.jpg", "website": "http://www.olympusgames.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Olympus"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Olympus"], "esrb_rating": null}