{"id": 972795, "slug": "beacon-patrol-first-horizons", "name": "Beacon Patrol: First Horizons", "name_original": "Beacon Patrol: First Horizons", "description": "Beacon Patrol: First Horizons is a <strong>relaxing</strong> strategy game with endless possiblities.<br/><br/>Steer your Coast Guard ship and build your own coastal map one tile at a time.<br/><br/>Get more tiles by exploring and keep building indefinitely as long as you can keep scoring.<br/><br/><br/>Start with your ship at the Coast Guard HQ and you build your map from there.<br/><br/>On your turn you place up to three tiles, connecting to the tile your ship currently occupies. Tiles must not be rotated and all their edges have to match.<br/><br/>After placing a tile you immediately move your ship onto it. By spending one of your tokens you can take an additional movement to a connected tile.<br/><br/>You score points for each tile that is connected to other tiles on all four sides. For scored points you receive new tiles to continue your journey.<br/><br/>The game ends after allavaialble tiles have been played.<br/><br/><br/>Beacon Patrol: First Horizons combines the look and feel of a board game with the endless posibilities of a digital experience.<br/><br/>Experience this cozy and strategic game at any time.<br/><br/>The clear and cute art style lets you enjoy the coast and the sea from where ever you are.", "metacritic": null, "released": "2023-11-30", "tba": false, "updated": "2023-12-01T05:47:44", "background_image": "https://media.rawg.io/media/screenshots/007/0079ca3690165c2cb0210a3ed2ceded2.jpg", "website": "http://www.beaconpatrol.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["BrutalHack", "Shapes and Dreams"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Shapes and Dreams"], "esrb_rating": null}