{"id": 972736, "slug": "spooky-spins-returns-crazy-cash-edition-slots", "name": "Spooky Spins Returns: Crazy Cash Edition - Slots", "name_original": "Spooky Spins Returns: Crazy Cash Edition - Slots", "description": "Spooky Spins Returns : Crazy Cash Edition is a 5 reel, 25 payline slot machine (pokie) with a Horror theme oriented from left to right. - WITH THE SIMILAR LIGHTNING STRIKE FEATURE.<br/>\n<br/>\r\nPlay this classic remake from the Spooky Spins Series, Now with Crazy Cash Feature.<br/>\r\nSpooky Spins created in 2005 by Pokies4fun has been enjoyed around the globe.<br/>\r\nThis new version is our first release with our new Crazy Cash Feature.  <br/>\r\nGrab yourself a drink, sit back, play and enjoy. <br/>\r\nNow also with authentic background ambience recorded from a live venue to create a real atmosphere, just like you are actually at a casino.<br/>\n<br/>\r\nFree game feature is awarded when 3 or more scatters appear on any line and is awarded 7 free games.<br/>\r\nDuring free games any (6) six cash values on screen trigger the Crazy Cash Feature.<br/>\r\nDuring play any (6) six or more Spooky ( Symbols ) scattered anywhere on screen start the Crazy Cash Feature.<br/>\r\nDuring the Crazy Cash Feature there will be 3 free spins, when an additional spooky value lands on screen it will re-trigger free spins back to 3 <br/>\r\nuntil no more spooky's land on screen, win Mini, Minor and Major jackpots when symbols land on screen.<br/>\n<br/>\r\nTo Win Grand Jackpot screen needs to have all 15 reels lite up with a winning value.<br/>\r\nScattered during Free spins paid or free cannot be retriggered during play.<br/>\r\nSpelling S-P-OO-K-Y on any lite line gives 10000 Coins.<br/>\n<br/>\r\nThis is the closest slot machine simulation you can get to the real thing, with features like, Reserve Button and Paytable. <br/>\r\nPlay Pokies4fun Slot Simulations at work or at home without losing a cent, Great Games Great Fun........<br/>\r\nNo real money can be won.<br/>\r\nFor Amusement Only. If you are looking for the best Australian slot machine games, then look no further than Pokies4fun. Pokies4fun is a leading provider of online and offline pokies for fun that are designed to entertain and thrill you. Pokies4fun offers a wide range of slot machine games with different themes, features, and jackpots.<br/>\r\nPokies4fun has some of the most popular and classic pokies games. You can also enjoy some of the new and innovative pokies games such as Goofy Golf, Spooky Spins, and more. Pokies4fun games have high-quality graphics, animations, and sound effects that create a realistic and immersive gaming experience. Pokies4fun games also have exciting features such as free spins, bonus games, wilds, scatters, and progressive jackpots that can reward you with huge payouts.<br/>\r\nPokies4fun is a trusted and reputable brand that has been providing online pokies for fun since 2005. Pokies4fun games are safe and legal in Australia and other countries where online and Simulated gambling is allowed. Pokies4fun games are for amusement only and no real money can be won. Pokies4fun games are suitable for all types of players, whether you are a beginner or an expert, a low roller or a high roller. Pokies4fun games are fun and easy to play, just click the spin button and see what happens.", "metacritic": null, "released": "2023-11-24", "tba": false, "updated": "2023-11-27T06:21:24", "background_image": "https://media.rawg.io/media/screenshots/1aa/1aa58fdb225ba91ac6ac8dc97ff42367.jpg", "website": "https://pokies4fun.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pokies4fun"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Pokies4fun"], "esrb_rating": null}