{"id": 972793, "slug": "reign-of-dwarf", "name": "Reign Of Dwarf", "name_original": "Reign Of Dwarf", "description": "Join the official Reign of Dwarf Discord by clicking on the image above!<br/><br/><br/><br/><br/>In Reign of Dwarf, you are left in the wilderness and you will have to <strong>exploit all the resources at your disposal to survive, build a fortified base, store what you have been able to harvest, and above all protect it from other players</strong>. Evolve in a world that has never been used for open-world survival: <strong>the fascinating world of the dwarves!</strong><br/><br/><br/><br/>You'll have to master the ways of hunting for your food. Hunting won't be as easy as you think, there are a lot of animals that will be hard to take down.<br/>If you got a friend to help you, It would be a lot easier.<br/><br/><br/><br/>You will have to collect different resources, build your base, acquire food, make weapons and tools, and <strong>fight creatures emblematic of the dwarf world to be able to prosper and complete your evolution</strong>.<br/><br/><br/><br/>The combat will revolve around a system of free-form melee, feint, block, and stab. Make your way through the dwarf world! <strong>Get full control over your character and your attacks and develop your unique style</strong>.<br/><br/><br/><br/>Team up with friends to maximize your chances of success. <strong>Note that the servers are designed to support at least 200 users at release</strong> and will be upgraded!<br/><br/><br/><br/>If the idea of being <strong>a powerful dwarf in a medieval/steampunk world with fearsome creatures such as goblins, orcs, ogres, and more</strong> sounds exciting to you, we encourage you to add the game to your wishlist and <strong>join our discord to follow our progress on this crazy project</strong>.<br/><br/>", "metacritic": null, "released": "2023-11-30", "tba": false, "updated": "2023-12-01T05:45:06", "background_image": "https://media.rawg.io/media/screenshots/e1b/e1b67e1f776ca62f3f39ef070e5cbd02.jpg", "website": "https://reignofdwarf.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 307, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AnkleBreaker Studio", "AnkleBreaker Consulting"], "genres": ["Action", "Massively Multiplayer"], "publishers": ["AnkleBreaker Studio"], "esrb_rating": null}