{"id": 972716, "slug": "super-elastic", "name": "Super elastic", "name_original": "Super elastic", "description": "The girl said that this game is really flexible, come and play together.<br/>\n<br/>\r\nThis is a top-down pinball challenge game with shooting as the core gameplay. In this exciting pinball adventure, you will control the shooting pinball and use its power to hit the little monsters filled with numbers on the screen. With each successful hit, the number will decrease until the little monster disappears completely, and you will receive the corresponding score.<br/>\n<br/>\r\nThere are some special elements hidden in the game that can enhance your strength. Destroying the little monsters marked with stars will enhance your attack power and make your pinballs more powerful. In addition, fighting off small monsters marked with pinballs will also increase your number of pinballs, giving you more opportunities for continuous shooting.<br/>\n<br/>\r\nHowever, you must be careful to deal with the attacks of little monsters. If they exceed the bottom red line, the game will be over. At the end of the game, you will be rewarded with a certain percentage of gold coins based on the score obtained in this game. Using these gold coins, you can purchase various props to enhance your abilities. Choosing the right props and using them at the right time can help you get higher scores.<br/>\n<br/>\r\nIn addition, when you accumulate enough stars, you can also unlock some beautiful CG pictures in the gallery. These pictures will record your achievements in the game and become your precious collection.<br/>\n<br/>\r\nAre you ready for this pinball challenge? Let the joy of shooting bring you endless entertainment and a full sense of accomplishment!", "metacritic": null, "released": "2023-11-24", "tba": false, "updated": "2023-11-27T05:52:22", "background_image": "https://media.rawg.io/media/screenshots/fa3/fa30979f34585789997a2ca131f4eb70.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Super elastic  Game"], "genres": ["Strategy", "Racing", "Casual"], "publishers": ["Super elastic  Game"], "esrb_rating": null}