{"id": 9727, "slug": "empires-mod", "name": "Empires Mod", "name_original": "Empires Mod", "description": "<strong>Empires</strong>, the award winning Source SDK game, combines the best of the first person shooter and real-time strategy genres. Fight as either the Northern Faction, remnants of the fallen nation of Jekotia, or as the imperial Brenodi Empire. <br/>\t\t\t\t\t\tEmpires features:\t\t\t\t\t\t<ul><li><strong>Four infantry classes</strong> - Prepare a surprise attack as the scout or take the enemy head-on as the rifleman. Drive back enemy tanks as the grenadier or support your team as the engineer. With four different infantry classes, each with customizable skills, you can create the perfect class to fit your playing style.<br/> </li><li><strong>Squad-Based Teamwork</strong> - Players can organize themselves into highly-effective squads, overwhelming their opponents with superior tactics. Squad leaders can not only direct their respective members, but also use special squad powers such as reviving dead squad members or calling down an artillery strike on the enemy.<br/> </li><li><strong>Vehicle Combat</strong> - Whether you're ferrying troops around the battlefield with the Armored Personnel Carrier or reigning fire upon your foes with the Artillery tank, Empires features a variety of vehicular combat. Choose from six different vehicle types, including three levels of tanks, and customize your weapons, armor, and engines.<br/> </li><li><strong>Real-Time Strategy Commander</strong> - For those more inclined to RTS gameplay, you can play as the commander. Place buildings, build defensive turrets, construct vehicles, and conduct research on your way to leading your team to victory.<br/> </li></ul>With 15 official maps and dozens more community-created ones, no two matches are ever the same. Empires brings FPS/RTS gameplay to a whole new level. Join up today and see what you've been missing.", "metacritic": null, "released": "2008-07-28", "tba": false, "updated": "2024-04-06T13:02:36", "background_image": "https://media.rawg.io/media/screenshots/e79/e7935d0c8fcd497c6824f490455988c7.jpg", "website": "http://www.empiresmod.com/", "rating": 1.75, "rating_top": 1, "added_by_status": {"yet": 3, "owned": 209, "dropped": 1, "playing": 1}, "playtime": 1, "achievements_count": 8, "ratings_count": 12, "suggestions_count": 537, "game_series_count": 0, "reviews_count": 12, "platforms": ["PC", "Linux"], "developers": ["Empires"], "genres": ["Action", "Strategy"], "publishers": ["Empires"], "esrb_rating": null}