{"id": 972895, "slug": "tevi", "name": "TEVI", "name_original": "TEVI", "description": "The protagonist Tevi is nimble and agile, wielding both her trusty dagger and an oversized wrench for dishing out melee damage in style. Alongside her, companions Celia and Sable manifest as two floating orbitars, ready to unleash a variety of ranged offensive and supportive magic in battle. Adapt your combat style to suit any situation and bring down foes with flashy, dazzling combos!<br/><br/><br/><br/><br/><br/><br/>Every boss fight is a unique challenge requiring different strategies to tackle, all while you dodge their attacks and look for openings to counter-attack. <br/>As bosses change phases, their attack and bullet patterns become increasingly challenging, and they can even unleash devastating ultimates. Continual offense can submit bosses into a vulnerable BREAK state, during which you can deal massive bursts of damage.<br/><br/><br/><br/><br/><br/><br/>Scattered across the the expansive world, there are over 300 different items and pieces of equipment waiting to be discovered. These items can enhance your abilities or introduce new ones, allowing you to find more methods of navigating the world and finding secrets. A cornucopia of equippable sigils can be freely configured to create builds tailored to your preferences and playstyle.<br/><br/><br/><br/><br/><br/><br/>Dive into the vibrant world of Az, in which you will discover various towns, regions, peoples, histories, and civilizations, each with their own tale to tell. Along the way, you'll meet a large cast of strange and colorful characters. As their tales unfold and intertwine, you'll be drawn into a tale full of adventure, friendship, mysteries, and danger... <br/><br/>Get ready to embark on an unforgettable adventure, writing your own epic journey alongside Tevi!<br/><br/><br/><br/><ul><li>Tevi（VA: Lynn）<br/></li><li>Celia（VA: Yoko Hikasa）<br/></li><li>Sable（VA: Natsumi Fujiwara）<br/></li><li>Zema（VA: Tomokazu Sugita）<br/></li><li>Vena（VA: Rie Kugimiya）</li></ul>", "metacritic": null, "released": "2023-11-29", "tba": false, "updated": "2024-03-26T23:21:14", "background_image": "https://media.rawg.io/media/screenshots/556/556f610a0835a3a079fa40f4836cb16f.jpg", "website": "https://www.tevi.games", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 6, "beaten": 1, "toplay": 2}, "playtime": 43, "achievements_count": 71, "ratings_count": 1, "suggestions_count": 468, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["CreSpirit", "GemaYue", "Ein Lee"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Neverland Entertainment", "CreSpirit"], "esrb_rating": null}