{"id": 972898, "slug": "ao-shu-da-ti-math-olympiad", "name": "奥数答题 Math Olympiad", "name_original": "奥数答题 Math Olympiad", "description": "<h3>Gameplay · Not just secrets</h3>Click the left mouse button to move, and the right mouse button to view the character properties<br/>Move to the New World by ship, and every monster on the continent will be an obstacle to your progress<br/>Each monster is given a mathematical Olympiad, and only if it gets it right can it move on to a new continent<br/>Olympiad is short for Olympic Mathematics. The scope of the questions is beyond the compulsory education level in all countries, some of the problems are far more difficult than the university entrance exam, and some of the problems are difficult even for mathematicians. Through such high-level competitions, mathematical talents can be identified early and then nurtured to make them stand out. In recent years, many famous universities and key middle schools at home and abroad pay more attention to mathematical Olympiad talents, and usually select excellent students through mathematical Olympiad. Peking University, Tsinghua University, Fudan University and other universities have a good preference for students who are excellent in the Olympic math. Every year, many students with excellent results in the national high school math competition directly enter the mathematics department of Peking University without taking the test.<br/>Because universities and key middle schools attach great importance to mathematical Olympiad talents, in recent years, the term \"mathematical Olympiad in primary schools\" has appeared. The full name of the primary school mathematics Olympiad is called \"Primary School Mathematics Olympiad\", or \"Primary School Mathematics Olympiad\", which originates from \"mathematics is the gymnastics of thinking\", which reflects the commonality of mathematics and Olympic sports spirit: faster, higher and stronger. In fact, it is more accurately called \"primary school competition mathematics\". It embodies the ingenuity, flexibility and variability of mathematics and the infiltration of mathematical aesthetics.<br/>For the time being, only Chinese is supported, if your Chinese level has not reached a certain level, please do not buy", "metacritic": null, "released": "2023-11-29", "tba": false, "updated": "2023-12-01T08:03:43", "background_image": "https://media.rawg.io/media/screenshots/469/4698f10d4ee9c8da3605e0b1d7e3e942.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["XL Studio"], "genres": ["Adventure", "Strategy"], "publishers": ["XL Studio"], "esrb_rating": null}