{"id": 972860, "slug": "forest-grove-2", "name": "Forest Grove", "name_original": "Forest Grove", "description": "<strong>Forest Grove</strong> is a first-person mystery game where you uncover forensic clues, solve puzzles, and piece together a story using your own conclusions. Will you be able to solve the case?<br/><br/>Zooey Kunstmatigaard, the teenage heiress to a billion-dollar tech fortune, was reported missing by her stepmother Mary. She was last seen in her bedroom in Forest Grove, Oregon.<br/><br/>The Remote Forensics Bureau uses this as an opportunity to roll out their latest crime-fighting technology, the Nanodeck. You'll use it to investigate the scene, collect evidence, and unmask the truths behind Zooey's disappearance.<br/><br/>Relationships and secrets must be revealed. If foul play is suspected, those responsible must be brought to justice!<br/><br/><br/><strong>FORENSICS BASED EVIDENCE</strong><br/><br/>Explore a crime scene riddled with evidence such as DNA, fingerprints, perspiration metabolites and more. Can you associate these scattered pieces of evidence to reveal new leads and deduce the story within? It’s all up to you to find the truth.<br/><br/><br/><br/><br/><strong>INTERTWINED PUZZLES &amp; CLUES</strong><br/><br/>The Kunstmatigaard's are fond of puzzles. Discover hidden rooms and buried secrets all which lead to more clues to aid you in your investigation.<br/><br/><br/><br/><br/><strong>DEDUCTIVE REASONING</strong><br/><br/>Use your wit and intuition to piece together what really happened, knowing full well there's every chance you could get it wrong. There will be no hand holding here.<br/><br/><br/><br/><br/><strong>RICH CHARACTER BACKSTORY</strong><br/><br/>Uncover a cast of characters each with stories and conversation of their own. Perhaps someone knows more than they are willing to admit. <br/><br/><br/><br/><br/><strong>INNOVATIVE EVIDENCE BOARD</strong><br/><br/>Solve the mystery like a real detective with the innovative evidence board. Collect an abundance of evidence which can be used to link to new leads, clues, or identifying persons of interest. <br/><br/><br/><br/>All characters appearing in this work are fictitious. Any resemblance to real persons, living or dead, is purely coincidental.", "metacritic": null, "released": "2023-11-28", "tba": false, "updated": "2023-12-01T07:11:17", "background_image": "https://media.rawg.io/media/screenshots/8bc/8bc65f236fe679eb7cd5931fdbb19283.jpg", "website": "http://miga.io/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 518, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Miga Games"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["Blowfish Studios"], "esrb_rating": null}