{"id": 972837, "slug": "noctuary", "name": "Noctuary", "name_original": "Noctuary", "description": "Noctuary is a dual-protagonist Visual Novel. Players can play the role of the duo, Fancia Dream and Alina Nightsong who have dreams of \"becoming Arborangers who protect and serve everyone.\" Travel through the fairy-tale-like world as the duo, experience their lively daily adventures, and gradually encounter the life story of a mysterious girl who came down from the sky.<br/><br/>Meanwhile, don't forget to fight against the everpresent monsters—\"Darkritters!\" These dangerous enemies threaten the life of Illuminators constantly. Sharpen your fighting skills, defeat ferocious monsters and ensure peace in your community!<br/><br/><br/><br/><br/>During your adventure, you will fight against various enemies. You can defeat them with a cascade of powerful combo attacks!<br/><br/><br/>The two main characters master different skills and present various fighting styles, which allows you to win a battle in whichever method you choose. Switch between the two girls in battles to cope with enemies' attacks and finish them off with the powerful On-field Switch skill and the Synergy.<br/><br/><br/><br/><br/>Embark on various missions within Inlixaland and become a unique \"Arboranger.\"! In addition to the main storyline that spans several tens of hours, there are also over 20 side routes and quests featuring different stories and characters to explore. Join forces with diverse Illuminators as companions, cultivate relationships, and earn adventure rewards!<br/><br/><br/><br/><br/>The friendships and blessings you harvest along the journey will strengthen you in battle. Feel free to combine the \"Blessing Petals\" that are embedded with features of different characters to customize your battle style. In addition, there are many other well-designed cultivation systems that are ready for you to explore!<br/><br/>", "metacritic": null, "released": "2023-11-28", "tba": false, "updated": "2023-12-01T06:40:12", "background_image": "https://media.rawg.io/media/screenshots/1fd/1fd9bb07c04cbaa3c4d2eeb205d6b675.jpg", "website": "https://weibo.com/hongchagames", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 554, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gratesca"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Gratesca"], "esrb_rating": null}