{"id": 972899, "slug": "shape-quiz", "name": "Shape Quiz", "name_original": "Shape Quiz", "description": "https://store.steampowered.com/app/2308240<h3>Welcome to Shape Quiz - Unleash Your Inner Detective!</h3><br/>Embark on a captivating visual adventure where shapes take the spotlight. Can you discern the shapes hidden within intriguing outlines? Put your perception and speed to the test in this exhilarating quiz game!<h3>🌟 Shape Exploration:</h3> Delve into the world of shapes as they gradually unfold on your screen. Can you identify them all correctly?<h3>🌟 Race Against Time:</h3> Quick thinking is key! Identify the correct shape swiftly to earn stars and dominate the global leaderboard.<h3>🌟 Daily Challenge:</h3> Challenge yourself daily with a unique set of 10 shape-based puzzles. Can you outperform others who are shown the exact same shapes?<h3>🌟 Diamonds:</h3> Earn diamonds as rewards! Get 5 diamonds for every 5 correct answers in standard mode. In Daily Challenge mode, receive a diamond for each correct answer.<h3>🌟 Game Over:</h3> In the event of an incorrect answer, the round gracefully concludes, affording you the chance to restart and redeem yourself.<h3>🌟 Information &amp; Settings:</h3> Access game instructions and the development version in this section.<br/><br/><strong>Shape Quiz</strong> is your opportunity to prove your shape recognition skills. Rise through the ranks and become a star collector. Get ready to embark on this visual journey today!", "metacritic": null, "released": "2023-11-29", "tba": false, "updated": "2023-12-01T08:04:49", "background_image": "https://media.rawg.io/media/screenshots/cb1/cb1592a22bb995b8b4879cca30f644bf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["FranzJero"], "genres": ["Casual", "Indie"], "publishers": ["FranzJero"], "esrb_rating": null}