{"id": 972869, "slug": "the-exit-8", "name": "The Exit 8", "name_original": "The Exit 8", "description": "<p>You are trapped in an endless underground passageway.<br />\nObserve your surroundings carefully to reach &quot;The Exit 8&quot;.<br />\nDon&#39;t overlook any anomalies.<br />\nIf you find anomalies, turn around immediately.<br />\nIf you don&#39;t find anomalies, do not turn back.<br />\nTo go out from Exit 8.<br />\nThe Exit 8 is a short walking simulator inspired by Japanese underground passageways, liminal spaces and back rooms.<br />\nThe game is only available in Japanese and English, but if you understand the above description of the anomaly, you can probably play it all the way through.Play Time15-60 minutesAbout Video Distribution・Distribution is available to both individuals and corporations without permission.<br />\n・Monetization is only possible when using the functions provided by the video distribution site.<br />\n・We would appreciate it if you include the name of the game in the title of your video or live broadcast, or include a link to the Steam page in the summary section.<br />\nWe will not be liable for any damages caused by the distribution of videos of this game.<br />\nThe contents of these guidelines are subject to change without notice.OtherGraphics settings, mouse sensitivity, camera shake, and other settings can be configured from the options.</p>", "metacritic": null, "released": "2023-11-29", "tba": false, "updated": "2024-04-11T20:51:14", "background_image": "https://media.rawg.io/media/games/517/517125a547032001ee385bd5c30cd187.jpg", "website": "", "rating": 3.96, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 19, "beaten": 28, "toplay": 8, "dropped": 3}, "playtime": 1, "achievements_count": 2, "ratings_count": 26, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 26, "platforms": ["PC"], "developers": ["KOTAKE CREATE"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["KOTAKE CREATE"], "esrb_rating": null}