{"id": 972843, "slug": "sos-zombie-survivors", "name": "SOS Zombie Survivors", "name_original": "SOS Zombie Survivors", "description": "SOS Zombie follows the harrowing journey of a group of diverse survivors trapped in a city overrun by a zombie apocalypse. The group fights waves of increasingly aggressive zombies while preparing for a rescue helicopter scheduled for evacuation a rescue point.<br/>\n<br/>\r\nGameplay:<br/>\n<br/>\r\nSetting: The game unfolds in an expansive, decaying cityscape with abandoned buildings, narrow alleys, and desolate streets. The environment is dimly lit, and eerie soundtracks intensify the sense of impending danger.<br/>\n<br/>\r\nObjective: Players must survive successive waves of increasingly aggressive zombies while locating essential supplies, fortifying their position, and signaling the incoming rescue helicopter.<br/>\n<br/>\r\nSurvival Elements: To endure the relentless assault, players scavenge for resources such as ammunition, medical supplies, food, and building materials to fortify their position. They must strategize and manage these resources efficiently, balancing offensive and defensive strategies.<br/>\n<br/>\r\nCombat System: The game offers an arsenal of weapons, including pistols, shotguns, assault rifles, explosives, and makeshift traps. Each weapon has distinct advantages and limitations, encouraging players to adapt their tactics based on the situation. Headshots are critical for conserving ammunition and taking down zombies swiftly.<br/>\n<br/>\r\nBase Building: As the game progresses, players have the opportunity to fortify their position by constructing barriers, setting up turrets, and reinforcing their safe zone.<br/>\n<br/>\r\nHelicopter Rescue: Throughout the gameplay, players must maintain a distress signal to guide the rescue helicopter. This involves activating an SOS signal that attracts the zombie waves<br/>\n<br/>\r\nMultiplayer Mode: Players can team up in a cooperative mode, strategizing together to fend off the undead and increase their chances of survival.", "metacritic": null, "released": "2023-11-28", "tba": false, "updated": "2023-12-01T06:50:04", "background_image": "https://media.rawg.io/media/screenshots/e5e/e5efe3468fb983ab0fb8dfc3bb2fdb32.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 416, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Silvercontrol Studios"], "genres": ["Action"], "publishers": ["Silvercontrol Studios"], "esrb_rating": null}