{"id": 97293, "slug": "llama-palooza", "name": "LLAMA PALOOZA", "name_original": "LLAMA PALOOZA", "description": "<p><strong>A massive herd of llamas has gone nuts. </strong>The little village of Dala has no choice but to try to calm them and find out what has gone wrong. Together they will be victorious..! <em>...Or will they?</em></p>\n\n<p> <strong>Llama Palooza</strong> is a hectic and fast paced 3D party game for 1-4 players where the focus is to get all the llamas to stop destroying the village of Dala. You play as a llama herder who is desperately trying to gather the llamas without hurting the village. The llamas has gone crazy from accidentally being given a power-up elixir instead of a dead llama elixir made by their rivaling neighbor village. It’s up to you and your friends to calm them down and bring them safely to the enclosures.<br/></p>\n\n<p><strong>Wave after wave of llamas wash over the village</strong>, trying to destroy one district after another. This game is made to be played by everyone, as long as they can hold a controller. It’s for <em>family and friends, or strangers</em>, who want to play a party game made to bring people together with <em>teamwork and communication</em>. To help you control the crazy llamas you'll have cool weapons! With some luck, you'll have teamwork too!<br/><br/></p>\n\n<p>The Game was made during a 10 week student project and the project is now over. We want to develop the game further but it depends on the feedback from you guys.  Please comment if you think this game should be developed further. <br/></p>\n<p>Hope you enjoy!</p>", "metacritic": null, "released": "2018-06-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/438/43838b6db3b34d7b7ee582c847d548df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DalaLlamaStudio"], "genres": [], "publishers": [], "esrb_rating": null}