{"id": 972926, "slug": "buzz-cut-simulation", "name": "Buzz Cut Simulation", "name_original": "Buzz Cut Simulation", "description": "[Game Description]<br/>This content allows players to choose whether a young man living in Korea shaves his head through video. Players can decide whether to shave their heads or not.<br/><br/>[Experience and Motivation]<br/>Created to inspire players to live a more challenging life by gaining courage and motivation from watching a young man actually shaving his head.<br/><br/>[Story]<br/>Hello! I'm not originally a game developer.<br/><br/>I've been an inventor since I was in the 2nd year of middle school.<br/><br/>I'm now 26 years old.<br/><br/>I have a strong interest in invention and love to challenge new things, so I started attending an invention class since the 2nd year of middle school.<br/><br/>Although I was very interested in invention during middle school, I didn't consider it as my major.<br/><br/>During that time, I participated in my first invention competition and I enjoyed the sense of accomplishment and presenting my ideas to others.<br/><br/>Later, I found out about the existence of specialized invention high schools, and I decided to attend one.<br/><br/>After entering high school, I received over 20 awards in invention competitions and applied for and registered 6 patents, which inspired me to start a business based on my inventions.<br/><br/>However, by the time I was in my senior year of high school, I had only saved 3 million won (approximately $2,500), and the cost of making molds was too expensive, so I had to give up.<br/><br/>As I contemplated my next steps, I realized that instead of needing a lot of money to start a business, I could start a business by investing my time.<br/><br/>I came up with the idea of creating content. So, I decided to major in game development at a university.<br/><br/>Over the next 4 years, I focused on game development, and starting from my 2nd and 3rd year, I gradually created and released games, similar to a lean startup.<br/><br/>By the time I was in my 4th year, I created and released a game called 'Blue Tricks,' which I had crowdfunded the previous year.<br/><br/>However, the results were not as good as I had hoped, but I saw it as a part of the journey towards success and continued to plan and develop games consistently.<br/><br/>I was fortunate to find team members who shared my vision in a relatively short amount of time.<br/><br/>In April of 23, we acquired our first office, and 5 months have passed since then.<br/><br/>As time goes on, it feels like we are walking down a dimly lit path, but we keep challenging ourselves and creating every day.<br/><br/>In the midst of all this, I thought of a game idea that would relieve my frustration and capture people's attention.<br/><br/>That idea was the buzz cut simulation. The reasons are:<br/><br/>1. Anyone can get a buzz cut, but people find it difficult and don't like it.<br/><br/>2. I think people will be interested if they get a buzz cut.<br/><br/>3. I believe it's the quickest way to raise funds to support my business.<br/><br/>However, the results are unknown, so I decided to create the game with a mindset of trying it out and taking the challenge.\"\"\"", "metacritic": null, "released": "2023-11-30", "tba": false, "updated": "2023-12-01T08:42:08", "background_image": "https://media.rawg.io/media/screenshots/e2a/e2a6d3d77ec9ff0df131a9b63b981a70.jpg", "website": "https://hypermoneygames.modoo.at/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HyperMoneyGames"], "genres": ["Simulation"], "publishers": ["HyperMoneyGames"], "esrb_rating": null}