{"id": 973029, "slug": "yeah-wow-hey", "name": "Yeah! Wow! Hey!", "name_original": "Yeah! Wow! Hey!", "description": "<strong><h3>Unfortunately, the multiplayer game is still in beta, and the experience is still being optimized. As an individual game developer, my resources are limited. If you particularly care about multiplayer, please wait until the beta phase of the multiplayer mode is over before purchasing the game. Thank you for your understanding!</h3></strong><br/><br/>Tired of endless climbing? Congratulation you have a new option! This is a high difficulty 3D platform jumping game. The high demand for directional control coupled with minimal room for error makes for more challenging levels. Reaching the top is no easy task.Don't expect any edge climbing to give you any hope to survive, in this game, there are no such lucky ways. All you can do is move, jump, and sprint.<br/><br/>Sounds simple, right? Different from traditional platform jumping games, the control of the view plays a crucial role. The view is closely related to each of your operations and determines your moving direction, sprinting direction, and bouncing or propelling direction. I bet no one has ever thought of playing a platform jumping game like a FPS, relying on precise mouse movement. In addition to this, traditional platform jumping games require precision in timing jumps, avoiding moving obstacles, and taking advantage of sprint distance and direction in order to reach the next platform. These features are all emphasized in this game. Fully utilizing special surfaces for bouncing or propelling is your only way to reach the other side.<br/><br/>Do these blue and green bubbles remind you of another widely acclaimed game? That's right, feel the challenge in a 3D environment, an extension of a dimension. The level is full of various usable mechanisms, so don't rush to take your steps. Carefully observe and judge, taking advantage of these mechanisms, or even shortcuts, are essential for masters.<br/><br/>Don't worry, not that cruel. The game has checkpoints, but not saves. A little mistake will only cost a bit of time. What, you just want to show off having the shortest time? Well, never mind. Take it from me, a true champion who jumps to the top in one breath does not need the lifeboat of saves.<br/>As for the game graphics...what can I say...the trailer and screenshots are hanging right there above.<br/><br/>Supports up to 8 players online（maybe more in the future）, will you regard others as competitors or partners? I believe everyone will have a different answer.<br/><br/>Enjoy!", "metacritic": null, "released": "2023-11-30", "tba": false, "updated": "2023-12-08T05:37:49", "background_image": "https://media.rawg.io/media/screenshots/79f/79f0d31c264c24e33b762872618014a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 465, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Electric Maverick Game"], "genres": ["Action", "Adventure", "Simulation", "Sports", "Racing", "Casual", "Indie"], "publishers": ["Electric Maverick Game"], "esrb_rating": null}