{"id": 973030, "slug": "apocalypse-party-2", "name": "Apocalypse Party", "name_original": "Apocalypse Party", "description": "<h3>The moment of \"Apocalypse\" approaches, this time... ...you fight for yourself!</h3><br/><strong>「Apocalypse Party」</strong> is distinct from the former 「Project Zero」<br/>In this installment, you will delve deeper into this long-standing battle, with the story gradually becoming incredible! Time travel? Apocalypse? Saving the world? You will face many more unknown challenges... ...<br/>But it still retains our beloved RogueLike + mowing-down-enemies combo, and you will face this catastrophe online with your friends (of course, you can also face it alone)!<br/><br/><strong><h3> ■ Engaging and Deep Mechanics ■ </h3></strong><br/><br/><br/><strong>Talent pool expanded to 450! And most of them are mechanics that can change the course of battle</strong><br/>Additionally, there are:<br/>- Hundreds of distinct ranged and melee weapons!<br/>- A plethora of divine ultimate skills!<br/>- 35 varied hero characters, hundreds of unique hero skills<br/>The richness has increased by <strong>more than 10 times compared to the former installment</strong>! Can you build the strongest combo?<br/><br/><strong><h3> ■ Supports Multiplayer, shall we join the hunting party tonight? ■ </h3></strong><br/><br/><br/>Support <strong>up to 3</strong> multiplayer online! <br/>Massive hordes of zombies, exhilarating mowing-down action, why enjoy it alone?<br/>Imagine the joy of roaming through a sea of zombies with your friends!<br/>Call them, support each other, move forward or retreat together, survive here!<br/><strong>Of course, we kindly remind you, a \"friendship-ends\" scenario is not excluded :)</strong><br/><br/><strong><h3> ■ You crave some real challenge, don't you? ■ </h3></strong><br/><br/><br/>In this game, you will face the ultimate challenge.<br/><strong>9 highly challenging Bosses!</strong><br/>Only rapid growth can help you withstand the fierce attacks from the Bosses, accept the challenge, defeat them, and show them who’s boss now!<br/><br/><strong><h3> ■ Perhaps we can do some time traveling! ■</h3></strong><br/><br/><br/>A brand new storyline takes you into this familiar yet strange world, continuing a tale of redemption amidst time traveling:<br/>The tragic death of loved ones<br/>The desperate nuclear explosion<br/>The eerie rebirth<br/>The deathly quiet town<br/>The dark dungeons<br/>... ...<br/><br/><strong><h3> ■ We are continuously focusing on your gameplay experience! ■ </h3></strong><br/><br/><br/>We have keenly listened to the feedback from the players of our former installment, reworked the combat system of the game, continuously bringing more fluid gaming experiences to players.<br/>-Mix and use combat methods like melee weapons, firearms, spells, summoning, witchcraft... ...! They will bring you a fun experience.<br/>-Drive vehicles, summon planes, dragon flying, use otherworldly ninjutsu, even use the mysterious Dual-vector Foi, and more easter eggs await your exploration.<br/>-This game encourages an online experience, but undoubtedly, the single-player part can still experience all the systems and joy of this game.<br/><br/>Smooth operation (handling) is also an important part we continuously focus on！<br/>We have made the game’s operation &amp; flow experience more user-friendly.<br/><strong>Easy to get started, yet \"easy to learn, hard to master\"!</strong><br/><br/><strong>\"Since the apocalypse is here, join us for the last revelry.\"</strong><br/>", "metacritic": null, "released": "2023-11-30", "tba": false, "updated": "2024-03-13T22:18:13", "background_image": "https://media.rawg.io/media/screenshots/76a/76a4b8c07b151002d0654dd3976f1c43.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 298, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Breaker Games"], "genres": ["Action", "Strategy", "Casual", "Indie"], "publishers": ["Breaker Games"], "esrb_rating": null}