{"id": 973060, "slug": "ludde", "name": "Ludde", "name_original": "Ludde", "description": "Explore a charming winter world with Ludde and discover various exciting, challenging, and fun activities for all ages!<h3>Have fun with snow</h3>Roll big snowballs to create a snowman, snow shovel the yard, have a snowball fight with the neighbors, ice fish, practice slapshots in hockey, rent a snowmobile or put on your skis and ski down the mountain. All of this and much more is possible in Ludde.<h3>Be rewarded with golden dog bones</h3>100 golden dog bones connected to 100 different activities to discover and collect. When you have gathered enough bones you'll have access to more items and eventually, you have proven yourself ready to face the evil threat that endangers the peace of Ludde's village.<br/><br/>If you like collectibles then you are in luck. Keep your eye out for coins, chewable pinecones, bulletin boards, and clams, or use your camera to take pictures of snow fairies.<h3>Move fast with vehicles and gear</h3>Rentable snowmobiles (including flyable ones) can be found everywhere, but you can also buy your own or use your skis. If you find hot air balloons, you can use them as fast travel points and fast travel there at any time.<h3>Key features</h3><ul><li> Explore a picturesque winter world and play around with snow<br/></li><li> Discover 100 fun and varied activities spread across the world<br/></li><li> Focus on what you enjoy: explore your surroundings at your own pace and choose which activities you wish to complete<br/></li><li> When you have collected enough golden dog bones you are ready to face the evil walrus<br/></li><li> Move around fast by using snowmobiles, skis, your wingsuit, or hot air balloons<br/></li><li> Thanks to the pick-up-and-play concept and multiple difficulty settings, the game is equally enjoyable for all ages<br/></li><li> Plays flawlessly on Steam Deck</li></ul><br/><br/><br/>", "metacritic": null, "released": "2023-12-01", "tba": false, "updated": "2023-12-08T06:21:31", "background_image": "https://media.rawg.io/media/screenshots/bd6/bd682919b28b88d684ae38d4fc5948a3.jpg", "website": "https://www.shellander.se/ludde", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 306, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Shellander Games"], "genres": ["Action", "Adventure", "Racing", "Casual", "Indie"], "publishers": ["Shellander Games"], "esrb_rating": null}