{"id": 973039, "slug": "holoparade", "name": "HoloParade", "name_original": "HoloParade", "description": "<h3>A lively parade with hololive VTubers and mascot characters!</h3><br/>\"HoloParade\" is a fan game of hololive and the first title to serve as a test case for \"holo Indie\". Collect, nurture, and enjoy watching your favorite characters! It's a 2D tower defense game that offers depth, strategy, and can also be enjoyed casually.<br/><br/>What is \"holo Indie\"?:<br/>It is a general term for a game brand for derivative work games, produced using the \"game creator support program\" with the aim of co-creating with fans and creators of hololive Production around the world.<h3>Feature 1: Simple Yet Deep, Lively Battles</h3>The basic system is a classic 2D tower defense game where you summon characters from your base and march them forward to destroy the enemy's base to win. While the controls are simple, the gameplay is profoundly deep. With over 65 characters, each possessing a variety of abilities like ally healing support and self-destruct attacks, skillful combination and flexible formation are key to enjoying the game.<br/><br/>Additionally, there's an element inspired by parades called the 'Symphony Effect,' where various effects are activated based on the musical instruments played by the characters in march. This adds further strategic depth to the formation of your parade squad and the order of their summoning.<br/><h3>Feature 2: Comprehensive Development Elements</h3>In addition to leveling up and limit breaking, there is a 'Skill' system that allows you to add special abilities not available through regular development. Since you can add up to three types of skills to each character and select them carefully, you can enjoy a unique development process! Furthermore, since you can reset levels and get a full refund of the coins spent, it allows for more freedom in restructuring formations and character development.<br/><h3>Feature 3: No Gacha Purchases, No Stamina System</h3>The scout gacha, which allows you to acquire characters, can be used by consuming tickets obtained within the game, with no additional purchases required. Also, as there is no stamina system, you are not bound by time and can play as much as you like, whenever you like.<br/><br/>Moreover, the scout gacha allows you to choose from two randomly selected character candidates, enabling players to make selections based on their strategy or preference rather than leaving it entirely to chance.<br/><h3>Feature 4: Take a Break with Various Talents and Mini-Games in the Office</h3>When you return to the office, the home screen, you'll be greeted by newly recorded voice lines from Harusaki Nodoka, a staff member of hololive. In the office, talents from hololive may also make appearances, and you might witness some unexpected interactions.<br/><br/><br/>Additionally, mini-games with entirely different gameplay from the main story are implemented. These games allow you to collect coins necessary for character strengthening. At the initial release, a mini-game titled \"Hurry Up! Miko-Chi!\" is available, where Sakura Miko (a VTuber affiliated with hololive) who overslept, dashes at full speed towards her destination while avoiding obstacles. More mini-games are planned to be added in future updates.<br/>", "metacritic": null, "released": "2023-11-30", "tba": false, "updated": "2023-12-08T05:50:29", "background_image": "https://media.rawg.io/media/screenshots/fa3/fa3f58ac52dee610a2f37803c4a5f2b6.jpg", "website": "https://twitter.com/roboqlo", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Roboqlo"], "genres": ["Strategy", "Indie"], "publishers": ["holo Indie"], "esrb_rating": null}