{"id": 973070, "slug": "dr-psycho-hospital-escape-2", "name": "Dr. Psycho: Hospital Escape 2", "name_original": "Dr. Psycho: Hospital Escape 2", "description": "🏥 In the heart of \"Doctor Psycho's Hospital\", you find yourself trapped in a horrible nightmare, a captive of your own tormented mind. The hospital that was once just a mirror in your mind is now a living hell — a place where your deepest secrets and darkest fears have come true. <br/><br/><br/><br/>⚡️Your goal is crystal clear: confront your inner demons, find the hidden items and keys within the hospital's ominous walls and make your way to unlock the escape door that holds your only path to freedom. Escape is your only salvation, but the road is full of danger.<br/><br/>🪓 The survival depends on your stealth, survival skill and quick actions as you navigate the strange halls of a dangerous hospital, when every step you take could be your last. <br/><br/><br/><br/>😈 Search for stuff, avoiding the evil Dr. Psycho and his psychopathic patients, Crazy Butcher and Sewer Clown. Explore the deepest psyche of your character as they face a terrifying and overwhelming nightmare twisted to life. Embrace shadows and hide in unusual places like under beds, closets, toilet stalls to avoid unwanted attention. <br/><br/><br/><br/>💡 Can you conquer your inner demons and discover the secrets of this place, freeing yourself from the clutches of the Doctor's Psycho Hospital? <br/>The line between sanity and madness is blurred as you navigate the dangerous realms of your nightmares. <br/><br/>🤯 Your mind and freedom hang in the balance. Good luck.", "metacritic": null, "released": "2023-12-01", "tba": false, "updated": "2023-12-08T06:36:01", "background_image": "https://media.rawg.io/media/screenshots/7b7/7b73e8df6bde29c979a41cfd33677691.jpg", "website": "https://tearforge.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 419, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Tearforge Studios"], "genres": ["Action", "Indie"], "publishers": ["Tearforge Publishing"], "esrb_rating": null}