{"id": 973020, "slug": "family-arcade", "name": "Family Arcade", "name_original": "Family Arcade", "description": "<h3>'Tis the season to be gaming 🎄</h3>Looking for a way to make your next game night or family gathering even more fun? Look no further than Family Arcade.<br/>Our jam-packed collection is the ultimate stress reliever, guaranteed to bring out your inner child and have you laughing all night long.<h3>Make your holiday season unforgettable with our selection of games that are sure to get everyone into the Christmas spirit 🎅 </h3>Our games are perfect for all ages and skill levels, so everyone can join in on the fun. From classic party games to the latest hits, Family Arcade has something for everyone:<br/><br/>🎲 Scavenger Hunt is tailored for young minds.<br/>🎲 Pop the Pumpkin is a great game for teens who are looking for a fun and more challenging experience.<br/>🎲 Hyperdrive is crafted for mature players seeking an adrenaline-fueled experience.<br/>🎲 Wordsmith is designed to appeal to seniors who are looking for a fun and mentally stimulating activity.<br/><br/>In addition to our wide selection of Christmas games, our Home screen also features over an hour of Christmas songs to get everyone in the holiday mood!<h3>Perfect for family game nights or solo holiday cheer, this pack will bring hours of fun and nostalgia to your home!</h3>", "metacritic": null, "released": "2023-12-01", "tba": false, "updated": "2023-12-08T05:23:54", "background_image": "https://media.rawg.io/media/screenshots/8e7/8e78d85b97f0311aa5ab2713b54e1693.jpg", "website": "https://familyarcade.gumroad.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Family Nights"], "genres": ["Casual", "Indie"], "publishers": ["Family Nights"], "esrb_rating": null}