{"id": 973093, "slug": "the-red-juggernaut", "name": "The Red Juggernaut", "name_original": "The Red Juggernaut", "description": "A retro-style <strong>JPRG</strong> crossed with a<strong> modular ship building</strong> &amp; combat game.<br/><br/>Level up your ship, build it bigger...<br/><br/><br/><br/>Battle enemy ships...<br/><br/><br/><br/>Explore the solar system...<br/><br/><br/><br/>And save the human race!<h3>Detailed Info:</h3><br/>You start off with three blocks (engine, mounting block, cockpit) that you can rearrange as you like, when you defeat enemies you gain XP, can level up to get more blocks to add to your ship. You also get money for defeating enemies, and you can buy things at space stations. Mountable weapons (<strong>guns, machine guns, lasers, launchers</strong>), a mountable <strong>shield</strong>, ammo (<strong>torpedoes and emp torpedoes</strong>), and consumable items for heating and in-battle stats increases. You can also find weapons and other items in certain places in the map.<br/><br/>You must make your way through the map and the various \"dungeons\" to find and defeat the Red Juggernaut. There are <strong>over 30</strong> types of enemy ships that you will encounter as you travel, with a varying degree of difficulty. In battle, once you drop their defense screens you can damage blocks individually. If you destroy a component that causes a large portion of the enemy ship to be detached from it's cockpit, those orphaned blocks will be destroyed as well. You can also evade torpedo strikes, and make yourself less vulnerable to attack by using your engines. As well, you can utilize <strong>EMP strikes</strong> to take down enemy shields, and disable enemy weapons temporarily.<h3>Controls:</h3><br/><ul> <li> Supports XBOX style controllers: DPad, A, B<br/> </li><li> Keyboard: Arrow Keys, Space/Enter for A, Z/Escape for B</li></ul><h3>Credits:</h3><br/><ul> <li> chadams - Coding, art, music, sfx<br/> </li><li> Lil Lyon - Beta testing<br/> </li><li> LZ - Beta testing</li></ul>", "metacritic": null, "released": "2023-12-01", "tba": false, "updated": "2023-12-08T07:08:01", "background_image": "https://media.rawg.io/media/screenshots/e45/e458c59a93fbe897f6ff37205180cf0a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Chadams Studios"], "genres": ["RPG", "Indie"], "publishers": ["Chadams Studios"], "esrb_rating": null}