{"id": 973185, "slug": "conclave-virtual-tabletop", "name": "Conclave Virtual Tabletop", "name_original": "Conclave Virtual Tabletop", "description": "Conclave is a simple and intuitive way to take your TTRPG campaign to the next level, whether your group is playing in the same room or scattered across the realms.<br/><br/><br/><br/>Conclave is all about the experience, not the numbers. There's no managing stats or fiddling with complex mazes of menus; we'll assume you've already got the character sheets covered. Instead, we aim to provide a customizable space with easy and straightforward tools for you to build and play out your sessions.<br/><br/><br/>Conclave includes an array of tools to help you on your journey, including dice, measuring tools, status effects, and a fog painting system. We've included some assets to get you started, but this is your game; your story. Who are we to decide what's in it? You can quickly and easily import everything you need for your session: maps, tokens, portraits, and even 3D minis!<br/><br/><br/>Conclave supports the Hero Forge® Access Key, meaning you can connect your account to unlock your library of customized digital miniatures. You'll unlock 5 free minis when you connect your account!<br/><br/><br/><br/>Change time of day, lighting, and even weather and nature effects to get the vibe you want. Conclave's minimalist design means it gets out of the way when you need it to so players can focus on the story and experience you're building together.<br/><br/><br/>Conclave aims to not only replicate the classic tabletop gaming experience, but also enhance it, and make it easier than ever to get your group together. Conclave is built with local multiplayer in mind, so players in the same room can simply pass a controller or two around. Online players needn't worry though, as Conclave fully supports Steam's Remote Play Together service. With just a single copy of Conclave, the whole party can play and create together.<br/><br/><br/><br/><br/>Conclave is designed primarily to facilitate tabletop RPGs, but there's no rule that says you can't branch out. If it involves moving pieces on a board, there's probably a good chance you can play it with Conclave.<br/><br/><br/><br/>We invite you to join our growing Discord community, where you can look for a group, talk about your campaign, or just chat with us. We're looking forward to being a part of your next adventure.", "metacritic": null, "released": "2023-12-04", "tba": false, "updated": "2023-12-08T09:23:49", "background_image": "https://media.rawg.io/media/screenshots/efe/efe864fa884fa0ce8a031a5f672de1e3.jpg", "website": "https://aggressivecombustion.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aggressive Combustion"], "genres": ["RPG", "Simulation", "Indie"], "publishers": ["Aggressive Combustion"], "esrb_rating": null}