{"id": 973242, "slug": "bugs-n-guns", "name": "Bugs N' Guns", "name_original": "Bugs N' Guns", "description": "Bugs N' Guns is a cooperative third person shooter.  Players take the role of Bugs and Guns two employees working as trash disposal for the crappiest company in the world.  Tasked with finding and escorting a \"cargo\" train named MARC - OS that was lost in an alien environment players will need to work together to survive the hostile flora and fauna that will impede their path.<br/>\n<br/>\r\nCOOPERATIVE<br/>\n<br/>\r\nThe most important feature in Bugs N´ Guns is that this game requires two people to play.  Not only is it impossible to play without another player but within the game all the challenges players will face require cooperation otherwise, defeat is assured.<br/>\n<br/>\r\nONLINE- LAN<br/>\n<br/>\r\nIn order to play this game players require an internet connection.  Once inside the game player may choose to play either on LAN or by choosing to play with random people on a public match or playing with friends through private matchmaking.<br/>\n<br/>\r\nSHOOT AND COMBINE<br/>\n<br/>\r\nThe main way players interact with the world of Bugs N´ Guns is through shooting.  Shoot to protect, kill, and cooperate.  That is correct in this game players can generate elemental effects with their weapons and these elemental effects can combine with the weapons of the other player providing players with more fire power when they choose to work together.<br/>\n<br/>\r\nPROTECT THE TRAIN<br/>\n<br/>\r\nThe main goal in this game is to escort the train M.A.R.C - OS.  Through out the game the train will guide players through a series of crazy scenarios forcing the players to adapt or die.  The most important thing to understand is that players can die all the times they want, but if the train dies, the game is over.", "metacritic": null, "released": "2023-12-07", "tba": false, "updated": "2023-12-08T10:51:54", "background_image": "https://media.rawg.io/media/screenshots/d1f/d1f04bd2e40a95c92bc911dc4609aa81.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 426, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blinkshot"], "genres": ["Action", "Adventure"], "publishers": ["U-tad"], "esrb_rating": null}