{"id": 973274, "slug": "bug-seek", "name": "Bug & Seek", "name_original": "Bug & Seek", "description": "Being developed by a tiny, two-person dev team, Bug &amp; Seek is a relaxing, open-ended, bug catching sim/creature collector with a mystery twist. In Bug &amp; Seek, you've just sunk your life savings into buying an abandoned Insectarium (bug museum)! Once the lifeblood of the town and its economy, someone stole all the bugs in the dead of night. Now it's up to you to catch and sell bugs, fulfill requests from the local shops, and re-establish the Insectarium as a town icon. <strong>Become a master bug hunter</strong> as you level up your bug-catching skills, upgrade your equipment, and expand your Insectarium. Meet the locals and complete quests to earn special items and discover what really happened during The Great Bug Heist. And relax! There are no wrong choices, no energy levels to worry about, and plenty of time to complete quests and jobs.<br/><br/><strong>*Works great on Steam Deck!*</strong><br/><br/><br/><br/><ul><li><strong>Catch Bugs</strong> -- With over 175 different real-life bugs, ranging from common insects to some of the most rare and valuable insects in the world, the possibilities are endless. And every bug comes with a humorous tagline and true, informative short description. You'll never look at real insects the same way again.<br/><br/><br/><br/><br/></li><li><strong>Customize and Expand Your Insectarium</strong> -- Customize everything, from what tanks you use to what flooring, decorations, and wallpaper you have in your Insectarium. Upgrade your bug-catching equipment and your wardrobe. Build new wings to the Insectarium and create the best Insectarium the town has ever known. And of course, fill it with bugs!<br/><br/><br/><br/><br/></li><li><strong>Explore The World</strong> -- Bugs live in every kind of habitat: from meadows, deserts, and forests to wetlands, beaches, and urban environments. And wouldn't you know it? Buggburg has all of these! Explore the variety of biomes in every season, with Buggburg's booming Town Square in the heart of it all.<br/><br/><br/><br/><br/></li><li><strong>Talk with the Locals</strong> -- From the mayor to the herb farmer, meet the 19+ locals of the town and perform missions for them to earn special gear and items, secrets and gossip, and maybe even haikus.  <br/><br/><br/><br/><br/></li><li><strong>Solve the Mystery</strong> -- One year ago someone broke into the Insectarium in the middle of the night and stole all of the bugs in an incident known as The Great Bug Heist. The Insectarium was shut down, and a vital piece of the Buggburg economy ground to a halt. As the new owner of the Insectarium, see if you can piece together what really happened as you solve the mystery and unmask the guilty party!<br/><br/><br/><br/><br/><br/><br/><strong>Our studio is just the two of us!</strong> <br/><br/>Don't forget to wishlist and follow the game and to and join the  Bug &amp; Seek Discord to stay up to date!</li></ul>", "metacritic": null, "released": "2023-12-06", "tba": false, "updated": "2023-12-08T11:41:35", "background_image": "https://media.rawg.io/media/screenshots/e95/e95c69e0a6641473afda4b041a9a00c7.jpg", "website": "https://www.sopeculiar.com/bugandseek", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["So Peculiar"], "genres": ["Simulation", "Indie"], "publishers": ["So Peculiar"], "esrb_rating": null}