{"id": 973248, "slug": "chessarama", "name": "Chessarama", "name_original": "Chessarama", "description": "Chessarama is a collection of original puzzle and strategy games inspired by Chess. It reimagines chess rules and tactics using many different themes. Each game has its own set of rules, visual theme and original handcrafted challenges for you to play!<h3>Key Features:</h3><ul><li> Play 8 exclusive chess-inspired games available in Chessarama;<br/></li><li> Puzzle campaigns featuring 100+ levels plus 100+ unique challenges;<br/></li><li> 24 exclusive Chess Figures to unlock and collect;<br/></li><li> Unique art style, with beautiful dioramas;<br/></li><li> Daily and Weekly Challenges;<br/></li><li> Compete against each other on the leaderboards;<br/></li><li> Learn chess movements, tactics and strategies through a modern video game experience;<br/></li><li> Also includes “Classic Chess” for you to put your learnings into practice!</li></ul><h3>Many Chess Worlds for You to Explore!</h3><br/>Here are all the original games you will find in Chessarama: (1) Farm Life; (2) Dragon Slayers; (3) Street Soccer; (4) Lady Ronin; (5) Last Stand; (6) Knight Supreme; (7) Pawn Mania; (8) Soccer Chess.<br/><br/>Take a look at some of the Chessarama games:<br/><br/>In <strong>Dragon Slayer</strong>, you need to push your pawn to the end of a path in order to kill the mighty dragon. But it will not be that easy! The dragon attacks the board every time the pawn moves and every undefended piece will die.<br/><br/><br/><br/>In <strong>Lady Ronin</strong>, Chess meets Sokoban. You play with a Ronin (a chess queen) and you <br/>need to eliminate the other pieces in order to get close to the Shogun and kill it. Pieces move like in chess, but push each other like in sokoban.<br/><br/><br/><br/>In <strong>Soccer Chess</strong> you will play a soccer match using chess pieces. You will need to think a few moves ahead if you want to break through the adversary's defenses to score a goal.<br/><br/><br/><br/>This is just some examples about how Chess can be reinvented. Welcome to Chessarama!", "metacritic": null, "released": "2023-12-05", "tba": false, "updated": "2024-02-11T07:08:55", "background_image": "https://media.rawg.io/media/screenshots/6d7/6d73132e4475a561ab0daa13f7c8fece.jpg", "website": "https://chessarama.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Minimol Games"], "genres": ["Strategy", "Casual"], "publishers": ["Hawthorn Games", "Minimol Games"], "esrb_rating": null}