{"id": 97322, "slug": "serious-arpg", "name": "Serious ARPG", "name_original": "Serious ARPG", "description": "<p>\r\n\tPlay as this barbarian guy as you travel the land slaying monsters, getting epic loot and reaching max level. Use your mighty axe and several spells learnt along the way to decimate your foes in this non-stop action role playing game.\r\n</p>\n<p>\n<strong>Featuring:</strong></p>\n<ul>\n<li>Procedurally generated items let you build your character in many exciting ways</li><li>Over 55 Ultimate pieces of gear your get your hands on, if you are lucky</li><li>5 Item sets to collect that gain power as you collect them</li><li>All 8 spells are customizable by collecting Ru'abra, magical artifacts found in the world, to increase damage, range, add effects and more</li><li>Small intro story</li><li>4 Runs to tackle with their own monsters and drop tables</li><li>The Gauntlet - an increasing difficult challenge with increasing awesome rewards; How long can you last!</li></ul>\n<p>\n<strong>This game is in development; features are likely to change</strong></p>\n<p>Controls:</p>\n<ul><li>Click to move to a location, click on an enemy to attack them with Slash</li><li>Right Click to use Gust (once unlocked) toward where you clicked</li><li>Use the number keys to cast your other spells (Call lightning will cast at your cursor position</li><li>Hotkeys: I for Inventory, S for Spells, P for stat Points</li><li>Right click to equip/unequip items or drag them</li><li>Shift left click to disenchant items for magic, which can be used to enchant your gear</li><li>Hovering over an item will show its stats and how much it changes your offence, defence and healing</li><li>Custom Key bindings are planned for a future patch</li></ul>", "metacritic": null, "released": "2017-05-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d71/d71ee2002d9a0a1bbbbd36f516500cee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Orsailius"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}