{"id": 973207, "slug": "time-hunters-mikuihuang-jin-xiang-nozhou-i", "name": "TIME HUNTERS: ミクイ黄金像の呪い", "name_original": "TIME HUNTERS: ミクイ黄金像の呪い", "description": "ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー<br/><br/><strong>This game was made by new-hires to Byking Inc. during an introductory training period.<br/>We ask for your understanding, for issues arising from certain operating environments,<br/>or for any flaws or inadequacies present in the final product.<br/><strong>This game was made for local play,<br/>but supports online via Steam Remote Play Together.</strong><br/><br/>ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー<br/><br/><strong>*This title cannot be played using a keyboard or mouse*<br/>*Four controllers are required to play, and this title is for local play only*</strong><br/><br/>Are you ready?! Make some noise (and some enemies) in this action-packed party shooter for 4! <br/>Utilize your unique energy shots, power-up your attacks with an array of pick-ups, and get set to take down the competition!!<br/><br/>4 players enter the arena…but the Curse of the Golden Idol demands that only 1 may leave. …will it be you?<br/><br/><br/><h3>🔷A 4-Way Battle Royale Shooter Extravaganza!🔷</h3>You get a gun, they get a gun. Everybody gets a gun!<br/>Shoot your way to victory and be the last Hunter standing!<br/><br/><h3>🔷Watch Your Back Out There!🔷</h3>Who to aim for and when to do it, careful consideration of your and your enemies’ <br/>resources could nab you victory…or see you lose it all!<br/>Can you make the right decisions under pressure? Only time will tell…<br/><br/><br/>🔷The Golden Idol’s Curse!<br/>🔷ime Hunters are equipped with special guns…and special bullets. Bounce shots off walls to catch your foes off-guard!<br/><br/>And oh, what’s this? The Golden Idol demands a good fight! Pick up glowing, <br/>Golden Idols scattered round the arena, and augment your shots with various buffs for maximum mayhem!<br/><br/><strong>＞BOMB Shot＜</strong><br/><br/>Penetrates walls and SHIELDs. Use it for explosive results!<br/><br/><strong>＞BIG Shot＜</strong><br/><br/>Size matters. Fire away and leave them with nowhere to run!<br/><br/><strong>＞3-WAY Shot＜</strong><br/><br/>A 3-WAY spreadshot. Never let them know your next move!<br/><br/><strong>＞BOUNCE Shot＜</strong><br/><br/>More BOUNCE, more mileage. Ricochets 3 times for off-the-wall fun!<br/><br/><strong>＞SHIELD＜</strong><br/><br/>Protect yourself from devastation...once! (Look out for BOMBs though!)<h3>🔷Two Buffs are Better than One!!🔷</h3>Does the power of the Golden Idol know no bounds!? (2, the bounds is 2)<br/>Grab 2 different buffs, and reap the benefits of both at once. One Hunter’s meat is another Hunter’s <br/>3-WAY explosive BOMB Shot to the face, so pick your poison and start a-blastin’!<br/><br/><br/><br/>The fabled BIG + BOMB Shot!<br/><br/><br/>The legendary 3-WAY + BOMB Shot!<h3>🔷A Smart Hunter’s a Happy Hunter!🔷</h3>Whoa okay trigger-happy, hold on. Shooting up the place will only get you so far! <br/>Keep track of your dash and remaining buff counts, and those of rival Hunters, for the greatest chance at success!<br/><br/>Got all that? Alright. Now go catch ‘em with their pants down, and have a good Time Hunting!<br/><br/></strong>", "metacritic": null, "released": "2023-12-04", "tba": false, "updated": "2023-12-08T09:58:04", "background_image": "https://media.rawg.io/media/screenshots/0e5/0e5ad3d4a7c167212a362ba0b88b41c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 280, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Byking"], "genres": ["Action", "Indie"], "publishers": ["ByKing"], "esrb_rating": null}