{"id": 973206, "slug": "parryrobot", "name": "ParryRobot", "name_original": "ParryRobot", "description": "ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー<br/><br/><strong>This game was made by new-hires to Byking Inc. during an introductory training period.<br/>We ask for your understanding, for issues arising from certain operating environments,<br/>or for any flaws or inadequacies present in the final product.<br/><br/>ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー<br/><br/>PARRY ROBOT is a 3D action game where you play as a tiny but agile robot, “PAR 12-H”. Using the game’s “Parry System”, you are tasked with overcoming the mysterious, hulking “TB 001-L”…a massive automaton who’s set its eyes on your metallic hide!<br/><br/><strong>♦STORY</strong><br/>Centuries into the future, the world as we know it has crumbled. Unnamed conflicts and environmental disasters have wiped civilization, and indeed most forms of life from the earth.<br/>Among these ruins a little robot wanders aimlessly, as it has for many days past. Another day, another broken structure, another empty square.<br/>But what’s this? From an abandoned factory comes signs of…life? A massive automaton fades into view but is it friend…or foe…<br/><br/><strong>♦CHARACTERS</strong><br/>Compact Operating Robot “PAR 12-H”<br/>The playable character, a small but agile robot.<br/>Plucky in nature, it is unafraid of tackling larger obstacles and foes with its “Parry System”.<br/><br/><br/><br/><br/>Hulking Automaton “TB 001-L”<br/>A large and mysterious automaton clad in heavy steel.<br/>Has the potential to mortally wound a lesser robot in a single strike with its deadly arsenal…<br/><br/><br/><br/><br/><strong>♦SIMPLE BUT EFFECTIVE</strong><br/>Move, jump, regular attacks, and parries. Fight your way to victory with these 4 basic inputs.<br/><br/>[img{STEAM_APP_IMAGE}/extras/1.gif[/img]<br/><br/>♦PARRY SYSTEM<br/>Timing the Parry button to your opponent’s attacks is key.<br/>A good parry lets you avoid taking damage, strike back, and even recover some lost HP or increase your attack.<br/><br/>[img{STEAM_APP_IMAGE}/extras/2.gif[/img]<br/><br/>♦PERFECT PARRY<br/>A “Perfect Parry” is harder to pull off, but deals more damage.<br/>It can even stun, offering the chance for a few free hits while the opponent recovers.<br/><br/><br/><br/>♦TIME ATTACK<br/>The clock is ticking till you beat the boss.<br/>Use the “Parry System” and Perfect Parry well, and aim to clear the game as quickly as you can!</strong>", "metacritic": null, "released": "2023-12-04", "tba": false, "updated": "2023-12-08T09:56:33", "background_image": "https://media.rawg.io/media/screenshots/f85/f850f60ac29816300526fa138cc934ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 281, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Byking"], "genres": ["Action", "Indie"], "publishers": ["ByKing"], "esrb_rating": null}