{"id": 973203, "slug": "war-operation-full-contact", "name": "WAR OPERATION: Full Contact", "name_original": "WAR OPERATION: Full Contact", "description": "WAR OPERATION™: Full Contact is a third-person shooter game, its first early access version features multiplayer network mode and sends you straight back to April 2003, in the heart of Iraq, in the midst of a frighteningly intense confrontation. The Iraqi army against the U.S. Marines, choose your side, your class, your weapons and run through the streets of Baghdad, near Firdos Square, frozen in the days of Saddam Hussein's regime. A unique and exceptional experience never seen before.<br/><br/>WAR OPERATION™: Full Contact, offers in its firstly early access version. 2 game modes 16 vs. 16 : Team Deathmatch and Zone Capture. Keep an eye on our roadmap to know more about upcoming modes and maps.<br/><br/><br/><br/><br/>Since the 1980s, Western countries have wanted to demonstrate their power by showing their military capacity in wars whose justifications are still questionable.<br/><br/>Conspiracies causing irreversible consequences for innocent populations, the tragic event of September 11, the most significant of the 21st century, are one of the proofs of the challenges against Western powers.<br/><br/>How does a group of Afghan peasants manage to arm themselves with a Western power, defeat the Soviets and then turn against this same power? What were the stages of the long march of the Iraqi president towards the conquest of absolute power, establishing a powerful military influence in the region, and of his downfall through the Iraq war? How did the illusion of the Islamic State settle in the fault lines caused by Western powers in Iraq? How has the Middle East become a battleground for countries around the world, a hotbed of international terrorism, all to the detriment of local populations?<br/><br/><strong>WAR OPERATION™: Full Contact</strong> retraces historical elements from the Afghanistan War to the Syrian Civil War, through the fall of the Iraqi regime, result of Eastern world fracture.<br/><br/><br/><br/><br/><strong>In multiplayer</strong>, take possession of a side and face your opponents through realistic and breathtaking environments of modern world in a dynamic third-person game.<br/><br/><h3>Technical features of Early Access - First Version</h3><ul><li>  1 iconic map: Firdos Square<br/></li><li>  2 camps: The American marines against the Iraqi Army including the Fedayeen.<br/></li><li>  2 gamemodes : Team deathmatch, Zone control<br/></li><li>  Integrated online chat<br/></li><li>  Online Ranking<br/></li><li>  A unique soundtrack<br/></li><li>  Dynamic gameplay and characters movements<br/></li><li>  Dynamic sound system</li></ul><br/>Warning the first version of early access have Firdos map bounded to Palestine Hotel. It may have bugs and missing objects and textures.", "metacritic": null, "released": "2023-12-04", "tba": false, "updated": "2023-12-08T09:52:45", "background_image": "https://media.rawg.io/media/screenshots/9c9/9c942e5bbccc75c6833540347a314342.jpg", "website": "http://waroperation.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 308, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Longmire Studio"], "genres": ["Action", "Adventure", "Strategy"], "publishers": ["Longmire Studio"], "esrb_rating": "Adults Only"}