{"id": 973335, "slug": "back-then", "name": "Back Then", "name_original": "Back Then", "description": "We all live with the fear of reaching the shadow of dementia. The ultimate fear of forgetting. The fear of not remembering our past, what led us here. <strong>For who do we become when we forget who we are?</strong><br/><br/><br/><br/>Back Then is a <strong>first-person narrative game journey</strong> taking place in the mind of Thomas Eilian, an elderly writer diagnosed with <strong>Alzheimer's Disease.</strong><br/>The gameplay, presented in first-person perspective, is <strong>story-driven</strong> and is heavily focused on interactions, puzzles and detective exploration.<br/><br/><br/><br/><strong>Stuck in a Wheelchair</strong>, players find themselves lost in a house, discovering more about Thomas and his family by unlocking new rooms, collectibles, objectives and puzzles. Together, both the player and Thomas attempt to discover who they are, listening to the monologues of Thomas and his family, detailing their own struggles and perspectives of the situation at hand.<br/><br/>Players traverse through the four seasons of the year, going back and forth between the House and Dreamlike Sequences as Thomas attempts to unravel <strong>what his life meant</strong>.<br/><br/><br/><br/><br/><br/>Back Then is a game for people who are in search of unconventional and new story-rich experiences.<br/>It appeals to a more general audience, emphasizing on the game's atmosphere, soundtrack, and narrated-exploration to deliver players a poetic and emotional story.<br/><br/><ul><li>In-depth narrative and storytelling experience.<br/></li><li>Detective exploration and puzzles.<br/></li><li>Creative gameplay and events related to Alzheimer’s and forgetfulness.<br/></li><li>Inspired by personal events, involving the team's loved ones and family.</li></ul><br/><br/><br/><br/><br/><strong>Back Then</strong> is a story about Time, Death, and who we become <strong>when we forget who we are</strong>.<br/><br/>Through this story we hope to make as many people as we can <strong>uncomfortable, but aware</strong> to the reality of millions around the world diagnosed with Dementia and Alzheimer's Disease.<br/><br/><br/><br/>We know what it's like... To have someone whom we love no longer even recognise you.<br/>We become familiar strangers in their eyes.<br/>We dedicate this game to you, your loved ones...<br/>And all who were <strong>back then.</strong>", "metacritic": null, "released": "2023-12-07", "tba": false, "updated": "2023-12-11T04:11:50", "background_image": "https://media.rawg.io/media/screenshots/5bd/5bda02d9336ae2391310a77d250d8279.jpg", "website": "https://octopusembrace.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 321, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Octopus Embrace"], "genres": ["Adventure", "Indie"], "publishers": ["Octopus Embrace"], "esrb_rating": null}