{"id": 973316, "slug": "scp-087-b-ue-remake", "name": "SCP-087-B UE Remake", "name_original": "SCP-087-B UE Remake", "description": "SCP-087-B UE Remake is a fan game based on the original SCP-087-B make by Joonas Rikkonen, a single-player horror experience from the point of view of a D-Class sent to explore what lurks below in the unexplored and undocumented depths of an ever-changing brick and concrete staircase. Equipped with only a lighter, the D-Class must navigate dozens of floors until they reach, or rather if they reach, the lowest level. <br/><br/>Much of the audio, graphics and monster design is loosely or directly based on the original design of SCP-087-B, with several more creatures and threats added in beyond the scope of the original.<br/><br/><br/>Foundation Operatives grant all D-Class limited access to the associated documentation on this anomaly before entry, and recommends all subjects to brief themselves with the information before entry:<br/><br/><strong>Item #:</strong> SCP-087-B<br/><br/><strong>Object Class:</strong> Euclid<br/><br/><strong>Special Containment Procedures:</strong> SCP-087-B is located on the campus of [REDACTED]. The doorway leading to SCP-087-B has been disguised to resemble a storage closet consistent with the design of the building. The lock mechanism on the doorknob will not release unless ██ volts are applied in conjunction with counter-clockwise rotation of the key.<br/><br/>Due to the results of the first exploration (see Document 087-B-I), the door handle and locking mechanism have been removed from the inside of the door. Any personnel who enter beyond the threshold of SCP-087-B are presumed dead, and the door must not be opened if motion is detected inside.<br/><br/><strong>Description:</strong> SCP-087-B is an unlit concrete staircase with brick walls. The dark interior of SCP-087-B limits subjects to a visual range of approximately 1.5 meters. A light source is required for any subjects exploring SCP-087-B, as there are no lighting fixtures or windows present. Lighting sources brighter than a lighter flame have shown to be ineffective, as SCP-087-B seems to absorb excess light.<br/><br/>The entrance to SCP-087-B is inside a small room which was formerly used as a storage closet. When two or more subjects enter the room, it appears as a rectangular room with solid concrete walls and a single wooden doorway. Subjects have always described a sense of uneasiness when present within the room, despite having little to no awareness of the anomalous properties of the location.<br/><br/>Subjects who have entered this storage closet alone report observing a brick hallway opposite the entry doorway after they have been sealed within the room. Radio communication with subjects that enter the hallway becomes increasingly difficult as they descend the staircase, and attempts to converse with subjects which have gone beyond the 6th floor has proven difficult. <br/><br/>The full extent of SCP-087-B's anomalous properties are unknown, and further expeditions have been approved.", "metacritic": null, "released": "2023-12-07", "tba": false, "updated": "2023-12-08T12:42:51", "background_image": "https://media.rawg.io/media/screenshots/0f6/0f640b1accba67eca01d84a8d843d458.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chris Korth"], "genres": ["Adventure", "Indie"], "publishers": ["Chris Korth"], "esrb_rating": null}