{"id": 973340, "slug": "seaorama-world-of-shipping", "name": "SeaOrama: World of Shipping", "name_original": "SeaOrama: World of Shipping", "description": "In Seaorama: World of Shipping, you'll have access to a fleet of over 17 types of ships and 90 port locations. But getting goods from one port to another is just the beginning…<br/><br/><strong>Start Your Own Shipping Company</strong><br/><br/>Embark on a thrilling entrepreneurial journey as you establish and nurture your very own shipping company in Seaorama: World of Shipping. Begin with a single vessel and transform it into a maritime empire. Strategize, invest wisely, and watch your company grow from humble beginnings to a dominant force in the global trade arena.<br/><br/><strong>Plan Trade Routes Between 90 Port Locations</strong><br/><br/>Create your own trade routes across an expansive world map featuring 90 port locations. Each destination offers unique challenges and opportunities. Analyze market trends, factor in geopolitical events, and master the art of logistics to optimize your routes for maximum profitability and efficiency.<br/><br/><strong>Manage Your Ships &amp; Contracts</strong><br/><br/>Take control of a versatile fleet comprising 17 types of vessels. From cargo vessels to container ships, ensure that your fleet is well-maintained and equipped. Strike lucrative contracts with clients and meticulously oversee every aspect of your shipping operations. Adapt to unforeseen challenges and keep your cargo moving, no matter what obstacles arise.<br/><br/><strong>And Rise as the Shipping Industry's Next Kingpin!</strong>", "metacritic": null, "released": "2023-12-13", "tba": false, "updated": "2024-01-18T23:21:00", "background_image": "https://media.rawg.io/media/screenshots/73f/73f7cad537f854f75e281b1649baba00.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 13, "owned": 2, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Hidden Tower Studios", "SeaOrama"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["PID Games"], "esrb_rating": null}