{"id": 973306, "slug": "midnight-blanc", "name": "Midnight Blanc", "name_original": "Midnight Blanc", "description": "<h3>SUMMARY</h3>In 1928, a new star in the midnight sky brought with it hope and everlasting peace. A welcoming nova of intense burst radiation stripped Earth's protection as an age of prosperity would fall. In a state of emergency, with a cracked core and showers of radiation unleashing the foulest creatures of the depths, the Earth found itself in the middle of a larger and older cosmic conflict of grand scale.<br/><br/>Enforced conscription during a time of crisis tasked a group of locals to design and construct an airplane capable of reaching anominal readings detected over the North Atlantic. With a deadline arriving, a machine was hastily thrown together out of wood, fabric and a metal tube frame with minimal instruments. A resolute word from management selected you to be the pilot. A map has been produced for you, with strict instructions that you must immediately return your findings.<h3>GAMEPLAY</h3>Set primarily in a flying claustrophobic fuel tank with an engine and a seat, you must fly and navigate using your map, course notes and stopwatch. Nobody will find you if you get lost over the open sea all by yourself. The windshield was removed to fit fuel needed, which means your forward vision is limited. You must instead trust your life on the instruments in front of you to come back alive.<br/><br/>Provided by the higher-ups in the military is a top secret aerial reconnaissance camera you must use to assess the selected locations. The government will use this as proof against you in case of insubordination.<br/><br/>Strange creatures from below notice your presence. The fear of getting lost eats you from the inside, you must stay alert and stay on course. No room to stretch your legs, no rest, no fuel gauge, creaks emanating from structural issues, will the machine will hold together? You pray, as the depths of the Atlantic does not like visitors.<h3>FEATURES</h3><ul><li> Low fidelity graphics.<br/></li><li> Immersive setting with focus on audio design and mechanics.<br/></li><li> Unsettling atmosphere flying alone in the dark over the ocean.<br/></li><li> Unease of becoming lost and forgotten.<br/></li><li> Additional hard achievement for completionists.</li></ul>", "metacritic": null, "released": "2023-12-07", "tba": false, "updated": "2023-12-08T12:29:46", "background_image": "https://media.rawg.io/media/screenshots/504/5047be14bbfb9179ddded44b4667e4ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Movisum"], "genres": ["Adventure", "Strategy", "Simulation", "Indie"], "publishers": ["Movisum"], "esrb_rating": null}