{"id": 973305, "slug": "endless-glory", "name": "Endless Glory", "name_original": "Endless Glory", "description": "The main goal of the game is continuous progression through stages, achievable through strategic management. <br/>Strengthen your army in every possible way and advance further on the path to endless glory!<h3>Gameplay</h3>First and foremost, you will need to recruit units into your army. <br/>Choose your units wisely. Each unit has different characteristics with both strengths and weaknesses. After assembling your army, battles become accessible.<br/>In battles, your army fight with enemies automatically. Upon victory over enemy units and completion of each stage, you earn gold, which can be used to enhance your army.<br/>The strongest players will be shown on the leaderboard.<h3>Features</h3>Direct control over units is not available, so you need to strengthen your army through other means:<br/>1) By upgrading skills, you can improve the characteristics of your units.<br/>2) After acquiring spells, you can use them in battle to enhance your units or harm the enemy.<br/>3) In the armory, you can purchase and equip items that provide additional capabilities to your units and enhance their characteristics.<br/>4) You can also appoint a general to your army, who will strengthen specific aspects of your units or provide additional abilities, not presented before.<h3>Challenges</h3>Once an hour, you can undertake challenge. In a challenge your army faces big wave of reinforced enemies. Winning in this trials rewards you with gold and crystals, which can be spent in a separate shop to acquire unique additional capabilities to aid you in battles. Challenges also progress with the strength of your army, allowing you to advance further and further.", "metacritic": null, "released": "2023-12-07", "tba": false, "updated": "2023-12-08T12:28:32", "background_image": "https://media.rawg.io/media/screenshots/48e/48e8292d14f2f2889881ad0d282f2a6d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 305, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Cupuyc1989 Games"], "genres": ["Action", "RPG", "Strategy", "Indie"], "publishers": ["Cupuyc1989"], "esrb_rating": null}