{"id": 973499, "slug": "solomons-link", "name": "Solomon's Link", "name_original": "Solomon's Link", "description": "<h3>FREEDOM IN CHAINS</h3><strong>Solomon's Link</strong> is a short (~20 minutes), experimental, story-driven, point-and-click, in which you serve unseen as both witness and guide to a pair of fugitives living out their first night of freedom after years behind bars. With two vastly different minds and two specialized sets of hands to work with, lead the escaped convicts through an industrial maze of fuse boxes and factory lines by leveraging each prisoner’s strengths to offset their partner’s mental and physical limits - not to mention, the limited reach of the chain that binds them together.<h3>PRISONERS’ DILEMMA</h3>In the process of their escape, jailbirds L.T. and R.T. broke free from their chain gang, but not from each other, leaving each of them bound to a criminal they hardly know, guilty of crimes they’d never learned. With no choice but to work together, yet no clue of each others’ intentions, each is left to weigh their mutual dependence for survival against the looming threat of betrayal, and balance the trust needed to move forward against the deceit necessary to stay safe. For better, or for worse - every word that is spoken, and every thought that goes unsaid, holds a chance to tip the scales.<h3>FLY ON THE WALL</h3>Justice is blind; you are more fortunate. Watch the world from above through the countless eyes of the factory’s security system, and hear the whispers of the concrete jungle with environmental sounds packed full of custom-made foley. Independently control R.T. and L.T. in both movement and conversations through simple, intuitive UI, stay immersed with menus designed to help you settle into the role of an investigative observer, and indulge in a fully-fledged original soundtrack to score it all.<h3>SOURCE CODE</h3>The source code for the game, together with all the assets, is available at https://github.com/aarthificial-unity/foundations.", "metacritic": null, "released": "2023-12-09", "tba": false, "updated": "2023-12-11T04:57:41", "background_image": "https://media.rawg.io/media/screenshots/ff1/ff1834eb5b9784e4ae7c88ff2de469e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["aarthificial"], "genres": ["Adventure"], "publishers": ["aarthificial"], "esrb_rating": null}