{"id": 97340, "slug": "the-trans-zone", "name": "The Trans Zone", "name_original": "The Trans Zone", "description": "<p>The Trans Zone is a  F P R P G PIXEL -G-A-M-E<br/>--<br/><br/> You've traveled to the Trans Zone and begun your quest in becoming True To Yourself™. After Seeing doctors, psychologists and explaining to everyone in your life what the dealio is - you've been given the go ahead to hide away in the safest place there is to begin HRT - best you not come back for a bit tbh, give people time to adjust<br/><br/>So off you go now kiddo! Journey through the land and meet its people, befriend others and obtain hormones to transition. How will you turn out? Will you Pass? Will you break out of the binary? <br/><br/>Find (Out For) Yourself<br/>---</p>\n<p><strong>Controls !!!</strong><br/><br/>Esc: menu (open / close)<br/>Move: adsw<br/>View: Mouse<br/>DIALOGUE: W=up / S = down<br/>INTERACT: E<br/>Enter/select: E</p>\n<p>---<br/><br/>P.s<br/>this game was made in a very short time period, by two real 3d trans women - we do intend to patch and update the game yes. If you have any feed back we would love to hear it. <br/><br/>visit www.pewkazone.com for more info!<br/><br/>Twitter: https://twitter.com/PewkaPew <br/><br/>FB: https://www.facebook.com/glamow/<br/><br/><br/>CW for this game: Some characters have dialogue which might cause upset or offend, they are all based on things we have heard, read, thought at some point - shared with others. Every aspect of this game comes from experience.  Overall we have kept our personal opinions at a distance but we feel confident that there are enough clues in the dialogue options to show where we stand. <br/> <br/> <br/></p>", "metacritic": null, "released": "2017-05-09", "tba": false, "updated": "2019-08-28T23:28:18", "background_image": "https://media.rawg.io/media/screenshots/3f5/3f5e9a7700b8bcdcd011f033467839a5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Glamow"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}