{"id": 973425, "slug": "deadville", "name": "Deadville", "name_original": "Deadville", "description": "Welcome to the Deadville, where the sun has set on civilization and darkness reigns supreme. A deadly virus has swept across the globe, transforming the living into ravenous, flesh-eating zombies. In this heart-pounding survival game, players must navigate through a desolate and chaotic world, where every choice determines their fate. It's a fight for survival, not only against the relentless horde of undead but also against the constant struggle to retain humanity and sanity.<br/>\n<br/>\r\nExploration and Scavenging:<br/>\r\nAs players venture into the unknown, they'll encounter abandoned buildings, dark alleys, and dense forests filled with danger and potential rewards. Scavenging for supplies is vital for survival, but every noise can attract the undead. Players must use stealth, wit, and strategy to navigate through the treacherous landscape, avoiding confrontations when possible.<br/>\n<br/>\r\nDynamic Day-Night Cycle:<br/>\r\nDeadville introduces a dynamic day-night cycle, altering the gameplay experience significantly. During the day, players can explore more freely, finding resources and potential safe spots. However, as the sun sets, the undead grow more aggressive and their numbers increase. Nights are filled with spine-chilling tension, and surviving the darkness becomes the ultimate challenge.<br/>\n<br/>\r\nBuilding and Fortifying:<br/>\r\nTo increase their chances of survival, players can build and fortify makeshift shelters. They can build bases and fences to fend off the relentless zombies. These fortified bases become a place of respite and preparation for the impending darkness of each night.<br/>\n<br/>\r\nStrategic Combat:<br/>\r\nWhen confronted by zombies or other survivors, combat becomes a last resort. Ammo is scarce, and every shot counts. Players must rely on melee weapons and stealth to conserve resources. However, engaging in combat might become unavoidable when facing powerful zombies or desperate survivors who view you as a threat to their survival.", "metacritic": null, "released": "2023-12-07", "tba": false, "updated": "2023-12-11T03:16:04", "background_image": "https://media.rawg.io/media/screenshots/b50/b504020e2bac6359b70387d97e250877.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 534, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AltairGamesLLC"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["AltairGamesLLC"], "esrb_rating": null}