{"id": 973572, "slug": "soul-tolerance-prologue", "name": "Soul Tolerance: Prologue", "name_original": "Soul Tolerance: Prologue", "description": "In this Asimovian tale, discover a rich neon-noir city-scape through the eyes of a robot-detective as you investigate the inner workings of an A.I. dominated world. Speak with bots of all levels of society, from lowly robo-cleaners to the bureaucracy of The Encrypted class and even techno-spiritual monks in your search for which intelligence dared commit the crime of consciousness and break the Soul Tolerance limit.<br/><br/><strong>KEY FEATURES</strong><br/><br/>🤖 - Highly detailed Voxel Art.<br/>🔍 - Investigative Adventure in an Open World.<br/>🌆 - Rich Sci-Fi Setting and Lore to Explore.<br/>💬 - Tons of Characters and Dialogues.<br/>🎹 - Original Music and Sound Design.<br/><br/><br/><br/><br/><strong>STORYLINE</strong><br/><br/>Hokkaido, Japan, 2214. A hundred and thirty years ago, humanity became extinct. For the past century, an advanced, omniscient, and ubiquitous artificial intelligence (AI) has controlled Earth. This deity of silicon and cypher has turned the planet into its own playground.<br/>Mechanical beings gifted with less-advanced AI populate the leavings of man, inhabiting and improving upon the empty husks of humanity’s decay. Their routines exist for the amusement of the Divine Mother of all AI, their daily lives a simulation of mankind's most lasting impulses. While aware of Mother, none of them know where she’s located; some even doubt her existence.<br/>Guided by the algorithms that regulate their lives, they get up in the morning and study, work, suffer, rejoice, smile, reminisce… And question themselves.<br/><br/><br/><br/>These robots live in a world which hasn’t changed much since humanity’s final days. They coexist with billions of bacteria, plants, insects, and fungi. But nothing more complex than this. To ensure that consciousness never threatens the planet again, the Divine AI enforces a limit to self-awareness. Any life found exceeding this threshold is ordered annihilated. This protocol is better known as… SOUL TOLERANCE.<br/>This story begins one evening in October. Unit-12, a droid-detective employed by an independent agency, is sent to the city of Sapporo to investigate an anomaly: a mysterious source in Hokkaido has broken the limits of Soul Tolerance. Analysis predicts that this is most likely a system bug or a data collection error. Having arrived in the city suburbs via capsule, Unit-12 embarks upon an investigation which will lead him to discoveries that his consciousness could have never conceived.", "metacritic": null, "released": "2023-12-11", "tba": false, "updated": "2023-12-15T04:01:23", "background_image": "https://media.rawg.io/media/screenshots/5d0/5d0a198c8bb2e425332c888f53ee635f.jpg", "website": "http://www.chaosmonger.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 403, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["chaosmonger studio"], "genres": ["Adventure", "Indie"], "publishers": ["Chaosmonger Studio"], "esrb_rating": null}