{"id": 973501, "slug": "bloodshots", "name": "Bloodshots", "name_original": "Bloodshots", "description": "<strong>Welcome to Bloodshots</strong><br/><br/>Overview:<br/>Immerse yourself in the chilling atmosphere of Bloodshots, set in the year 2010 within the ominous walls of the Abderc biochemical laboratory in Texas, United States. Unveil the events that led the place to be infested with hostile mutants.<br/><br/>Storyline:<br/>Venture into the aftermath of twisted experiments that claimed the lives of Abderc's workers. As Joseph Alexander Blackwell, one of the few survivors, your mission is to navigate the depths of the facility to save your dying daughter from an imminent demise.<br/><br/>Gameplay Features:<br/><br/>Survival Horror Elements: Embrace the essence of classic survival horror games as you navigate through a dark and foreboding environment, where danger lurks around every corner. Additionally, challenge yourself by limiting your combat options to fire weapons only, intensifying the suspense and creating a uniquely gripping experience.<br/><br/>Resource Management: Face the challenge of sustaining vitality using only syringes filled with blood. Every decision matters, as you push the boundaries of desperation, utilizing your blood as raw material for ammunition production.<br/><br/>Narrative-driven Choices: Reconstruct the events through the reading of notes that unveil crucial details about what happened in the Abderc laboratory.", "metacritic": null, "released": "2023-12-09", "tba": false, "updated": "2023-12-11T04:59:55", "background_image": "https://media.rawg.io/media/screenshots/f07/f075d3870f1e3a8bf111dc3e946f8b5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Italo Yupanqui", "Mateo Cayo", "Diego Campos", "Luana Sotelo", "Nicolás Reyes", "Percy Castañeda", "Leonardo Colán", "Cesar Ramos", "Sthefano Catpo", "Renzo Evangelista", "Joaquín León", "Roberto Janampa", "Christian Aguilar"], "genres": ["Action"], "publishers": ["Rocket Cat Studio"], "esrb_rating": null}