{"id": 973548, "slug": "flying-stunt-simulator", "name": "Flying Stunt Simulator", "name_original": "Flying Stunt Simulator", "description": "Embark on an adrenaline-fueled journey with the Flying Stunt Simulator, a cutting-edge aviation training game designed for aspiring pilots. This one-of-a-kind simulator serves as a virtual flight school, providing an immersive experience for beginners to master the art of piloting an aircraft.<br/>\n<br/>\r\nYour primary mission is to skillfully navigate the plane from point A to point B, ensuring a safe and incident-free journey. However, be prepared for the unexpected as you may encounter exceptional situations that demand quick thinking and precise execution. In the face of these challenges, you'll need to catapult yourself into heart-pounding maneuvers with a parachute, showcasing your aerial finesse and spatial awareness.<br/>\n<br/>\r\nThe game offers a dynamic learning experience with 10 progressively challenging levels, each designed to test and enhance your piloting skills. Engage in the thrill of both plain and parachute modes, adapting to different scenarios and mastering the art of controlled descents.<br/>\n<br/>\r\nNavigate through intricate circle routes, honing your ability to handle the aircraft in confined spaces and under varying conditions. Your success in mastering these challenges will earn you the accolades of a decorated pilot, worthy of receiving a virtual medal in recognition of your exceptional skills.<br/>\n<br/>\r\nAre you ready to soar to new heights, defy gravity, and prove your mettle as a skilled pilot? The Flying Stunt Simulator awaits, offering a thrilling and educational experience that transcends the boundaries of traditional flight simulation games.", "metacritic": null, "released": "2023-12-13", "tba": false, "updated": "2023-12-15T03:29:20", "background_image": "https://media.rawg.io/media/screenshots/c1c/c1cf1877ab5b278b6766120bd0a8455b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Atomic"], "genres": ["Adventure", "Simulation", "Sports", "Casual", "Indie"], "publishers": ["Atomic"], "esrb_rating": null}