{"id": 973607, "slug": "after-war-town", "name": "After War Town", "name_original": "After War Town", "description": "\"In the heart-pounding virtual battleground of 'After War Town,' immerse yourself in a gripping shooter experience where the fate of a besieged city lies in your hands. Take on the formidable task of liberating a once-thriving metropolis now overrun by cunning terrorists, concealed amidst the crumbling ruins. With unparalleled precision, wield an arsenal of 6 distinct weapons, including the lethal Pistol, elite Sniper, and powerful MP5, as you navigate through a perilous urban landscape.<br/>\n<br/>\r\nIn this first-person shooter adventure, your skills will be put to the ultimate test across 10 adrenaline-fueled levels. Engage in intense gunfights that will demand every ounce of your strategic prowess and marksmanship. Outsmart your enemies, unravel a complex web of corruption, and be prepared for unexpected twists that will keep you on the edge of your seat.<br/>\n<br/>\r\nThe fate of the city rests on your shoulders as you strive to restore lasting peace to the chaotic streets. Are you up for the challenge? It's time to reclaim the city and emerge as the catalyst for the ultimate peace. Enter the immersive world of 'After War Town' and experience the thrill of a high-stakes battle where every decision you make shapes the destiny of the war-torn landscape.\"<br/>\n<br/>\r\nGame features:<br/>\r\n- 6 types of weapons(Pistol,Elite Sniper,MP5)<br/>\r\n- Multiple levels<br/>\r\n- First-person shooter", "metacritic": null, "released": "2023-12-11", "tba": false, "updated": "2023-12-15T04:49:26", "background_image": "https://media.rawg.io/media/screenshots/026/02663717763d0a9252498e8a6550a7fb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Atomic"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Sports", "Casual"], "publishers": ["Atomic"], "esrb_rating": null}