{"id": 973626, "slug": "projecthypatios", "name": "PROJECT;HYPATIOS", "name_original": "PROJECT;HYPATIOS", "description": "<h3>An eternal time loop</h3><br/>Born as an <strong>Ionis</strong>, a superpower biological mechanical lifeform hybrid, Aldrich is specially designated Ionis with the ability to time loop and must escape from <strong>Mobius Corps</strong> Hypatios Lab Complex. <br/><br/><br/><br/>On his way, he encountered <strong>Heer Etres Vivants</strong>, a terrorist organization who attacked the lab complex with the aim to preserve the sanctity of the carbon-based lifeform in the empire and rejects the rise of Ionis as the inevitable future master race.<br/><br/>Aldrich later revealed to be a <strong>Timekeeper</strong>. Individuals who brought 'forbidden knowledge from future' to upset the temporality of the universe.<h3>Escape</h3><br/>To escape, Aldrich must defeat <strong>Theratios</strong>, an Ionis that is the protector of Hypatios Lab. With it, Aldrich must utilize the crafting workstations, explore the lab, resource management and strategize every run with the ultimate goal of freedom.<br/><br/><h3>Important Info</h3><ul><li> This game contains flashing lights that may make it unsuitable for people with photosensitive epilepsy or other photosensitive conditions. Player discretion is advised.<br/></li><li> Profanity, suicide, philosophical and socio-political themes that is need of parental guidance.<br/></li><li> No controller support, only mouse &amp; keyboard.</li></ul><h3>Trivia</h3><ul><li> Project;Hypatios will be around 10 hours long to complete.<br/></li><li> <strong>Project;Hypatios Team</strong> are rag-tag game developer team which consists of Indonesian university students.</li></ul>", "metacritic": null, "released": "2023-12-12", "tba": false, "updated": "2023-12-15T05:14:05", "background_image": "https://media.rawg.io/media/screenshots/037/0373e6e4ea25a1bd6e435507c90676ee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Project;Hypatios Team"], "genres": ["Action", "RPG", "Strategy"], "publishers": ["Project;Hypatios Team"], "esrb_rating": null}