{"id": 973633, "slug": "rbm-studios-gettysburg", "name": "RBM Studio's Gettysburg", "name_original": "RBM Studio's Gettysburg", "description": "In RBM Studio's Gettysburg, take command of either the Confederate or Union forces for the Battle of Gettysburg, the single bloodiest battle of the U.S. Civil War.  Each side has an historically accurate order of battle that details when and where reinforcements will arrive, letting the player attempt to outdo the generals of history.  As the Confederate commander Lee, it's your task to either crush the Union forces or secure a safe route for your continued invasion of the North.  As the Union commander Meade, you must at least match the losses inflicted by the Confederates while also securing the roads leaving Gettysburg towards D.C.<br/><br/>RBM Studio's Gettysburg features gameplay based on the historical wargaming boardgames of the 70's and 80's.  Players maneuver markers that represent their units on a hexagonal map that mimics the gameboard and cardboard counters of traditional boardgames.  Turns are completed in an \"I go, you go\" style, wherein players alternate their turns with their opponent until one player passes.  Once that happens, a random number of unopposed actions are given to their opponent.  Pass too early and you risk giving your opponent the opportunity to maneuver completely around your forces.  Combat is resolved through die rolls modified by terrain, battle line factors, and the use of artillery support.  Attackers benefit from flanking defenders.  Defenders benefit from being in defensible terrain.  <br/><br/>Artillery support is a finite resource, so think carefully about when to use it.  If both players use artillery in an engagement, an artillery duel is conducted in which at most one player will receive the bonus but both players risk losing additional artillery support if their opponent's cannon manage to hit their own.<br/><br/>The Confederates begin the game with less artillery support but ultimately receive more units and benefit from a greater area of influence generated by General Lee.  Only the Union player can deploy a special sharpshooter unit that protects a single hex from the Confederate advance.  Careful placement of this unit can help block a Confederate advance farther into the North.<br/><br/><strong>Key Features</strong><br/><br/><ul><li>Command your units in an historically accurate representation of the real Battle of Gettysburg.<br/></li><li>Maneuver to try and pin your opponent's forces, while keeping your own free to act.<br/></li><li>Manage your artillery usage to avoid being overrun late in the game if your opponent still has resources left.<br/></li><li>Choose your fights carefully - losing artillery and men attempting to capture a well-defended hex without adequate preparation is a sure path to defeat.<br/></li><li>Solo play as both sides to explore the rules and potential strategies.<br/></li><li>Online multiplayer play against a human opponent.</li></ul>", "metacritic": null, "released": "2023-12-14", "tba": false, "updated": "2023-12-15T05:24:23", "background_image": "https://media.rawg.io/media/screenshots/fd5/fd5f78f46eac11cf3cfa5dc869aa47b7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Hexes of War", "C3i"], "genres": ["Strategy"], "publishers": ["Hexes of War"], "esrb_rating": null}