{"id": 973665, "slug": "stay-still-2", "name": "Stay Still 2", "name_original": "Stay Still 2", "description": "Hung, an adventurous risk-taker with an insatiable hunger for extraordinary experiences, seeks out a cheap and creepy house for a thrilling one-day rental. Little does he know that the house has a dark history, with a young girl's murder nearby. Ignoring the warnings, Hung decides to stay, and soon finds himself in the midst of a terrifying nightmare. He encounters the ghost of the murdered girl, setting off a series of haunting trials and challenges. Trapped and hunted in the haunted house, Hung must solve puzzles and face unimaginable horrors in a desperate attempt to escape. The chilling ghost story unravels as Hung's life hangs in the balance, leaving him forever scarred by the terrifying ordeal.<br/><br/><br/><br/><br/><br/>Prepare yourself for a bone-chilling adventure in \"Stay Still 2,\" the thrilling ghost story that will keep you on the edge of your seat! Hung, a risk-taking adventurer, seeks out the most extraordinary experiences. When he stumbles upon a cheap, creepy house with a dark history, he can't resist the temptation to stay for a night filled with spine-tingling thrills.<br/><br/>Explore the eerie house and uncover its haunting past as you encounter mysterious figures and disturbing noises. Piece together clues and solve terrifying puzzles in a desperate attempt to escape the clutches of the vengeful ghost. But beware, the horrors within are beyond imagination!<br/><br/><br/><br/><br/><br/><ul><li>Immerse yourself in a chilling ghost story filled with suspense and mystery.</li></ul><ul><li>Navigate through the dark and eerie house to confront the ghost's tragic past.</li></ul><ul><li>Solve diabolical puzzles and riddles to find the key to your survival.</li></ul><ul><li>Experience heart-pounding moments and a sense of dread that will stay with you long after the game ends.</li></ul><br/>", "metacritic": null, "released": "2023-12-13", "tba": false, "updated": "2023-12-15T06:09:01", "background_image": "https://media.rawg.io/media/screenshots/5ea/5ea78b4b57770a062c080d8786009890.jpg", "website": "https://galactic-crows.com/stay-still2", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 395, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tarba Paul Cornel", "Kpa Quốc"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Galactic Crows"], "esrb_rating": null}