{"id": 973684, "slug": "im-the-policeman", "name": "I'm the Policeman", "name_original": "I'm the Policeman", "description": "Immerse yourself in the gripping world of law enforcement with \"I'm the Policeman.\" Assume the crucial role of a dedicated guardian of the city's peace, where your unwavering commitment to ensuring the safety of its citizens takes center stage. Your mission is to respond promptly to calls for assistance from the public, providing a secure and reliable escort service to help them reach their destinations unharmed.<br/>\n<br/>\r\nIn this immersive and challenging game, you will navigate through a dynamic city environment, addressing reactive citizen calls with precision and efficiency. Your responsibilities extend beyond mere transportation; you are the embodiment of safety and security management, actively safeguarding the community from potential threats.<br/>\n<br/>\r\n\"I'm the Policeman\" offers a thrilling experience across 10 levels, each presenting unique challenges that test your skills and decision-making prowess. Engage in a realistic simulation of law enforcement as you serve and protect the community, ensuring the well-being of its residents with every mission. Can you rise to the occasion and uphold the principles of justice in this adrenaline-pumping adventure?<br/>\n<br/>\r\nGame Features:<br/>\r\n- Reactive Citizen Calls: Navigate through a city alive with dynamic events, responding to urgent calls for assistance from its residents.<br/>\r\n- Safety and Security Management: Go beyond transportation, actively managing safety and security to protect the community from potential threats.<br/>\r\n- 10 Levels: Face a variety of challenges across different levels, each designed to push your skills to the limit and provide a truly immersive gaming experience.", "metacritic": null, "released": "2023-12-13", "tba": false, "updated": "2023-12-15T06:35:39", "background_image": "https://media.rawg.io/media/screenshots/55e/55e244f5c083dba475d3b1832554f355.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Atomic"], "genres": ["Action", "Simulation", "Sports", "Racing", "Indie"], "publishers": ["Atomic"], "esrb_rating": null}