{"id": 973610, "slug": "a-different-summer", "name": "A different summer", "name_original": "A different summer", "description": "A Different Summer is a graphic novel by chapters, with more than 1900 images and 60 animations for now, in continuous development and new content in which we will put ourselves in the shoes of a student, with bad grades, who has been punished during the summer to work on a kind of farm under the orders of a friend of his father. In that place he will meet different women who will make his stay very very pleasant, turning, not without difficulties and entanglements, our protagonist into the object of desire of the women present there.<br/><br/>Misunderstandings, deceptions, revenge and above all a lot of sex and lust will be the daily life of that place, which boasted of being boring, will become a paradise of mature women and lust.<br/><br/><br/><br/>In this game we will find varied characters, such as Bob, a friend of the protagonist's father, a womanizer and husband of Alexandra, a mature woman and owner of the complex who lives resigned to that monotonous life supporting her husband's relationship with Michelle, a writer on a spiritual retreat. who mixes his shyness with the unbridled desire to find inspiration for his books.<br/><br/><br/><br/>Completing the plot is also Alyssa, a middle-aged influencer, very impulsive and with a strong character, who although it is not really known why she is in that complex, everything seems to indicate that she has some type of sex addiction. And if we talk about sex... The greatest exponent is Rebecca, Alexandra's childhood friend, explosive and hot who lives totally devoted to the pleasures of lust.<br/><br/><br/><br/>Among all these characters, sexual relations are very frequent and peculiar, causing scenes of masturbation, oral, anal, threesomes, double penetration... and, in this secluded place, without many things to do, sex is the favorite fun for everyone.", "metacritic": null, "released": "2023-12-12", "tba": false, "updated": "2023-12-15T04:53:43", "background_image": "https://media.rawg.io/media/screenshots/dc3/dc3459ccb4c86953877377c2ba6ca44b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 376, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["K84"], "genres": ["Indie"], "publishers": ["K84"], "esrb_rating": null}