{"id": 973666, "slug": "meeple-jump", "name": "Meeple Jump", "name_original": "Meeple Jump", "description": "Chill in some lava in the casual Meeple Jump! platformer! Make your way from level to level, collecting stuff, and having a good time. Just... don't mind the Meeple's blank stare<br/><br/><h3>PART ONE CONTAINS</h3><br/><ul><li><strong>The I-MEEPLE, a guidance module designed to give you useful (and sometimes really useless) information, exactly when you need it!</strong> (please note, I-MEEPLE is prone to occasionally giving you information when you do not need it)</li><li><strong>Cool and interesting game mechanics in each world, all of them really fun! </strong>(please note, \"cool\", \"interesting\", and \"fun\" are subjective terms and levels of such cannot be stated objectively)</li><li><strong>A number of worlds that is greater than 1.</strong> (please note, \"numbers\" are objective and levels of such can be stated objectively)</li><li><strong>Lava! Lava is super cool and you definitely won't fall in it a lot and also there are other things that kill you too but don't worry you won't die a singular time in my game!!!!! </strong>(please note, that statement is objectively false)</li><li><strong>The Main Meeple, You! We at BettaBowlGames went through a ton of playtesting of Meeple Jump, and results were always more positive when the playtester could play the game!</strong> (please note, \"positive\" is a subjective statement, yet somehow we know that this is objectively true)</li><li><strong>A storyline... somehow. Yes, somehow we got a storyline that made at least 1 sense into the meeple game! The quality of which, we are unsure.</strong> (please note, here at \"BettaBowlGames\" we for some reason put effort into the plot of Meeple Jump, why? Don't ask us, we probably don't know... I think.)</li></ul><br/>Oh huh, you're still here. This either means that you actually care what I have to say, or you for some reason stuck around, even though you had no intention of Wishlisting. Well I'll go ahead and blindly assume the former!<br/><br/>Anyhoodle, wishlist Meeple Jump or Else!<br/>https://store.steampowered.com/app/2344580/Meeple_Jump/", "metacritic": null, "released": "2023-12-13", "tba": false, "updated": "2023-12-15T06:10:01", "background_image": "https://media.rawg.io/media/screenshots/ce7/ce75a20afaf070ac51f88137066825d4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["BettaBowlGames"], "genres": ["Casual"], "publishers": ["BettaBowlGames"], "esrb_rating": null}