{"id": 973643, "slug": "darkmatter-the-strange-messenger", "name": "DarkMatter: The Strange Messenger", "name_original": "DarkMatter: The Strange Messenger", "description": "<h3>Explore the Earth that has been transformed by dark matter.</h3>Go around the globe where everything is gone and find out what dark matter is.<br/>Listen to the stories of life told by those who survived the harsh environment.<h3>The harsh play environment may be waiting for you.</h3>If you miss your step, you fall into a cliff and fail your mission. At every turn, enemies will attack you and push you down.<br/>You may experience emotions beyond hardships and adversity that those living in the game have experienced.<br/>Please control your anger and keep your composure. Protect your keyboard and mouse. They're precious.<br/>If you give up this game in the middle, it will make us sad and hard. More stories still want to come out into the world.<br/>I support your challenge. Don't give up!<h3>You can't use all of them at once just because you've learned various skills.</h3>Fit 3 skills to suit the situation and play.<br/>Don't worry too much. You can replace it right away.<br/>You can learn 9 active and 9 passive skills.<br/>Study your own various skill trees.<br/>The context-sensitive skill tree makes it easier to navigate through a congested section.<br/>Skill initialization items sold by merchants can be initialized at any time.<h3>Use Black Cube's knowledge.</h3>It's not that there's no way out of the harsh environment. <br/>Gather resources during the expedition, gather materials in battle with monsters, and acquire knowledge of the Black Cube. <br/>You can also acquire better Black Cube knowledge by purchasing unique items from merchants.<br/>Black Cube's knowledge will strengthen your equipment. This will help you on a rough expedition.<h3>A feast of unfounded art</h3>I thought about drawing-style art, cell animation techniques, and other various methods and used them generously.<br/>We introduce you to Studio 215's unique artwork, which realizes that mixing all the delicious ingredients does not produce delicious food.<h3>Features</h3><br/>- Jumping and falling<br/>- Skill selection and strategic cost management<br/>- Battle of Boss<br/>- Storytelling and Ending through Lines<br/>- Farming goods and purchasing items", "metacritic": null, "released": "2023-12-12", "tba": false, "updated": "2023-12-15T05:41:16", "background_image": "https://media.rawg.io/media/screenshots/d01/d0149fe39f812662f64d388d845d4c1d.jpg", "website": "https://www.studio215games.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Studio215"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Studio215"], "esrb_rating": null}