{"id": 973605, "slug": "arcane-blood-the-shattered-star", "name": "Arcane Blood: The Shattered Star", "name_original": "Arcane Blood: The Shattered Star", "description": "Long ago, the first star was born.<br/>\n<br/>\r\nOn the night when the star was burning the brightest, any girl born under the light would be gifted the magic of the powers of the Star Goddess.<br/>\n<br/>\r\nThose girls were hunted and burned for holding such immense power. All except for one who was kept hidden in the forest by her mother.<br/>\n<br/>\r\nSeventeen years later... the first star has shattered scattering the chunks across the universe, one even landing in the kingdom of Lordell.<br/>\n<br/>\r\nA warlock seeking great power has taken over Lordell Castle and in one final effort the prince shattered it further into eight fragments, ordering the Maidens of the First Star to hide them deep within ancient temples around the kingdom.<br/>\n<br/>\r\nThe last surviving witch, Verana wakes up to a voice,<br/>\n<br/>\r\n\"Go find the fragments. Stop him. Save me. Please.\"<br/>\n<br/>\r\nPLAY as Verana, a young witch and master a variety of spells to slice, burn, and zap enemies in this 2D platforming adventure!<br/>\n<br/>\r\nDEFEAT bosses sealed away in forgotten dungeons to claim the scattered fragments of the shattered star and restore peace to the land!<br/>\n<br/>\r\nUPGRADE Verana's health and magic at Angel Maiden Statues by making hearty donations!<br/>\n<br/>\r\nEXPLORE a great forest, dark caves, sandy waste, and even quaint towns!", "metacritic": null, "released": "2023-12-11", "tba": false, "updated": "2023-12-15T04:46:45", "background_image": "https://media.rawg.io/media/screenshots/dd2/dd25c05b30e62f15915a405f22293f72.jpg", "website": "https://twitter.com/bigdongenergy", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Andrew Rios"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Andrew Rios"], "esrb_rating": null}