{"id": 973627, "slug": "spider-mall", "name": "SPIDER MALL !", "name_original": "SPIDER MALL !", "description": "<strong>IT’S TIME FOR SOME SERIOUS PEST CONTROL!</strong><br/><br/>A night of urban exploration goes wrong when Explorer X finds himself trapped in an abandoned shopping mall facing off against security guards and a giant spider.<br/><br/><strong>THE STORY</strong><br/><br/>After getting a tip off about an abandoned shopping mall, Explorer X sets out to document the building on videotape.<br/><br/>Creeping round the gloomy interiors of empty shops and endless concrete corridors, he soon discovers several bored security guards on the prowl. They’re not the only inhabitants of the mall, in the shadows lurks a giant hungry spider.<br/><br/>This is just the start of a night of arachnophobic terror as you help X find his way out the mall, avoid the spider and make the decisions about who escapes with him.<br/><br/>Save the guards, or leave them to die. It’s up to you.<br/><br/>Either way you have to get out the mall or die trying!<br/><br/><strong>GAME OVERVIEW</strong><br/><br/>SPIDER MALL ! is a choice-based, VHS bodycam-style survival FMV with many different combinations of endings and outcomes. Designed to be played multiple times, with each playthrough lasting 30-40 minutes.<br/><br/>Watch the recovered bodycam video footage and select the on-screen choices.<br/><br/><ul><li>Choice-based live action FMV survival horror<br/></li><li>Over 13 combinations of game endings <br/></li><li>30-40 Minute play times <br/></li><li>VHS/Bodycam style video footage with 80’s lo-fi effects<br/></li><li>The world’s first giant spider in shopping mall FMV game!</li></ul>", "metacritic": null, "released": "2023-12-12", "tba": false, "updated": "2023-12-15T05:15:57", "background_image": "https://media.rawg.io/media/screenshots/e6a/e6ab5616354c58240d49552af6cc585f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ghost Dog Films"], "genres": ["Action", "Adventure"], "publishers": ["GHOST DOG FILMS"], "esrb_rating": null}