{"id": 973748, "slug": "block-fun-puzzle-pro-premium", "name": "Block Fun Puzzle Pro Premium", "name_original": "Block Fun Puzzle Pro Premium", "description": "Block Puzzle Premium - no ads<br/>Block Puzzle Premium - Block Blast a perfect mix of block and brain Puzzle games, combining creativity with the classics! The simple control, wonderful sound effects, and a great rhythm! Block Blast will leave you wanting more!<br/> <br/>Aside from the classical brain gameplay, you will also experience a whole new original combo gameplay. Drag and drop blocks onto the board to fill a row or column to complete elimination and clearing multiple rows or columns at once will produce a cool elimination animation as well as extra points. The more comboss you perform, the more points you get. It is up to your logical skills and layout strategy if you want to score high points. Test your IQ and exercise your brain in Block Blast!<br/> <br/>Features:<br/>1. Simple and easy to play, suitable for all ages, excellent choice to kill time.<br/>2. No network connection is needed; you can enjoy Block Blast anytime, anywhere.<br/>3. Beautiful blocks and wonderful sound effects will bring you a fantastic gaming experience.<br/> <br/>How to Play:<br/>1. Drag and drop the blocks onto the board and clear the blocks when a column or row is filled.<br/>2. We will keep providing blocks of various shapes until you have no space left on the board.<br/>3. Plan your next move as you think constantly about what blocks might show up. <br/> <br/>How to become a block master:<br/>1. Instead of waiting for the perfectly shaped blocks, take the opportunity to free up more space and score points.<br/>2. There is no time limit in Block Puzzle Block Blast, so think carefully about your every move. <br/> <br/>No matter where you are, whether you are tired, bored, or frustrated, Block Puzzle Games - Blocks Blast will always be by your side, sweeping away the boredom and helping you relax and cheer up!", "metacritic": null, "released": "2023-02-11", "tba": false, "updated": "2023-12-15T07:57:46", "background_image": "https://media.rawg.io/media/screenshots/192/192dde855564f39b9c84f6819f21371c_N3ApW5i.jpg", "website": "https://sites.google.com/view/lionrunner/home", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Diana Kisil"], "genres": ["Casual", "Puzzle"], "publishers": ["Diana Kisil"], "esrb_rating": "Everyone 10+"}