{"id": 973724, "slug": "mind-over-magic", "name": "Mind Over Magic", "name_original": "Mind Over Magic", "description": "Mind Over Magic is a simulation game developed by Sparkypants and published by Klei Publishing. <br/><br/>Design, construct, and optimize every detail of your ideal magic school!  Keep everyone alive and content while preparing students to explore the horrors of the Underschool, a deadly subterranean trial. Study lost arcana, grow exotic plants, brew potions, and raise undead servants. But don’t forget to stop the deadly fog from consuming everything in its path.<h3>Create Your Own Magic School</h3><br/>Construct your dream magic school, block by block. Design unique rooms any way you see fit. Craft and place every light, piece of furniture, and decoration.  Will your school be whimsical or efficient, creepy or cozy… Make it your own!<h3>Explore the Deadly Underschool</h3><br/>This mysterious labyrinth holds dark secrets and deadly magical battles with ghastly creatures and can lead to great rewards.<h3>Respect the Dead… And Use Them!</h3><br/>Death is tragic and painful, but the spirits left behind help out in their own unique ways.<h3>Conjure Wands, Potions and Familiars</h3><br/>Craft wands and potions to summon more powerful students. Practice Dark magic to animate undead helpers that handle many chores.<h3>Teach And Master Magic</h3><br/>It can’t be a school without class! Students learn magic every day on a schedule you choose and teachers you assign. Learn and harness powerful abilities from a range of magic disciplines to unlock your students true potential.<h3>Wishlist Now!</h3>https://store.steampowered.com/app/1270580/Mind_Over_Magic/", "metacritic": null, "released": "2023-12-14", "tba": false, "updated": "2024-01-16T15:33:32", "background_image": "https://media.rawg.io/media/screenshots/8f2/8f25d27611bc2244ae56d3ef985563cd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "toplay": 2, "dropped": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Sparkypants"], "genres": ["Simulation"], "publishers": ["Klei Publishing"], "esrb_rating": null}