{"id": 973736, "slug": "aged-color", "name": "Aged Color", "name_original": "Aged Color", "description": "Aged Color is a free color by number game for people of all ages and lifestyles. Featuring tons of inspiring pictures, you will enjoy a relaxing and interesting experience.<br/><br/>What to Color?<br/>Our app offers thousands of exquisite pictures produced by professional artists worldwide and beautiful images are updated every day for you to color them and relax your mind!<br/><br/>There are more than 30 categories for your choice, such as<br/>Animal: You can find cute pets, lovely animals you can only see in zoos, and various  animals in the wild.<br/>People: There are attractive and interesting people here.<br/>Flower: You can see beautiful flowers which can relieve your stress and make you happy physically and mentally.<br/>Place: Like travelling over the world, you can see various and impressive styles of architecture.<br/>Nature: You can feel like you are in the splendid nature and witness the beauty of nature.<br/>Mandalas, Hearts, Fashion, Pattern, Vehicle, Holidays, Food and many surprises await you!<br/><br/>How to Color?<br/>Super easy! Just follow the numbers and tap to color. You can create an incredible masterpiece and bring it to life in a short time!<br/><br/>Key Features:<br/>Convenient and user-friendly: Start to color painting anytime and anywhere. No pencil or paper is needed, and no specific skills are required!<br/><br/>Fascinating pictures and daily updated: A large range of pictures to choose from and unique coloring images updated every day!<br/><br/>Various themes for all tastes: Animals, Places, Nature, Mandalas, People, Fashion, Foods, Pattern and many more!<br/><br/>Save as favorite and color later: When you explore to find pics you love, you can save them as favorites first, and color them later when you are available.<br/><br/>Tell others your thoughts: After completing a picture, you can post your comment, like the pic, and reply to others’ comments to express your thoughts and feelings.<br/><br/>Share and save your artwork: You can share your completed pics on social media, like Facebook. Also, you can download and save them to your device.<br/><br/>Recommended coloring pages: Help you choose pictures that you may be interested in and start coloring easily.<br/><br/>Followings and Feeds: You can follow your friends and favorite players to keep track of your following's latest, such as their current coloring page and new achievement.<br/><br/>Stress relief and other benefits: Enjoy art therapy to reduce stress and anxiety. It's also a great way to enhance focus, motor skills and creativity.<br/><br/>Relax and entertain yourself with color therapy now! It's time to explore fabulous paintings and enjoy your coloring journey in Aged Color!<br/><br/>To ensure that you can save and share pictures successfully, we need to access photos, media and files on your device. To permanently save all your painting progresses, we would recommend you log in and bind your account. You can see more details of app permissions in App info.<br/><br/>We do not sell any personal information you provide, nor do we share your private information without your consent. Thanks for your understanding and we are dedicated to a better coloring experience!<br/><br/>We are willing to hear your feedback: support@agedstudio.com<br/>Privacy policy: https://agedcolor.com/privacy_policy.html<br/>Terms of Use: https://agedcolor.com/terms_of_use.html", "metacritic": null, "released": "2023-09-05", "tba": false, "updated": "2023-12-15T07:45:23", "background_image": "https://media.rawg.io/media/screenshots/73f/73f724dc620b91dd892e54255c3c1bf3_fQmsjdD.jpg", "website": "https://agedcolor.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Aged Studio"], "genres": ["Board Games", "Casual"], "publishers": ["Aged Studio"], "esrb_rating": "Mature"}