{"id": 973735, "slug": "chess-chess-online", "name": "Chess - Chess Online", "name_original": "Chess - Chess Online", "description": "Are you a chess master? <br/>Or just a beginner? It doesn't matter!<br/>Our chess game absolutely is one of the well-designed chess games, and it has designed for both behinners and advanced players. Download our game, play it, and enjoy the happy time! <br/><br/>-Selectable board skin and game difficulty<br/>-Hint function is available<br/>- Endgame mode, AI mode and two-player mode <br/>-Save game progress<br/>- Intelligent AI with nationality and unique characters <br/>You can develop your chess strategy and chess tactics, meet the challenge and become a chess master immediately!<br/><br/>Subscription notice:Payment will be charged to your account at confirmation of purchase.Subscriptions automatically renew unless auto-renew is turned off at least 24-hours before the end of the current period.Account will be charged for renewal within 24-hours prior to the end of the current period.Auto-renewal may be turned off by going to the user's Account Settings after purchase.<br/><br/>Privacy Policy：https://carykentprivacypolicy.mysxl.cn/<br/><br/>Terms of use：https://carykentprivacypolicy.mysxl.cn/<br/><br/>Thank you for your support of our product. If you encounter any issues with the product, you can contact us through this email address: jessiestark0201@126.com", "metacritic": null, "released": "2021-01-15", "tba": false, "updated": "2023-12-15T07:44:39", "background_image": "https://media.rawg.io/media/screenshots/12e/12ef7fd7c589bf0501fc5c3b4c300027_brSIyfP.jpg", "website": "http://detacheddy.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["源 郭"], "genres": ["Strategy", "Board Games"], "publishers": ["源 郭"], "esrb_rating": "Teen"}