{"id": 973786, "slug": "deep-rock-galactic-survivor", "name": "Deep Rock Galactic: Survivor", "name_original": "Deep Rock Galactic: Survivor", "description": "<h3>Welcome, Survivor!</h3>DEEP ROCK GALACTIC: SURVIVOR is a single player survivor-like auto-shooter. Wield the full arsenal of Deep Rock Galactic, take on hordes of lethal aliens, mine riches, and unlock powerful upgrades. It's one dwarf against all of Planet Hoxxes!<h3>REVERSE BULLET HELL, WITH MINING</h3>Kill bugs, upgrade your gear, and delve ever deeper into the lethal caves of Hoxxes. Collect and assemble a devastating array of guns, unleash hell upon wave after wave of alien monsters in fast and frenetic combat, and tunnel your way to collect precious riches from deep within the cave walls. Each mission is unique, using procedural cave generation and enemy waves, just as you've come to know from Deep Rock Galactic.<h3>COMPLETE MISSION OBJECTIVES TO BECOME STRONGER</h3>Delve deep, Miner! Once the Drop Pod releases you into the oppressive darkness, you are on your own. Complete the mission objectives set forth by the Company, and make it back to the Drop Pod in time to try your luck at even more deadly and lucrative encounters. Progress deeper and deeper into the planet while you grow ever stronger, survive all the way to the very end of your assignment, and finally get extracted alongside your hefty sack of loot.<h3>DEEP ROCK, FROM A WHOLE NEW PERSPECTIVE</h3>The universe of Deep Rock Galactic is loved by millions of players, and now you can experience it in a whole new single-player-focused way! Play each mission from a top-down perspective, navigating the caves of Hoxxes as you've never seen them before. Greybeard Deep Rock veterans will recognize much from Deep Rock Galactic, and if you are a recently joined Greenbeard: Welcome! We are thrilled to have you on board. You will like it here. Management demands it!<br/><br/><br/>Initial release on early access includes:<br/><br/><ul><li>4 classes<br/></li><li>40 weapons<br/></li><li>20 enemy types<br/></li><li>3 biomes<br/></li><li>A deep progression system of class mods, artifacts, and upgrades</li></ul><br/>The finished version will contain even more content, and other features - all to be determined as we receive and review feedback from the community during Early Access.<br/><br/><br/><strong>ROCK AND STONE!</strong>", "metacritic": null, "released": "2024-02-14", "tba": false, "updated": "2024-04-16T19:20:04", "background_image": "https://media.rawg.io/media/games/1eb/1ebae240bdf6275a169e81b551e44e67.jpg", "website": "https://www.fundaygames.dk/drgs", "rating": 4.08, "rating_top": 4, "added_by_status": {"yet": 4, "owned": 60, "beaten": 6, "toplay": 15, "dropped": 9, "playing": 9}, "playtime": 7, "achievements_count": 22, "ratings_count": 11, "suggestions_count": 163, "game_series_count": 1, "reviews_count": 13, "platforms": ["PC"], "developers": ["Funday Games"], "genres": ["Action", "Arcade"], "publishers": ["Ghost Ship Publishing"], "esrb_rating": null}