{"id": 973725, "slug": "a-shot-in-the-dark-2", "name": "A Shot in the Dark", "name_original": "A Shot in the Dark", "description": "<h3>Current version information</h3>The current version (<strong>Chapter 3</strong>) of <strong>A Shot in the Dark</strong> includes:<br/> - 70+ scenes<br/> - 116K+ words<br/>- 5,000+ renders<br/>- 275+ animations<br/>- 115 songs<br/>- 34 sound effects<br/><br/>Development of <strong>Chapter 4</strong> is currently in progress and planned to release in early 2024!<br/><br/><h3>Are you ready to take a shot in the dark?</h3><strong>A Shot in the Dark</strong> is a choice-driven adult 3D visual novel that intertwines romance, drama, and a dark, psychological mystery​. Navigate romance, relationships, and rivalry as a young man during your first semester of college in this story-rich interactive fiction game. Can you make a fresh start, or will the past catch up with you?<br/><br/><h3>A mystery to solve</h3>You play as a young man hoping to make a fresh start in college in this male-protagonist dating sim. When a sorority girl goes missing, any hope of a normal semester disappears along with her. Will you be able to solve the mystery of her disappearance before it's too late?<br/><br/><h3>Your choices matter</h3>Choose wisely. There is no right or wrong. There is no one \"happy path.\" From the first chapter to the last, your decisions can have permanent impacts on the story. Many branching story paths—each with its own joys and tragedies—will eventually lead you to one of the multiple endings.<br/><br/><h3>Compelling characters</h3>Ten main love interests represent a variety of body types, personalities, and skin tones, each with their unique stories. Your choices will decide how each relationship progresses, whether passionate encounters or dramatic confrontations. All lewd scenes are optional.​<br/><br/><h3>Transparent gameplay</h3>The mystery is in the story, not the gameplay. You will always know what aspects of the game your choices affect, for optimal replayability. No grinding or repetitive minigames. Every mechanic is designed to move the story forward, not to slow it down.<br/><br/>", "metacritic": null, "released": "2023-12-14", "tba": false, "updated": "2023-12-15T07:31:59", "background_image": "https://media.rawg.io/media/screenshots/989/98946eeeb9d004ab6a3ca2defc1d8378.jpg", "website": "https://vim-studios.web.app/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 439, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["ViM Studios"], "genres": ["Indie"], "publishers": ["ViM Studios"], "esrb_rating": null}