{"id": 973730, "slug": "hitster", "name": "HITSTER", "name_original": "HITSTER", "description": "YOU NEED THE HITSTER CARD GAME TO USE THIS APP.<br/><br/><br/>Create an instant party with HITSTER, the music card game of the century!<br/><br/>Listen to over 100 years of amazing hits, take turns arranging them in chronological order on your music timeline and create your trip down memory lane. The first player to collect 10 hits is the winner.<br/><br/>With more than 300 of the greatest hits from the last 100 years, HITSTER is the perfect game for an evening with lots of laughing, singing, dancing and sharing memories. Simply open the box, scan a song card with this HITSTER app and let the music do the rest to create an instant party. So what are you waiting for? Invite your friends to have fun together and see who is crowned the HITSTER.<br/><br/>Game characteristics:<br/><br/>- Everybody is invited for the HITSTER party! Super easy rules and no game set-up gets the party started in no-time. Simply scan a card with the free Hitster app and the music starts playing automatically in Spotify, isn't that cool?<br/><br/>- HITSTER is the music game in which you don’t have to be a music expert. Simply guess if a song was released before or after other songs in your music timeline. The futher you are in building your timeline the more challenging it becomes. Your chances of winning increases if you can also name the artists and song titles.<br/><br/>- Are you craving to show of your music knowledge? Play HITSTER with the Pro rules or even Expert rules in which you have to know the exact year, artist and song title.<br/><br/>- Fancy a less competitive trip down memory lane? Then HITSTER can also be played as one team or by yourself.<br/><br/>GET THE PARTY STARTED!<br/><br/>HITSTER requires a mobile phone with an internet connection. For the best experience, use the free HITSTER app and Spotify. Visit www.hitstergame.com for device compatibility", "metacritic": null, "released": "2023-02-21", "tba": false, "updated": "2023-12-15T07:40:25", "background_image": "https://media.rawg.io/media/screenshots/30d/30dacb0b530302d942b87278830b23c3_fvDNR8G.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Koninklijke Jumbo B.V"], "genres": ["Board Games"], "publishers": ["Koninklijke Jumbo B.V"], "esrb_rating": "Everyone 10+"}