{"id": 973859, "slug": "bloompunk", "name": "Bloompunk", "name_original": "Bloompunk", "description": "Bloompunk is a rogue-like FPS hybrid set in a vibrant world of animated plants. By combining biological and mechanical technology, harness the power of nature, grow your living arsenal of weapons and abilities, and fight back against biomechanical forces intent on disrupting the world's natural balance in this action-packed, non-stop frenzy of bullets, light, and thorns.<br/><br/><h3>Restore a Dying World</h3>Embark on a journey of redemption as you emerge into a world on the verge of environmental collapse. Become nature's vengeance as you, an adaptive bioengineer, must destroy your own biomechanical creations threatening to consume all plant-life throughout the forest. Battle through verdant foliage and destroy the invading technological corruption on your path to restore balance.<br/><br/><br/><h3>Grow Your Living Arsenal</h3>Unlock powerful abilities that augment your playstyle and unleash deadly attacks! From summoning solar lasers to blasting through the air, the choice is yours. However, use your unlocked abilities wisely to survive waves of enemies intent on thwarting you.<br/><br/><br/><h3>Relentless Action</h3>Bloompunk features fast-paced first-person shooter combat. Experience a polished movement system that allows you to run, slide, and glide through the air as you evade enemies, traverse the world, and dish out destruction from any vantage in the forest. How long can you endure?<br/><br/><br/><br/><br/><br/><br/>Bloompunk was created as part of the University of Southern California’s Advanced Game Project (AGP) in collaboration with Cal State Fullerton and Otis College of Art and Design. For more information, please visit our publishing page. To learn more about the USC Games program, the #1 game program in the world, please visit the website listed on the right side of the store page.<br/><br/>", "metacritic": null, "released": "2023-12-15", "tba": false, "updated": "2023-12-18T07:25:38", "background_image": "https://media.rawg.io/media/screenshots/363/3635915e68389a56e566622507a72cd5.jpg", "website": "https://cinema.usc.edu/interactive/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 538, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bloompunk Team"], "genres": ["Action", "Indie"], "publishers": ["USC Games"], "esrb_rating": null}