{"id": 973895, "slug": "conway-disappearance-at-dahlia-view-digital-deluxe", "name": "Conway: Disappearance at Dahlia View Digital Deluxe", "name_original": "Conway: Disappearance at Dahlia View Digital Deluxe", "description": "Conway: Disappearance at Dahlia View Digital Deluxe includes:<br/><br/>\n<ul>\n<li>Conway: Disappearance at Dahlia View</li>\n<li>Conway: Disappearance at Dahlia View Soundtrack</li>\n</ul><br/>\n\nSometimes it takes a nightmare to wake a place like Dahlia View.\n<br/>\nLead the investigation into a missing child and discover the dark secret of Dahlia View in this story-driven observational thriller from the creators of The Occupation and Ether One.\n<br/>\n<br/>\n<br/>\n<br/>\nConway: Disappearance at Dahlia View is a gripping observational thriller set in 1950s England. When 8-year-old Charlotte May is reported missing from Dahlia View, retired detective Robert Conway searches for the truth behind her disappearance, observing his neighbours from his apartment window and questioning their behaviour. As suspicions escalate, Conway launches his own investigation into Charlotte May’s disappearance, following leads, uncovering new evidence and piecing the case together on an unpredictable path to the truth.GAME FEATURES:A tense thriller\n<br/>\nExperience a tense and emotional story in an all-new detective thriller from White Paper Games, the creators of The Occupation and Ether One.\n<br/>\n<br/>\nObserve\n<br/>\nExplore Dahlia View, solve puzzles and investigate residents to discover new evidence, profile suspects and piece together your investigation.\n<br/>\n<br/>\nSolve Puzzles\n<br/>\nLead the investigation into a missing person as Robert Conway, a retired detective living in Dahlia View.\n<br/>\n<br/>\nInvestigate\n<br/>\nObserve the actions of Dahlia View’s residents to uncover clues, study suspicious behaviour and gain new leads.\n<br/>\n<br/>", "metacritic": null, "released": "2021-11-01", "tba": false, "updated": "2023-12-18T08:17:35", "background_image": "https://media.rawg.io/media/screenshots/ee6/ee6a5a003acb6cb74ea98afc1ad834ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["White Paper Games"], "genres": [], "publishers": ["White Paper Games"], "esrb_rating": null}