{"id": 97382, "slug": "acheron", "name": "Acheron", "name_original": "Acheron", "description": "<p>\n<em>\"The year is 3016.</em>\n</p><p>\n<em>Base monitoring detecs a new source of electromagnetic radiation comming from below. A quick scan reveals the source of the signal.<br/>\r\n\tIt's coordinates are uploaded into Gregor's diving gear, a high tech suit capable of breaking the O² in the water, giving its wearer infinite breathing capabilities.\r\n\t</em>\n</p><p>\n<em>With everything set up, Gregor sets out for another scaveger expedition among the retro-futuristic ruins of his ancestors, now drowned by the seas.</em>\n</p><p>\n<em><strong>But this time things aren't what they seem to  be.</strong>\"</em>\n</p><p>\r\n\tAssume the role of Gregor, a lone scavenger, going though his expedition to search for the source of a strange signal detected by his monitoring system. Acheron is a mini sidescroller/metroidvania thematically set in a world flooded by the seas. Explore underwater environments, upgrade Gregor's gear with new abilities and discover what happens on his underwater adventure.\r\n</p><p>\r\n\tIt's a project developed as the capstone in a game development course. It's the resulting product of four months in development.\r\n</p><p>\n<strong>Controls </strong>(customizable on the game's launcher)\r\n</p><p>\n</p><p>\n<em>\"What was suposed to be a simple routine procedure gets out of control and it's on the hands of the player to understand what's going on, exploring the ruins of a retro-futuristic place took by the seas.\"</em>\n</p><p>\r\n\tGet the soundtrack:\r\n</p>", "metacritic": null, "released": "2016-10-27", "tba": false, "updated": "2019-08-28T23:25:29", "background_image": "https://media.rawg.io/media/screenshots/a34/a34d55ececa2ea6e450e0c53baad26e4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tito Lívio"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}