{"id": 973804, "slug": "katana-robo-rta", "name": "Katana Robo: RTA", "name_original": "Katana Robo: RTA", "description": "<h3>Story</h3>To thwart Samurai Robo's plan to take control of all the robots in the universe by awakening the Dominion Sphere from the highest point on the planet Mechanos, Katana Robo rushes to the Robot Tower, which looks like a platformer game stage made up of buildings, cars, space battleships, and more. Raising his Dominion Sphere as high as he can, Samurai Robo harnesses the power of the Dominion Sphere to bring objects together to create an impromptu robot tower, which is defended by numerous enemy robots that serve Samurai Robo. Katana Robo's journey includes battles with a variety of enemy robots, and it's up to you to destroy the Dominion Sphere before Samurai Robo can fully awaken it and turn the robots of the universe into his minions.<br/><br/><h3>Game Features</h3>Katana Robo: RTA is an 'Mechiro+Only Up Style RTA Action' game, where players utilize their honed action and platformer skills from various games to reach the top floor of the Robot Tower and destroy the Dominion Sphere in the shortest time possible. This game demands quick reflexes and precise controls, while also emphasizing strategic thinking and timing in its unique gameplay.<br/><br/><h3>World Battle Hashtag #KatanaRoboRTA</h3>Compete against gamers from around the world in Katana Robo: RTA using the World Battle hashtag #KatanaRoboRTA This game gives you the opportunity to show off your skills, achieve great records, and rise to the top of the global rankings. Show off your abilities to the world and become the world's strongest Katana Robo!<br/><br/><h3>Convenience</h3>Prioritizing convenience and user experience, Katana Robo: RTA, despite being an Only Up like style game, has implemented a checkpoint system to minimize player frustration. If a player fails a jump action or is destroyed in combat, they can resume the game from the nearest recall point. Additionally, if destroyed in battle, players automatically revive after 10 seconds. These systems maintain the flow of the game and provide a smooth gaming experience for the player.", "metacritic": null, "released": "2023-12-14", "tba": false, "updated": "2023-12-18T06:07:41", "background_image": "https://media.rawg.io/media/screenshots/c78/c78534254b94211ef1a6c79bb967863b.jpg", "website": "https://twinshalo.modoo.at/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 505, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Twins Halo"], "genres": ["Action", "Indie"], "publishers": ["Twins Halo"], "esrb_rating": null}