{"id": 973842, "slug": "calling-home", "name": "Calling Home", "name_original": "Calling Home", "description": "<h3>ROADMAP 2024</h3><br/><br/><br/><br/><h3>Discover. Create. Manage.</h3>Discover new planets, gather resources, and explore ancient civilizations! Build outposts to repair your ship, and reaching your homebase remains your top priority! Calling Home offers a fresh take on the Resource Management genre. Begin by gathering resources, building, automating, and optimizing your outpost. Explore planets and adjust to their unique environments to find rare resources or plans and ideas left behind by lost civilizations.<br/>Chart your path back home and start Calling Home!<br/><br/><h3>Research and advance your technology.</h3>Discover ancient alien technologies and implement your discoveries into your own buildings and machines. Unlock new upgrades for your player characters augmentations and adapt to your new surroundings. Become the explorer of wild planets' mysteries and use your findings to not only find a way back home but also bring them back to your home planet.<br/><br/><br/><br/><br/><br/><br/><br/>Introducing the Mechanical Advisory Recollection and Search Unit, or your M.A.R.S.-Unit from your homebase. He and his vast database will accompany you on your journey, providing useful information on the planets' ecosystem. He'll serve as your logbook and help you remember important steps from your travels. M.A.R.S. can also assist in resource gathering with its Scan feature and keep you company with its playful nature.<br/><br/><br/><br/>Utilize M.A.R.S. to locate resources and gather them with your advanced tool arm. Collect biological matter from creatures and process fluids to acquire improved raw materials, enhancing your productivity.<br/><br/><h3>Combine the best of two perspectives!</h3><br/><br/><br/>Experience the seamless blend of first-person adventure and bird's-eye view strategy as you plan, layout, and build your outpost with efficiency from above. Immerse yourself in your creation by walking through it in first-person view and explore the planet up close.<br/><br/>Build an outpost and make it your own!<br/>Construct an outpost that caters to both the needs of your survival and your desire for a personalized base. Utilize the various resources at your disposal to build a base of operations that provides refuge for you and your machinery. Establish many modular rooms that can be tailored to your liking, with specialized facilities aimed at automating the crafting and harvesting processes.<br/><br/><br/><br/>Explore the planet in first-person!<br/>Immerse yourself in the fascinating worlds of this universe. Collect valuable resources and gain knowledge throughout your journey. Implement your findings into the research for your base.<br/><br/><br/><br/>You'll have a unique perspective in which to oversee your base's layout from above, making it easy to optimize your resources and automate your crafting and gathering processes. Then, switch to a first-person perspective and delve into the mysteries of the planet's history and forgotten technologies. Use your newfound discoveries and knowledge to expand your base even further and chart your eventual path back to home base!<br/><br/><br/><br/>Many places in space once were inhabited, yet their stories have since been forgotten. Exploring the ruins of long-gone civilizations can help you uncover their history and harness their technology for your own benefit. Unearth lost relics and uncover secrets from the planet's past, expanding your knowledge and your outpost.<br/><br/>", "metacritic": null, "released": "2023-12-15", "tba": false, "updated": "2023-12-18T07:03:03", "background_image": "https://media.rawg.io/media/screenshots/6fd/6fdf10f42ee5e56cc53c9b6c52f0d25b.jpg", "website": "http://www.crystalfox.de?utm_source=steam", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Crystal Fox"], "genres": ["Adventure", "Strategy", "Indie"], "publishers": ["Crystal Fox"], "esrb_rating": null}