{"id": 97390, "slug": "polyorbis", "name": "Polyorbis", "name_original": "Polyorbis", "description": "<p> In Polyorbis you will compete with red enemies to survive, the longer you survive the harder enemies become. DecCorp has landed strategic boxes into nearby craters to supply you, from these boxes you can pick up pink hearts to gain health, and yellow boxes to refill ammunition. Be aware, enemies will spawn around these boxes, they are black/red and move around the planet, the longer you survive the more they evolve. The enemies will shoot projectiles in an attempt to eliminate you, touching them will also damage you. You are able to launch your own projectiles by pointing your mouse in a direction and left clicking, their charge will drop after repeated usage. Your score will increase the longer you survive and with the amount of enemies you destroy. \r\n</p><p>\n<strong>Projectiles:</strong> The first yellow attack is an inaccurate medium-damage common fast attack, the second blue attack is an accurate high-damage slow attack, and the third red attack is an explosion-shotgun style attack. <br/>\n</p><p>\n<strong>Controls:</strong></p><ul><li>Movement: WASD + Space to move   Attack: The mouse is used to aim, and left click to fire the selected attack. 1-2-3 (on keyboard) cycles the selected attacks (highlighted in the bottom left corner on the HUD).</li><li>Camera: To zoom the camera use the scroll wheel, and to orientate hold right mouse and move the mouse to a new angle. 0.1.0 automated slight camera tilt near poles.</li><li>Window: Escape opens a pause menu with settings. F1 toggles this help menu, F2 takes a screenshot to a roaming/home folder, F3 toggles a debug overlay, F4 toggles the HUD, F11 fullscreen.</li><li>Gamepad: There is support for XBox, and XBox-like controllers, with control customization being added in after Ludum Dare 38.</li></ul><p>\n<strong>Ludum Dare 38: </strong>Our Game Page.\r\n</p><p>\n<strong>Bugs/Crashes: </strong>If you experience any replicable bugs or crashes please send a email to \"mattparks5855@gmail.com\", along with the log at the instance (found in roaming or home /.polyorbis/logs/<strong>HOUR.MINUTE.SECOND-MONTH-DAY-YEAR</strong>.log).<br/>\n</p><p>\n<strong>Follow Us:</strong> Here are our Twitters and YouTubes:\r\n</p><ul>\n<li>Equilibrium Games: Twitter</li>\n<li>Decaxon: Twitter, YouTube</li>\n<li>Mattparks: Twitter, Youtube</li>\n</ul>", "metacritic": null, "released": "2017-04-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0bc/0bc830d3e5f2fb9367e46b4b27feb1e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["EquilGame"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}