{"id": 973952, "slug": "westale-peelgrimage", "name": "Westale: Peelgrimage", "name_original": "Westale: Peelgrimage", "description": "Each character has 3 forms, with each form has different appearance and skills. Player can evolve into new forms through \"Sarira\" in the game. For example, Sun Wukong can be evolved from “Rookie” to “Heavenly Might”, and then to \"Divine Monkie\". With each evolution, your power can be increased by more than double.<br/><br/><br/><br/><br/>Player can transform into various immortals from \"Journey to the West\" for a period of time in the game, such as “Aspects of Lightning”, \"Opulence\", \"Manjusri\", \"Xingtian\", and etc. Each immortal comes with different abilities that help improve your survival rate among monsters.<br/><br/><br/><br/><br/>Westale:Peelgrimage designed many creative weapons and items based on the Survivor-like games. Have you ever heard that \"Bullet Screen\" can kill monsters? Have you ever seen someone kill monsters with a pencil? How about generate a \"Black Hole\" and suck in a ton of monsters? We make these things possible for you! And in this game, there are even more possibilities beyond these!<br/><br/><br/><br/><br/>Acquire specific magical treasures that can be combined to a super-powerful relics, unleashing powers greater than the sum of their parts. The game features up to 20 artifacts with various effects, each capable of instantly transforming your combat experience!<br/><br/><br/><br/><br/><br/><br/><ul><li>Unlock 7 characters with different styles. Evolve them into three different states to maximize their power.<br/></li><li>Explore combinations of over 200 diverse of weapons, magical treasures and items.<br/></li><li>Synthesize extraordinary relics for a more exhilarating and explosive hack and slash experience.</li></ul>", "metacritic": null, "released": "2023-12-17", "tba": false, "updated": "2023-12-22T06:23:17", "background_image": "https://media.rawg.io/media/screenshots/1ed/1ed0b09c1b9f1e13bc7aca73e05152b6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["两把刷子工作室"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["2P Games"], "esrb_rating": null}