{"id": 973963, "slug": "g-modeakaibusu-tan-zhen-gui-sheng-chuan-ling-ji-13", "name": "G-MODEアーカイブス+ 探偵・癸生川凌介事件譚 Vol.13「黄昏は瑠璃の追憶」", "name_original": "G-MODEアーカイブス+ 探偵・癸生川凌介事件譚 Vol.13「黄昏は瑠璃の追憶」", "description": "What if I had made a different choice then?<br/>The truth and consequences of memory.<br/>【Game System】<br/>This is a mystery adventure game in which the player solves a series of difficult cases that occur in a fictional town called Marihama City in K Prefecture.<br/>The player controls the main character in the scenario and solves the mystery by selecting commands in the conversation and deduction parts, and by gathering information and evidence that will serve as clues to solve the case.<br/>The story progresses by command selection, so even beginners can easily play the game.<br/><br/>【Story】<br/>The familiar members of the Kibukawa Detective Agency take on a murder case involving the past of a female therapist renowned for her regressive hypnotherapy.<br/><br/>Masao Ikurumi visits a clinic for an interview, where a key witness in a murder case is to be regressionally hypnotized.<br/>The witness, who had been missing for three years and was found with a head injury 10 days earlier, says he has no memory of the incident or the time before.<br/><br/>The female therapist who performs the regression hypnosis seems to know the witness...?<br/>What secrets are hidden between the two?", "metacritic": null, "released": "2023-12-20", "tba": false, "updated": "2023-12-22T06:35:35", "background_image": "https://media.rawg.io/media/screenshots/650/650b3700fbfec3d9891c7e175e42bd53.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["G-mode"], "genres": ["Adventure"], "publishers": ["G-Mode"], "esrb_rating": null}