{"id": 973943, "slug": "fallen-shinobi", "name": "Fallen Shinobi", "name_original": "Fallen Shinobi", "description": "It is an era of warring states.<br />\nBy some good fortune, your side has managed to capture from the enemy<br />\na girl called Ayame—hailed as the strongest shinobi in all of Japan.<br />\nYour chief then gives you an order.<br />\n&quot;Train that shinobi dog Ayame so that she becomes our dog instead!&quot;<br />\nFallen Shinobi is a sex training simulation game with fun and easy-to-learn point-and-click controls.<br />\nAll training scenes are fully voiced and fully utilize Live2D for slick and smooth animation.<br />\nWith an incredible 35 different models of Ayame to grope and feel up,<br />\nand over 4000 motion animations to compliment them,<br />\nyou&#39;ll be kept entertained for hours upon hours of gameplay.<br />\nYou can train Ayame in three different ways: by letting her pleasure you, by violating her, or by disgracing her.<br />\nHow you carry out your training will effect what ending you get, with over 21 sexy animated endings to discover, both good and bad!<br />\nGame Features:</p>\n<ul>\n<li>\n<p>Dynamic Lewdness<br />\nAyame&#39;s reactions will change according to how lewd you get!</p>\n</li>\n<li>\n<p>Conveniently Looped Animations<br />\nMany of the game&#39;s animations can be left to run on loop for those times when you want to have a hand spare.</p>\n</li>\n<li>\n<p>Variable Animation Speed<br />\nThe major animations have many different speeds they can be played at.<br />\nSo whether you want to take things nice and slow, or thrust over and over like crazy, Fallen Shinobi has you covered.</p>\n</li>\n<li>Free-time System<br />\nAfter a hard day&#39;s training, you&#39;ll have free time at night to do what you want.<br />\nYou can even choose to spend the night getting intimate with other girls if you so please!  </li>\n<li>Customizable Costumes!<br />\nBecome friendly with the girls, and you&#39;ll be able to customize their costumes!<br />\nThe girls can also wear their costumes in the sex scenes too!</li>\n</ul>", "metacritic": null, "released": "2023-12-18", "tba": false, "updated": "2024-02-19T13:24:46", "background_image": "https://media.rawg.io/media/games/db2/db24c7b0013ee22d37f8fe216c06849e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 349, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["marron☆marron"], "genres": ["Simulation"], "publishers": ["Mango Party"], "esrb_rating": null}