{"id": 974019, "slug": "chasing-chickens", "name": "Chasing Chickens", "name_original": "Chasing Chickens", "description": "💥 <strong>Dive Deep into a Labyrinthine World:</strong> Immerse yourself in an enigmatic maze where every twist and turn promises adrenaline-pumping encounters. Armed with guts, determination, and a cannon that fires beachball grenades, you’ll outwit ruthless robot chickens in a game where the stakes are always high!<br/><br/>👩 <strong>Feisty Female Protagonist:</strong> Navigate the maze as only a fierce heroine can. But be warned, you're up against a deadly sisterhood of relentless robotic fowl!<br/><br/>🛎️ <strong>Your Mission</strong>: To hunt down the 23 elusive bells scattered through the maze.<br/><br/>🚫 <strong>Slay, but Survive:</strong> With no final boss battle, the real challenge is to outlive and outsmart.<br/><br/>🔥 <strong>Power-Ups &amp; Pick-Ups:</strong> Start as an underdog and transform into a maze master! From the M86 Motion Tracker to the Z-Series Quantum Boots, every pick-up makes you a force to be reckoned with. You'll receive tactical support and supplies beamed straight from HQ to aid you in the combat zone.<br/><br/>🍗 <strong>Chicken Combat:</strong> Think chickens are all cluck and no bite? Think again. With regular and ninja variants, these beady-eyed birds promise mayhem. Score multiplier bonuses with skillful eliminations and leverage the ninjas’ forcefields for tactical advantage!<br/><br/>🌌 <strong>Boundless Exploration:</strong> Jump with gazelle-like grace atop hedges, find the lost keycards, and save the world. (Watch out for the floating cows!)<br/><br/>🌀 <strong>Vortex Jump Disc:</strong> Your ticket to tactical advantage and escapes. This versatile space-twisting tool offers a range of tactical mechanics from instant emergency teleportation to high-flying aerial views. Use it wisely!<br/><br/>🚀 <strong>A Multilayered Experience:</strong> Whether you crave the heart-pounding rush of \"Hot Wings\" or a lighter challenge in \"Mild\", there's a mode that mirrors your mood and mastery.<br/><br/>🎉 <strong>The Ultimate Gaming Adventure Awaits:</strong> Get ready for a rollercoaster of emotions, strategy, and pure fun! Each step in the maze brings a new challenge, a fresh thrill, and a test of your wits. <br/><br/>So grab your gear, embrace the unexpected, and remember: in \"Chasing Chickens\", it's not just about surviving, it's about living the adventure. As the maze unravels, so will the depth of your prowess. <strong>Ready to take the plunge? Dive in, and let the chase begin! </strong>", "metacritic": null, "released": "2023-12-19", "tba": false, "updated": "2023-12-22T07:51:47", "background_image": "https://media.rawg.io/media/screenshots/62b/62be058bfb80fd6aa603d8dfc40260d5.jpg", "website": "http://quartus.net/games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 258, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Quartus Games"], "genres": ["Action"], "publishers": ["Quartus Games"], "esrb_rating": null}