{"id": 974078, "slug": "shape-of-clouds", "name": "Shape of Clouds", "name_original": "Shape of Clouds", "description": "Welcome to Shape of Clouds, a captivating art game that challenges your creativity and spatial skills! Immerse yourself in a world of pixelated beauty where you embark on a unique journey to restore stunning pictures.<br/><br/><strong>Gameplay:</strong><br/>In Shape of Clouds, your mission is to reconstruct intricate images by strategically rotating voxel pieces. This innovative puzzle experience combines the charm of traditional art with the excitement of 3D gameplay. Each level presents a canvas waiting for your touch, offering a refreshing challenge for your mind and a feast for your eyes.<br/><br/><strong>How to Play:</strong><br/>- Select a level and observe the fragmented picture.<br/>- Click and drag to rotate voxel pieces until the picture is restored.<br/>- Enjoy the satisfaction of revealing the complete artwork.<br/><br/><strong>Diverse Themes:</strong><br/>Explore a vast array of themes, from serene landscapes to vibrant cityscapes. Shape of Clouds takes you on a visual adventure through multiple levels, each featuring a distinct atmosphere and artistic style. Whether you're a fan of nature, architecture, or abstract designs, there's a puzzle waiting for you.<br/><br/><strong>3D 360-Degree Perspective:</strong><br/>Engage with the game in a way you've never experienced before. Shape of Clouds provides a dynamic 3D environment with a 360-degree perspective, allowing you to view and manipulate the voxel pieces from every angle. This adds an extra layer of immersion, making each puzzle-solving moment more enjoyable.<br/><br/><strong>Features:</strong><br/>- Unique voxel art style<br/>- Intuitive controls for easy rotation<br/>- Relaxing yet challenging gameplay<br/>- Multiple levels with diverse themes<br/>- 3D 360-degree perspective for a truly immersive experience", "metacritic": null, "released": "2023-12-20", "tba": false, "updated": "2023-12-22T09:10:16", "background_image": "https://media.rawg.io/media/screenshots/11e/11e333944d387a30a2fbe0a3d4ad7497.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Latte Games JSC"], "genres": ["Casual", "Indie"], "publishers": ["Latte Games JSC"], "esrb_rating": null}