{"id": 974033, "slug": "epjia-zu", "name": "Ep.家族", "name_original": "Ep.家族", "description": "Gameplay:<br/>first-person exploration game that focuses on a family living in Japan who have encountered unfortunate events, with the daughter of the family as the protagonist.<br/><br/>Story:<br/>The family, consisting of a father, mother, and the daughter (the player character), has encountered a series of unfortunate events that have drastically changed them. As the player, it falls upon you to guide this altered family in what you believe to be the right direction.<br/><br/>Eerie Music:<br/>The in-game music and sound design intensify the player's sense of unease, further amplifying the fear factor.<br/><br/>Pursuit of Fear:<br/>[Ep. 家族] strives to immerse players in a chilling experience. Unique fear-inducing elements are strategically placed throughout the game, keeping players on their toes.<br/><br/>Player Choices:<br/>The story and ending of the game can be altered based on the choices players make. There are two different endings to uncover.<br/><br/>Setting:<br/>The game is set in Japan, offering players a unique cultural backdrop for the horror experience.<br/><br/>Streaming and Let's Plays:<br/>Players are encouraged to stream, record, and share their gameplay experiences of [Ep. 家族] with others.<br/><br/>Please note that [Ep. 家族] is designed to provide players with a gripping and unsettling horror experience. Player choices will shape the narrative and ultimately lead to one of two distinct endings. Are you prepared to confront the terrors that await in this Japanese household?", "metacritic": null, "released": "2023-12-19", "tba": false, "updated": "2023-12-22T08:09:45", "background_image": "https://media.rawg.io/media/screenshots/401/401d680035b94008c46831581f67d5cc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kutsunasi"], "genres": ["Indie"], "publishers": ["Kutsunasi"], "esrb_rating": null}