{"id": 974035, "slug": "new-stars", "name": "New Stars", "name_original": "New Stars", "description": "New Stars is a 4X strategy game, on a galactic scale. Explore new worlds, build mega-structures, and found prosperous interstellar colonies. Go head-to-head with alien empires and build the greatest empire to survive the test of time, or be the last remaining in the galaxy to succeed.<br/><br/><br/>Customize your empire from world preferences, eight different ideologies with their own bonuses, hundreds of empire icons and more. Customize a unique galaxy based on your preferences. There are five different galaxy sizes to choose from.<br/><br/><br/>Unique empires, species, and clans exist within a customizable and procedurally generated galaxy with limitless possibilities, and thousands of unique planets, stars and worlds. Some planets have valuable resources that can be collected.<br/><br/><br/>Explore star systems and discover new secrets of the galaxy, and find clues to your lost home. Discoveries such as white dwarfs, ancient ruins, lost ships, and much more can be found within the abyss. Some planets have hidden features that increase their value.<br/><br/><br/>Expand your empire across new stars to new frontiers, and build strong colonies that will power your galactic economy. Collect natural resources from planets and stars using starhubs. Beware of pesky space pirates that may plunder your resources for their own gain.<br/><br/><br/>Merge ships into one fleet, and combine them against your adversaries. Defend against attacks by upgrading starbases, or fortifying your colonies. Research new ship types or advanced military capabilities to get an edge over your alien foes.<br/><br/><br/>Declare wars, trade resources, make agreements, declare friendships, share intel, forge galactic unions, and much more. Some empires may be openly hostile or require appeasing, others may be cooperative, and some may be integrated into your empire.<br/><br/><br/>Construct military starship presets with unique turrets. Unlock larger ships and more powerful turrets to allow your empire to get an edge in interstellar warfare.<br/><br/><strong>There is much to do in New Stars and you choose how to play.<br/>New Stars is in development, so there is more yet to come...</strong>", "metacritic": null, "released": "2023-12-19", "tba": false, "updated": "2023-12-22T08:12:24", "background_image": "https://media.rawg.io/media/screenshots/ec1/ec1b961da9d26a7a5b45b3ea0fdbafad.jpg", "website": "https://newstarsgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 280, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["adamjr"], "genres": ["Action", "Strategy", "Simulation", "Indie"], "publishers": ["adamjr"], "esrb_rating": null}