{"id": 974071, "slug": "cosmic-armada", "name": "Cosmic Armada", "name_original": "Cosmic Armada", "description": "<strong>Summary</strong><br/>-Pilot spaceships and lead an entire fleet.<br/>-Configure ship weapons, thrusters and modules.<br/>-Survive a hostile galaxy by fighting, mining, trading, crafting, exploring, doing missions and improving your fleet.<br/>-Colonize planets, moons and stations to expand your domain and increase your tax revenue.<br/>-Three different game modes:  campaign, custom and scenario.<br/>-Map editor included for creating your own mods and scenarios.<br/><br/><br/><strong>Game Modes</strong><br/>Cosmic Armada is an action-packed space combat and exploration game that takes you on a journey from refugee to galactic conqueror.<br/><br/>There are three different game modes: campaign, custom game, and scenario.  The game includes a map editor which allows you to create scenarios and mods.<br/><br/>In the campaign, you start out as a refugee who's home planet has just been conquered by the tyrannical Solar Empire.  You and your fellow refugees must struggle to survive, take back your homeworld and get revenge against the empire.  Each new campaign includes a procedurally generated galaxy that will be different each time you start a new game.<br/><br/>In custom game mode, you must conquer the capitals of all your archenemies.  At the beginning of the game, you select which factions you want to play with and who your archenemies are.  The game will create a procedurally generated galaxy for each new custom game.<br/><br/>In scenario mode, you can play any scenarios created in the map editor or downloaded from the workshop.<br/><br/><strong>Manage Your Fleet</strong><br/>One ship won't be enough to survive in a very dangerous galaxy.  You must build a fleet of ships in order to withstand the attacks from the Solar Empire, the Hex AI, the alien Vurgak Empire, and various criminal organizations.<br/><br/>As you earn money doing missions or selling the items you mine, craft or steal, you will be able to purchase ships at shipyards across the galaxy.  You can also add ships to your fleet by boarding and capturing enemy or derelict ships.<br/><br/>You control the lead ship of your fleet directly, and the rest of the ships in your fleet follow it.  Different fleet formations are available to control the overall behavior of your other ships.  If you wish to pilot a different ship in your fleet, you can easily switch to it in the fleet panel, and the rest of the fleet will follow that ship instead.<br/><br/><strong>Upgrade Your Ships</strong><br/>Each ship can be modified at mechanic shops across the galaxy.  Weapons, thrusters and modules can be added or removed at the mechanic shop.  The mechanic shops will also sell these items and repair your ships if they are damaged.  When ships are destroyed, they sometimes drop weapons, thrusters or modules that can be picked up.<br/><br/><strong>Build and Upgrade Colonies</strong><br/>You begin with one small colony that can't provide much, so upgrading your colony and founding new ones is essential.  Each colony can provide tax income to fund your fleet operations, a place to repair and refuel your fleet, a place to store your items, markets to trade, shipyards to buy ships, and more.  The more and bigger colonies you have, the larger fleet you can afford.  The crew on all your ships needs to be paid, so larger fleets will cost more and will require more income to support.<br/><br/>To upgrade your colonies, you can construct various buildings that provide different functions.  Each building will require resources to build.  These resources can be purchased from other factions or manufactured using factories, smelters and raw resources that can be mined from asteroids.<br/><br/><strong>Mining, Crafting and Trade</strong><br/>Your ship can be equipped with mining lasers to mine resources from asteroids.  These resources can be sold or used to manufacture more valuable items.  Crafting is done automatically by factories and smelters which can be built at any colony you own.  All you have to do is select the item to manufacture and make sure the required ingredients are in the colony inventory.  These items can be used to construct buildings or traded at markets across the galaxy.<br/><br/><strong>Piracy</strong><br/>Surviving the galaxy is challenging, and you may be forced to use nefarious means to get what you want.  You may have to hunt for bounties, board ships, steal ships, steal money or smuggle goods.  Cloaking devices and powerful weapons are essential for those willing to get involved in the underworld.<br/><br/><strong>Missions</strong><br/>The campaign includes a series of tutorial and story missions that must be completed in order to win the game and make it into the high score list.<br/><br/>In addition to story missions, each colony has its own HQ which gives out random missions the player can complete for money.  These non-story missions are available in the campaign, custom games and scenarios.<br/><br/>For scenarios, the scenario creators can create their own story mission series in the map editor.<br/><br/><strong>Map Editor and Modding</strong><br/>The built-in map editor allows players to create their own scenarios and mods.  A custom galaxy can be created which includes new stars, planets, moons, stations, missions, and more.  Mods allow players to modify ships, weapons, thrusters, modules, fleets and factions.  Each scenario can be combined with any number of mods.", "metacritic": null, "released": "2023-12-20", "tba": false, "updated": "2023-12-22T08:58:49", "background_image": "https://media.rawg.io/media/screenshots/42b/42bc11b2329b597f4f60de2756617491.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Charged Software"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Charged Software"], "esrb_rating": null}