{"id": 974074, "slug": "the-arrogant-kaiju-princess-and-the-detective-serv", "name": "The Arrogant Kaiju Princess and The Detective Servant", "name_original": "The Arrogant Kaiju Princess and The Detective Servant", "description": " <br/><br/><br/>This is a story about being kidnapped by aliens and coming to an alien planet...<br/>An ordinary detective on Earth, let's call him \"the detective\", encounters an unprecedented case.<br/>It requires him to... become the pet of Daigneux, an enigmatic and beautiful alien girl!<br/>This blonde girl may look sweet and pretty, but she's got a savage streak underneath, and has no respect for any lifeforms. She even has the ability to summon an army of powerful monsters! <br/>Daigneux, who has a long criminal record for destroying several planets, is the infamous Celestial Tyrant!<br/>Under her tyranny, how will the protagonist use his wisdom to survive?<br/>As a pet, the only way for him to improve his standing is to... conquer planets?! <br/>His job duties: serve Daigneux, exercise, and command monsters!<br/>As a weak, pitiful, and helpless Earthling who can't do anything but eat, the only rule he needs to survive on this alien planet is...<br/>Leech off Daigneux as much as possible!  <br/><br/><br/>In the game, players take on the role of a detective that was kidnapped by aliens to serve Daigneux, the beautiful Celestial Tyrant. <br/>The detective must improve his relationship with Daigneux through interacting with her, completing conquest missions before their deadlines, and tending to her “special needs” before she goes to bed. <br/><br/>But he must also train during his spare time to improve the abilities of the monsters that are linked to his mind, so that they can take on the various factions on this planet!<br/><br/>The Celestial Tyrant may not be reasoned with, but once the detective improves his relationship with her... maybe he'll get to see a different side of her?<br/>During his conquests, the planet, which seemed ordinary at first, always yields minute details that pique the detective's interest.<br/><br/>The secrets that lie behind it will be exposed with Daigneux and the detective's arrival...<br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/>✦ Takes place in the same universe as Kaiju Princess<br/>✦ Fully voiced dialogue in Japanese<br/>✦ A light-novel-style storyline<br/>✦ Lively and dynamic animated graphics<br/>✦ Immersive management-style game mechanics<br/>✦ A rich variety of outfits to change into<br/>✦ Better H-Scenes, featuring more positions than Kaiju Princess<br/>✦ A uniquely charming cast of beautiful characters<br/>✦ Exquisitely illustrated H-scenes and CGs", "metacritic": null, "released": "2023-12-20", "tba": false, "updated": "2024-01-12T22:54:59", "background_image": "https://media.rawg.io/media/screenshots/425/425acfad1d84cfc61bf4975141432f34.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "beaten": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["PantyParrot", "ARTcelerator"], "genres": ["RPG", "Casual", "Indie"], "publishers": ["Mango Party"], "esrb_rating": null}