{"id": 974016, "slug": "supreme-ruler-the-great-war-remastered", "name": "Supreme Ruler The Great War Remastered", "name_original": "Supreme Ruler The Great War Remastered", "description": "Supreme Ruler The Great War Remastered includes the previous game content in an updated game engine. Set in the First World War, the Central Powers and the Triple Entente prepare to attack, with no understanding of the scale of conflict they will unleash. Over the coming years, the armies of these nations would come to understand how air power, submarines and artillery were about to transform how war was waged.<br/><br/><br/><br/>Designed within the updated Supreme Ruler 2030 engine, the game content benefits from improved performance running in 64 bit. The world map theaters and AI pathing have also been improved for smoother game flow. Game visuals are also improved with DirectX 11 support and updates to specific terrain, unit and building elements. Border graphics, grid graphics, lighting and water visuals have also been improved.<br/><br/><br/><br/>The updated game engine also includes numerous new features from the development of Supreme Ruler 2030 and Galactic Ruler projects.<br/><br/>Managing colonies directly, or trade them away<br/>When leading your empire, you can now take full control of your colonies. Switch between them as needed to run your empire your way or use a colony as a bargaining chip with other nations.<br/><br/><br/>Updated User interface with larger lists<br/>Lists of technologies, resources or units can include a large number of entries. The panels in the game can now be expanded to see more information at once. Control clicking an Shift clicking are now supported for selected exactly what you want<br/><br/><br/>Battlegroup Manager<br/>Creating a hierarchy of units can be done more easily with the Battlegroup manager. Filter to specific unit types to create battlegroups from those units. Manage your groups, assign leaders or automate groups. <br/><br/><br/><br/>Strategic Unit Trading<br/>Surplus units no longer need to sit around collecting dust in a country's inventory. They can now be sold to (and purchased from) a military marketplace accessible to all regions. Cheap deals on unwanted equipment can help smaller nations compete globally with other nations.<br/><br/><br/>All this, and more.<br/><br/>Players can choose to jump into the action as any region in the world through sandbox play or follow campaigns of key regions to watch historic events unfold. Make the correct Economic, Diplomatic, Domestic and Military decisions to assure the survival of your nation.<br/> <br/>Key Features:<br/>- World War I Campaigns for various major powers from the era.<br/>- Take Control of any Nation in Sandbox Mode and impact the outcome of the conflict.<br/>- Start in 1914 or 1917 and progress well into the 21st century for an Epic Game-play experience.<br/>- The butterfly effect... Influence the timeline and outcome of thousands of historical events.<br/>- Use Diplomacy, Trade, Espionage, and Intimidation to influence the policies of other nations.<br/>- Guide your Nation through the first war waged on a global scale.<br/>- Modernize your economy to support whatever social and military policies you choose.<br/>- Comprehensive Tech Tree features over 100 years of technology and equipment advances.<br/>- Sophisticated Real-Time Strategic and Tactical Control of your Military Forces.<br/>- Detailed historically-accurate Armies down to the Battalion level.<br/>- Choose your level of control.  Make all decisions or use your Cabinet Ministers to help.<br/>- Battle the elements! Fully integrated weather model influences battlefield outcomes.<br/>- Multiplayer through Steam Matchmaking (Windows version only)<br/><br/>Other game engine improvements of this remastered edition include<br/><ul><li>UI scaling for large screen resolutions<br/></li><li>Supported regions increased to 1024 allowing for more regions per map<br/></li><li>Ability to trade colonies and battlezones<br/></li><li>Improved AI Pathing, updated theater/battlezone design<br/></li><li>Updates to colony/partisans/guerrillas system including coups<br/></li><li>Updated AI tactics including naval fleets during targeted sea attacks<br/></li><li>Updated AI for carriers and assigned aicraft<br/></li><li>Supply chain report for feedback on resources<br/></li><li>A system of map Nav points<br/></li><li>MP chat system rebuilt including map pings<br/></li><li>MP stability improvements<br/></li><li>Technology project additional feedback of \"leads to\" techs<br/></li><li>Automate Unit option<br/></li><li>Redesigned tutorial in four chapters<br/></li><li>Improved feedback from on map notifications<br/></li><li>Battlegroup leaders<br/></li><li>Bridges visible on map <br/></li><li>Improved visual of fictional leaders<br/></li><li>Equipment file combat stats revised, system refactored and new entries<br/></li><li>Tech projects can have up to 4 effects<br/></li><li>New tech buff system to tie techs to specific unit types<br/></li><li>Expanded coups/revolts system<br/></li><li>Counter Espionage and Assassinate mission system in the early years. Cyber attack when player reach modern times.<br/></li><li>Unit Upgrades and Unit Refits<br/></li><li>Naval engineers<br/></li><li>Rationing by sector for commodity shortages<br/></li><li>Revised Population growth model?<br/></li><li>Exclude techs from list</li></ul>", "metacritic": null, "released": "2023-12-19", "tba": false, "updated": "2023-12-22T07:47:40", "background_image": "https://media.rawg.io/media/screenshots/947/947cfa1c04d53fe0b6d7d355d1d66a16.jpg", "website": "https://www.battlegoat.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 517, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BattleGoat Studios"], "genres": ["Strategy", "Simulation"], "publishers": ["BattleGoat Studios"], "esrb_rating": null}