{"id": 974080, "slug": "genius-moves", "name": "Genius Moves!", "name_original": "Genius Moves!", "description": "Dive into the world of \"Genius Moves!\" an engaging logic puzzle game that challenges your logic thinking as you guide adorable animals to collect their favorite food. This casual yet thought-provoking game is all about arranging action blocks (move forward, rotate, loop) wisely to solve puzzles and lead your adorable companions to their objectives. Embark on a delightful journey through 100 levels across 4 unique worlds, each offering a new set of challenges for you to conquer.<br/>\n<br/>\r\nFeatures:<br/>\n<br/>\r\n1. Visual Thinking Game in Disguise: Casual Challenges for Your Brain<br/>\r\n\"Genius Moves!\" is a casual brain teaser, designed to provide a relaxing yet mentally stimulating experience. Uncover the joy of solving puzzles by strategically arranging action blocks—move forward, rotate left or right, and loop inside actions— to guide your endearing animal friends to their targets. It's the perfect blend of simplicity and intellectual satisfaction.<br/>\n<br/>\r\n2. 100 Mind-Blowing Levels in 4 Whimsical Worlds<br/>\r\nEmbark on a whimsical adventure through 100 levels spread across 4 charming worlds. From lush meadows to mysterious sky, each environment is a visual delight that sets the stage for delightful puzzles. \"Genius Moves!\" ensures a gradual increase in challenge, offering a perfect balance between entertainment and mental engagement. How far can you explore in these enchanting realms?<br/>\n<br/>\r\n3. Many Cute Animal Characters for Collecting<br/>\r\nMeet an array of adorable animal characters, each waiting to join you on your puzzling journey. From playful squirrels to curious cats, collect these lovable companions as you progress through the levels. Share in their animated delight as they reach their collection targets, adding an extra layer of charm to your puzzle-solving escapades.<br/>\n<br/>\r\nGet ready to unwind and challenge your brain! It's not just a game; it's a delightful exploration of casual puzzles set against a backdrop of whimsical worlds and cute critters. Can you wisely arrange your moves to guide your animal friends to their targets? The adventure is yours to enjoy!", "metacritic": null, "released": "2023-12-20", "tba": false, "updated": "2023-12-22T09:12:54", "background_image": "https://media.rawg.io/media/screenshots/b1e/b1ef9e7b139edfc080ff097c9001a9a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Latte Games JSC"], "genres": ["Casual", "Indie"], "publishers": ["Latte Games JSC"], "esrb_rating": null}