{"id": 974072, "slug": "grand-war-rome-free-strategy-game", "name": "Grand War: Rome - Free Strategy Game", "name_original": "Grand War: Rome - Free Strategy Game", "description": "<h3>Description</h3><br/>Grand War：Rome Free to play！<br/><br/>Spanning 2000 years of history, Grand War: Rome offers an exciting journey of legendary battles! Recast the glory of war and rise to power through your extraordinary wisdom. Choose from legendary generals such as Caesar, Scipio, Hannibal, Pyrrhus and create your own era. With diverse campaigns across ancient nations like Rome, Samnium, Epirus, Carthage,Recast the glory of war, and the empire will rise because of you!<h3>Features</h3><ul> <li>Legendary Generals and Troops: Choose from a diverse array of legendary generals and unique troops, hone their skills and abilities through continuous battles, and explore different skill combinations to achieve unexpected and amazing effects on the battlefield.<br/> </li><li>Diverse Campaigns and Strategy: Experience a variety of historical campaigns, including the Punic Wars, Pyrrhic Wars, and Samnite Wars, and make your own choices to create a unique empire glory. Use different strategies to balance your troops, consider terrain factors, and build fortifications to turn the tide of the battle and emerge victorious.<br/> </li><li>Troop Growth and Skill: Your battle-tested troops will grow stronger and acquire new skills, allowing you to control the battlefield in different ways. From archers to warships, utilize a wealth of troops to create effective strategies and overcome your enemies.</li></ul>", "metacritic": null, "released": "2023-12-20", "tba": false, "updated": "2023-12-22T09:02:43", "background_image": "https://media.rawg.io/media/screenshots/8f6/8f693b5a45cc2c38489896e6b0e95dda.jpg", "website": "https://www.joynowstudiosgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 417, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Joynow Games"], "genres": ["Strategy"], "publishers": ["Joynow Games"], "esrb_rating": null}