{"id": 974179, "slug": "battle-of-zodiacs-card-game", "name": "Battle Of Zodiacs - Card Game", "name_original": "Battle Of Zodiacs - Card Game", "description": "Fully competitive 1v1 game, where the goal is to dominate your enemy's land!<br/>To fulfill their objective, each player will assemble a team with 3 heroes and a deck composed of items and spells.<br/><br/>Get ready to enter an epic battle that unites the zodiac signs with the medieval fantasy world! This competitive battle card game is the perfect game for fantasy and superstar fans.<br/><br/>Embark on a journey to become the great champion of this magical world, using the strength of the zodiac signs to defeat your enemies. Each hero represents a zodiac sign and comes with special abilities you can use to overcome your opponents.<br/>But be careful, your opponents also have their own powerful abilities! Be cunning and strategic to defeat them and become the big winner.<br/><br/><br/><br/>With a mix of fantasy and astrological elements, this game looks amazing. The card illustrations are stunning, depicting the zodiac signs as mighty medieval warriors, with legendary armor and weapons.<br/><br/>Waste no more time and join this epic adventure. Now join BoZ - Battle of Zodiacs, a competitive battle card game and get ready to fight for dominance in this fantastic world, using the power of the zodiac signs!<br/><br/><h3>Deck Building</h3>Players must consider the synergy between cards to build a deck that maximizes each sign's abilities and creates powerful combos. It is also important to take into account the strength and weakness of each sign in relation to the others, to balance the deck and make it more effective.<br/><br/>Additionally, the game has a pre-battle planning phase where players can choose which cards to use each round. This allows them to adjust their strategy to deal with the opponent's strategy and create a successful plan of attack.<br/><br/>In summary, the strategic charge of building the deck in this game is crucial to success. Players must have the skill and critical thinking to choose the right cards, create a solid strategy and maximize their chances of winning the epic battles.<br/><br/><h3>NOT a \"Pay to Win\" game</h3>We do not offer exclusive perks or benefits to players who invest money in the game.<br/>All players have an equal opportunity to progress and win, regardless of how much money they spend.<br/>Players will only be able to buy skins for their heroes, towers and card backs.<br/>All players will have access to all cards in the game from their first access. And they will be able to get 1 extra copy of the cards when advancing in the game levels, that is, <strong>the victory factor is in the player's skill and not in how much he invested in the game.</strong><br/><br/><h3>The Heroes of Zodaics</h3>In BoZ, choosing a team of heroes is crucial for success in battles. Each hero represents a zodiac sign with unique abilities and attributes that can be used to create a powerful and balanced team of heroes.<br/>The choice of heroes must take into account their abilities, synergy and the player's playstyle. Some heroes may be more attack-oriented, while others may be more defensive or strategic. Furthermore, it is important to choose heroes that can work well together to create powerful combos and synergies that can give the player an advantage during battle.<br/><br/><h3>The game for you</h3>Battle Of Zodiacs is an exciting and strategic game worth playing. With an attractive game system, strategic challenge, competitiveness and great replay value, this game is an excellent choice for players looking for a unique and exciting gaming experience.<br/>What will your team of heroes be? What will your deck look like? Which towers will you have on your battlefield?<br/><strong> Who will you be in Battle Of Zodiacs?</strong>", "metacritic": null, "released": "2023-12-24", "tba": false, "updated": "2023-12-25T03:34:58", "background_image": "https://media.rawg.io/media/screenshots/713/713ec9c46f003979befd7b5d9cec9b6b.jpg", "website": "https://www.battleofzodiacs.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Big Marck"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["The Big Marck"], "esrb_rating": null}