{"id": 974182, "slug": "paint-desk-simulator", "name": "Paint Desk Simulator", "name_original": "Paint Desk Simulator", "description": "Welcome to Paint Desk Simulator! A game about mixing and selling paint and paint products. In this game, you start off as a small business having to do everything by hand with no help with machines or any other external help. You have to pour and mix the paint in the game using the name and color codes that are given to you by the customer. Your goal is to match the exact color that the customer wants using its red, green, and blue values. After you are happy with what you have poured you will be mixing it up until it is perfect for selling. <br/>\n<br/>\r\nOver time, you will acquire money from selling all the paint. With this money, you will be able to buy upgrades and tools to make your job easier. These upgrades include more customers over time, higher tip chances, customers can have more patience, and even more storage for all your paint supply needs. Using these tools you increase how much you make and how often you can sell. <br/>\n<br/>\r\nEventually, you will be able to make much more money to afford a whole new office equipped with much more space for your paint-mixing needs. With this larger space, you can have more chances to obtain customers, maybe even a whole new line to accept two orders. And eventually, you can employ your own employees to do your job for you!<br/>\n<br/>\r\nPaint Desk Simulator is a game about making money, relaxing, and running your own business. We hope you enjoy this game from a two-man indie game developing team! There are many things to learn about PDS and its environment. Thank you for joining us, and all hail Radiant.", "metacritic": null, "released": "2023-12-22", "tba": false, "updated": "2023-12-25T03:38:42", "background_image": "https://media.rawg.io/media/screenshots/788/7883406a824e29ad822c8b4e0ad3e5d5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SplatGames"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["SplatGames"], "esrb_rating": null}