{"id": 974195, "slug": "railbreak", "name": "Railbreak", "name_original": "Railbreak", "description": "It's Saturday night in Cypress Ridge which means the city is in ruins, hordes of flesh eating undead are on the prowl, and you have the arcade all to yourself! Grab your lightgun (or keyboard, mouse, or gamepad), select your survivor, and blast your way to safety as the city burns around you in this on-rails survival horror shooter. Oh, and don't forget to bring a friend for zombie fodder, er, we mean multiplayer experience!<br/><br/>Railbreak melds a classic on-rails arcade experience with the cutting edge Unreal Engine 5. In this prelude to Outbreak: Shades of Horror, you'll get an opportunity to see the sights and sounds of Cypress Ridge and get chomped on by a zombie or four! Face the city alone, or bring a friend along with optional 2-player co-op supported across the entire game<br/><br/>Featuring a wide cast of survivors each with their own loadouts and traits, you'll find plenty of replayability in this absurd take of a survival horror game in a survival horror game. A full story mode experience awaits across six scenarios. Bonus modes include Score Attack, and the endless Onslaught Mode that keeps ratcheting up the difficulty until the undead finally seal your fate, as well as Boss Rush, the Shoutout Shootout, and the rogue-like semi-procedurally generated Glitch Gauntlet where anything can happen!<br/><br/>Crack open your piggy bank, snag a fizzy soda, and take a trip back to the 1990’s arcade.<br/><br/>Features:<br/><ul><li>Next-generation arcade experience with cutting edge graphics powered by Unreal Engine 5.<br/></li><li>Multiple ways to face the undead - Story Mode, Score Attack, Onslaught Mode, Boss Rush, Glitch Gauntlet and Shoutout Shootout!<br/></li><li>8 unique survivors to unlock with their own unique loadouts and perks!<br/></li><li>First class support for mouse, keyboard, gamepads, and the Sinden Lightgun.<br/></li><li>Unpredictable glitch system that dynamically changes game mechanics in real-time to keep you on your toes!<br/></li><li>Unique and thrilling cast of special infected and glitched boss creatures that hunt you across Cypress Ridge in epic fights for survival.<br/></li><li>Extreme gore and dismemberment as you tear apart the undead with a massive arsenal of powerful weapons.<br/></li><li>The cheesiest dialogue and voice acting ever featured in an on-rails shooter.<br/></li><li>Optional 2-player co-op across the entire game.</li></ul><ul><li>Score tracking across every mode in the game!</li></ul>", "metacritic": null, "released": "2023-12-22", "tba": false, "updated": "2023-12-25T04:00:50", "background_image": "https://media.rawg.io/media/screenshots/a1d/a1da6cdc645c27beabd9d131087e02aa.jpg", "website": "http://www.outbreakzone.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 297, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dead Drop Studios"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Dead Drop Studios"], "esrb_rating": null}