{"id": 974165, "slug": "the-witchs-cauldron-prologue", "name": "The Witch's Cauldron Prologue", "name_original": "The Witch's Cauldron Prologue", "description": "FULL VERSION. <br/>In the full version you will find even more exciting stories, experiments and game mechanics. You will be able to discover 12 unique game endings and determine the fate of the entire kingdom<br/><br/>https://store.steampowered.com/app/2251010/The_Witchs_Cauldron/<br/><br/><br/><strong>The Witch's Cauldron: prologue</strong> – A small plot part of a simulator of a medieval witch from the young indie team Harvey Games.<br/><br/><br/>You are a witch living on the outskirts of a small medieval town with her cat. Potions are your tools of choice. With your cauldron you brew your way through the world. But you've got to keep your balance. On one side of the scales is the terror you bring. On the other - your fame among the people. If the scales are tipped too much, someone will definitely come for your life. But it doesn't really matter, for your soul was lost long ago. And the cycle will continue.<br/><br/>While the shadow of the inquisition is yet far away, peasants, townsfolk and even the king himself are coming to pay their respects to you. Listen to their problems, learn their mysteries, unlock new recipes, and keep in mind that your benevolent or malevolent intentions will surely make a difference.<h3>Branching narrative.</h3> Meet a cast of weird petitioners with their incessant requests. Help them or follow your own agenda. Uncover secrets, play with people's fates or just make the cows sing. Potions you choose to brew for your visitors influence future events.<h3>Potion discovery.</h3> You begin knowing only a couple of basic recipes, but by experimenting with mixes you can unlock new ones. Not every problem can be solved with rat poison (but nothing stops you from trying). And no matter what gruesome end you've met in your last cycle, you get to keep all unlocked recipes. If you hit a block in your research, you can always ask for help, but are you ready to pay the price?<h3>Keep the balance.</h3> Don't let fame or fear get to your head. And remember: peasants have pitchforks and there's a lot of them.<h3>Plethora of endings.</h3> The multitude of potions and plot twists ensure high replayability. Some recipes, game mechanics and endings become unlocked only when certain conditions are fulfilled (like beating the main story or getting some game-ending events).<br/><h3>A cat.</h3> You have one and you can pet him.<br/>", "metacritic": null, "released": "2023-12-22", "tba": false, "updated": "2023-12-25T03:18:59", "background_image": "https://media.rawg.io/media/screenshots/436/43600961d8613b55c8e69fbf77ea9a13.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Harvey games"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Harvey games"], "esrb_rating": null}