{"id": 974181, "slug": "dungeons-of-dragons", "name": "Dungeons of Dragons", "name_original": "Dungeons of Dragons", "description": "<strong>\"In an age of guns, swords, and magic, the Philosopher's Stone, which maintains the balance of Dungeons and Dragons, has been stolen. The world hangs in the balance. It's all up to you...\"</strong><br/>Honestly, we can't make it all up all the time. Let's have an adventure together! <br/>It is a dungeon adventure game with extremely simple and intuitive controls. Its super smooth and enjoyable gameplay, mixed with roguelike elements, will keep you hooked from the first run! <br/><br/>Features:<br/>*  7+ Unique Heroes – Ancient Swordsman, Sharpshooter, Magician... There's always an option that fits perfectly with your playstyle. * 50+ weapons – guns, swords and wands... Multiple ways to collect weapons from abyssal and normal dungeons!<br/>*  Tons of dungeons – dark forests inhabited by goblins, medieval castles infested with zombies... Raid tons of monster lairs, loot treasure and encounter different NPCs.<br/>*  Multiplayer mode is available! Team up with friends from all over the world for online co-op adventures, or play solo in single-player mode.<br/>*  Various game modes and features. Prefer brains to brawls? Strategize to strengthen your defenses and attacks, defeat the Abyss Lord, and get treasures! <br/>*  A pixel roguelike adventure game with offline options that combine action and survival. Grab a sword and start your dungeon adventure!<br/><br/>【Three Professional Heroes】<br/>Ancient swordsman, sharpshooter, magician. You can create your favorite characters for dungeon exploration without limits, challenge dungeons and abysses, dungeons and warriors in fantasy pixel games.<br/>【Unique Skills】<br/>Sword Qi Fluctuation, Furious Hurricane, Magic Sword Summoning, Rapid Burst, AWM Expansion Bomb, Fire Core Grenade, Magic Bullet Rain, Demon Bat Raid, Great Demon Contract.<br/>【Powerful Monsters &amp; Levels】<br/>A variety of powerful abyss bosses and dungeon bosses are waiting for you to challenge.<br/>【Multiple Ways to Play】<br/>In the normal dungeon exploration mode, you can also consume abyssal magic stones to challenge the abyss mode. Abyss mode has a higher explosion rate than normal mode. You can also collect material cards to trigger dungeon effects, and players can team up with you to play together. You can also stand on the street and set up stalls and chat, and other players can buy your equipment. After each level, there is still a 50% chance to trigger the Little Black Shop.<br/>【Equipment &amp; Pets】<br/>Plain white, blue. Purple Rare Equipment, Pink Superb Equipment. Epic Orange Gear Premium. Magic Sword - Azles, Shadowless Sword, Meteor Fall, Platinum Revolver are waiting for you to hunt for treasure. Equipment and weapons can be enhanced, and after strengthening, not only the attributes will be enhanced, but the appearance will also change. There are also countless pets waiting for you to adopt, enhancing the combat effectiveness of the owner. There are many more skin kit skins for you to choose from.", "metacritic": null, "released": "2023-12-22", "tba": false, "updated": "2023-12-25T03:37:32", "background_image": "https://media.rawg.io/media/screenshots/a51/a51bc17bab0ebcc8314408d99986e451.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Magic Dragon Games"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Magic Dragon Games"], "esrb_rating": null}