{"id": 974158, "slug": "casual-pro-wrestling", "name": "Casual Pro Wrestling", "name_original": "Casual Pro Wrestling", "description": "<h3>Casual Wrestling Gameplay</h3>Get in the ring like it's the year 2000, only today! <strong>Casual Pro Wrestling</strong> puts an emphasis on fun, inspired by the first 3D pro wrestling games from the good old days but with the extra twist of ragdoll physics for increased whiplash!<h3>Features</h3><ul><li>Have a pro wrestling match with 2, 3, 4, or any number of participants that your hardware can handle! Use standing, running or flying attacks and perform wrestling maneuvers to punish your opponents.<br/></li><li>Navigate the squared or six-sided ring using intuitive controls inspired by genre classics, using your gamepad or your keyboard. Learn the controls and play around in the game's tutorial mode.<br/></li><li>Take it outside: use a variety of weapons at ringisde or find something underneath the ring, smash your opponents into the ring stairs or through a table, perform flying attacks off the barricades and take the fight into the crowd.<br/></li><li>Enjoy a unique blend between classic animation and ragdoll physics for guaranteed drama.<br/></li><li>Create your dream match by mixing and matching rules and winning conditions, including pinfall, submission, count-out, disqualification, rope break, first fall to a finish, falls count anywhere, over-the-top elimination and automatic entering in frequent intervals or once somebody is eliminated.<br/></li><li>Select from a diverse and colorful roster of 50 wrestlers.<br/></li><li>Expand the roster by creating any number of custom wrestlers. Shape and color their body, gear them up with individually texturable attires, pick from over 30 entrance themes of different styles and choose their attributes.<br/></li><li>Share your creations on the Steam Workshop and discover creations made by other players.<br/></li><li>Play against AI-controlled wrestlers or watch the AI wrestle a complete match on their own.<br/></li><li>Gather your friends and play couch multiplayer using multiple controllers.<br/></li><li>Play online with your Steam friends via network multiplayer or Steam Remote Play Together.</li></ul>", "metacritic": null, "released": "2023-12-21", "tba": false, "updated": "2023-12-25T03:10:27", "background_image": "https://media.rawg.io/media/screenshots/747/747a50287264807fc6e5ff1660d135fa.jpg", "website": "http://casualprowrestling.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Patrick Dinklage"], "genres": ["Action", "Sports", "Casual", "Indie"], "publishers": ["Patrick Dinklage"], "esrb_rating": null}