{"id": 974184, "slug": "virago-reality-new", "name": "Virago: Reality New", "name_original": "Virago: Reality New", "description": "Virago: Reality New invites you to delve into an immersive narrative that follows the tumultuous journey of Willow, a young girl escaping an abusive home only to find herself entangled in a realm of terror and intrigue. This third-person adventure/horror game offers an intense pursuit experience, blurring the lines between reality and nightmare as you strive to outsmart relentless pursuers.<br/><br/><h3> Storyline</h3><br/>Embark on a haunting odyssey as Willow breaks free from the chains of her troubled past, seeking refuge amidst the enigmatic cityscape. Unforeseen alliances offer fleeting solace, until a sudden abduction compels Willow to ingest a toxic substance. As poison courses through her veins, Willow's reality fractures, plunging her into a surreal realm of hallucination and dread.<br/><h3> Gameplay</h3><br/>Virago: Reality New promises an adrenaline-charged gameplay experience, where you must navigate a perilous world teeming with danger. Equipped only with a torchlight, skillfully maneuver through dimly lit environments, leveraging the flickering light beams to disorient stalkers and unveil concealed pathways. Survival hinges on your resourceful evasion and mastery of stealth tactics.<br/><h3> Features</h3><ul><li>Intense Third-Person Adventure: Immerse yourself in Willow's harrowing journey, racing against relentless stalkers and confronting the horrors born from the depths of her psyche.<br/></li><li> Eerie Atmosphere: Traverse an atmosphere saturated with suspense, seamlessly blurring the boundary between reality and illusion to maintain an unrelenting tension.<br/></li><li>Stealth and Survival: Utilize your surroundings to outsmart tireless pursuers, employing strategic cunning to elude danger at every juncture.<br/></li><li>Torchlight Mechanics: Manipulate the eerie torchlight to your advantage, distorting stalkers' perceptions while illuminating paths toward safety.<br/></li><li>Mind-Bending Hallucinations: Experience Willow's fragmented reality firsthand, grappling with disorienting hallucinations that twist the very fabric of her environment.</li></ul>", "metacritic": null, "released": "2023-12-22", "tba": false, "updated": "2023-12-25T03:41:09", "background_image": "https://media.rawg.io/media/screenshots/5df/5dfd38d99b207cbcbb93a8f620d8392e.jpg", "website": "https://honestchronicle.carrd.co", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Honest Chronicle"], "genres": ["Adventure"], "publishers": ["Honest Chronicle"], "esrb_rating": null}