{"id": 974198, "slug": "artillery-blast", "name": "Artillery Blast", "name_original": "Artillery Blast", "description": "Come and cum! The young ladies feel so uncomfortable, they are trapped inside and can hardly breathe.<br/>\n<br/>\r\nGame introduction:<br/>\r\n\tThis is a casual shooting game. Players will master a powerful gun and shoot various colorful balloons that appear in front of them by moving the gun horizontally. The goal of the game is to pop all the balloons and unlock exquisite CG images.<br/>\n<br/>\r\nGameplay:<br/>\n<br/>\r\n\tOperation method: Players can adjust the shooting angle by sliding the bottom of the screen to move the position of the gun left or right.<br/>\n<br/>\r\n\tShooting mechanism: The gun automatically fires unlimited bullets, and players do not need to shoot manually. The bullets move at a moderate speed, requiring clever movement of the gun to hit the fluttering balloons.<br/>\n<br/>\r\n\tTypes of balloons: Balloons of different colors represent different scores. Players need to prioritize targets according to the color of the balloons. Some special balloons may have additional effects, such as acceleration, deceleration, etc.<br/>\n<br/>\r\n\tLevel design: The game is divided into multiple levels. The number and movement trajectories of balloons in each level will be different, increasing the difficulty and challenge of the game.<br/>\n<br/>\r\n\tgame props:<br/>\n<br/>\r\n\t\tBullets become faster: The speed of bullets is greatly increased, making it easier to hit fast-moving balloons.<br/>\r\n\t\tStronger attack power: Increase the attack power of guns, making each bullet more destructive.<br/>\r\n\t\tFreeze Everything: Temporarily freeze the movement of all balloons, giving players time to shoot accurately.<br/>\r\n\t\tRestore HP: Restore a certain amount of HP to stay in the game longer.<br/>\r\n\t\tIncreased movement speed: The movement speed of the gun is increased, making it more flexible to avoid balloon attacks.<br/>\n<br/>\r\n\tClearance reward: For every level successfully passed, the player will unlock a beautiful CG picture to reward their efforts and skill improvement.", "metacritic": null, "released": "2023-12-23", "tba": false, "updated": "2023-12-25T04:05:07", "background_image": "https://media.rawg.io/media/screenshots/04e/04e7149a8368fad663bd5e6c2f5a4c5c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AB GAMES"], "genres": ["Adventure", "Strategy", "Casual"], "publishers": ["AB Games"], "esrb_rating": null}