{"id": 974268, "slug": "neuro-hacker-intrusion", "name": "Neuro Hacker: Intrusion", "name_original": "Neuro Hacker: Intrusion", "description": "<h3>-Introduction-</h3>Brain Hackers is a deduction and puzzle VR game. You take on the role of a “brain hacker” detective who is skilled at hacking into the human brain to solve complex crimes. You are about to hack into an airship crash survivor's brain and probe into his memories in order to uncover the horrible truth behind the incident.<h3>-About this game-</h3>–– Hello, detective. I'm your assistant Kate.<br/>To solve the case, we need you to hack into the brain of an airship crash survivor, and we will help you recreate his memories from one hour before the crash. You will act as the survivor himself, wandering through his memories. Within this hour, you must use all of your detective skills and think of every possible way to access every corner of his memories. You may listen in on discussions you believe are important, look for clues, and search for information related to suspicious persons in order to uncover the truth in a timely manner.<br/>Attention! Once the owner of the brain becomes aware of your presence, he will not only place numerous traps in his mind to stop you, but he will also create horrible illusions that trap you, and launch mind attacks to force you out of his head. It's rare for a beginner like you to last more than 10 minutes. If you feel you can't keep on, don't be a hero and notify me right away; I will cut the connection at any time and pull your consciousness out of his brain...This is entirely for your safety.<br/>Solving this case is both a commission from the Club and a rigorous test. The Club will award you with different levels of detective badges based on your performance. The highest honor is the exceedingly rare Star Detective badge, which can serve as your qualification to join the club. But, according to my research, no beginner detective has ever received this badge; will you be the lucky one?<br/>If you accept the challenge, please sign the commission agreement, and your mission will begin.<br/><h3>-How to play-</h3>Enjoying a feast of deduction in a crisis-ridden mind space<br/><br/>- An immersive crime investigation experience: We offer you a 360-degree immersive experience in an open crime scene, with dead bodies right at your feet! You may search for evidence at your will, perform hands-on autopsies, and make deductions according to the clues. You are not just playing a game; you are witnessing a bizarre murder that is part of a century-long conspiracy.<br/><br/><br/>- Hacking into the memory maze: You are trapped in the victim's brain. Each fragment of his memories represents a separate chamber full of secrets. You must be a detective as well as an escape master, as getting out of the maze is also the only way to discover the truth about the crimes.<br/><br/>- Dual cases and dual identities: You will solve the puzzles while getting to know the whole picture of the story. The clues not only lie in the physical evidence, but also in your interactions with NPCs. Pay attention to every word they say to you. Who is lying?!<br/><br/><br/>- Submitting case reports: Submitting case reports to the Club is a difficult task that many investigators have failed at. It's now your chance to face the challenge! At each stage, you shall organize clues for the case and give your own reasoning. Are you a novice or a seasoned detective? Your performance will determine which detective badge you receive!<br/><h3>-Game features-</h3>- Cinematic audio-visual enjoyment<br/>You can have immersive audio-visual enjoyment, as the game contains movie-quality dubbing and performance, as well as a mysterious and unpredictable atmosphere, with monsters coming right at you. You will be like a main character in a movie!<br/>- An exclusive suspenseful puzzle-solving experience<br/>The puzzle solving process is enjoyable and interactive: extracting fingerprints from corpses, decoding gesture codes, dripping blood to unlock seals, learning about secret techniques of the Eight Diagrams, finding clues in ancient paintings...You will not want to stop the game!<br/>- A mind-bending story with several plot twists<br/>The case is bizarre and what happened in the past is a mystery. Each suspect has a secret, and the plot is full of surprises. While investigating the case, you are also drawn into a carefully planned conspiracy...<br/>- High-caliber producer<br/>The game’s producer is also the director of a spin-off of China's most popular detective variety show, delivering you a suspenseful, thrilling VR investigation experience.<h3>-Adult content description-</h3>The content in this game may not be suitable for all age groups or for access during work hours: frequent violence or bloodshed, common adult content.", "metacritic": null, "released": "2023-12-24", "tba": false, "updated": "2023-12-29T05:54:05", "background_image": "https://media.rawg.io/media/screenshots/fbb/fbbbf05694b44899e63d7dbaf955a582.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nice Game"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Nice Game"], "esrb_rating": null}