{"id": 974243, "slug": "a-difficult-game-about-climbing", "name": "A Difficult Game About Climbing", "name_original": "A Difficult Game About Climbing", "description": "<p>Use only your mouse to control your climber&#39;s hands to pull yourself up an enormous, treacherous mountain full of challenges and surprises. Watch out for slippery surfaces as you make your way towards the peak. Eternal glory and a wonderful gift awaits all climbers who manage to reach the top!</p>\n<p>Mouse only: You need a mouse to play this game. Left and Right mouse buttons are used to grab with each respective hand. (Therefore, a trackpad will not work well at all).</p>\n<p>Enjoy:<br />\nPunishing but not impossible gameplay. Practice makes perfect.<br />\nNo filler, every obstacle is designed with intention.<br />\nFocused gameplay with no distracting elements.<br />\nNo violence. You can never die or get hurt. But you can lose all your progress with one mistake... perhaps that is worse.<br />\nClimb, slip, fall. Over and over.<br />\nEndless suffering.</p>\n<p>But not:<br />\n- Legs... You cannot use your legs for some reason.</p>\n<p>Note from developer:<br />\nThis game was created by one person, me (hello). This game is inspired by Getting Over it with Bennett Foddy which in itself is a homage to an even older game, Sexy Hiking by Jazzuo. I was certain that Bennett&#39;s game would spawn countless of new types of games in a similar fashion that would present unique, focused and yet simple challenges. I was disappointed to see that trend not materialize fully and so took it upon myself to make this game, hoping to contribute to the spirit of a &quot;Foddian Type&quot; game genre.</p>", "metacritic": null, "released": "2024-03-06", "tba": false, "updated": "2024-04-14T14:08:07", "background_image": "https://media.rawg.io/media/screenshots/15e/15ea93133d15f75e3a73637b720b09c1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 4, "toplay": 9, "dropped": 3, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Pontypants"], "genres": ["Action", "Indie"], "publishers": ["Pontypants"], "esrb_rating": null}