{"id": 974282, "slug": "phantom-unit-999", "name": "phantom unit 999", "name_original": "phantom unit 999", "description": "<h3>Welcome to the World of Phantoms Unit 999</h3>You are about to dive into the depths of a new mission called Storm Phantoms<br/>The unit's monitoring team noticed something strange that had begun to happen in the previous days<br/>Some places in the world have come to life and we do not know why<br/>The goal of the mission is to find the reason why life began in other creatures and eliminate this reason. Are you ready to undertake this mission? It is a <br/>mission for the brave only.<br/><h3>important Instructions</h3>Each level consists of two stages. Each stage consists of a group of guards who protect the road leading to the Boss <br/>You have to eliminate them all, and then you can kill the Boss. If you kill the Boss on the first try, you will get three stars. If you kill him on the second try, you will get two stars, and if you kill him on the third try, you will get only one star.<br/><br/>The map consists of more than ten worlds, more than 20 stages, and more than 20 bosses, in addition to the final battle<br/>And many, many enemies too<br/>- Soldiers who betrayed humans<br/>- Mushroom<br/>- Transformed trees<br/>- Mice<br/>- Mutant pirates<br/>- Snowmen<br/>- Snow monsters<br/>- Zombie<br/>- Squash<br/>- Pumpkin man<br/>- The Minotaur<br/>- Dogman<br/>- Little monsters<br/>- Rotary bombs<br/>- Flying bombs<br/>- Defender<br/>- Soldiers' cars<br/>- Bats<br/>- Snowballs<br/>And so much more awaits you", "metacritic": null, "released": "2023-12-25", "tba": false, "updated": "2023-12-29T06:10:44", "background_image": "https://media.rawg.io/media/screenshots/a21/a21843a50940697073db1a26e9d5584f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 288, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fadi Beshai"], "genres": ["Action", "Indie"], "publishers": ["kemet Games"], "esrb_rating": null}