{"id": 974261, "slug": "vr-dinosaur-island-paradise", "name": "VR Dinosaur Island Paradise", "name_original": "VR Dinosaur Island Paradise", "description": "This is an immersive VR casual game. Players will experience the fun of driving cars freely in the virgin forest. In the game, you will be in a vibrant dinosaur paradise and enjoy the beauty of nature.<br/><br/> <br/> <br/>As a player, you will drive a car in this mysterious and vast forest. Along the way, you will encounter a variety of animals, from the mighty rhinos to dexterous goats, and even cute polar bears. Their existence and activities will bring vitality and vitality to the entire forest. When you drive leisurely, the animals may be curious about you, or you may also make a charming cry, as if saying hello to you. In addition to some common animals, you can also find some dinosaurs hidden in the forest. They have ruled this land and left a rich footprint.<br/>The forest itself is also a beautiful scroll, full of amazing natural landscapes. You can stop to enjoy the magnificence of the forest and enjoy the gifts of nature.<br/>This game's realistic visual effects and stereo sound effects will bring you an immersive experience, as if in a real forest. Whether it is driving, watching animals, or immersing in the beauty of nature, this game will bring you a pleasant, relaxing and exploring experience. Come and start your forest adventure!<br/> <br/><br/><br/>Operation method:<br/>Throttle    Right-handle trigger<br/>Steer       Left-handle left/right<br/>Menu      Left-handle trigger", "metacritic": null, "released": "2023-12-24", "tba": false, "updated": "2023-12-29T05:44:11", "background_image": "https://media.rawg.io/media/screenshots/826/826a99ad2829f1529f5bcf8361be4548.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dinosaur workshop"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Casual"], "publishers": ["Dinosaur workshop"], "esrb_rating": null}