{"id": 974215, "slug": "japanese-drift-master-demo", "name": "Japanese Drift Master Demo", "name_original": "Japanese Drift Master Demo", "description": "\n<br/>\nExperience the automotive culture of Japan and discover the roads where drift was born.\n<br/>\n<br/>\n<br/>\n<ul><li>Open world with miles of content</li></ul>Get into the atmosphere of small towns in Japan with traffic, dynamic day and night cycles, and weather system. Kilometers of different roads inspired by real and well-known locations await you - explore the touristy areas of Lake Haikama, test your skills on the downhill slopes of mountain passes, or fly sideways through a heavily urbanized part of the city.\n<br/>\n<br/>\n<br/>\n<ul><li>Customize your car</li></ul>The world of JDM would not be complete without a paint shop, where you can personalize your car in a truly Japanese style. Visit the tuner shop to uncover the hidden potential of the cars you got through a car dealer.\n<br/>\n<br/>\n<br/>\n<ul><li>Drifting has never been so satisfying</li></ul>No matter what your favorite steering device is - gamepad, steering wheel, or keyboard - the realistic driving physics will provide nothing but pure pleasure.\n<br/>\n<br/>\n<br/>\n<ul><li>Get to know the story</li></ul>Play through a story about a foreigner who wants to make a name for himself on the Japanese drifting scene. Slide right into the world of speed and precision, where you'll earn respect by competing for the title of best hashiriya behind the wheel.\n<br/>\n<br/>\n<br/>\n<ul><li>Feel the whirr of the engine</li></ul>Original recordings of real car sounds, implemented thanks to our unique technology. With their help, you will feel like behind the wheel of a real car.", "metacritic": null, "released": null, "tba": false, "updated": "2023-12-25T04:28:44", "background_image": "https://media.rawg.io/media/screenshots/767/7679118ddf48e439e640006f62c6cec7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gaming Factory"], "genres": [], "publishers": ["Gaming Factory"], "esrb_rating": null}