{"id": 974344, "slug": "foreign-fortress", "name": "Foreign Fortress", "name_original": "Foreign Fortress", "description": "Greg, decorated American military veteran, was tasked by the United States military to solve the alien epidemic because of his brave actions in the last World War on earth.<br/>\r\nHe has been in a coma in a forgotten hospital trapped by a foreign non-terrestrial being for decades. Dreams of his past life and family has awakened him.<br/>\r\nGreg awakes from his coma and realizes he's not the only one in the dark, lifeless, and forgotten building and that he must vanish the alien. He remembers he had a gun on him before the alien captured him.<br/>\r\nFind and use your weapon and/or radar and hide behind walls, under tables, and closed doors to escape the alien. Be careful when you explore the hospital as the alien can hear you walk when you least expect it.<br/>\r\nGreg is confident he can use his gun and/or stealth tactics to escape the alien, gather items that can be used to expel alien life on earth, and return to his glory and family and live life like before his coma and the last World War that happened.<br/>\r\nThere is a radar and/or a gun that you can use to complete your mission and track the alien's location and make sure he is out of your way and also a lighter to light your way in dark areas in the abandoned hospital because the lights have gotten dimmer each year you have been asleep, will Greg persevere and have some normality after being asleep in this foreign fortress for decades?", "metacritic": null, "released": "2023-12-28", "tba": false, "updated": "2023-12-29T07:32:28", "background_image": "https://media.rawg.io/media/screenshots/3eb/3eb7e990fed34e6c3ef4cd9d71dca618.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FrisbyStudio"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["FrisbyStudio"], "esrb_rating": null}