{"id": 974340, "slug": "do-you-like-having-sex-with-your-colleague-ill-str", "name": "Do you like having sex with your colleague? I'll strip her down and make her a porn star!", "name_original": "Do you like having sex with your colleague? I'll strip her down and make her a porn star!", "description": "<h3>《Story》</h3>Now you can be a porn director too! No experience necessary!<br/><br/>\"I probably won't get accepted anyway, but it's better than doing nothing.\"<br/><br/>That's what Ichiro Tsukuba, a young man struggling to find a job, thought when he applied.<br/>But for some reason, he was offered an adult video director position.<br/><br/>On his first day of work, he meets aspiring porn star Kokona Amai, a new employee who was hired at the same time as him. An encounter that would change both of their lives completely.<br/><br/>\"Hehe, you don't have to be so stiff around me. We're the same seniority level, right?\"<h3>《Characters》</h3><br/><strong>Kokona Amai (VA: Hina Shinomiya)</strong><br/>An aspiring porn star who just got hired at a large adult video production company.<br/>Cheerful and always enthusiastic during sex.<br/>She does her best to support Ichiro Tsukuba because of his lack of self-confidence.<br/>Her goal is to help her debt-saddled parents and pay for her younger brother's schooling.<br/><br/><strong>Ichiro Tsukuba</strong><br/>The main character.<br/>While he originally had no goals or dreams he was pursuing, he ended up on the path to becoming a porn director.<br/>He initially lacked interest and confidence, but upon meeting Kokona, he was inspired and started seriously pursuing it as a career.<h3>《Contents》</h3><ul><li>15 separate CGs (Over 70 CGs in total!)</li></ul><ul><li>13 Sex scenes</li></ul><ul><li>Japanese voice acting for the main female character</li></ul><h3>《Features》</h3><ul><li>You can have the same experience as the protagonist.</li></ul><ul><li>Two endings</li></ul><ul><li>CG Gallery Mode</li></ul><ul><li>Scene Replay Mode</li></ul><br/>*Before purchasing this product, we highly recommend playing the demo [Japanese only] to check if the game works properly on your computer in your region.<br/>*Appetite is the licensor of this game. For inquiries about the product, please get in touch with Tensei Games.", "metacritic": null, "released": "2023-12-28", "tba": false, "updated": "2023-12-29T07:25:37", "background_image": "https://media.rawg.io/media/screenshots/160/1600334b40d874b41cecdefd434c2f61.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 333, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Appetite"], "genres": ["Adventure"], "publishers": ["Tensei Games"], "esrb_rating": null}