{"id": 974346, "slug": "hypersomnia", "name": "Hypersomnia", "name_original": "Hypersomnia", "description": "Hypersomnia is a hardcore arena mixing eSports with pixely nostalgia. <br/>Every match will be unforgiving - every duel a psychological battle. <br/><br/>More of a peaceful soul? <br/>Unleash your creativity in the <strong>WYSIWYG in-game map Editor</strong> that lets you instantly playtest your maps online.<br/><br/>It's all free and open-source. <br/>Written without a game engine, in bare C++. Only 50 MB. <br/>Feel free to build it yourself from GitHub and modify Hypersomnia to your heart's content.<br/><br/><br/><br/>Features:<br/><br/><ul><li> 24 unique firearms.<br/></li><li> 2 game modes: Bomb defusal (team-based) and Gun game (free-for all).<br/></li><li> 6 magic spells, 4 grenade types and 7 melee weapons.<br/></li><li> An <strong>in-game map editor</strong> that lets you host a <strong>work-in-progress map</strong> to test with your friends in a single click. Quickly iterate your map unlike in any game engine.</li></ul><br/>Declare allegiance to one of the three factions whose apple of discord is a disparity between prevailing notions of moral excellence:<br/><br/><strong>Metropolis. Atlantis. Resistance.</strong><br/><br/>Will you take revenge for the unethical simulation of an inferior universe? Will you support the cruel experiments to win total control over metempsychosis? Or will you join the underground civilization that awaits the end of war in this dangerous afterlife reality?", "metacritic": null, "released": null, "tba": false, "updated": "2023-12-29T07:34:50", "background_image": "https://media.rawg.io/media/screenshots/323/323972ab8e1c801b199da48bf4e2737e.jpg", "website": "https://github.com/TeamHypersomnia/Hypersomnia#intro", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 266, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Patryk Czachurski"], "genres": ["Action", "Indie"], "publishers": ["TeamHypersomnia"], "esrb_rating": null}