{"id": 974334, "slug": "fritz-19-se", "name": "Fritz 19 SE", "name_original": "Fritz 19 SE", "description": "Attacker, coward, swindler or endgame wizard: I'll show you how to win against anyone! After my World Championship victories in 2022 and 2023, I am the reigning Chess Software World Champion and am now looking forward to showing you how to become even stronger against your opponent With my innovative training method, I simulate typical player personalities you know from tournaments and online chess: brash attackers, cautious cowards, passive players. But how do you win against them? Fritz will show you how! And for beautiful attacks, combinations or sacrifices, there are the new ChessBase cards as a reward for you. Practical training that's also a lot of fun. Or let's train openings: you can try out a new repertoire ideas directly in a match against me. And how about the new calculation training for a quick Elo boost? As Fritz19 I can make you play better again.<br/><br/>Fritz 18 marked the beginning of a new era, and Fritz 19 drives this development onward: a game against Fritz should be more than just a game - it should be an experience. In a time when online chess dominates, a chess program has to offer something special to be a real alternative to human opponents.<h3>In Fritz 19 it works like this</h3><ul><li>There are six different characters that mimic typical club players: Allrounder, Aggressive, Positional, Swindler, Fearful, Endgame Expert.</li></ul><ul><li>Fritz plays human moves that fit these types, but builds-in tactical mistakes so that you can win with a sacricial attack, for example. The sharper the position, the more likely the program will misstep.</li></ul><ul><li>There is a wide range of tips and support that you can use to the full, or ignore, depending on your mood. With all the tips, you will practically always win against the “strong club player” level. If you ignore them completely, it becomes challenging for a player like me (ELO 2000).</li></ul> <ul><li>At any time during the game, you can switch to “assisted calculation” mode. Where is no clock, so you can train your calculation without stress in positions you have played yourself. This has an enormous training benefit.</li></ul><h3>The opponent zoo</h3>The character Allrounder is probably the strongest opponent for every level of play. It is a development of “Easy Game” from Fritz 18. Everyone knows the Aggressive Player from their club. They regularly play on the attack, with a sharp opening repertoire. They are the ideal opponent for defence training with Black. The Swindler takes aggressiveness to the extreme, and o!en overplays the position. Material and solid position are of no interest, the main thing is to go for the king. Against this swindling fox, one usually has a material advantage, but suddenly it becomes highly dangerous. The wise owl symbolises the Positional Player. It loves a good pawn structure, a secure king of its own and coordinated piece-play. The distorted echo of this, is the fearful mouse. It appreciates crowded, safe positions and is afraid of complications. That is why it often plays weaker. The Endgame Fan, on the other hand, plays specifically for exchange. Simplification is paramount, the opening is o!en unambitious. When it comes to the endgame, on the other hand, things get really tough. An effective training opponent for this phase of the game!<h3>New opening training</h3>We all manage our opening repertoire in variation trees, stored in databases. If you want to play against it, it gets technical: opening books have to be converted. On today’s powerful computers, this has become obsolete. In Fritz 19, you play directly against databases, your own repertoire, or an opening article from the ChessBase Magazine!<br/><br/>If the White player, the Black player, the tournament title, or the source begins with “White” or “Black”, then all the moves in this game belong to this colour. Fritz will then only play these moves. A repertoire is always rather narrow from the point of view of one’s own colour and broad for the opponent’s moves. Try it out: Your Najdorf repertoire with Black against the “aggressive” player! Tip for ChessBase users: Save a generated opening survey from ChessBase and play against it immediately<br/><h3>What else is available</h3>The new engine in Fritz 19 is the Computer Chess World Champion for 2023. The Calculation Training has been extended, especially in the important preliminary query of candidate moves. The Buddy Engine and the annotated engine analysis from ChessBase 17 have found their way into Fritz. The notation (and the whole program interface) has been enormously enhanced in places. Tactical Analysis, the important full commentary of your games, has been improved and much more!<br/>", "metacritic": null, "released": "2023-12-28", "tba": false, "updated": "2023-12-29T07:14:48", "background_image": "https://media.rawg.io/media/screenshots/4b5/4b5b3d1f6d16ede595b267343238c580.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ChessBase"], "genres": ["Strategy"], "publishers": ["Chessbase"], "esrb_rating": null}