{"id": 974405, "slug": "barely-racing", "name": "Barely Racing", "name_original": "Barely Racing", "description": "Barely Racing is an isometric view racing game, inspired strongly by Death Rally and other old-school racing games. However, we spiced it up a bit with online play and weapon choice. <br/><br/><strong>FEATURES</strong><br/><ul><li>7 cars, with color customization.<br/></li><li>9 tracks, with reverse variant, across 3 biomes.<br/></li><li>Machine guns, rockets, and mines are your weapon of choice.<br/></li><li>Game is primarily made to be played in split screen, but there is a story mode too.<br/></li><li>Online multiplayer is supported, but it is peer to peer, which means your online match quality highly depends on the person who created the server.<br/></li><li>Single player story where you race to win the cups?</li></ul><br/><br/><br/><strong>LOCAL AND ONLINE MULTIPLAYER</strong><br/>This game is meant to be played with your friends. Don't hesitate to challenge them. It is not a surprise that games like these are best enjoyed in multiplayer.<br/><br/><strong>MULTIPLAYER MODES</strong><br/><ul><li>Race - just a regular race like any other. Addition of mines, rockets and machine guns, might change that experience a bit.<br/></li><li>Mine Tag - good old tag game, but this time you carry a mine that has a timeout. Better hurry up to touch (tag) someone before it explodes. <br/></li><li>Flag Chase - take the flag and hold it as much as possible. <br/></li><li>Football - soccer + cars. <br/></li><li>Deathmatch - wreckfest, just destroy every car you see</li></ul><br/><strong>HOW TO WIN A RACE?</strong><br/>Well, you need to be the first one to cross the finish line. If you have anyone in front of you, use dem rockets and machine gun. If you have someone behind, just drop a mine, they'll do the rest.<br/><br/><br/><br/><strong>DRIFTY DRIVING MODEL</strong><br/>We don't drive trams here, so expect some drift. It's post apocalypse anyways. No new tires have been produced.<br/><br/><br/><br/><strong>THAT IS ALL YOU NEED TO KNOW. POUR THE GASOLINE AND START RAMMING!</strong><br/><br/>", "metacritic": null, "released": "2023-12-28", "tba": false, "updated": "2024-01-15T05:53:03", "background_image": "https://media.rawg.io/media/screenshots/882/88204b6cdf2472d99732dd0b683f698c.jpg", "website": "https://www.fragile-software.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 512, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fragile Software"], "genres": ["Action", "Racing", "Casual"], "publishers": ["Fragile Software"], "esrb_rating": null}