{"id": 974537, "slug": "the-fairway-club", "name": "The Fairway Club", "name_original": "The Fairway Club", "description": "Grab your clubs and get to The Fairway Club now! We offer a relaxing golfing experience for any type of golfer. Hit one of our courses, located all around the world, in the morning, evening or night! You can take your boat to Forest Islands for a secluded and quiet round of golf, or why not travel into the mountains over at Western Peaks to play surrounded by nature as far as your eyes can see? Not your cup of tea? How about the pink fields of Blossom Meadow, where the giant blossom willow trees keep you relaxed throughout your game!<br/><br/><br/><br/>Explore the courses and play at your own pace! We offer each player state of the art carts to travel around with, or if that's not your cup of 'tee' then you can have a walk around instead.<br/><br/><br/><br/>We offer unlimited access to the courses and also access to the TFC tournament, a regular golf competition held at our courses where you can win money &amp; level up your player! You can earn fans and take your game to the next level with your new sponsored gear!<br/><br/>Fancy some practice before that? Try out our state of the art driving range with global leader boards and regular competitions to see who the best fairway club member is! Rack up points through our timed mode and earn prizes (or just beat your friends!). If this isn't for you, how about the endless mode where you can chill out, get to know your clubs and hit targets for as long as you desire.<br/><br/><br/><br/>You can also hit the putting greens to get used to reading the greens and avoiding any 3 puts when it matters!<br/><br/><br/><br/>Customise your character to put yourself in the game! On top of the sponsored items you can unlock new clubs and balls with the money you earn throughout these various game modes (or even as prizes for finishing at the top!). Progress your career, earn more fans and become the best!<br/><br/><br/><br/>But most of all, come to the Fairway Club and relax, as the one thing we can promise is a truly relaxing experience!", "metacritic": null, "released": "2024-01-01", "tba": false, "updated": "2024-01-05T04:18:27", "background_image": "https://media.rawg.io/media/screenshots/d69/d69db6508504436ac039f53d984d6571.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Liquid Beaver Studios"], "genres": ["Adventure", "Sports", "Casual", "Indie"], "publishers": ["Liquid Beaver Studios"], "esrb_rating": null}