{"id": 9745, "slug": "train-sim-world-csx-heavy-haul", "name": "Train Sim World: CSX Heavy Haul", "name_original": "Train Sim World: CSX Heavy Haul", "description": "Train Sim World®: CSX Heavy Haul is an all-new First Person Simulator that brings to life the experience of operating powerful and heavy freight trains on one of America’s most stunning and famous railroads; Sand Patch Grade. <br/><br/><br/><br/>Powered by Dovetail Games’ new SimuGraph® vehicle dynamics engine and Unreal Engine 4® technology, Train Sim World uses real-world data to accurately replicate the performance, sounds and feel of real trains.<br/><br/>Featuring complete in-cab interactivity, take control of one of the three featured locos and feel the detail as you sit in the driver’s seat and bring some of the world’s biggest and most powerful trains roaring to life.<br/><br/><br/><br/>You’ve been invited to work for CSX Transportation as a railroad engineer delivering important cargo on tight schedules.  With six challenging scenarios and many places to explore including Rockwood Mine, Sand Patch Summit and Cumberland Yard, your skill, focus and endurance will be tested to the limit.<br/><br/>Experience a full ‘day-in-the-life’, with the brand new Service Mode, which features the recreation of a 24-hour timetable based on real-world operations. Hop on and off a range of services as they carry out their duties.  Take control or ride along, the choice is yours.<br/><br/><br/><br/>Train Sim World caters to players of all ability levels, featuring seven guided tutorials that cover everything from getting started with the software for newcomers to operating the locomotives for more advanced players. Climb into the cab and learn to operate the three very different locos step-by-step, quickly moving from novice to expert.<br/><br/>Live out your rail fan dreams exploring the highly detailed and immersive environment and finding the best vantage point from which to capture those once-in-a-lifetime shots.", "metacritic": null, "released": "2017-03-16", "tba": false, "updated": "2023-04-10T15:38:16", "background_image": "https://media.rawg.io/media/screenshots/782/7826aea2a63a470e1c4d488eb142dbc5.jpg", "website": "http://trainsimworld.com", "rating": 3.86, "rating_top": 4, "added_by_status": {"yet": 7, "owned": 97, "beaten": 3, "toplay": 3, "dropped": 5, "playing": 5}, "playtime": 7, "achievements_count": 222, "ratings_count": 14, "suggestions_count": 422, "game_series_count": 0, "reviews_count": 14, "platforms": ["PC"], "developers": ["Dovetail Games"], "genres": ["Simulation"], "publishers": ["Dovetail Games"], "esrb_rating": null}