{"id": 974513, "slug": "candyventure-rebaked", "name": "CandyVenture: Rebaked", "name_original": "CandyVenture: Rebaked", "description": "<strong>The good old CandyVenture is finally back on Steam</strong>! We have carefully re-baked the whole game, taking care of its old values, but in a modern guise! Unlocked framerate, controller support, improved level design, new effects and much more!<br/><br/><strong>The story:</strong><br/>Candyland was a peaceful place on earth, a place where all the candy is made. The inhabitants of the village are hard workers, they've dedicated their lives to make candy. But there's someone in space who wants to start his own candy business. His name is CHUYGOK382XZ, but everyone calls him Micron. He lives on the Moon, he built his own factory, but... Their only raw material is cheese! (Because everyone knows, the Moon is made from cheese). Sadly, no one bought his cheese-candies. One night he came up with an evil plan. He will invade CandyLand with his army and takes all the candy with himself to the Moon! At night he sent his army to the Earth... CandyLand is in a big trouble now.<br/><br/>And this, where the story begins...<br/><br/>Bogyi and his friends count on you! Stole the candies back from Micron and save CandyLand!<br/><br/><strong>Game features:</strong><br/><ul><li>4 playable characters!<br/></li><li>16 levels and exciting boss fights!<br/></li><li>Perk system!<br/></li><li>Cozy 2D retro graphics and sound!</li></ul>", "metacritic": null, "released": "2023-12-31", "tba": false, "updated": "2024-01-05T03:50:03", "background_image": "https://media.rawg.io/media/screenshots/f4d/f4d5512801de8af427a49ad5d40c2fa8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BirdSentinel"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["BirdSentinel"], "esrb_rating": null}