{"id": 974549, "slug": "pacific-minesweeper", "name": "Pacific Minesweeper", "name_original": "Pacific Minesweeper", "description": "<h3>Overview:</h3><ul><li> Advanced physics engine for an arcade style gameplay<br/></li><li> High-resolution graphics with 8K monitor support<br/></li><li> Suitable for all ages<br/></li><li> Immersive sound effects enhancing underwater experience<br/></li><li> Multilanguage interface for global accessibility<br/></li><li> No time limits for stress-free strategic play<br/></li><li> Dynamic score system based on skill and strategy<br/></li><li> Progressive difficulty with fewer shots at higher levels<br/></li><li> Engaging warning system for heightened tension<br/></li><li> Optional: Internet connection required only for leaderboards and achievements</li></ul><h3>INTRODUCTION</h3><br/>Dive into the Pacific's depths in a submersible, navigating through different areas to defuse mines and score points.<h3>GAMEPLAY OVERVIEW</h3><br/>Your mission is to remove six mines, numbered from 1 to 6, from the seafloor using a remotely guided submersible drone. Select using the cross cursor and direct your drone with pinpoint accuracy. But beware, each move is a test of skill and judgment – one wrong shot and you risk a catastrophic underwater explosion.<h3>SCORE AND CHALLENGE</h3><br/>Score points by successfully removing mines, with each mine's score value calculated using a dynamic formula. The stakes rise with each level, demanding greater precision and strategic foresight.<h3>URGENCY AND TENSION</h3><br/>Keep an eye on the shot counter! If it reaches zero, you'll face the consequences of an unremoved mine: an underwater detonation and you lose a life. A warning bleep adds to the tension, signaling your last chance to act. As you advance, the game intensifies, offering fewer shots and increasing the challenge.<h3>RISK AND PENALTY</h3><br/>Mistakes carry a heavy price. Failing to strike a mine or accidentally removing your aiming drone results in the loss of one of your four lives. Each firing decision will be the difference between victory and defeat.<h3>GET STARTED</h3><br/>Ready to embark on this underwater mission and become the ultimate mine hunter ? Simply hit the start button in the main menu.", "metacritic": null, "released": "2024-01-02", "tba": false, "updated": "2024-01-05T04:32:25", "background_image": "https://media.rawg.io/media/screenshots/d19/d19b034a2fcb11b78a28bce2d57c8c17.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Andrei Zanoaga"], "genres": ["Strategy", "Simulation", "Sports", "Casual"], "publishers": ["Andrei Zanoaga"], "esrb_rating": null}