{"id": 97477, "slug": "phase-edge", "name": "Phase Edge", "name_original": "Phase Edge", "description": "<p>Your planet has been consumed… its hollow shell infested by swarms of inter-dimensional mutants. <em>Phase Edge</em> - the only weapon capable of defeating them - is the final hope for your decimated world. Whilst the power of the mutant swarm seems virtually insurmountable, <em>Phase Edge</em> can feed on this power and turn it against them.</p>Features<ul><li>Atmospheric and retro-futuristic pixel art</li><li>Bullet deflection mechanics allows for more aggressive and reckless play styles</li><li>Modular primary + secondary weapon system results in 12 distinct gun types</li><li>More than 70+ unlockable levels</li><li>Euphoric destruction and delicious pandemonium</li></ul>Why Preorder?<p>With <em>Phase Edge</em> we made sure to give you a good slice of the game before we'd think about asking you for money. You can decide for yourself if you want to support us.</p>What do I get for preordering?<ul><li>A Discount</li><li>A Steam Key</li><li>Access to the game before it officially launches</li><li>A warm fuzzy feeling for helping us finish the game</li></ul>What will you do with the money?<p>Make the launch better. While the team is cool, we're also tiny. There are certain things that we just can't do –like translating the game– without paying for it to be done. Pre-orders are going to make the game as cool as possible when it launches.</p>Why not Early Access<p>Early Access is more for games that see a stream of updates and changes. While we're working hard at tweaking things in the game to get it feeling just right we aren't creating large caches of new content that would make being part of Early Access feel good for people who got the game.</p>", "metacritic": null, "released": "2016-03-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1c7/1c7147d00fd94045625f55dd55984188.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Punk Arcade"], "genres": ["Action"], "publishers": [], "esrb_rating": null}