{"id": 974850, "slug": "xue-jing-gong-yuan", "name": "雪境公园", "name_original": "雪境公园", "description": "\"雪境公园\" is a highly customizable turn-based card battle game that enhances the traditional card game format. Players can control their own designed followers to defeat opponents in the enchanting world of \"Snowscape.\"<br/><br/><br/><br/><br/><br/><br/><br/>Personalized Character Design: Create unique characters by utilizing diverse skills.<br/>Diverse Character Collection: Collect various leaders and followers to create your exclusive team.<br/>Strategic System: You have the freedom to customize rules such as cost, health, and leader abilities.<br/>Adventure for Resources: Venture into the Snowscape to obtain precious resources and aid the growth of the asylum.<br/>Exciting Battle Experience: Challenge others with your customized team and strive for victory. With high customization, no two battles are the same.<br/>Daily Tasks and Challenges: Engage in a variety of daily tasks and challenges to ensure long-lasting enjoyment and constant freshness.<br/>Random Relics and Events: Discover mysterious relics and encounter rich events within randomized encounters, providing surprises in every game.<br/><br/><br/>The story combines elements of new folklore and the historical backdrop of the early 20th century, intertwining peculiar historical events with supernatural themes. Set in a closed and snowy environment, the game focuses on deep storytelling and intricate details, aiming to create a genuine psychological supernatural atmosphere.<br/><br/><br/><br/>The unique aspect of the game lies in the refinement of CCG gameplay. Instead of creating a purely CCG game, we extract the captivating elements of CCG gameplay and combine them with Roguelike and turn-based mechanics, allowing more people to experience the charm of CCG games. The gameplay is simplified, yet offers multiple optional rules, making the basics of the game accessible while providing intriguing variations to explore.<br/><br/><br/><br/><br/>", "metacritic": null, "released": "2024-01-04", "tba": false, "updated": "2024-01-08T06:24:58", "background_image": "https://media.rawg.io/media/screenshots/2c2/2c26d5cbeae3dd670b08222511e69277.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["余愿制作组"], "genres": ["RPG", "Strategy"], "publishers": ["余愿制作组"], "esrb_rating": null}