{"id": 974837, "slug": "escorts-secrets-18", "name": "Escort's Secrets 18+", "name_original": "Escort's Secrets 18+", "description": "Hensel has always had an incredible inability to refrain from adventuring and an uncanny knack for getting into extreme trouble. Poor humor, bad jokes, and the ability to find himself in the most ridiculous situations are just a few of the traits that make Hensel an unforgettable character.<br />\nHowever, one fateful day, Hensel is caught cheating in a casino, and his life is threatened by the mafia&#39;s enforcers. To save his own skin, he must accept a peculiar offer: to become a male escort for stunning ladies in search of suitable companions.<br />\nEscort&#39;s Secrets 18+  will allow you to immerse yourself in a world of intrigue, entertainment, and secrets, where even the least talented hero can find his place among affluent women, or he may simply find himself in a predicament with serious consequences.<br />\nGet ready for an unforgettable adventure that will uncover Escort&#39;s Secrets 18+  and reveal the world of Hensel and his intricate relationships with the women who pay for his company, as well as the secrets he keeps from everyone.<br />\nFeatures:<br />\nVN Style story with dynamic camera angles, and outfits you select<br />\nA Multitude of Sexy Situations<br />\nAn immersive storyline filled with emotional twists and moments that will make your heart race.<br />\nDiverse characters, each with unique personality traits and backgrounds, making your journey even more intriguing<br />\nFast-paced and intuitive gameplay<br />\nAbility to play with one hand. ( ͡~ ͜ʖ ͡°)</p>", "metacritic": null, "released": "2024-01-06", "tba": false, "updated": "2024-01-11T12:46:44", "background_image": "https://media.rawg.io/media/games/55e/55eb8e0e16c17cfb83fb09b5217aeb1c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BanzaiProject"], "genres": ["RPG", "Simulation", "Casual"], "publishers": ["BanzaiProject"], "esrb_rating": null}