{"id": 974986, "slug": "medieval-machines-builder-first-siege", "name": "Medieval Machines Builder - First Siege", "name_original": "Medieval Machines Builder - First Siege", "description": "Prepare to take your first steps into a world of medieval intrigue, craftsmanship, and warfare. Will you withstand the First Siege and lay the groundwork for a legacy that echoes through the ages? The journey begins with <strong>Medieval Machines Builder - First Siege</strong>.<br/><br/><strong>Key Features</strong><br/><br/>🛠️ <strong>Tools:</strong><br/>Master the art of siege construction with a diverse array of tools at your disposal. Precision is key as you forge the instruments of war that will shape the battlefield.<br/><br/>🌾 <strong>Gathering:</strong><br/>Venture into the medieval wilderness to gather essential resources for your siege endeavors.<br/><br/><br/><br/>🎯 <strong>Testing:</strong><br/>Put your creations to the test on the proving grounds.<br/><br/>💥 <strong>Demolishing:</strong><br/>In war, destruction is as crucial as construction. Learn the delicate balance of tearing down enemy fortifications with powerful siege engines, unleashing chaos upon your foes.<br/><br/>🏰 <strong>Building Siege Machines:</strong><br/>Be the architect of devastation. Construct an arsenal of siege machines, from trebuchets to battering rams, each meticulously designed to breach enemy defenses and secure your dominance.<br/><br/><br/><br/>🔗 <strong>Connect with the Community:</strong><br/>Join a community of fellow lords and ladies, share your experiences, and provide feedback as we collectively shape the evolution of the Medieval Machines Builder. Join other medieval fans on our discord: https://discord.com/invite/YBVMXVCEAN<br/><br/>This is a prologue of the Medieval Machines Builder game that is coming out soon. If you've liked the prologue you will love full version of the game. Add it to the wishlist to be the first to know all news, a release date, and discounts.<br/><br/>https://store.steampowered.com/app/1584680/Medieval_Machines_Builder/", "metacritic": null, "released": "2024-01-11", "tba": false, "updated": "2024-01-12T05:58:20", "background_image": "https://media.rawg.io/media/screenshots/e67/e67b606a4a3b3a0d1a42034ce1752620.jpg", "website": "http://www.freemind.games", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 19}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 290, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Freemind", "Solverto"], "genres": ["Action", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["PlayWay", "FreeMind"], "esrb_rating": null}