{"id": 974918, "slug": "no-pressure-hive-war", "name": "No Pressure: Hive War", "name_original": "No Pressure: Hive War", "description": "<strong><h3>No Pressure: Hive War</h3></strong><br/>This title is designed to reintroduce the element of fun in gaming, transporting players to an alternate reality where the world is on the brink of collapse.<br/><h3>Pickups</h3><br/>Pickups provide the player with some much needed assistance during each wave to aid the player in possibly attaining victory.<br/><h3>Game Modes</h3><br/>choose from three exciting game modes.<br/><br/>* Story mode: play through the waves of the enemy swarm to wave 50 where you get to test your metal against the hive ship.<br/>* Music mode: play through the 50 waves of the story mode in an invulnerable state, by being indestructible you can escape reality comfortably to just fly around and shoot robots while enjoying your playlist.<br/>* Endless mode: play through an endless number of waves collecting score to rank on the leaderboard and compete globally against other players to earn your place on top and the title of Earth's Greatest Defender!<br/><br/><br/>Conquer the Hive ship to add new ships to your arsenal.<br/><h3>Enhancements</h3><br/>Upgrades are earned from killing mini bosses which appear every five waves, <br/>these upgrade points can enhance your firepower, <br/>unlock your reflex ability or soften enemy damage and more.<br/><h3>Integrated Music player</h3><br/>the integrated music player allows you to increase or decrease the volume of your music.<br/>skip or play previous song and play or pause your music during play. <br/>opening the music player also pauses the game giving you the time you need to make sure your ambience is just perfect without worry of losing to the plentiful AI swarm.<br/><h3>Top-Down Perspective</h3><br/>The Top-down perspective allows you to confront multiple foes simultaneously, all while immersing yourself in this captivating universe as you battle not only for your own life but also for the survival of humanity as a whole.<br/><br/><br/><br/><br/><br/>", "metacritic": null, "released": "2024-01-05", "tba": false, "updated": "2024-01-08T08:14:53", "background_image": "https://media.rawg.io/media/screenshots/78c/78c983cc286350c226d9843bb8ecd276.jpg", "website": "https://etherealindustries.co.za/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CH@OS", "FL4SH-F1R3"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Ethereal Industries"], "esrb_rating": null}