{"id": 974951, "slug": "locked-in-a-room-while-visiting-an-old-castle", "name": "Locked in a room while: Visiting an old Castle", "name_original": "Locked in a room while: Visiting an old Castle", "description": "Locked in a Room While: Exploring an old Castle is a Virtual Reality Escape Game.<br/><br/>In this first episode of the \"Locked in a Room While\" series, you find yourself trapped in an ancient dungeon and must unravel the mysteries to escape!<br/><br/><ul><li>Roomscale compatible (plan for approximately 3x3m play area)<br/></li><li>Compatible with standing, static, and seated play<br/></li><li>No time limit<br/></li><li>No monsters or screamers, a game for the whole family!<br/></li><li>6 puzzles to solve<br/></li><li>Between 30 and 60 minutes of gameplay</li></ul><br/><br/><br/>Immerse yourself in the captivating adventure of our virtual reality escape game, where the mysteries of an ancient castle await you. In this enthralling experience, you'll be transported to an exquisitely decorated room, steeped in history and secrets waiting to be explored.<br/><br/><br/><br/>You'll need ingenuity and logic to overcome various puzzles and decipher mysterious codes to escape from this place. <br/>Explore every detail of this castle room, where each object may hold the key to decrypting the next crucial puzzle.<br/><br/><br/><br/>The sensation of experiencing an Escape Game while having the ability to move around makes the experience unique and immersive. <br/>With warm graphics and captivating soundscapes, you'll find yourself facing intriguing challenges at every turn.<br/><br/><br/><br/>Here you are, stuck in a room while you were simply visiting a castle. Fortunately, all this adventure unfolds in your living room, ensuring you stay warm and can take a break whenever you want. Away from stress and panic, take your time and find the solution.", "metacritic": null, "released": "2024-01-07", "tba": false, "updated": "2024-01-08T09:07:06", "background_image": "https://media.rawg.io/media/screenshots/bf1/bf17f9457690690ce26454ab8ed3916f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dreamirl"], "genres": ["Adventure", "Simulation"], "publishers": ["Dreamirl"], "esrb_rating": null}