{"id": 974929, "slug": "agrarian-developer", "name": "Agrarian developer", "name_original": "Agrarian developer", "description": "Gameplay communication, please email: yunshushugame@hotmail.com<br/>\n<br/>\r\nPlot: In an unknown region, there is an island that is desirable.It is located in the blue sea and awaits a true master to keep it in order.A young man born into a merchant family has witnessed his parents' business and interpersonal interactions since childhood, so he has dreamed of owning his own estate and hiring employees to manage the farm and ranch since childhood.However, his lease contract with the island is extremely harsh - not only must he work on the farm, but also complete various adventure tasks, otherwise he will pay a high penalty.Eventually, he not only became an outstanding businessman, but also turned the once barren island into a prosperous paradise.<br/>\n<br/>\r\nGame introduction: Build a farm to produce basic items, which can be consumed by the livestock in the ranch.  Set up an automatic selling store to complete an automatic money-making production chain.The agricultural workshop can synthesize more advanced items for sale or other materials.The castle can provide employees to increase production, and the mine can provide additional income.Failure to complete tasks will result in fines, which can cause financial strain in the early stages or if development is not good enough.  The dungeons will harvest different items, but the more abundant they are, the more time-consuming they will be. Don't do dungeon tasks when you are short on funds.<br/>\n<br/>\r\nThe game has two places to store items: the production warehouse and the backpack.  The farm and ranch will store the produced items in the warehouse, and the ranch will consume the items in the warehouse.  You can transfer the items in the warehouse to the backpack, and you can also transfer the items from the backpack to the ranch.", "metacritic": null, "released": "2024-01-07", "tba": false, "updated": "2024-01-08T08:35:55", "background_image": "https://media.rawg.io/media/screenshots/5b1/5b1a86a46ef02c81248dfe016c3072c6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Polygon box"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Polygon box"], "esrb_rating": null}