{"id": 974939, "slug": "the-balls-2", "name": "The Balls", "name_original": "The Balls", "description": "<h3>The Balls: A Revolution in the World of Battle Royale FPS</h3>\"The Balls\" is not just another PVP FPS (Battle Royale) game. It redefines the freedom of movement in a virtual world. Breaking the boundaries of usual running and flying, we offer players complete freedom as geometric spheres, unrestricted by gravity or centrifugal forces.<h3>Unlimited Freedom of Movement</h3>Imagine a world where you can instantly reach any location without physical limitations. This dynamic changes everything you know about strategies and tactics in Battle Royale games.<br/><br/><h3>Community and Communication</h3>In \"The Balls\", community is our priority. A simple and transparent communication system allows for easy connection with other players. Create lobbies, join matches, and invite friends with the press of a single button.<h3>Family-Friendly Graphics</h3>Our game is free from blood and explicit violence. Instead, players compete by attacking abstract, geometric shapes. Perfect for players of all ages.<h3>Ranking System</h3>An advanced ranking system tracks your daily, monthly, and overall results. Get ready for the introduction of clan duels and periodic tournaments, offering a new level of competition.<h3>Key Features:</h3><br/><ul><li>MULTIPLAYER Deathmatch and Battle Royale.<br/></li><li>The most dynamic movement mechanism.<br/></li><li>Global rankings and achievements.<br/></li><li>Vibrant, cartoon-style graphics.<br/></li><li>Simple communication system.<br/></li><li>Strategic build-and-destroy mechanics.<br/></li><li>Unique arenas for various battle strategies.</li></ul><h3>Upcoming Features</h3><ul><li><strong>Clan Creation: </strong>Organize and manage your own clan in \"The Balls\".<br/></li><li><strong>Monthly Tournaments: </strong>Compete for prizes in regular tournaments.<br/></li><li><strong>Map Creation Mode:</strong> Design and share your own maps, offering extraordinary creativity to players.</li></ul><br/><strong>Join the \"The Balls\" community today and experience unparalleled freedom of movement and exciting competition!</strong>", "metacritic": null, "released": "2024-01-06", "tba": false, "updated": "2024-01-08T08:51:30", "background_image": "https://media.rawg.io/media/screenshots/1cb/1cb7295ec7759c43e3d5ebbd8199ec19.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Intergalactic"], "genres": ["Action", "Indie"], "publishers": ["Intergalactic"], "esrb_rating": null}