{"id": 974907, "slug": "project-xsting", "name": "Project XSTING", "name_original": "Project XSTING", "description": "<strong>SUBJECT ON THE RUN!</strong><br/><br/>You’re tired of being a labrat, so you make a run for it. Sure, you made it out of your cell, but it's not that easy! The entire facility is on high alert and, to get a taste of freedom, you must fight your way through the deadly WASP army. It’s time to use the mutations they planned to exploit against them!<br/><br/><br/><br/><br/><br/>Project XSTING is a sci-fi survival roguelite game with comic-style graphics and cyberpunk vibes. At the start of each run, you begin your escape from a random point on the map and must battle through an increasing number of enemies. Do everything you can to survive and defeat the bosses. Don't worry about overly complicated controls—just enjoy the thrill of the fight!<br/><br/><br/><br/><br/>Every character has a base range and melee attack at their disposal. Since each protagonist suffers from a unique mutation, the style of their melee and ranged attacks varies in both visuals and scope. Therefore, your character choice significantly affects gameplay.<br/><br/><br/><br/>The key is to use these attacks to eliminate enemies and collect their life force to access power-ups, allowing you to develop your character's mutation differently during each run.<br/><br/><br/><br/><br/>You're pitted against the highly-trained armed security forces of the H.I.V.E. Medical Corp. <br/><br/><br/><br/>They are skilled and deadly, using a variety of weapons. In addition, you must face and defeat five increasingly dangerous bosses.<br/><br/><br/><br/><br/><br/>You can choose to play in different stages, each offering a different visual experience. Better yet? If you’re looking for hardcore challenges, some of the stages (or stage levels) come with additional environmental hurdles.<br/><br/><br/><br/>You can also use the elements in your surroundings strategically to aid your escape. For istance:<br/><br/>  Natural obstacles, such as rocks and trees, can be used to break down or slow down the swarms.<br/><br/><br/><br/>  Areas highlighted by enemy-dispatched drones, designed to aid the enemy, can be used against them. Anyone entering the affected area suffers the consequences.<br/><br/><br/><br/><br/><br/>  Variety of enemy types<br/>  Number of unique bosses (+ surprise bosses 🤫)<br/>  4 stages (some with special environment challenges 😱)<br/>  5 difficulty modes | Complete a mode to unlock the next level<br/>  Madness mode 😱 | Complete any stage to unlock the Madness mode feature<br/>  98 in-combat upgrades<br/>  Up to 63 mutation tree upgrades<br/>  Plenty of achievements<br/>  Original soundtrack for the game as well as each character<br/><br/><br/><br/>", "metacritic": null, "released": "2024-01-05", "tba": false, "updated": "2024-01-08T07:55:28", "background_image": "https://media.rawg.io/media/screenshots/900/900b8b6a0964226e9dccacc16016bff5.jpg", "website": "https://saucymelon.com/project-xsting", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 364, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Saucy Melon"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Saucy Melon"], "esrb_rating": null}