{"id": 97504, "slug": "the-midnight-station", "name": "The Midnight Station", "name_original": "The Midnight Station", "description": "<p><em>Like the PC games of yesteryear, you're thrown head-first into the thick of it with just a manual and asked to figure out the universe. It's like the ghost of an RPG we never got — a strange amalgam of Shin Megami Tensei and the Moonside section of Earthbound shoved into a dusty floppy disk.</em><br/></p><p>\r\n\t- \r\n\t<strong>Chris Person, <em>Kotaku</em></strong>\n</p><p>\n<em>Equipping Chaos Theory can be quite confusing, but you can always discuss both it and Abstraction with the Everman. Just make sure to regularly save by confessing your sins in the Bathroom facility and you'll have a brilliantly odd time.</em><br/>\n</p><p>\r\n\t- \r\n\t<em><strong>Rock Paper Shotgun</strong></em>\n</p><p>\r\n\tThe Midnight Station is a Surreal, Action-Adventure RPG playing on the visual aesthetics of the ZX Spectrum, which began its inception in the wee hours of the morning during \r\n\tSpeccyJam.<br/>\n</p><p>\r\n\tLike an eldritch horror it swelled and grew, expanding beyond anything any one team could possibly hope to quell... The team was lost, along with the rest of humanity. But in earth's final moments; The Architect stepped in.\r\n</p><p>\n<br/>\n</p><p>\r\n\tCollector of curios and admirer of oddities, The Architect saw fit to preserve the remnants of this dying race. Compounding. Storing. Compressing them all into one final entity and placing them safely within the confines of The Midnight Station.\r\n</p><p>\r\n\tNow we are they. You are them. Are us.\r\n</p><p>\n</p><p>\r\n\tCan we escape the midnight station? Will their finesse, my brawn, your mind, suffice? What horrors, what mysteries? There are questions. Yes, many. But further there are answers and yet unknown still.\r\n</p><p>\n</p><p>\r\n\t\tPlease join us; help you; save we. They \r\n\t<em>must</em> be free.\r\n</p><p>\n<strong>The Midnight Station awaits.</strong>\n</p><strong>Key Features:<ul><li>Up to 8 hours of gameplay </li><li>Multiple endings</li><li>Weapons and Equips to allow for multiple playstyles</li><li>Beat mysterious enemies or simply find another way, the choice is yours!</li><li>Thousands of lines of dialogue</li><li>Surreal world with strange, interesting and unsettling inhabitants</li><li>RPG content provides an expansive exploration based experience</li><li>More interested in fighting your way through? Go for it! Combat allows for total customisation</li><li>Visual effects and art direction inspired heavily by the ZX Spectrum</li><li>Custom soundtrack and sound design</li><li>Replayability! Post-game content available</li></ul><br/>Countless secrets, including: <ul><li>Over 14 potential boss fights</li><li>Brains in jars!</li><li>Mystical bathrooms</li><li>Customisable stat system and a huge array of unique and substantially varied equips</li><li>Cutting edge 'borderless mode' for an all new HIGH OCTANE EXPERIENCE</li><li>REALLY COOL MANUAL (Which you should 100% read)</li></ul><p><em>If you like what you see here, don't forget to check out and follow us on http://studioanjin.itch.io for updates on all our upcoming projects!<br/><br/></em></p><p><em>Tweet at us on twitter @StudioAnjin</em></p><p><em>Like us on Facebook!</em></p></strong>", "metacritic": null, "released": "2014-12-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5bc/5bcfb8bdac27555628674a8233ca0ccb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Studio Anjin"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}