{"id": 975076, "slug": "rogue-galleon-and-the-haunted-treasure", "name": "Rogue Galleon and the Haunted Treasure", "name_original": "Rogue Galleon and the Haunted Treasure", "description": "The Galleon has been infested with spooky monsters! Rally your band of rogues to take them out and delve deeper into the cursed ship.<br/><br/><strong>Fight</strong><br/>Rogue Galleon is a top-down shooter + rogue-lite, offering different characters and weapons you can use against various monsters. Each floor gets progressively harder; the further you go, the more monsters spawn, and stronger monsters will begin to appear too. At the end of each floor, you can pick from a selection of upgrades to power yourself up too. These offer increased DPS or survivability, or add some utility effect.<br/><br/><strong>Collect</strong><br/>Every monsters has a chance to drop some amount of gold, but the most lucrative rewards come from the Bonus Gold system. On floor 1 and every 5 floors beyond, you are given the \"Disciplined Heart\" and \"Relentless Timer\". The Heart breaks if you take damage, and the Timer breaks if if a countdown runs out. If 5 floors are cleared with either one intact, a large sum of gold is rewarded, and each is reset.<br/><br/><strong>Unlock</strong><br/>When certain conditions are met, a new playable character will unlock. Each character has a special ability and comes with a unique weapon as well. Weapons are not restricted to the character they come with, so experiment to find your favourite combo!<br/><br/><strong>Spend</strong><br/>When you die, you are sent back to the Armoury and lose the upgrades you picked. But not all is lost - you keep some of the gold you found. This gold can be spent at merchants to unlock permanent power - this is how you get further and further into the game. These unlocks can increase the gold you gain, let you take more upgrades, power up certain characters, and much more.<br/><br/><strong>Progress</strong><br/>The further you go, the more gold you can earn. The more gold, the more unlocks. The more unlocks, the further you can go... but can you get far enough to uncover the source of the horde of monsters...?", "metacritic": null, "released": "2024-01-10", "tba": false, "updated": "2024-01-12T07:59:50", "background_image": "https://media.rawg.io/media/screenshots/1ba/1ba027202b2287c943edfb96d25847b4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["UnitGolem"], "genres": ["Action", "Indie"], "publishers": ["UnitGolem"], "esrb_rating": null}