{"id": 97505, "slug": "neon-valley-the-mainframe", "name": "Neon Valley: The Mainframe", "name_original": "Neon Valley: The Mainframe", "description": "<p>[Website] <br/>[Twitter] <br/>[Discord] <br/>[Steam]</p><p>Welcome to The Mainframe, the city at the center of Neon Valley. The Mainframe serves as the demo for Neon Valley: Revenge. It is the social hub where users can meet and greet. Take on gate challenges, unlock multipass and gain access to the various features of The Mainframe. From weapon testing to the planetarium and character customization! Explore The Mainframes alleyways, arena, practice range and hidden secrets.</p><p>Neon Valley: Revenge is a 3rd and 1st person online multiplayer shooter with Neo 80s design influence. Full of retro neon infused graphics and hardcore gameplay features, join the digital frontier of Neon Valley and claim your place at the top!</p>\n<p>Initially to learn programming, Neon valley is a personal project I have been developing over the last 10 months. Neon Valley has reached a point where I would love to bring in players for testing. During this proof of concept phase, I hope you players will find enough enjoyment to share with friends and be central for testing gameplay mechanics and the integrity of my design.</p>\n<p>I wish to tailor-make a competitive online shooter that allows a diverse variety of gameplay styles. Over the next few months I will be designing more weapons and gadgets, testing them one by one with the players. Experimenting with the gameplay feel and a variety of gameplay mechanics at the player's disposal, I hope to over time develop Neon Valley into a place where players can feel bad ass.</p>", "metacritic": null, "released": "2015-09-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/199/1993bec4d7c11092b13f5e20838ac3b6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 381, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Melloe"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}