{"id": 97508, "slug": "the-deep-unknown-full-release", "name": "The Deep Unknown -- Full Release", "name_original": "The Deep Unknown -- Full Release", "description": "<p>~Preface~ </p>\n<p><em>\"There is a legend among our people--That if one were to swim through the deepest, blackest, most crushing depths of the sea, on the other side of all that darkness...there is light.\" </em></p>\n<p>The goddess of the sea created four races of her power, but since that time, they've scarcely met.  </p>\n<p>Far in the north live the Nenet, the representation of the sea's storms and unfathomable wrath and power. </p>\n<p>In the shallow kelp beds live the Mu'etti, the representation of the bounty of life to be found in the ocean. </p>\n<p>Deep, deep below the water's surface are the Loremna'tat, the representation of the sea's mysteries and how no mere mortal can ever hope to comprehend it. </p>\n<p>And among the warm tropical islands live the nomadic Ame'sol, the representation of the winds of change and that only those attuned to the winds may ever even get an inkling of what the sea might do next. </p>\n<p>But for as different and spread apart as these peoples may be, they all share a common foe: the Pena--creatures of darkness that have hunted the Four Peoples since their creation. In these dark times, four runaways find themselves thrown together. Each has a personal reason for wanting to see the Pena menace done away with for good, and fueled by the belief that they were divinely chosen to end these monsters once and for all, they head out into the deep unknown to save the Four Peoples from the shadows that haunt them. But before these four strangers can ever hope to defeat a monster, they'll have to figure out how to just get along with one another first. Though they all speak the same language, there seems to be an awful lot lost in translation going on around here. </p>\n<p>The winds of change are upon us. Let the hunt begin.</p>\n<p>-----------------</p>\n<p>Genre:  Friendship/Adventure</p>\n<p>-----------------</p>\n<p>Features</p>\n<p>--It's free!</p>\n<p>--Strong but caring female protagonist.</p>\n<p>--Almost 200,000 words.</p>\n<p>--Good Ending, Best Ending, and bonus friendship or romantic endings.  But beware, if you or your allies don't survive, there are bad endings too.</p>\n<p>--No route system.</p>\n<p>--Seven bonus scenes and four bonus CGs for maxing friendship and survival stats.</p>\n<p>--No 'one right way' to get the best ending, there are lots of combinations to get you there, every person will have a different experience.</p>\n<p>--Water.  Lots and lots of water.</p>\n<p>--<strong>Warnings </strong>for mild violence, mentions of blood, and flippant threats of cannibalism.  Game will also include scenes of the characters hunting, which may bother some of my fellow animal lovers.</p>\n<p>-----------------<br/><strong>For Feedback</strong></p>\n<p>It was a long journey, it took us awhile to get here, but I thank you for your patience and hope you enjoyed the game. If you have a little extra time, I'd love to know what you think. Please write your general thoughts before answering the questions.</p>\n<p>--Who is your favorite character and why?<br/>--What was your favorite moment from the game?<br/>--Any advice or critique I should keep in mind for the sequel/other future games?  (other than having more reasonable release goals)<br/>--Any other comments/concerns?</p>\n\n<p>Enjoyed the game?  Consider donating!  </p>\n<p>http://ko-fi.com/swallowtailedtrinket<br/></p>", "metacritic": null, "released": "2016-11-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/584/584f47f8c11498ccceb6064f000fa6c5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 286, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["SwallowtailedTrinket"], "genres": [], "publishers": [], "esrb_rating": null}