{"id": 975021, "slug": "quadruzzle", "name": "Quadruzzle", "name_original": "Quadruzzle", "description": "Puzzle difficulty squared!  Quadruzzle is an exciting brain teasing logic, spatial, and word puzzle all wrapped into one.  Each day you will be tasked with solving a new puzzle.  Each puzzle consists of 3 four letter words, and 1 three letter word scrambled in a 4x4 tile box.  Solve the puzzle by guessing each of the four color coded words and moving their corresponding letter tiles into the proper place.  If you have ever played the popular 15 logic puzzle then this game will be very intuitive.  Solving these word puzzles will tax your problem solving and spatial skills to the max.  Don't let the four letter words and the ever popular three letter word fool you.  Solving these words will put your vocabulary knowledge to the test.  And even if you do know each word, lining up their corresponding letters in the proper locations to form the word (ups the challenge level of this puzzle) is another level of difficulty.  Put your problem solving, word knowledge, spatial skills to work with Quadruzzle.<br/><br/><strong>The Word Clues</strong><br/>There are 4 words to solve in the puzzle, and there are clues to solving each word.  The Word Clues are in colored boxes to the left of the play field.  Each clue corresponds to the row and color of the word to be solved.  The colors are Yellow for the word on the first row, Blue for the word on the second row, Red for the word on the third row, and Green for the final 3 letter word on the bottom row. If the text is too small, the player can tap the clue box to enlarge it for easier viewing. <br/><br/><strong>The Playfield</strong><br/>The playfield consists of a 4 x 4 grid of 16 spaces, 15 of which are taken up by lettered tiles leaving one open space.  The player can move the 15 lettered tiles by tapping or dragging them into an adjacent empty space.<br/><br/><strong>Solving Words</strong><br/>All letter tiles are grey at the start of the game.  When you move a tile to its proper location it will change colors to match the word color and its clue box to the left of the playfield.  If a tile is moved from its proper location it will turn back to grey.  When all of the letter tiles for a word are placed in their proper location, you will know immediately as they will all be the correct color, play a special animation, and make a special sound.<br/><br/><strong>Solving The Puzzle</strong><br/>Only when <strong>ALL</strong> of the tiles for all 4 words are in their proper location will the puzzle be considered solved.  When this happens all four words in the puzzle will animate and make a puzzle complete sound.  This will denote the puzzle as solved.  After this you will have to wait until the next day's puzzle is released to play again.<br/><br/><strong>Colorblind Players</strong><br/>Since the game uses a lot of color coding, we have added the ColorADD system to the game.  This system will let those with any form of colorblindness play the game as each word tile, clue box, and any associated colored objects in game will have a special color code.", "metacritic": null, "released": "2024-01-08", "tba": false, "updated": "2024-01-12T06:42:24", "background_image": "https://media.rawg.io/media/screenshots/dd4/dd41528210c60dbc4398da888340fe6d.jpg", "website": "http://joemauke.wordpress.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Joseph A Mauke"], "genres": ["Casual"], "publishers": ["Joseph A Mauke"], "esrb_rating": null}