{"id": 975031, "slug": "zombie-party-sang-shi-pai-dui", "name": "Zombie Party 丧尸派对", "name_original": "Zombie Party 丧尸派对", "description": "\"Zombie Party\" is an anti-superhero-themed strategy game. You need to play the role of a chaotic ability user GRAVEDIGGER, and use your super power to summon the zombie army to destroy the land that is governed by the government and the PARLIAMENT OF FIVE, The established order of power.<br/><br/><br/><br/><br/>You can use your superpowers to summon thousands of zombies and form an army of the living dead loyal to you. But be aware that once summoned, most of them will tend to act according to their bloodthirsty instincts. At this time, you need to summon more powerful special infected. They will perform their respective duties and become an important aid for you to fight against the enemy.<br/><br/><br/><br/><br/>Using your powerful Chaos abilities on the battlefield, whether it is to amplify friendly troops or let them self-destruct and damage enemies, will have a vital impact on the entire battle situation.<br/><br/><br/><br/><br/>In a secret corner where no one is watching, you will build a refuge for those with super powers. Configure upgrade modules for various instruments and buildings to make your abilities more powerful<br/><br/><br/><br/><br/>The conflict and hatred could no longer be suppressed. He embarked on the road of revenge and fought fiercely with more than a dozen heroes. Become a [gravedigger] to destroy all this hypocrisy and injustice, and sound the death knell for the sanctimonious superhero.", "metacritic": null, "released": "2024-01-08", "tba": false, "updated": "2024-01-12T06:57:50", "background_image": "https://media.rawg.io/media/screenshots/805/80593fb5b23857ae7d1e714047d8ada2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Joychasing Games"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Joychasing Games"], "esrb_rating": null}