{"id": 975013, "slug": "supernormal", "name": "Supernormal", "name_original": "Supernormal", "description": "<strong>For the last two years, I've had the honour of developing the spiritual successor to Allison Road, with the blessing of its original creator. It's designed and optimized for both old and next-gen hardware. This has been a solo journey for me, and I like to think of it as Allison Road, Reimagined. I've put my heart and soul into this project, and I truly hope you enjoy it. </strong><br/><br/><br/><ul><li><h3>SOLVE THE CASE</h3>Your detective skills shape the story, leading to one of two different endings. It all depends on the number of clues you discover and how observant you are. </li></ul><ul><li><h3>VOICE RECOGNITION</h3>Communicate with the paranormal entities using your microphone. Will they offer crucial clues or mislead you into dead ends?</li></ul><ul><li><h3>MICROPHONE DETECTION</h3>Engage with the paranormal, but remember this crucial rule: if they unveil their presence and hear you, STAY QUIET and DON'T MOVE, or risk altering the game's ominous outcome.</li></ul><ul><li><h3>PHOTOSCANNED GRAPHICS</h3>Using Unreal Engine 5, the game is set in a hyper-realistic environment. It also uses photo scanned graphics to enhance every tiny detail, including the horror!</li></ul><ul><li><h3>RANDOMIZED PARANORMAL EVENTS</h3>Introduces unpredictable, spine-chilling encounters that are randomly generated throughout the gameplay. No two scares are alike, intensifying the terror and replayability.</li></ul><h3>SUPERNORMAL OFFERS ABOUT 2 HOURS OF GAMEPLAY AND COMBINES DETECTIVE WORK WITH PUZZLE-SOLVING IN A HORROR SETTING. EXPECT TO SEARCH FOR CLUES AND SOLVE PUZZLES TO PROGRESS THROUGH THE GAME.</h3>", "metacritic": null, "released": "2024-01-08", "tba": false, "updated": "2024-03-13T16:48:59", "background_image": "https://media.rawg.io/media/screenshots/451/4518efa3abe7e5a5a15a9f757a6af228.jpg", "website": "http://supernormalgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 3, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Hitori de Productions"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Hitori de Productions"], "esrb_rating": null}