{"id": 975005, "slug": "gymfistprint", "name": "GymFistprint", "name_original": "GymFistprint", "description": "In this <strong>gym</strong> we love to train a lot and have sparring with people from all over the world, here old <strong>Martín</strong>, former professional boxer, will be the one who trains you to get the best out of you, you will test your agility, reflexes, concentration, coordination, patience, perseverance in The 3 machines that the gym offers so far include the punching bag, the speedbag and the dodgeball. Improve your stats like your <strong>strength</strong>, <strong>critical hits</strong>, <strong>aim</strong>, <strong>guard</strong>, and reflex while <strong>dodging</strong> blows to see them in action in combat. Your teammates will always give you good advice to raise your spirits and improve as a fighter and person, try to talk to them when they are taking a break.<br/><br/>Old Martín will turn you into a diamond, the only thing he asks is <strong>that you trust yourself</strong>.<br/><br/>Some advices:<br/>-The game has <strong>autosave</strong> (local on PC)<br/>-Training too much before a fight will cause your fighter's <strong>fatigue</strong> to affect his recovery in combat.<br/>-Before a fight, the <strong>3 best results</strong> of each machine in the gym are averaged, to consider your <strong>statistics</strong> in combat.<br/>-After each fight the fighter eliminates his highest statistic and also eliminates his fatigue (if he does not abandon the fight) and can retrain for his next sparring.<br/><br/><strong>Do not give up!</strong><br/><br/><br/>(I will be making future improvements, stay tuned for <strong>updates</strong>, this will only get better) Francisco Canales", "metacritic": null, "released": "2024-01-08", "tba": false, "updated": "2024-01-12T06:23:19", "background_image": "https://media.rawg.io/media/screenshots/238/238f3fe233648f493f4751d33cc47439.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 261, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Francisco Canales"], "genres": ["Sports", "Indie"], "publishers": ["Francisco Canales"], "esrb_rating": null}