{"id": 975085, "slug": "basketball-grand-slam-2024", "name": "Basketball Grand Slam 2024", "name_original": "Basketball Grand Slam 2024", "description": "A competitive game with real-time operation. There is no complicated player training. It depends entirely on operation to crush the opponent, taking you into the era of everyone's slam dunk.<h3>[Real-time competition, multiple ways to play]</h3><br/>The game uses real-time synchronization technology to ensure fair competition among players. Smooth operation and silky feel. Invite friends to team up and open a room, or play single-player games anytime and anywhere to show off your skills. There are various modes such as 3v3 ranked matches, Bullfighting Grand Prix, casual shooting matches, etc. It’s up to you how you want to win in the new season! <h3>[Royal Stadium, legendary stars]</h3><br/> Seaside parks, bar streets, city flyovers, and multiple real stadiums can be switched at will! Many legendary superstars have gathered together to form various super lineups. With a variety of playing styles and tactical coordination, the fun is all under your control. It’s up to you to control whether it’s a lone hero that shocks the audience, or a gorgeous collaboration. <h3>[Personalized fashion, thousands of combinations]</h3><br/>Hundreds of fashions to wear at your leisure! Hairstyle, clothes, pants, shoes, backpack, glasses and suits, from head to toe, everything is meticulous. You will be the center of attention in the entire competition! Each type of clothing will increase the attributes of a fixed value, and specific players will also have exclusive clothing. Wear the most fashionable clothes and defeat your opponents. <h3>[Fancy skills, shining in the audience]</h3><br/> 25 fancy skills such as backhand windmill, free throw line dunk, fadeaway jump shot, fancy dribbling, and back dribble, 17 training attributes, and various celebrations after scoring a goal, allowing you to ignite the audience. !", "metacritic": null, "released": "2024-01-10", "tba": false, "updated": "2024-01-12T08:12:08", "background_image": "https://media.rawg.io/media/screenshots/b4d/b4d8b3994a888a5aaa5632a6b3e7b5ac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 327, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HONG KONG POINSETTIA TECHNOLOGY"], "genres": ["Action", "RPG", "Simulation", "Sports", "Casual"], "publishers": ["FutureGameStudio"], "esrb_rating": null}