{"id": 975178, "slug": "run-tekila-run", "name": "Run Tekila Run!", "name_original": "Run Tekila Run!", "description": "*Two gamepads are only required for coop. For single player, you can also use mouse &amp; keyboard, if you prefer.<br/><br/>Dua counts sheep before sleep. After jumping the fence, the littlest sheep, Tekila, runs away. Now Dua must chase the runaway!<br/><br/>Get ready for a fast-paced, magical combat/comedy game battling fearsome zombie hordes! Accompanied by delightful(!) flute melodies and compelling narration, you will gain new skills as you progress...all the better to clean out the monster-strewn maps throughout the game!<br/><br/><br/><br/>There is a wide range of difficulty settings from Invincible (piece of cake) to Hard mode (which will definitely make you sweat)!<br/><br/>If you have a friend and a second gamepad, why not let them join the adventure on your couch? You can teach the meddling zombies a lesson together! On local co-op, Player 1 handles everything from combat to interactions, while Player 2 supports on combat.<br/><br/>After you finish the game, you unlock New Game+... a good time to try the game with a higher difficulty mode! Your skills, maximum Health and Mana will remain at the same level as you finished the first game. Plus: this time you’ll be able to read the poems on your merry way!<br/><br/>If you have a couple of hours to KILL, dive into Run Tekila Run! Dua is desperately in need of your assistance!!", "metacritic": null, "released": "2024-01-12", "tba": false, "updated": "2024-01-15T04:41:44", "background_image": "https://media.rawg.io/media/screenshots/8bf/8bf4b724486e971949baeec453b2cf6a.jpg", "website": "https://tongucbodur.com/tekila", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 360, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tonguç Bodur"], "genres": ["Action", "Indie"], "publishers": ["Tonguç Bodur"], "esrb_rating": null}