{"id": 975173, "slug": "yume-4", "name": "YUME 4", "name_original": "YUME 4", "description": "<h3>Game background</h3>As the fourth part of the YUME series, this is still a story centered on Chen Xi, but the perspective is unfolded by you, a hot emerging director.<br/>As the most outstanding young director today, you are handsome and rich, and you are often approached by unknown starlets or girls who aspire to be in the entertainment industry...<br/>So what, you still named Chen Xi as the heroine of the new movie, please! Chen Xi is your favorite female star since you entered the entertainment industry. She is really awesome.<br/>When I entered the set, I unexpectedly discovered that she has been losing energy recently and kept mumbling about \"Menghan\".<br/>How can outsiders understand her distress...<br/><h3>Gameplay</h3>Chen Xi and the memory of her previous life once again split into two forms, one on each side of the maze. How can she obtain the memory of her previous life? ?<br/>YUME 4 is a maze-breaking game, in which Chen Xi moves in the opposite direction to her previous life. Players need to use keyboard control to reach the designated position to enter the next level!<br/>There will be many dangers to stop your progress, be careful not to get Chen Xi injured!<br/><strong>The gameplay of the YUME series has been updated again. You can interact with characters in free mode to get different reactions and favorability~</strong>", "metacritic": null, "released": "2024-01-12", "tba": false, "updated": "2024-01-15T04:34:34", "background_image": "https://media.rawg.io/media/screenshots/424/4244ea330b36700b9e7bd80ca1f42dc0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lovely Games"], "genres": ["Adventure", "Casual"], "publishers": ["Lovely Games"], "esrb_rating": null}