{"id": 975205, "slug": "united-city", "name": "united city", "name_original": "united city", "description": "<h3>overview</h3>The background of the story is set in the 1990s, when Ruian Company launched a brand new technology, and the backward and remote mountainous areas were re established as new technology pilot areas. While local residents enjoyed the beauty brought by technology, some changes were also quietly taking place Looking back at the past from a sci-fi perspective, another scene of urban life in China in the 1990s is a cinematic reading experience.<br/><br/>Taking the real world as the background and gradually building a parallel worldview in the form of short stories, typical childhood memories of the post-90s generation are re examined in books with a sci-fi perspective on staying behind, extracurricular tutoring, overseas animation, arcade halls, etc. Life may be like a train, friends are like passengers on the train, not everyone can accompany you to the destination, some people get off early, some people leave without saying goodbye, but in Liancheng, Those former playmates may not have disappeared, and there may still be a place for them in the depths of their souls.<h3>Game Features</h3>This is a relaxed and casual game, hoping to help you relax and regain the innocence and beauty of your childhood during the game.<br/><br/>Easy to operate: easy to get started, Interactive visual novels.<br/><br/>Magical decryption: Incorporating decryption into the illustrations is simple and smooth, without affecting the overall gaming experience.<br/><br/>Interesting Collection: Integrating collectible items into the environment, simple and interesting, increases the sense of immersion.<br/><br/>Achievement system: Hidden achievement rewards that add a bit of careful surprise and leave some traces for your gaming experience.<br/><br/>This work is mainly composed of illustrations and text, presented in the form of a visual novel in front of all players. It is the first time the work has been listed on Steam, and I feel uneasy. I hope you like it.", "metacritic": null, "released": "2024-01-12", "tba": false, "updated": "2024-01-15T05:19:34", "background_image": "https://media.rawg.io/media/screenshots/7bc/7bc4698fb98e1608bd05e770f369a28e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 404, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lijirui"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["lijirui"], "esrb_rating": null}