{"id": 9752, "slug": "deep-end", "name": "Deep End", "name_original": "Deep End", "description": "The Deep End is a parkour platformer with entire room scale gameplay, experience virtual reality like never before as you climb, jump and run through 10 expansive levels. Only one rule, don't fall in the pool. <br/><br/>Months of work went into planning and programming the most fluent, immersive movement system virtual reality has to offer. Deep End features several natural ways of navigating the world such as walking, running, jogging, crouching, climbing and jumping.<br/><br/>Aside from the standard mechanics there are a number of movement abilities such as edge grabbing, sliding, crawling, and many more. <br/>We wanted to provide the players with something that they could quickly jump into and play, while at the same time providing difficult gameplay that will keep the player coming back for more.<br/><br/>90% of the assets were created from scratch just for this project, sadly this is considered a \"feature\" these days.<br/><br/>The following features will be available on launch:<br/><ul><li>5+ hours of gameplay<br/></li><li>Run in Place Locomotion<br/></li><li>Basic movement tutorial area<br/></li><li>Custom soundtrack by Elkoe!<br/></li><li>Haptic feedback<br/></li><li>Zero Latency Jumping<br/></li><li>Optional special challenges<br/></li><li>Ten levels of increasing difficulty and complexity<br/></li><li>Plenty things to collect and places to explore<br/></li><li>Three difficulties<br/></li><li>Timed runs <br/></li><li>Several extra modes for those who have mastered the levels, including a hardcore no death playthrough!</li></ul><br/>--VR FAQ--<br/>\"Do you move towards where you are looking?\"<br/>- We have specially designed a system that orients your facing direction off a combination of hand rotation and HMD direction. In this way you can look in a different direction than you are moving, <br/><br/>\"I hear this is made with the Unreal Engine, does that mean it is going to be blurry and slow?\"<br/>- UE4 defaults to unsuitable settings for virtual reality, however care has been taken to remove all blurriness caused by AA while still providing a smooth experience minimal of graphical flickering. Use of LOD's, texture MIP's and material fade algorithms replace common techniques of anti aliasing and supersamping. The game has been optimized to run on 90 fps with any VR capable card. <br/><br/>\"How does the mirrored screen function?\"<br/>- We have reconfigured the engine to output fullscreen mirroring with the highest possible resolution out of one eye. The black bars on the sides have also been removed. This should make it easy to record gameplay or spectate.<br/><br/>\"Does this support sitting/controller gameplay\"<br/>- No<br/><br/>\"Will this make me motion sick?\"<br/>- Consider avoiding this game if you have experienced previous symptoms of vertigo or VR-sickness. The VR-sickness effect is less intense than trackpad motion, but more intense than stationary or teleport motion.<br/><br/>\"How does this game handle roomscale motion?\"<br/>Plenty of work was done to prevent players from walking/ looking inside objects as to maximize immersion and provide a solid framework for speed running possibilities. Many other exploits with room scale gameplay have also been ironed out, and will continue to be focused in future updates.<br/><br/>\"Can I create my own levels?\"<br/>- Player created level design is something that will be coming in the future.", "metacritic": null, "released": "2017-03-31", "tba": false, "updated": "2019-08-28T22:14:48", "background_image": "https://media.rawg.io/media/screenshots/f7b/f7b1da0742b103c9685433dec9ea16e4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 1, "achievements_count": 17, "ratings_count": 0, "suggestions_count": 280, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Red Line Reality"], "genres": ["Action", "Indie"], "publishers": ["Red Line Reality"], "esrb_rating": null}