{"id": 975274, "slug": "belonging-2", "name": "Belonging", "name_original": "Belonging", "description": "Belonging is a first-person adventure game about a cult and its victims. As the hacktivist Jayce, you are scouting the abandoned estate of the Entelechism cult. You are there to find data you can leak to the public and uncover uncomfortable truths about what happened to the people that lived there.<br/><br/><h3>Explore the remains of a reclusive community</h3>Entelechism is a community devoted to self-optimization. Its members spend their days pursuing perfection in all aspects of life. A cause that seems innocent or even worthwhile on the surface, reveals its dark sides when manipulative actors take control. What other secrets are the Entelechism leaders hiding?<br/><br/>Inspired by real-life cult survivor stories this game makes sure the player understands how human it is to fall for the narrative cults peddle. The story builds empathy for people we might think are lost or worse irredeemable.<br/><br/><br/><br/>Collect and decide what data should be leaked to the public while unlocking every door inside the cult estate to reveal what suddenly made the cult disappear.<h3>Key Features</h3><ul><li> Laid-back story: explore at your own pace<br/></li><li> Find out Jayce's personal connection to Entelechism<br/></li><li> Explore an abandoned estate of the Entelechism cult, a twisted paradise for a reclusive community<br/></li><li> Unlock different areas of the estate to unveil every mystery<br/></li><li> Collect data that reveals secrets about the cult<br/></li><li> Decode and watch video recordings of the final days of the elusive group<br/></li><li> Get to know complex and layered characters and their reasons for joining Entelechism<br/></li><li> Decide whose story matters by choosing which information you reveal to the public</li></ul><br/><h3>You decide who matters</h3>Jayce is the first one on the scene after the Entelechists have mysteriously vanished. As you scour the secret island estate for pieces of information, you will uncover more and more about the final days before everyone disappeared. Browse video recordings for evidence and vital details on dramatic incidents. You decide what information will be leaked to the public and who will ultimately be responsible for what has transpired inside Entelechism.<h3>Supported by</h3><ul><li> Film- und Medienstiftung NRW<br/><br/></li><li> Federal Ministry for Economic Affairs and Climate Action<br/></li></ul>", "metacritic": null, "released": "2024-01-18", "tba": false, "updated": "2024-01-19T04:23:25", "background_image": "https://media.rawg.io/media/screenshots/82b/82b5e9887c15f868b4e6b12492a40576.jpg", "website": "https://www.farbspiel-interactive.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Farbspiel Interactive"], "genres": ["Adventure", "Indie"], "publishers": ["Farbspiel Interactive"], "esrb_rating": null}