{"id": 975329, "slug": "mechajourney", "name": "MechaJourney", "name_original": "MechaJourney", "description": "In XXXX, there were multiple unknown spatial fluctuations on Earth, with strange beasts (some with strange abilities, codenamed EB) and unknown armies (mainly using mechs for combat, codenamed D&amp;D) appearing at the centers of multiple fluctuations. At the same time, there were strange changes in the local environment around the fluctuation space, and from then on, the Earth fell into a tripartite struggle. After a period of time, humans have initially mastered some of the techniques of D&amp;D for manufacturing mechs and training pilots. At the same time, due to the small number of D&amp;D, their power development is relatively slow, and most of the EB stay in place, which to some extent limits the development of D&amp;D, causing the three sides to temporarily maintain a balanced state. In this situation, the emerging free explorers collaborate with human armies to seek new breakthroughs...<br/><br/>This is a placement game with fewer clicks and waiting for revenue<br/><br/>In the game, you will experience the feeling of becoming an seeker while also becoming a bit of a town administrator<br/>When becoming an seeker driving mechas, complete tasks, earn rewards, accumulate resources, and gradually improve oneself; You can also find partners, team up for battles, and enhance team capabilities; It can also meet the needs of towns and increase the upper limit of towns and teams at the same time<br/>When becoming a town administrator, watching seekers complete tasks allows the town to acquire the resources needed for development. Although some conditions may automatically unlock, you can still decide when to unlock new skills for mechas, weapons, chips, and components, control the timing of launching a campaign against Disasters, and customize the design of mecha drawings to create your favorite mecha types<br/>The following are the main features of the game:<br/><strong> Manufacturing mecha - Design new drawings, manufacture different mechas </strong><br/><strong> Transforming mechas - Combining different weapons, chips, and components to build various distinctive mechas </strong><br/><strong> Strengthening mecha - enhancing mecha attributes </strong><br/><strong> Training pilots - changing pilot attributes and abilities, finding suitable mecha combinations </strong><br/><strong> Searching for partners - forming a team, fighting together, and completing tasks together </strong><br/><strong> Rich ability combinations - about 100 types of mechs, weapons, chips, components, and pilots in total, combined and matched with each other </strong><br/><strong> Improving Technology - By analyzing enemy data through combat, we can enhance our technological and scientific research levels </strong><br/><strong> Unlocking new capabilities - the ability to consume core data and freely control the unlocking of mechs, weapons, chips, and accessories </strong><br/><strong> Multiple task forms - require simplicity, flexible selection, no need for constant attention, can be completed with simple placement </strong><br/><strong> Conquer D&amp;D - Consume collected materials and freely dispatch troops to conquer </strong><br/><strong> Seek Area - Collect different material resources to manufacture mechas, weapons, chips, and components </strong><br/><strong> Collect raw materials - discover mining areas during exploration, dispatch teammates to automatically collect </strong><br/><strong> Research site- Discovering a base during seek, attacking can obtain research materials </strong><br/><strong> Three types of combat methods - normal, assault , and conquest </strong><br/><strong> Assault - Attack on a discovered research site, with a limited number of personnel, and will continue to fight until the end </strong><br/><strong> Conquest  - Dispatching troops to engage in large-scale battles with both sides until one side is completely killed. The seek team is free to choose whether to participate in the battle </strong><br/><br/>If you have any questions or bugs, please feel free to leave a message", "metacritic": null, "released": "2024-01-15", "tba": false, "updated": "2024-01-19T05:39:57", "background_image": "https://media.rawg.io/media/screenshots/18e/18ed7d8dbf087a00098c3f38abbd6c45.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["缓慢的蜗牛"], "genres": ["Casual", "Indie"], "publishers": ["缓慢的蜗牛"], "esrb_rating": null}