{"id": 975313, "slug": "zhao-yun-chuan-xin-ban-zhao-yun-chuan", "name": "赵云传：新版赵云传", "name_original": "赵云传：新版赵云传", "description": "[Here is only a brief overview. Many contents of the game cannot be listed one by one. You can explore other contents on your own in the game.]<br/>The new version of Zhao Yunchuan is created with the old game style, retaining the original style and user interface. The game features simple and user-friendly mouse and keyboard controls<br/>This is a 2.5D game, where the in-game map looks like a gorgeous ink landscape painting. The game features a brand new dynamic map effect, featuring a variety of different styles of buildings. Coupled with a powerful building system and new game engines supported by Win10 and Win11 systems, players can DIY and construct their own Zhao Yun style according to their own ideas, allowing you to truly realize that what you want is no longer a dream!<br/>There are multiple types of troops in the game that complement each other in terms of attributes. These soldiers are led by well-known Three Kingdoms generals, making the battles in the game more intense and interesting for players. Especially the recruitment system for generals can bring players an unparalleled sense of control and satisfaction. You can freely command them to do different things in different scenes to serve you! And you can truly control different generals at the same time, such as Guan Yu, Lv Bu, and so on! By the way! There is also a young Zhao Yun holding an axe in his hand!<br/>In the early stages of the game, you can also make three different choices to determine which direction your game will develop towards in the later stages;<br/>They are: super easy/super difficult/nostalgic difficulty<br/>You choose super easy difficulty! Even more powerful than cheating!<br/>If you choose super difficulty, please be patient with it! Because the early and middle stages were tormented like hell!<br/>You choose the nostalgic difficulty level, and you can learn and use the old version of the skill - no longer use the new version of the skill!<br/>Attention:<br/>The choice of each difficulty level determines your gaming experience. If you are a hardcore player, you can try the rarest nostalgic option. We will personally test it, and as long as you have patience, you will be able to flexibly use every weapon and skill, and there are no levels that cannot be passed<br/>If you want to use a new skill, just choose another difficulty level, without affecting each other. Each has its own advantages and disadvantages, and you can play as you want.<br/>Of course, if you feel impatient and want to play the hardest part, you can also cheat!<br/>Super difficulty and nostalgic difficulty - added//automatic increase in game difficulty function, no need for you to manually choose,<br/>In addition to the super easy difficulty of having an undead body - other difficulties increase the protagonist's death and no longer have an undead body. You must have at least 1000 game coins to have a chance to resurrect in place. If not, - hehe~!!! (Let's explore other experiences on our own)", "metacritic": null, "released": "2024-01-15", "tba": false, "updated": "2024-01-19T05:17:10", "background_image": "https://media.rawg.io/media/screenshots/22a/22ae11069d1c28570c044d3d5a8cf4a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["xbzyz"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["xbzyz"], "esrb_rating": null}