{"id": 975380, "slug": "yuuna-and-the-haunted-hot-springs-the-thrilling-st", "name": "Yuuna and the Haunted Hot Springs The Thrilling Steamy Maze Kiwami", "name_original": "Yuuna and the Haunted Hot Springs The Thrilling Steamy Maze Kiwami", "description": "<strong>Want to dive into a bath? Or into a dungeon?</strong><br/><strong>\"Yuuna and the Haunted Hot Springs\" is now an RPG that's pushing all sorts of boundaries!</strong><br/><br/><br/>Yuuna and the Haunted Hot Springs makes its video game debut as a genuine roguelike RPG!<br/>In order to save Kogarashi, search through expansive dungeons that change layout every time you enter!<br/><br/><br/>Jump in the hot spring to power up! Watch out for damage to your clothes!<br/>A new story of hauntings, hot springs, and high adventure awaits you!<h3>Adventure, apparitions, and a hot spring... A brand-new story that's quite literally bursting at the seams!</h3><br/>Featuring a story unique to the game with special event images that can't be seen anywhere else<br/>and character interactions fully voiced by the star-studded cast of the animated series!<br/><br/><br/>One weekend-<br/>After hearing a strange noise coming from the Yuragi Inn's storage, Kogarashi and the rest of the Inn's residents decide to do a bit of spring cleaning,<br/>but they accidentally knock over a chest they find inside.<br/>From inside the miniature garden they find within, a girl's voice can be heard.<br/>\"Kogarashi...! You've come back!\"<br/>At that moment, a powerful gust plucks Kogarashi off his feet, and sucks him into the miniature garden!<br/>Will the others be able to rescue Kogarashi?!<h3>Anything could happen! Push through dungeons that'll push you to the limit!</h3><br/>Conquer the dungeons' challenges!<br/>Jump into battle with Yuuna, Sagiri, Yaya, and even more playable characters!<br/>Bring your favorite characters and rescue Kogarashi!<h3>You can push the limits of bathing too... Refresh yourself and get powered up in the Resonant Spring!</h3><br/>A relaxing soak in the hot spring might relieve the exhaustion of your adventure, but could evil spirits be drawn in too?!<br/>Team up with Koyuzu to clear out both the steam and the spirits!<br/>As you do, you might even notice some characters have changed!<h3>From adorable to...alluring?! Change freely between over 15 kinds of costumes!</h3><br/>More than 15 kinds of both familiar and brand-new outfits appear!<br/>Dress Yuuna and friends up in your favorite costumes!<br/>Of course, both the in-game sprites and the character illustrations will change to match!<br/>Each costume has different abilities, so make use of them when delving into dungeons!<h3>\"It's too difficult... I can't beat this...\" No worries! The storage is stuffed fit to burst with helpful items!</h3><br/>For any players who don't relish challenging dungeons,<br/>you can make use of handy support items right from the start!<br/>Naturally that includes costumes too, so get dolled up in your preferred outfits and conquer the dungeons!", "metacritic": null, "released": "2024-01-17", "tba": false, "updated": "2024-01-19T06:47:41", "background_image": "https://media.rawg.io/media/screenshots/b63/b630f00431063d2ddeb97a47764cb848.jpg", "website": "https://www.cs.furyu.jp/yuragisou/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FuRyu"], "genres": ["RPG"], "publishers": ["FuRyu"], "esrb_rating": null}