{"id": 975361, "slug": "starlight-scouts", "name": "Starlight Scouts", "name_original": "Starlight Scouts", "description": "<strong>An Ex-Rocket-Hero, waiting for the stars to call again...</strong><br/>You were a fighter pilot in the early days, when rockets were tin cans with thrusters bolted onto every side. Battles were waged constantly in the name of newfound resources. You were one of the best...<br/><br/>Now Rocket-Heroes are a thing of the past. All that's left is your desire to get beck behind the throttle...<br/><br/>Suddenly, your old Auto-Log chimes to life with an open broadcast message...<br/><br/><br/><br/><strong>Join the Starlight Scouts today, the most elite space explorers in the solar system.<br/><br/>Venture forth into unknown worlds. Discover the future.<br/><br/>Become one of the galaxies elite.<br/><br/>Become an expert pilot.<br/><br/>Become, a Starlight Scout...<br/><br/>It's gonna take hard work, dedication, and a whole lot of fun, but- I think you've got what it takes...</strong><br/><br/>The transmission ends. Will you answer the call?<br/><br/><br/><br/><br/><strong>Unlock 5 badges per level to boost your total score through the atmosphere. Speed through levels at blistering paces. Crawl across the floor like a limp dog just to conserve enough fuel. Skim past obstacles that would otherwise knock the teeth out of a lesser pilot. Get through a level without a single scratch on your rocket. Get all four and you've earned yourself the Scout's Medal...</strong><br/><br/><strong>Now get lost. Go find your ship and fly to your heart's content...</strong><br/>", "metacritic": null, "released": "2024-01-16", "tba": false, "updated": "2024-01-19T06:20:36", "background_image": "https://media.rawg.io/media/screenshots/fb3/fb38cb979727b7bf040f09cfb566e8cf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jobi's Adventure Development Club"], "genres": ["Adventure", "Simulation", "Racing", "Casual", "Indie"], "publishers": ["Jobi's Adventure Development"], "esrb_rating": null}