{"id": 975306, "slug": "manor-madness", "name": "Manor Madness", "name_original": "Manor Madness", "description": "Manor Madness is a 3D, third-person sandbox game. In this game, you play a young ghost, Ghustav, who wants to learn how to become a real poltergeist.<br/><br/>As a ghost, you can possess, throw, and interact with different objects around the house. Observe each visitor carefully to understand their fears and exploit them to make the humans’ blood run cold.<br/><br/>Ghustav attends Polterhigh, the most prestigious school for poltergeisting. In the course Manor Madness, you will learn what it means to be a poltergeist and what abilities are at your disposal. In each assignment, your goal is to scare all the humans out of your assigned manor. <br/><br/>Currently on sale, the manor is frequented by humans interested in buying the building and a realtor trying his best to sell the house. He needs to get creative in finding excuses for your spooky shenanigans. The realtor has a soothing effect on the other humans in the room. Distract him to maximize your scariness. <br/><br/>Will you merely be able to send a shiver down their spine, or will you succeed in scaring their pants off? Your class starts now!<h3>Key Features</h3><br/><strong>Possess and interact with different objects</strong><br/>Every room in your manor is equipped with unique objects for you to discover.<br/><ul><li>Possess different objects and throw them across the room<br/></li><li>Interact with objects, flicker the light switch, or play an eerie melody on the piano</li></ul><br/><strong>Polter Sense</strong><br/>Tap into your ghostly senses and see beyond the mortal realm.<br/>Use your Polter Sense to discover all the objects you can use.", "metacritic": null, "released": "2024-01-15", "tba": false, "updated": "2024-01-19T05:04:39", "background_image": "https://media.rawg.io/media/screenshots/8eb/8ebf81ffcdc3570ddfab7cb008a484bd.jpg", "website": "http://project.cmi.hr.nl/2023_2024/game_apricot/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Apericot Studio"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Indie"], "publishers": ["Apericot Studio"], "esrb_rating": null}