{"id": 975381, "slug": "no-case-should-remain-unsolved", "name": "No Case Should Remain Unsolved", "name_original": "No Case Should Remain Unsolved", "description": "<strong>\"I remember how surprised I was when I first saw this case. Everyone involved was lying, for one reason or another.\"</strong><br/><br/><strong>#No_Case_Should_Remain_Unsolved</strong> is a detective game where players uncover and piece together memory fragments to solve a long-forgotten case. Follow former police detective Jeon Gyeong as she acquires clues and testimony relating to the case of a missing girl.<br/><br/><h3>#No_Case_Should_Remain_Unsolved</h3>February 5, 2012. A little girl named Seowon is reported missing from a playground. Police launch an investigation and question witnesses and suspects, but Seowon's case is never solved.<br/>Twelve years after Senior Inspector Jeon Gyeong's retirement, she is visited by a young police officer: a woman who pleads with her to reexamine Seowon's case.<br/>But with each uncovered memory, only one thing becomes clear: everyone in Seowon's vicinity was lying.<br/><br/><h3>Features</h3><ul><li>Experience an imaginative reasoning system where players connect memories like pieces of a jigsaw puzzle.<br/></li><li>Uncover passcodes, keys, 54 conversations, and two hidden truths.<br/></li><li>Over the course of a 2-3 hour playthrough, players will learn why Seowon's disappearance is the only case Jeon Gyeong has left unsolved.<br/></li><li>Also featuring an original soundtrack by Seongyi Yi, composer of Legal Dungeon and The Wake!</li></ul>", "metacritic": null, "released": "2024-01-17", "tba": false, "updated": "2024-04-23T16:47:48", "background_image": "https://media.rawg.io/media/screenshots/766/76669775675948b1eb3f3eb1c1dfc7dc.jpg", "website": "https://somigames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 4, "beaten": 2, "toplay": 3}, "playtime": 1, "achievements_count": 9, "ratings_count": 2, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "PC"], "developers": ["Somi"], "genres": ["Adventure", "Indie"], "publishers": ["Somi"], "esrb_rating": null}