{"id": 975348, "slug": "false-dream", "name": "False Dream", "name_original": "False Dream", "description": "You find yourself trapped in a dream. Capture anomalies, meaning locations or phenomena that deviate from reality, with a camera. By doing so, you might be able to return to reality.<h3>How do I play?</h3>Please take a look at the image below. Can you spot any unusual elements? It's a game where you find them and capture a photo with a camera.<br/><h3>Two Modes</h3>There are two modes: Normal Mode and Nightmare Mode. In Normal Mode, an anomaly will always occur at each time. However, in Nightmare Mode, there are instances where no anomaly occurs. You will find themselves wondering whether there are no anomalies present or if they simply haven't been discovered yet. I recommend playing in Normal mode for the first game.<h3>Playtime and content size</h3>The estimated time to clear the normal mode is around 20 minutes to an hour. There will be a total of 81 anomalies occurring (as of the pre-release stage. This number may be subject to change upon release). To capture all the anomalies, it may take several hours.<h3>Save Data</h3>Even if you stop the game midway, the anomalies you've captured are saved. However, please be aware that anomalies discovered using the radio (helping item) are not saved, so please be cautious.<br/><br/>[heading2]If the Game Crashes[/heading2]<br/>It seems that there are cases where the game crashes when starting from the title screen. In such instances, please try updating your graphics card drivers to the latest version. Reports have indicated that this has resolved the issue.<h3>Gameplay Videos and Streaming</h3>Feel free to publish gameplay videos or stream the game without contacting the developer.<h3>Recommended Graphics Settings</h3>Setting the Global Illumination to \"High\" or higher enhances the game's atmosphere thanks to UE5's Lumen feature. However, be aware that this can significantly strain your GPU, potentially resulting in slower performance.<br/><br/>If your FPS (Frames per Second) is low, consider lowering the graphics settings. After starting the game, pause it to see the FPS displayed in the top left corner. The FPS is adjusted in-game to range from 22 to 62.<br/><br/>", "metacritic": null, "released": "2024-01-16", "tba": false, "updated": "2024-01-19T06:03:48", "background_image": "https://media.rawg.io/media/screenshots/768/768d55cc43c7a5d841579e71edfc2c87.jpg", "website": "https://twitter.com/masatokogames", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 2, "achievements_count": 6, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["tenkaigames"], "genres": ["Indie"], "publishers": ["tenkaigames"], "esrb_rating": null}