{"id": 975376, "slug": "mecha-party", "name": "Mecha Party", "name_original": "Mecha Party", "description": "In the 21st century, robotics technology has made tremendous progress, and robots and AI are increasingly appearing in people's daily lives. <br/><br/>Toy companies are keenly aware of the huge potential of these technologies in different markets and introduce them into robot model toys, equipped with the latest VR operating system, allowing users to engage in immersive virtual battles. At the same time, with the help of real players, AI combat models can be trained, with the hope that the business can even be expanded to the military field. The company has established a formal robot battle league - Mecha Party, competing in miniature landscape scenes. Suddenly this sport became popular all over the world, and everyone could show off their skills by driving their favorite mecha in this league. <br/><br/>Players incarnate as mecha enthusiasts, drive a variety of witty hand mechas in the form of VR first person , single or team for strong social MOBA competition , to achieve casual combat refreshing experience through a VR helmet, fighting for the title of the strongest mecha pilot in the league.<h3>  - Happy Moba Competition</h3>    Long-range shooting and melee combat, different mechas have different skill designs.<br/>    Support up to 3V3, Season-based PVP combat.<h3>  - Vr Driving</h3>    Simulates the driving of mecha in VR, the first person control battle.<br/>    Customize cockpit with replaceable cockpit skin.<h3>  - Mecha Collection and Upgrade</h3>    Collect casual and witty mechas, the mecha can change the skin.", "metacritic": null, "released": "2024-01-17", "tba": false, "updated": "2024-01-19T06:42:22", "background_image": "https://media.rawg.io/media/screenshots/53c/53c7687f159d82207f169aedc37e7659.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shanghai Chenni Network Technology Co"], "genres": ["Action", "Adventure", "Simulation", "Casual"], "publishers": ["Kingnet Technology HK"], "esrb_rating": null}