{"id": 975307, "slug": "project-real", "name": "Project Real", "name_original": "Project Real", "description": "<h3>Join the Community</h3>https://discord.gg/NhsbPZ2FfQ]<h3>Serena Island</h3>Discover a world full of possibilities in Project Real, an immersive life simulator. Embark on a journey on Serena Island, where every step you take defines your character's destiny.<br/><br/><br/><br/><strong> Is it a farm game? </strong><br/>Real Project sets itself apart from other life simulators by offering a wide variety of careers and opportunities for you to explore. Become a fishing expert, run your own restaurant, create stunning jewelry - the choice is yours. Your success depends entirely on your choices.<br/><br/><br/>Take part in the exciting seasonal events and festivals that animate Serena Island throughout the year. Celebrate local traditions, join in lively competitions and immerse yourself in unique experiences.<br/><br/><br/><br/><br/>Project Real offers a diverse range of social interactions and relationships, allowing you to discover how each connection will shape your destiny. Every conversation, every action you take will influence the course of your life on the island.<h3>Find valuable resources while exploring</h3><h3>Collecting</h3>Collecting and selling items such as fruit, objects and collected garbage are essential aspects of your progress on Serena Island. These resources play a key role in your initial growth<h3>Your Business!</h3><br/>You will have the opportunity to acquire your own store and carry out customized renovations.<h3>Collect!</h3><br/>Complete the main collections that will help you unravel the mystery of the stars on Serena Island.<h3>Explore the map of Serena Island.</h3><br/><br/><ul><li> Central Beach<br/></li><li> Forest Corner<br/></li><li> Forest of Mists<br/></li><li> Recanto Condominium<br/></li><li> Waterways<br/></li><li> Serene Forest<br/></li><li> Moon Beach</li></ul><h3>Customize your character or your house </h3><br/>On Serena Island, if you want to buy or sell something, you'll need to look for a vendor or a specific store.<br/><br/>https://store.steampowered.com/app/2627600", "metacritic": null, "released": "2024-01-15", "tba": false, "updated": "2024-01-19T05:05:48", "background_image": "https://media.rawg.io/media/screenshots/d7e/d7e1324bd4ed7a3cecaf8cfdd3f26698.jpg", "website": "https://project-real.xsollasitebuilder.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HKGamesStudio"], "genres": ["Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["GoGo Games Interactive"], "esrb_rating": null}