{"id": 975410, "slug": "battle-for-desert-city", "name": "Battle for Desert City", "name_original": "Battle for Desert City", "description": "<strong>Pff, I played 100 Turn-Based Tactics, they EASY! Right?</strong>! <br/>    Your City is under siege and your status is:<br/><br/><ul><li>4 Soldiers against 2 dozen Tanks<br/></li><li>All units have 5 movement points each turn<br/></li><li>All units have 1 action points in each turn</li></ul><ul><li>You must destroy all Tanks and save at least 1 Soldier</li></ul><br/>   You can hear enemy Tanks moving, but you can not see them afar due to no electricity, no light, night time, dust storm. It feels like there is no hope. When you finally able to see enemy Tank near you, make both plan A - attack and plan B - back to save zones. You can hide behind buildings, destroyed Tanks, just know that Tank has same line of sight as your Soldiers. Remember, this is your City, you must take last stand, you must save your citizens.<h3>You sure you can pass level 1 difficulty?</h3><br/>Level 1 Difficulty - IQ 80<br/>Level 1 Difficulty - IQ 100<br/>Level 1 Difficulty  - IQ 120<br/><br/>Game tested by professional Chess player - Failed at level 2, and TBS/TBT player at level 1 when tried for the first time. Challenge begins. No cheating, be honest with yourself.<h3>Technical marvel</h3><br/>    Battle for Desert City supports both latest DLSS 3.5 and FSR 3.0 with Frame Generation. Game also offers ability to run compact 720p, competitive 1080p, best cost-value 1440p and high-end display setups with 4K resolution with 5 scalable visual settings.<br/><br/><h3>P.S.</h3><br/>    Game was fully developed and published by single person from Kazakhstan, hopefully together, with your support, suggestions we will make this game even better, we will get further contents such as new game modes, maps, Multiplayer and more coming up features. Thank your for you support!", "metacritic": null, "released": "2024-01-18", "tba": false, "updated": "2024-01-19T07:23:44", "background_image": "https://media.rawg.io/media/screenshots/725/725eff02065684464f3171d72b8038dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["UF Games"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["UF Games"], "esrb_rating": null}