{"id": 97543, "slug": "teotl", "name": "Teotl", "name_original": "Teotl", "description": "<p>This year, a group of friends did not make it to the Global Game Jam in Warsaw, mainly because of shortage of free space. Instead, they decided to gather in a flat and do the jam there. </p><p>And this happened.</p><p>The theme of the GGJ this year was \"Ritual\", so we did a game about a ritual. It is not complex, but we're proud of it - and we hope that you will have at least a few minutes of fun with that!</p><p>It has an in-game tutorial, but it is rather scarce, so:</p><p>You want to click on goats, running naked people and trees with apples to send Aztecs in order to collect this stuff. When they carry it back, you can click an area with supplies in order to have Aztecs pick this stuff up and line up in a queue. When you do that, you can click a pyramid to send the queue to make a sacrifice.</p><p>Each pyramid prefers a different kind of offerings.</p><p>When you do not satisfy the pyramid's hunger, bad things will happen. However, if you do, one of them gives you a special treat!</p><p>Additionally, and this is important, you can click the chapel (stone building) to have your Aztecs take captives and convert them into workers. And when you click the workers area, they can be sacrificed too, if you really need this.</p><p>Don't worry, be fast, and let the bloodbath begin! Any feedback is welcome!</p><p>Also - this game does not end, you have to assume you lost when all the meters go down to 0 :( And exit via ALT+F4 (Windows)/ CMD+Q (Mac)</p><p>Credits to:</p><p>Monika Jaworska (stunning graphics)</p><p>Anmol Thakur (black magic programming)</p><p>Bartlomiej Ochnio (programming &amp; design)</p><p>Kamil Zygmuntowicz (programming and uplifting mood)</p><p>Piotr Biarda (menus, sounds, animations)</p><p>Radoslaw Smyk (putting stuff up together, smoothing rough edges)</p>", "metacritic": null, "released": "2016-02-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/40d/40d8598ba7ce04ef604b4117f4348eea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["rad.smyk"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}