{"id": 97546, "slug": "destroyer-of-destroyers", "name": "Destroyer of Destroyers", "name_original": "Destroyer of Destroyers", "description": "<p>At the core of the game, you do everything with your thrusters. You use the thrusters to propel you in a direction (or you know... \"move\"), but you also use them to deal damage to enemies and obstacles, and you use them to deflect projectiles and enemies.<br/></p>\n<p>At the same time, I wanted change something that's fundamental in games while still sticking to theme that everything does more than one thing. I started thinking about health in games, and I thought that if instead of being closer to or farther from dying, what if high and low health just changed the way you must play the game, but it results in equally valid play styles? It becomes just a matter of preference how much health you play well with. And so the rage meter was invented. The less \"health\" you have, the more damage you deal, but the slower you move. Once you're healed up, you barely deal any damage, but you move much faster. You can win any scenario with the rage meter anywhere from 0% to 100%.</p>\n<p>Since the player can't die, I had to make the challenge something else than surviving. My solutions was to make many timed events (in the shape of doors slowly closing), and you are chased by very strong enemies that you cannot let catch you. This made the game about speed. I needed a way for high damage to result in high speed, even though you move slower. The obvious answer was explosions.</p>\n<p>All enemies in the game are both opponents that you want to avoid, but also boosters to get you to your goal faster. When you move slower, you deal more damage, and if you place yourself perfectly next to an enemy and blow it up, you can fling yourself like a bullet.</p>\n<p>Regarding the graphics, it started out crap. Like, REALLY looking like crap. At some point while trying out things in Adobe Illustrator, I started playing with hexagons, which was when I realized that I could use the orthographic camera in Unity to make actual cubes become perfectly hexagonal. I then decided to start playing with using hexagons to make \"pixel art\", which sparked my curiosity as to whether or not I could make things for example look soft when built with metallic cubes? Turns out it's possible with animation, overlapping and size variation. I'm very happy with the end result - I managed to create a visual style where there are very sharp contrasts between the soft and the hard, and you don't doubt what you see. Some models could be reworked and animated of course, but hey, I made it in one marathon weekend :)</p>\n<p>As for the music, when the cube-hexagon idea took off I couldn't imagine anything other than sharp crystal-like bell sounds and percussion with tons of detail (all of which came from the excellent ZynAddSubFx synth). I only had time to write 4 bars of music, so that had to do :) For the sound effects to go along, I wanted to hint back to the pixel art era with a twist that I established already with the shiny hexagons. I used bfxr to make basic sounds that I then edited to fit my needs better. My favourite part is how the sounds leading up to spawning something is the reverse, stretched out version of the sound that's played when the spawned object awakes.</p>\n<p>Now I'm writing too much. If you read this far, thanks for showing interest! Please write me an e-mail or something if you're at all interested. I'd love to hear your feedback or just thoughts :)</p>\n<p>Note added the day after: To put it in other words I wanted to create a balance where you can use high rage to clear out a room full of dangerous enemies, but you'll be hard pressed to make it to the goal on time, or you can use the low rage to quickly dash around and try to dodge them.<br/></p>\n<p><strong>THINGS THAT DO MORE THAN ONE THING (That I can think of at the moment)</strong></p>\n<p>Thrusters: Propel you. Deal damage. Deflect object.<br/>Take damage: Increase \"rage\", which makes your thrusters deal more damage, but propel you slower.<br/>Heal: Decreases \"rage\", does the opposite of taking damage.<br/>Enemies: Try to stop you, but explode when they die, which you can use to boost yourself to go even faster.<br/></p>\n<p><strong>CREDITS</strong></p>\n<p>This game was made solo by Anton Lejon (which just so happens to be me). I did get my girlfriend to spend a few minutes touching up the background. Thank you! &lt;3<br/></p>", "metacritic": null, "released": "2017-07-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3f2/3f232a97e85024676ebb9a6770e5a0e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["little-burrito"], "genres": ["Action"], "publishers": [], "esrb_rating": null}