{"id": 975499, "slug": "kona-snowrabbit", "name": "Kona & Snowrabbit", "name_original": "Kona & Snowrabbit", "description": "Kona, an ice artist with a reputation for mischief, and Snow Rabbit, a snow-white rabbit.<br/>After hearing rumors of the mermaid god Aquis, the two young artists set out to create the ultimate ice sculpture of the mermaid god and to break into the monastery of the mermaid god, known as the \"sea on land\".<br/><br/>Quarter-view casual \"frozen\" shooting action with a twist on the arcade genre.<br/><br/><ul><li> <strong>Cool 'Frozen' action</strong></li></ul>Frozen Action Is A Must to Defeat Enemies!<br/>Your snobbish but reliable partner, Snow Rabbit, has the ability to freeze enemies by firing ice bullets.<br/>Once frozen, you can freeze them a second time to break them, or smash them with your hammer to send them flying!<br/><br/><ul><li> <strong>Nostalgic arcade gameplay</strong></li></ul>We've included all the \"yummy\" elements of the arcade genre!<br/>Intuitive controls with the attack button to attack and the dash button to dash,<br/>Stage-by-stage progression through rooms filled with menacing enemies,<br/>And an item that gives you access to a powerful attack for a brief moment!<br/><br/><ul><li> <strong>Personalized Comedic Elements</strong></li></ul>Rabbit with ice coming out of its mouth is used as weapon and the rabbit turns into hammer,<br/>Enemies get frozen in the air and sink underwater, the protagonist is a villain who makes his enemies suffer...<br/>Enjoy the humorous atmosphere of this game with its comedic elements!", "metacritic": null, "released": "2024-01-19", "tba": false, "updated": "2024-01-22T06:17:53", "background_image": "https://media.rawg.io/media/screenshots/5b5/5b5f556aab1e8a8f1edb553e12c76e07.jpg", "website": "https://ckchronicle.com/chronicle/project/%eb%88%88%ed%86%a0%eb%81%bc%eb%8b%a8/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Team Snowrabbit"], "genres": ["Action", "Casual", "Indie"], "publishers": ["ChungKang College of Cultural Industries"], "esrb_rating": null}