{"id": 97550, "slug": "kill-the-superweapon-itch", "name": "Kill the Superweapon (itch)", "name_original": "Kill the Superweapon (itch)", "description": "<p><strong>Kill the Superweapon</strong> is a 3D Twin-Stick Action game. The game uses a <strong>diorama-style perspective</strong>, allowing for twin-stick shooting, jumping, and 3D environments.<br/><br/>In each of the game's levels, you must navigate a facility housing one of the bio-mehcnaically modified super-soldiers known as <strong>Superweapons</strong>. You must search the facilities to find special ammunition that will let you take down the Superweapon. However, the Superweapons are not content to just wait around for you. They will <strong>roam from room to room</strong> in pursuit of the player.<br/></p>\r\nStory\r\n<p><strong>Samantha Kill</strong> is on a mission to take down the weapons manufacturer <strong>Abaddon Inc.</strong> They are developing a series of Superweapons, bio-mechanically altered Supersoldiers who will be the weapons of the future. They plan to bring about World War III, and sell their Superweapons to all sides. Samantha Kill is armed with the <strong>Total Ablation Beam</strong>, an experimental weapon stolen from Abaddon Inc., and the only thing which can harm the Superweapons. She must break into Abaddon's labs, find batteries to charge up the beam, and take out the Superweapons. But, be warned, the Superweapons are not content to wait around for Samantha to find them. They'll roam the level in pursuit of our hero.</p><p>Kill the Superweapon is also available on Steam: http://store.steampowered.com/app/758070/Kill_the_Superweapon/<br/></p>", "metacritic": null, "released": "2018-03-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ba6/ba6dc6b19f5643dfcfe4be5b5e0c537e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Tales of the Renegade Sector"], "genres": ["Action"], "publishers": [], "esrb_rating": null}