{"id": 975521, "slug": "once-upon-a-dungeon-ii", "name": "Once upon a Dungeon II", "name_original": "Once upon a Dungeon II", "description": "<h3>Introduction</h3>I thought I had fulfilled my duty - the dungeon cleared, the head of the Fallen One delivered to the king's court. Clearly I must have overlooked some evil minions. Moreover, while escaping,  they took the Slavic Gods statues with them, the master controlling them, thus becoming powerful foes. Now I have been blamed for the evil spreading throughout the country and am forced to sort it out. It's gonna be tough ...<h3>Gameplay</h3>Once upon a Dungeon II is a traditional roguelike game with a scent of Slavic mythology.<br/>Dive into adventure mode by talking to NPCs, obtaining quests, progressing through the open world and dungeons. Help king forces to defeat protectors of the old faith or rather take the opposite side.<br/>Dungeon crawling fans can just focus on exploration and fighting, the game is not forcing quests.<br/><br/><h3>Features</h3><ul><li> turn-based, loot/hack oriented<br/></li><li> large, seamless, hand-crafted, outer world featuring random layout. Travel it on foot, or using teleports.<br/></li><li> Slavic gods present as scrolls and statues. Statues have dual nature: they are equipment items and participate in game play (have their own turn)<br/></li><li> many procedurally generated dungeons to explore<br/></li><li> tons of various loot<br/></li><li> advanced fight system - use melee or projectiles. Experience different effects (bleeding, freezing, stunning), learn to recover from them<br/></li><li> different monsters (ordinary, champions, bosses)<br/></li><li> different kinds of surfaces: ground, water, oil, lava<br/></li><li> passive and active abilities<br/></li><li> inventory/trade mechanics<br/></li><li> ally mechanics, it: gains experience, levels up, can heal self, uses equipment exactly as the main hero does<br/></li><li> dialog/quest system with full voice acting <br/></li><li> crafting system - enhance equipment, one item made better by merging two items together, craft potions and much more<br/></li><li> cut scenes at game's milestone events<br/></li><li> customizable controls</li></ul>", "metacritic": null, "released": "2024-01-19", "tba": false, "updated": "2024-01-22T06:54:19", "background_image": "https://media.rawg.io/media/screenshots/f00/f00484c8f608afd335a73643469a73d0.jpg", "website": "http://kotogames.com/OuaDII/index.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 278, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Koto Games"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Koto Games"], "esrb_rating": null}