{"id": 975621, "slug": "the-street-10", "name": "The Street 10", "name_original": "The Street 10", "description": "Caught in an infinite alley, look for Street 10 to find your way out.<br/><br/>You find yourself on \"Street 10,\" a mysterious segment of Tokyo's urban streets.<br/>Your mission: observe every detail around you.<br/>If something unusual catches your attention, be alert and change your path.<br/><br/><strong>Your Goal: to Find An Exit On Street 10.</strong><br/><br/>\"The Street 10\" is a walking simulator set against the backdrop of Tokyo's street landscape, where the mundane intertwines with the unusual. Noticing oddities is your key to uncovering the elusive Exit 10.<br/><br/>Leaderboards track those who have skillfully navigated the complexities of Tokyo's streets, adding a competitive edge.<h3>Play Time</h3>10-90 minutes<h3>Clarification</h3>When you play this game, you feel a liminal terror, everything happens late at night, with only the sounds of crickets audible. There are no screamers in this game, but sometimes the street frightens with its unpredictability. If you're a city dweller, you might have noticed strange and anomalous things happening in real life, feeling like you're the only one noticing them. Experience the fear of the unknown and the abnormal. But try to break out of this loop.<h3>Walkthrough</h3>Pay attention to the numbers on the traffic light; they will show you how far you've progressed in the game.<h3>Options</h3><ul><li>Control camera movement and sensitivity<br/></li><li>V-Sync<br/></li><li>Leaderboard showing players who have found the most anomalies</li></ul>", "metacritic": null, "released": "2024-01-22", "tba": false, "updated": "2024-01-26T06:21:54", "background_image": "https://media.rawg.io/media/screenshots/3a8/3a80713dbf935fc83786ca69eb78921e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RandomSpin"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["RandomSpin"], "esrb_rating": null}