{"id": 975654, "slug": "disaster-golf", "name": "Disaster Golf", "name_original": "Disaster Golf", "description": "It’s a beautiful day outside. The hippos are screaming, the dinosaurs are dying, and all you want to do is play some miniature golf. You forgot your clubs, but that’s okay. Mother Nature has you covered.  <br/><br/>Send meteors to fling your golf ball into the air or trigger earthquakes to surge the ball forward - anything to get that sweet par.<h3>Key Features:</h3><br/><strong>Fast-paced golf!</strong> No need to wait for your ball to stop moving - hit it again as soon as you can. Disaster Golf is all about speed and getting the ball into the hole as fast as possible using any means available. Combine your natural disasters to get the fastest time!<br/><br/><br/><strong>Leaderboards and replays!</strong> See how your times stack up on each level using our leaderboards! Want to improve your times? Activate the ghost ball to see exactly how they got that speedy world record time, or compare against the world record or your personal best time in race mode!<br/><br/><br/><strong>Multiple level themes!</strong> Golf across biomes! Use meteors in the sand of a beach, suck the ball into a jungle singularity, or shoot it into the sky on a geyser of lava. Explore the beautiful worlds of Disaster Golf!<br/><br/><br/><strong>Challenge mode!</strong> Tired of choosing your own disasters? Let us do that for you. Replay any level in its challenge mode using carefully selected, preset disasters to bring about a unique way of playing. Each challenge mode variant of a level has its own leaderboard - can you devise the best strategy with the disasters you're given and take the top spot?<br/><br/><br/><strong>Hippos!</strong> Hippos here, hippos there, hippos everywhere! Looking to follow Fred's noble quest to overthrow the evil hippo god? Just here for the golf? We've got you covered either way.<br/><br/><br/>Early development by Bradley University's game design undergraduate class of 2022.", "metacritic": null, "released": "2024-01-22", "tba": false, "updated": "2024-01-26T07:05:30", "background_image": "https://media.rawg.io/media/screenshots/43a/43ae73b34b79bb92029d3ed73f97a921.jpg", "website": "https://hippohavoc.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Hippo Havoc"], "genres": ["Sports", "Racing"], "publishers": ["VoxPop Games"], "esrb_rating": null}