{"id": 975657, "slug": "thanatos-2024", "name": "THANATOS (2024)", "name_original": "THANATOS (2024)", "description": "In a chilling moment, your phone rings with an anonymous caller saying they are about to take their own life. Faced with this critical situation, what will you do? Will you embark on a mission to rescue them from the depths of despair? Move quickly because time is running out.<br/><br/><ul><strong>IMMERSIVE EXPERIENCE</strong></ul><ul>Semi-realistic graphics, minimal user interfaces, and a creepy ambience work together to create an immersive experience.</ul><br/><ul><strong>SOLVE PUZZLES</strong></ul><ul>Puzzles and clues serve as gateways to uncover the hidden truth. Whether deciphering cryptic messages or navigating surreal mindscapes, every puzzle is designed to be mentally stimulating and integral to the progression of the narrative.</ul><br/><ul><strong>UNIQUE LEVELS</strong></ul><ul>Embark on a journey across three different floors, each with increasing difficulty. To complete each floor, you must unlock the stairway exit and enter it. Each floor features new puzzles, clues, and sounds that will help you reach your final destination to save a life.</ul><br/><ul><strong>RANDOMIZED JUMPSCARES</strong></ul><ul>This element of surprise ensures that no two playthroughs are ever the same. Brace yourself for the unexpected as every corner turned and every dark corridor becomes a potential breeding ground for heart-pounding moments.</ul><br/><ul><strong>DISTURBING SOUNDTRACK</strong></ul><ul>With a haunting musical score and meticulously designed sound effects that intensify the atmosphere, the soundscape will create a sense of dread and unease, ensuring you that you will remain on the edge of your seat</ul>", "metacritic": null, "released": "2024-01-23", "tba": false, "updated": "2024-01-26T07:09:01", "background_image": "https://media.rawg.io/media/screenshots/d0a/d0a10c379f22a3f59aaeb79321856ebe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Angela Nguyen", "Megan Yeh"], "genres": ["Adventure"], "publishers": ["WahooCat Productions"], "esrb_rating": null}