{"id": 975639, "slug": "red-glare", "name": "Red Glare", "name_original": "Red Glare", "description": "Red Glare is a WW2 real-time tactics game where you play agents of the OSS, the precursor to the CIA, combating a secret German expedition in South America. With five well balanced characters and a story campaign playing out across a continent with jungle, desert, and snow maps, this game will revive your old-school memories of real-time tactics.<br/><h3>KEY FEATURES</h3><ul><li>Dynamic Day/Night cycles in each map, giving new scenarios in the same missions. Nighttime makes for easier sneaking as enemies’ view cones become shorter except Enemies with flash lights and enemy snipers. Enemies can not see footprints at Night.<br/></li><li>Dynamic weather system, such as rain reducing the noise of guns.<br/></li><li>In addition to the story campaign, the Challenges section will offer continually added maps.<br/></li><li>Enemies can detect blood trails left by moving bodies killed by knife or gun shots, so players will have to be creative with takedowns, such as poison syringe and wire kills do not cause enemy to bleed.<br/></li><li>Wide variety of enemies, including Tanks, Dogs, and Snipers.<br/></li><li>Optimized huge maps filled with more than 200 enemies,  more than ever seen in a real-time tactics game.<br/></li><li>And many more gameplay details.</li></ul><br/>I am a Solo game developer and a fan of real time tactics genre so i combined all the ideas of old classic and modern games and mixed them with my own ideas to make a perfect real time tactics game.", "metacritic": null, "released": "2024-01-24", "tba": false, "updated": "2024-01-26T06:43:59", "background_image": "https://media.rawg.io/media/screenshots/b91/b916e90723d08a1db0248956be387d29.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 275, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BT Studios"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["BT Studios"], "esrb_rating": null}