{"id": 975613, "slug": "brownies-haunted-christmas", "name": "Brownie's Haunted Christmas", "name_original": "Brownie's Haunted Christmas", "description": "<strong>Step into a whimsical world where Christmas cheer meets spine-tingling thrills in 'Brownie's Haunted Christmas'! Immerse yourself in a first-person perspective adorned with vibrant and cozy graphics, blending the warmth of holiday hues with a touch of eerie delight. As you take control of Brownie, an aspiring chef determined to turn his barren house into a festive haven, you'll embark on a heartwarming yet haunting adventure.</strong><h3>Key Gameplay Points:</h3><h3>1. First Person Perspective:</h3><br/><strong>Experience the festive festivities up close and personal with a captivating first-person viewpoint. Get lost in the immersive world of 'Brownie's Haunted Christmas,' where every stirring moment feels like your own.</strong><h3>2. Colorful and Cozy Graphics:</h3><br/><strong>Delight in a visual feast as charming, colorful graphics bring the holiday spirit to life. The cozy ambiance creates the perfect backdrop for your culinary escapades and ghostly encounters.</strong><h3>3. Cooking Delicious Cookies:</h3><br/><strong>Dive into the heart of the game by crafting delicious Christmas cookies. Feel the joy of mixing, baking, and decorating your culinary creations, each step bringing you closer to transforming Brownie's house into a festive masterpiece.</strong><h3>4. Earn Coins for Decorations:</h3><br/><strong>Every delectable cookie brings you one step closer to transforming Brownie's once-barren abode. Earn coins through your culinary efforts, and use them to unlock a variety of decorations, upgrades, and ingredients from the in-game shop.</strong><h3>5. Shop for Ingredients and Upgrades:</h3><br/><strong>Explore the charming shop owned by a friendly gnome, your go-to destination for essential ingredients, helpful upgrades, and delightful decorations. Choose wisely to enhance your cooking skills and create a warm and inviting Christmas home.</strong><h3>6. Transform Brownie's Haunted House:</h3><br/><strong>Witness the magical evolution of Brownie's haunted house as you infuse it with the holiday spirit. From a stark and empty dwelling, watch it blossom into a cozy Christmas haven that mirrors the warmth of your culinary achievements.<br/>Indulge in the perfect blend of holiday cheer and ghostly charm as you create lasting memories in 'Brownie's Haunted Christmas.' Are you ready to cook and turn a spooky tale into a heartwarming holiday adventure?</strong>", "metacritic": null, "released": "2024-01-22", "tba": false, "updated": "2024-01-26T06:12:10", "background_image": "https://media.rawg.io/media/screenshots/9af/9afb16e655064f0521aa25756d936e07.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 420, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ricardo Pratas"], "genres": ["Casual", "Indie"], "publishers": ["Ricardo Pratas"], "esrb_rating": null}