{"id": 975722, "slug": "saga-of-the-moon-priestess-2", "name": "Saga of the Moon Priestess", "name_original": "Saga of the Moon Priestess", "description": "<h3>Explore a mystical world in classic top-down style and save the kidnapped prince!</h3><br/><br/>Tragedy strikes the world of Lunaria as the illustrious prince is kidnapped by an unknown assailant! The well-being of the land itself now rests in the hands of a young hero, Sarissa, as she has to fight, explore and figure out how to rescue the young prince. Armed with nothing but her trusty spear and the miraculous ability to communicate with the Goddess of the Moon, she must overcome treacherous enemies and dark dungeons.<br/><br/>Saga of the Moon Priestess is a retro top-down action-adventure inspired by 8-bit and 16-bit classics. Featuring crisp pixel art and original sounds and music, Saga of the Moon Priestess invokes a simpler era of the action-adventure genre. With 5 dungeons to explore, 7 life containers, 15 items to collect and countless enemies to defeat, the world of Lunaria is a land lush with things to do, secrets to find and people to talk to.<br/><br/><br/><br/><strong>Features:</strong><br/><br/><ul><li>Embark on an old-school action adventure through the world of Lunaria!<br/></li><li>Guide a young hero named Sarissa as she searches for a kidnapped prince.<br/></li><li>Wield a spear and fight to gain new abilities as you explore forests, grasslands, dungeons and more!<br/></li><li>Manage gear, collect health upgrades and discover useful tools.<br/></li><li>Pick up rocks as improvised weapons and use other parts of the environment to your advantage!</li></ul><br/><br/><br/>", "metacritic": null, "released": "2024-01-24", "tba": false, "updated": "2024-01-26T08:44:31", "background_image": "https://media.rawg.io/media/screenshots/b64/b64767bf6f896b4f93766d45e401b27c.jpg", "website": "https://www.eastasiasoft.com/games/Saga-of-the-Moon-Priestess", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 302, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EastAsiaSoft", "Pixel Trash"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["eastasiasoft"], "esrb_rating": null}