{"id": 975728, "slug": "roots-of-yggdrasil-2", "name": "Roots of Yggdrasil", "name_original": "Roots of Yggdrasil", "description": "Ragnarok is here. Stuck in a perpetual time loop, Sunna and her tribe of Vikings must explore a fractured World Tree and attempt to reach the top of Yggdrasil.<br/><br/><br/>Create settlements, build your deck and collect artifacts as you explore the nine realms of Norse Mythology in search of answers in this roguelike city-building game. Can you overcome and survive the new dangers of this broken world?<br/><br/><br/><br/><br/>Players’ settlements will constantly be in a race against time to avoid the Ginnungagap. Each failure will bring them back to the beginning of their adventure, where they can start anew with more knowledge and a better mastery of the game mechanics.<br/><br/><br/><br/><br/>The Holt is your permanent, customizable home and acts as the main hub of the game. Unlock new mechanics and permanent upgrades that will help you rebuild your tribe!<br/><br/><br/><br/><br/>Befriend a diverse cast of Scions that will bring unique playstyles, bonus and modifiers to each loop. <br/><br/><br/><br/><br/>Procedurally generated islands, encounters, and events will punctuate your experience, guaranteeing that no two expeditions are the same! Before each run, add and remove building cards to your deck to create different challenges and opportunities each time.<br/><br/><h3>Key features</h3><ul><li>A roguelike city-builder experience where each run matters: gather resources, upgrade your deck, and progress further each time to reach the top of Yggdrasil!</li></ul><ul><li>A colorful cast of diverse characters including deities, heroes, scions and other beasts inspired by Norse mythology</li></ul><ul><li>Multiple Biomes to explore</li></ul><ul><li>A unique drafting/deckbuilding hybrid system that changes which buildings are available during each loop</li></ul><ul><li>A customizable hub called the Holt, where you can unlock permanent upgrades to help you on your subsequent runs and change the experience</li></ul>", "metacritic": null, "released": "2024-01-24", "tba": false, "updated": "2024-04-22T21:10:36", "background_image": "https://media.rawg.io/media/screenshots/f46/f4654f18f4621bdb418fda0d27b6c49f.jpg", "website": "https://twitter.com/WeAreManaVoid", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 6, "ratings_count": 1, "suggestions_count": 362, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["ManaVoid Entertainment"], "genres": ["Strategy", "Indie"], "publishers": ["ManaVoid Entertainment", "Indie Asylum"], "esrb_rating": null}