{"id": 97579, "slug": "relapse", "name": "Relapse (itch)", "name_original": "Relapse (itch)", "description": "Welcome to Arcadia<br/><p>Welcome to Arcadia Asylum! A psychological thriller and puzzle game. Relapse into madness and download the demo today, we've kept the best content inside.</p><p>Relapse is a genre mash up of two beloved gaming genres, horror and puzzle adventure games! Using research on the psychology of fear to play with your emotions. </p><p>Inspired by games like Amnesia and Grim Fandango. Solve puzzles to escape the now abandoned asylum and fight for your life against Dirk, your somewhat persistent stalker. Will you make it out or become another victim?</p>Story<p>You visit the asylum as an urban blogger when you are captured by Dirk- a psychopath who locks you inside and wants to play hide and seek. As he intends to carve you up with a machete if he finds you, you need to find a way to escape. Dirk knows the asylum like the back of his hand and can hear you – so you need to be on the top of your game if you're going to survive.</p>The History<p>The asylum and grounds are like a small city, with everything it needed to house over a thousand patients. It finally closed down in 1987, with all patients being released into Care In the Community. Not all patients coped with the new freedoms and some stopped taking medication necessary to keep them calm.</p><p>The game has all the immersion and shocks of a horror game along with the puzzles of an old school adventure game which you need to solve to escape.</p>Features<br/><ul><li>A first person horror adventure game</li><li>Immersive experience, stunning graphics and realistic ambient soundtrack </li><li>Puzzle solving with a choice of modes for players who don't want the puzzles to be too taxing </li><li>Thoroughly researched to make the game as realistic as possible</li><li>A full back story to explore, learn what life was like in a UK Victorian Insane Asylum</li></ul><br/>", "metacritic": null, "released": "2016-02-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8e4/8e4935a3bd81639d736b5570ba6da595.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BlueprintGames"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}