{"id": 97571, "slug": "donkey-kong-advanced", "name": "Donkey Kong Advanced", "name_original": "Donkey Kong Advanced", "description": "<p>A remake of the classic arcade game. This is not a rom hack. It's meant to be more difficult than the original giving players new levels and new challenges. I've tried to study the original as close as I can to maintain the same feel, but added new elements and challenges. Even though it can be played on your PC, it's meant to be played in people's mame arcade cabinets. </p>\n<p><strong>If you ever put this game in your cabinet, send me a screenshot or video and I will post it here!</strong><br/></p>\n<p><strong>[Bug Reports]</strong> Contact me at justinbohemier@gmail.com if you find a bug. Please try to be as detailed as possible and include system specs and your configuration settings</p>\n<p><strong>[Gamepad support]</strong>\n</p>\n<p>The game doesn't support joysticks by itself, but you can use programs like JoyToKey or Xpadder to map out joystick presses to keyboard keys.</p>\n<p><strong>[Current Version: 1.1.0]</strong><br/></p>\n<p>[Latest Updates]</p>\n<p>-Added an attract screen demo<br/>-Fixed Rendering bug which made the aspect incorrect in full-screen mode when rotated on certain monitors<br/>-Fixed key-mapping issues<br/>-New Render options in the config app for more screen control.<br/>-Fixed Heart bonus item bug. If you were on your last life and you got the heart and died without completing the level, it wouldn't be there in level 1 if you started a new game.<br/>-Added 16-bit support for older video cards<br/>-Added the option in the config tool to manually enter a specific resolution.<br/>-I included a tool to map out keyboard keys if you're using a joystick.</p>\n<p><strong>[Changes from the original]</strong><br/>-Obviously the levels look different, some completely new, and others have the same level structure with some differences<br/>-New switch, laser, and key system to save Pauline.<br/>-Mario can jump off high platforms and land without killing himself(c'mon, he's mario)<br/>-New heart bonus items are worth 2000 points but are tricky to get.<br/>-No intro scene, I might add one though.<br/>-Barrels rebound off the floor higher than before<br/>-Hitting barrels with the hammer doesn't pause the game during the explosion<br/>-Level 4 is icy, with a shoe item you can get that makes it not slipery<br/>-and some other stuff</p>\n<p><strong>[Possible Future Changes]</strong><br/>-More levels. I'm tempted to have 1 long game that doesn't repeat. Instead of repeating every 4 levels, you might have 12 levels with an actual end to the game.<br/>-Bonus level if you collect all the hearts.<br/>-Intro to the game when you push start.<br/>-Cut scenes</p>", "metacritic": null, "released": "2017-02-18", "tba": false, "updated": "2019-08-28T23:25:28", "background_image": "https://media.rawg.io/media/screenshots/c75/c75234c4356eba1cef638af16c92118f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 303, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ophelius"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}