{"id": 975782, "slug": "lovexlust", "name": "LoveXLust", "name_original": "LoveXLust", "description": "<strong>Explore Your Fantasies with Beautiful Companions!</strong><br/><br/>In the mesmerizing world of LoveXLust, you're free to choose from an array of stunning companions who possess unique personalities and alluring bodies. Each character is meticulously crafted to cater to your every desire, ensuring that no matter which one you select, she will leave you breathless with pleasure. From the sultry seductress to the playful tease. Immerse yourself in their world and experience intimate encounters!<br/><br/><br/><strong>A Treasure Trove of Sex Toys!</strong><br/><br/>Unlock your deepest pleasures with our vast collection of customizable sex toys. With an assortment of classic vibrators, dildos, strap-ons, and more, you're sure to find the perfect tool for unleashing your wildest fantasies. These sex toys will take your companions pleasure to new heights.<br/><br/><br/><strong>Explore the World in Style!</strong><br/><br/>Embark on a sensual journey through various locations that cater to every desire and fantasy imaginable. From the cozy comfort of an onsen to the wild indulgence of a party van LoveXLust offers variety of possibilities for your erotic escapades. Experience intimate encounters in any position you desire thanks to our library of positions, ensuring that no two experiences are ever alike.<br/><br/><strong>Control Your Desires with Intuitive Gameplay!</strong><br/><br/>With intuitive controls designed for players of all skill levels, navigating LovexLust is a breeze. Experiment with different locations and sex positions for an unforgettable experience that caters to every kink and fantasy imaginable! So what are you waiting for? Dive into LoveXLust today and explore the depths of your own desires like never before!", "metacritic": null, "released": "2024-01-25", "tba": false, "updated": "2024-01-26T10:11:11", "background_image": "https://media.rawg.io/media/screenshots/bc9/bc96c2050f47a17d8e1e8973f64879e6.jpg", "website": "https://lovexlust.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 323, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ctm"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["CTM"], "esrb_rating": null}