{"id": 975754, "slug": "atelier-resleriana-forgotten-alchemy-and-the-polar", "name": "Atelier Resleriana: Forgotten Alchemy and the Polar Night Liberator", "name_original": "Atelier Resleriana: Forgotten Alchemy and the Polar Night Liberator", "description": "<h3>Atelier Resleriana: Forgotten Alchemy and the Polar Night Liberator</h3>Long ago, the kingdom of Lantarna prospered from the blessings of a white comet that passed overhead. The art of harnessing the comet's blessings was called alchemy, and the practitioners of this art were known as alchemists.<br/>However, when the comet disappeared and its blessings were no longer available, the use of alchemy gradually declined and was eventually forgotten.<br/><br/>Many years have passed, and in a corner of Lantarna two girls have a fateful meeting.<br/>One is Resna, who has found hope in alchemy and is on her way to the Capital, aiming to travel to the World’s End where the source of the miracle is said to lie.<br/>The other is Valeria, a girl who has lost her memories and now lives in the city while doing rough work as an adventurer for the Moonlight Society.<br/><br/>Behind them looms the shadow of the group known as the Polar Night Alchemists, a dark organization shrouded in mystery.<br/>With different motives and ambitions intertwined, the two eventually come closer to the truth that lies dormant on the continent.<h3>GAME SYSTEM</h3><strong>New Adventures with a New Protagonist</strong><br/>An epic adventure with a new protagonist, the first one in four years since the release of “Atelier Ryza.” Embark on this adventure to revive alchemy with a cast of charming characters!<br/><br/><strong>High-Quality 3D Characters in Action</strong><br/>The latest technology developed for the Atelier series has been used to create 3D graphics equivalent to the latest console titles. Enjoy this cinematic story filled with beautiful high-quality characters!<br/><br/><strong>A Tactical, Timeline-Based Battle System</strong><br/>Simple timeline-style command battles and dynamic skill visuals make for a fun and entertaining battle experience. The \"Effects Panel\" has a variety of effects that can be used to build a strategy to gain an advantage in battles!<br/><br/><strong>An Easy-to-Use, Yet Profound Synthesis System</strong><br/>The synthesis system, a signature feature of the Atelier series, is optimized for easy and rewarding play. Combine the traits assigned to the characters and materials to create your optimal solution!<br/><br/><strong>A System to Upgrade All Characters</strong><br/>Characters can be enhanced in a variety of ways, such as by using items and equipment created through synthesis, and the Growboards, which increase character parameters. Build the strongest and best party, then embark on an alchemical adventure!<h3>STAFF</h3><strong>[Original Story, Series Composition, Scenario Supervisor]</strong><br/>　　TAKAHIRO (Representative works: \"YUKI YUNA IS A HERO\" series, \"Chained Soldier,\" and more)<br/><br/><strong>[Atelier Series Supervisor]</strong><br/>　　Shinichi Yoshiike<br/><br/><strong>[Character Designers]</strong><br/>　　Umiu Geso/tokki/NOCO<br/><br/><strong>[Theme song/Insert Song Vocalist]</strong><br/>　　reche<br/>　　Haruka Shimotsuki<br/>　　Celeina Ann<br/>　　Rico Sasaki<br/>　　SAK.<br/>　　…and more<br/><br/><strong>[Development and Operation]</strong><br/>　　KOEI TECMO GAMES CO., LTD.<br/>　　Akatsuki Games Inc.<br/><br/>※This application is targeted at users age 16 and above.", "metacritic": null, "released": "2024-01-24", "tba": false, "updated": "2024-02-04T16:01:04", "background_image": "https://media.rawg.io/media/screenshots/c02/c0250748d0f759b3d2f00ca203f49b76.jpg", "website": "https://resleriana.atelier.games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 21, "toplay": 5, "dropped": 1, "playing": 1}, "playtime": 7, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 462, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Koei Tecmo", "Akatsuki Games"], "genres": ["Adventure", "RPG", "Casual"], "publishers": ["Koei Tecmo Games"], "esrb_rating": "Mature"}