{"id": 975794, "slug": "tales-from-candleforth", "name": "Tales from Candleforth", "name_original": "Tales from Candleforth", "description": "\nTales from Candleforth is a collection of fairy tales that were written on top of a forbidden book many years ago to hide its content. Years later, the dark text is bleeding out and onto the pages of the tales, mixing with them and twisting the stories. \n<br/>\n<br/>\n<br/>\nThe tale is about to begin...\n<br/>\nIn this first tale we'll meet Sarah, a 16 year old girl that's left alone to run the family apothecary. Sarah's grandmother went missing a while ago, but one day, she finds clues that she might still be alive. As Sarah discovers new powers that only the women in her family can inherit, she adventures into a world of occultism, mystery and horror to uncover the secrets her family is hiding and discover the part she plays in all of it. \n<br/>\n<br/>\nGo along with Sarah on this trip through madness and unravel the mysteries hiding behind the surface of Candleforth. Solve challenging puzzles and interact with a mysterious world to reveal the darkness of this twisted tale.\n<br/>\n<br/>\n<br/>Features<br/><ul><li>2D Hand draw aesthetic \n<br/>\nDiscover a world brimming with detail, fully drawn and animated by hand.\n<br/>\n</li><li>Folk horror\n<br/>\nSome tales from Candleforth have been written over an old antique book. But it seems that whatever was written in it before is now being revealed, mixing the world of nightmares with the real one...\n<br/>\n</li><li>Point &amp; Click.\n<br/>\nA narrative adventure full of puzzles and mysterious stories, where anything can happen.\n<br/>\n</li></ul><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2024-01-26T10:31:52", "background_image": "https://media.rawg.io/media/screenshots/421/4212da760c62ad1c934489d69671de71.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Under The Bed Games"], "genres": [], "publishers": ["Feardemic"], "esrb_rating": null}