{"id": 975790, "slug": "core-devourer", "name": "Core Devourer", "name_original": "Core Devourer", "description": "Core Devourer is a sci-fi action-packed roguelite where you hunt down huge hordes of droids and absorb their cores to become the strongest cybernetic being on the planet. In this game, you unlock weapons with unique effects, craft powerful gear and create endless combinations of upgrades for your character. Explore the procedural environment and discover the secrets of this apocalyptic world.<br/>Make your choice and break the game.<br/><br/><br/>Each weapon is unique and has special features. Choose from hundreds of unique upgrades and create game-breaking builds.<br/><br/><br/>Destroy huge hordes of droids that want to absorb your powerful core and fight bosses with unique patterns!<br/><br/><br/>Complete achievements and farm resources by exploring the map, killing enemies and absorbing the cores of defeated bosses to unlock and craft new weapons, power-ups and gear for your character.<br/><br/>https://store.steampowered.com/app/2199060/Core_Devourer/<h3>FEATURES</h3><ul><li><strong>UNIQUE WEAPONS.</strong> Choose from a huge selection of weapons with unique powers.<br/></li><li><strong>PROCEDURAL MAPS.</strong> Explore the diverse and procedural world of Core Devourer.<br/></li><li><strong>ENDLESS POWER-UPS.</strong> Try out every power-up and their infinite combinations. Find the best game-breaking builds.<br/></li><li><strong>SATISFYING PROGRESS.</strong> Upgrade your character with gear and augmentations.</li></ul>", "metacritic": null, "released": "2024-01-25", "tba": false, "updated": "2024-01-26T10:24:18", "background_image": "https://media.rawg.io/media/screenshots/50f/50f8320c44fdd48cd253330ea6b35090.jpg", "website": "https://www.hubberstudios.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 58, "ratings_count": 0, "suggestions_count": 386, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hubber Studios"], "genres": ["Action", "Indie"], "publishers": ["Hawthorn Games", "Hubber Studios"], "esrb_rating": null}