{"id": 975737, "slug": "fractal-glide", "name": "Fractal Glide", "name_original": "Fractal Glide", "description": "Welcome to the captivating world of Fractal Glide, where exploration meets artistry in a symphony of mathematical beauty.<h3>Inspiration</h3>Fractal Glide was born from a deep appreciation for fractals — those infinitely complex, self-replicating patterns found throughout nature and mathematics. These mesmerizing forms have captivated scientists, artists, and dreamers for generations. They offer a glimpse into the hidden order of the universe, a place where mathematics and art intertwine.<h3>The Journey Begins</h3>In Fractal Glide, you take on the role of an intrepid robot explorer navigating a universe of fractal landscapes. As you glide through these extraordinary realms, you'll collect points, make breathtaking discoveries, and witness the sheer beauty of fractals coming to life. But, be careful not to crash!<h3>Features</h3><br/><ul><li>Diverse Fractal Worlds: Immerse yourself in a variety of stunning fractal environments, each with its unique character and challenges.<br/></li><li>Points and Progression: Collect points as you explore, allowing you to unlock new areas and new robots and delve deeper into the fractal cosmos.<br/></li><li>Art and Exploration: Fractal Glide is more than a game; it's an artistic experience. Every fractal landscape is a work of art, waiting for you to uncover its secrets.<br/></li><li>Endless Discovery: With a growing collection of fractal patterns, each playthrough offers a new chance to explore the infinite.</li></ul>", "metacritic": null, "released": "2024-01-24", "tba": false, "updated": "2024-01-26T09:07:22", "background_image": "https://media.rawg.io/media/screenshots/bb0/bb0085b3b5d532532812cbb4fb4d9a5e.jpg", "website": "https://nabilmansour.com/FractalGlide/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 321, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nabil Mansour"], "genres": ["Action", "Adventure", "Sports", "Racing", "Casual"], "publishers": ["Nabil Mansour"], "esrb_rating": null}