{"id": 975789, "slug": "rin-the-last-child", "name": "RIN: The Last Child", "name_original": "RIN: The Last Child", "description": "Play as RIN, the last child of the Creator, on a journey to restore order in a mystical world. Collect aspects and runes, craft spells, and confront powerful bosses - your transformed siblings. The fate of the world rests in your hands.<br/><br/><br/>The story of RIN, her siblings, and their Creator, the Teller of Tales, was inspired by the well-known ancient myth about Cronus and his conflict with his children. It also touches upon the overall passing of gods who must be replaced by new gods. <strong>The creation myths</strong> seemed to match perfectly Metroidvania's dark fairy tale - no trace of man, but the importance of magic. An important motif and another layer of the script is the conflict between being obedient to authority - the father (the Creator) or freedom - the free will and responsibility for oneself and one's decisions. The story offers different possible endings based on your choices.<br/><br/><br/><br/><br/><br/>There are<strong> 18 elemental spells</strong> from three categories: attack (10), defense (5), and utility (3).<br/>The spells are created of Aspects of Magic (5) and Spell Patterns. Then, they can be enchanted with a currency by Lesser Runes (adding more damage) or upgraded by an upgrade scheme and Great Runes (changing the effect). The quick slot allows assigning 3 spells at a time but gives an option to quickly swap to another spell set. Mathematically, considering the combination of Lesser Runes, Great Runes, and Upgrades, there are as many as <strong>7776 spells variants</strong>. As you progress, the spells can be disassembled in order to use the aspects components for another assembly. <br/><br/><br/><br/>On your exploration journey, you will <strong>fight many small creatures</strong> formed from their locations such as Slimes, Mosquitoes, but also bigger creepy beasts like Rats or Spitting Plants. The main fights though, will not only require a neat set of spells and skills but most importantly the decisions to take based on your will. As RIN, the sixth child of the Creator, you will<strong> confront five bosses</strong> - your unknown siblings.<br/><br/>The fate of the world rests in your hands. Can you save everyone?", "metacritic": null, "released": "2024-01-24", "tba": false, "updated": "2024-01-28T08:39:09", "background_image": "https://media.rawg.io/media/screenshots/4a9/4a9a72c08c65f4eeb30656c1583211cb.jpg", "website": "https://rinthelastchild.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Space Fox Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Space Fox Games"], "esrb_rating": null}