{"id": 975896, "slug": "thunderblade-saga", "name": "Thunderblade Saga", "name_original": "Thunderblade Saga", "description": "<strong>\"Thunderblade Saga\" is a hardcore action game featuring combos, parries, Iaijutsu (quick-draw technique), and ultimate moves. Every minute of your time will be spent in battle. If you want to experience high-difficulty boss battles that are not of the Souls-like genre, you can try this game!(SteamDeck has been initially supported, and the UI requires touch)</strong><br/><br/><strong>To ensure you enjoy exhilarating fights, we have made the following efforts:</strong><br/><strong>Solid gameplay feel </strong>– you'll understand once you experience it; no need for us to boast.<br/><strong>High degree of freedom</strong> – use over 10 skills simultaneously, develop your own combos, and unleash your imagination.<br/><strong>Humanized Bosses </strong>– our AI system is inspired by fighting games, including techniques like instant recovery, hit confirm, corner traps, and pressure play, as if sparring with a master.<br/><strong>Advanced \"Frame\" system</strong> – this might be the only side-scrolling action game in recent years based on a frame system, where every action of every frame is precisely controlled.<br/><br/><strong>Core Gameplay:</strong><br/><strong>Skill Unlocking: </strong>Defeat monsters to unlock new powerful skills, continuously experiencing new gameplay.<br/><strong>Revival Mechanism:</strong> Direct revival at the door after failing a Boss fight, saving time from traversing maps.<br/><strong>Game Objective:</strong> Defeat the final Boss and rescue the wife.<br/><br/><strong>Plot Summary:</strong><br/>    In the ancient and peaceful kingdom of Retarria, young Prince Keryan had just entered into marriage with the beautiful Arya, both dreaming of a happy future together. However, their happiness is shattered by a sudden catastrophe. The sky tears open, revealing numerous gigantic portals from which hordes of vicious orcs emerge, bringing destruction and chaos.<br/><br/>    The brave Keryan quickly assembles a human army to valiantly resist the orc invasion. Despite their courage, they are outnumbered and Keryan is gravely injured in this brutal battle. Amidst the chaos, his beloved new wife Arya is captured by the orc leader. The pain of injury and loss profoundly affects Keryan's spirit.<br/><br/>    However, in this moment of despair, Keryan discovers his father's legendary sword, imbued with the power of thunder. With renewed determination, he takes up this divine weapon, resolved to embark on a perilous and challenging journey. His mission is to rescue his beloved Arya, for their shared future, and for the peace of the entire land of Retarria. Thus begins Keryan's adventure.<br/><br/>The EA version includes 6 levels (30 small levels), 7 bosses with different styles, more than 10 skills can be used at the same time, and a rune system will be added later.<br/><br/>We are a three-person indie game team in Shanghai, if you have any suggestions for the game, please leave a message to let us know, let's make the game more and more fun together :)<br/><br/>The UI in the current version does not hold the support handle operation for the time being, and the support will be updated in the next few days :)", "metacritic": null, "released": "2024-01-26", "tba": false, "updated": "2024-01-29T06:43:48", "background_image": "https://media.rawg.io/media/screenshots/651/651b1cdde31a2869a956e76f87ca2458.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 525, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shanghai huan zhen Info Tech"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Shanghai huan zhen Info Tech"], "esrb_rating": null}