{"id": 9758, "slug": "max-an-autistic-journey", "name": "Max, an Autistic Journey", "name_original": "Max, an Autistic Journey", "description": "Max, an Autistic Journey is a retro style top-down turn-based RPG filled with mini games, monsters and most of all, heart. Developed by Stéphane Cantin, who is just a devoted dad who made a game with his son about his son’s autism.<br/><br/>During the game player’s step into the shoes of Max, a ten year old boy who must find ways to deal with everyday life while being diagnosed with an autism spectrum disorder (ASD). Many players will discover a world familiar but alien to them. Some may relate to Max's story all too well. Regardless where you fall in the spectrum of life, Max, an Autistic Journey delivers an entertaining, imaginative and informative trip worth taking.<br/><br/>This retro-inspired RPG gives players not only a unique gaming experience, but an insight into a world many people have never seen. While the visualization of the beasts may be fantasy, the emotions and frustrations they represent are very real for a lot of people. <br/><br/><br/>There are few greater inspirations in life than one's love of their child. Max, an Autistic Journey is Stéphane’s inspired interactive love letter about his son Max who was born with autism that he worked hand in hand with throughout the development of the title. <strong>While there is a wide spectrum of autism, this game focuses on Max, where he falls in that spectrum and how he experiences and deals with daily life.</strong> <br/><br/><br/><ul> <li>Classic turn-based battle system featuring clever weapons and special abilities to confront monstrous manifestations of emotions and anxieties<br/> </li><li>Gain experience points through imaginary toy battles and by confronting your fears and anxieties to level up <br/> </li><li>Core retro RPG mechanics infused with multiple Mini Games such as picture puzzles, race cars and making music<br/> </li><li>Endearing tale of trials and tribulations from a unique perspective that inspires, educates and entertains as the story unfolds<br/> </li><li>Mouse &amp; Keyboard and Full Controller Support<br/> </li><li>Steam Achievements, Cloud Saves &amp; Steam Trading Cards</li></ul><br/>The developer will be donating a portion of proceeds from game sales to the Miriam Foundation, a charitable organization that helps people with autism spectrum disorders and intellectual disabilities lead fulfilling lives.", "metacritic": null, "released": "2016-08-19", "tba": false, "updated": "2019-08-28T22:14:48", "background_image": "https://media.rawg.io/media/screenshots/adc/adcdcbe414f0ca1e7a7825f0c9fc4e83.jpg", "website": "http://gpacgames.com/max-an-autistic-journey", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 71}, "playtime": 4, "achievements_count": 27, "ratings_count": 3, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Professional Imagination"], "genres": ["RPG", "Indie"], "publishers": ["GPAC"], "esrb_rating": null}