{"id": 975862, "slug": "man-in-the-dark", "name": "Man in the Dark", "name_original": "Man in the Dark", "description": "<strong>Man in the Dark</strong> is a dark-feeling third-person shooter, single-play game that realistically depicts the earth's apocalyptic feeling, set in a human race that has been turned into a place where zombies and monsters are rampant due to people's wrong choices, and doesn't require much learning and you have to kill and survive all the zombies and monsters that appear. <br/><br/>Once busy factories, quiet villages, beautiful lakes and remote deserts are in the dark of death, but please join me in the struggle of one person who cannot give up on life.<br/><br/><strong>Main function</strong><br/><br/>- <strong>Unique maps</strong> : 'Abandoned Warehouse, Creepy Town, Rainy Village, Mysterious Fog, Desert of Monster Creatures, and Abandoned Slums' Days and Nights' show a mankind covered with fear and dark.<br/><br/><br/><br/><br/><br/>Each map has its own unique atmosphere, and there are many different elements to overcome in order to clear. The first map is open by default, and the next map is opened when you clear the previous map.<br/><br/>- <strong>Various weapons</strong> : Each map basically provides 3 kinds guns and grenades. The 3 kinds of guns are configured to match the characteristics of the map and can be used by changing them using a wheelboard.<br/><br/>- <strong>Equipment</strong> : Certain darkened maps are given Night Vision, Thermal Scope, Flashlight, Hands Flares, etc. to gain visibility.<br/><br/><br/><br/>- <strong>Horrifying atmosphere</strong> : Humans who have turned from the darkness of the end to zombies, mysterious creatures and monsters whose is unknown, and infected dogs.. The realistic expression is even more frightening.<br/><br/><br/><br/><br/><br/>- <strong>Customizing character</strong> : Player can choose a variety of costumes or change the color of each part.<br/><br/>", "metacritic": null, "released": "2024-01-25", "tba": false, "updated": "2024-01-29T05:57:41", "background_image": "https://media.rawg.io/media/screenshots/f8a/f8a766f032a514ab6a6f978952655dd5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 328, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cactus Island"], "genres": ["Action", "Indie"], "publishers": ["Cactus Island"], "esrb_rating": null}