{"id": 975891, "slug": "guilty-loving-boxing", "name": "Guilty Loving Boxing", "name_original": "Guilty Loving Boxing", "description": "“Guilty Loving Boxing” is a 3D boxing game for single players only. There are 17 characters in total, 11 female and 6 male.<br/>You can play female-on-female, male-on-male and even mixed gender fights.<br/>You can also choose from various costumes, glove colors, headgear, etc.<h3>◆Concept and How to Play</h3><strong>The most important thing in this game is to enjoy the men and women who fight with boxing.</strong><br/><br/>■Basic operations such as punching, guarding, clinching are available. <br/>■Bruises that appear on the face and body due to accumulated damage.<br/>■Training mode where the player can hit the opponent who does not fight back.<br/>■Mode where you can watch CPU vs CPU matches without any operation.<br/>■You can switch between third-person view and first-person view.<br/>■Stages: “Gymnasium”, “Practice Room”, “Hotel Room”, and “Mountain”.<br/>■Various costume settings such as swimsuits, topless women, underwear men, etc.<br/>■You can change the settings for match time, down rules, BGM, and Crowd voices.<br/><br/><strong>By combining these features, you can enjoy various situations depending on your imagination. </strong><br/><br/><br/>The game is set in an underground boxing event called “Guilty Boxing” that is operated by a mysterious organizer. <br/>Participants are recruited through a matching app, and matches are arranged. <br/>The matches are held in various locations such as gymnasiums, rental spaces, and remote mountains.<br/><br/><br/><strong>*The localization of this game was done by non-native speakers using machine translation tools. I do not guarantee the perfection of the text. There may be errors or unnatural expressions in the text. Please understand. </strong><br/><br/>*You cannot customize (change) the operation keys.<br/>*There is no character creation feature.<br/>*Costumes are locked by default and cannot be selected. You need to unlock them for each character using tokens in the game. You can get tokens by clearing the “Tournament Mode” where you fight against multiple opponents.<br/><br/>*There are no elements of training or story.<br/>*This is a single player game only. You cannot play against other players.<br/><br/>*Only XInput format gamepads are supported. (PlayStation and Nintendo Switch cannot be used.)<br/>*Does not support STEAM functions such as cloud saves and achievements. <br/>*A gamepad is not required. You can play with just a keyboard and mouse.<h3>*All characters appearing in “Guilty Loving Boxing” are over 18 years old.</h3>", "metacritic": null, "released": "2024-01-26", "tba": false, "updated": "2024-01-29T06:33:46", "background_image": "https://media.rawg.io/media/screenshots/48b/48b25f2f953f2443acb9a92128359cc7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["痛風舎"], "genres": ["Action", "Sports", "Indie"], "publishers": ["痛風舎"], "esrb_rating": null}