{"id": 975931, "slug": "wall-ball-3", "name": "Wall Ball", "name_original": "Wall Ball", "description": "<h3>WallBall is a Single Player and Multiplayer Game Where Timing is Everything.</h3>Hit the ball just right and score big points quickly.<br/>Hit the ball too early or late and suffer a painful wait as you see your opponent score points.<br/>*Arcade styled game plays as fast or as slow as you play.<br/>**Start in the Moon Arena and collect wins to earn different interstellar arena locations.<h3>The Rhythm:</h3>When you hit the ball just right a rhythm begins to develop, much like a boxer with a speed bag, timing is everything. <br/>This natural rhythm starts to speed the ball up, the question is, can you keep up and put big points on the leaderboard?<h3>Single Player:</h3>Score as many points as possible before a third out and make it to the top of the leaderboard!<h3>Multiplayer:</h3>Score 21 points before your opponent to win the game!<br/>*Win 3 out of 5 games to take the match.<br/>**Win 3 games in a row and put a Domination Match on the leaderboard.<br/>***Average multiplayer game is ~45 seconds, fastest game on record is 11 seconds!<br/>****Auto-Rematch is engaged until best of 5 is reached unless a player quits.<br/>*****Quitting mid-game is impossible. Quitting is only possible after game... quitter.<h3>Scoring:</h3>Hit the front wall = 1 point<br/>Hit the roof = 2 points<br/>Hit the backstop = 3 points<br/>Hit the back wall = 7 points (WALL BALL)<br/>Hit the floor before front wall = Out (single player only)<br/>*all combinations possible<br/>**Hit 3 WallBalls in a row and put an Impossible Shot on the leaderboard.<br/><br/>Fun, fast, intensely-competitive when you want, chill when you don't.<h3>Welcome to the Future, Welcome to WallBall.</h3>", "metacritic": null, "released": "2024-01-26", "tba": false, "updated": "2024-01-29T07:26:12", "background_image": "https://media.rawg.io/media/screenshots/7bf/7bf1a635d520ff1c1fde270426448e5a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ZZYZX RD game studios"], "genres": ["Sports"], "publishers": ["ZZYZX RD game studios"], "esrb_rating": null}