{"id": 975960, "slug": "asteroids-neon", "name": "Asteroids Neon", "name_original": "Asteroids Neon", "description": "Prepare for a cosmic revolution in <strong>\"Asteroids Neon\"</strong>, a remixed version of the legendary Asteroids arcade game. Immerse yourself in a vibrant, retro-futuristic dreamscape, where dazzling neon nightmares come to life, and the void of space is an electrifying playground of explosive mayhem and dazzling hues.<br/><br/>In this pulsating adventure, your sleek, you will encounter a multitude of UFO styles, each with their unique characteristics. Engage in battles against asteroids of varying sizes that threaten to shatter your voyage through the neon-infused cosmos. The celestial battleground is alive with the symphony of explosions, captivating music, and immersive sounds that elevate the gameplay to a whole new level.<br/><br/><strong>Diverse Menagerie of UFO Styles: </strong>Encounter a kaleidoscope of UFO styles, each boasting its distinct patterns and behaviors, making every encounter a thrilling challenge that keeps you on the edge of your seat.<br/><br/><strong>Explosive Action and Power-ups: </strong>Unleash devastation upon the neon-lit starscape with an arsenal of power-ups at your disposal. Trigger a magnet to attract stars and earn bonus points, harness a singularity to devour asteroids, or activate a destructive beam to obliterate anything in your path.<br/><br/><strong>Color Customization:</strong> Express your unique style in the neon cosmos by customizing your environment colors. Personalize every hue and pattern to truly stand out in the electrifying universe of Neon Nebula.<br/><br/><strong>Intense Challenges and Achievements:</strong> Push your skills to the limit as you navigate through waves of UFOs and asteroids, aiming for the highest score. Unlock challenging achievements that showcase your prowess in the face of intergalactic danger.", "metacritic": null, "released": "2024-01-27", "tba": false, "updated": "2024-01-29T08:06:35", "background_image": "https://media.rawg.io/media/screenshots/a58/a5891e52987446e8e3932afa6338e987.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Noir Road"], "genres": ["Action", "Indie"], "publishers": ["Noir Road"], "esrb_rating": null}