{"id": 975932, "slug": "kagami-an-odyssey-in-japanese-language-learning", "name": "Kagami: An Odyssey in Japanese Language Learning", "name_original": "Kagami: An Odyssey in Japanese Language Learning", "description": "Kagami: An Odyssey in Japanese Language Learning (phew, what a long name! That means it MUST be GOOD!) <br/><br/>*Ahem* Anyways...<br/><br/>The game is a top down RPG lite centered around exploration, finding vocabulary words in the world by interacting with objects, playing minigames, and using the vocabulary you learned in each area to gain advantage when fighting enemies! You might unravel a mystery, learn more than you thought you would, and become emotionally attached to some of the characters along the way! Like, who's this cute lil guy runnin' around? YOU'LL FIND OUT!<br/><br/><br/>Fight alongside your party members against monsters that are mostly based on Yokai from Japanese folklore in that classic turn-based RPG kind of way! Level up to become proficient in physical and magical combat to deal devastating damage to your foes! <br/><br/><br/>If you are new to learning Japanese, no problem! The game starts by teaching you the basics of Hiragana, one of the alphabets of the Japanese language! You also learn Katakana as well! <br/><br/>You will have access to all the “charms” or vocabulary words you collect to study when outside of battle through your trusty Game-Buddy, who manages everything from inventory to vocab to saving your game file. Game-Buddy also has a Hiragana and Katakana reference guide that include visual representations of mnemonics to help you retain all this new information and a sound clip of the kana being pronounced!<br/><br/>We do not use romaji, so be warned, you will either learn to read Hiragana and Katakana or you will not have a good time. Though we give you the resources to learn, it will ultimately be up to you to retain the knowledge needed to succeed, and we think anyone who really wants to learn can and will succeed!<br/><br/>Do you think you have what it takes? We think you do!", "metacritic": null, "released": "2024-01-26", "tba": false, "updated": "2024-01-29T07:27:46", "background_image": "https://media.rawg.io/media/screenshots/9aa/9aa1cf925f8c1f7ae732432b27529488.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Iconoclast Games"], "genres": ["RPG", "Indie"], "publishers": ["Iconoclast Games"], "esrb_rating": null}