{"id": 975946, "slug": "sex-simulator-roman-emperor", "name": "Sex Simulator - Roman Emperor", "name_original": "Sex Simulator - Roman Emperor", "description": "An interactive SEX SIMULATION game with VISUAL NOVEL elements, featuring HD GRAPHICS and hot ANIMATIONS. <br/>Play the role of a young Roman Emperor and relish the privilege of having any woman you desire. Pick between 3 exotic beauties and satisfy them by using a wide selection of sex positions. Double the excitement by asking your loyal servant to assist you with the ladies.<br/><br/><strong>GAME DESCRIPTION</strong><br/><br/>Enter the world of Sex Simulator - Roman Emperor.<br/>Step into the shoes of a young and privileged Emperor and embrace the liberty to choose without limitations. Whether she is a sinful dancer from the Orient, a bold Viking warrior, or a forbidden fruit like a noble’s wife, select at your leisure and indulge in any desire that stirs your imagination.<br/><br/>The process is simple:<br/>Pick a girl, get her naked, and then choose between our selection of sex positions to make her come. <br/>Repeat with the other two and show them the privileges of indulging the Emperor. <br/><br/>Don’t worry if you're not a great talker, we have this part covered for you. All you need to do is flex those finger muscles to control the sex motion and make the ladies come before you run out of stamina.<br/><br/>You didn’t get it right on the first try? Well … it happens to the best of us. <br/>The good part is you can always try again, and again, and again…until you leave every single one of them satisfied.<br/><br/><strong>FEATURES</strong><br/>90+ HD quality renders<br/>HD animations", "metacritic": null, "released": "2024-01-27", "tba": false, "updated": "2024-01-29T07:48:53", "background_image": "https://media.rawg.io/media/screenshots/3c4/3c4f7932589080f8dd6745da64946516.jpg", "website": "http://www.exosyphen.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["EroticGamesClub"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["EroticGamesClub"], "esrb_rating": null}