{"id": 975917, "slug": "attack-on-hex-island", "name": "Attack on Hex Island", "name_original": "Attack on Hex Island", "description": "In this Pokémon / Tetra Master inspired card battler, you collect, trade, and battle with tokens in turn-based matches. Customize your party and plan your moves strategically to win over your opponents, and lift the curse that has corrupted the inhabitants of Hex Island.<br/><br/><br/>Use your arrows to capture the opponent's tokens and convert them into your color. The player with the most tokens in their color at the end of the match wins.<br/><br/>When arrows connect, a battle is triggered and dice are rolled. Battles may add risk, but allow for additional captures through combos. Element types are vital to your success, and will provide an attack boost when used against weaker elements.<br/><br/><br/><br/>Discover different ways to outwit your opponent and secure the win. Some tokens contain Special Abilities, each with its own unique effect.<br/><br/><br/>Keep an eye out for Walls, Field Elements, Bombs, and other obstacles found on the board that can also be used to your advantage.<br/><br/><br/><br/>Grow your collection of tokens and critters by looting your opponent after a victory, opening booster packs, and finding treasure chests.<br/><br/><br/><br/>Tokens come in a variety of designs, elements, abilities, and arrow compositions, allowing you to create a unique party that best fits your playstyle. You can also upgrade and modify your tokens in order to have the upper hand during your next match.<br/><br/><br/><br/><br/>", "metacritic": null, "released": "2024-01-26", "tba": false, "updated": "2024-01-29T07:09:07", "background_image": "https://media.rawg.io/media/screenshots/8bb/8bbdf88e094c867103baae786628fc59.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ProdigalSon Games"], "genres": ["RPG", "Strategy", "Casual"], "publishers": ["ProdigalSon Games"], "esrb_rating": null}