{"id": 97607, "slug": "capture-the-pixel", "name": "Capture the Pixel", "name_original": "Capture the Pixel", "description": "<p>\n</p><p>\r\nThis is Capture the Pixel.<br/>\r\nThe red team and the blue team keep struggling on their endless battle.<br/>\r\nThere is only one objective:\r\n<strong>Defeating the rival team</strong>.\r\n</p>How, you may ask?<p>\n</p><p>\r\nThis is the pixel. <strong>Your rival's most preciated possession</strong>. You must capture it from their base and take it back to your base. <strong> The team that captures the rival's pixel more times wins the round.</strong>\n</p>Well, that's easy!<p>\r\nNot so fast, my friend. Your enemies will be lurking at the other side of the mountain. You will be ambushed every time. Go with care or you will lose <strong>the pixel</strong>.\r\n</p><p>\n</p><p>\r\nBut don't worry, you won't go barehanded against your rivals. There are many <strong>powerful weapons</strong> scattered all through the map. Take advantadge of them and crush the hopes and dreams of your enemies!\r\n</p><p>\n</p><p>\n</p><p>\r\nUse the <strong>W, S, A, D</strong> keys to <strong>move</strong>.\r\n</p><p>\n</p><p>\r\nMove your mouse to <strong>aim</strong> and left click to <strong>shoot</strong>.\r\n</p><p>\n</p><p>\r\nWalk over the <strong>enemy pixel</strong> to <strong>grab it!</strong>. Then touch your own base to score!\r\n</p><p>\n</p><p>\r\nYou won't need much to play Capture the Pixel:\r\n\r\n</p><ul>\n<li>A computer running a recent enough version of Windows or Mac OS X.</li>\n<li>A mouse and a keyboard</li>\n<li>Permanent internet connection. <strong>Using a wired connection is strongly recommended</strong>. It will work fine under Wi-Fi anyway.</li>\n<li>A chair to sit while you're playing.</li>\n<li>A cat could be fine too.</li>\n</ul><p>\r\nIf your game doesn't run in your computer, tell us and we'll try to make it work! This was done in a very short time, wonder how well tested it must be. <strong>Linux users:</strong> This will probably work better using Wine and forcing the player to use the OpenGL renderer than using the native Linux player. If you don't know what does this mean, go back to Windows!\r\n</p><p>\n</p><p>\r\nCapture the Pixel was done through the last week on the spare time of the following people:\r\n</p><ul>\n<li><strong>César González Segura:</strong> Assembled the game client with duct tape and chewing gum. Also designed the seriously flawed networking protocol.</li>\n<li><strong>Francisco Javier Moragón Fernández:</strong> Coded the backend server and fine tuned the protocol. Later he flew off with  the source code to the rival team.</li>\n<li><strong>Aitor Cortés Sáez:</strong> Drew most of the graphics and created the animation system.</li>\n<li><strong>Jose Antonio Hernández Ruíz, Ximo Ventimilla Zuñiga and Adrian Peláez Serrano:</strong> Made many of the graphics and tested the game until their fingers broke.</li>\n</ul>NOTE: Some huge bugs may happen while you play. Sorry!<p>\n</p>", "metacritic": null, "released": "2016-04-18", "tba": false, "updated": "2019-08-28T23:25:27", "background_image": "https://media.rawg.io/media/screenshots/61c/61cc69778a01475f4764deab8033bfb9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jumble! Devs"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}