{"id": 976091, "slug": "el-dorado-the-golden-city-builder-prologue", "name": "El Dorado: The Golden City Builder - Prologue", "name_original": "El Dorado: The Golden City Builder - Prologue", "description": "https://store.steampowered.com/app/1451470/El_Dorado_The_Golden_City_Builder/<br/>https://store.steampowered.com/app/1505940/Orc_Warchief_Strategy_City_Builder/<h3>This is the prologue of our upcoming El Dorado: The Golden City Builder - the prologue is just part of the full game that will let you get to know the game before its official release and it's completely free.</h3><br/><h3>Build the mightiest and most expansive empire of Yucatan</h3>Your aim in the game of El Dorado: The Golden City Builder - Prologue, is to create the mightiest empire of the whole Yucatan peninsula. Develop your early small settlement into a city bustling with life and dripping with gold. Build, develop, manage your resources and appease the Gods. Dominate other newly rising or existing settlements of other families through conquest or peaceful talks. Diplomacy or blood… it is your choice.<br/><h3>Become the architect of your mythical city</h3>As the Leader, you will be responsible for every building built on your territory, such as sawmills, temples, housing, barracks and many more. Skillfully plan your city as every path may play a vital role in managing your city. Well-planned zones of your empire will have a special impact on the proper and quickly develop your city. The fate of the citizens depends on you.<br/><h3>Gather resources</h3>There are many resources on your territory crucial for the development, conquest and keeping your empire stable. Some will be used for daily life, other resources will have a chance to become part of a variety of weapons – so vital to plan your skirmishes.<br/><h3>Offer sacrifices to the Gods to earn their favor…</h3>Without sacrifices, there is no game based on a mythical ancient tribe, right? God's favor is one of the basic and important quests in the game. Thanks to their approval your city will not only develop freely but also expand its borders and acquire greater military and political capabilities. Satisfy your Gods to avoid their wrath. You can make sacrifices through your Priest in places of worship such as temples. Choose an appropriate slave, organize a grand festival in honor of the chosen Deity and perform secret dark rituals to the delight of the audience. In return, you can expect divine protection from different cataclysms or an increase in yields from your farms and fields.<br/><h3>… or prepare for their wrath</h3>Gold, riches, extraordinary development… it can’t be that easy. Each repeating or grand one-time festival requires sacrifices. If you happen to forget about worship, the Deities will send many cataclysms to your empire or other problems that will hinder your development. Some will be more or less taxing, but it is always better to evade a lone lightning bolt striking your home and setting the city ablaze or a huge tornado wreaking havoc in your city. Plan well what and when you offer your Gods as no mortal has survived their wrath.<br/><h3>Conquer and enslave neighboring people</h3>Every gold is paid for in blood and war is the easiest way to get rich fast. Plunder resources, earn slaves and conquer new land needed for development. Gods are not the only worry, there are other peoples and tribes aiming for the same goal as you. Organize military expeditions, and reinforce the war front or defense lines with resources, which will help in your skirmishes with the enemy. Skillful resource management during war will have an impact on whether your people will come back as victorious conquerors bearing gifts or losers. Fight for the title of the mightiest ruler of the Golden City, El Dorado!<br/><h3>Do not lose yourself in pride.</h3>", "metacritic": null, "released": "2024-01-30", "tba": false, "updated": "2024-02-02T07:27:40", "background_image": "https://media.rawg.io/media/screenshots/55a/55af4a7f9a42b5b8b798ff8755de9004.jpg", "website": "https://gameparic.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 475, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gameparic", "Hobo Bunch"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Games Incubator", "Gameparic"], "esrb_rating": null}