{"id": 976076, "slug": "scp-rulebreaker", "name": "SCP: Rulebreaker", "name_original": "SCP: Rulebreaker", "description": "Dive into the heart of horror with this survival game inspired by the mysterious SCP Foundation. After the opening of Site 1730, once the stronghold of the Foundation, chaos has erupted. All sites, except Sites 15 and 19, have been abandoned, converging towards Complex 1730. An unprecedented concentration of anomalies released during a containment breach has left the complex in a state of desolation. Step into the shoes of a Foundation guard, facing the ultimate survival challenge as the horrors of anomalies threaten to engulf everything.<h3>Game Features:</h3><br/><ul><li>Explore an SCP Foundation complex, once secure, now overrun by madness and danger.<br/></li><li>As darkness descends, you must rely on the radio call from the Tactical agent Alex, trapped in the surveillance room. With his help, try to unravel the secrets of the complex and make your escape.<br/></li><li>Confront a variety of anomalies, each with its own unique behaviors and mechanisms.<br/></li><li>Use your P90 to shoot anomalies, and switch sight optics (ACOG, Red Dot, EOTECH) to adapt to different situations.<br/></li><li>Throw grenades to repel hostile entities and use access cards to reach crucial areas of the complex.<br/></li><li>Utilize SCPs such as SCP-714 or SCP-207 to aid you in your quest and face unique challenges.<br/></li><li>Walk, run, and aim strategically to escape the dangers of the containment breach.<br/></li><li>Use night vision goggles to explore the dark corners of the complex.</li></ul><br/>Discover the fascinating story of the game, including key events triggered by the new director. Search the various computers in the complex to understand the situation and unravel the mysteries surrounding you. Face your deepest fears in this survival horror game and explore a world where the abnormal becomes normal.<br/><br/>Immerse yourself in the unknown, survive the creeping horror of the SCP Foundation, and remember: We work in the shadows so you can live in the light. The fate of the complex now rests in your hands.<br/><br/><strong>Are You Ready To Take On The Challenge?</strong>", "metacritic": null, "released": "2024-01-29", "tba": false, "updated": "2024-02-02T07:10:32", "background_image": "https://media.rawg.io/media/screenshots/62a/62a206745af093301e99d955c39df4d6.jpg", "website": "https://pixeleur.fr/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pixeleur"], "genres": ["Adventure", "Indie"], "publishers": ["Pixeleur"], "esrb_rating": null}