{"id": 976108, "slug": "no-reloading-survival-trials", "name": "NO RELOADING: Survival Trials", "name_original": "NO RELOADING: Survival Trials", "description": "NO RELOADING: Survival Trials is a stunt-focused shooter with rogue-lite mechanics, playable in single-player or asymmetrical multiplayer with Streamer Mode.<br/><br/>Shoot, slide, wall-run, somersault, and more through randomly generated arenas, picking up weapons and upgrade orbs along the way, stylishly slaying every simulant in your way!<br/><br/>Invent new stylish maneuvers, unlocking whole new playstyles, expanding your options as you dive deeper into the Survival Trials.<h3>Features</h3><ul><li><strong>Stylish, Cinematic Combat</strong>: Dive, slide, wall-run, somersault, throw, and more as you revel in slow-motion, perfecting your badassery.<br/></li><li><strong>It Pays To Be Cool</strong>: Choose from hundreds of combinations of stunts and upgrades; the more stylish your combat, the longer you survive... literally!<br/></li><li><strong>Bigger, Badder, Baddies</strong>: Face off against Duke's varied relentless hordes as you traverse eras from classic gaming and action movies!<br/></li><li><strong>NO RELOADING</strong>: Forget that reload button!  Toss your old guns and use your over-powered tractor beam arms to take your foes' weapons! Or just... throw a crate like a cannon ball!  Trust us, it feels good!</li></ul><ul><li><strong>STREAMER MODE</strong>: Give viewers Duke's dungeon master powers, enabling them to help the player with weapons and upgrades, or sabotage them with enemies and other devious tactics!</li></ul><br/>", "metacritic": null, "released": "2024-01-30", "tba": false, "updated": "2024-02-02T07:48:32", "background_image": "https://media.rawg.io/media/screenshots/5ca/5ca80bf1eb547b20b48a0ca9a158bf4f.jpg", "website": "https://zooptek.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ZoopTEK"], "genres": ["Action", "Indie"], "publishers": ["ZoopTEK"], "esrb_rating": null}