{"id": 976148, "slug": "three-kingdoms-innovatory", "name": "Three Kingdoms: Innovatory", "name_original": "Three Kingdoms: Innovatory", "description": "<h3>A Message from the Developers</h3>Hey, everyone! We are the Evolving Studio—a team mainly composed of five uncles. Initially, we were just a group of like-minded friends, passionate about the history of the Three Kingdoms, aiming to create a Three Kingdoms game understood from a Chinese perspective.<br/><br/>From conception to production, we have poured countless efforts and sweat into it, striving to bring the best gaming experience to players. But as a small team new to game development, we understand that our experience is limited and there are many aspects of the game that can be improved and perfected. This is why we decided to first test on EA, hoping to gather more feedback, helping us to continuously improve the game, and create a truly outstanding strategy game.<br/><br/>Although our team is small and lacks experience, we have never given up our passion for game development. We hope that through our hard work, we can make this game successful, allowing every player to experience the excitement of the Three Kingdoms history in the game.<br/><br/>-----------------------------------------------------------------------------------<h3>Game Introduction</h3>Game Features:<br/><br/>● Real-time strategic battle mode controlling hundreds of thousands of troops.<br/>● Over 1400 historical figures from the Three Kingdoms period will appear in various scenarios.<br/>● 400+ counties, cities, and passes to contest and develop.<br/>● Recruit 40 different types of troops from the Three Kingdoms era.<br/>● Use various strategies and diplomatic schemes to let the sovereign \"win without fighting\".<br/>● Experience over 300 real historical events and stories.<br/><br/>-----------------------------------------------------------------------------------<h3>Development Plan</h3>For us, our game is more akin to a long-term project like the Great Wall, rather than a mere strategy game. Without several years of ongoing evolution, it would be meaningless. Based on this philosophy, we will continuously iterate and update our game, focusing primarily in a few directions:<br/><br/>Updating the scenario content. We will add more scenarios and historical events from the Three Kingdoms era, approximately one per month, and continue to update. More significant historical periods will be included once the Three Kingdoms scenarios are sufficiently refined.<br/><br/>Updating gameplay features. In core gameplay areas such as internal affairs, diplomacy, and warfare, there will be numerous functional updates. New technologies, character relationships, alliance relationships, duels, naval battles, construction, timing and geographical advantages, and other features will be gradually incorporated, making the game feel like a new experience after about half a year.<br/><br/>Workshop support. The editor and Workshop will be continuously strengthened, including support for the new content and features mentioned above. We hope players can create even better scenarios and content.<br/><br/>Enhancing effects. Approximately every two years, we will modernize the graphical part of the game, bringing it closer to the level of other high-quality strategy games of the same period.", "metacritic": null, "released": "2024-01-31", "tba": false, "updated": "2024-02-02T08:45:37", "background_image": "https://media.rawg.io/media/screenshots/40c/40ca8ed7a180b495b342ba26f8a99cff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 290, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["瞬息万变工作室"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Moment HK"], "esrb_rating": null}