{"id": 976180, "slug": "purrfectly-hidden-cats-kittenbay", "name": "Purrfectly Hidden Cats - Kittenbay", "name_original": "Purrfectly Hidden Cats - Kittenbay", "description": "<strong>Set sail for the captivating seaside town of Kittenbay, a beautifully crafted 2D world where every hand-drawn detail tells a story. Kittenbay, alive with vibrant charm and hidden wonders, beckons you to explore its delightful secrets, both under the warm sun and beneath the starry night sky.</strong><br/><br/><br/><br/>\"Purrfectly Hidden Cats - Kittenbay\" elevates the hidden object genre with a twist of interactive storytelling and a dynamic day-and-night cycle. Your adventure spans both day and night, each phase offering unique experiences and secrets to uncover. During the day, bask in the town's sunny ambiance as you search for skillfully camouflaged cats blending into the lively scenery. When night falls, the town transforms, revealing a different set of hidden felines and mysteries under the moonlight, adding a layer of depth and replayability to your quest.<br/><br/><br/><br/>In addition to the feline-centric mission, Kittenbay is abuzz with interactive human characters, each with their own stories and conversations, enriching the world with a sense of community and life. Engage with these characters to uncover mini-stories that add heart and soul to your journey. A hidden puzzle, seamlessly integrated into the town's fabric, awaits those eager to delve deeper, weaving a tapestry of intrigue and charm.<br/><br/>Whether zoomed in, engaging with the town's inhabitants and uncovering secrets, or zoomed out, admiring the serene views of Kittenbay by day and night, \"Purrfectly Hidden Cats - Kittenbay\" promises an experience that is both relaxing and mentally stimulating. Embark on this expanded adventure, where every corner of Kittenbay is a canvas of discovery, and let your curiosity be your compass in this world of enchantment and hidden delights.<br/><br/><ul><li>Engaging hidden object gameplay with a day-and-night cycle, offering distinct experiences and challenges in each mode.<br/></li><li>Interactive elements, including conversations with human characters, adding depth to the exploration.<br/></li><li>Captivating mini-stories linked to each discovered cat and human character, enriching the narrative and world-building.<br/></li><li>A vast, interactive environment filled with amusing Easter eggs and secrets that reveal themselves differently by day and by night.<br/></li><li>Unique line-art graphic style, complemented by light effects to reflect the time of day.<br/></li><li>An intriguing mystery with a fun twist waiting to be unveiled, evolving through the day-and-night progression.<br/></li><li>Soothing and immersive background music that adapts to the day and night phases, enhancing the overall ambiance.<br/></li><li>A range of achievements, including special ones for discoveries and interactions unique to the day or night.<br/></li><li>Replayability factor heightened by the changing environment and interactions between day and night.<br/></li><li>Autosave feature, ensuring that players' progress is automatically saved, allowing for seamless gameplay.</li></ul>", "metacritic": null, "released": "2024-02-01", "tba": false, "updated": "2024-02-02T09:30:53", "background_image": "https://media.rawg.io/media/screenshots/d0d/d0da8da95ca7c056455d63a5422a77b3.jpg", "website": "https://www.gemcraftgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bleeding Moon Studio", "Gemcraft Games"], "genres": ["Casual"], "publishers": ["Gemcraft Games"], "esrb_rating": null}