{"id": 976130, "slug": "speed-crew", "name": "Speed Crew", "name_original": "Speed Crew", "description": "<h3>Get ready</h3> Gather your elite pit stop crew of 1-4 players for a high-octane experience, available both online and locally (likely on your friend's couch). Participate in racing championships, repair arriving cars, navigate challenges like shifting platforms and Dominion Torrento, and secure your victory. A fun and chaotic adventure spanning four decades, from the 70s to the 00s, awaits you.<br/><br/><h3>Build your Crew</h3> Build your pit crew with up to 4 members, assign tasks, and execute clean repairs to double your points and win championships. Teamwork is the key to your success! As a party game, we highly recommend playing it with your family and friends to unlock maximum mayhem. While enjoying it solo might seem less stressful, rest assured, chaos will still be your constant companion.<br/><br/><h3>Fix Cars</h3> Your task is to get your driver back on track as quickly as possible. With this in mind, you'll need to diagnose car issues, make efficient repairs using a variety of tools, and navigate dynamic, hazard-filled pit lanes. Aim for Gold in the championships and give a slap to annoying Dominion Torrento. Also, don’t forget to slap your comrades for proper motivation too. <br/><br/><h3>Win races</h3> Explore 48 levels in 4 Chapters, unlock sponsored races to find hidden prizes – there’s always a new challenge awaiting. Storm, rain, lava – nothing can stop your team! Discover the entertaining, voiced, and animated story of your crew and their rivalry with Dominion across four decades of championships. <br/><br/><h3>Be stylish</h3> Win races to unlock new characters, collect various looks and create your own fun way to mess with your teammates. Why limit yourself to the chaos on the pit lane when you can also make some of your own?<br/><br/><h3>Unlock Arcade mode for more challenges</h3> Ruin your teammates' championship while being Dominion Torrento himself. Spoil everything they are doing; your goal is to make them suffer sore losers, while their goal is to win no matter what and give you a slap. True friendship level unlocked! <br/><br/><strong>KEY FEATURES:</strong><br/><ul><li> Local and online multiplayer options.<br/></li><li> Engaging storyline with animated and voiced cinematics, featuring 4 racing championships spanning 4 decades.<br/></li><li> Unique 48 levels to explore.<br/></li><li> Arcade mode for those seeking true challenges.<br/></li><li> Dynamic pit lane filled with a variety of tools, hazards, and car issues to keep the action intense.<br/></li><li> Customization: pick your character, hat, and costume color.<br/></li><li> Stylized 3D graphics with a retro touch and custom-made soundtrack for each decade.<br/></li><li> Suitable for all ages and skill levels.<br/></li><li> Slaps! Slap Dominion, slap cars, slap your teammates, slap that release button. Become a true pit stop tyrant! </li></ul><br/><br/> <br/><strong>Join the Speed Crew Discord community!</strong>", "metacritic": null, "released": "2024-01-31", "tba": false, "updated": "2024-02-02T08:20:16", "background_image": "https://media.rawg.io/media/screenshots/3d9/3d9b2cfdfa7cad86b6dcfae0955868f9.jpg", "website": "https://wildfieldsgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wild Fields"], "genres": ["Action", "Simulation", "Racing", "Casual", "Indie"], "publishers": ["Wild Fields"], "esrb_rating": null}