{"id": 976204, "slug": "memorion", "name": "Memorion", "name_original": "Memorion", "description": "Embark on a mesmerizing journey through the corridors of your own consciousness in \"Memorion\", a captivating puzzle game where you're tasked with recovering fractured memories and reconnecting with your past. <br/><br/><br/><br/>\"Memorion\" offers immersive puzzles and an emotional depth. Dive into a story that explores memory, identity, and the enigmatic connection between the past and present. As you explore this surreal dimension, you'll uncover the remnants of your life's most precious moments – the laughter of loved ones, the echoes of forgotten conversations, and the ripples of emotion that once defined you.<br/><br/>In your quest for remembrance, you must harness the power of interconnected neurons, unlocking pathways that will guide you through a tapestry of memories. Embark on a mesmerizing odyssey of self-discovery in \"Memorion.\" Unravel the enigma of your existence and restore the fragments of your past as the echoes of your memories call you.<h3>features</h3><br/><ul><li><strong>Immersive Puzzles:</strong> Encounter intricate puzzles and challenges that represent the fragments of your memories.<br/></li><li><strong>Neural Connection:</strong> Reconnect the neurons that symbolize your experiences and rediscover the vivid moments of your life.<br/></li><li><strong>Emotional Depth:</strong> Dive into a story that explores themes of memory, identity, and the enigmatic connection between the past and present.<br/></li><li><strong>Meditative Mood:</strong> Immerse yourself in a meditative atmosphere, visuals and music.</li></ul>", "metacritic": null, "released": "2024-02-01", "tba": false, "updated": "2024-02-02T09:59:07", "background_image": "https://media.rawg.io/media/screenshots/9be/9be75638efe722a98b6931dbd1b98fa9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Purple Game Arts"], "genres": ["Casual"], "publishers": ["Purple Game Arts"], "esrb_rating": null}