{"id": 976210, "slug": "kadomon-hyper-auto-battlers-prologue", "name": "Kādomon: Hyper Auto Battlers Prologue", "name_original": "Kādomon: Hyper Auto Battlers Prologue", "description": "Welcome to the world of Kādomon, a mysterious land where cute and quirky monsters roam freely. Journey through randomly generated regions, battling and collecting Kādomon on your quest to be the best.<br/><br/><br/><br/><br/>There’s 180+ monsters to add to your Kādodex, and each Kādomon has 2 super rare misprints to discover! Find over 60 of these monsters and their misprints to build the ultimate unstoppable team in the Kādomon prologue!<br/><br/><br/><br/><br/>All Kādomon have special characteristics, such as activated abilities, passive abilities and different typings (there’s 12 types in total!). Synergise your Kādomon’s attacks and create a super effective combo of monsters. Grow even stronger with every battle by levelling-up and evolving your team!<br/><br/><br/><br/><br/>Once fully evolved, every Kādomon has the chance to get HYPER! Acquire very rare items that allow your Kādomon to break their limits and discover a hyper-powerful 4th form! With brand new designs and souped-up stats, you’ll be able to tackle the greatest of challenges, in the Kādomon prologue you will be able to discover Hyper Evolution for every starter Kādomon! <br/><br/><br/><br/><br/>Battle your team against elite enemies and bosses. Get your team ready to fight against MEGA opponents, and unlock brand new Kādomon if you win! Remember, there is always a greater foe to test your strength!<br/><br/><br/><br/><br/>The Kādomon world is bustling with secrets, including random events that will change the tide of battle! In the Early Access release, experiment with different items and monsters, Kādomon might evolve in different ways, and if you’re lucky you might just encounter a Legendary Kādomon to join your team…<br/><br/><br/><br/><br/>In between battles, take a mosey around Shonkka's Shop! Here you can use the Money Berries you’ve earned to buy new Kādomon and items. Held items are incredibly useful to have as they give you permanent buffs or powerful single use effects when used wisely!", "metacritic": null, "released": "2024-02-01", "tba": false, "updated": "2024-02-02T10:10:47", "background_image": "https://media.rawg.io/media/screenshots/e75/e75411f83d6802e03da8332fd27d811a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 18}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 274, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dino Rocket"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Fireshine Games"], "esrb_rating": null}