{"id": 976285, "slug": "deserted-island-1996", "name": "Deserted Island (1996)", "name_original": "Deserted Island (1996)", "description": "<p>Deserted Island tells the story of an island sited 171 degrees 52 minutes east longitude 11 degrees 11 minutes north latitude. Unexplored waters of the Pacific. On 14th May of 1904 , a cargo ship was hitted by a storm and it discover an island. They sent a report of the island to the Geographical Society that is famed for scientists around the world. And six months later they sent a team to explore the island.</p>\n<p>The player can choose between 4 different leaders (Great Britain, Prussia, Japan or the United States) of the explorer&#39;s team. The team is 6 members: The leader, a hunter, an associate, a doctor, a research and a dog.</p>\n<p>The game is played in a first person perspective and the goal of the game is explore the island to discover new plants, minerals and animals. There are real and fictional creatures and plants. The player have to take care of his team &#39;cause the fatigue and hunger will make his health power decrease.</p>\n<p>Great Britain team: (sponsored by an aristocratic background)<br />\nRichard Gibson (team captain), Arthur Gibson (assistant), Gibson Singh of India (servant), Charles (the doctor), Bernard (hunter) and Rush (dog).</p>\n<p>USA team (sponsored by the Smithsonian Museum):<br />\nGeorge Douglas (team captain), Rachel (George wife and the assistant), Emilio (mexican porter), Steven (the doctor), Warren (Hunter) &amp; Lightning (the dog).</p>\n<p>Prussian team: (sponsored by the Prussian emperor)<br />\nErich (team captain), Michael (assistant), Arufurihito (porter), Gottlieb Reinhardt (the doctor), soldier Heinz (the hunter) &amp; Fenrir (the dog).</p>\n<p>Japanese team: (sponsored by the Army of Japan)<br />\nRyuutarou Oosuga (team captain), an student (assistant), Tanaka (porter), Komori (surgeon), soldier Kato (hunter) &amp; Akita (dog).</p>\n<p>Manufacturer&#39;s description:</p>\n<p>New sense of &quot;survival simulation experience 3D&quot;<br />\nUnknown group of organisms more than 150 that&#39;s been developed by the special CG synthesis SE &quot;des ? Ted Island&quot; high quality of more than 100 types to experience the real with the five senses to explore and cry feel that point-cut step firmly the earth, of living a lot, such as the sound of wind and water are incorporating plenty of these elements is a simulation game experience 3D.</p>\n<p>Features:<br />\nFirst person perspective.<br />\n3D graphics<br />\nCartoon graphics<br />\nExplorers &amp; adventure themes.</p>", "metacritic": null, "released": "1996-11-29", "tba": false, "updated": "2024-02-03T18:10:57", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation"], "developers": [], "genres": ["Adventure", "Simulation"], "publishers": [], "esrb_rating": null}