{"id": 976338, "slug": "son-of-killwa", "name": "Son Of Killwa", "name_original": "Son Of Killwa", "description": "Embark on an epic journey of bravery and mystery in \"Son of Killwa,\" an enthralling adventure game that will keep you on the edge of your seat. Immerse yourself in a gripping narrative-driven 3D world, where every twist and turn unfolds a thrilling tale of courage and resilience. Take on the role of a determined protagonist, navigating through a stunning third-person perspective, as intense action and mind-bending puzzles await your skillful hands. Prepare for heart-pounding encounters with formidable foes and delve into challenging enigmas that will put your wit to the test. \"Son of Killwa\" promises an unforgettable quest where your decisions shape the destiny of the journey. Will you rise to the challenges that lie ahead, or will the shadows of doubt hinder your path to glory? Embark on this unforgettable odyssey, where a myriad of surprises awaits, and let your adventure begin!<h3>Riddles</h3><br/>Embark on an enthralling journey of survival, where the power of your mind holds the key to unlocking the secrets of sustenance. “Son of Killwa\" beckons you to think smart, think fast, and think sharp, as you decipher spoken riddles to navigate through the treacherous wilderness in search of food and water. The challenges may be daunting, but your intelligence will guide you, providing the crucial edge to overcome obstacles and seize victory. Will you dare to test your limits and conquer the unknown? The adventure awaits, where survival and intelligence unite in an unforgettable quest for triumph.<h3>Stealth</h3><br/>Embrace the shadows and hone your stealth in the ultimate test of survival. In “Son of Killwa\" every step you take is shrouded in danger as the battle-hardened enemy lurks nearby, keenly attuned to any sound or movement. Engaging in brute force is a perilous gamble against their deadly close-combat rebels and long-range snipers, leaving only the savvy few to consider the art of calculated attack or strategic retreat. The odds are against you, but with nerves of steel and a mind that weighs every move, the possibility of survival beckons. Will you evade their watchful eyes and escape into the night, or will you seize your moment and rise as the elusive victor in this enthralling game of wits and wiles? The fate of your life rests in your hands.<br/><h3>Fight Rebels</h3><br/>Prepare to dive into an exhilarating world where every choice is a matter of life and death. In “Son of Killwa\" we refuse to strip you of your power; wield the enemy's weapons with deadly precision, from snipers that cut through the darkness to swords that clash in close combat. But be warned, the path of confrontation is fraught with danger, and only the skilled will emerge unscathed. Your journey will force you to confront harrowing decisions: to fight and risk it all or to suffer the slow embrace of starvation. Can you navigate this treacherous tightrope of survival, balancing between life and demise? Your fate lies in your hands, and the world awaits your every move with bated breath.<h3>Find Food and Water</h3><br/>In the midst of this gripping tale of survival, you are thrust into a world where every morsel counts. As an ordinary civilian, untrained in the art of hunting and wilderness survival, your lifeline lies in the scarce remnants left behind by the rebels. Tables become your treasure troves, holding the key to sustaining your fragile existence. Yet, the haunting twist of fate in this war-torn realm comes in the form of an IBS stomach condition, a merciless adversary that siphons away your sustenance before it can fortify your body. Time becomes your foe as food slips through your grasp, urging you to embrace resourcefulness and cunning. Every bite is precious, and every decision holds the power to dictate your destiny. Can you muster the strength and intellect to endure this grueling dance with hunger, or will the relentless war within your body overwhelm you? The battle for survival commences, and only the craftiest minds will emerge triumphant in this unforgettable journey of resilience and determination.<h3>Build And Craft</h3><br/>Embark on a thrilling adventure where your past expertise as an engineer becomes your secret weapon for survival. Crafting in \" Son of Killwa: The Ingenious Quest\" is second nature to you, for your engineering prowess unlocks the secrets of resourceful ingenuity. No axes or pickaxes required, for the treasures you seek lie hidden amidst the rebel-held territories. Sharpen your wits, as your imagination and intelligence guide you to unearth the elusive resources needed to build your way to sustenance. Tables, abandoned structures, and concealed caches hold the keys to your salvation, and with every carefully fashioned creation, you inch closer to defying the odds. Can you engineer your path to survival, turning the remnants of a war-torn world into tools of hope, or will the challenges crush your aspirations? The journey of resilience and invention awaits, where the genius of your mind will carve the path to your very existence.", "metacritic": null, "released": "2024-02-03", "tba": false, "updated": "2024-02-09T01:46:00", "background_image": "https://media.rawg.io/media/screenshots/d7e/d7e36d30ac990a859a77070be4ad8517.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 518, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OSMAN ABDALLE"], "genres": ["Adventure"], "publishers": ["OSMAN ABDALLE"], "esrb_rating": null}