{"id": 9763, "slug": "metal-carnage", "name": "Metal Carnage", "name_original": "Metal Carnage", "description": "Metal Carnage is an online car-based shooter<br/>Welcome to the not-so-distant future. Natural resources have become more scarce than ever. Governments are no longer in control of the global economy and the world is run by private corporations who constantly battle for control over resources.<br/><br/>Large-scale global wars between corporations have proven ineffective. Now the corporations use a different tactic - each hires soldiers with well-armed vehicles to more quickly and stealthily accomplish localized missions. This mysterious band of lawless fighters came to call themselves Raiders. And you are one of them. Fight well and you'll be duly rewarded for your services.<br/><br/>As a raider you’ll buy, armor and customize your vehicles. Once you fight your first battle you’ll know what real action driving means. Speed, guns, sharp turns and earth-shattering explosions are your close friends in this grim world. Unleash destruction on whoever gets in your way.Modes<ul><li>Deathmatch<br/>Everyone around you is the enemy. Your only goal - kill them all. Minimum 1v1 online battle, up to 10 players at a time.<br/></li><li>Team Deathmatch<br/>Fight in squads of up to 5 raiders. Unlimited respawning means you must destroy the enemy team as many times as possible to earn points before time runs out. The team with the most points wins.</li></ul>VehiclesChoose from more than 20 vehicles<br/><ul><li>Are you a connoisseur of rarity? We’ve carefully restored classic models in case you’re going for that vintage look. <br/></li><li>Love off-roading? Go for bulk and power. We’ve got the most high-powered monsters around.<br/></li><li>Are you a race car driver at heart? We have a whole fleet of fast, high-performance vehicles at your disposal.</li></ul>Try them all and find your match.GunsCustomizable weapons system allows you to:<br/><ul><li>Hit the enemy with a torrent of machine gun fire.<br/></li><li>Blast those in your path with the hellish fire of a flamethrower.<br/></li><li>Burn holes in metal with a lazer. </li></ul>Have as much fun as you want!Customization and tuningA rich customization system lets you turn your metal monster into whatever you want it to be:<br/><ul><li>Install any weapon you want on any car you have;<br/></li><li>Individualize your armor, spoilers, bumpers and more. <br/></li><li>Get a full paint job, or meticulously touch up every detail.<br/></li><li>Choose from lots of awesome prints - including skulls, flames and blood stains - to make your vehicle uniquely formidable. </li></ul>Make every raider remember your colors and fear your arrival in battle.Business modelWe choose Buy to Play model for our game. All major balance and game process updates will be free for those who bought the game. Paid DLCs will only include cosmetic content, such as skins, paints, prints and stickers.", "metacritic": null, "released": "2016-11-17", "tba": false, "updated": "2022-09-30T00:39:49", "background_image": "https://media.rawg.io/media/screenshots/6fc/6fc17de9d64d9d2a2a27a069130130f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 141, "toplay": 1}, "playtime": 3, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "PC"], "developers": ["Playvision"], "genres": ["Action", "Racing", "Massively Multiplayer", "Indie"], "publishers": ["Playvision"], "esrb_rating": null}