{"id": 976336, "slug": "shop-legends", "name": "Shop Legends", "name_original": "Shop Legends", "description": "Pick up where your adventures left off and embark on a journey of legends...<br/>\n<br/>\r\nUpon your graduation from the most prestigious shopkeeping academy, you received an invitation from your uncle’s best friend, Jacque. Your uncle has mysteriously vanished, leaving the once most renowned shop unattended. Now, it’s time for you to step up and inherit this shop by applying your business acumen to reclaim the shops' status as the most preeminent across the lands. Do you have what it takes to go from zero to hero?<br/>\n<br/>\r\nImmerse yourself in an Idle Simulation Tycoon RPG like no other, where you are tasked with simultaneously expanding a profitable item shop, crafting legendary equipment to gear up visiting customers as well as commanding mighty heroes you've recruited to loot rare artifacts &amp; blueprints to challenge the top ranked shopkeepers!<br/>\n<br/>\r\n~~~~~~~~~<br/>\r\nBECOME A MASTER SHOPKEEPER<br/>\r\n~~~~~~~~~<br/>\r\n◆ CREATE and DESIGN your fantasy item shop with endless possibilities<br/>\r\n◆ CRAFT and FUSE powerful items to sell to visiting adventurers<br/>\r\n◆ TRADE with other shopkeepers to build your fame and wealth<br/>\r\n◆ CUSTOMIZE your shopkeeper avatar to express your own style<br/>\n<br/>\r\n~~~~~~~~~<br/>\r\nEXPERIENCE AN EXCITING ADVENTURE<br/>\r\n~~~~~~~~~<br/>\r\n◆ RECRUIT and equip mighty heroes, each with their own unique abilities<br/>\r\n◆ COLLECT epic loot across time limited dungeons and themed events<br/>\r\n◆ TEAM UP with your friends or make new ones to build a prosperous city<br/>\r\n◆ BATTLE bosses and slay titans together to amass fame and fortune<br/>\n<br/>\r\nWhat are you waiting for? All of these adventures and more awaits you–join the millions of players that have already made Shop Legends their home. Prepare yourself for endless adventure as Aragonia anticipates your awakening!", "metacritic": null, "released": "2024-02-03", "tba": false, "updated": "2024-02-09T01:38:34", "background_image": "https://media.rawg.io/media/screenshots/c93/c935b891749cb890be6aa75cd6091736.jpg", "website": "http://shopheroes.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 13}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["cloudcade"], "genres": ["Adventure", "RPG", "Strategy", "Simulation", "Casual"], "publishers": ["cloudcade"], "esrb_rating": null}