{"id": 976420, "slug": "space-strider", "name": "Space Strider", "name_original": "Space Strider", "description": "Space Strider is a 2D Sidescroller Shoot 'em up with Roguelite elements, where you beat hordes of enemies and defeat unique bosses. Unlock, upgrade and level up your Spaceships to become the ultimate Space Strider!<h3>Introduction</h3><br/>In an unknown galaxy in the distant future, many hostile creatures and renegade factions have controlled and steadily expanded their sphere of influence over the past few centuries, posing an ever-increasing threat to galactic peace. As the elected Admiral of the Alliance for Galactic Peace (AGP), it is your job to hunt down and defeat these creatures and renegade factions to restore galactic peace.<br/><br/>Face off against the Vultures in Blue Horizon, the Red Rebels in the Red Cluster, and the Crawlers in Viridius.<br/><br/>Unlock powerful upgrades and expand your fleet with unique Spaceships.<br/><br/><br/><br/><h3>Features:</h3><ul><li>Unlock and play with up to 10 different Spaceships with each having their own unique weapons</li></ul><ul><li>Level up your Spaceship during a run and choose a PowerUp to make it stronger</li></ul><ul><li>Upgrade your Spaceships with 20 different global Talents</li></ul><ul><li>Play in three different levels and beat different enemies and unique bosses</li></ul><ul><li>Increase the challenge with 5 different danger levels</li></ul><h3>Roadmap:</h3><ul><li>More levels and enemies</li></ul><ul><li>???</li></ul>", "metacritic": null, "released": "2024-02-03", "tba": false, "updated": "2024-02-09T07:35:00", "background_image": "https://media.rawg.io/media/screenshots/8c7/8c76a39df0d2e7410f3e5b7be70534df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Frost Moon Games"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Frost Moon Games"], "esrb_rating": null}