{"id": 976443, "slug": "abyssmare-2", "name": "Abyssmare", "name_original": "Abyssmare", "description": "<strong>Abyssmare </strong>is a near future science fiction world view based on the Cthulhu Mythos world view, and an action game based on Roguelite+first person shooting.<h3>gameplay：</h3><strong>1.Old-School FPS</strong><br/>With ultra-high movement speed and sustainable output of powerful firepower, all you need to do is attack and explode all the living creatures.<br/>Your goal is to explore the dungeon and find the elevator that leads to the lower level. During this process, you can search for resources in the maze to strengthen yourself, such as ammunition, medical kits, energy crystals, and various weapons and equipment.<br/><br/><br/><strong>2.Manual random maze</strong><br/>On the surface, it is a randomly generated maze, but in reality, all changes in the maze are artificially designed.<br/>This game aims to achieve randomness while ensuring a maze exploration experience.<br/><br/><br/><strong>3.Weapons and Equipments</strong><br/>More than 30 completely different firearms.<br/>More than 20 sub weapons with different functions.<br/>Each profession has a melee weapon.<br/>More than 40 different equipment components, each with unique functions and effects.<br/>The quantity of these items will continue to be updated.<br/>I hope this can enhance your enjoyment of exploring the maze.<br/><br/><br/><strong>4.Roguelite game</strong><br/>This game has two growth cycles.<br/>Growth in a single adventure: includes acquiring weapons and equipment, improving personal attributes, obtaining random buffs, and shopping in temporary stores.<br/>Growth through multiple adventures: The protagonist can obtain a certain amount of resources for each adventure, regardless of victory or death. After completing a single adventure, they can consume resources and permanently enhance the character's strength.<br/><br/><strong>5.Action-RPG game</strong><br/>This game has certain RPG elements, such as custom characters, equipment, and random entries on equipment, character professions, character attributes, etc.<br/><br/><br/><strong>6.Enemies</strong><br/>16 regular enemies+10 bosses, and will continue to be updated.<br/>Except for human enemies, they are all based on the classic Cthulhu Mythos series novels.<h3>Cthulhu Mythos elements:</h3>In this game, monsters and old dominators in the Cthulhu Mythos, whose size is approximately similar to that of human beings and may be destroyed by human weapons, are selected as enemies, and a new image is designed for them.<br/>Most enemies have undergone physical modifications and are wearing \"ShenWei\" exoskeletons, hoping these will make you feel interesting.", "metacritic": null, "released": "2024-02-04", "tba": false, "updated": "2024-02-09T09:30:02", "background_image": "https://media.rawg.io/media/screenshots/213/213770e91de067f58528c5d9b8fa5d3a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mr.Panda.Studio"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Mr.Panda.Studio"], "esrb_rating": null}