{"id": 976471, "slug": "beetle-nest", "name": "Beetle Nest", "name_original": "Beetle Nest", "description": "Try yourself as a commander in the new Rouge-lite shooter with a top view! Upgrade your clones, explore planets, unlock new weapons and costumes. Don't let the waves of hostile creatures defeat you! <br/><br/>Beetle Nest is a survival game in which you have to collect resources and use them wisely to fight against hostile inhabitants of various planets. Remotely control the clones and live as long as possible! A large amount of equipment, devices, unique abilities and weapons will help you in the fight for survival.<br/><br/>The year is 2168. The earth is dying. There are fewer and fewer resources, the environment is worse, and there are more and more people. <br/>The largest companies from earth are beginning preparations for the colonization of planets and the division of influence in space. You are one of the successful commanders from earth, who has already had experience in conducting operations in space, and decide to join one of the companies - Vexillum Ubiquitous. You will have to lead a mission to clear habitable planets from hostile inhabitants. Use clones to achieve your goals. <br/><br/>Prove your loyalty to Vexillum Ubiquitous.<br/><br/><br/><br/><br/><strong>By exploring new places, you will be able to unlock more powerful weapons!</strong><br/><br/><br/><br/><strong>The game has more than 12 unique character upgrades, combine them with your style of play and achieve more!</strong><br/><br/><br/><br/><strong>Explore the planet, find new buildings, study your enemies and try to hold out as long as possible!</strong><br/><br/><br/><br/><strong>More than 18 unique devices that will help you survive in harsh conditions!</strong>", "metacritic": null, "released": "2024-02-05", "tba": false, "updated": "2024-02-09T11:13:00", "background_image": "https://media.rawg.io/media/screenshots/92d/92dda34962a7bd994aa4f88fb7334c18.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Untitled Level"], "genres": ["Action", "Indie"], "publishers": ["Basement Arts"], "esrb_rating": null}