{"id": 976499, "slug": "o-holy-knight", "name": "O Holy Knight", "name_original": "O Holy Knight", "description": "<h3>\"O! Holy Knight\" invites you to embark on an exhilarating journey into a medieval fantasy world teeming with peril and adventure. Assume the role of the Holy Knight, tasked with leading a formidable squad of warriors through treacherous landscapes, defeating relentless waves of monstrous foes.</h3><br/><br/>Ascend to the helm of tactical mastery as you control the intricate formations of your medieval squad. Direct knights, archers, and mages with precision, orchestrating a dance of blades and magic on the battlefield. Harness the power of strategic formation to exploit enemy weaknesses, creating an unbreakable wall against the relentless waves of monstrous adversaries.<br/><br/><br/><br/><br/>Celebrate every hard-won victory as your squad gains invaluable experience, unlocking a myriad of skills and abilities. Tailor your unit's prowess, creating powerful synergies that complement your meticulously crafted formations. Evolve your strategy dynamically, ensuring your squad stands resilient against the ever-intensifying challenges.<br/><br/><br/><br/><br/>Immerse yourself in the stunning, high-fidelity world of \"O! Holy Knight\" with captivating cell-shaded visuals. Watch as your medieval warband comes to life in vibrant, toon-rendered detail. Every knight, archer, and mage is meticulously crafted to deliver a visually striking experience, ensuring that every formation and battle unfolds with flair.", "metacritic": null, "released": "2024-02-06", "tba": false, "updated": "2024-02-09T13:20:47", "background_image": "https://media.rawg.io/media/screenshots/940/9402491567db21d884d54fcf634012d8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Terapoly"], "genres": ["Action"], "publishers": ["Terapoly"], "esrb_rating": null}