{"id": 976526, "slug": "monster-parade-nurturing-a-heros-sacred-sword", "name": "Monster Parade: Nurturing a Hero’s Sacred Sword!?", "name_original": "Monster Parade: Nurturing a Hero’s Sacred Sword!?", "description": "As they say, \"It's not good to hold it in.\"<br/>But who would have thought that mingling with gorgeous monster girls would power you up!?<br/><br/><br/><strong>STORY</strong><br/><br/>In a world known as Ecstasia,<br/>humans and demonoids occupied their own respective realms<br/>and lived alongside in peace.<br/><br/>At some time,<br/>Lelou—a demonoid of the Succubus species—<br/>was born possessing great strength and an evil nature.<br/>She robs the throne and institutes a reign of terror,<br/>setting forth an era of gloom.<br/><br/>There was, however, one being<br/>that was determined to bring her down.<br/>Her name is Shuri—daughter of the former monarch.<br/><br/>When Shuri learns of a \"hero\" being summoned to the human kingdom,<br/>she builds hopes on him being able to subdue the Demon Monarch.<br/><br/>This \"hero\" possesses tremendous powers that could only be brought out through sexual intercourse;<br/>thus, the dungeons leading up to the Monarch's palace turn into a \"breeding ground\" for nurturing the hero's \"sacred sword.\"<br/><br/>Shuri discreetly guides the hero through the dungeons, assisting him to defeat the monster girls dwelling within.<br/>After subduing them, the hero unleashes his sexual desires upon them, making him stronger with every screwing session.<br/><br/><br/><strong>FEATURES</strong><br/><br/>Your objective is to renovate the dungeons to guide the hero, who moves automatically.<br/>You can install and destroy walls to shield the hero or lead him to confront enemies;<br/>install treasure chests to strengthen him in battle; or even command him to retreat when in a crunch.<br/>Shuri will acquire mana by clearing each dungeon; allowing her to unlock additional skills to assist the hero.<br/><br/>This game will provide you with quick comfort after clearing every dungeon, but don't let your guard down!<br/>The Demon Monarch will not go down that easily!<br/>Happy mingling!", "metacritic": null, "released": "2024-02-06", "tba": false, "updated": "2024-02-09T14:51:48", "background_image": "https://media.rawg.io/media/screenshots/71f/71f020372506eb3f1a45072f587ecad2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["YU-CHU-BU!"], "genres": ["Strategy"], "publishers": ["YU-CHU-BU!"], "esrb_rating": null}