{"id": 976681, "slug": "forgotten-monsters", "name": "Forgotten Monsters", "name_original": "Forgotten Monsters", "description": "In this game, you'll be shooting down crowds of monsters that relentlessly try to destroy you. They are ruthless and come with various characteristics – some explode when they get close, some have increased health, and others create two small copies upon defeat. Firearms of different types, such as shotguns and acid-shooting weapons for extra damage, will aid you in annihilating these enemies. Some weapons even bounce off walls. Your agility is crucial for victory!<br/><br/><strong>Game Features</strong><br/><ul><li><strong>Dynamic Gameplay:</strong> Experience an intense and dynamic gaming environment that demands quick reactions and agility for survival against relentless hordes of monsters.<br/></li><li><strong>Variety of Enemies:</strong> Encounter a diverse range of monsters, each with unique characteristics such as explosive tendencies, increased health, and the ability to spawn copies, ensuring constant variety in combat scenarios.<br/></li><li><strong>Diverse Arsenal:</strong> Access a variety of firearms, each with distinctive features, including shotguns, acid-shooting weapons for extra damage, and weapons that bounce off walls, providing strategic choices for engaging enemies.<br/></li><li><strong>High-Quality Graphics and Sound:</strong> Immerse yourself in the game's atmosphere with top-notch graphics and sound design, enhancing the overall gaming experience.<br/></li><li><strong>Agility Focus:</strong> Emphasizing player agility, the game requires nimble movements and quick reflexes, making strategic use of the environment to overcome challenges and emerge victorious.</li></ul>", "metacritic": null, "released": "2024-02-09", "tba": false, "updated": "2024-02-12T04:18:13", "background_image": "https://media.rawg.io/media/screenshots/d83/d8395b07f52af6e24d435c5934fd03e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["galesoozka"], "genres": ["Action"], "publishers": ["galesoozka"], "esrb_rating": null}