{"id": 976630, "slug": "yue-lan-chuan-qi-remakegu-wen-ming-zhi-mi", "name": "月藍傳奇REMAKE古文明之謎", "name_original": "月藍傳奇REMAKE古文明之謎", "description": "<h3>author's note</h3>Hello everyone, I'm Angel Cake.<br/>Moon Blue Legend 1 and 2 are independent games that I created during my university years using RPG Maker 2003.<br/><br/>The <strong>Moon Blue Legend Remake</strong>, while being a remastered version of the first game, has undergone a major overhaul in terms of its gameplay content.<br/> <br/>Whether you're an old player from back in the day or a new player who's never experienced it before, we believe you'll be drawn in by this game that is both funny and heart-warming, as well as full of passion.<h3>Story Summary:</h3>Lu Weipi goes about his daily missions of \"hunting and teasing female villagers.\" <br/>With no grand ambitions, he just wants to find a wife. <br/>But his dull life is eventually shattered as he travels throughout the kingdom and gradually uncovers the veil of an ancient civilization.<br/><br/>The young man is not a great hero, nor does he have any extraordinary abilities, yet he discovers that ordinary people can also achieve extraordinary things...<h3>Game Features:</h3><br/><br/>1.Rich emotional ups and downs:<br/>The story of this game is about 60% satire and 40% serious, full of a lot of silly and sometimes slightly suggestive jokes. In addition to the humor, the plot also touches on many topics related to life and death, as well as family relationships. We won't hold back when it comes to making you cry, so you'll definitely experience a fun and emotional gaming experience.<br/><br/><br/>2.Diverse gameplay:<br/>The gaming experience of this game is very similar to the JRPG designs of 20 years ago and has a variety of gaming elements. In this game, you can experience the following gaming experiences:<br/>(1) Rich storyline<br/>(2) Dungeon exploration<br/>(3) Playing as a Japanese-style hero searching houses<br/>(4) A large number of puzzle-solving mechanisms<br/>(5) Exciting boss battles<br/>(6) Various equipment combinations<br/><br/><br/><br/>3.Unexpected endings:<br/>The story of this game actually has many foreshadowing elements. When the truth is revealed, will you exclaim, \"I knew it!\" or \"How could this happen!?\" Let's wait and see.", "metacritic": null, "released": "2024-02-11", "tba": false, "updated": "2024-02-12T02:56:30", "background_image": "https://media.rawg.io/media/screenshots/6b1/6b1a3c494acdbdeeba175b73ea8e5dbd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["咕咕咕", "天使蛋糕", "攸藍", "牙籤", "黃金", "鎧特"], "genres": ["RPG", "Indie"], "publishers": ["RMAsia"], "esrb_rating": null}