{"id": 976639, "slug": "unreality", "name": "Unreality", "name_original": "Unreality", "description": "<strong> Welcome to Unreality, a unique experience that will immerse you in a fascinating journey through the cosmos. In this platformer game, you will embark on an odyssey alongside our light particle, facing thrilling challenges as you explore beautiful vistas of planets and galaxies. </strong><h3> Difficulty </h3> Precision in jumps and reaction time will be key to overcoming the challenges that await you. With three difficulty modes, Unreality offers you the opportunity to customize your gaming experience.<br/><br/><h3>Levels and Lives</h3> Each chapter features three levels, totaling 15 levels. Throughout your adventure, you will have three lives per level and a strategic checkpoint midway through the course. But beware! If you lose all three lives, you will be forced to restart the level from the beginning. Unreality's retro style will transport you to a visually captivating universe.<br/><br/><h3>Enemies</h3> Each enemy in Unreality has a characteristic color and a unique movement, forming shapes and patterns that are challenging to overcome, adding a strategic element to your cosmic journey.<br/><br/><h3>Shield</h3> For those moments when the difficulty intensifies, the shield will come to your aid. If you face insurmountable obstacles in a specific area, the shield will allow you to progress without losing the magic of the game.<br/><br/><h3>Atmosphere and Soundtrack</h3> The spatial ambiance of Unreality is unique, as all galaxy and cluster images are real captures from NASA's Hubble and Chandra space telescopes. Immerse yourself in the beauty of the cosmos as you overcome each level. The musical atmosphere, featuring compositions by Karl Casey @ White Bat Audio, will accompany you in every jump and challenge, further immersing you in the Unreality experience.<h3>Advanced Gamepad</h3> Accessibility is a priority in Unreality, as it is compatible with most generic gamepads. The game features a custom mapping system to adapt to each controller. Additionally, gamepad options are fully adjustable, allowing you to change jump and movement buttons to facilitate one-handed gameplay, especially designed for players with this condition.<br/><br/><strong>Get ready to explore, jump, and face challenges in this thrilling world. Are you ready for the adventure in Unreality? Let the intergalactic journey begin!</strong>", "metacritic": null, "released": "2024-02-08", "tba": false, "updated": "2024-02-12T03:07:49", "background_image": "https://media.rawg.io/media/screenshots/f4e/f4e096ed8f6a81861fc0ccc7095dc991.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Johnny Ramos Pizarro"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Johnny Ramos Pizarro"], "esrb_rating": null}