{"id": 976671, "slug": "lip-lewd-idol-project-vol-3", "name": "LIP! Lewd Idol Project Vol. 3", "name_original": "LIP! Lewd Idol Project Vol. 3", "description": "<strong>LIP! Lewd Idol Project</strong> is a yuri Visual Novel series about a girl's adventure to becoming an Akihabara Lewd Idol!<br/><br/>Join Kairi in her adventure and explore the city, meet new girls, and try to form a group overcoming all the odds while having a lot of <strong>girl-on-girl action</strong>!<br/><br/>Make sure to grab our <strong>Lewd Idol Project Bundle</strong> with special discounts if you don’t own the previous installments!<br/><br/><br/><br/><strong>Kanako </strong>is a tough and temperamental rocker girl, leader of a troublesome gang in <strong>Akihabara </strong>and bassist of her own band. She's also a little bit tsundere, but... <strong>Don't you dare say that to her face</strong>!<br/><br/><strong>Ranko </strong>sees in this girl the potential to be the third member of the group of <strong>lewd idols</strong>. Her attitude, charisma, and popularity among her people makes <strong>Kanako</strong> the perfect candidate to give the group that touch of aggression that is lacking, in order to gain the attention of a new type of audience attracted to bad girls. But... <strong>It is impossible that a girl like her would want to join a group of idols</strong>!<br/><br/>However, it seems that <strong>Kanako </strong>hides more than one secret behind her exterior attitude… Could her opinion on the <strong>lewd idol world</strong> change a bit after meeting the sweet and innocent <strong>Kairi-chan</strong>? Will the <strong>Lewd Idol Project</strong> leader cuteness be able to convince this tsundere girl to show her true feelings?<br/><br/><strong>Find out all this and more, with lots of girl-on-girl action, on LIP! Lewd Idol Project Vol. 3</strong>!<br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><ul><li>High quality anime-style artwork<br/></li><li>Fully uncensored yuri 18+ CGs<br/></li><li>Unlockable CG Gallery to view erotic scenes and character sprites<br/></li><li>Alternative Costumes and Collectibles to unlock<br/></li><li>Gacha and Crane Machine Mini-Games<br/></li><li>Relationship Meter between the girls<br/></li><li>Akihabara Exploration<br/></li><li>Multiple Paths to take<br/></li><li>Photo Mode<br/></li><li>Jukebox Mode<br/></li><li>Partial Japanese voice acting</li></ul><br/><br/><strong>Unlock and enjoy</strong> both wholesome and erotic yuri CG scenes in <strong>Gallery Mode</strong>!<br/><br/><br/><strong>The Lewd Idol Project girls</strong> will have many new <strong>alternative costumes</strong> that you can unlock and enjoy along the adventure.<br/>Swimsuit, lingerie, magical girl, maid, naked apron, shrine maiden, bunny girl, you name it!<br/><br/><br/>After getting a new costume, you'll get unlimited access to them in <strong>Wardrobe Mode</strong>. <strong>Try to unlock them all</strong>!<br/><br/><br/>Take a break from business while exploring <strong>Akihabara </strong>in order to play some <strong>Gacha or Crane Machines</strong>!<br/><br/><br/>Explore your <strong>Collection</strong> gallery and enjoy your Gacha and Crane Machine prizes. <strong>Can you get them all</strong>?<br/><br/><br/>Our heroines will have a <strong>relationship meter</strong> that will increase or decrease each time you take an <strong>action or dialogue decision</strong> while interacting with each other.<br/>Build your meters up to 100% and <strong>unlock extra scenes and dialogues</strong>!<br/><br/><br/>Explore the wonderful city of <strong>Akihabara</strong>, discover some of its most famous and fun spots and have a blast in the <strong>Otaku City</strong>!<br/><br/><br/>During the adventure, you'll have the chance to choose which <strong>LIP! girls you'll play as</strong> on certain paths and exploration segments.<br/><strong>Be careful</strong>, your actions and decisions might affect future outcomes!<br/><br/><br/><strong>Create your own scene</strong> with your favorite girls and costumes and take a picture to <strong>save on your device</strong>!", "metacritic": null, "released": "2024-02-09", "tba": false, "updated": "2024-02-12T03:58:54", "background_image": "https://media.rawg.io/media/screenshots/168/168c7817034950e498f7ecc2a62fb411.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Toffer Team"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Denpasoft"], "esrb_rating": null}