{"id": 976642, "slug": "legumi", "name": "Legumi", "name_original": "Legumi", "description": "<strong>Legumi</strong> are a small, helpless species of bean-eating creatures that used to possess the secret to <strong>True Happiness</strong>. However, the secret has been lost for generations. In times of old, legumi would embark on quests, following invisible roads dotted with mysterious <strong>wisdom houses</strong>, which would lead to the place where True Happiness could be found. But the world has grown dangerous and full of monsters. Such a quest has not been attempted for generations.<h3>the Quest</h3>You play as a young legumi who is just brash and sad and brave enough to set out on the first Quest for True Happiness in living memory. Your survival will depend on your ability to manage your time, your beans, and the legumi's secret weapon, pips. <br/><ul><li>Once you leave the comfort of town, you will have sixty seconds of energy for exploring<br/></li><li>Eating a bean will give you ten seconds of energy and two \"pips\"<br/></li><li>Pips are small, harmless explosives that can be thrown to scare off monsters<br/></li><li>Everything of interest in the world will appear as a distant glisten until you're close enough to get a better look<br/></li><li>If what you found is a monster, you can shoo it away by either satiating it's <strong>hunger</strong> with beans, or matching it's <strong>startle</strong> with pip explosions<br/></li><li>Pips all pop a random power between 0 and 3. You can throw as many as you think you need to to reach a monsters' bravery number. <br/></li><li>If you find a <strong>bean plant,</strong> you can harvest it for three beans. They will grow back in sixty seconds!<br/></li><li>explore until you find all the <strong>wisdom houses</strong> in an area, at which time the <strong>secret exit</strong> to the next area will appear somewhere nearby.</li></ul><h3>Features</h3><ul><li>Collect money from foes and treasure, and upgrade yourself in towns. Become faster, braver, luckier, smarter, and less likely to fail.<br/></li><li><strong>Somewhat random</strong>: Legumi is never the same game twice! Objects of interest are shuffled around inside their regions, and shuffled again whenever you do fail.<br/></li><li>Boppin' original soundtrack<br/></li><li>The mysterious <strong>Champion's Labyrinth</strong> mode, available to Legumi masters, shuffles everything in the game around to provide a fresh new challenge</li></ul>", "metacritic": null, "released": "2024-02-08", "tba": false, "updated": "2024-02-12T03:11:37", "background_image": "https://media.rawg.io/media/screenshots/eaa/eaafe88839646a2b443bd6e407f2c1e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Teddykaboom"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Teddykaboom"], "esrb_rating": null}