{"id": 976778, "slug": "folgore", "name": "Folgore", "name_original": "Folgore", "description": "<h3>what Is Folgore </h3>Folgore is a top view fighting game, inspired by comics, taking place in south Italy at the end of the 60’s. <br/><br/>To save his fiancée and his honor, the hero must cross the city of Olimpia, inspired by Naples, and eliminate all types of enemies on his way to the final boss. To do that, he makes a pact with the Folgore, a divine artifact endowed with electrical powers from Jupiter, but renowned to be dangerous for its owner .<br/><br/>With the Folgore, the player can attack by combining melee attacks and electrical powers. He can also interact with his environment to stun his enemies and continue the level.<br/>During some scenarized moments, an ultimate power called the overload activates to remind the instability of the Folgore and make the player experience even more pleasurable.<br/><br/><br/>The goal in Folgore is to let off steam while playing an original game full of dark humor. The player needs to feel the strength of his powers, but also the shift of the “hero” to the dark side.<br/><br/>To treat this subject correctly, we took a lot of inspiration from dark comics like Batman, we decided to combine 2D and 3D to accentuate this.<br/>To understand the genesis of Folgore, look at a comic book. But instead of reading it, you are going to play it.<br/><br/><br/>In Folgore, we wanted a strong identity : the temporality of the game is unique, blending the Italian 50’s and Roman mythology, which allowed us a lot of liberty, especially for the creation of enemies. The dark comics aesthetic and humor of the game remind the player of the anti-hero personality of the playable character, but also the grim after-war period in Italy. For the gameplay, we came back to the basics : not a lot of inputs and a gameplay easy to learn that needs to be mastered to be effective. The originality resides in the electrical powers that Giove got from the Folgore : It allows him to interact with his environment and perform faster and more powerful attacks and movements, while getting the player to manage his power gauge to survive the enemies' waves. Finally, even if it's better to play the game with a controller, we chose to adapt the game for arcades to remember the feeling of an old school beat them all.<h3>Team: </h3><br/>Hugo Angel : Sound Designer (Audio Workshop)<br/>Sasha Bassanetti : Sound Designer (Audio Workshop)<br/>Léo Beauchamp : Lead Scenario / 2D Artist (ETPA)<br/>Khenan Benanou : Lead Programmer / AI Programmer / Lead Level Design (ETPA)<br/>Eve Cabanié : Lead Producer / Lead Artistic Direction / 3D Character Artist (ETPA)<br/>Sami Delvallée : Lead 3D Artist / Environment Artist / Lead Sound Design (ETPA)<br/>Mathis Dinger : Lead VFX / Programmer (ETPA)<br/>Thomas Exshaw : 3D Props Artist (ETPA)<br/>Maxime Maridet : Lead Animator / Rigger (ETPA)<br/>Edouard Mordant : Gameplay Programmer / Lead Game Designer (ETPA)<br/>Anaïs Tigneres Agout : Lead 2D Artist / UI-UX Designer / 3D Props Artist (ETPA)", "metacritic": null, "released": "2024-02-14", "tba": false, "updated": "2024-02-16T06:40:15", "background_image": "https://media.rawg.io/media/screenshots/fa0/fa02df9b4830c670e9e6953efd885de6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 299, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["171 Materials"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["ESMA - Ecoles Creatives"], "esrb_rating": null}