{"id": 976772, "slug": "genso-chronicles", "name": "Genso Chronicles", "name_original": "Genso Chronicles", "description": "Embark on a journey with Light, a resident of Selka Village, who, after joining the coveted Holos Over military, vows to protect his village. However, during a mission, the village falls prey to an unknown assailant, leaving it in ruins. In despair, Light hears the call of a guardian beast. To gain strength, Light follows the words of the guardian beast and fulfills a mystical contract.<br/><br/><h3>Key Features:</h3><h3>1. Bonds with Companions and Guardian Beasts:</h3>Forge deep connections with your comrades and guardian beasts. The stronger the bond, the more the guardian beasts unleash their power, enhancing collaboration with allies. The strength of these bonds can even influence the course of in-game events.<br/><br/><h3>2. Forging and Strengthening:</h3>Discover materials scattered across the field for forging and strengthening. Strengthen your weapons and armor by using these materials. Acquire forging books through missions or guild tasks, unlocking new variations for enhancements. Occasionally, this process may yield powerful weapons, adding a strategic layer to your arsenal.<br/><br/><br/><br/>Immerse yourself in a captivating world where bonds shape destiny, and strategic enhancements forge a path to victory. Will you answer the call of the Guardian Beasts and restore Light's village to its former glory? Join the adventure now!<br/><br/>", "metacritic": null, "released": "2024-02-15", "tba": false, "updated": "2024-02-16T06:26:21", "background_image": "https://media.rawg.io/media/screenshots/e79/e794e244eacb60f71d363d59136b6d42.jpg", "website": "https://www.kemco-games.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 451, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hit-Point Co.,Ltd."], "genres": ["Adventure", "RPG", "Strategy", "Simulation"], "publishers": ["KEMCO"], "esrb_rating": null}