{"id": 976718, "slug": "basketball-duel-online-1v1", "name": "Basketball Duel: Online 1V1", "name_original": "Basketball Duel: Online 1V1", "description": "Basketball Duel:Online 1V1 is a casual competitive basketball game, discover the fancy ways of basketball, challenge like-minded fans, and show off your strengths on the court. Here, there is more than the thrill of beating your opponent, there is also the exciting experience of nirvana. The game's social forum has been opened, so you can interact and make friends, and there are rich gifts sent every week!<br/><br/>[Newly upgraded, smooth operation and various ways to play]<br/>1v1 isolation, three rounds of brawl, free throw, three-point competition, free confrontation and seasonal challenges, and many other ways to play. Smoothness upgrade, flexible operation, action skills flowing, fully demonstrate the super basketball strength, fancy dazzling skills, so that each foul dunk are a breath of fresh air, handsome.<br/><br/>[Player development, rich costume, match as you like]<br/>There are many players with different styles and skills to create different personalized players, a variety of costumes, a rich nurturing system, free to choose as you like, character strengthening, skill upgrades, easy to create a handy exclusive player.<br/><br/>[Real-time competition, fast match, fierce battle]<br/>Fast matchmaking, fast start! Present the original basketball experience. The original basketball experience is presented. Friends, online dating, players real-time pvp, ready to start a battle anytime, anywhere, three minutes to a drenched basketball experience. When you enjoy the game in your spare time, you can also make friends with a group of basketball fans from the north and south, invite them to play against each other, get the joy of basketball, enjoy the tacit empathy, and pursue the thrill of the kill!<br/><br/>[Talent help, Zone open, the top of the duel]<br/>Passive skills, active skills fully open, buff help, strong combination, will be able to cast for you the coolest hot-blooded basketball fighting power, with the strength to carry the field, with the technology to break through the top of the list. who is the next basketball super champion?", "metacritic": null, "released": "2023-11-21", "tba": false, "updated": "2024-02-12T05:18:28", "background_image": "https://media.rawg.io/media/screenshots/56b/56b7e1ea2bd014edbb2df8e0018b637e_csHKZ9r.jpg", "website": "https://sagi.games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Wuhan Changqu Technology Co"], "genres": ["Sports", "Casual"], "publishers": ["Wuhan Changqu Technology Co"], "esrb_rating": "Everyone 10+"}