{"id": 9768, "slug": "gameguru", "name": "GameGuru", "name_original": "GameGuru", "description": "Welcome to GameGuru, the easy game maker. Our mission is to create the easiest and most enjoyable game creator. Join us and our great &amp;amp; enthusiastic community on this journey.  Imagine creating a world that you and your friends come together and play... and creating it could be a matter of minutes with no technical jiggery-pokery needed at all! Of course, you can happily spend hours, days..even weeks creating your masterpiece, the great thing about GameGuru is, you won't be held up by learning strange alien languages or using complex modelling tools. The time you spend with GameGuru is all about creating and having fun whilst doing it.<br/><br/><br/><br/>With GameGuru you can make a multiplayer game in just a few minutes.  Providing your friend has a copy of GameGuru, you can host a level and your friend can join in. Up to 8 players are supported.<br/><br/><br/><br/>GameGuru comes with over 20 ready-made game levels and demos for you to play and enjoy. They will show you the sort of games that can be created and how they were done, plus you can adapt these pre-made game levels and put your own unique spin on them. You’re then ready to go and design your own unique games!  We believe there is nothing on the market which is as easy to use and as quick to allow you to share your creations with others.  <br/><br/><br/><br/>GameGuru offers you an easy yet comprehensive game creation process that is open to non-programmers and designers/artists, or anyone who aspires to become a game creator. It also has powerful editing tools for those who want to take their game creation to an even greater and more complex level. The power is there at your fingertips.<br/><br/>As a welcome bonus, we have also included an expansion pack with over 2.8 GB of additional game assets for you to get started, completely free! In fact, all the art you see in the screenshots above are included in GameGuru and you are free to include them in your games, no strings attached.  We do sell additional content DLCs, but with over 6,000 megabytes of game assets already crammed into GameGuru, the DLCs are entirely optional.<br/><br/><br/><br/><strong>You just need to follow these easy steps – welcome to the world of game creation! </strong><br/><br/><strong>Create your virtual 3D world – Game Design</strong><br/><br/>Construct huge game levels with the easy to use Level Editor. Sculpt your initial game design, add content and then play your game with one click of the Test Game icon:<br/><br/><ul><li>Design your game and levels adding hills, mountains, water, paths, terrains until you have created the world you want for your game<br/></li><li>Add all your environmental items, pick animated 3D objects including buildings, trees/vegetation, man-made objects/barriers with pre-set customizable properties <br/></li><li>Set the mood by controlling all aspects of the 3D rendered scene with easy to use sliders and combo box choices, including sky/ambiance, day/night scenes, lighting settings. </li></ul><br/><br/> <br/><strong>Decide what your game is – Game Plan</strong><br/><br/>Have you ever wanted to create the game only you can dream of? Now you have the tools to do exactly that, possibly for the first time ever! You can create games very quickly and easily, or add more and more depth as you wish to create a unique game experience:<br/><br/><ul><li>Create your dream game, whether it’s Modern-day FPS Action, Horror/Zombies, Sci-Fi/Fantasy, Cartoon/Zany, Medieval/Historical and many more - you choose! <br/></li><li>Give your game objectives, missions, weapons, puzzles, collectables from a suite of pre-set objects supplied, or create/buy/customise new objects. <br/></li><li>Add characters to your game from the stock media or design your own with the Character Creator.</li></ul><br/><br/><strong>Now make your game come to life! – Game Crafting </strong><br/><br/>Using the editing tools you can add more depth and details to your game, make the scenes more complex and improve the objectives of your game to challenge experienced gamers:<br/><br/><ul><li>Use the 3D editing mode to fine-tune your game design <br/></li><li>Add all the game-play aspects you want in your game and make adjustments <br/></li><li>Use the assets supplied free with GameGuru or import your own<br/></li><li>Use the editing tools to make your characters and objects unique, give them additional behaviors using the powerful LUA scripting language.</li></ul><br/><br/><br/><strong>Create, share &amp; sell your game – The final result!</strong><br/><br/>Once you have your finished game you can make it available to your friends and other gamers. GameGuru is unique in what it can offer, all at no additional cost: <br/><br/><ul><li>Build your final game - ready to play and share<br/></li><li>Save your standalone game as an executable file to use as you wish <br/></li><li>Publish your game and sell it to others, all royalty free <br/></li><li>Make, share and play multiplayer games with other GameGuru users</li></ul><br/><br/><br/><strong>Our mission</strong><br/><br/>Our mission is to develop an affordable game creator that's easy and fun to use, taking away some of the traditional difficulties of games development and allowing both new and experienced users the ability to create games quickly. We're a UK Indie development team with over 20 years of experience and we're an Intel Black Belt developer. <br/><br/>GameGuru is being designed by gamers for gamers and we want to design and create it along with our active and enthusiastic community. As the product is community lead, the software is in constant development and growing all the time, and we invite you to share the journey with us and help shape GameGuru into an awesome creative tool.<br/><br/><br/><br/><strong>Our Vision</strong><br/><br/>Our vision is to produce The Ultimate Easy To Use 3D Game Creator for the PC - A solution that is easier and more affordable than it’s competitors, with a strong community lead development to keep it growing and improving.<br/><br/>We'll embrace new and exciting hardware, acting as champions as we pioneer new experiences and in the process creating fresh new game creating communities. We'll keep expanding the gaming possibilities of GameGuru as we move forward. <br/><br/>Developing game creation tools is what drives us - we're super passionate about finding ways to make the whole game creation process as easy as possible. <br/><br/><br/><strong>The Technical Stuff</strong><br/><br/>For those who want to understand more – here are the main elements of GameGuru:<br/><br/>3D Game Engine &amp;amp; Editor <br/><ul><li>Easy to use, drag &amp;amp; drop style<br/></li><li>Birds eye view &amp;amp; 3D fly editing systems<br/></li><li>Game world – Construct levels for your games <br/></li><li>Terrain editor – With easy to use controls you can create unique environments<br/></li><li>Infinite vegetation system – Vegetation is auto generated, just paint it on the map <br/></li><li>Rendering engine – powering the shaders to make your games look great<br/></li><li>Level of detail – The game engine supports Level Of Detail technology (LOD)<br/></li><li>Cascade shadow mapping – Real-time dynamic sun shadow<br/></li><li>Lightmapping – Add fast shadows to your levels with the shadow baking system<br/></li><li>Ambient Occlusion Mapping – A feature of the lightmapper<br/></li><li>Sky maps – Choose from a wide range of high-resolution sky maps<br/></li><li>Occlusion Culling System – Fast rendering from a special object culling system <br/></li><li>Water plane – A reflective water plane adds a visual touch to your levels<br/></li><li>Light Rays – Let the light flood your game scenes with cool god rays<br/></li><li>Shaders for all – shader technique modes to best suit your PC’s capabilities <br/></li><li>Import your own .x / .3DS files  <br/></li><li>Connect to the Asset Store to extend your library of game assets</li></ul><br/>Physics <br/><ul><li>GameGuru uses the Bullet Physics engine to create realistic physics events <br/></li><li>Rag-doll deaths of characters </li></ul><br/>Game Characters &amp;amp; Weapons<br/><ul><li>Customize character in-game properties<br/></li><li>Simple Character Creator<br/></li><li>A.I scripts control characters - Scripts are coded using the LUA language<br/></li><li>GameGuru comes equipped with a range of stock weapons and ammo packs <br/></li><li>Modern day weapons – Colt 1911, Shotgun, Uzi, Magnum, Launcher and Rifle<br/></li><li>Explosive Munitions – RPGs, grenades and landmines  <br/></li><li>Ammo pick-ups – Reload weapons during game-play with ammo pickups <br/></li><li>Animated – Fully animated weapons with improved handling and realistic sounds <br/></li><li>Jet-pack - A special Jet-pack object lets you fly around your game world</li></ul><br/>Multiplayer on Steam (GameGuru is required by all users to play multiplayer games)<br/><ul><li>Build games with multiplayer features <br/></li><li>Create death-match levels <br/></li><li>Make Team death-match levels<br/></li><li>Build Co-op Multiplayer games<br/></li><li>Up to 8 players can play your game <br/></li><li>Play with friends</li></ul><br/>Build Games<br/><ul><li>Save standalone single player games as executable files<br/></li><li>Distribute your games royalty free</li></ul><br/>Game Creator Store<br/><ul><li>Online Store – Easily add game ready assets to your project<br/></li><li>Model Packs – Collections of media are supported by the store<br/></li><li>Sell – Artists and musicians can sell their own media to the community via the store <br/></li><li>Almost 10,000 game ready assets now available and growing <br/></li><li>Steam wallet supported</li></ul><br/><strong>Development Road Map</strong><br/><br/>GameGuru is in continual development, a list of forthcoming features can be found here:https://www.game-guru.com/feature-vote <br/><br/>Our road-map is to continue developing GameGuru until our community is satisfied we have all the main game elements included. With GameGuru released we will continue to improve and develop it further. All existing customers will receive lifetime updates free of charge. <br/><br/><strong>Choosing Your Game Engine</strong><br/><br/>GameGuru is not designed to compete with professional development tools such as Unity, Unreal and Cry-engine which are ideally suited to producing commercial apps and games. GameGuru is a recreational game maker, not a professional tool, and is still very much in development.  GameGuru is unsuitable for serious game development projects at this time, and we highly recommend you visit the forums and ask many questions before you make a decision on the game making tool for you.<br/><br/>", "metacritic": null, "released": "2015-05-19", "tba": false, "updated": "2023-12-18T17:34:49", "background_image": "https://media.rawg.io/media/screenshots/f24/f24122a8e3d30ec3e99472e3e826d0cb.jpg", "website": "https://www.game-guru.com/", "rating": 1.89, "rating_top": 1, "added_by_status": {"yet": 106, "owned": 2398, "beaten": 4, "toplay": 2, "dropped": 32}, "playtime": 1, "achievements_count": 0, "ratings_count": 128, "suggestions_count": 539, "game_series_count": 0, "reviews_count": 128, "platforms": ["PC"], "developers": ["The Game Creators"], "genres": ["Educational"], "publishers": ["The Game Creators"], "esrb_rating": null}