{"id": 976863, "slug": "honey-time-with-pooh", "name": "Honey Time! with Pooh!", "name_original": "Honey Time! with Pooh!", "description": "<strong>Pooh is no longer the cute little bear he used to be... something has corrupted him, and now he thirsts for blood. Gather your courage and investigate.</strong><br/><br/>Play as Friend, Pooh's favorite human in the world. Not just anyone can taste Pooh's honey. Read the invitation he sent and then head to his house in the forest. When you enter his house, you'll discover that Pooh has changed a bit. But that's okay! Have a chat with Pooh; he has something to show you. Notice that Pooh's new honey is a bit too red for your liking. Try to escape by exploring Pooh's house while he's distracted. He'll attack you if he catches you trying to escape or snooping around his things. Bears are very territorial, you know?<h3>It's Honey Time!</h3><br/><ul><li><strong>Collect all the notes</strong></li></ul>Find the notes scattered throughout Pooh's house... they may reveal a terrifying secret.<br/><br/><ul><li><strong>Investigate Pooh's house</strong></li></ul>Bloodstains abound in the furnishings. Explore the place, interact with Pooh's strange objects, but be careful; he may not like the idea.<br/><br/><ul><li><strong>Try Pooh's \"honey\"</strong></li></ul>The honey has changed since the last time you visited this place...<br/><br/><strong>In Honey Time with Pooh, your duty will be to investigate why Pooh has become the monster he is now, as no one is clear about the origin of his madness. Throughout the game, you'll have the opportunity to acquire items and more objects that will allow you to confront him.</strong>", "metacritic": null, "released": "2024-02-13", "tba": false, "updated": "2024-02-16T10:25:13", "background_image": "https://media.rawg.io/media/screenshots/5bc/5bc8a049571ba8641736195f315dd8b5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Highlander Interactive"], "genres": ["Adventure", "Indie"], "publishers": ["Highlander Interactive"], "esrb_rating": null}