{"id": 976868, "slug": "rerise", "name": "ReRise", "name_original": "ReRise", "description": "<strong>Arena of the Steel Gladiator: Robot Warrior's Triumph!<br/><br/>A New Dawn in the Colosseum: The Rise of the Steel Gladiator!<br/>\"Step into the future, where the clash of steel and the roar of the crowd set the stage for a remarkable tale. In the Colosseum of tomorrow, a gladiator in the form of a mighty robot wields its deadly weapon, ready to face the challenges that await. W, A, S, D keys are the controls that navigate this metallic warrior as it embarks on a quest to conquer the arena.\"<br/><br/>The Hunt Begins: Steel Gladiator vs. Monstrous Beasts!<br/>\"As the gates of the Colosseum swing open, the Steel Gladiator enters the arena, armed with a formidable robotic weapon. Its mission: to hunt down and eliminate the monstrous creatures that emerge with each victorious battle. With each slain beast, a new challenge awaits in the next round as an extra creature joins the deadly fray. Will the Steel Gladiator emerge triumphant or succumb to the ever-growing swarm of creatures? The fate of the arena hangs in the balance.\"<br/><br/>Rising Tensions: One Robot Against the Horde!<br/>\"With each creature the Steel Gladiator vanquishes, the tension in the Colosseum rises. The crowd's cheers echo as the metallic warrior battles relentlessly, pushing the limits of its robotic prowess. As the horde multiplies, the challenges become more intense. W, A, S, D keys become the lifeline, and the mighty weapon becomes the instrument of survival. The question remains: Can the Steel Gladiator endure the ever-increasing onslaught and emerge as the ultimate champion of the arena?\"</strong>", "metacritic": null, "released": "2024-02-13", "tba": false, "updated": "2024-02-16T10:37:16", "background_image": "https://media.rawg.io/media/screenshots/3de/3dec893807786125f4db3ae59f18ecde.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ReHarmony Games"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["ReHarmony Games"], "esrb_rating": null}