{"id": 976848, "slug": "jooins-romance-fantasy", "name": "Jooin's Romance Fantasy", "name_original": "Jooin's Romance Fantasy", "description": "<strong><h3>Game Description</h3></strong><br/><br/>In my next life, I want to live in a world full of cute girls...<br/>Welcome to the chaotic romance fantasy adventure presented by virtual streamer \"Lee Jooin\" and his fans, the \"Churros\"!<br/><br/>This game is an RPG Maker creation where \"Lee Jooin\" personally crafted the scenario, featuring simple controls and a highly immersive story. Unlike typical dating sims, the target to conquer is only one. Additionally, resembling pixel art-based visual novels, the game stands out with a faster and more concise story, along with plans for full dubbing.<br/><br/>Create a game dedicated to the fans, and enjoy this creation made to leave memories with them!<br/><br/><h3>Game Features</h3><br/><strong>Unprecedented Story : </strong> A regression story unfolds as an accident suddenly brings about romance with a favorite VTuber in a different world.<br/><strong>Easy Controls : </strong> An interface accessible to all age groups, ensuring easy access and enjoyment.<br/><strong>Good Accessibility : </strong> A short and light story with included combat scenes.<br/><strong>Full Dubbing Support Planned : </strong> Virtual streamer Lee Jooin will personally provide game dubbing in upcoming updates.<h3>Synopsis</h3><br/>I was born into an ordinary household in South Korea, leading a simple life—getting a regular job, complaining about work, just an ordinary person.<br/><br/>Tired after work, while heading home, my supervisor approached.<br/><br/>\"Hey, Manager Kim, isn't Manager Kim joining the company dinner?\"<br/>\"Sigh...\"<br/><br/>Feeling low, unable to watch the regular broadcast, my tension drops even further. Despite my bad mood, I decide to leave a comment on Lee Jooin's YouTube.<br/><br/>\"I've already seen it all... Should I write something interesting in the comments?\"<br/><br/>Contemplating, I walk towards the dinner venue...<br/><br/>(Car brake sound)<br/><br/>\"What's this, wha..t..\"<br/><br/>Bam!<br/><br/>I couldn't see the approaching car and got hit by a truck.<br/><br/>\"Ah...\"<br/><br/>Something flows from my head.<br/><br/>Ugh, I did want to be reincarnated into another world, but I didn't expect it to happen like this...<br/><br/>If possible, please let my next life be born in a place filled with cute girls...<h3>System Requirements</h3><br/><strong>Operating System : </strong> Windows 7/8/10<br/><strong>Processor : </strong> Intel Core i3 or higher<br/><strong>Memory : </strong> 2 GB RAM<br/><strong>Graphics : </strong> DirectX 9/OpenGL 4.1 compatible GPU<br/><strong>Storage : </strong> Minimum 1 GB available space", "metacritic": null, "released": "2024-02-13", "tba": false, "updated": "2024-02-16T09:33:54", "background_image": "https://media.rawg.io/media/screenshots/7dd/7ddab6cce3b7600ee956ab5cd842faf5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lee Jooin", "V-LUP Supporter", "Zombie cat"], "genres": ["RPG", "Indie"], "publishers": ["V-LUP"], "esrb_rating": null}