{"id": 97689, "slug": "running-out-of-space", "name": "Running out of Space", "name_original": "Running out of Space", "description": "Running out of Space\r\n\n<p>Hi, This game was made for Ludum dare 42. the theme was Running out of space so I took the theme and turned into a game.</p>\n<p>R.o.o.s. is a top-down shooter with a twist, which is whenever you fire the space your on will shrink and a random planet will appear which will act as a barrier for your movement or any kind of a blast.</p>\r\nCONTROLS\r\n<p><strong>W-A-S-D</strong> to walk around , <strong>Left-click</strong> to shoot or proceed text, <strong>Right-click</strong> to skip the text. Press <strong>R</strong> to Restart, Press <strong>Q </strong>to return the Main menu and while in Menu press <strong>S</strong> to Switch between songs.<br/></p>\n<p><strong>If the normal difficulty is too hard, you can change it in the options.</strong> The easy difficulty will affect enemies quantity, boss hp and removes planet spawn.</p>\n<p>You need to carefully adjust yourself or you might trap yourself in an empty space.</p>\n<p>Aim for the wormholes to create a new space and be careful to not get too close to the other creatures especially ?!?!?</p>\n<p>Right now there is only 5 levels, and the last one is a boss battle. i will implement a small story. and currently %50 of it complete and in the game.</p>\n<p>R.o.o.s. was made entirely in game maker studio by me, all of the sprites &amp; background was still made in GMS.<br/>SFX was created using bfxr, there are five soundtracks in-game(none of them made or owned by me) : </p>\n<ul><li>Dance with the dead - Eyes of Madness</li><li>Xurious - DeathToTraitors</li><li>OVERWERK - Toccata</li><li>Dance with the dead - Poison</li><li>Magic sword - Battlefield</li></ul>\n\n<p>please give your thoughts and suggestions about the game, thank you for playing.</p>", "metacritic": null, "released": "2018-08-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0b2/0b2e347b6297d44bf3aef451a943e86a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ZozeR"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}