{"id": 976890, "slug": "the-adventures-of-the-black-hawk", "name": "The Adventures of The Black Hawk", "name_original": "The Adventures of The Black Hawk", "description": "<h3>france, Spring 1789.</h3>Social tension rises while nobility, in their convenient and accommodated position, enslaves the common people with their taxes. Meanwhile, Jean Pierre de Saint-Cove, a noble aristocrat, secretly hides behind his mask to fight injustice and inequality, and to give back to the people what they rightfully deserve.<br/><br/>Use your full cleverness to solve the different situations along the way until you fulfill your purpose. Both your sword and eloquence will be your most trusted allies, without forgetting the help of your loyal friend Mathieu and beautiful Violette Hulot, who will get you out of trouble more than once and without whom you would never be able to top this adventure.<br/><br/>Confront aristocracy and the Deputy Chief of police, Baron LeComeau, to  overthrow the Old Regime by finding out about the best hidden secrets of nobility, and using them to your advantage. <br/><br/>Persist in your eagerness to achieve your goal! Be brave, smart and hilariously crazy to achieve victory!<br/><br/><br/><br/><br/><ul><li>An adventure full of humor, sarcasm and shrewdness, divided in three chapters.<br/></li><li>Control Jean Pierre de Saint-Cove in his two identities, both as an aristocrat and as The Black Hawk. As a plus, your will have to occasionally get aid and control some other character.<br/></li><li>Countless puzzles and riddles of all kinds. Use the objects surrounding you, combine them with each other, talk to every character to get clues and even try to trick them (if you have to).<br/></li><li>Sword duels! Shootings! And lots of emotions in the face of danger!<br/></li><li>Over thirty fully detailed locations, design to bring back that classic adventure style.<br/></li><li>Over sixty characters to interact with.<br/></li><li>Forty-five original music themes which will take you to the past and get you even more in the shoes of The Black Hawk.<br/></li><li>A journey to the 80s and 90s classic adventures, with a style that mimics their predecessors.<br/></li><li>HQ points to get while you solve main and secondary puzzles.<br/></li><li>And villains, too many villains!</li></ul>", "metacritic": null, "released": "2024-02-13", "tba": false, "updated": "2024-02-16T11:26:48", "background_image": "https://media.rawg.io/media/screenshots/8f3/8f398c3c2819ad63a04b3593b96bcc52.jpg", "website": "https://elhalconnegro.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Croqueta Asesina Studios"], "genres": ["Adventure"], "publishers": ["Croqueta Asesina Studios"], "esrb_rating": null}