{"id": 976898, "slug": "dirty-rotten-bounders", "name": "Dirty Rotten Bounders", "name_original": "Dirty Rotten Bounders", "description": "<h3>How to play the game</h3>The game has three levels: <strong>Easy, Ok and Ouch</strong>. The names indicate the relative degree of difficulty of each level. To finish a level you must complete each of the 15 boards within the level. After completing the <strong>Easy</strong> level, you move to <strong>Ok</strong> and then <strong>Ouch</strong>. You may start at any level, but a useful tactic is to start at a less challenging level and build up a store of extra lives to sustain you at higher levels.<br/><br/>Gameplay takes place on a series of boards each consisting of nine rows and nine columns of tiles. Each tile may be one of two colours. For example, these tiles are used on the initial Robotica board.<br/><br/><br/><br/>The player is represented by a smiley-faced character on the board.<br/><br/><br/><br/>The player moves the character from tile to tile by using a gamepad joystick, or the arrow keys (left,right,up,down or W,A,S,D).<br/><br/>When the player lands on a tile, if the tile is already the player's colour, nothing happens and no points are awarded. If the tile was not the player's colour then it will be instantly changed to the player's colour and points will be awarded.<br/><br/>If the tile is changed and, in conjunction with another tile of the player's colour, encloses one or more tiles of the other colour, then those other tiles will flip to the player's colour. Each tile flipped is awarded an increasing number of points, so flipping longer lines is more rewarding than flipping shorter ones. This is the main game mechanic.<br/><br/>The following images should help to explain how it works.<br/><br/>First the player jumps onto another tile:<br/><br/><br/><br/>The tile changes instantly to the player's colour, enclosing one or more tiles of the opposing colour by two player tiles:<br/><br/><br/>The enclosed tiles flip to the player's colour:<br/><br/><br/>Each tile flipped is awarded an increasing number of points:<br/><br/><br/>Lines may be flipped horizontally, vertically or diagonally.<br/><br/>This mechanism is similar to that used in the strategy board game called Reversi, said to have been invented by an Englishman in 1883.<h3>Teleportation</h3><br/>If the player jumps onto a tile overlaid with a teleport symbol, then the player will be directly transported to another tile at random. At more challenging levels, fewer teleports are available and may disappear at random when used, but will reappear some time later.<h3>Adversaries</h3>Each board comes with a number of adversaries. They are called chasers and initially appear in a cage to the left of the board. There is a hole in the bottom corner of the cage, which the chasers can use to gain access to the board. Only a limited number of chasers are allowed on the board at any one time. When the chasers appear on the board they will try to collide with the player's character. If they are successful, the player will lose a life and the board will be restarted. Initially the chasers move quite randomly, but as time passes they begin to hunt the player more zealously. As the chasers move about the board they flip the player tiles to the other colour. The chaser tile flipping occurs in the same manner as the player flipping, except that the flipping is instantaneous, not animated as for the player. The chasers are different for each board, for example the chasers for the Robotica board are:<br/><br/><h3>How to complete a board</h3>Jumping around the board scoring points is all very well, but how do you complete a board? To complete a board you must kill all of the chasers. You can kill a chaser by flipping the tile beneath it. When sufficient chasers have been killed the final adversary from the cage, the destroyer, will be released. The destroyer will proceed to jump from tile to tile destroying each tile that it lands upon, reducing the size of the board. You must kill the remaining chasers before the destroyer consumes the board and eventually the player. You cannot kill the destroyer and collision with the destroyer will result in the loss of a life. For the Robotica board the destroyer looks like:<br/><br/><h3>Pick-ups</h3>Whenever a chaser is killed, by flipping the tile beneath it, there is the chance that a pick-up, or hazard, may be generated. The pick-ups that are common to all boards are listed below. In general, a pick-up that is beneficial to the player, will be portrayed by a slowly rotating icon. To acquire the pick-up, and reap the benefits associated with it, the player simply has to jump upon the same tile that the pick-up occupies. The benefits of each pick-up are:<br/><br/><br/>The heart pick-up increments the number of lives that the player has remaining. The player starts the game with an initial tally of five lives. If the player loses all lives then the game is over. A heart pick-up will appear when the player flips a chaser having scored 10,000 points, or more. Another heart pick-up will appear after every additional 10,000 points scored.<br/><br/><br/>The shield pick-up wraps the player in a protective bubble. If the player collides with one of the four chasers, then the chaser will be killed - the hunters become the hunted. The shield lasts for about 10 seconds, after which time it will flash briefly and disappear. The shield duration is cumulative, so jumping on two shields, one after the other, will afford the player about 20 seconds of protection. Note the shield only protects the player from the four original chasers, not the destroyer or other hazards that may appear.<br/><br/><br/>The super-speed pick-up allows the player to move at double speed for about 10 seconds. Again, the super-speed pick-ups are cumulative and are particularly devastating if you are also protected by a shield. You should exercise care when travelling at super-speed, as it becomes more difficult to navigate accurately.<h3>Hazards</h3><br/>There is one particular chaser which poses an additional threat. Sometimes, one of the chasers, always the same type, will pause and breathe flames for a short period. If the player is caught by the flames, a life will be lost.<br/><br/>Occasionally, when a line of tiles is flipped, one of them will shatter, leaving a hole, which randomly moves around the board. The player cannot jump onto a hole, so it provides an obstacle to navigation.<br/><br/>The remaining pick-ups and hazards generated by killing a chaser are specific to each board. To read a full description about pick-ups, refer to the in-game help menu. For the initial Robotica board the hazards are:<br/><br/><br/><strong>The oil slick</strong>. An oil slick  is non-fatal to the player. If the player lands upon it he will slide onto another tile without landing on the tile covered by the oil slick.<br/><br/><br/><strong>The saw.</strong> A saw  is potentially fatal to the player. The saw moves randomly up and down, or side to side. If the player collides with the saw a life will be lost.<h3>Level Completion</h3>When all 15 boards have been completed, the player proceeds to the next level. When the final Ouch level has been completed, the game is finished and any remaining lives are multiplied by 10,000 and added to the total score.", "metacritic": null, "released": "2024-02-14", "tba": false, "updated": "2024-02-16T11:43:27", "background_image": "https://media.rawg.io/media/screenshots/14d/14d9a1907024221c722a536b6b531ff5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Paul Savage"], "genres": ["Action", "Strategy", "Casual", "Indie"], "publishers": ["Paul Savage"], "esrb_rating": null}