{"id": 976820, "slug": "slipstream-rogue-space", "name": "Slipstream: Rogue Space", "name_original": "Slipstream: Rogue Space", "description": "In Slipstream: Rogue Space, Streamers captain a massive starship and viewers are the crew. Together they explore the galaxy, fight aliens, and operate the ship in real-time. Battle through challenging rogue-like maps as a team and work together to see how long you can survive.<h3>Captains and Crew</h3>Play as two unique roles:<br/><ul><li> The <strong>captain</strong>, who makes key decisions, gives orders, and leads the ship. This is usually a live streamer leading their community.<br/></li><li> The <strong>crew</strong>, who work together to operate the ship: shoot, repair, hack, and more.</li></ul>Captains can play LIVE on stream, with their audience, in real time. Dozens of players can join across desktop or mobile platforms to form an elite crew. Deep gameplay, persistent progress, and tons of interaction help build strong ties for your community.<h3>Crew Classes</h3>Choose from a variety of specialized crew classes, including:<br/><br/><br/>As you play, earn permanent XP to level-up your skill tree and customize your character builds.<h3>Many Ways to Play</h3>Launch a small ship with some friends, join a streamer of a few dozen crew, or take on major challenges with a streamer piloting 100+ players towards victory.<h3>The Dangers Of Rogue Space</h3>Aliens invaded and conquered our solar system. Those few earthlings that escaped have banded together on the cold edges of space, seeking to survive and exact revenge. There will be no quick victory, but day by day, zapped slug by zapped slug, hope survives.<br/><br/>Explore a variety of regions to battle through randomly generated maps. Each run is a unique experience with dangers and rewards constantly evolving. Whether you're piloting a scout with a few friends or a massive cruiser with dozens of players, the game will adapt to provide a fair but challenging experience.<h3>Just the Beginning...</h3>Slipstream is just getting started; keep an eye out for regular updates to gameplay, locations, crew classes, character customization, and more. We are committed to helping build strong communities through collaborative gameplay, and we hope to see you aboard!", "metacritic": null, "released": "2024-02-12", "tba": false, "updated": "2024-02-16T08:23:12", "background_image": "https://media.rawg.io/media/screenshots/c4c/c4c3a503b9e257400d51d87e57a69e02.jpg", "website": "https://www.playslipstream.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["SubPixel Studios"], "genres": ["Strategy", "Simulation", "Massively Multiplayer", "Indie"], "publishers": ["Subpixel Studios"], "esrb_rating": null}