{"id": 976866, "slug": "caribbean-legend-sandbox", "name": "Caribbean Legend: Sandbox", "name_original": "Caribbean Legend: Sandbox", "description": "Welcome to the Caribbean in 1654 AD, a place teeming with opportunities and mysteries. Assume the role of one of the three adventurers: youthful French aristocrat, a formidable Spanish mercenary, or a savvy English entrepreneur. Explore, trade, plunder, complete quests and enjoy the Caribbean Open World. This game has the most of improvements and a good portion of new content from the upcoming Caribbean Legend. <strong>Based on Sea Dogs series and inspired by Sid Meier's Pirates!</strong><br/><br/><br/><br/><br/><ul><li><strong>Freeplay</strong>: The Caribbean is your domain, offering everything from exploring ancient pyramids to capturing entire towns.<br/></li><li><strong>Hundred Recurring Quests</strong>: Engage in a myriad of quests, each with multiple potential outcomes, including freight jobs, bounty hunting, trading contracts, and more!<br/></li><li><strong>Unique Quests:</strong> Embark on twenty distinctive quests, each with its own compelling narrative.<br/></li><li><strong>Land and Naval Warfare</strong>: Transition from confronting thugs in jungles and pirating a small game to leading full-scale sieges and commanding an armada of warships.<br/></li><li><strong>Extensive Customisation</strong>: Tailor your experience with character builds, dozens of ships, and a vast array of over a hundred items and weapons.<br/></li><li><strong>Side Activities</strong>: Immerse yourself in a wide range of activities, including crafting, trading, duels, gambling, smuggling, romance, ship upgrading, and treasure hunting.</li></ul><br/><br/>Caribbean Legend: Sandbox is at the beginning of its journey as we aim to create the ultimate pirate freeplay game. This game is still under development, and while we haven't finalized all the main future milestones, our general vision is already taking shape. The old Sea Dogs approach primarily focused on expanding quest content. When a player completed all available side quests, their journey in the game would come to an end. This approach wasn't necessarily flawed, but we're excited to explore a new direction. <br/><br/>What if the game consistently generated one-of-a-kind situations for players, ensuring each playthrough remains captivating and distinctive, from the early game to the very end? Let's discover the possibilities! Based on sales of the full game and community feedback, the following roadmap may undergo adjustments, to the lesser or (hopefully!) the bigger scale. <br/>", "metacritic": null, "released": "2024-02-13", "tba": false, "updated": "2024-02-16T10:31:56", "background_image": "https://media.rawg.io/media/screenshots/3e2/3e2d613f609423ab76a44043e749587e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 310, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BlackMark Studio"], "genres": ["RPG"], "publishers": ["Valkyrie Initiative", "BlackMark Studio"], "esrb_rating": null}