{"id": 976824, "slug": "rune-gate-retribution", "name": "Rune Gate: Retribution", "name_original": "Rune Gate: Retribution", "description": "Rune Gate: Retribution unveils a sneak peek of the 'Retribution' game mode, soon to premiere in Rune Gate. This mode delivers a condensed but intensively challenging experience, inviting players to overcome increasingly difficult trials and ascend the leaderboard. Fundamentally, the game is a deck-building roguelite that allows for deep customization of cards through the integration of various elemental runes, offering a unique blend of strategy and personalization.<br/><br/><br/><br/><br/>The Rune system makes card customization swift and effortless. You have the freedom to forge synergies between cards, determining their power and utility. Insert attack runes for high-damage cards; use draw or energy runes for utility cards; and debuff runes transform your cards into potent curses. Want more versatility? Simply upgrade your card to add a new rune slot!<br/><br/><br/><br/><br/>Currently, the game features nearly 200 unique runes, each with its own signature abilities and constraints. Players can acquire runes by winning combats, crafting them from lower-tier runes, or obtaining them through encounters and merchant inventory.<br/><br/><br/><br/><br/>In the game, you lead a party of champions against adversaries. Each champion wields a specific type of weapon and utilizes unique runes. Every weapon type corresponds to a distinct deck, offering a unique set of cards for strategic deck-building. With 18 champions available, featuring three from each elemental type, a rich variety of team compositions and strategies awaits your command.<h3>Gears and Augments</h3><br/>Not only do you acquire runes following combat, but you can also obtain gear and augments. Gear enhances your champions' offensive and defensive capabilities and includes runes for further customization. Augments provide unique buffs to your champions during combat, offering additional strategic depth.<h3>Units to Summon</h3><br/>Followers represent another form of 'Gear' available in the game, capable of being summoned as allies during battles. They each possess a distinct set of cards that can be customized with runes, and can be a great help to your mid to late game strategy.<h3>Meta Progression</h3><br/>Fame is earned through combat across different realms, and it serves as a key resource. You can utilize this fame to permanently unlock specific runes, granting yourself a range of advantages that significantly aid in progressing through future runs.<br/><br/>-Discord: https://discord.gg/meSfrrUQ2x", "metacritic": null, "released": "2024-02-12", "tba": false, "updated": "2024-02-16T08:32:33", "background_image": "https://media.rawg.io/media/screenshots/c2a/c2acaef5152c39161addabb07af8450b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 364, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Devwind"], "genres": ["Strategy", "Indie"], "publishers": ["Devwind"], "esrb_rating": null}