{"id": 976946, "slug": "adapta-solva", "name": "Adapta Solva", "name_original": "Adapta Solva", "description": "Absorb elements from magical shrines to solve puzzles and overcome obstacles in this cute and short little adventure where you follow a magical creature in a world laid to ruin by an unknown cause. <br/><br/>On your adventure you can collect any of the following three elements from different elemental shrines and use their unique properties and abilities to solve the puzzles and unlock the next areas.<br/><ul><li><strong>Stone</strong> is the heaviest and the strongest of the elements, use your ground slam or punch ability to break certain walls and floors or to punch heavy boulders around </li><li><strong>Slime</strong> is a sticky but bouncy element, use it to jump higher, pass through grates and climb up sticky walls. You can also leave behind a gooey slimeball that will disappear after a short time. You also have to be careful though, since slime isn't fully solid it will dissolve into water! </li><li><strong>Crysta</strong>l is the final collectable element and it's surprisingly slippery, use it to crystalize bodies of water so you can walk across and be able to push boulders and slimeballs on top of it. </li></ul><br/>Uncover the mysteries as you follow a magical creature capable of absorbing elements from magical shrines, as they uncover more and more about how they were created and why the world has fallen into ruin. Explore your surroundings to find ancient artifacts and items from the locals as well as murals drawn by the ancient civilization that depict the story of world.<br/><br/>This game was made by 6 students as a group project assignment for their third year at Digital Arts &amp; Entertainment at Hogeschool West-Vlaanderen in Belgium. We want to give a special thanks to our supervisors, Dave Van Verdegem and Tristan Clarysse who helped us through the 11 week process of making the game.", "metacritic": null, "released": "2024-02-14", "tba": false, "updated": "2024-02-16T13:06:19", "background_image": "https://media.rawg.io/media/screenshots/333/33386e5f4a1203de12cf91b38f6722d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 286, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Devon Brazelton", "Twannes Claes", "Malou De Paepe", "Karolinka Fierloos", "Dennis Skodda", "Jeroen Gesquiere"], "genres": ["Casual", "Indie"], "publishers": ["Hogeschool West-Vlaanderen"], "esrb_rating": null}