{"id": 976977, "slug": "hero-tale", "name": "Hero Tale", "name_original": "Hero Tale", "description": "<h3>FIGHT AND LOOT</h3><br/>Find a best way to defeat each of enemies you meet on your road to becoming a hero. Watch dice roll when loot is about to drop, as each type show rarity of your reward.<h3>CHOOSE YOUR PATH</h3><br/>Gain experience to unlock unique abilities! Upgrade massive skill tree with almost 300 nodes. You want to regenerate faster than your enemies can hurt you? Strike them down before they can even reach you? Or maybe be so tough they barely can make a scrach on you? You decide how you want to progress!<h3>EXPLORE THE ISLAND</h3><br/>Explore unique island set in medieval fantasy with beautifully hand painted backgrounds. Can't defeat enemies on one tile? Try different one to get around!<h3>MANAGE YOUR EQUIPEMENT</h3><br/>Use loot that suits your fighting strategy the best. Decide which statistics will be your priority and which ones you will have to sacrifice for efficiency.<h3>TRAIN YOUR SKILLS</h3><br/>Train your skill with each hit dealt to enemies. Use meele weapons, ranged or magic to level up every skill to become faster and more powerful.<h3>DISCOVER NEW PERSPECTIVES</h3><br/>Get to know the entire cast of characters, in story filled with humorous dialogues. Talk to them, help them with quests and they will help you to grow stronger.<br/><br/>And when it looks like you are getting stuck, remember, practice makes perfect!<h3>MEET THE FAIRY</h3><br/>When meeting the Fairy for the first time, she will lend you some of her powers, to help you on your way to become a Hero. All Houskeeper Fairy benefits are included in the purchase of the game. <br/><br/><strong>Housekeeper Fairy unlock includes:</strong><br/><br/><ul><li>housekeeper Fairy Skin<br/></li><li>50% More Experience Points<br/></li><li>Additional skill point to use in the skill tree<br/></li><li>Autoconsumable sliders for health and mana consumable items</li></ul>", "metacritic": null, "released": "2024-02-15", "tba": false, "updated": "2024-02-16T13:55:04", "background_image": "https://media.rawg.io/media/screenshots/872/87285ca42be1e4930905f4597035cbbc.jpg", "website": "https://weirdjohnnystudio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Weird Johnny Studio"], "genres": ["RPG", "Strategy", "Casual", "Indie"], "publishers": ["Weird Johnny Studio"], "esrb_rating": null}