{"id": 976943, "slug": "cow-life-sim-rpg", "name": "Cow Life Sim RPG", "name_original": "Cow Life Sim RPG", "description": "<h3>Become a cow in this sandbox RPG experience!</h3><br/>You've set off on a voyage to Snoutsville and the world is before you! Explore the area, embark on quests, or make your own adventures! Level up unique and innovative skills and experiment to find the best training methods. Collect and create cool items! You can do anything when you are a cow!<h3>Features</h3><ul><li><strong>Train special skills that enhance your life as a fun-loving cow!</strong> Like juice drinking! Or basket weaving! Or arson! Some skills are very useful on your quest, some not so much, but maxing out your trampolining level is still a valiant goal.</li></ul><br/><ul><li><strong>Hundreds of unique items!</strong> Excavate valuable artifacts like zucchini bones, scavenge scientifically accurate mushrooms, and create the rare and elusive BBQ Sauce.</li></ul><br/><ul><li><strong>Juice any item! Weave any item into a basket! Burn EVERY item!</strong> Any item can be a delicious (?) juice or a spacious basket, and of course, every item can be set on fire by a skilled arsonist!</li></ul><br/><ul><li><strong>Complete quests for your new animal friends!</strong> Solve puzzles and find secrets to earn cool rewards and unveil mysterious truths of the world.</li></ul><br/><ul><li><strong>Plant whatever you'd like in gardening spots around town!</strong> Maybe grow a trumpet tree, or harvest a ton of useful and tasty sugar.</li></ul><br/><ul><li><strong>Possibly the first video game ever to not feature fishing!</strong></li></ul><br/><ul><li><strong>Every character is trans!</strong></li></ul><br/><ul><li><strong>Featuring an original soundtrack by Vince Alan!</strong></li></ul><br/><ul><li><strong>Moo!</strong></li></ul><br/>Experience life as it should be - Experience life as a cow", "metacritic": null, "released": "2024-02-14", "tba": false, "updated": "2024-02-16T13:02:11", "background_image": "https://media.rawg.io/media/screenshots/f74/f74be17a99dbc708ac778035e72f0444.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Pajama Bee Entertainment"], "genres": ["Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["Pajama Bee Entertainment"], "esrb_rating": null}