{"id": 976987, "slug": "mytavern", "name": "MyTavern", "name_original": "MyTavern", "description": "Placed in a world it is up to the player to design and create their own tavern. Make the space comfortable for guest to stay and rest the night away. Build a wonderful gathering hall for others to come by for drinks and prepare meals with drinks to keep guest happy and earn extra coin threw out your adventures. Limited by the Major of the city one must persuade him with a few extra coin to get upgrades to further expand. Will you build the next best tavern the world has ever seen or be kicked out of town?<br/><br/><br/>Current Features - (Subjected to change with updates and improvements)<br/><ul><li> Overall management of the Tavern<br/>From Checking guest in to Kicking them out, Setting Prices for Rooms and making sure the tavern is tidy for the next guest.<br/><br/></li><li> Building and Design<br/>Designing a tavern to suit every customers needs and make it come true given a large variety of building materials.<br/><br/></li><li> Serving and Preparing<br/>Not just building the tavern but with the Gathering Hall the player can attract guest far and wide to come seek the towns next best meals and brews! Tend to These guest to vastly increase to growth rate of your tavern. <br/><br/></li><li> Vendors and Town Services<br/>The Towns precious vendors bring goods and building parts already built within their own workshops to help players focus on being at the tavern rather then in the forest.  <br/><br/></li><li> Interactive Customers<br/>The customers are the heart of each tavern bringing in life and warmth, also a few coins. Tend to guest to keep your tavern alive generating income to progress future plans on your tavern.<br/><br/></li><li> Research and Development<br/>Allows the player to upgrade beyond starting levels to improve player experience or overcome rules set by the town. </li></ul>", "metacritic": null, "released": "2024-02-15", "tba": false, "updated": "2024-02-16T14:11:00", "background_image": "https://media.rawg.io/media/screenshots/a6d/a6d81aa8365b40bf6a94021a73ea7100.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Daniel Swatridge"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Daniel Swatridge"], "esrb_rating": null}