{"id": 976935, "slug": "lords-of-exile", "name": "Lords of Exile", "name_original": "Lords of Exile", "description": "In ancient times of war in the Far East, the lands of Exilia were overrun by creatures of the night and samurais. Amidst this cruel conflict, only a bloodthirsty cursed knight can bring hope and vanquish the darkness.<br/><br/><br/><br/><strong>Key features </strong><br/><br/>Levels <br/><br/>\tExplore 8 levels of classic linear design, each featuring challenging obstacles and enemies to overcome. At the end of each level, you'll face off against a powerful boss that will put your skills to the test. And as Gabriel, you'll receive an extra skill after defeating each boss, allowing you to progress even further and take on greater challenges.<br/><br/><br/><br/>Gameplay Variety <br/><br/>\tExperience a range of mechanics, from throwing weapons to melee combat, down stabs, jumping, and dashing. Unlock the powers of Gabriel's curse to enhance your abilities. Play as both Gabriel and Lyria, each offering a unique and distinct gameplay experience for endless replayability.<br/> <br/>\tPlus, once you've beaten the game with Gabriel, unlock two additional game modes: Speedrunner mode and Boss Rush mode. And the best part? You can play both of these modes with either Gabriel or Lyria for even more variety and fun!<br/><br/><br/><br/>Retro-aesthetic and sound design <br/><br/>Relive the glory days of classic gaming with retro-inspired 16-bit physics and perfectly polished controls. The game's stunning handcrafted 8-bit pixel art and fast anime-style animations, the 8-bit SFX and OST, enriched with sounds from the Megadrive sound chip, complete the immersive retro experience.<br/><br/>", "metacritic": null, "released": "2024-02-14", "tba": false, "updated": "2024-02-25T16:43:40", "background_image": "https://media.rawg.io/media/screenshots/cba/cba209af9ceed668fe132ed9aedcac5d.jpg", "website": "http://www.squidbitworks.com/lords-of-exile/", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 231, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Squidbit Works"], "genres": ["Action", "Indie"], "publishers": ["PID Games", "PixelHeart"], "esrb_rating": null}