{"id": 977036, "slug": "voidpet-garden", "name": "Voidpet Garden", "name_original": "Voidpet Garden", "description": "Welcome to Voidpet, the mental therapy app that takes you on a mesmerizing journey into the depths of your emotions, where you'll discover and befriend enigmatic creatures. Nurture your inner oasis through mindfulness and self care, while collecting rare species that visit your very own garden of consciousness in this virtual pet care simulation!<br/>Try Voidpet Garden – Mental Health Games<br/><br/>Befriend Rare Species!<br/>Our mental wellbeing relies on our understanding of the self just as much as it depends on our understanding of the people around us. Step into the realm of self help and witness as your inner garden flourishes with an array of rare and captivating creatures. Each pet has its own unique love language, and it's up to you to communicate and earn their affection.<br/><br/>Quality Time Pets: These endearing companions cherish moments of togetherness and presence. They'll eagerly want to spend time with you, encouraging well-deserved breaks, invigorating exercises, and more, fostering a deeper connection between you and your pet.<br/><br/>Words of Affirmation Pets: Communication is everything to these expressive pets. They'll confide in you, sharing their innermost feelings, and eagerly await your kind and encouraging responses.<br/><br/>Gift-Giving Pets: These delightful creatures find joy in feeling appreciated through thoughtful gifts. <br/><br/>Cuddle-Loving Pets: For those who relish in cuddles, earn their trust through soothing haptics and ASMR experiences. Embrace the warmth of their companionship and witness their affectionate nature unfold.<br/><br/>Unlike other mental health games, Voidpet's approach to mental wellbeing is to provide a space for you to reflect in soft fascination.<br/><br/>To grow in the garden simulator, check on your plants every day and discover daily mindfulness exercises that nourish your soul.<br/>Choose from a selection of journaling mental therapy prompts such as:<br/><br/>Think positive: <br/>Inspired by cognitive behavioral therapy, or CBT, which involves identifying our cognitive biases in order to deconstruct unhelpful thoughts, this self help activity is about examining our negative thought patterns and learning to reframe them positively.<br/><br/>Practice Gratitude: <br/>This self help exercise is about setting aside time to think happy thoughts and appreciate the good around us. Gratitude helps us feel warmly towards others, which, in turn, improves our relationships and overall mood.<br/><br/>Goal setting: <br/>Writing down your goals is a great way to be honest with yourself and validate and your desires.<br/><br/>Emotional naming:<br/>Naming emotions is a simple but liberating exercise in this self care mental therapy app. In this virtual pet care simulation game, by describing how we feel in words, we turn sensations into data, and position ourselves to respond constructively. They say, \"If you can name it, you can tame it!\" Our conscious minds can offload a lot of stress from our physical response.<br/><br/>Self Care Meditation:<br/>A simple timer with a relaxing, guided prompt. Setting aside a few seconds to breathe and reflect can be a wonderful way to start your day, or take a pause in the middle of a busy schedule.<br/><br/>Mood tracking:<br/>Better understand your emotions over time and gain insights into your inner world.<br/><br/>Embark on a fulfilling journey of self-discovery, anxiety relief, and emotional growth with this virtual pet care simulation. Start befriending creatures and cultivating mental wellbeing in your garden of consciousness today. Download Voidpet Garden – Mental Health Games now<br/><br/>--<br/>If you choose to purchase Voidpet Giga, payment will be charged to your Apple account.<br/>Subscriptions will automatically renew unless canceled within 24-hours before the end of the current period. <br/>You can cancel anytime with your Apple account settings. <br/><br/>For more information:<br/>Terms of Service: https://voidpet.notion.site/Voidpet-App-Terms-of-Service-97158c9344ce45d7b0f3fbfb3f13dc76<br/>Privacy Policy: https://www.notion.so/voidpet/Voidpet-App-Privacy-Policy-ed689a618f13442ca0312134abb352e6", "metacritic": null, "released": "2023-02-09", "tba": false, "updated": "2024-02-16T15:41:06", "background_image": "https://media.rawg.io/media/screenshots/292/29204f78db834f7b00dc76df9c89bd47_szxgrPc.jpg", "website": "https://voidpet.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Voidpet"], "genres": ["RPG", "Simulation"], "publishers": ["Voidpet"], "esrb_rating": "Everyone 10+"}