{"id": 977015, "slug": "sifting-thyme-2", "name": "Sifting Thyme", "name_original": "Sifting Thyme", "description": "An otome visual novel where you choose your romance with an attractive boy in culinary school. A perfectly delectable romance for foodies.<br/>\n<br/>\r\nYou’re the newest transfer student at Lincoln Culinary Academy, a private culinary school to find your culinary calling and an unforgettable romance. Immerse yourself in your school adventures as you interact with four gorgeous guys with culinary skills of their own. As you spend time with these love interests, your experience at Lincoln turns to a delicious, romantic journey.<br/>\n<br/>\r\n\"Sifting Thyme\" is an anime, food-themed simulation game where the romanceable characters are a part of your culinary boarding school life. The way you interact with the characters will affect your relationship and intimacy with them. Enjoy a romantic school life with 4 attractive boys!<br/>\n<br/>\r\nAn otome visual novel where you choose your romance with an attractive boy in culinary school. A perfectly delectable romance for foodies.<br/>\n<br/>\r\n■ Game Experience<br/>\r\n-An otome game with four romance-able characters you can bond and interact with to unlock text messages, social media content, and romantic scenarios in the story!<br/>\r\n-Explore branching routes based on your answer choices and relationships with handsome boys.<br/>\r\n-While romancing four love interests, experience unique scenarios inspired by foods, culinary destinations, the latest U.S. food industry trends, and delicious cuisines from around the world!<br/>\n<br/>\n<br/>\r\n■ Features<br/>\r\n- Unlockable CGs<br/>\r\n- Immersive MC experience – select as a female or male MC<br/>\r\n- Unlockable in-game social media content with the characters<br/>\r\n- Original Soundtrack- 8 different endings", "metacritic": null, "released": "2024-02-15", "tba": false, "updated": "2024-02-16T15:03:41", "background_image": "https://media.rawg.io/media/screenshots/605/6051de884d0dd9ecb3ddedfafff29fa2.jpg", "website": "https://nochistudios.com/sifting-thyme", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Nochi Studios"], "genres": ["Simulation", "Indie"], "publishers": ["Nochi Studios"], "esrb_rating": null}