{"id": 977017, "slug": "we-are-football-2024", "name": "We Are Football 2024", "name_original": "We Are Football 2024", "description": "Welcome to <strong>WE ARE FOOTBALL 2024</strong> – the NEW football management experience from the creators of the legendary On the Ball and EA SPORTS FIFA Manager Series! Dive into the world of football like never before. Choose an existing club or start your own. Manage either men or women, lead your club to new heights, and become the next manager legend!<br/><br/>Be there with your team on the pitch. In our immersive 3D game engine, you can directly influence the action on the pitch through instructional shouts. Simulate the same game a thousand times over, witness matches 50 years into the future or switch between games in conference mode on match day. Relive highlights, analyze goals, and enjoy a comprehensive season summary.<br/><br/><strong>WE ARE FOOTBALL 2024</strong> offers an extensive feature set to adapt the game to your needs, including a powerful external editor to set up league systems, clubs, players, managers, employees, referees, sponsors, fan chants, derbies, and more. Configure the game to your skill level and preferences with over 100 options and difficulty settings to make this YOUR road to glory.<br/><br/>Now immerse yourself in the thrill of football management with <strong>WE ARE FOOTBALL 2024</strong>!<br/><br/><h3>KEY FEATURES</h3><br/><strong>User Interface and Technical Enhancements:</strong><ul><li>Clear menu with tabs and customizable wing menus for easy navigation <br/></li><li>In-game editor for changing club and player data at any time<br/></li><li>Over 12,000 generic AI-generated pictures and aging youth players for realism<br/></li><li>21:9 monitor support <br/></li><li>Hotseat multiplayer for up to 4 players</li></ul> <br/><strong>Game Content:</strong><ul><li>3 game modes for club play: Free club selection, club creation, and career mode<br/></li><li>Develop your own managerial skills and use individual skill development trees for each player<br/></li><li>Diverse manager functions (finance, sponsors, HR, organization, fan support, and more)<br/></li><li>Organize your own tournaments and preseason tours<br/></li><li>Extensive options for play styles, formations, and other tactical instructions<br/></li><li>Modern training and realistic training schedules, including training groups<br/></li><li>Team chemistry with player relationships, hierarchies, and effects of player hobbies<br/></li><li>Simply click on players to watch their previous goals<br/></li><li>Comprehensive youth area with screening days, headhunting campaigns, youth boarding schools, and expandable international youth centers for early talent discovery<br/></li><li>Improved transfer market where your personal reputation as a negotiator counts<br/></li><li>Stadium editor that lets you expand, upgrade, and customize your home ground<br/></li><li>Expandable 3D club grounds with new buildings and many new details and improvements <br/></li><li>Optional simulation of the manager's private life, including family and children who can start a professional football career or become a department head at your club</li></ul> <br/><strong>National Team Integration:</strong><ul><li>Separate European Championship and World Cup modes for both men and women<br/></li><li>Option to choose a national team to manage directly at the start of the game or long-term takeover offers for national teams during gameplay</li></ul><br/><strong>Match: </strong><ul><li>3D match display with 9 cameras, slow motion, replay, live rating changes, and optional action boxes with additional information within scenes <br/></li><li>See your tactical instructions implemented on the pitch <br/></li><li>New \"Tactical Analysis\" option provides information on how the result came about <br/></li><li>Short or long 3D scenes and an alternative quick calculation <br/></li><li>Intervene during the match in decision-making situations by giving commands to the players </li></ul><br/><strong>Editor: </strong><ul><li>Edit any country in the world with both women’s and men's leagues <br/></li><li>Fully editable league systems with promotion/relegation regulations, cups, and playoffs <br/></li><li>Automatic creation of leagues, teams, and players <br/></li><li>Extensive editors for logos and jerseys with integration options for your own graphics <br/></li><li>Automatic conversion of existing WAF databases </li></ul><br/>", "metacritic": null, "released": "2024-03-04", "tba": false, "updated": "2024-04-14T16:33:37", "background_image": "https://media.rawg.io/media/screenshots/42c/42cc6c4df3575810637efcd86d605ceb.jpg", "website": "https://handy-games.com/games/we-are-football-2024/", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 292, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Winning Streak Games"], "genres": ["Strategy", "Simulation", "Sports", "Casual"], "publishers": ["THQ Nordic", "HandyGames", "Handy Games"], "esrb_rating": null}