{"id": 977160, "slug": "the-math-problem-killer", "name": "The Math Problem Killer", "name_original": "The Math Problem Killer", "description": "<h3>INCREDIBLY DARK AND DISTURBING DESCRIPTIONS OF VIOLENCE</h3><br/>WARNING!!!<br/><br/>The Math Problem Killer is incredibly dark and disturbing. You must listen to recordings made by the Serial Killer. These recordings describe violence against men, women, and children.  Only the most courageous Special Agents should attempt to enter the dungeons of the Math Problem Killer.<h3>ENTER DISTUBRING DUNGEONS AND SOLVE THE KILLER'S CREEPY MATH</h3><br/>The main gameplay mechanic of The Math Problem Killer is walking through dungeons and listening to the recordings of a sadistic serial killer recount how he stalked, abducted and tortured his victims., and ultimately solving a math problem based on those disturbing stories.  The ultimate goal of each level is to rescue an individual hostage that his being held at the end of the dungeon.  <br/><br/>As you walk through the dungeons, the killer will tell you stories about how he abducted or tortured a victim. In his stories there will be facts, such as when he abducted a victim, or how long he followed them, or how long he tortured them, or how long it took them to die.  He will then form a math question based on the facts from his stories.  Such as...<br/><br/><strong>\"I want you to start with Andrea's age, then multiply that by the number of nails I hammered into her husband. Then add the number of minutes I made her hang in my dungeon. Then multiply this number by the number of minutes I tortured Andrea's neighbor.\" </strong><br/><br/>You will need to listen to all of the recordings in the room in order to gather all of the information required to solve the question.  When you do have your answer, you must enter it into the keypad on the door to the next room. If your answer is correct, the door will open and you will repeat the process until you reach the last room with the hostage. If your answer is wrong, then the hostage dies immediately and you must start over. <br/><br/>At its core, The Math Problem Killer is a tense, slow paced, story centric, crime thriller, walking simulator.<h3>A CRIME THRILLER STORY</h3><br/>The Math Problem Killer is a crime thriller. A sadistic serial killer, known as the Math Problem killer has been murdering people in the city of New Columbia. At the request of the mayor and state governor, a federal Serial Killer Task Force arrives to hunt down the Serial Killer. Within days of arrival, the Task Force recieves a communication from the illusive and dangerous killer.  He has taken a hostage named Bethany Morgan. He tells the Task Force the hostage location, but he also informs the task force that they may only send one agent inside, and that agent may not have any communication with the outside world. <br/><br/>You are the Task Force Special Agent that is chosen to enter the facility and attempt a rescue of Bethany Morgan. The game takes place over the course of 11 weeks, and follows the Serial Killer Task Force as it attempts to find and apprehend the Math Problem killer. Each week is a new dungeon that must be entered, and a new hostage that must be rescued.<br/><br/><h3>THE KILLER WILL TELL YOU DISTURBING STORIES</h3><br/>The Math Problem Killer is a sadistic and violent monster. He enjoys stalking, and torturing his victims. He also enjoys bragging about his exploits even more. Throughout each dungeon you will find recordings left by the killer. In each recording, he will recount with delight the various methods he employed to capture and torture his victims. You must be prepared to listen to unsettling and disturbing accountings of murder and violence towards, men, women and children. But remember, you are a special agent in the Serial Killer Task Force, and it is your job to rescue the hostage being held in the dungeons. <br/><br/><br/><br/>The Math Problem Killer has placed multiple recordings of pieces of a fact pattern and an accompanying complicated multi-part word problem in each room. The player must listen to the recordings and solve the math word problem that is presented. The answer to the math problem is the door code for the locked door. However, if the player enters a wrong answer the hostage will be immediately killed.<h3>ONE MISTAKE AND THE HOSTAGE DIES</h3><br/><strong>I wont kill the hostage...you will.</strong><br/><br/>The Math Problem Killer does not give you second chances. You must be accurate, or the hostage will die. In each room of each dungeon, you must solve a simple math word problem, and then enter your answer into the keypad on the locked door. If you enter an incorrect code, the hostage you are trying to rescue will be burned alive by hyrdoflouric acid. Think carefully special agent. There is zero margin for error. <br/><br/><br/><br/>A single mistake will kill the hostage and cause the player to fail the level. The Math Problem Killer is a high consequence game in which one mistake will have dire consequences. So think carefully Special Agent.<h3>YOU WILL NEED A PENCIL AND PAPER</h3><br/>In each room of each level, you will need to solve a math word problem, and use the answer as the code to open the locked door to the next room and ultimately the locked box that contains the hostage. The math word problems are not difficult, but you will need to gather the numbers from the disturbing stories told by the killer.  Essentially you must gather clues and piece them together in order to figure out the answer. The only way to successfully solve these math problems is utilize a pencil and piece of paper.  The player will need to write things down. Because one math mistake, and the hostage dies.", "metacritic": null, "released": "2024-02-18", "tba": false, "updated": "2024-02-19T06:11:52", "background_image": "https://media.rawg.io/media/screenshots/c82/c82d9680c037f991528b076135677276.jpg", "website": "https://www.bejamrustudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bejamru Studio"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Bejamru Studio"], "esrb_rating": null}