{"id": 977140, "slug": "gregg-tower-defence", "name": "Gregg: Tower Defence", "name_original": "Gregg: Tower Defence", "description": "<strong>Gregg: Tower Defence</strong> is a captivating pixel art tower defense game that puts your strategic prowess to the test. Take on the role of Gregg, a resourceful little builder, and face a relentless onslaught of slimes in epic battles. Here are some of the key features:<br/><br/><strong>Six Unique Towers:</strong> Craft and upgrade six different tower types, each with its own distinctive abilities and strategic advantages. Mix and match to create the ultimate defense.<br/><br/><br/><br/><strong>Resource Gathering:</strong> Explore the world to collect 5 different resources, the building blocks of your tower defense strategy. Each resource is vital for crafting your towers.<br/><br/><br/><br/><strong>Day and Night Cycle:</strong> Survive the day by harvesting essential materials, and then prepare for the night when waves of slimes attack your base. Adapt to the changing conditions to stay one step ahead.<br/><br/><br/><br/><strong>Upgrade System:</strong> Improve your towers as you advance, with five tiers available for each tower, allowing them to adapt to the ever-growing threat posed by advancing enemy waves.<br/><br/><br/><br/><strong>Gold and Gear:</strong> Earn gold by defeating slimes, and use it to bolster your arsenal. Upgrade your axe for resource gathering, improve your speed, and expand your base to accommodate more towers.<br/><br/>", "metacritic": null, "released": "2024-02-16", "tba": false, "updated": "2024-02-19T05:40:54", "background_image": "https://media.rawg.io/media/screenshots/cbf/cbf4fba39ba0c24ff6849f16cda4a275.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Resident Egg Studios"], "genres": ["Action", "Strategy"], "publishers": ["Resident Egg Studios"], "esrb_rating": null}