{"id": 977230, "slug": "supermarket-simulator-2", "name": "Supermarket Simulator", "name_original": "Supermarket Simulator", "description": "https://store.steampowered.com/app/2530950/Rock_Star_Life_Simulator/<br/><br/>Step into \"Supermarket Simulator\", a first-person simulation where every detail of running a supermarket comes alive.<br/><br/>Design your store, optimizing for efficiency and aesthetics. Determine where products are displayed, manage your aisles, and ensure a smooth shopping experience for your customers.<br/><br/><br/><br/>Order stock using an in-game computer and anticipate the arrival of your next delivery. Unpack goods, organize them in your storage room and display them on shelves, fridges, and freezers.<br/><br/><br/><br/>Read product barcodes, handle cash and credit card transactions, and ensure customers leave satisfied with their shopping and checkout experience.<br/><br/><br/><br/>Navigate the complexities of a real-time market. Buy products when prices dip and determine the best-selling prices to balance customer satisfaction with profit margins.<br/><br/><br/><br/>Your entrepreneurial journey starts with a loan from gangs. Ensure you repay your nightly dues to avoid confrontations and potential store disruptions.<br/><br/><br/><br/>Receive online orders via your in-game computer. Carefully prepare and package each order, handle the checkout process, and hand it off to a moto courier for delivery, ensuring timely and accurate service.<br/><br/>As you accumulate profits, consider reinvesting. Expand your store's physical space, upgrade interiors, and continually adapt to the evolving demands of the retail world.<br/><br/>In \"Supermarket Simulator\", every decision matters. Will you rise to the occasion, transforming a modest establishment into a retail powerhouse, all while balancing customer satisfaction, finances, and mafia expectations?", "metacritic": null, "released": "2024-02-20", "tba": false, "updated": "2024-03-22T00:22:21", "background_image": "https://media.rawg.io/media/screenshots/a82/a825a12bddb138128a048486dfc2080c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 18, "beaten": 2, "toplay": 4, "dropped": 3, "playing": 2}, "playtime": 9, "achievements_count": 3, "ratings_count": 4, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Nokta Games"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Nokta Games"], "esrb_rating": null}