{"id": 97721, "slug": "lost-alien-full-release", "name": "Lost Alien Full Release", "name_original": "Lost Alien Full Release", "description": "Lost Alien<p><strong>\r\n\tLost Alien is a gameboy themed metroidvania game originally made for GBJAM 5. This version is a full release which includes an after game, option menus, a title screen, new particle effects, difficulty options, optional 3D effects, mini-games and more.</strong></p><p>\n</p><p>\n<strong>A lost alien finds itself stranded on a strange planet.</strong>\n</p><p>\n<strong>Fix your ship to get into space, discover new planets, find power-ups and eventually stop the evil slime army from destroying the galaxy.</strong>\n</p><p>\n<strong>You can play it with a keyboard or a gamepad, but on the gamepad you can only use the D-Pad and A and B buttons. Gotta keep things authentic.</strong>\n</p>*Mini Walkthrough*<p>\n<strong>If you don't feel like spending a lot of time doing gameboy intergalactic travel you'll want to visit the planets in this order:</strong>\n</p><p>\n<strong>Zoolon</strong>\n</p><p>\r\n\tYou start here. Get the ship parts to fix your ship and get into space.\r\n</p><p>\n<strong>Takken</strong>\n</p><p>\r\n\tLand here next to get the Gas Mask.\r\n</p><p>\n<strong>Hemlock</strong>\n</p><p>\r\n\tOnce you've gotten the Gas Mask, you can safely land on this planet to fight the first boss and get the Air Tank.\r\n</p><p>\n<strong>Aquaris</strong>\n</p><p>\r\n\tUsing the Air Tank you can safely swim in water and travel through this planet to fight the second boss and learn to double jump.\r\n</p><p>\n<strong>Mudim</strong>\n</p><p>\r\n\tA really small moon, come here once you have the Double Jump to unlock the gate on Forlorn.\r\n</p><p>\n<strong>Forlorn</strong>\n</p><p>\r\n\tA large planet that you'll need to traverse with your double jump in order to fight the third boss and get the Super Blaster.\r\n</p><p>\n<strong>Crio</strong>\n</p><p>\r\n\tAnother small moon, use your Super Blaster to break through some rubble at the start and unlock the gate on Bastion.\r\n</p><p>\n<strong>Bastion</strong>\n</p><p>\r\n\tUsing your super blaster to shoot through rubble, you can get through this planet and fight the fourth boss.</p>Optional Planets:<p>\n<strong>Greed</strong>\n</p><p>\r\n\tYou can come here once you learn the double jump to get some coins.\r\n</p><p>\n<strong>Curlis</strong>\n</p><p>\r\n\t\"Little is known about this planet...\"\r\n</p><p><strong>Zeptar</strong></p><p>You can come here to access the Boss Rush at anytime as well as the end game arcade to play the Fallswap Mini-game.</p>", "metacritic": null, "released": "2016-10-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7fe/7fe014e8dc5e655246f1bf40bda024a8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tamationgames"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}