{"id": 977256, "slug": "medieval-machines-builder", "name": "Medieval Machines Builder", "name_original": "Medieval Machines Builder", "description": "Medieval - times of constant sieges. Acquire plans, gather resources, create most powerful and destructive machines and then test them in battle. Thanks to your creations you will conquer more than one castle. The knights wage wars, but thanks to your machines they win them. You are Medieval Machines Builder.<br/><br/>You had the spark for inventing right from the childhood. The time has come to prove yourself as a young ballistic engineer! Your weapons will serve the King and his Kingdom, so be sure to make the most powerful and innovative contraptions possible! Start from scratch and reach for the fame as one of the most renown inventors in the whole Middle Ages in Medieval Machines Builder.<br/><br/><strong>Main Features of Medieval Machines Builder</strong><br/>👷<strong>Character development</strong> - gain experience to unlock machines, ammunition and skills<br/>📚<strong>Campaign with story</strong> - every mission brings you closer to the final siege and victory<br/>🧰<strong>Tools</strong> - you will be using many types of Medieval blacksmith tools<br/>💥<strong>Demolition</strong> - What you build will be used to destroy and demolish enemy fortifications<br/>🏗️<strong>Siege Machines</strong> - you will build and test a catapult, trebuchet, ballista and more<br/>⛏️<strong>Gathering</strong> - you will need materials to build anything. You'll have to get them first.<br/>⚔️<strong>Testing</strong> - Every good gear maker needs to test it well, preferably on the battlefield<br/>💰<strong>Trade</strong> - not everything can be found, you will need to buy something, and to buy something you need to earn something by selling<h3>BATTLE</h3><br/>Medieval times are associated with constant skirmishes and castles. Both of these things are related to siege engines. As you know, an unused weapon is useless. Also, what you build, use in battle.<h3>BUILD</h3><br/>Learn craftsmanship from Medieval times. Use knowledge to create the best and deadly machines.<h3>CRAFT</h3><br/>Make tools, it's time to feel like MacGyver and create something out of nothing.<h3>GATHER</h3><br/>Stones, ropes, wood, boards and many other things needed for work are available to everyone, but they have to be found and transported.<h3>TEST</h3><br/>All equipment must be tested. You will be surprised what machines and especially ammunition were used at that time. Stone boulders are standard. But how about exploding tanks or, for example, cows?<h3>TRADE</h3><br/>Buy and sell. Negotiate better prices and earn money to afford better and better equipment.<br/><br/>https://store.steampowered.com/app/1584680/Medieval_Machines_Builder/<br/><br/><br/><br/><br/>", "metacritic": null, "released": "2024-02-19", "tba": false, "updated": "2024-02-23T04:07:37", "background_image": "https://media.rawg.io/media/screenshots/4c3/4c38bb9f43f517ad4bc0c3c9b4f461e1.jpg", "website": "http://www.freemind.games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 351, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Freemind", "Solverto"], "genres": ["Action", "Adventure", "Simulation", "Casual", "Indie"], "publishers": ["PlayWay", "FreeMind"], "esrb_rating": null}