{"id": 977267, "slug": "free-stars-the-ur-quan-masters", "name": "Free Stars: The Ur-Quan Masters", "name_original": "Free Stars: The Ur-Quan Masters", "description": "<h3>You are the captain</h3>Free Stars: The Ur-Quan Masters® is a classic space game that captures the charm of retro science-fiction, space combat, and high adventure. Your story begins as the captain of the last human starship, with Earth trapped under a hostile forcefield. You are the last hope for humanity in a fight for control of the galaxy, as you explore thousands of unknown worlds and get dozens of quirky aliens to help.<h3>Meet fascinating alien characters</h3><br/>​The galaxy is thriving with alien species, each with unique mysteries and motives. Meet an eclectic cast of characters, brought to life with full English voiceover. Ask sharp questions, make new friends, and exchange colorful insults.<h3>Adventure through HyperSpace</h3><br/>Discover a vibrant galaxy filled with wonder, terror, and absurdity. Explore thousands of uncharted worlds across hundreds of stars, and gather important resources and technology.<h3>Battle your rivals in starship combat</h3><br/>Build your fleet and battle enemy starships, facing off against friends or the computer-controlled AI. Play action-packed Super Melee as its own mode, or as part of the single-player adventure – or choose automated combat to stay focused on the story.<h3>Experience a sci-fi classic – for free!</h3><br/>As a celebrated piece of gaming history, Free Stars: The Ur-Quan Masters® has also received wide acclaim for its story, characters, and setting. It was created as a love letter to classic science fiction like Douglas Adams, David Brin, and Jack Vance. In turn, its setting inspired a new wave of game creators, including the visionaries behind Mass Effect, No Man’s Sky, Subnautica, Starfield, Fallout, and Stellaris – to name just a few.<br/><br/>In 2002, the game was released under an open source license thanks to the generosity of Paul Reiche and Fred Ford. It continues to be available to play as a free download, for game historians and fans to enjoy.<h3>Game features</h3><ul><li>Experience an open-world adventure, venturing through space to defeat the invading Ur-Quan and its hierarchy of battle thralls.<br/></li><li>Travel through extra-dimensional HyperSpace and discover nearly 500 unknown star systems filled with alien worlds.<br/></li><li>Fight enemies in fast-paced space battles with 25 different starships, each with its own unique attacks and powers.<br/></li><li>Befriend, threaten, or fight a diverse cast of aliens with unique personalities, from scary, to funny, to just plain weird.<br/></li><li>Explore thousands of planets, collecting resources and technology to upgrade your flagship and grow your fleet.<br/></li><li>Play standalone Super Melee to practice space combat against AI opponents or to duel against a friend.<br/></li><li>Mod and tinker with freely available, open-source code and content.</li></ul>", "metacritic": null, "released": "2024-02-19", "tba": false, "updated": "2024-02-23T04:54:02", "background_image": "https://media.rawg.io/media/screenshots/469/469a95eef18547fd254ccb5bc44d5869.jpg", "website": "https://freestarsgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pistol Shrimp"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Pistol Shrimp"], "esrb_rating": null}