{"id": 977257, "slug": "yatagarasu-enter-the-eastward", "name": "Yatagarasu Enter the Eastward", "name_original": "Yatagarasu Enter the Eastward", "description": "\"Yatagarasu Enter the Eastward\" is an original 2D fighting game. Our goal was to provide easy-to-understand gameplay so many people can enjoy the fun of fighting games. We deliberately kept the gameplay simple and focused on building a strong base around the fundamentals of fighting games and enabling players to enjoy the fun, core aspects of fighting games.<br/><br/>・An Original 2D Fighting Game<br/>An original 2D fighting game designed in the pixel art style which has become less common over the years. We paid close attention to designing appealing character designs and animations that can only be expressed in old-school pixel art.<br/><br/>・Core \"blocking\" System<br/>Yatagarasu's core gameplay mechanic is the blocking / \"BL\" system, which centers on deflecting your opponent's attacks and counterattacking. This simple system makes it easy to understand and apply strategy in the game.<br/><br/>・Simple Game System<br/>For a modern fighting game, Yatagarasu is very straightforward. Our goal was to create a game that anyone can pick up and play but also offers deep gameplay.<br/><br/>・Commentary System<br/>In live settings, fighting games have an off-screen appeal that includes fun smack talk, cheering, and commentary to engage the audience. To recreate this lively off-screen excitement, we’ve integrated a commentary system into the game. This is a unique feature where real-time commentary and hype play out as matches develop. <br/><br/>・Network Battle Support<br/>For \"Yatagarasu Enter the Eastward\", we've implemented our own netcode from scratch. You can enjoy smooth online battles with minimal network lag. This game includes a variety of features such as ranked matches, lobby matches, playing while waiting, and spectating. You can also use a website (Yatagarasu News) to check the current match status from your smartphone.<br/><br/>・Long Production Period and Intricate Improvements<br/>We’ve worked on the production and updating this game for for a long time, constantly improving the quality while listening to feedback from the fighting game community.", "metacritic": null, "released": "2024-02-19", "tba": false, "updated": "2024-02-23T04:11:16", "background_image": "https://media.rawg.io/media/screenshots/eeb/eeb3d0da65f30d20de02e6066694a031.jpg", "website": "http://yataac.com/ee", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 611, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yatagarasu Dev Team"], "genres": ["Action", "Indie"], "publishers": ["Yatagarasu Dev Team"], "esrb_rating": null}