{"id": 977336, "slug": "invisible-fear", "name": "Invisible Fear", "name_original": "Invisible Fear", "description": "<strong>This is my first game as a solo developer, of course you may encounter some bugs that I will be fixing! Since my childhood it was my dream to create my own game and here it is. I put a lot of time and effort into this game, I hope you enjoy it!</strong><br/><br/>Evelynn, an ordinary teacher in a private school, who had to endure tragic events, after that the school was closed and she was hospitalized with a serious injury. Now the previous nightmare follows her, haunts her dreams and calls her to go back, so Evelynn decides to return to the school to find out what happened on that terrible day. She wants to end her painful memories. There she encounters something supernatural...<h3>Abandoned School</h3>- Go through the nightmare in an abandoned school and find out what happened on the tragic day that changed everything here.<br/><h3>Camera is the key to survive</h3>- Use your camera or security cameras to protect yourself from creatures that comes out at night. The cameras can show you some invisible things.<br/><h3>Survive the night</h3>- In order to survive the night you need to find a certain number of artifacts. Each night will become more difficult and the creatures more dangerous.<br/><h3>Replayability</h3>- The items spawn is set randomly, as is the creatures on the location. You'll never be sure what awaits you in the next room: artifact or a trap?<br/>", "metacritic": null, "released": "2024-02-20", "tba": false, "updated": "2024-02-23T08:12:13", "background_image": "https://media.rawg.io/media/screenshots/255/2551a656df7132cd3d359bba0b96f1be.jpg", "website": "https://twitter.com/IdentityTraNe", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 367, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chilling Designs"], "genres": ["Adventure", "Indie"], "publishers": ["Chilling Designs"], "esrb_rating": null}