{"id": 97733, "slug": "acquittal-induction-demo", "name": "Acquittal: Induction DEMO", "name_original": "Acquittal: Induction DEMO", "description": "<p><strong>Thanks for supporting  the demo! It is now inactive as we're building on useful feedback for  the game's final release. You can keep up-to-date with the latest  progress mainly by Twitter and our subreddit!</strong></p><p><em>Capital punishment hasn't occurred in the United Kingdom since 1964, but, on the 15th March 2019, a colossal domestic terrorist attack on the state's most prestigious law school leaves the criminal legal system in chaos. With thousands of deaths, survivor Storm Sente, a mere 20-year-old law student, finds himself called to the bar to fulfil his premature duty. </em></p>\n<p><em>But as the so-called People's Movement for the Revival of Capital Punishment grows into an ever-larger, ever-present threat, the bar is by no means a safe place to be. With even the long-standing local police corruption rearing its ugly head, there's more to fight against than the cases themselves as friends become almost indistinguishable from enemies – the very future of law and order hangs in the balance, from forces both inside and out.</em></p>\n<p><em>Join Storm and investigate crime scenes, defend clients in court, achieve justice for the innocent and – with a bit of luck – uncover the truth of the fateful terrorist attack and the sprawling cult behind it.<br/></em></p>\n<p><em>Acquittal: Induction™</em>, the first instalment in a planned series, was born from inspiration from Capcom's <em>Ace Attorney</em> series and is in many ways a homage. Alternating between the investigation of criminal cases at the crime scene and the defence of clients in heated courtroom trials, it inherits its basic mechanics from the classic visual novel series, while taking and running with those core concepts.</p>\n<p>The game draws more inspiration from both British courtroom dramas and real-life cases, also adapting the genre to a format more befitting the PC/Steam platform, featuring updated, stylish graphics and new Sherlockian game mechanics (such as <strong>Testimony Analysis</strong>, <strong>Brainstorming </strong>and <strong>Concatenation</strong>) in the way of divergent thinking. These new game modes allow for logic and puzzle-solving like never seen before, moving from pointing out simple contradictions in testimonies to deducing complex facts and theories in order to fight your case and uncover the truth.</p>\n<p>Featuring a distinctive style, innovative gameplay mechanics and an epic story with a colourful cast of characters to match, <em>Acquittal: Induction</em> is comprised of five episodes, each longer and more challenging than the last. <strong>The 1st of these (<em>The First Daybreak</em>) is available to be sampled in the demo.</strong> The subsequent episodes will be released incrementally (as free updates included in the purchase) as development completes with funding.</p>\n<p>This law-drama adventure game will be available for PC, Mac and Linux, to be released on Steam.<br/></p>", "metacritic": null, "released": "2016-09-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2ca/2ca305a06ae17c79290ad16ca1caa4e7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Procella Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}