{"id": 977372, "slug": "prime-3", "name": "Prime", "name_original": "Prime", "description": "\"<strong>Prime</strong>\" is a board game inspired by chess and checkers. In the game, two opponents face off: the whites and the blacks. The game is played on a 64-square board, similar to that of chess.<br/><br/>The pieces are marked with a number, which is added each time to the captured piece's number or increased by 1 or 2 units when the piece is promoted (reaching the opposite side of the board).<br/><br/>Pieces with the number 1 are pawns and can move forward by only one square. Pieces with even numbers can move forward and sideways by only one square, while pieces with odd numbers can move forward and diagonally forward by only one square. Pieces with prime numbers starting from 5 can move in any direction (vertical, horizontal, and diagonal), provided the path is clear.<br/><br/>Pawns, even-numbered pieces, and odd-numbered pieces are eligible for promotion when they reach the opposite side of the board: pawns and even-numbered pieces increase their value by one unit, while odd-numbered pieces increase by 2. After promotion, the direction of the piece is reversed.<br/><br/>\"Prime\" pieces do not have a fixed direction as they can move in any direction (like the queen in chess). However, after capturing, if they become \"even\" or \"odd,\" they also inherit the direction of the captured piece. In the event that a \"Prime\" captures another \"Prime,\" the direction will be favorable to the side of the board closest to it.<br/><br/>At the beginning of the game, each player has 8 pawns, 4 even-numbered pieces, 2 odd-numbered pieces, and 2 prime-numbered pieces. The player who captures all opponent pieces wins. The game can also end when both players possess only \"Prime\" pieces: in this case, the winner is determined by who has more pieces, and in case of a tie, the game is a draw or a tiebreaker.", "metacritic": null, "released": "2024-02-21", "tba": false, "updated": "2024-02-23T10:00:06", "background_image": "https://media.rawg.io/media/screenshots/283/2836f89b73bb56d5f7e3bae26abcfb9d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Giuliano D'Oronzo"], "genres": ["Strategy", "Indie"], "publishers": ["Giuliano D'Oronzo"], "esrb_rating": null}