{"id": 977361, "slug": "pennys-big-breakaway-2", "name": "Penny’s Big Breakaway", "name_original": "Penny’s Big Breakaway", "description": "Ready. Set. YO! - Join Penny &amp; Yo-Yo in a kinetic 3D-platformer bursting with innovative gameplay! Showcase your catalog of tricks and chain impressive combos to deliver Penny &amp; Yo-Yo's perfect breakout performance. Take the stage with this vibrant pair in Penny’s Big Breakaway.<br/><br/>Penny is a street performer with big dreams; she has her own spin on what it takes to be a star! When Eddie the Emperor calls for new Palace Court Performers, Penny gets herself tangled in an audition she’ll never forget. A strange encounter with a Cosmic String transforms Penny’s Yo-Yo into a living creature with an appetite for snacks— and mayhem! Use Yo-Yo to help Penny clear her name, outrun the Emperor’s penguin army, and unravel the mystery of the Cosmic String. <br/><br/>Burst onto the scene in the fluorescent world of Macaroon, home to this over-and-under escape! Discover your true star power in this easy-to-play, difficult-to-master challenge. Penny’s Big Breakaway is the debut title from Evening Star.<br/><br/><br/><br/>Key Features: <br/><br/>Walk the Dog: Yo-Yo’s big appetite will earn an even bigger reward with snack power-ups! Use these tasty treats to temporarily transform Yo-Yo, granting it the abilities to improve movement speed, protect Penny from harm, and much more!<br/><br/><br/><br/>Around the World: Flee from Eddie the Emperor’s massive penguin army as they chase you clear across the planet! These clumsy flightless birds patrol the halls, come bursting through walls, and will stop at nothing to seize you! Help out friendly denizens along the way and make use of your spectacular surroundings to evade your capturers. <br/><br/><br/><br/>Encore Stage: Play your way with multiple game modes! Show off your skills as you chain awesome combos and rack up multipliers in Story Mode. Take on the ultimate speedrunning challenge and dominate the leaderboard in Time Attack Mode. Redeem coins for bonus items, secret stages, and more unlockable extras.<br/><br/>", "metacritic": null, "released": "2024-02-21", "tba": false, "updated": "2024-03-25T22:23:09", "background_image": "https://media.rawg.io/media/screenshots/007/00765cd0b4aa5626163a9aad9c1cf4a7.jpg", "website": "http://pennysbigbreakaway.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 5, "beaten": 1, "toplay": 4, "playing": 1}, "playtime": 6, "achievements_count": 30, "ratings_count": 1, "suggestions_count": 330, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Evening Star"], "genres": ["Adventure", "Indie"], "publishers": ["Private Division"], "esrb_rating": null}