{"id": 977398, "slug": "bodacious-babes-nightlife", "name": "Bodacious Babes: Nightlife", "name_original": "Bodacious Babes: Nightlife", "description": "The Bodacious Babes are hitting the town! Can you win them over and take them home with you tonight?<br/>Bodacious Babes: Nightlife is a fun, casual puzzle game where you unlock one of the babe’s spicy pictures every time you beat a level! Master the levels to unlock hotter bonus images for each level!<br/><br/>- 6 Bodacious Babes!<br/>- 30+ Levels!<br/>- 100+ unique images!<br/>- Gallery unlocks!<br/>- Bonus unlocks!<br/><br/>What are you waiting for? <br/>MEET THE BABES!<strong>Candy:</strong> <strong>Age:</strong> 19Meet Candy! She loves to party! Candy hits the clubs as often as she can with her girlfriends, Candy loves making new friends in real life and online. She's an aspiring streamer and tonight she’s celebrating her 100th subscriber! Catch Candy at the local internet café or on the dance floor.<br/><br/><strong>Scarlet:</strong> <strong>Age:</strong>26Scarlet rarely gets any time off between her job as a dancer and her love of the gym. The few moments she has free are usually spent reading romance novels. She might never admit it, but she would love to meet a handsome guy like in her stories! Do you have what it takes to intrigue her?<br/><br/><strong>Ashley:</strong> <strong>Age:</strong>20Ashley grew up in the nice part of town in her parents’ giant manor. Though she loves her family, she always felt a little stifled by their strictness. Ever since she’s moved out of home, she’s been taking every opportunity to have fun, party and let loose! Catch her on the town with her cheer squad tonight!<br/><br/><strong>Raven:</strong> <strong>Age:</strong>24Raven’s taken the night off work from the local dispensary for a night of partying! She loves hitting the clubs in her favourite outfits: all black, of course! She can be a play a little hard to get at first, but she can be a total sweetheart...maybe!<br/><strong>May:</strong> <strong>Age:</strong>22Mai can be a little shy sometimes, so she wasn’t too excited when her friends told her they’re taking her out for the night. But when she heard the magic word: casino, she was completely sold! Though it might be hard to get her attention when she’s winning game after game of blackjack!<br/><br/><strong>Amari:</strong> <strong>Age:</strong> 21Amari is a hard worker; you need to be if you’re going to make it as a lawyer! It took her friends forever to convince her to leave her books behind and let loose for the night, but now that she’s here, she doesn’t regret it one bit! Can you charm Amari beyond all reasonable doubt?<br/>", "metacritic": null, "released": "2024-02-22", "tba": false, "updated": "2024-02-23T11:17:52", "background_image": "https://media.rawg.io/media/screenshots/74a/74a46f57a49d8b8c041bdf7da4a9a2df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kodai Magic"], "genres": ["Casual"], "publishers": ["Kodai Magic"], "esrb_rating": null}