{"id": 977368, "slug": "tetraphobia", "name": "Tetraphobia", "name_original": "Tetraphobia", "description": "Tetraphobia is a roguelite action shooter that takes the dungeon crawler experience and exposes it to the skies. Play as Trixx, a treasure hunting rogue equipped with a transforming bow, and fight through a procedurally generated world of floating islands filled with dangerous creatures and powerful titans.<br/><br/>Utilise your transforming bow that can swap between long and shortbow on the fly to give you different strategies to battle. Shoot, dodge and blast your way through enemy encampments with the shortbow or play from a distance and utilise armour piercing charge shots from your longbow.<h3>Battle Ferocious Titans</h3><br/><br/><br/>Set in a beautiful world of floating islands inspired by an East-Asia fantasy style, The Fractured Sky is a dangerous place where people can succumb to their fears. Four Titans guard different realms throughout the world each with their own unique identity. Different realms will offer unique enemies, bosses and a host of unique artefacts.<h3>Exciting Artefacts with Powerful Effects</h3><br/><br/><br/>With multiple unique regions, a huge variety of artefacts, exciting modifiers and untold secrets - Tetraphobia is brimming with rouge-like details that will keep every run feeling fresh and unique. Depending on which realms you visit and the secrets you find you may end up with an incredibly jacked up bow, powerful allies or a small army of cats.<br/><br/>If you discover an artefact that doesn't synergise well with your current build you can always trade it at the airship island.<h3>Hunt for Cat Treats</h3><br/>Of course, the most important loot you can find in The Fractured Sky is cat treats! These meow-verlous creations will give you the chance of finding extra loot from your cat Companion Reno. It's still a mystery why he doesn't just give you the loot in the first place.<br/><br/><br/>Throughout your journey you'll rescue others who have been consumed by their fear. Once rescued, they will give you access to more advanced artefacts and unique modifiers that will affect The Fractured Sky in different ways. Some will offer you unique challenges and quests with unique rewards to make your journeys more exciting.", "metacritic": null, "released": "2024-02-21", "tba": false, "updated": "2024-02-23T09:49:28", "background_image": "https://media.rawg.io/media/screenshots/c8b/c8b4f106f39852e2c9362bc34ae1d49e.jpg", "website": "https://www.tetraphobia.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PolyPlant Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["PolyPlant Games"], "esrb_rating": null}