{"id": 977324, "slug": "beastwatch-meat-mayhem", "name": "BEASTWATCH: Meat & Mayhem", "name_original": "BEASTWATCH: Meat & Mayhem", "description": "Beastwatch is a retro-style horror shooter in which you play a security guard working his first night in a slaughterhouse.<br/><br/>Plunge into an unimaginable macabre nightmare in Beastwatch, a terrifying first-person shooter that immerses you in the heart of darkness. On your first shift as a security guard at a shadowy slaughterhouse, you expected a quiet night, but blood spills, and hidden horrors emerge as the animals take a sinister turn.<br/><br/><br/><br/><h3>KEY FEATURES</h3><br/><br/><ul><li> <strong>Immersive Retro Atmosphere:</strong> Explore a world of terror thoughtfully designed with retro graphics that transport you to the golden age of horror gaming.<br/><br/></li><li> <strong>Intense First-Person Action:</strong> Confront grotesque mutations in thrilling first-person combat as you fight for survival in a slaughterhouse overrun by chaos.<br/><br/></li><li> <strong>Unthinkable Horrors:</strong> Face unimaginable abominations that will challenge your sanity and tactical skills around every corner.<br/><br/></li><li> <strong>Tense Exploration:</strong> Traverse dark hallways, chilling storerooms, and secret passages as you unravel the story behind the nightmare lurking in the slaughterhouse.<br/><br/></li><li> <strong>Mysteries to Uncover:</strong> Discover clues, solve puzzles, and unravel the darkest secrets of the slaughterhouse as you struggle to survive.<br/><br/></li><li> <strong>Claustrophobic Atmosphere:</strong> Immerse yourself in an intensely claustrophobic atmosphere where every corner hides a new terror waiting to shred you apart.</li></ul><br/><br/><br/>Prepare for a visceral horror experience that will test your nerves and wit. <br/><br/>Are you ready to face your first night in the slaughterhouse?<br/><br/>https://store.steampowered.com/app/2596480/BEASTWATCH_Meat__Mayhem/", "metacritic": null, "released": "2024-02-20", "tba": false, "updated": "2024-02-23T07:43:08", "background_image": "https://media.rawg.io/media/screenshots/c0b/c0b814428c14279c0654faf9453fc603.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Somnambulist Games"], "genres": ["Action"], "publishers": ["Somnambulist Games"], "esrb_rating": null}