{"id": 977302, "slug": "tiny-house-2", "name": "Tiny House", "name_original": "Tiny House", "description": "There are 14 rooms, each concealing riddles and collectible objects, waiting to be unraveled by you. Whether you're new to escape games or a seasoned adventurer, the diverse puzzles will captivate you.<br/>\n<br/>\r\nAll packed into a cute 3D isometric style, Tiny House is completely free to play, no In-app purchases are needed to complete the rooms. You can still remove Ads and support the development with an IAP of your choice.<br/>\n<br/>\r\nExperience the captivating 3D graphics that set Tiny House apart, blending classic point-and-click adventure with modern room escape mechanics<br/>\n<br/>\r\nTiny House is available in English, French, Italian, German, Spanish, Russian, Japanese, Korean, and Portuguese. The game language automatically changes based on your OS language settings.<br/>\n<br/>\r\nDon't forget to let your friends know how far you've gone on the game, they may want to compete with you in this exciting escape room experience!<br/>\n<br/>\r\n- What's an escape room game? <br/>\r\nIn an escape game, you aim to break free from a trapped location by employing skill, patience, and logical thinking. By examining and interacting with objects, you gather clues and items essential for solving puzzles and ultimately escaping the room.<br/>\n<br/>\r\n------------------------------------------------<br/>\n<br/>\r\nXSGames is an independent solo startup from Italy", "metacritic": null, "released": "2024-02-20", "tba": false, "updated": "2024-02-23T06:28:38", "background_image": "https://media.rawg.io/media/screenshots/705/7051edb21ce4f432383dbf1f3ac11fde.jpg", "website": "https://xsgames.co", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["XSGames"], "genres": ["Adventure", "Strategy", "Indie"], "publishers": ["XSGames"], "esrb_rating": null}