{"id": 977322, "slug": "schmaragon", "name": "Schmaragon", "name_original": "Schmaragon", "description": "Schmaragon is an exciting third-person indie MOBA with shared experience, created using assets from Paragon.<h3>Schmaragon also boasts a set of interesting features:</h3><br/><ul><li><strong>Variable-powered heroes</strong>: Some heroes are significantly more powerful than others. For example, Level 3 heroes are 4-5 times more powerful than Level 1 heroes.</li><li><strong>Hero companions</strong>: A mutt or a beast that you can control, providing you with combat and tactical advantages.</li><li>Schmaragon players can choose which abilities they want their heroes to have, and they can even change their heroes after the match has already started.</li></ul><h3>The team-based leveling system and its consequences:</h3><br/><ul><li>Schmaragon employs a team-based leveling system, where all team members share the same XP level and acquire abilities and items simultaneously.<br/></li><li>Because all team members always maintain the same XP level, players can leave the match at any time, knowing that they will be promptly replaced by another player of the same XP level.<br/></li><li>Therefore, we've introduced some interesting measures. A 1-minute AFK (Away From Keyboard) period will result in removal from the match, while 2 minutes of no contribution (e.g., no damage dealt to enemies) will lead to a ban from the match.<br/></li><li>Team members can also vote to ban other team members from the match (requiring 4 out of 6 votes).<br/></li><li>Because heroes have varying power levels (three Level 1, two Level 2, and one Level 3 hero on each team), they don't equally impact the match's outcome. Level 3 heroes have the most significant impact. The idea is that less experienced players would opt for Level 1 heroes, which have a lesser impact on the match's outcome.<br/></li><li>Players have an incentive to stay until the end of the match due to the permadeath mechanic, as they receive bonus hero lives for doing so.<br/></li><li>Additionally, there's a concept of adjusting bounties. Dying frequently reduces the XP fed to the opposing team, while accumulating many kills increases your bounty.</li></ul><h3>Permadeath mechanic explained:</h3><br/>In this unique MOBA setup, heroes start with a limited number of lives. They lose lives when defeated but can regain them by vanquishing creeps, defeating enemy heroes, or participating in the game until the end of the match. <strong>This is important: lives are permanently stored on a central server, guaranteeing that the number of lives persists and carries over between matches.</strong> If a hero runs out of lives, the player can no longer play as that hero.<br/><br/><strong>The gameplay and psychological impacts of permadeath:</strong><br/><br/><ul><li>Dying only affects you; the impact of death on your team is minor. That means less toxicity between teammates and a friendlier environment for new players.<br/></li><li>Although not a requirement, there is a strong incentive for every player to finish the match because big rewards in terms of hero lives are granted at the end.<br/></li><li>The concept draws inspiration from Eve Online, where players command spaceships susceptible to destruction in diverse ways. Once your ship is destroyed, it is permanently lost. While you can acquire another, the one you originally had is irretrievably gone.<br/></li><li>Permadeath can add a heightened sense of risk and reward to the gaming experience. Knowing that failure carries consequences can make success more satisfying.<br/></li><li>Permadeath can lead to stronger emotional connections between players and their characters or assets. The fear of loss can make victories more meaningful.<br/></li><li>The potential for permanent consequences encourages players to learn from their mistakes, adapt their strategies, and become more skilled over time.</li></ul><br/><strong>Questions and answers:</strong><br/><br/><strong>Q:</strong> Is the only effect of permadeath going to be that people play much more defensively and care less about their teammates?<br/><strong>A:</strong> This is a valid point, but we have some countermechanics:<br/>If the hero life loss becomes too overwhelming, players have the option to fall back to a default hero (Kwang, Serath, or Crunch), which is not affected by the permadeath system. This is because Schmaragon allows changing the hero in the middle of the match. If the hero life loss is still too overwhelming, players have the option to leave the match. This is because, as explained earlier, Schmaragon doesn't penalize quitting in the middle of the match.<br/><br/><strong>Q:</strong> Encouraging quitting during the match? That doesn't seem like the best idea.<br/><strong>A:</strong> There is a strong incentive for every player to finish the match because big rewards in terms of hero lives are granted at the end. However, if you have to leave for any reason, we will not penalize you. <br/><br/><strong>Q:</strong> Doesn't it sound like a system that only exists to charge players money when they run out of lives?<br/><strong>A:</strong> We promise not to use any shady methods to make money. Currently, our studio doesn't have a monetization plan.", "metacritic": null, "released": "2024-02-20", "tba": false, "updated": "2024-02-23T07:37:42", "background_image": "https://media.rawg.io/media/screenshots/477/477ae8569c841d94e89cc6a8334540f9.jpg", "website": "https://www.reddit.com/r/Schmaragon/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Paragon Schmaragon"], "genres": ["Strategy"], "publishers": ["Paragon Schmaragon"], "esrb_rating": null}