{"id": 977327, "slug": "the-lost-legends-of-redwall-the-scout-anthology", "name": "The Lost Legends of Redwall: The Scout Anthology", "name_original": "The Lost Legends of Redwall: The Scout Anthology", "description": "Step into the epic, story-rich world of Mossflower in the first official Redwall story since 2011. \"The Scout\" is a linear action-adventure game told in three acts. Play as Liam or Sophia, the newest member of the Lilygrove Scout Corps, as the young mice find themselves on the journey of a lifetime to save their home from ruthless pirates. Will they reach Redwall and save their friends before all is lost?<br/><br/><h3>The Scout Act 1</h3>After months of training, betrothed mice Liam and Sophia are ready to graduate into fully-fledged Scouts: a group of woodland rangers tasked with the protection of the land and trained in the ancient ways of woodcraft. Their initiate ceremonies are cut short when sea rats attack their beloved home. As the senior Scouts rally for battle, it's up to the Scout Corps' newest recruit to outwit the enemy, light the beacon, and summon aid from the surrounding woodlands - before there is nothing left to save.<br/><br/><h3>The Scout Act 2</h3>The beacon is lit, troops rally to fend off the invading searats, and Liam reunites with his dear Sophia beneath the Lilygrove Lighthouse, but not all is well. Scumsnout's vengeful cries can be heard in the distance and it is revealed that our Scout's betrothed has been poisoned by the wereat's venomous bite. With no time to spare, the couple race to the Winsome Wraith, where a mysterious and dangerous stoat may have the antidote they seek. As if things weren't bad enough, the sea rats are moving inland and the shadow of a large predatory bird lurks just at the edge of the woods.<br/><br/><h3>The Scout: Act 3</h3>After being mortally poisoned by Scumsnout's vicious maw, our young Scouts have made it to the Winsome Wraith in one piece, if just barely. While the mysterious stoat's treatment has bought some precious time, Liam and Sophia must now travel the rest of the way to Redwall Abbey for a more permanent cure. This is the dramatic conclusion of their journey through the murk of Portman's Slough, the miraculously-functioning puzzles of Grating Gulley, and the ancient ruins of the Otters' Den.<br/><br/><h3>Features</h3> <ul><li>A brand new original story set the winter before the events of the first book.<br/></li><li>A stunning woodland world inhabited by charming critters and villainous vermin. <br/></li><li>Two characters with divergent dialog for replayability.<br/></li><li> Unique real-time scent mechanic fitting for woodlanders who experience the world primarily through their noses.<br/></li><li>An assortment of achievements and collectables for the completionist spirit. <br/></li><li>Original soundtrack created especially for fans of Redwall.<br/></li><li>Fully voice acted by a talented cast of new and established actors.<br/></li><li>Engaging puzzles and side stories for those who delight in world building.<br/></li><li>Full controller support with multiple schemes to choose from.<br/></li><li>Anthology Includes all 3 Acts in one, with revamped lighting and controls.</li></ul><br/><h3>Mechanics</h3><ul><li>\"The Scout\" debuts a dynamic scent system unlike any game before it. Rather than stagnant, pre-designed paths that imitate scent, particles read the wind and the environment to simulate realistic currents and pools. Scents themselves consist of parts and patterns designed around real scent theory.<br/></li><li>When traversing the world of Mossflower, you make use of your mouse agility to explore the world in a unique and wondrous way. Shimmy along ledges, scramble sheer cliffs, and even squeeze through impossibly small spaces. With courage, faith, and friends by your side, Mossflower's fate rests in your paws!<br/></li><li>Rely on stealth, wit, and agility to evade your enemies. Manipulate dull-witted vermin with scent and scent to avoid getting caught in their grubby paws. <br/></li><li>Use your trusty way glass to scope the area and identify danger. Rely on your home-made slingshot to solve puzzles, break pots, and activate traps.<br/></li><li>Decide if you will prioritize the mission and leave the others to save themselves or take the time to lend a helping paw. Some may praise philanthropy, still others would praise pragmatism.</li></ul><br/><br/>\"The Lost Legends of Redwall™\" is inspired by the wildly popular characters and world created by Brian Jacques in the Redwall™ best-selling book series, published by and on behalf of Penguin Random House and now announced for a major movie and TV series by Netflix.<br/><br/><br/><br/><br/>\"The Lost Legends of Redwall™\" is a series of games and a proud collaboration between Redwall Abbey Company Ltd, Penguin Random House UK, and Soma Games. Together we have nurtured a product that we believe captures the original heart of Brian Jacques’ masterpiece. Lovingly crafted at every turn, The Lost Legends of Redwall™ hopes to earn its place among the influential games of the new millennium.<br/>", "metacritic": null, "released": "2024-02-20", "tba": false, "updated": "2024-02-23T07:51:10", "background_image": "https://media.rawg.io/media/screenshots/838/838a779486e7e99cca54551ee97828e2.jpg", "website": "https://legendsofredwall.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Soma Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Forthright Entertainment"], "esrb_rating": null}