{"id": 977430, "slug": "vscs-ii", "name": "VSCS-II", "name_original": "VSCS-II", "description": "In VSCS-II, newer technology tracks your every move, algorithms and automated systems reinforce societal issues, and something even worse lurks on the horizon. In the shadowed corners of the internet, groups of freedom-fighters on a secure network are rising to combat injustices, but their tactics vary. As a newcomer to this digital landscape, you'll have to utilize a modified '80s operating system to make contact with these factions, investigate the truth, and ultimately decide the fate of privacy in a world set on eradicating it.<h3>The VSCS-II</h3>In this alternate future, computer hardware is heavily restricted. The only exemption? A commercial flop from 1986: the Stultusoft \"Very Secure Computer System Mk.II\"; a computer known only for it's poor marketing and (ironically) terrible security. But in the modern day, the VSCS-II has gained new life. When wired to have internet connectivity and running the \"LunaOS\" operating system - built 40 years after the original system - the VSCS-II forms the backbone for small resistances that battle authoritarian measures.<h3>A Branching Narrative</h3>Actions in VSCS-II have lasting effects, both in the short term, and the long term. Whether it's participating in a heated debate, committing a criminal act, or simply planting a new idea in someone's head, the impacts of your actions may not be obvious... but they will have consequences.<h3>Choose a Side</h3>A colourful cast of characters contrasts the monochrome 1980s haze, with each character having their own stance on the ethics of privacy, security, and artificial intelligence. As your influence grows and others in hiding begin to trust you - who will you side with? Factions using the VSCS-II have distinct views on what should (and shouldn't) be done to fix their broken world, and who should (and shouldn't) get a say in it. The choice will end up in your hands as you carve a unique path through the story, culminating in one of four unique endings.", "metacritic": null, "released": "2024-02-22", "tba": false, "updated": "2024-02-23T13:09:27", "background_image": "https://media.rawg.io/media/screenshots/7fa/7fac159169cc7f94b44e9627e2329f89.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Oliver Morrish"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["Skullbutton Interactive"], "esrb_rating": null}