{"id": 97748, "slug": "machine-made-rebirth-itch", "name": "Machine Made: Rebirth (itch)", "name_original": "Machine Made: Rebirth (itch)", "description": "Overview<p>Machine Made is a <strong>Turn-based RPG</strong>, with <strong>Puzzle &amp; Adventure</strong> elements and a focus on <strong>Collecting and Crafting</strong> that allows for a high degree of character customization and a deep level of strategic thinking. The story takes place in a beautifully crafted <strong>Steampunk</strong> world with <strong>Fantasy/Sci-fi</strong> influences that will capture your imagination.</p>Story<p>In a futuristic world where the mysterious angel-like beings called \"Zephyrim\" live like the Gods of mythology, they dominate the skies, dwelling in their utopian floating cities and ruling their civilization with a vast network of computers. A man with a fondness for inventing machines stumbles upon a strange young woman who has been exiled from the skies. This woman wakes up in the infirmary of a place called Skycity to find herself completely without memories. She's been convicted of murder. Her people -- the Zephyrim, have a procedure for dealing with murder -- they wipe out all trace of the crime, including the perpetrator's memories, and they exile the murderer to a remote area from where he or she will never be able to return. Now she must discover her past, fight to survive, and discover that she alone will hold the key to bringing peace to the world.</p>Features<ul><li>Compelling storyline -- discover the protaganist's past through a gripping narrative featuring memorable characters.</li><li>Unique musical score -- enjoy hours of high quality electronic music that brings the science fiction/fantasy world alive.</li><li>Vibrant art, interactive environments -- delve into lush environments in search of treasure and materials.</li><li>Elaborate item crafting -- craft and upgrade your own customizable set of gear.</li><li>Powerful summoned creatures -- wield the power to connect with powerful mythical beings.</li><li>Choice-influenced narrative -- watch the development of the world altered by your choices.</li><li>Smooth interface and animation -- glide seamlessly through battle, puzzle solving and gathering.</li><li>And more...</li></ul>", "metacritic": null, "released": "2016-05-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3c8/3c8731f8411ddce688b026709b9b1db8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pinkerator"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}