{"id": 977496, "slug": "mp-maya-prophecy", "name": "MP / Maya Prophecy", "name_original": "MP / Maya Prophecy", "description": "The world view is derived from the parallel timeline of a personal novel.<br/><br/>In a parallel timeline in 2012, the Maya Prophecy of the world's end came true, not due to meteorites or floods, but because a small number of humans awakened superpowers. These abilities were potent enough to shake the entire world, leading to a war between the awakened, referred to as the \"New Human,\" and the non-awakened, known as the \"Old Human,\" sparking a global conflict.<br/><br/>The game emphasizes challenging battles, with every fight, except the first one, being winnable. If unable to win, players can study tactics for improvement. JP points earned from defeating monsters can be used to enhance character attributes.<br/><br/>Speed is crucial in the game, as having a lower speed may result in enemies taking action twice. Additionally, there is an equipment enhancement system where scrolls for strengthening attributes can be acquired through battles or purchased from shops. Equipment can be strengthened in the menu, but this decision is irreversible.<br/><br/>The current version of the game features only six playable characters, with three starting characters and the others joining after battles.<br/><br/><br/>Game Features:<br/><br/>●Each boss battle presents a high level of difficulty.<br/>●Diverse skills can be obtained through battles or by purchasing skill books from the shop.<br/>●There is no limit to the attributes of all characters.<br/>●The unique JP system allows self-enhancement through battle rewards.<br/>●Various abnormal states add challenge to battles.<br/>●Equipment enhancement system.<br/><br/><br/>Change language<br/><br/>", "metacritic": null, "released": "2024-02-22", "tba": false, "updated": "2024-02-26T06:04:31", "background_image": "https://media.rawg.io/media/screenshots/cca/cca8bc72cdd1257576a604aec679f2cc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DDK"], "genres": ["Adventure", "RPG"], "publishers": ["DDK"], "esrb_rating": null}