{"id": 977440, "slug": "quick-quest", "name": "Quick Quest", "name_original": "Quick Quest", "description": "Explore a pixelated world steeped in nostalgia with our retro roguelite game. Conquer procedurally generated levels and survive with just one life in this thrilling challenge. Master the jump, attack, and charged attack in a classic platforming view.<br/><br/><br/>What sets our game apart is the epic boss battles. Dive into strategic showdowns, blending the essence of Zelda 2 and Megaman, with the addition of a tactical wall jump for intense boss fights. there are approximatively 10 bosses along the run.<br/><br/><br/>As you traverse the procedurally generated levels, you'll regularly discover a variety of equipment in special rooms throughout your run. Equipments come in various types, including swords and helmets, each enhancing or modifying your attack and potentially adding special moves. Be cautious, though, as these can be lost during the run, and the compatibility of certain helmets with specific swords adds an extra layer of strategy.<br/><br/>In addition to traditional weapons, there are throwable items and consumables to aid you in your journey. Use these strategically to gain the upper hand in challenging situations.<br/><br/>Try also more roguie patches that, unlike other equipment, cannot be lost during the run. introducing distinctive functionalities.<br/><br/><br/><br/>Every death means losing your hard-earned equipment, but persevere to unlock permanent feats and maybe a new game mode. Get ready to face the challenge and beat your best progress in this nostalgic retro world. Will you manage to complete the run?", "metacritic": null, "released": "2024-02-22", "tba": false, "updated": "2024-02-23T13:32:43", "background_image": "https://media.rawg.io/media/screenshots/c85/c85b649994ecca2d8de05e92950a4838.jpg", "website": "https://twitter.com/SylphArcade", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SYLPH", "Rolemusic"], "genres": ["Adventure"], "publishers": ["SYLPH"], "esrb_rating": null}