{"id": 977484, "slug": "perfect-world-m", "name": "Perfect World M", "name_original": "Perfect World M", "description": "Perfect World has made its grand return! This new installment restores the beautiful scenery and rich class choices that made the original game famous. Gather your friends and raise an adventure in the iconic seamless world that has been overhauled to reach an unprecedented fidelity. The bonds between you and your fellow challengers have never been so strong thanks to improved mentoring, marriage, guild and party systems. It's about time to unite and fight for glory in this brand new world forged with next-gen graphics. The vast skies, the endless lands and the mysterious oceans are all yours to explore. Find your Perfect World here!<br/>\n<br/>\r\n-Reforging of a 17-YO Classic IP<br/>\r\nInheriting the legacy of a 17-year classic, Perfect World M carries on the passions of the original, restoring the classic settings and class choices to bring you the most authentic PW experience. The Human, the Winged Elf and the Untamed has made their return to the Perfect Continent!<br/>\n<br/>\r\n-Fulfill Your Ultimate Xianxia Fantasy<br/>\r\nOriental-inspired art style and a Spirit based skill enhancement system. Immerse yourself in the balance of Yin and Yang and meditate with the flow of the five elements. Raise an adventure in this Perfect World and fulfill your ultimate Xianxia fantasy!<br/>\n<br/>\r\n-Next-gen Graphics &amp; Seamless World<br/>\r\nMovie-level graphic quality incorporating realistic light and shadow effects guarantee the most immersive season and weather experience. A massive panoramic world where the three major cities are at their best and most gorgeous!<br/>\n<br/>\r\n-Every Flight Is a New Adventure<br/>\r\nThe Perfect Continent spans over 60,000 square kilometers, while the panoramic three-dimensional map seamlessly connects and integrates the unique flight system from the original game. Let's fly the Perfect sky!<br/>\n<br/>\r\n-Thrilling and Diverse Battles<br/>\r\nPerfect balance and cooperation between multiple classes, each having its distinct characteristics. Bring your combat to the air, the land and the oceans as you wish. Wage wars in massive multiplayer dungeons and claim your glory in epic guild conflicts.\"", "metacritic": null, "released": "2024-02-22", "tba": false, "updated": "2024-02-26T05:43:50", "background_image": "https://media.rawg.io/media/screenshots/fbf/fbf0c1d0b06121d02711161151cc9614.jpg", "website": "https://www.playperfectworld.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Perfect World Games"], "genres": ["RPG", "Massively Multiplayer"], "publishers": ["PERFECT WORLD GAMES"], "esrb_rating": null}