{"id": 97743, "slug": "sleuthhounds-the-yuletide-tail", "name": "Sleuthhounds: The Yuletide Tail", "name_original": "Sleuthhounds: The Yuletide Tail", "description": "<p>Christmas. A time of peace on earth. A time of goodwill to everyone. A time for friends and relatives to get on each others' nerves.</p>\n<p>As consulting detectives Jane Ampson and Pureluck Homes settle down to a less than harmonious Christmas day, word comes of a case. A case from an eccentric writer living in a secluded manor.</p>\n<p>The search is on for an item that not even the owner can remember. What secrets do these dusty halls hold? What bearing have they on the tensions between the detectives? And, most importantly, will there be figgy pudding at the end?</p>\n<p>Guide Jane Ampson and Pureluck Homes through this challenging Christmas caper.</p>\n<p><strong>Features</strong></p>\n<ul><li>Christmas themed mystery adventure game.</li><li>Use Pureluck Homes and Jane Ampson together to circumvent obstacles in a dilapidated mansion.</li><li>Story-based gameplay challenges your wits not your reflexes.</li><li>Multiple endings to uncover.</li><li>One handed point-n-click interface lets you play even while eating Christmas dinner.</li><li>Different difficulty settings, a hotspot highlighter, and a built in hint system let you set your own challenge.</li><li>Unwrap, er, unlock achievements, collectibles, and special features throughout this Christmas case.</li></ul>\n<p><strong>Minimum Requirements</strong></p>\n<ul><li>Operating System: Microsoft Windows XP, Vista, Windows 7, Windows 8, or Windows 10</li><li>CPU: Intel Core 2 1.7 GHz, AMD Athlon 2400 2.0 GHz, or better</li><li>RAM: 256 MB</li><li>Graphics: Hardware Accelerated with full OpenGL 1.2 support (1.4 support recommended; ATI/AMD Radeon, nVidia GeForce 3, or better)</li><li>Sound: 100% DirectX compatible sound card</li><li>Hard Drive: 143 MB free disk space for install</li><li>Input Devices: 100% Windows compatible mouse or single touch based PC</li></ul>\n<p>\n</p>\n<p><strong>Follow the latest game development!</strong></p>\n<p>Web: www.SeaLeftStudios.com</p>\n<p>Twitter: @SeaLeftStudios</p>", "metacritic": null, "released": "2017-12-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f67/f67b93bd7ae524b61b721fb109a88694.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SeaLeft Studios"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}