{"id": 977587, "slug": "without-you-3", "name": "WITHOUT YOU", "name_original": "WITHOUT YOU", "description": "Without you is a story-based non-linear visual novel with live2D sprites. Cute artwork, CGs, BGs, and CGs in chibi style in 4k resolution,original soundtracks, and a interesting story!<br/><br/>\"Without You\" is a gripping visual novel about the life of Moscowia State University student who has one dream - freedom. There is no room for lies: all the beauty and ugliness of life will appear before your eyes in its clearest form. What to think of it is up to you.<h3>Story</h3>Maels is a student of MSU, Moscowia's finest university. With his sister Alpha Maels has spent his whole life trying to escape from the poverty that surrounds them. But the reality turned out to be much harsher - the world rejected them.<br/>As a result, Alpha fell into depression and went on academic leave. Maels' heart hardened - in response to the anger towards his sister, he refused to accept this unjust world. He stopped attending classes, stopped associating with his classmates. He no longer desired to fit into the system. Apart from his sister, the only person he kept in touch with was Izolda, a caring childhood friend he met back in middle school.<br/>This is the way he lived until he met Astra, the love of his life. Her sincerity and kindness awakened in him long-forgotten feelings and reminded that the world consists of more than just hatred and malice.<br/>He no longer needed to fight the world. When you are truly happy, any hardship in life is vincible...<br/><br/><br/><br/>Did you really think it would be that easy? Maels had found love, the world suddenly became a much better place and happiness had replaced the anger in his heart? Then he'll find a 9-5 job, raise three children and take a mortgage on a flat?<br/>Cowardice and turning a blind eye to the abhorrent actions of people around you would only lead to losing everything you hold. So... The only way out was to fight. Fight this cruel and unjust world.", "metacritic": null, "released": "2024-02-24", "tba": false, "updated": "2024-02-26T09:01:42", "background_image": "https://media.rawg.io/media/screenshots/8e7/8e7a8298c437bdb34d3bbc88f5131725.jpg", "website": "https://twitter.com/IzimovAlexey", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 441, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aleksey Izimov"], "genres": ["Simulation"], "publishers": ["VN Devs"], "esrb_rating": null}