{"id": 977524, "slug": "the-implant", "name": "The Implant", "name_original": "The Implant", "description": "Embark on a unique journey with our first major title, a 2D visual novel that blends innovative gameplay with an engaging narrative. As you launch into this game, you'll be introduced to the groundbreaking invention of the \"implant,\" setting the stage for a series of intriguing mini-games centered around the theme of belly bloating.<br/>\n<br/>\r\nYour adventure begins in the command room, which serves as the central hub for all your in-game actions. From here, you're free to explore two main pathways: the brain options and the world options. The brain options offer a realm of possibilities, including surveillance and simulations of scenarios that transcend reality. You'll have the opportunity to simulate dates or interactions with a fitness girl, whose physique can vary from fatter, leaner, to muscular based on your preferences.<br/>\n<br/>\r\nSurveillance allows you to peek into the company office and monitor influencer streams, a feature that becomes available as you progress. Additionally, you can choose to hibernate, skip time, and even generate and release your own magazine. This magazine can promote bloated bellies to gain more reputation or advocate for skinny women, affecting your standing in the belly stuffing community.<br/>\n<br/>\r\nIn the world menu, dive into the stats of various girls, tracking their current weight and fullness. Navigate through the map to visit the beach or the cafe, where you can meet several characters, feed them, and influence their attitudes toward you. Bonus areas, including an airplane, Sunday work surveillance, or a model vacation mini-game, add layers of depth and excitement to the experience.<br/>\n<br/>\r\nThis game is designed without a final goal, allowing players to savor the journey and witness the transformations of characters as they gain weight or appear stuffed. It's a novel experience created to provide enjoyment and fascination with every playthrough.<br/>\n<br/>\r\nWarning! Nudity!<br/>\n<br/>\r\nWarning! Read this before you buy!<br/>\n<br/>\r\nIf you follow me, you should know, that for now I create multiple short games with some sort of game mechanics in almost standard interface. It is literally a bunch of images, that appear in different circumstances and there is almost no weight gain. All my games are stuffing games. And for me the main value is that they are different. Different models, morphs, clothes, different style of interactions. Every game is an experiment. They are as they are. Some people, such as me like such things and diversity. So if you are not into it, i ask you to understand and to forgive))", "metacritic": null, "released": "2024-02-23", "tba": false, "updated": "2024-02-26T06:55:56", "background_image": "https://media.rawg.io/media/screenshots/ef2/ef23fb5605bab965a80e3c7208e1c277.jpg", "website": "https://www.yuliyakovach.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 433, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Yuliya Kovach"], "genres": ["Casual", "Indie"], "publishers": ["Yuliya Kovach"], "esrb_rating": "Adults Only"}