{"id": 977593, "slug": "greed-knights", "name": "Greed Knights", "name_original": "Greed Knights", "description": "There is no Story! Similar games are : Swag and Sorcery, Weapon Shop Fantasy, Pixel Shopkeeper, Soda Dungeon.<br/><br/>This game was heavily inspired by Weapon Shop Fantasy!<br/><br/>And I insist they are complete different games!<br/><br/><strong>Greed Knights</strong> is a game where your main focus is to grind for weapons and talent points so you can advance in the dungeons.<br/>this game works like most of my previous games. It contains automatic battles and your main focus is to train your champion and see him grow.<br/>like Knights and Dungeons, this game isnt endless gold max value is 1e999999999 and you will eventually reach it by your 3d day of playing.<br/><br/><h3>Questions?</h3><br/>Is there a cozy storyline? that keeps us hooked and immersed?<br/>: - No there is not!<br/><br/>Can I recruit new chararcters in this game?<br/>:- No you can`t!<br/><br/>Is this game an RPG or is this an Idle Game?<br/>:- This is a semi - Idle game.<br/><br/>Is there Loot in the game?<br/>:- No you will eventually have to buy all your equips!<br/><br/>Is this game endless?<br/>:- I have designed it and tried my best to make this game endless..... unfortunetly someone reched max gold value on his 3d day while playing.... so I am sorry guys =/ I have done my best.<br/><br/>How similar it is to Knights and Dungeons?<br/>:- In KAD you were forced to wait and let the game Idle while earning xp and gold and KAD wasnt endless.<br/>In this game tough you will need to send your char into missions over and over again. It can get repetitive so if you are not into these kind of games<br/>,  I recommend you stay away.<br/><br/><br/>PS: This game is recomended for those people whom likes to kinda \"Work-Play\".<br/>What does that mean?<br/>That means that most of the times this game will remember you of your job where you are actually doing repeatable tasks over and over again to obtain treasures. So that means IT can get really repetitive if you are not into games such as Disgaea etc.... Unlike in a real job tough you will always be promoted in GK.<br/><br/>PS: This game is very very very Grinding!<br/><br/>My thoughts on this: I have made this game because I have an audience of Idlers and Incrementals and they do indeed enjoy these kind of games.<br/>This game is intentionally working the way it works. It may frustrate some people. But I work for love. So I will be making the games I love.<br/><br/>Enough Talk!<h3>Features:</h3><br/><ul><li>Cozy small INN with info about your game.<br/></li><li>Cozy small Weapon Shop where you can upgrade your equipment.<br/></li><li>Cozy small Home where you can check your stats and also change your chair colors.<br/></li><li>Cozy small Mission House where you can select your missions.<br/></li><li>Cozy small Gym where you can sped you talent points.<br/></li><li>Cozy small Bank where you can earn riches!<br/></li><li>Cozy small Dimension Gate where you can advance between dimensions.<br/></li><li>Cozy small SkillShop where you can learn some skills.<br/></li><li>Around 6 Different equips knowing the last one upgrades itself.</li></ul><br/><strong>Thank you for choosing us! =D</strong>", "metacritic": null, "released": "2020-10-27", "tba": false, "updated": "2024-02-26T09:12:48", "background_image": "https://media.rawg.io/media/screenshots/052/0526be2686087e18e1d89bef9b14960a.jpg", "website": "https://www.kadragon.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 15, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kadragon"], "genres": ["RPG", "Casual"], "publishers": ["Kadragon"], "esrb_rating": null}