{"id": 977547, "slug": "aveliana", "name": "Aveliana", "name_original": "Aveliana", "description": "<strong>Aveliana is a solo-developed stealth-action game that takes you on a captivating journey through diverse landscapes filled with danger and intrigue. </strong><br/><br/>You'll step in the shoes of Aveliana after a tragic incident propels her on a perilous adventure! With a set of unique tricks and abilities at your disposal, you'll need to evade and defeat enemies with different detection and attack patterns. You'll be joined and guided by a mysterious fox, but who is she? Explore secret paths, uncover the truth, and prepare to face fierce bosses.<h3>STEALTH TACTIC?</h3> Use stealth mechanics to outsmart enemies: hide, use tricks, act fast to remain invisible!<h3>OR ACTION APPROACH?</h3> Draw your sword and magic powers. Choose to stand in front of your foes fearlessly!<h3>PICK YOUR OWN SET OF ABILITIES</h3>Boost your stealth or combat skills, giving you the power to tailor Aveliana's strengths to your preferred playstyle.<h3>A MYSTERIOUS FOX</h3>Aveliana's world is complex and intricate but you'll receive help and in particular from a lovely and mysterious fox.<h3>EXPLORE THE ENVIRONMENT</h3>Navigate in the handmade levels in 2.5D with some unique transitions into 2D areas. Discover hidden passages and secret rooms, enhancing the overall depth of the game.<br/><br/><h3>Inspirations</h3><strong>Aveliana is unique and clearly set it apart from any other fantasy adventure you've encountered</strong>, but it takes inspiration from acclaimed exploration and stealth games like Metal Gear Solid, Tomb Raider, Zelda, and Commandos. Yet its influences extend beyond these classics. Drawing from the enchanting hand-drawn landscapes of Studio Ghibli films and the vibrant, whimsical art style of Rayman Origins, Aveliana intricately weaves together these diverse elements into a rich and rewarding experience.<h3>IMMERSE YOURSELF IN THE CAPTIVATING WORLD OF AVELIANA</h3>A stealth action game meticulously crafted by a solo developer, where strategic gameplay, hidden secrets, and a visually striking atmosphere converge to offer an unforgettable gaming experience.", "metacritic": null, "released": "2024-02-23", "tba": false, "updated": "2024-02-26T07:36:01", "background_image": "https://media.rawg.io/media/screenshots/97d/97d4600db95aa955cd17ad1ab8a1cacc.jpg", "website": "http://aveliana.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["TheFrenchDev"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["TheFrenchDev"], "esrb_rating": null}