{"id": 977500, "slug": "elf-discipline-ceremony", "name": "Elf Discipline Ceremony", "name_original": "Elf Discipline Ceremony", "description": "<h3>◆Story </h3>A cult named \"Lord of lust Sect\" captures sacrifices worldwide to unlock the seal of the \"Lord of lust\", esteemed by them. <br/>One day, a man is kidnapped and imprisoned by this mysterious cult. Alongside him is a cute fairy girl, also captured like you. <br/>Players must follow the fairy girl through a seven-day sex ritual, <br/>providing essence to unlock the \"Lord of lust\" 's seal.<br/>In order to escape, you must do that.<br/><h3>◆Game play</h3>In this seven-day sex ritual with the fairy, <br/>choose the intimate activities indicated on the cards for the ritual. <br/>Advance the game's storyline through arranging cards and engaging in touch-based gameplay. <br/>Strengthen your abilities by accumulating action points (AP) and repeat the rituals until cult's goals are achieved.<br/><br/><h3>◆ Character</h3><br/><strong>Sophie</strong><br/>Race:Elf<br/>Occupation:Novice Adventurer Hailing from East Village,<br/>she yearned for the life of an adventurer and embarked on her journey.<br/>However, shortly after leaving her village, she fell into the trap of<br/>a secret cult and is now imprisoned with you at an unknown altar.<br/><br/><br/><strong>Lily</strong><br/>Race:Elf<br/>Occupation:Librarian<br/>Heailing frome the village of weist,<br/>Lily enjoys her life as the village librarian, buried in her books<br/>and rarely interacting with others.She has a quiet demeanor and has a habit of muttering to herself.<br/>On a fateful day out shopping, she was abducted when passing through an alleyway.<br/>Upon walking up, she found herself at the altar resting beside you. <br/><br/><br/><strong>Beatrice</strong><br/>Race:Elf<br/>Occupation:Florist<br/>Beatrice hails from South Village and leads a peaceful life as a florist.<br/>Her lovely appearance and gentle personality have attracted quite many suitors.<br/>However, she lacked interest in romance and chose to enjoy a single life.<br/>On an evening when she prepared to close shop,she was abducted by a group of <br/>strangers and woke up in an alter beside you.<h3>◆Game feature</h3>◇H events are entirely presented in live2D animation, sexuality off the chart.<br/>◇Unique in-game enhancement system.<br/>◇Choose from three available characters.<br/><br/>", "metacritic": null, "released": "2024-02-23", "tba": false, "updated": "2024-02-26T06:11:35", "background_image": "https://media.rawg.io/media/screenshots/38b/38b7d8bc7bb660d07fd1a2c1c71f8a74.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 425, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Flag shadow"], "genres": ["Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["072 Project"], "esrb_rating": null}