{"id": 977509, "slug": "sweet-bitter", "name": "Sweet Bitter", "name_original": "Sweet Bitter", "description": "\"Sweet Bitter\" is a visual novel for adults only. A young boy named Phoenix, fleeing a painful past, finds himself a neighbor of two mysterious women: seductive Charlotte and her turbulent daughter Kira.<br/><br/>Phoenix's life has taken its toll on him: before he knows it, he's left without his family, his favorite girl and his home. Forced to flee from his own memories, he finds himself in a small town, where he meets two women: the mysterious and seductive Charlotte and her daughter, temperamental and perky Kira. <br/>Fate has a sense of humor, though perverted: both ladies turn out to be his neighbors from the apartment across the street. Only he begins to think that he has a chance for a new life and a new relationship, as uninvited circumstances intervene: Charlotte's behavior is frankly frightening, and between him and Kira stands her aggressive childhood friend, who can not hesitate to use his fists. <br/>Phoenix has to deal with the situation, make a choice and understand: is his name alone enough for him to \"rise from the ashes\"?<br/><br/>Game Features:<br/><br/><strong>Emotional Journey: Deep emotions and complex character relationships fill the gripping story.<br/>Unique Characters: Each character has a unique personality, adding depth to the story.<br/>Atmospheric soundtrack: The sound background and music create a mood, immersing you in the atmosphere of the story.<br/>Unexpected twists and turns: The game promises exciting plot twists, keeping players interested.<br/>Deep emotional experience: \"Sweet Bitter\" reveals human feelings, creating an inspiring and heartfelt story.<br/>Unique Non-Linear Immersion: Shapes the story through key decision making. Three endings.</strong>", "metacritic": null, "released": "2024-02-23", "tba": false, "updated": "2024-02-26T06:27:36", "background_image": "https://media.rawg.io/media/screenshots/739/7393c01539d56b3bc5ff74f1d15f0776.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Cicada_Dancing"], "genres": ["Adventure", "Simulation"], "publishers": ["Cicada_Dancing"], "esrb_rating": null}