{"id": 977637, "slug": "direct-contact", "name": "DIRECT CONTACT", "name_original": "DIRECT CONTACT", "description": "Direct Contact embodies the essence of authentic warfare, delivering a first-person tactical realism experience that immerses players in the heart of modern combat. Most weapons adhere to real-world specifications within their respective classifications, creating a dynamic and asymmetrical battlefield.<br/><br/>In this team-based game, players engage as part of Special Forces units from across the globe. The enemy forces are cunning and coordinated, actively communicating and executing flanking maneuvers to eliminate their targets. The game's focus spans a wide spectrum of military tactics, encompassing intense close-quarters combat scenarios, meticulous consideration of room geometry and layout, diverse entry methods, and the strategic intricacies of mid to long-range engagements.<h3>Hey, Warriors and Warfighters!</h3> <br/>To learn how to play the game, please head to our YouTube, where we have How-To videos.<h3>Mission Intensity</h3>The Missions of Direct Contact range in intensity. The players have to use everything in their arsenal to succeed.<br/><ul><li>Weaponry<br/></li><li>Clothing<br/></li><li>Player Placement<br/></li><li>Tactics<br/></li><li>Breaching Charges<br/></li><li>Calculation and planning</li></ul><br/>Direct Contact brings real-life actions into the gaming world. When a shot strikes a surface like a wall or a floor, the bullet can realistically ricochet back, posing a genuine threat to you as a player. Every bullet in the game adheres to real-life principles of velocity and drop, adding a layer of authenticity and challenge that mirrors the dynamics of live ammunition.<h3>Air Support</h3><br/>In Direct Contact, our explosions are crafted with such precision that they approach photorealism. You'll have the thrilling opportunity to summon airstrikes from iconic aircraft like the Eurofighter, F18, A10 Warthog, and the Sukhoi Su-25. You can opt for laser-guided munitions or go for the added challenge of locating and calling in your airstrikes, all while enemies relentlessly hunt you down.<br/><br/>When these formidable aircraft launch a missile, the process is incredibly lifelike. The jet's missile bay ejector efficiently releases the missile from its wing missile bay, adding to the overall authenticity of the game's aerial combat experience.<h3>Breach the Door</h3>In Direct Contact, the game design reflects the reality of navigating hostile territory, where doors aren't always readily accessible. Before approaching or breaching a door, vigilance is key. Players must maintain situational awareness, carefully scanning their surroundings and using peeking tactics to move safely and engage enemies opportunistically.<br/><br/>Our doors are purposefully designed for functionality, allowing players to breach them as needed. You can peek through a partially opened door, swing it wide open for a bold entry, or even deliver a forceful kick to gain access, giving you dynamic options to engage your adversaries effectively.<br/><h3>Highly Detailed Battle Fields</h3>Defeat your enemies on highly rich, detailed battlefields stretching over a large area.<br/><h3>Interact With Your Enemy</h3>Direct Contact features a comprehensive system that assesses the behavior of enemy characters based on their in-game style. Players can engage with these enemies, applying pressure and encircling them strategically. This interaction triggers a fear system, which then influences the enemy's behavior. Their responses and actions will be shaped by the fear they experience, adding depth and realism to their in-game personalities and decision-making. Your tactics and approach will be crucial in determining how your enemies react and adapt during gameplay.<h3>Arrest the Enemy</h3><br/>When an enemy surrenders in Direct Contact, you can detain them. It's important to note that you can't approach random civilians and detain them without cause. Civilian characters are programmed to respond intelligently, providing evidence to demonstrate their innocence if wrongfully accused. This level of detail ensures that the gameplay experience remains authentic and avoids unjust actions against innocent non-combatants.<h3>Weapons</h3>An object's hardness plays a critical role in determining the behavior of bullets in Direct Contact. Bullets can ricochet off hard surfaces, penetrate softer ones, or even change trajectories when encountering different materials. This realism extends to your character's experience, affecting their weapon handling significantly. In the event of injury, your character's performance will be compromised, and recovery takes time. When you're hit, you won't be able to bounce back immediately; instead, you'll require assistance from a teammate to receive healing and get back into action. Teamwork and strategy are paramount in navigating the challenges of the battlefield.<br/><h3>Goal</h3>Our primary objective for the game is to deliver an immersive and intense tactical team-based gaming experience. From realistic sounds to meticulously crafted animations of our weapons, our goal is to achieve the highest accuracy possible. We pay painstaking attention to detail, including the intricacies of bullet physics, to ensure a true-to-life experience.<br/><br/>Moreover, we seek valuable insights from real veterans, drawing from their tactics and weapon-sound expertise. This commitment extends to every aspect of the game, from how weapons are handled to the visceral experience of firing them, all to offer players an authentic and engaging gameplay experience.<h3>QWERTY </h3>Direct Contact is currently optimized for QWERTY keyboards exclusively. Suppose you wish to rebind your keys or use a different keyboard layout. In that case, you may need to explore third-party software solutions for crucial rebinding or consider acquiring a QWERTY keyboard. Please note that Direct Contact does not currently offer support for keyboards other than QWERTY. While we continually work on enhancing the game, it's essential to clarify that this specific aspect may not change in the near future. Any updates in this regard will be officially announced. I appreciate your understanding.", "metacritic": null, "released": "2024-02-29", "tba": false, "updated": "2024-03-01T06:06:00", "background_image": "https://media.rawg.io/media/screenshots/4a4/4a4516d70ec3e85e5038e5cf0b5b9fdb.jpg", "website": "https://directcontact.no/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 533, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mountain 81"], "genres": ["Action", "Simulation"], "publishers": ["Mountain 81"], "esrb_rating": null}