{"id": 977691, "slug": "dark-elf-historia", "name": "Dark Elf Historia", "name_original": "Dark Elf Historia", "description": "A classic RPG about one dark elf girl's journey to save a boy! <br/><br/><ul><li>10+ hours of gameplay <br/></li><li>A JRPG from veteran doujin creators </li></ul><h3>SUMMARY</h3>Our story starts when peace has finally taken hold of the world after the war. The former mercenary and dark elf Fornelia, battle-worn and looking for a place to die, saves a young man named Ruse from a monster attack.<br/><br/>Follows Fornelia’s life together with Ruse.<h3>CHARACTERS</h3><br/>Fornelia (Voice: Ao Inukai)<br/>A dark elf former mercenary.<br/>During the World War, she was a mercenary-for-hire, doing nothing but fighting. <br/>When the war ended, she spent her days taking jobs from the town guilds and traveling the world. <br/>She saved a boy named Ruse by accident while working as a monster exterminator, and the two have now made the Oruc Kingdom their home.<br/><br/>Ruse (Voice: -)<br/>A young man who lives with Fornelia.<br/>A few years ago, he ended up being saved by Fornelia when he was attacked by a monster. <br/>At first he did not open up his heart to her at all, but with time, he eventually thawed towards her. <br/>He's short for his age due to undernourishment, and reads books at home all the time. <br/>His dream is to become a scholar one day.<br/><br/>* This game was made using RPG Maker VX Ace and includes the RPG Maker VX Ace RTP (Run-Time Package). No additional download is required to play.", "metacritic": null, "released": "2016-03-16", "tba": false, "updated": "2024-04-01T11:00:39", "background_image": "https://media.rawg.io/media/screenshots/b49/b4918388642fbfb3cde80a1d95c2f47d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ONEONE1"], "genres": ["Adventure", "RPG"], "publishers": ["Shiravune"], "esrb_rating": null}