{"id": 977686, "slug": "nightmare-labyrinth-2", "name": "Nightmare Labyrinth", "name_original": "Nightmare Labyrinth", "description": "Immerse yourself in Nightmare Labyrinth, a heart-pounding VR asymmetric thriller that pits VR and desktop players against each other in a battle of wits and strategy.<br/>\n<br/>\r\nFor VR Players:<br/>\r\nVenture into the depths of eerie mazes where you must rely on your instincts and cunning to survive. Use a radar to locate your escape route, but beware - it may reveal your presence to the relentless monster. Your flashlight can shroud you in darkness, rendering you invisible but blind. Use weapons to defend yourself, but be wary, not all your adversaries can die. However, make no mistake, you're most powerful weapons are your cunning and courage.<br/>\n<br/>\r\nFor Desktop Players:<br/>\r\nTake control of a fearsome monster with one goal: hunt down the VR player. Use your cunning and knowledge of the maze to track their every move. Time your attacks carefully to catch them off guard. You're most powerful weapon is fear, a panicked enemy makes sloppy, and sometimes fatal mistakes.<br/>\n<br/>\r\nEndless Thrills:<br/>\r\nWith plans for additional mazes and features in the future, Nightmare Labyrinth promises a constantly evolving, heart-pounding experience for both VR and desktop players.<br/>\n<br/>\n<br/>\n<br/>\r\nDeveloper's note:<br/>\r\nI'm a one man dev, so any and all feedback is greatly appreciated! Please, if you have any suggestions, reach out on the community hub or my email: lastmagstudioshelp@gmail.com", "metacritic": null, "released": "2024-02-26", "tba": false, "updated": "2024-03-01T07:58:22", "background_image": "https://media.rawg.io/media/screenshots/8e7/8e7d1404fed86742d6621537ddd66c33.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Last-Mag Studios"], "genres": ["Action"], "publishers": ["Last-Mag Studios"], "esrb_rating": null}