{"id": 977675, "slug": "cursed-crew", "name": "Cursed Crew", "name_original": "Cursed Crew", "description": "<strong>Cursed Crew is a crew management roguelite where you’re a captain sailing the untamed seas!</strong> You’re responsible for giving orders, managing the ship’s resources, keeping your crew happy, fighting pirates and beasts, and taking charge when all hell breaks loose. But you and your crew are cursed, destined to sail endlessly, unless you can find a way to break free!<h3>The Cursed Crew</h3><br/>A ship needs both a captain and a crew. As the captain, you command your crew and stock the ship with supplies and food to keep everyone happy and healthy. You also plunder and spend treasure, plot your ship’s course, and pick story events that lead to battles, treasure, or secrets. <br/><br/>Your crew takes care of the ship with or without orders: they steer, build, repair, go fishing, and prepare meals. In battle, they put out fires, haul supplies, load and man cannons, and defend your ship from beasts and enemy sailors. Your crew is an asset—so long as their morale is high. Positive events like well-fought victories, a good night’s rest, and delicious food and grog boost your crew’s morale, whereas unpleasant situations like lost battles, shipmate deaths, sleep deprivation, and starvation hurt it. A resentful crew member is a problem: they might ignore your orders, throw destructive tantrums, lose all motivation to work, or even start a mutiny against you!<h3>Bombarding Action</h3><br/>These waters are infested with danger, so do whatever it takes to defend your ship! Order your crew to construct and man the cannons and fire at anything that moves. Batter your enemies with grapeshot and hull-breaching artillery, and use harpoon guns to reel in and board enemy vessels for a proper swashbuckling battle. Clear out those scallywags by arming your crew with daggers, cutlasses, flintlock pistols, muskets, and bombs.<br/><br/>Prepare for many deadly encounters on your journey. The high seas are filled with murderous pirates, skeleton crews, ghosts, rat men, packs of killer sharks, violent winds and storms, ravenous megalodons and more!<h3>The Ship</h3><br/>Set sail in a vessel that tells the world what kind of captain you really are. There are variants of each ship and they all come with their own starter loadout. <br/><br/><ul><li><strong>Caravels:</strong> Swift and well balanced, these ships are excellent at catching and boarding weaker vessels.<br/></li><li><strong>Carracks</strong>: Big and made for war, they’re slower than most ships, and they often come with more cannons than men. <br/></li><li><strong>Cogs: </strong>Sturdy and resilient with a fortified castle, they’re capable of taking a hit and returning the favor with their devastating mortars. <br/></li><li><strong>Raiders:</strong> Originally built as trading vessels, these medium-sized ships are designed for speed and maneuverability. </li></ul><br/>Arrange and decorate your ship’s deck and floors just how you like them. A well-designed ship has strategically placed cannons, protected hammocks for sleeping, and stores of food and goods. Don’t forget structures for crafting like a woodworking bench, tailoring bench, smithy, cartography table, and kitchen.<h3>All Hands On Deck!</h3><br/>Make a memorable team of buccaneers by customizing your captain and crew! Experiment with fashionable hairstyles, mustaches, expressions, tattoos, hats, attire, and more. Create a flag to match and strike terror into the hearts of the unfortunate sailors who cross you!<br/><br/>", "metacritic": null, "released": "2024-02-26", "tba": false, "updated": "2024-03-01T07:38:51", "background_image": "https://media.rawg.io/media/screenshots/394/394e6512584f6e37e0451d26e433e909.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 386, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cracklewock Games"], "genres": ["Adventure", "Strategy", "Simulation", "Indie"], "publishers": ["Cracklewock Games"], "esrb_rating": null}