{"id": 977689, "slug": "macho-scooping", "name": "Macho Scooping", "name_original": "Macho Scooping", "description": "<strong>At the festival, what's the most exciting activity? <br/>Is it the yakisoba, shooting games, or cotton candy? <br/>Well, of course, it's \"Macho Scooping\"!</strong><br/><br/>At the Macho Scooping stall, you'll find adorable pocket-sized macho figures energetically swimming around. Loved by people of all ages, from little girls to grandpas, these petite Machomen maintain their small size even as they grow. Feel free to scoop up your favorite macho pals and take them home!<h3>4-Player Macho Scooping</h3><br/>A festival featuring macho figures from around the world is now underway! Players have to scoop up as many macho figures as possible within the time limit.<h3>Score Attack Ranking</h3>Players who achieve high scores in Macho Scooping will have their names engraved in the ranking. Stand tall on that podium, be worshipped, and aim to become the ultimate Macho Scooping master while competing with friends.<h3>Multiplayer Madness</h3><br/>Supports 2 to 4 player multiplayer for an even more exciting experience. Polish your skills together, sharpen your minds, and compete to become the ultimate Macho Scooping champion!<h3>Macho Ecology &amp; Encyclopedia</h3><br/>Once captured, each macho figure is recorded in a detailed encyclopedia showcasing their ecology. Get to know their personalities and characteristics thoroughly, and complete your Macho Collection!", "metacritic": null, "released": "2024-02-26", "tba": false, "updated": "2024-03-01T08:03:07", "background_image": "https://media.rawg.io/media/screenshots/4c5/4c584c562bc38c39df3883cf9f481f84.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NEOLAVI"], "genres": ["Action", "Sports", "Casual", "Indie"], "publishers": ["indiegamesjapan"], "esrb_rating": null}