{"id": 977634, "slug": "champion-shift", "name": "Champion Shift", "name_original": "Champion Shift", "description": "Fight. Shift. Survive. <strong>Champion Shift</strong> is a unique action roguelike where our Champions fight endless hordes of enemies and traverse branching stages with the ultimate goal of defeating the Dominion and those who control it.  In every run you will uncover endless combinations of abilities and skills, recapturing your mythical powers and earning your status as Champion.<br/><br/><br/>Challenge yourself to a solo run, or join your friends in online co-op play!  Up to 4 players can band together, leveraging each other’s strength and powers to go on a massively powered run.<br/><h3>Features:</h3><ul><li>Unlock globally iconic legendary characters, such as Sun Wukong, Athena, Gilgamesh and many more! <strong>Dozens of characters</strong> await you.<br/></li><li><strong>Simple controls</strong> with default auto attacks and the option to manually aim.<br/></li><li><strong>Survive</strong> challenging and rewarding enemy encounters that test your playstyle and strategy.<br/></li><li>Shift forms between <strong>Vehicle and Hero</strong>, each with their own playstyles, strengths and weaknesses.<br/></li><li><strong>Hundreds of abilities</strong> and upgrades allow you to construct your perfect run.<br/></li><li>Complete missions in branching-path stages and clear the way to the Dominion’s central HQ, where you can fight the enigmatic <strong>final boss or continue indefinitely</strong> with ever increasing difficulty.<br/></li><li>Play solo or co-op with <strong>up to 4 players</strong>.<br/></li><li>Tweak the difficulty settings to match what’s right for you.</li></ul><br/><br/><br/>The Dominion, a shadow corporation with their sights set on world domination, have summoned and captured legendary champions from across time.  Having narrowly escaped their captivity, our Heroes scatter through the streets, fighting back to save our realm from certain doom.<br/><br/><br/><br/><br/><br/>Experiment with different skills and abilities, which combined with the strengths of each Champion, create a unique playthrough on each run.  Complete missions and defeat Dominion bosses to earn Tech Caches and Heroic Gifts that power-up your hero to insane levels!<br/><br/><br/><br/><br/><br/>While escaping from captivity, our heroes got their hands on some sweet Dominion tech, which combined with their weapon relics, gives them the ability to transform into powerful vehicles and weapons.  This VERY unique take on the genre opens up countless strategies for you and your friends to try out.<br/><br/>", "metacritic": null, "released": "2024-02-29", "tba": false, "updated": "2024-03-01T05:59:38", "background_image": "https://media.rawg.io/media/screenshots/e83/e83044c06838596c8ec47d56b23ec79a.jpg", "website": "https://championshiftgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SRG Studios"], "genres": ["Action"], "publishers": ["SRG Studios"], "esrb_rating": null}