{"id": 977660, "slug": "nightclub-simulator", "name": "NightClub Simulator", "name_original": "NightClub Simulator", "description": "Night Club Simulator is a highly immersive VR game with a great degree of freedom. It uses a fully physics-based animation system to simulate NPC behaviors and reactions, allowing you to interact with them as if you were in the real world. NPCs have realistic AI, displaying emotions such as happiness, anger, fear, or affection. Their emotions will change depending on your actions. You can provoke and fight with anyone, dance and kiss with girls, but be careful when approaching a girl as her boyfriend might be around. Experience a lifelike and interactive night club adventure with Night Club Simulator.<br/>\n<br/>\r\nthere are several ways you can interact with NPCs:<br/>\r\n1, wave your hand; (increase 5-10 relationship points)<br/>\r\n2, clap hands when a npc is dancing, the palm relative and clap; (increase 10-15 relationship points)<br/>\r\n3, shake hand, reach out one hand to a npc; (increase 10-20 relationship points)<br/>\r\n4, dancing, the palm up, reach out one hand to a npc; (opposite sex only, Requires relationship points of 40 or more)<br/>\r\n5, hug and kiss, open arms, reach out double hands to a npc. (opposite sex only, Requires relationship points of 60 or more)<br/>\r\n6, drinking, close to a sitting NPC, wave your hand first, then hold a cup and raise hand on air.<br/>\r\n7, throw money to a npc, you will get relationship with him.", "metacritic": null, "released": "2024-02-26", "tba": false, "updated": "2024-03-01T06:51:47", "background_image": "https://media.rawg.io/media/screenshots/e2d/e2d64c36d5e1bc1e8ba469ad525ae78c.jpg", "website": "https://mandegames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["mandegames"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["mandegames"], "esrb_rating": null}