{"id": 977717, "slug": "spiderbro-2", "name": "Spiderbro 2", "name_original": "Spiderbro 2", "description": "Spiderbro 2 is a retro inspired adventure puzzle game for Windows and Linux. You play as Shadowbro, a spider that has to save the multiverse from the antics of a real life computer worm!<br/><br/><strong>EXPLORE, COLLECT ITEMS, SOLVE PUZZLES!</strong><br/>Make your way deeper into the company building by exploring the environment and collecting items for your pockets! Use your pocket items on world objects, give them to NPCs or merge them with one another to solve puzzles!<br/><br/><strong>THE IN-GAME PCs ARE BACK WITH AN UPGRADE!</strong><br/>Use the in-game PCs and check for further clues! Text logs with clues and backstory can be found on PCs found throughout the game! Take a trip to PC-SPACE, a company exclusive VR service that takes using a PC to new depths!<br/><br/><strong>A WORM IS LOOSE! THE MULTIVERSE IS COLLIDING!</strong><br/>A computer worm gone wild has broken into the real world! More cracks and holes to new universes have appeared! In Spiderbro 2 you should expect the unexpected as you overcome the worm whilst travelling between different universes!<br/><br/><strong>DISCOVER COMPANY SECRETS!</strong><br/>Go deeper into the company building and find out what triggered the events of Spiderbro! Each new department will unravel more secrets!<br/><br/><strong>NO NEED TO PLAY THE PREQUEL!</strong><br/>Players need not play the first Spiderbro! Spiderbro 2 expands upon the first game in a way that does not require the player to complete it! Spiderbro 2 also contains a copy of the first game, within the game!<br/><br/><strong>YOU WILL DIE!</strong><br/>Be warned that this world is not safe! Make frequent use of savepoints to prevent losing progress!<br/><br/><strong>EVEN MORE!</strong><br/><ul><li>Cloud saves<br/></li><li>34 In-game awards<br/></li><li>New game plus mode<br/></li><li>Two possible conclusions<br/></li><li>Built in Cheat Sheet with all puzzle solutions</li></ul><br/><strong>CONTROLS</strong><br/><ul><li>Arrow Keys / WASD - Movement<br/></li><li>SPACE / ENTER - Interact<br/></li><li>P / E - Open Pockets<br/></li><li>ESC - Back / Pause</li></ul>", "metacritic": null, "released": "2024-02-27", "tba": false, "updated": "2024-03-01T08:57:38", "background_image": "https://media.rawg.io/media/screenshots/38c/38c640cacb96c7d326028009dcb002f3.jpg", "website": "https://studiopond.co.uk/spiderbro-2", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Studio Pond"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Studio Pond"], "esrb_rating": null}