{"id": 977713, "slug": "drop-the-dice", "name": "Drop the Dice", "name_original": "Drop the Dice", "description": "<strong>Drop the Dice</strong> is a puzzle game in which you can place your dice anywhere on the board, but you won't score many points. You can also place them by trying to anticipate things and thinking a little in order to score a lot of points!<br/><br/><br/><br/>If you're good, a game should last around fifteen minutes, otherwise it will be much shorter. The advantage is that you can launch several games in 15 minutes.<h3>suitable Times to Play the Game:</h3><ul><li>Margot has given you an appointment at 8:00 p.m. to start a game on another game, but she's late, as usual.<br/></li><li>You are playing a Battle Royale that no one plays anymore, and searching for a game takes time.<br/></li><li>You got 15 minutes of public transport to go to buy sandwich at the supermarket or you take the train to go to your uncle's house.<br/></li><li>You ate too much cheese at the last Raclette, and you need to spend some time in the bathroom without getting bored.</li></ul><br/><br/><br/><strong>Emma, Isaac, Lucette, Fernand, Valoche</strong> and many others will be there to help you go as far as possible in your game and unlock new bonuses! Customize your bonus dice by choosing from the many bonuses available. Adapt it according to your style of playing, be careful, they are not unlimited...<br/><br/><h3>who Did This?!</h3>Drop the Dice is a first solo Gamedev experience which, basically, was only going to be a sandbox to test different things. The desktop &amp; mobile development, art direction, illustrations, sound effects, communication and publication were carried out by me.<br/><br/>♫ The music was happily produced by Alba (bonjourAlba on social media)<h3>i Hope You Like the Game!</h3>", "metacritic": null, "released": "2024-02-27", "tba": false, "updated": "2024-03-01T08:50:13", "background_image": "https://media.rawg.io/media/screenshots/dab/dab574c2c46d235b3b670c67b92cb21f.jpg", "website": "https://dropthedice.fr", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cokorico"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Cokorico"], "esrb_rating": null}