{"id": 977724, "slug": "the-deluca-family-season-1", "name": "The DeLuca Family - Season 1", "name_original": "The DeLuca Family - Season 1", "description": "Embark on an immersive journey into the seductive and perilous world of The DeLuca Family, a story-focused adult game that thrusts you into the role of an ordinary guy whose tranquil life takes a dark turn when a letter binds you to a mafia contract with the notorious DeLuca family.<br/><br/><br/><br/>Navigate through a web of secrecy as you unravel the mysteries surrounding your parents' past actions and the compelling reasons behind your forced inclusion in this infamous Family. Ascend in the ranks of the mafia world, potentially forming your own crew. Along the way, gain the trust, love, and intimate companionship of the DeLuca Family daughters, and if you dare, the wife of the underboss.<br/><br/><br/><br/>In this captivating adult game, every decision shapes your destiny within the criminal empire. Will you succumb to the allure of power, sexual desires, and the complexities of mafia life? Uncover the consequences of your choices in a world where trust is a weapon, love is a gamble, and secrets can be as deadly as a gunshot.<br/><br/><br/><strong>Key Features:</strong><br/><ul><li>    Engaging storyline filled with twists, turns, and moral choices.<br/></li><li>    Intricate character development with captivating personalities.<br/></li><li>    Stunning visuals and animations created with Daz3D, bringing characters to life.<br/></li><li>    Text-based gameplay mechanics crafted with Ren'Py.<br/></li><li>    Click-and-point free-roaming. </li></ul><br/><br/><br/>Don't be constrained by a playstyle you typically dislike! At the beginning of the game, you are presented with three modes you can choose from.<br/><br/><strong>1, Full Experience:</strong><br/>Dive into an immersive adventure with everything included. Enjoy click-and-point freeroaming and text-based RPG exploration.<br/><strong>2. Story+Freeroaming:</strong><br/>Experience the main and side stories without the of need of any kind of deep gameplay, but still able to freeroam the house and visit the girls. Perfect for those who want a laid-back approach while still enjoying the essence of the game. <br/><strong>3. VN-Mode:</strong><br/>Sometimes, you just want to relax with one hand ready for another relaxation! VN-Mode offers a simplified experience. Sit back and enjoy the visual novel style, focusing on the narrative with ease. All the main and side stories are presented one by one.<br/><br/>All three modes provide the full story and events. Choose the mode that suits you best and immerse yourself in the captivating world of \"The DeLuca Family\"!<br/><br/><br/><br/>Season 1 of The DeLuca Family includes episode 1-5 with many hours of gameplay! <br/>Future seasons will be released as DLC and sold separately.<br/><br/>So what do you say? Do you dare to join the ranks of The DeLuca Family?", "metacritic": null, "released": "2024-02-27", "tba": false, "updated": "2024-03-01T09:30:51", "background_image": "https://media.rawg.io/media/screenshots/d66/d6685e14cc301469070ddb228168aa50.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 433, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["MemoGaming"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["MemoGaming"], "esrb_rating": null}