{"id": 977730, "slug": "tempest-tower-of-probatio", "name": "TEMPEST: Tower of Probatio", "name_original": "TEMPEST: Tower of Probatio", "description": "🌩️ Tempest: Tower of Probatio 🌩️<br/>\n<br/>\r\nDive into 'Tempest: Tower of Probatio', a groundbreaking CCG that revolutionizes strategic card battle with its unique ban-pick phase.<br/>\r\nWe designed for fast-paced and engaging gameplay where every move counts, it's perfect for players of all skill levels.<br/>\r\nIt now offers an enhanced experience with real-time battles against players worldwide.<br/>\r\nReady for a new level of strategy? Download TODAY and start your strategic journey in the innovative realm of Tempest!<br/>\n<br/>\r\n🃏 Unique Deck-Building Fun: Choose from over 300 distinct heroes to create a deck that reflects your strategy and taste.<br/>\r\nEach hero comes with unique abilities, ready to support your path to victory!<br/>\n<br/>\r\n🚫 Strategic Ban Phase: Outsmart your opponents! Use the ban phase to block their top strategies and gain a tactical edge.<br/>\n<br/>\r\n🌟 The Power of the Pick: Your picks can lead you to victory. Forge your own path with special strategies in every game!<br/>\n<br/>\r\n🤝 The Tempest Promise: We value your commitment. Even after season resets, you can return and play effortlessly, keeping your progress intact.<br/>\n<br/>\r\n🏰 Turn the Tide with Tower Power: Empower your towers with unique hero skills. One powerful move can change the course of the battle!<br/>\n<br/>\r\n💪 Friendly Battles: Challenge your friends to see who's the ultimate strategist. Play now and prove your skills!<br/>\n<br/>\n<br/>\r\n🌐 Visit our official website and communities to find out the latest news<br/>\r\nCard Data Base: https://www.tempest-top.com/carddata_list.html<br/>\r\nDiscord: https://discord.gg/UEGTZQnDvX<br/>\r\nFacebook: https://www.facebook.com/tempestcardgame", "metacritic": null, "released": "2024-02-27", "tba": false, "updated": "2024-03-01T09:43:00", "background_image": "https://media.rawg.io/media/screenshots/fc1/fc1fa00fa7a2c39089052ff0fabb2865.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["New Normal Soft"], "genres": ["Strategy", "Casual"], "publishers": ["New Normal Soft"], "esrb_rating": null}