{"id": 977727, "slug": "envious", "name": "Envious", "name_original": "Envious", "description": "<strong>Note:</strong> Envious is a single player and a co-op only game. Both players need to own a copy of the game in case you wanted to play the co-op mode, as well as a way to communicate with each other. Play together with a friend or find a partner on our official Discord!<br/><br/><strong>Experience</strong> the horror puzzle game, Envious, offering both single player and co-op modes. Choose to be Xavier or Xandra where the first is trapped in a house, trying to escape it, while Xandra explores a separate old house to uncover clues facilitating Xavier's escape. Observe and communicate what you see around you. Solve the puzzles and relate the past with the present to save Xavier.<br/><br/><br/>Explore the house in which you find yourself trapped in, begin on an individual exploration. As you move through dimly lit corridors and shadowy rooms, your objective is to observe and search for clues that will unlock the secrets hidden within. Each puzzle presents a challenge, and you must rely on your wits and determination to solve the mysteries that stand between you and freedom. There is an undeniable sense of urgency as you unravel the enigmas one by one, piecing together the narrative of your entrapment. This individual quest demands resilience as you confront the unknown, relying on your skills to escape the clutches of the house that holds you captive.<br/><br/><br/>You must choose to be Xavier or Xandra, where the first was kidnapped by a strange old man and got trapped in a mysterious house, strives relentlessly for liberation. On the flip side, Xandra takes on the challenge of delving into the depths of old man childhood house, uncovering cryptic clues essential for Xavier's freedom. Communication and observation become paramount as you navigate the distinct challenges faced by each character. Solve the puzzles and establish connections between the past and present. The intertwining narratives demand strategic thinking and collaboration between the characters to unearth the secrets that can lead to Xavier's escape.<br/>", "metacritic": null, "released": "2024-02-27", "tba": false, "updated": "2024-03-01T09:36:00", "background_image": "https://media.rawg.io/media/screenshots/610/61005b4c919854117dc2694a415e0a9f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 270, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["qwerTeam"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["qwerTeam"], "esrb_rating": null}