{"id": 977718, "slug": "romance-in-the-cityscape", "name": "Romance in the Cityscape", "name_original": "Romance in the Cityscape", "description": "<strong>Romance in the Cityscape</strong> is a dating simulator with character development and various mini-games. The game has several unique locations where you can do what you like. Earn money, buy clothes and jewelry, and choose your own unique style to please each of the Vine City girls.<h3>Opportunities</h3><br/><ul><li> Locations with mini-games<br/></li><li> Stores of things and gifts<br/></li><li> Inventory<br/></li><li> Dialogues<br/></li><li> Leveling up<br/></li><li> Sex scenes</li></ul><h3>Characters</h3><br/><ul><li> <strong>Sara</strong> is a slender girl with a graceful figure. She has a quiet and prudent character. Sara is a connoisseur of good food and often goes to restaurants and cafes to enjoy a variety of culinary pleasures.<br/></li><li> <strong>Lexi</strong> - brave and independent. She looks and acts confidently and is not afraid to stand out from the crowd. Lexi is used to being on her own and making decisions. In everyday life he is interested in music and can make rude jokes.<br/></li><li> <strong>Kat</strong> - sociable, energetic and always on the move. She loves to dance and attracts attention with her liveliness (a little strange, with cockroaches in her head).<br/></li><li> <strong>Emily</strong> usually does not like to attract attention and prefers the peace and solitude of the library. She can be a little shy, but is always friendly.</li></ul><h3>Locations</h3><br/><ul><li> <strong>Snack bar</strong>. Here you can try yourself in the service sector. Cook burgers for guests of the establishment and earn money to buy fashionable things or gifts for girls! Here you can chat with Sara.<br/></li><li> <strong>Bar</strong>. In this location you can play the perfect game for a perfectionist! In it you need to sort bottles of alcoholic drinks into the appropriate boxes by switching the direction of the conveyor belts. Here you can chat with Lexi and Kat.<br/></li><li> <strong>Library</strong>. Quiet and peaceful place. This is where you can help Emily. Click on the cards and find two identical books to clear up the mess in the library. At first glance it may seem that everything is simple, but with each new level there are more and more books!</li></ul><h3>BONUS CONTENT</h3><br/>", "metacritic": null, "released": "2024-02-27", "tba": false, "updated": "2024-03-01T09:00:00", "background_image": "https://media.rawg.io/media/screenshots/8d0/8d0aa28de88400b0b3638b16ba250046.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 348, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Romance Games"], "genres": ["RPG", "Simulation", "Casual", "Indie"], "publishers": ["Romance Games"], "esrb_rating": null}