{"id": 977742, "slug": "ukraine-war-2022", "name": "Ukraine War 2022", "name_original": "Ukraine War 2022", "description": "Ukraine War 2022 is a real-time, tactical land and air warfare simulation game focusing on the ongoing war between Ukraine and Russia. It features 20 scenarios covering not only the land and air battles that actually happened in the year 2022 and 2023, but also several theoretical battles that might take place in the next two years, in case Russia takes decision to escalate the war to a new level.. You are posted as overall commander of the battles on either Ukraine or Russian side, as you may choose in most battles, and tasked with various missions, such as defending the Ukraine capital city of Kyiv, searching and destroying Russian Black Sea Fleet, and launching the 2023 Spring Offensive.<h3>Features:</h3><br/><ul><li>You'll be able to command massive number of land units to mount attacks on enemy defense line, or the other way around, to defeat enemy  offensives.<br/><br/></li><li>You'll be able to manage the airports and heliports, if available in the battle, and organize reconnaissance, combat air patrol and air strikes against enemy ships and land targets.<br/><br/></li><li>You'll be able to carry out airborne missions to support your land force with transport aircraft or helicopters.<br/><br/></li><li>Each battle map, covering an area of up to 2000km x 2000km, is built on satellite verified terrain data (mountains, hills, plain, river etc), land cover data (forest, grassland, desert etc.).<h3>Current Scenarios:</h3><br/>1. The Kyiv Offensive<br/>2. The Sumy Offensive<br/>3. The Kherson Offensive<br/>4. Southern Donetsk<br/>5. (Theoretical) Kharkiv Encirclement<br/>6. Black Sea<br/>7. Air War<br/>8. The Hunt for Himars<br/>9. The Popasna Breakthrough<br/>10. The Fall of Bakhmut<br/>11. The Kherson Counteroffensive<br/>12. The Kharkiv Counteroffensive<br/>13. Ukraine Spring Counteroffensive (Zaporizhzhia)<br/>14. Ukraine Spring Counteroffensive (Bakhmut)<br/>15. 2023 Russian Offensive (Kharkiv)<br/>16. 2023 Russian Offensive (Avdiivka)<br/>17. (Theoretical) Towards the Dnipro<br/>18.  (Theoretical) Dnipro Encirclement<br/>19. (Theoretical) Western Air Support over the Dnipro<br/>20, (Theoretical) The Polish Intervention</li></ul>", "metacritic": null, "released": "2024-02-28", "tba": false, "updated": "2024-03-01T10:07:24", "background_image": "https://media.rawg.io/media/screenshots/4c7/4c72c5539aa5cfadc3cf66340b55e5d4.jpg", "website": "http://www.sandtablesoftware.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sand Table Software"], "genres": ["Strategy", "Simulation"], "publishers": ["Sand Table Software"], "esrb_rating": null}