{"id": 977741, "slug": "beyond-the-fringe", "name": "Beyond the Fringe", "name_original": "Beyond the Fringe", "description": ".<br/>Fight<br/>Primarily a third-person shooter, you can also attack enemies using a variety of tactics, including stealth kills and melee combat. Whether you're battling MilCorp soldiers or sand worms, you will always be prepared to defeat your enemy with over ten different weapon types at your disposal. *All combat can also be played using an Xbox controller*<br/><br/>.<br/><br/>Loot<br/>Make the most of your adventure by collecting weapons from fallen enemies and selling them to Nomad Traders for credits. Alternatively, you may choose to save them in your inventory to upgrade at one of the five crafting tables located on each PZ. Loot boxes are also plentiful and can be found in unexpected places, so be on the lookout everywhere you go.<br/><br/>Move<br/>Traverse the PZs with ease once you unlock your flight suit! Craft or purchase flight components and stamina boosts to enhance your flying experience.<br/><br/>.<br/><br/>Explore<br/>Discover hidden locations as you voyage through numerous handcrafted worlds, each with an entirely different vibe and atmosphere. Enjoy the diversity of each biome as you brave the sandstorms of Sarhana1, marvel at the vibrant colors of Avathem, and soar through the canyons of the Grasslands.<br/><br/>Mine<br/>Explore the PZs to find caves that contain bandits to fight and rocks to mine. Mine these rocks to retrieve valuable crystals that can be sold or used to craft high-tech gadgets.<br/><br/>.<br/><br/>Join<br/>Pledge your allegiance to any of the four available factions to complete exciting side missions and receive powerful rewards that pack a punch.<br/><br/>Solve<br/>Test your hand-eye coordination, memory, and patience as you complete a variety of puzzles to unlock doors or hack computer systems.<br/><br/>.<br/><br/>Level Up<br/>From chatting with NPCs to obliterating enemies, you will gain experience as you interact with the world. Unlock benefits such as discount stores and vision abilities as you increase your stats.<h3>IMPORTANT NOTE FROM THE DEVS:</h3> We are a husband-and-wife team with no prior experience in coding or video game development! We began working in UE5 in February 2023, and we have been relying on trial-and-error as well as Epic Marketplace assets and YouTube tutorials to create our first game ever. We are extremely passionate about this project, and we worked hard to make it our own, but we are also aware that it isn't perfect. We are telling you this in the hopes that you will limit your expectations and have a far more enjoyable experience than you would have if we pretended to be something we are not.<h3>Extra Lore:</h3> In the beginning, all of humankind started on one planet in the Inner Rim. They began exploring and building relationships with indigenous peoples on distant planets. This area of explored space became known as the Outer Rim, separated from unknown space by a border called the fringe. When their home started dying, the Galactic Council decided it would be best for humanity to split up. They started scouting planets they had previously discovered, testing to see which ones could be terraformed to become habitable. Once a planet was deemed viable, they began negotiating with native leaders to see who would take them in. This was a slow process, as some native groups were much less willing to house newcomers than others. The indigenous peoples that agreed to the treaty did so with the condition that humans would only terraform a small part of their planet so as not to disrupt the overall environment too much. Gradually, the Council was able to start sending groups of people to settle in these newly terraformed areas, known as Population Zones. At one point, humans successfully occupied over twenty different PZs, each with their own ecosystem and societal structure.<br/><br/>There was an extended period of peace as humankind learned to live amongst natives in these blended communities, utilizing portals as gateways to travel between worlds. But eventually, the humans began arguing about how to govern themselves. Humanity was divided, and a faction known as MilCorp splintered off. They declared war against the Galactic Frontier Republic and began recruiting natives to fight for their cause. The PZs erupted into violence and chaos as the regions that were once thriving became completely destabilized.<br/><br/>After a few years, the GFR was finally able to push MilCorp back into the shadows. Tensions are still high within the PZs, but the humans have begun to rebuild and continue the relocation of citizens and resources from their dying world.<br/><br/>This is where you come in.<br/><br/>Experience our universe through the eyes of Elijah Shaw, the son of a military colonel and a renowned scientist, as you journey through the Population Zones in search of the truth. Along the way, you will face numerous enemy types with varying levels of combat and encounter a slew of different puzzles to solve. Become part of our galaxy and uncover a threat far greater than MilCorp lurking just beyond the fringe.", "metacritic": null, "released": "2024-02-28", "tba": false, "updated": "2024-03-01T10:05:29", "background_image": "https://media.rawg.io/media/screenshots/dc9/dc9f3279b35ae0ccce15ceabb8afae5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 298, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KandH"], "genres": ["Action", "Adventure"], "publishers": ["KandH"], "esrb_rating": null}