{"id": 977825, "slug": "infinite-dissonance", "name": "Infinite Dissonance", "name_original": "Infinite Dissonance", "description": "Enter the dissonance, where the world is falling to the threat of a grave enemy. Explore the mysteries of the world in a combination of turn-based strategy and third person shooter combat, through the eyes of your favourite animals. With different classes and abilities, obliterate your enemies and fight for your world's survival! <br/><br/><strong>Turn Based Gameplay</strong><br/>Find your way through various dungeons, and take the fight to the enemy! Are you an aggressive player? Or do you prefer to duke it out over time? Manage your resources according to your playstyle and adapt to the fight at hand! Make the choice to use your charge to blast your enemy, or perhaps save your charge counterattack your enemies. Your choices today will be marked in the course of history. <br/><br/><strong>Multiplayer Co-op</strong><br/>You've got friends? Well we've got space in the group! Form a party of up to 4 players and obliterate your enemies in new and interesting ways! <br/><br/><strong>Temporary Bonuses</strong><br/>As you progress through a dungeon, you will find yourself stronger than before. The unique properties of Spectral Crystals found in dungeons provides players with rare and unusual buffs. Purchase bonuses, heals and more! <br/><br/><strong>Classes</strong><br/>Each class is designed to bring an interesting twist to the dungeon. After choosing a class, you can choose between specializations to further refine your role in the team! Each character has their own unique kits, and you find out more below!<br/><br/><strong>Knowledge</strong><br/>They said Knowledge is Power, and that's just the truth! Knowledge can be gained by fighting enemies, as well as exploring the dungeons. With knowledge, you can permanently learn new abilities, based on your class, to better tackle your opponents in your next run. <br/><br/><strong>The Gunslinger</strong><br/>Never found without a gun with him, this righteous individual has earned his reputation as the protector of the animals. With the arena in his sights, this deadly rabbit specializes in single target, high damage bursts, mercilessly killing priority targets. Afterall, a dead enemy can't fight back! Further improve your one shot potential with hard-hitting abilities when you specialize as the Sniper, or spread your damage out over an area and inflict fear on your enemies when you specialize as an Operator.", "metacritic": null, "released": "2024-02-29", "tba": false, "updated": "2024-03-01T13:10:55", "background_image": "https://media.rawg.io/media/screenshots/6e5/6e5348e2c4a865921f916345d1565853.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["InfernoDragon0"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["InfernoDragon0"], "esrb_rating": null}