{"id": 977856, "slug": "the-collar", "name": "The Collar", "name_original": "The Collar", "description": "<h3>The Collar welcomes you.</h3>Each of you have been hand picked from your normal life to participate in the experiment. You should be very honored The Collar has chosen you.<br/><br/>You have all been fitted with an identical collar. Each collar has a timer. Each of you have random times set on your timer. Once the trial begins, each collar will start to countdown to zero.<br/><br/>The collar lights glow indicating how much time you have left. The collar glowing green means it has the most time. The collar glowing red means it has the least time. The collars glowing yellow are in-between.<br/><br/>If your collar reaches zero, you will die.<br/><br/>If you die before your collar reaches zero, the closest person to you will receive your remaining time.<br/><br/>If you give up, The Collar will kill you.<br/><br/><strong>Only one will survive.<br/>Kill or be killed. Your choice.<br/>The Collar doesn't care.</strong><h3>A Different Experience</h3>The Collar is a physics based first person game that pits you against strangers in a realistic way. This is <strong>not</strong> your typical \"fighting\" or \"first person\" game. You are not a ninja, or have magic, or some mythical creature with special powers. You are a regular human being. You fight like a regular human being. You can be hurt like a regular human being. There are things that are difficult as they would be in the real world. Choose to fight or be stealthy or come up with a different gameplay strategy all on your own. This game is a simulation of an experience.<br/><br/><h3>Abilities</h3><ul><li>Crouch/Walk/Run<br/></li><li>Climb/Slide<br/></li><li>Swim/Dive<br/></li><li>Fight</li></ul><br/><h3>Environmental Weapons</h3><ul><li>The Dowel: A rounded rod of wood to whack those who dare.<br/></li><li>The Rock: A hard broken piece of earth ready to smash anyone.<br/></li><li>The Stick: A stick given by the trees to whip whoever comes near you.</li></ul><br/><h3>Weapons</h3><ul><li>The Axe: A sharpened steel blade affixed a strong wooden handle that will cut down anyone in its path.<br/></li><li>The Baseball Bat: A deadly hard piece of spun wood that will crack the head of even the strongest.<br/></li><li>The Crowbar: A curved, hardened, piece of steel, although small, can break a bone or a back in a single swing.</li></ul><br/><h3>Environment</h3>From hot and cold to falling and drowning, the environment can cause some big problems. Even death.<br/><br/>Cold climates will cause Hypothermia.<br/>Hot climates can cause Heatstroke.<br/><br/>And do not even try to escape during the experiment. The Collar knows.<h3>MESSAGE FROM THE DEV</h3>The Collar is being designed in order to provide a different online multiplayer experience. From sound, realism, emersion, and minimalistic design, my game development process is designed to allow the player to enter worlds like they were a part of a movie you would normally watch, but now get to be the main character.<br/><br/>The Collar has been in development for over two years. I am very proud of The Collar in its current state. I want to keep adding meaningful content for another 1-2 years whilst still living up to the goal of a realistic experience. I am fully prepared for it to take even longer, if it means a better and a more well-rounded experience in the end. The game is not perfect and I understand that, which is why I have a roadmap of things I want to improve and iterate on to make this game experience better over time. The community has always helped shape and mold the game as it stands today and will definitely continue to do so as the community grows.<br/><br/>This passion game of mine does not end at Steam release, but is only the beginning. I am sure we will have plenty more interactions and I cannot wait to see where this journey takes us together. I enjoy playing my own game especially with friends and soon with new friends I am sure I will meet along the way. If you see me in a match, jump in and say hi! It is fun to hear additional impressions of the game and play style. Until then, The Collar is waiting.<h3>WARNING</h3>The Collar contains flashing lights, patterns, and images which may not be suitable for photosensitive epilepsy. If you experience any of the following symptoms while playing The Collar, dizziness, altered vision, eye or muscle twitches, loss of awareness, disorientation, any involuntary movement, or convulsions, IMMEDIATELY discontinue use and consult your physician before resuming playing The Collar.<br/><br/>The Collar contains scenes of realistic graphic violence and gore and may be disturbing to some. Under no circumstances should you attempt to do any of the things that happen in this game in real life. If you are easily offended or have a hard time separating fantasy from reality, this game is probably not for you.", "metacritic": null, "released": "2024-02-29", "tba": false, "updated": "2024-03-01T14:04:20", "background_image": "https://media.rawg.io/media/screenshots/f4c/f4c93b6ba5a3befaeb846fbb08445182.jpg", "website": "https://arizonainkstudios.com/the-collar/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 287, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Arizona Ink Studios"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["Arizona Ink Studios"], "esrb_rating": null}