{"id": 977854, "slug": "journey-of-the-forgotten", "name": "Journey of the Forgotten", "name_original": "Journey of the Forgotten", "description": "Gather your party or survive alone as you explore the great Continent of Tarkia, unveiling the evil that was shown in your vision.<br/><br/>Your playing as Quia the lone child of two heroes, fallen and forgotten. As your magic power awakens, you need to come prepared or the onslaught of monsters will be your doom.<br/><br/>From TwoSoulFox comes a Retro RPG, set in the beautiful world of hand-made maps. Old Fantasy and no auto-generated content.<br/><br/><br/><br/> <br/><br/>Learn to master the new Soul Dancer RPG class and add up to three more allies to your ranks choosing your difficulty that way. Ride your own horse and reduce the amount of monsters that can keep up with you. No matter where you go, adventure, loot and battle might find you. Will you help villagers and look for hidden treasures?<br/><br/> <br/><br/>Enjoy the completed storyline of the Legendary Four Crystals as the game expands and the indie developer adds more chapters to the game extending your experience and developing the story, watch the characters overcome greater challenges with the stakes rising. Caught in a conflict between humans, devils, and deities you will determine the fate of the whole party and their entire world. No loot boxes, DLC or season pass needed.<br/><br/><br/> <br/><br/>Forged with the blood and sweat of TwoSoulFox Studios, Journey of the Forgotten gives you unprecedented freedom to explore, experiment, and interact with a thriving world filled with characters, dangers, and traps. A true author's narrative enhances your playthrough and can be adapted based on player feedback. Join the Discord. From maze-like forests, to the abandoned Mithril Mines, to the darkness-filled castle of the mastermind itself, your choices will be remembered. Will your strategies succeed and will you become a master of the craft?<br/><br/> <br/><br/>The Continent of Tarkia is a unique world, and there are secrets to be discovered all around you – finding useful loot is a vital part of exploration. Wander, run, ride a horse, climb ropes, and fall as you travel from the depths of the deepest well to the glittering rooftops of Sonwonlo. Every choice you make drives your story forward, each decision leaving your mark on the world. Define your topmost priority, defeat boss-like enemies, and solve puzzles your way. No trouble resetting them. Leave and return.<br/><br/> <br/><br/>Stroll the world using your power and yours alone or find great companions to join your world-saving-endeavors. Come up with the perfect synergies or strategies… or introduce additional elements by using the power of items. Battles seems complicated but they feel like a walk in the park when all pieces fall into place.<br/><br/> <br/><br/>4 unique heroes offer a hand-crafted experience, each with their own unique traits, agenda, and outlook on the world. Their motivations and circumstances might differ, but they will come together to stop the true evil, because you know, it is their only world. Deny them and be headstrong or join forces.<br/><br/> <br/><br/>Based on the traditional rules of Old Fantasy Games. Character-based initiative, advantage and disadvantage, and technique/magic abilities, attack/defend commands, and tactical turn-based combat that rewards strategy and foresight. Having 1, 2, 3 or 4 party members allows you to customise the challenge of combat. No escaping the tides of combat, but you might want to save on one of your 16 save slots before heading into the unknown.<br/><br/> <br/><br/>Featuring a swift and versatile Monk, a strong and reliable Samurai and a smart and technical Archer class from the start, Journey of the Forgotten is set to grow. Over 100 spells and actions offer hundreds of one-of-a-kind battle situations, and the player's actions determine success or failure while allowing multiple winning strategies. Pass level 12 and become one of the strongest beings of the entire continent. With the current limit of 99, there might new challenges waiting for additional story chapters and endgame in general. Feel the love of an independant developer creating a unique experience for you and caring about it longer than others.<br/> <br/><br/><br/>What is that? A long forgotten secret ingredients makes its way back into gaming. Have enjoyable conversations with the elderly or teach kids about keeping randomly found pets and saving the world. How will your own moral compass react to the topics you come across and do you think about things? Quia does and she won't keep her opionion suppressed. Will you see the fourth wall fall or will you speedrun the game and ignore additional one-of-a-kind dialogues?<br/><br/> <br/><br/>No pants problems as Journey of the Forgotten aims at a younger and older audience which results in a streamer-friendly presentation. You’ll be able to stream Journey of the Forgotten without any problems, regardless of how you play, thanks to these facts.<br/><br/>", "metacritic": null, "released": "2024-02-29", "tba": false, "updated": "2024-03-01T14:00:35", "background_image": "https://media.rawg.io/media/screenshots/fc1/fc1e6df867b998493c8d446da4f9ec9b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TwoSoulFox Studios"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["TwoSoulFox Studios"], "esrb_rating": null}