{"id": 977973, "slug": "cucumber-champion", "name": "Cucumber Champion", "name_original": "Cucumber Champion", "description": "In \"Cucumber Champion\" embark on a whimsical journey into the fantastical world of cats where you, as the valiant Cucumber Warrior, wield a cucumber as your mighty weapon. The adventure begins with a curious cat animation pondering its purpose with the text \"What am I doing?\" before being whisked away into the depths of its own imagination, revealing a realm teeming with feline wonders.<br/>\n<br/>\r\nAs the protagonist, you encounter a motley crew of quirky cats who proclaim that you are the legendary Cucumber Champion destined to save their world. But before you can fulfil your destiny, you must first prove your prowess by vanquishing formidable foes.<br/>\n<br/>\r\nYour journey unfolds with a series of comical encounters, starting with facing off against the first enemy amidst a backdrop of amusing cat pictures. Soon, you find yourself navigating through a treacherous dungeon, where you must employ your wits to locate a crucial key. However, your task is interrupted by the sudden appearance of a colossal meatball, which ominously warns you to flee. Despite the threat, the meatball reveals a surprising kindness, allowing you to escape unscathed.<br/>\n<br/>\r\nWith the key in hand, you unlock the path to the final showdown—a climactic battle where you transform into the BUFF cat, brimming with muscles and determination. In a fierce clash against formidable adversaries, you unleash the full might of your cucumber prowess, emerging victorious as the revered Cucumber Champion.<br/>\n<br/>\r\nCucumber Champion is a 5-10 minute game that serves as a start to the Relevation Studios universe. Multiverse?...something?", "metacritic": null, "released": "2024-03-01", "tba": false, "updated": "2024-03-04T09:47:41", "background_image": "https://media.rawg.io/media/screenshots/153/153d688b656ed5ee4e1cb10c2864dd58.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Relevation Studios"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Relevation Studios"], "esrb_rating": null}