{"id": 977925, "slug": "the-mobius-machine", "name": "The Mobius Machine", "name_original": "The Mobius Machine", "description": "Carve your path through a <strong>vast alien world</strong> filled with brutal lifeforms and malfunctioning machines.<br/>Explore beyond the Crash Site, through the desolate Spaceship Graveyard, into the depths of the Mining Grounds, and up to the Floating Forests.<br/><br/>The Mobius Machine is a <strong>classic 2D adventure</strong> game with <strong>detailed 3D visuals</strong>.<br/><br/><h3>Explore Seamlessly</h3>Explore a complex interconnected <strong>open world</strong>, discovering it your own way.<br/>Stumble upon the breathtaking environments of the Isolaria moon. On <strong>land</strong>, <strong>underwater</strong> and in the <strong>skies</strong>. <br/><br/><h3>Fight</h3>Combat an array of deadly adversaries: the local fauna, infected colonists, and abandoned machines that once worked in the facilities.<br/>Defeat more than 80 distinct enemies, including the <strong>epic bosses</strong> that guard the most precious gear.<h3>Shoot Anywhere</h3>Designed for both <strong>Gamepad</strong> or <strong>Mouse and Keyboard</strong> controls. Run and jump around while shooting in any direction using a tight control system.<br/>You can have 2 weapons equipped at any time, and use them as you need.<br/><br/><h3>Evolve</h3>Acquire the gear that will make you more mobile and unlock new areas. <strong>Climb walls</strong>, <strong>dash</strong>, <strong>dive underwater</strong>, <strong>glide through the air</strong> and evolve the way you interact with the world.<h3>Upgrade your arsenal</h3>Collect blueprints and craft new <strong>weapons</strong> and <strong>upgrades</strong> in order to fight more effectively. Each new item you acquire will give you more options and increase your chances of survival.", "metacritic": null, "released": "2024-03-01", "tba": false, "updated": "2024-03-04T07:17:23", "background_image": "https://media.rawg.io/media/screenshots/1b6/1b6caaf314d374d29a1593bb13311386.jpg", "website": "https://madrugaworks.com/mobius", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 621, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Madruga Works"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Madruga Works"], "esrb_rating": null}