{"id": 977968, "slug": "dangerous-fightcia", "name": "Dangerous FightCIA", "name_original": "Dangerous FightCIA", "description": "Description:<br/>\n<br/>\r\nWelcome to the adrenaline-pumping adventure \"Dangerous Fight\" - an online shooter that will take you to the heart of the action in the atmosphere of the city of Yerevan, Armenia. You will go into epic battles where the technology of the future and the cultural heritage of the ancient city mix.<br/>\n<br/>\r\nPeculiarities:<br/>\n<br/>\r\n🔫Weapons and technologies of the future: Arm yourself with advanced weapons equipped with advanced technologies and immerse yourself in exciting battles.<br/>\n<br/>\r\n🌆Battle in Yerevan: Discover the streets of Yerevan in detail, where every corner hides danger and every street becomes a battlefield.<br/>\n<br/>\r\n👥 Multiplayer mode: Join friends or create your own team for cooperative and competitive battles online.<br/>\n<br/>\r\n🚨 Dangerous missions: Complete secret missions, become a special agent and confront dangerous opponents.<br/>\n<br/>\r\n🌐 The world in your pocket: Discover the world of online operations where your skill and teamwork decide the outcome of the battle.<br/>\n<br/>\r\n💡 Evolution of Personalization: Personalize your character with a variety of customizations to stand out in the world of Dangerous Fight.<br/>\n<br/>\r\n🎮 Regular Updates: New levels, weapons and game modes promise constant challenges to keep you interested night after night.<br/>\n<br/>\r\nJoin \"Dangerous Fight\" right now and become part of this exciting online battle, where every moment is dangerous and every shot is decisive.", "metacritic": null, "released": "2024-03-01", "tba": false, "updated": "2024-03-04T09:38:33", "background_image": "https://media.rawg.io/media/screenshots/575/575577ec3c8b167ab28177701dce142b.jpg", "website": "https://ciamobilearm.wixsite.com/dangerousfight-1", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 499, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["SHM", "CIA_inc", "CIA"], "genres": ["Action", "Adventure", "Massively Multiplayer"], "publishers": ["Cia"], "esrb_rating": null}