{"id": 977944, "slug": "rise-and-fall-bronze-age", "name": "Rise and Fall: Bronze Age", "name_original": "Rise and Fall: Bronze Age", "description": "Several millennia have passed since the beginnings of agriculture. The Fertile Crescent regions have gradually seen the emergence of new societies. For the first time, humans grow to groups of thousands and eventually formed cities. Thus were born the first states and with them, trade, but also war.<br/><br/><strong>A dynamic and realistic technological system</strong><br/><br/>Ideas appear according to specific triggers, state technologies can also be forgotten...<br/><br/><strong>The World of the Fertile Crescent</strong><br/><br/>A dynamic world where civilization will spread from Egypt and Sumer to the rest of Mesopotamia and the Levant.<br/><br/><strong>The resource of the rulers: their population</strong><br/><br/>An economic system based not on resource-producing buildings, but on populations that realistically evolve through years, wars, epidemics and periods of prosperity.<br/><br/><strong>A game of civilization and survival</strong><br/><br/>Your state must seem legitimate according to your culture. Let that legitimacy hit zero and you lose the game. Build temples, win wars and build monuments to raise it. You will have to manage your elites and be sure to maintain their loyalty.<br/><br/><strong>A world of constant difficulty</strong><br/><br/>Small kingdoms and huge empires don't play the same. Try to expand and survive as a small nation, using warfare and diplomacy as you primary tools. Maintain your rule as a huge empire, with your scheming elites, foreign clergies and populations who don't want your rule, and dreams of liberty. <br/><br/><strong>Fourteen startdates, from 3400BC to 1450BC</strong><br/><br/>Unify the chiefdoms of Egypt, take sides in the war between Horus and Set, see the rise and fall of the Old Kingdom or rule as the New Kingdom and conquer Nubia and the Levant.", "metacritic": null, "released": "2024-03-01", "tba": false, "updated": "2024-03-04T08:46:44", "background_image": "https://media.rawg.io/media/screenshots/e8b/e8b6675248e639cb20cc845e9b2c2b46.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ludwig LoreKhan"], "genres": ["Strategy"], "publishers": ["Ludwig LoreKhan"], "esrb_rating": null}