{"id": 977946, "slug": "intra-2", "name": "Intra", "name_original": "Intra", "description": "<strong>Finally towers fall in a tower defense game.<br/>Intra-Tower Defense presents its player with vast strategy elements.</strong><br/><br/><strong>Key Features:</strong><br/><ul><li><strong>Skill Combos:</strong> There is 20+ upgradable skills you can pick and make impressive combos.<br/><br/></li><li><strong>Enemies have specific behaviour:</strong> Some enemies choose the safest route. Others attack certain towers first. Some enemies can be easily provokable. Some enemies make smart moves. Learn the behavior of the enemies and defend your base tower. <br/><br/></li><li><strong>Plenty of Enemy Genre:</strong> There is a lot of different kind of enemy. And every enemy has different behavior. Explore those behaviors and defend yourself accordingly.<br/><br/></li><li><strong>Destructable Towers: </strong>IntraTD has very dynamic gameplay. Towers can be crushed by enemies. Inspect the level's tricks and finesse side and build your strategy.<br/><br/></li><li><strong>Strategic Range:</strong> Every enemy and tower has a different vertical and horizontal attack range. <br/><br/></li><li><strong>Tower Upgrades:</strong> Every tower has its own specific upgrades. Also, there are a lot of general upgrades which affect all towers. Choose the best tower upgrade according to your economy and strategy style.<br/><br/></li><li><strong>Hex-grid Levels:</strong> No confusion in a good strategy and tower defense game. Hex-grid makes levels more understandable. Allows you to plan accordingly.<br/><br/></li><li><strong>EPIC BOSSES:</strong> These game's bosses are legends and for sure they will surprise you.<br/><br/></li><li><strong>Look and Feel:</strong> Levels are designed to balance intelligibility and atmosphere. If you're looking at a view from above, why not look at something beautiful?<br/><br/></li><li><strong>Story Telling:</strong> Intra was a chosen one. You will watch Intra's story while playing a unique strategy tower defense game.</li></ul><br/><strong>General:</strong><br/>Unlike the other tower defense game, Intra Tower Defense has a <strong>height difference</strong>,<strong> skill combos</strong>, <strong>smart enemies</strong> and <strong>destroyable towers</strong>. Intra-Tower Defense also presents players with a good <strong>cinematic</strong> experience. <br/><br/><ul><li><strong>Level Designs</strong>: Every level is unique and atmospheric. Levels are also highly replayable. You can choose your skills and upgrades again and play it again. But remember, enemies won't respond like before. <br/><br/></li><li>There is<strong> two tower upgrades section</strong>. One is inside the game: These upgrades are specific to that tower. <br/>General upgrades affect every tower. Choose your way and build your strategy style.<br/><br/></li><li><strong>Clear Game Tutorials</strong>: Intra-Tower Defense have a lot of game mechanic but with clear explanations, you will understand all of them.<br/><br/></li><li>You can also see information about towers and enemies in the book section.</li></ul>", "metacritic": null, "released": "2024-03-01", "tba": false, "updated": "2024-03-04T08:51:07", "background_image": "https://media.rawg.io/media/screenshots/fca/fcad9f80c7e5dc218b01fd8a8b64ecee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 543, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LOD Games"], "genres": ["Strategy", "Indie"], "publishers": ["LOD Games"], "esrb_rating": null}