{"id": 977978, "slug": "tank-fight-2", "name": "Tank Fight", "name_original": "Tank Fight", "description": "<h3>Gameplay!</h3><ul><li>Hop into a game with friends or join a public lobby and see who will come out on top.<br/></li><li>Depending on the gamemode, modifiers can be purchased at the start of each round these will add buffs and debuffs to your tank.<br/></li><li>Modifiers are purchased with money that will be awarded depending on settings set by the host.<br/></li><li>Fight with other players until someone accumulates enough points to reach the points to win threshold.<br/></li><li>The goal that awards points depends on the gamemode being played.<br/></li><li>The host can customize the experience by changing the game’s settings.<br/></li><li>You can create custom maps using the ingame level editor or download player made maps from the workshop. You can also use built in maps if you don't want to make your own.</li></ul><h3>Gamemodes!</h3><strong>Battle Royale</strong><br/>A round based gamemode. Each round starts with a shop where players can buy modifiers. After shopping you randomly get spawned somewhere in the map. Fight other players until there is one team left. Rounds repeat until a team gets enough points to win.<br/>Teams: Optional<br/>Recommended Players: 2+<br/><br/><strong>King of the Hill</strong><br/>A non stop action gamemode where you respawn when you die. Stand in the capture point to get points. When you die you enter a shop. Fight over the capture point until one team has gotten enough points to win.<br/>Teams: Optional<br/>Recommended Players: 3+<br/><br/><strong>Capture The Flag</strong><br/>A round based gamemode. Each round starts with a shop where players can buy modifiers. After shopping you spawn with your team and flag. Keep your flag safe while trying to take the enemy flag. Once a player picks up both flags on their side their team wins. Rounds repeat until a team gets enough points to win.<br/>Teams: Forced 2<br/>Recommended Players: 4+<br/><br/><strong>Deathmatch</strong><br/>A non stop action gamemode where you respawn when you die. Get points from killing other players. When you die you enter a shop. Fight with other players until one team has gotten enough points to win.<br/>Teams: Optional<br/>Recommended Players: 3+<br/><br/><strong>Juggernaut</strong><br/>A round based gamemode. Each round a juggernaut is picked randomly prioritizing how well you did last game. You can't be juggernaut two times in a row. When you die you respawn. When the juggernaut dies the round ends. Get points by dealing the most damage to the juggernaut and by killing the juggernaut. Keep killing the juggernaut until one team has gotten enough points to win.<br/>Teams: Disabled<br/>Recommended Players: 4+<br/><br/><strong>Castle Siege</strong><br/>Team 1 is defenders. Team 2 is attackers. At the start of the game defenders get to pick a powerful class. If a defender dies they respawn as a weak castle guard. If an attacker dies they respawn and get to repick their class. Attackers must kill the king before the timer runs out. Defenders must defend the king until the timer runs out.<br/>Teams: Forced 2<br/>Recommended Players: 4+", "metacritic": null, "released": "2024-03-01", "tba": false, "updated": "2024-03-04T09:57:11", "background_image": "https://media.rawg.io/media/screenshots/c73/c73b67358c5f0964629b899d2e1bc640.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pixel_Gamer", "TNT_MAN1111"], "genres": ["Action"], "publishers": ["Pixel_Gamer"], "esrb_rating": null}