{"id": 977928, "slug": "silent-3", "name": "Silent", "name_original": "Silent", "description": "<h3>READ BEFORE PLAY</h3>Make sure the environment is quiet before playing this game. When you are afraid, you worry about the damage you cause to the environment and<br/>We are not responsible for any complaints you receive from your neighbors. Finally, epilepsy patients cannot play this game.[/b]<br/><br/>It's a different way to feel the emotion of fear. Silent is an independent horror game developed with Unreal Engine 5.<br/>Before playing the game, you need to adjust your microphone and headset settings. Even the slightest sound while playing games<br/>It causes you to start the game from the beginning.<br/><br/>As a journalist, you have an accident on the forest road while trying to solve a mysterious case.<br/>You must find a way out of the forest.<br/><br/>You need to hurry a bit because you are losing blood. Watch every step you take<br/>he is watching and following you. If he heard you all you have to do is open your hands and pray to god.<h3>MICROPHONE REQUIRED PLAY</h3>For a better experience, please make sure the microphone device is plugged into your computer and set the best setting in the microphone calibration section when you enter the game.<h3>PLAY FAIR</h3>You can turn off your microphone to end the game immediately, but this will prevent you from enjoying the game. For an enjoyable game, please adjust your microphone settings accordingly.", "metacritic": null, "released": "2024-03-01", "tba": false, "updated": "2024-03-04T07:23:53", "background_image": "https://media.rawg.io/media/screenshots/dc0/dc0cd59508299033a27b4f561123f86b.jpg", "website": "https://www.youtube.com/channel/UCke5Zb0MDvRs-hYr0YetMNQ", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 392, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GenemesicX"], "genres": ["Indie"], "publishers": ["GenemesicX"], "esrb_rating": null}