{"id": 977997, "slug": "space-query", "name": "Space Query", "name_original": "Space Query", "description": "Explore the Cosmos with Space Query!<br/>\n<br/>\r\nEmbark on an astronomical adventure with Space Query, the ultimate solar system simulator! Whether you're a budding astronomer, a space enthusiast, or just curious about the universe, Space Query is your gateway to the stars. This simulation software brings the solar system to your fingertips, allowing you to explore the orbits of planets and witness the fascinating effects of introducing new cosmic objects like asteroids, extra suns, or even a black hole.<br/>\n<br/>\r\nKey Features:<br/>\n<br/>\r\nRealistic Solar System Simulation: Dive into a detailed and dynamic model of our solar system. See the planets orbit in real-time or speed up time to watch years unfold in minutes! The software uses accurate positioning data updated live from NASA info, for a realistic simulation.<br/>\r\nInteractivity at Its Best: Add celestial bodies to the system and observe the gravitational dance. Witness the impact of these additions on the delicate balance of our cosmic neighborhood.<br/>\r\nDetailed Planetary Exploration: Zoom in on each planet to discover rich, full-color images based on authentic NASA photography. Uncover secrets and learn fascinating facts about each celestial body.<br/>\r\nCustomizable Viewpoints: Position yourself anywhere in the solar system. Want to see the orbits from Mars? You can! Experience the universe from new and unique perspectives.<br/>\r\nUser-Friendly for All Ages: Designed for space enthusiasts aged 7 to 77, Space Query is intuitive, engaging, and educational. A perfect blend of fun and learning for the whole family!<br/>\r\nPrepare to be captivated by the beauty and complexity of our universe. Space Query is not just a software; it's a journey through space and time, offering endless exploration and discovery. Are you ready to unlock the mysteries of the cosmos?<br/>\n<br/>\r\nDownload Space Query now and start your celestial adventure!", "metacritic": null, "released": "2024-03-03", "tba": false, "updated": "2024-03-04T10:40:59", "background_image": "https://media.rawg.io/media/screenshots/e26/e26c243f1094d86abd60ac49956ee0c0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Space Query team"], "genres": ["Simulation"], "publishers": ["Space Query team"], "esrb_rating": null}