{"id": 977935, "slug": "sha-chong-ji-xiao-dui-chong-zu-zheng-ba-insecticid", "name": "杀虫剂小队：虫族争霸Insecticide Troopers:Star zerg", "name_original": "杀虫剂小队：虫族争霸Insecticide Troopers:Star zerg", "description": "<strong><h3>All plot battles</h3></strong><br/><br/>It's all a survival battle<br/><br/>In different battles, as a heroic lieutenant, you resist the Zerg tide like attacks with soldiers in different positions.<br/><br/>Defending for 25 minutes will determine victory in the game, but this is not an easy task, it is something that must be done by you.<br/><br/><strong>So use the heavy machine gun in your hand and bravely unleash your firepower on the damn Zerg.</strong><br/><br/><br/><br/><br/><br/>————————<br/><br/><strong><h3>Federal News Express:</h3></strong><br/><br/><strong>Obituary</strong><br/><br/><br/><br/>This year marks the seventeenth year of the federal war with the Zerg.<br/><br/>【 Geze 7 】 A moment of beautiful and rich planet, the best farm planet in the Federation, the highest quality milk and rice producing area in the Federation, especially cigars, which are the favorite of all Federation marshals. But now it has been attacked by the Zerg, and the once beautiful planet has been stained red with blood.<br/><br/>One hour, 100000 people died<br/><br/>In two hours, 300000 people died<br/><br/>Four hundred and seven million people died in twelve hours<br/><br/>This number is still soaring, and humanity is facing an unprecedented crisis. The Federal Command admits that they have wrongly underestimated the Zerg's long-range strike capabilities.<br/><br/>Due to the tragedy on the planet of Goethe 7, the Federal Air Force Lieutenant General responsible for homeland defense resigned. The Air Force Marshal has ordered a space fleet to go to Goethe 7 for rescue, but reinforcements will arrive at least a week later. Can the people on Goethe 7 still hold on for so long.<br/><br/><br/><br/>Federal soldiers are resisting on the planet.<br/><br/>We have weapons!<br/><br/>We have weapons!<br/><br/>We have weapons!<br/><br/>We need warriors!<br/><br/>It is time for the farmers of the federal call for \"Goethe 7\" to take up weapons and surround their homes like men, rather than waiting for others to save them.<br/><br/>We need warriors, like heroic lieutenants.<br/><br/><strong>We need you!</strong><br/><br/><strong>Your home needs you!</strong><br/><br/><strong>You can obtain citizenship by serving in the military!!!!!!</strong><br/><br/>Join the army now, what are you waiting for.<br/><br/>Continue to fight, victory will belong to the Federation, to all citizens!!!!!", "metacritic": null, "released": "2024-03-01", "tba": false, "updated": "2024-03-04T07:46:55", "background_image": "https://media.rawg.io/media/screenshots/327/327aa8a50a9a82867483b8a59e878072.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 439, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["凌石更"], "genres": ["Action", "RPG"], "publishers": ["凌石更"], "esrb_rating": null}