{"id": 977939, "slug": "death-duel-vr", "name": "Death Duel VR", "name_original": "Death Duel VR", "description": "<h3>Join Our Discord</h3><h3>What is Death Duel VR</h3><br/>Death Duel VR  is an online melee fighting game that is trying to deliver <strong>historical accurate medieval duel combat</strong> online between real players, the combat is fully supported with realistic physics.  <br/><br/><br/>Any one who is enthusiastic to fight in PvP online with realistic swords collision and physics interaction should try this <strong>Physics-Driven VR PvP Medieval Duel</strong> game. <br/><br/><br/>The PvP combat is also featured with <strong>grappling</strong>, and not just limited to fight on the foots but also fight on horse back(<strong>Jousting</strong>).  <br/><br/><br/><br/><br/><br/>Death Duel VR is designed to be <strong>HEMA friendly</strong>, many real-life Guards and martial art techniques can be easily pulled off in PvP match.  <br/><br/><br/><br/>The main content is to bring the key features of medieval tournament into online PvP with supporting of VR controllers. <br/>Key features:<br/>Fencing with sword, shield, flail, polearm and etc.<br/>Archery<br/>Jousting<h3>Is there Singleplayer Content?</h3><br/>Yes, there are two singleplayer levels:<br/>Practice Arena: it's an areana map in which player can spawn training bots to parry.<br/><br/>Challenge Mode - Island Raid: It's a procedural generated random island with more bandits and villages, there would be a different island everytime you play. It's for player to gain some extra credits and xp.<br/>More Challenge is in development.<br/><br/><strong>Demo Version:</strong>  Only Knight and a basic horse is playable. One online map, Practice Arena and Island Raid Challenge is available, but <strong>PROGRESS ARE NOT SAVED</strong>.  Seven weapons are provided immediately on the weapon table, player is locked into Tier 3. <br/><br/>To report bugs please post them on Discord where I answer questions most of time. <br/>Discord Server: https://discord.gg/RPMNvr49cu<br/><br/><strong>Game Status;</strong><br/>Early Access will be released soon.", "metacritic": null, "released": "2024-03-01", "tba": false, "updated": "2024-03-04T08:32:09", "background_image": "https://media.rawg.io/media/screenshots/507/507aefeb6fd28760b31e8d0e7fc4fd26.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 376, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dog VR Game"], "genres": ["Action", "Simulation"], "publishers": ["Dog VR Game"], "esrb_rating": null}