{"id": 977923, "slug": "ghost-in-the-mirror", "name": "Ghost In The Mirror", "name_original": "Ghost In The Mirror", "description": "Do you believe in ghosts?<br/>Are you ready to be scared?!<br/>... Well, then I think you've got the wrong game.<br/><br/>Seriously, I started off with the darkest intentions, wanting to create a horror game, but the urge to laugh took over.<br/>Sure, it's an adventurous game with mysterious elements... However, with constant fourth-wall breaks, irony, jokes, and vulgarity, you tend to forget about ghosts!<br/><br/><br/><br/>Let me introduce myself, I'm Sui!<br/>I'm Italian, and I'm a solo indie developer.<br/>I've dedicated myself so much to this project that I've ended up inside it in flesh and pixels.<br/>Sitting behind my desk, I will narrate the events and guide you by the hand through this journey...<br/><br/><br/><br/>...A journey that will keep you glued to the screen from the first to the last episode.<br/>Yes, you heard right, EPISODES!<br/>Ghost In The Mirror is an anthology of graphic adventures.<br/>A series of ghost stories characterized by a lot of storytelling, puzzles, and wild humor.<br/>A collection of modern adventure games that still capture the spirit of the '90s games.<br/><br/><br/><br/>This is \"Here Be Dragons\", the first episode of the saga.<br/>In this adventure I'll take you to the 18th century, and together we'll experience the adventures of Roger, a morally dubious boy on the run from the law.<br/>A journey that starts in a pirate village, with light puzzles and comedic moments, but will take us adrift at sea, surrounded by mystery, ghosts, and...<br/>...Well, I don't like to reveal too much about the plot, so that's enough!<br/><br/><br/><br/>But I can tell you what characterizes this and all the other episodes of Ghost In The Mirror:<br/>You'll guide characters from different eras through a 2D world with an unprecedented depth.<br/>You'll explore evocative pixel-art scenarios and handcrafted animations, immersing yourself in gripping stories, all connected by the eerie thread that unites the worlds of the living and the dead.<br/>You'll solve intricate puzzles and meta-puzzles like in a classic point-and-click game.<br/>You'll visit places rich in interactive elements and talk to the quirky characters that populate them.<br/>You'll collect items necessary to progress in the game, which, if used creatively, might reveal the programmer's sheer foolishness.<br/>Your choices will determine the outcome of the adventures, offering a personalized and replayable gaming experience.<br/>Prepare to be carried away by an original and thrilling soundtrack that will plunge you into the game's atmosphere.<br/>Unlock your potential through a series of exciting achievements, revealing your skill and dedication.<br/>Get Ghost In The Mirror and let yourself be captivated by an epic adventure!<br/><br/><br/><br/><br/><br/><br/><br/>Specters, spirits, ghosts, poltergeists, ectoplasms...<br/>Throughout history, we've come up with many names for them, and countless people swear they've seen one.<br/>Do you believe in ghosts?<br/>Here's what we'll do: you'll answer me directly in the game.<br/><br/>Have fun, and happy nightmares!<br/><br/>Play comfortably using touchscreen, keyboard, mouse, or controller, tailoring the gaming experience to your personal preferences<br/><br/>Available languages: English and Italian (Others will be added later)", "metacritic": null, "released": "2024-03-01", "tba": false, "updated": "2024-03-04T07:12:21", "background_image": "https://media.rawg.io/media/screenshots/c0d/c0d5ee3f55ad02a28caaa1e228770773.jpg", "website": "https://www.suiarts.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 425, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Stefano Mazzotta"], "genres": ["Adventure", "Indie"], "publishers": ["Sui Arts"], "esrb_rating": null}