{"id": 977967, "slug": "undying-harvest", "name": "Undying Harvest", "name_original": "Undying Harvest", "description": "Undying Harvest is a thrilling and unique farming survival game that pits you against the relentless hordes of the undead. As a courageous farmer, your idyllic life takes a dark turn when your once peaceful farm becomes ground zero for a zombie apocalypse. Now, it's up to you to cultivate your crops and defend your land against waves of relentless zombies, bats, and other undead creatures.<br/><br/><br/><ul><li><strong>Farm, Fight, Survive:</strong> Immerse yourself in the dual challenges of cultivating a thriving farm and battling hordes of undead. Balance your time wisely between managing your crops and fending off waves of relentless undead.<br/><br/></li><li><strong>Bountiful Harvest, Deadly Harvesters:</strong> Plant a variety of crops, nurture them to maturity, and harvest the rewards. But be prepared - the undead are attracted to the scent of fresh crops, making your farm a prime target.<br/><br/></li><li><strong>Diverse Undead Threats:</strong> Face off against a multitude of undead adversaries, each with unique abilities and behaviors. From swarming zombies to agile bats, every encounter presents a new challenge that requires strategic thinking and quick reflexes.</li></ul><br/><br/>Undead Harvest offers a unique blend of farming simulation and intense survival action. Can you cultivate a flourishing farm while fending off the relentless undead onslaught?", "metacritic": null, "released": "2024-03-01", "tba": false, "updated": "2024-03-04T09:35:26", "background_image": "https://media.rawg.io/media/screenshots/908/9088f12dd9a6b5f2cd915de355074628.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Birddie Software"], "genres": ["Action", "RPG", "Casual", "Indie"], "publishers": ["Birddie Software"], "esrb_rating": null}