{"id": 977964, "slug": "sanya", "name": "Sanya", "name_original": "Sanya", "description": "<p>Imagine it&#39;s the 90s and you&#39;re a kid again. It’s a difficult time filled with political instability and poverty. But when you’re seven years old none of this matters. Forget all the problems and immerse yourself in the joy of finding new friends and scraping your knees!<br />\nRide your bike, take care of your new pet and relish the last days of summer before school starts. But don&#39;t think it&#39;ll be a breeze - kids sometimes face adult problems too. Can you prove that you&#39;re not afraid of anything?<br />\nIt’s a game for everyone who once was a kid.<br />\nStart and nurture friendships that will last a lifetime. Enjoy the carefree summer fun until mom calls you home for dinner. Remember how it feels to have knee bruises and pine needles stuck in your fingers. Reconnect with your inner child.<br />\nExplore a unique post-soviet 90s setting that evokes strong feelings of nostalgia for a place stuck in time.<br />\nAlmost every character you meet in Sanya will have something they want from you, whether it’s a small fetching quest or a serious matter to resolve.<br />\nTry to get to hidden characters, side quests and secret progression paths.<br />\nAt the core of Sanya is narrative and adventure, supported by exploration and fun activities that encourage player agency.<br />\nA lot of puzzles, platforming, racing, and choose your own adventure mini games.<br />\nPlay hopscotch, hide and seek, biking and much more!<br />\nMeet and adopt a stray puppy. It is your new best friend who will help you progress through the story!<br />\nFeed him, give scratches, teach how to do tricks and even find useful items. You can help your dog friend cross the river, and in return he will protect you from bullies.</p>", "metacritic": null, "released": "2024-03-01", "tba": false, "updated": "2024-03-13T08:57:10", "background_image": "https://media.rawg.io/media/games/efb/efb59c445868ceba7118e63742f9d172.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "beaten": 2, "toplay": 1}, "playtime": 0, "achievements_count": 9, "ratings_count": 1, "suggestions_count": 374, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["helpnode"], "genres": ["Adventure"], "publishers": ["helpnode"], "esrb_rating": null}