{"id": 978000, "slug": "san-guo-zhan-qi-three-kingdoms-battle-chess", "name": "三国战棋 Three Kingdoms Battle Chess", "name_original": "三国战棋 Three Kingdoms Battle Chess", "description": "<h3> What kind of game is this? </h3>This is a game that combines the style of the Three Kingdoms, Hearthstone Tavern Battle Chess, and looks at faces randomly. It has six game modes, over 700 generals, over 100 bonds, over 300 skills, over 80 treasures, troops, formations, items, and operations. It is a must-have for fans of the Three Kingdoms.<br/>This game is similar to the Hearthstone Tavern mechanism, where players spend in-game gold to draw random heroes or treasures during the operation phase, and can view detailed information such as enemy attributes and skills. Then you can click the start button of the battle to start the battle animation on the main interface of the game. When all enemy and friendly generals fight until one side is killed, the game ends. Victory leads to obtaining gold, conducting operations, and starting the next challenge. If you fail, restart the game.<br/>Generals possess five basic attributes: commanding, military, intellectual, political, and moral, as well as six special attributes: critical strike, critical damage, increased damage, reduced damage, recovery bonus, and skill release. They also possess exclusive skills for skills, branches, formations, bonds, and generals. You can grant them treasures and obtain their bonus attributes and skills. You can use items to summon historical characters to attack cities and ravage territories.", "metacritic": null, "released": "2024-03-02", "tba": false, "updated": "2024-03-04T10:50:34", "background_image": "https://media.rawg.io/media/screenshots/cdf/cdf4db75d05bc1c60e3fb23e2703d00e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["天地乾坤工作室"], "genres": ["Adventure", "Strategy"], "publishers": ["天地乾坤工作室"], "esrb_rating": null}