{"id": 97805, "slug": "invasion-of-barbarians-itch", "name": "Invasion of Barbarians (itch)", "name_original": "Invasion of Barbarians (itch)", "description": "<p>Having been got out of naked women, accompanied with heart-rending servant's shout, you harried up to an urgent audience with the King.</p><p>Congratulations! Now you are in the head of the castle, country and motherland defense. Let your victory be swift and absolute… Either at least do not deep-six us all.</p><p>It is not about your knowledge of the art of war (or your knowledge of anything else), you just thought it might be fun to shoot a bow at live targets.</p><p>*************</p><p>Roleplaying system</p><p>Develope your character and improve abilities, focus on one group or on all three groups: Marksmanship, Vitality, Stealth. Create your unique character.</p><p>A variety of units</p><p>Buy and hire various mercenaries and upgrade them for the collected resources to destroy different enemy units.</p><p>Tactics</p><p>Explore a level and choose the most suitable time to buy mercenaries of one type or another, depending on the characteristics of the attacking enemies.</p><p>*************<br/>You can create a hero here according to your taste. For example, spending your роints on improvement of your hero's adroitness you can create a master of the distsnt battle with an opportunity to choose appropriate talents. Moreover, you can improve a hireling, who become the best support for you in the close battle. It's worth to say, that you can become a master of close battle by developing of strenght and improving protection and operating with snares.There is also a varient of manipulation with intelect. You can chose both a fire-ice-poisoned dart and an explosive or forrifications.</p><p>Together with a complex game mechanics and the different branches of the hero, each passage may be unique.</p><p>Web site<br/></p><p>Steam Greenlight<br/></p><p>Facebook<br/></p>", "metacritic": null, "released": "2017-02-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0f1/0f1ca21b0c870eb1ac5ded3301abf5b1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["71Games"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}