{"id": 978151, "slug": "fusion-fling", "name": "Fusion Fling", "name_original": "Fusion Fling", "description": "https://store.steampowered.com/app/2652040/Umbra_Fields/<br/>https://store.steampowered.com/app/2822390/Whiteout_Frontier/<br/>https://store.steampowered.com/app/2858360/Critterball_Derby/<br/><br/>You are contracted by Blue Billy Bear to create fusions of different items, and to manage the sizes of them in this puzzle adventure to prevent overflow! Strategically match, fling, and fuse many creative and new fusions to gain more score.  Challenge using new fusions to conquer the leaderboard. How many new fusion combinations can you create? Those who experiment will be rewarded with higher scores.<br/><strong>General Overview</strong><br/><ul><li> Fling items into the arena with simple moving of the mouse and clicking to flick items.<br/></li><li> Fling items together to create a fusion which creates a new item.<br/></li><li> Create fusions to discover more combinations of items combining to make new items and gain more points.<br/></li><li> Manage the size of your Items through fusions and interactions.<br/></li><li> The biggest thing to interact with is Nuclear Balls. They can contaminate items that touch them, or improve them. Every time they contaminate, they shrink. Blowing one up increases the size of Nuclear Balls overall. <br/></li><li> If Nuclear balls get too big, or items gets too small, then it's game over.<br/></li><li> Calculate the score and see where you fair on the leaderboard.</li></ul>", "metacritic": null, "released": "2024-03-04", "tba": false, "updated": "2024-03-11T09:09:16", "background_image": "https://media.rawg.io/media/screenshots/fb8/fb8810c62be1fede4025239d6838787b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Michael Richard Lannon"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Michael Richard Lannon"], "esrb_rating": null}