{"id": 978127, "slug": "zombies-vs-you", "name": "Zombies vs You", "name_original": "Zombies vs You", "description": "Step into a world overrun by the undead in this thrilling survival game. <br/>\n<br/>\r\nNo longer can you stroll the streets without fear; now, every corner holds the potential for a deadly encounter with zombies. As the protagonist, you find yourself thrust into this nightmare scenario, armed only with a handful of bullets and your wits. Your mission: to navigate the treacherous landscape, using your weapons strategically to fend off hordes of ravenous zombies while staying one step ahead of their relentless pursuit.<br/>\n<br/>\r\nMain Features:<br/>\r\n1. Survival Horror Setting: The game is set in a world overrun by zombies, where every corner is fraught with danger, creating a tense and thrilling atmosphere.<br/>\r\n2. Protagonist's Challenge: Players take on the role of a protagonist thrust into this nightmare scenario, armed with limited resources and tasked with navigating the dangerous landscape filled with ravenous zombies.<br/>\r\n3. Strategic Gameplay: Players must strategically manage their ammunition, choosing when and where to engage the zombies to maximize their chances of <br/>\r\nsurvival. This includes deciding which weapons to use for different situations.<br/>\r\n4.Weapon Variety: The game offers a selection of firearms with different attributes, such as the rapid firepower of an AK-47, the precision of a revolver, or the versatility of a Glock 19. Each choice has its own advantages and drawbacks.<br/>\r\n5.Diverse Zombie Types: The undead come in various forms, each presenting its own unique challenges. This diversity requires players to adapt their tactics on the fly to effectively deal with different types of zombies.<br/>\r\n6.Escalating Difficulty: The number of zombies escalates with each passing moment, increasing the intensity of the gameplay and putting pressure on players to constantly replenish their resources and stay one step ahead of the undead horde.<br/>\n<br/>\r\nAre you ready to confront the horrors of the apocalypse head-on? Arm yourself, steel your nerves, and prepare to face the undead menace in this pulse-pounding adventure.", "metacritic": null, "released": "2024-03-04", "tba": false, "updated": "2024-03-11T08:24:53", "background_image": "https://media.rawg.io/media/screenshots/3dd/3dd2326b5e690cc160742d7cb11e35c0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Atomic Games"], "genres": ["Adventure", "Strategy", "Simulation", "Sports", "Casual", "Indie"], "publishers": ["Atomic Games"], "esrb_rating": null}