{"id": 978156, "slug": "color-hunt-number-jigsaw-puzzle", "name": "Color Hunt - Number Jigsaw Puzzle", "name_original": "Color Hunt - Number Jigsaw Puzzle", "description": "Color Hunt is a fun and relaxing puzzle game. It’s more than just coloring- it's a randomly generated number block jigsaw game that'll take your brain to another level! <br/>\n<br/>\r\nGorgeous Art, challenging number grid block matching, jigsaw puzzle strategies with shape fit mechanics. Experience one of the most original board games, earn rewards and unlock new levels, solve puzzles which get larger each level, freely choose from all available puzzle pieces in a smooth scrolling ribbon, build up art galleries, complete daily levels &amp; hundreds of missions….<br/>\n<br/>\r\nIn this unique and soothing game, you exercise your number, color and shape-based pattern recognition while resting your analytical mind in a tactile and meditative experience.  <br/>\n<br/>\r\nWITH COLOR HUNT YOU CAN<br/>\r\n▶ PLAY the full Coloring Jigsaw Board game experience offline and on the go.<br/>\r\n▶ CLICK to play and navigate between 100+ levels, categories, daily levels, and missions<br/>\r\n▶ GET more levels, category packs, and art exhibit customers.<br/>\r\n▶ BUILD UP art galleries and daily level streaks<br/>\r\n▶ EARN extra money by completing daily level streaks and mission.<br/>\r\n▶ SOLVE over a hundred randomly generated grid based levels that get harder as you go.<br/>\n<br/>\r\nWHY PLAY COLOR HUNT?<br/>\r\n▶ RELIEVE your stress with smooth and tactile jigsaw coloring controls<br/>\r\n▶ LEVELS which get harder every time and require skills and pattern recognition to be beaten.<br/>\r\n▶ CUSTOMIZE galleries by building and improving art exhibits for each completed picture.<br/>\r\n▶ CONSTRUCT GALLERIES and attract an audience.<br/>\r\n▶ LEARN to recognize number, color and shape based patterns on a randomly generated grid <br/>\r\n▶ ACHIEVE infinite daily streaks and completion on hundreds of missions!", "metacritic": null, "released": "2024-03-04", "tba": false, "updated": "2024-03-11T09:17:28", "background_image": "https://media.rawg.io/media/screenshots/300/300576d4d1e29e3d078fd9304e1b6a3d.jpg", "website": "https://www.colorhuntgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Petty Vindictive Games"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Petty Vindictive Games"], "esrb_rating": null}