{"id": 978118, "slug": "oumuamua", "name": "OUMUAMUA", "name_original": "OUMUAMUA", "description": "<h3>Overview</h3>A retro-flavored Breakout inspired action game with added weaponry! Break all the blocks displayed on the screen without your last ball falling off the bottom of the screen. Stages get harder and more complex as you go along, and some stages have boss enemies so be ready for a fight!<br/><br/>The third installment in the <strong>Game Buddy</strong> series that faithfully recreates the look, sounds, and feel of classic late 80's handheld games in a way that's like experiencing an alternate timeline of gaming history.<h3>Gameplay</h3>Use the ricocheting ball to chip away at bricks and enemies alike, or use your ship's weapons to blast them away directly! Grab falling power-ups to make your ship longer, add more balls to the screen, or even unleash a rapid barrage of laser fire!<br/>Ball getting away from you? Use your ships thrusters to dash to it quickly, or change its trajectory.<br/><br/><strong>Bomb Launcher</strong><br/>Using up and down to aim, use the fire button to launch destructive bombs at blocks and enemies anywhere on the stage!<br/>Replenish your bombs by collecting power-ups, and keep them handy for hard to reach targets.<br/><br/><strong>Quick Thrusters</strong><br/>Use the action button to hurl your ship forward, or combine it with left and right to quickly dash from side to side!<br/>With good timing and quick fingers, you will never miss a clutch item drop or let a ball slip past you due to limited ship speed.<h3>Features</h3><ul><li> Satisfying and addictive game-play with elements of brick beakers and action shooters<br/></li><li> 3 Adjustable difficulty levels<br/></li><li> 125 unique stages across 4 planets and a secret zone<br/></li><li> 8-bit sights and sounds that faithfully emulates the early era of handheld gaming.<br/></li><li> Catchy and nostalgic chiptune music.</li></ul><h3>How to access the menu</h3><strong>To access the game menu and manual, press select button on gamepad or shift key on keyboard.</strong>", "metacritic": null, "released": "2024-03-04", "tba": false, "updated": "2024-03-11T07:55:10", "background_image": "https://media.rawg.io/media/screenshots/4b5/4b535df5b1ecf4f129503fc2da00e371.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["retsuzan"], "genres": ["Action", "Casual"], "publishers": ["Henteko Doujin"], "esrb_rating": null}