{"id": 978104, "slug": "jewelinx", "name": "JEWELiNX", "name_original": "JEWELiNX", "description": "<h3>Game Overview</h3>Break down gems by sorting them pair by pair, or set up <strong>non matching</strong> gems to try and maximizes how many you can break at once!This game encourages <strong>high scoring combos</strong> over simple brick matching, so creativity and combos are king!<br/><br/>A part of the <strong>Game Buddy</strong> series that faithfully recreates the look, sounds, and feel of classic late 80's handheld games in a way that's like experiencing an alternate timeline of gaming history.<h3>Gameplay</h3>Drop like blocks on one another to make them disappear...<strong>But</strong>! Don't do it too simply, or you'll incur a block penalty! Avoid the penalty and get the most points by dropping gems in a way they'll chain off each into an avalanche of gems and points!<br/><br/>Two becomes four, four becomes eight...<br/><strong>how high of a combo can you make?</strong><br/><br/><strong>GAME-A</strong><br/>Use endurance and imagination in this mode to seeing how long you can keep stacking and how big of a combo chain you can make! All scores are accumulated and can be used to unlock a wide variety of new types of blocks.<br/><br/><strong>GAME-B</strong><br/>Start with a set number of blocks, and try to destroy them all before your screen becomes overrun! Adjust the stage and/or difficulty of either mode for added challenge!<h3>Features</h3><ul><li>puzzle game-play that encourages quick foresightful thinking.<br/></li><li>8-bit sights and sounds that faithfully emulates the early era of handheld gaming.<br/></li><li>Six different types of block skins to unlock.<br/></li><li>two game modes, four difficulty levels, and five stages to choose from.<br/></li><li>Catchy and nostalgic chiptune music.</li></ul><h3>How to access the menu</h3><strong>To access the game menu and manual, press select button on gamepad or shift key on keyboard.</strong>", "metacritic": null, "released": "2024-03-04", "tba": false, "updated": "2024-03-11T07:28:11", "background_image": "https://media.rawg.io/media/screenshots/149/14979227b815225f6c8bd722093befaa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["retsuzan"], "genres": ["Casual"], "publishers": ["Henteko Doujin"], "esrb_rating": null}