{"id": 978143, "slug": "andarin-weppes-pre-dementia", "name": "Andarin Weppes: Pre-Dementia", "name_original": "Andarin Weppes: Pre-Dementia", "description": " <br/><br/>Step into the tangled mind of a dementia patient as he visits the house of his late grandpa, who also suffered from the ethereal embrace of dementia. Witness your perception warp, gravity surrender its grasp and the very essence of space and time tumble into a puzzling dance as your advancing dementia twists your reality into the unfamiliar.<h3>Pre-Dementia</h3><br/>Play through <strong>6 levels</strong> and acquaint yourself with the early stages of dementia where your illness only mildly affects your mind. You'll notice and have to overcome subtle anomalies in your environment. Explore as much of the house as you can and get familiar with the environment before your illness starts affecting you more severely.<h3>Key Features</h3><br/><ul><li><strong>A Surreal Dwelling:</strong> Explore a once-familiar house now shrouded in the mystique of dementia. Traverse its non-Euclidean environments, where up and down lose meaning, and rooms meld in perplexing arrangements.<br/></li><li><strong>Unravel Puzzles:</strong> Engage your mind in solving intricate puzzles scattered throughout the enigmatic abode. Each riddle holds a piece of the profound story that connects memories, dreams, and reality.<br/></li><li><strong>Journey Through Memory:</strong> Witness the convergence of memories and delusions as you venture deeper into the shifting chambers of the mind. Experience the blurred boundaries between lucidity and illusion.<br/></li><li><strong>Ambiguous Reality:</strong> Embrace the uncertainty. Prepare to question what is real and what is not, as the lines between reality blur.</li></ul><br/><br/><br/><ul><li><strong>Rewind:</strong> Fear no more from mistakes of the past.<br/><br/><br/><br/>Prepare your mind for a symphony of illusions and truths, and immerse yourself in a journey where the journey and the destination are an enigma. Dare to tread the paths that defy reason and embrace the boundless realm of a dementia inflicted mind. Step forth into the mysteries of Andarin Weppes:Pre-Dementia and uncover the surreal truth that awaits within.</li></ul>", "metacritic": null, "released": "2024-03-04", "tba": false, "updated": "2024-03-11T08:55:44", "background_image": "https://media.rawg.io/media/screenshots/4c2/4c2d9cfb30ffda5bb13f793067af0e6a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 251, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["mötiv"], "genres": ["Adventure", "Indie"], "publishers": ["Next in Game"], "esrb_rating": null}