{"id": 978166, "slug": "spellbound-fps", "name": "Spellbound FPS", "name_original": "Spellbound FPS", "description": "In this first-person role-playing game, you play as Damitri (the lead character of the Spellbound book series). He shoots snowballs and icicles from his hand representing his ice magic abilities. The player has a companion, Laura. She has abilities relating to sound. She can scream to destroy enemies or sing to heal the player. Eventually, two more characters join the party. The pause menu is a 2D still image of the characters frozen in time. A character with abilities relating to time and space assists the player by pausing time, reversing time either back to the beginning of the level, or the entire game.<br/>\r\nIn first person mode, the player will run as Damitri shooting as many snowballs and icicles at enemies such as zombies, mummies and possessed New Heat Guards. A character bio exists within the main menu. This gives is where most of the lore and backstories of the characters exist. <br/>\r\nThere are two other game play modes. The player will have a third person view of a rock creature that the player can control. A second racing/chase level exists with the player controlling a vehicle powered by fire magic in third person mode.<br/>\r\nOccasional cutscenes show the player's location and any bosses or obstacles that may exist in the scene.<br/>\r\nSome levels prevent you from pausing. This is due to the person with time and space magic being incapable of assisting in these locations.<br/>\r\nThe player can heal infinitely with the help of their companion. Although, a Game Over is very possible in areas of highly littered enemies.", "metacritic": null, "released": "2024-03-04", "tba": false, "updated": "2024-03-11T09:34:03", "background_image": "https://media.rawg.io/media/screenshots/f04/f04ff4ceaaec95ff865a32b33677248b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zach Wise"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Zach Wise"], "esrb_rating": null}