{"id": 978169, "slug": "game-of-seduction", "name": "Game of seduction", "name_original": "Game of seduction", "description": "<h3>◇Feature System：</h3> <br/>◇Enable Full CG Mode in the environment settings - Free browsing of HCG (adult content).<br/>◆Stress-free operation design - Quick text skipping system.<br/>◇Provide comprehensive walkthrough hints.<br/>◆Display affection level and SM value.<br/> <br/><h3>◇ Story:</h3>In my mind, two ideas emerged. First, I would submit to her and make her fall for me before reversing the situation. Once a woman is in love, she becomes blind and unaware.<br/>Especially for a successful career woman like her, I can imagine that her emotional life would likely be turbulent if she weren't involved with a male M. It's possible that even a submissive male M wouldn't be able to tolerate her.<br/>Making a woman like her fall in love with me would be easy.<br/>「Don't think you can just let last night's incident go like that.」I declared to her.。<br/>「Hehe... So what? Are you trying to threaten me with that? If I don't agree, are you going to expose that Zilin Fan as a sadist? Or have your dad fire me?」<br/>「Do you think I'm afraid of such things?」<br/><br/><br/><br/>「You've successfully provoked me, little brat. Since you want me to blur the boundaries, I'll grant your wish. I'll play along with you as ‘Princess.’」<br/>「Come on, how do you want me to play with you? Little brat.」<br/>She pressed her high-heeled shoe onto my shoulder, causing a sharp pain that sent a rush of heat through my veins. I stared at her arrogantly defiant expression, and I became aroused.<br/>「Come on, behave like a dog and please me. I'll play with you.」<br/><br/><br/><br/>★Sound effects thanks to the following<br/>■甘茶の音楽工房<br/>■DOVA-SYNDROME<br/>■くらげ工匠<br/>■魔王魂<br/>■Moon☆Wind<br/>■MusMus<br/>■ニコニ・コモンズ<br/>■ノスタルジア<br/>■On-Jin ～音人～<br/>■OtoLogic<br/>■ポケットサウンド<br/>■小森平<br/>■ユーフルカ", "metacritic": null, "released": "2024-03-05", "tba": false, "updated": "2024-03-11T09:52:44", "background_image": "https://media.rawg.io/media/screenshots/110/110914dee13eb06838e819d379644eeb.jpg", "website": "https://www.facebook.com/playmeowGame", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 500, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["maratan"], "genres": ["RPG", "Simulation", "Casual"], "publishers": ["Playmeow", "ACG creator"], "esrb_rating": null}