{"id": 978282, "slug": "valley-of-shadows-2", "name": "Valley of Shadows", "name_original": "Valley of Shadows", "description": "<h3>Life is like a videotape, where colors and sounds are imprinted on the blank tape, old memories can be revisited again and again, and the dull part of the story can be fast-forwarded. But, someone always presses the STOP button.</h3><br/><h3>Overview:</h3><strong>Valley of Shadows</strong> is a short psychological horror game set in an ordinary American suburb. The story follows a regular family man named James, whose life takes an extraordinary turn when he returns home late at night after a hard day's work, only to find his house empty and his wife and daughter mysteriously vanished. A cryptic videotape left by an unknown visitor on the doorstep sets the stage for a chilling adventure.<br/>As James attempts to unravel the mystery of his missing family, he is plagued by a sense of paranoia and the eerie feeling that he is constantly being watched. Paranormal forces turn his reality into a living nightmare, as he navigates through the unsettling environment, trying to piece together the clues left behind.<br/><br/><h3>Key Features:</h3><ul><li>    Built on Unreal Engine 5, creating an immersive and atmospheric environment with photorealistic graphics.<br/></li><li>    Experience a \"walking simulator\" gameplay style, enriched with easy puzzles that enhance the storytelling.<br/></li><li>    Valley of Shadows focuses on atmospheric psychological horror, prioritizing a lingering atmosphere of terror over cheap jumpscares.<br/></li><li>    The game offers a concise narrative, with approximately 30 minutes of gameplay, perfect for a spine-tingling evening.</li></ul><br/><br/><br/><strong>Prepare to delve into the eerie unknown in Valley of Shadows, where every shadow hides a deeper darkness, and the line between the ordinary and the nightmare blurs.</strong>", "metacritic": null, "released": "2024-03-07", "tba": false, "updated": "2024-03-11T13:37:39", "background_image": "https://media.rawg.io/media/screenshots/e78/e78335e9349b81c9abd1e9c9c3d10f80.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BadTaste Studio"], "genres": ["Adventure", "Indie"], "publishers": ["BadTaste Studio"], "esrb_rating": null}