{"id": 97823, "slug": "rapatu", "name": "Rapatu", "name_original": "Rapatu", "description": "<p>Submission for the Unreal Engine 2018 Spring Game Jam<br/></p>\n<p>Team Name: Perkerakia</p>\n<p>Game Name: Rapatu</p>\n<p>Game Description:</p>\n<p>Rapatu is an Isometric Hot-Seat Multiplayer Arcade Game.</p>\n<p>A band of warriors that consists of a Rock, Paper and Scissors embarked on a perilous treasure hunt on a remote Island. A paradise full of life and vivid colors. What had seemed like an exciting adventure, ended up being a game of survival where everyone is both the Hunter and the Prey. The countless dangers that were once hidden are now lurking out of the shadows. Deadly traps, weird mechanisms, even the Island itself is transforming into something obscure that will devour every last hope.</p>\n<p>In this Free-For-All \"arena\" you will have to survive the ever-changing environment that besides its threats, it is also offering a few perks and advancements to those who seek a bit further. On the other hand, you will have to fight against your old allies and survive their shape-shifting abilities. The Prey becomes the Hunter and vice versa.</p><p>Your main goal is to amass the largest fortune. Gather coins or even steal them from your enemies by hitting them. Keep in mind that the Timer is ticking... no pressure.<br/></p>\n<p>Controls</p>\n<p>• Player 1 - Rock -&gt; <strong>WASD</strong> - Movement</p>\n<p>• Player 2 - Paper -&gt; <strong>IJKL</strong> - Movement</p>\n<p>• Player 3 - Scissors -&gt; <strong>Arrow Keys</strong> - Movement</p>\n<p>(* You can use an Xbox Controller as well)</p>\n<p>List of Pre-Jam Assets:</p>\n<ul><li>Soundly - All the SFX are taken from Soundly</li><li>Music - We are using \"Artifact\" by Kevin MacLeod (Licensed under Creative Commons: By Attribution 3.0 License)</li><li>Substance Share - We are using a few Textures (normals etc) from Allegorithmic’s Free Exchange Platform</li><li>LUT Textures - We are using 2 Textures from the Free LUT Tables Pack found on the UE4 Forum</li></ul>\n<p><strong>The rest of the Assets/Blueprints/Etc were created by us during the Game Jam</strong></p>", "metacritic": null, "released": "2018-05-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/837/837fcce4cda842992267472e51a6a7d9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Autocrator", "xkonstantinos", "cubosaur"], "genres": ["Action"], "publishers": [], "esrb_rating": null}