{"id": 978220, "slug": "witches-wishes-and-whispers", "name": "Witches Wishes and Whispers", "name_original": "Witches Wishes and Whispers", "description": "Morgana needs help to craft potions for this season! Play through 7 boards with multiple randoms to assemble ingredients to craft 25 unique potions! All levels can be solved by pure logic. <br/><br/>Witches Wishes and Whispers is a \"Einstein\"-style elimination puzzle where you sort ingredients to make potions. Based on the card clues, you must pick the correct ingredients so all the clues remain true!<br/><br/>The goal is to solve each board by figuring out the correct placement of ingredients in each cell. Each board will have two or more ingredients in each cell to start with. You must solve each board by figuring out which ingredient should be placed in each cell using the clues on the right side.<br/><br/><br/>You can follow the clues by Elimination or Deduction. By elimination you remove objects using Right-Click until one ingredient is alone in the cell (it will pulsate) indicating it is the correct ingredient. Left-Click to fix it on the cell.<br/><br/><br/>By deduction you will know for sure a certain ingredient is on a cell because all other possibilities have been eliminated.<br/><br/><br/>In any case, when the object is selected for a specific cell, it gets bigger and fixed for that cell.<br/><br/><br/><br/>Key Game Features <br/><br/>7 unique boards!<br/>Multiple randoms for each board!<br/>100% solvable by logic!<br/>Reveal 25 hilarious potions!", "metacritic": null, "released": "2024-03-06", "tba": false, "updated": "2024-03-11T11:29:45", "background_image": "https://media.rawg.io/media/screenshots/096/096840b6eb75a973253053b854d63a68.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Seven Sails Games"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Seven Sails Games"], "esrb_rating": null}