{"id": 978284, "slug": "anchors-blockade-zoneprologue", "name": "Anchors Blockade Zone:Prologue", "name_original": "Anchors Blockade Zone:Prologue", "description": "<strong>Difference between Prologue and Official Edition<br/>Prologue opens up a map</strong><br/><strong>Anchor: Blockade Zone game, is a collection of gun modification, exploring the map, death drop equipment of the Cthulhu theme 2D pixel style shooter. The game puts you in the role of an agent who enters a blockade zone to investigate with the aim of finding out the cause of the strange events in the blockade zone. Your character is trapped in the blockade and has to search for food, water and other supplies in order to survive, as well as completing quests to gather information and find the truth. In the process, don't be too surprised to encounter anything unnatural, whether it's going back in time or to the future. </strong><br/><br/><br/><br/><strong>Experience exhilarating shooting, fight sworn battles with hostile agents, Kraken monsters, and more, and beat the truth out of the world with the weapons in your hands! Poor for tactical penetration, rich for fire coverage, it's all up to you! </strong><br/><br/><br/><br/><strong>We strive to make you feel the thrill of 2d shooting, so that you can feel the real shooting experience.<br/>Up to hundreds of gun accessories, allowing you to freely remodel your exclusive weapon! </strong><br/><br/><br/><br/><strong>Recruit agents for your exploration operations and train them to grow into excellent agents to help you complete various missions and search various maps.<br/>Each exploration map is a repeated horizontal jump across the edge of life and death for agents, with different maps having different chances of resulting in an agent's outright death. </strong><br/><br/><br/><br/>Explore the map carefully and make sure your agent gets back to base safe and sound every time.<br/><strong>If an agent is unlucky enough to die or return to the city with serious injuries, the items he is carrying and searching for will be dropped with him. Only items placed in the safe will be retained. </strong>", "metacritic": null, "released": "2024-03-08", "tba": false, "updated": "2024-03-11T13:41:37", "background_image": "https://media.rawg.io/media/screenshots/71e/71ecd3b49c5874adb5a449d871762eaa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 11}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 352, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Welike"], "genres": [], "publishers": ["Welike"], "esrb_rating": null}