{"id": 97829, "slug": "crowded", "name": "Crowded", "name_original": "Crowded", "description": "Crowded - Overview (v1.1)<br/><p><strong>Crowded</strong> takes place in an elevator, which is all the world the Operator, you, knows.</p><p>Navigating through the flux of Suits using the lift, you'll have to keep its ecosystem friendly, agreeable and healthy for everybody.</p><p>The Suits will express needs, things they want to get close to, or get away from. It is your job to grab the Suits and navigate them where they want to be, before stress gets to their head. They have a bad tendency to explode when stressed out.</p><p>Ride the elevator as high as you can!</p>How to play<p><strong>Controls:</strong></p><p>Move around the lift with WASD or the arrow keys.</p><p>Grab a Suit by pressing and holding the spacebar.</p><p><strong>Gameplay:</strong></p><p>Suits will enter and exit the Lift as they see fit. </p><p>When a Suit holds a green heart sign, bring the Suit close to the item present on the sign.</p><p>When a Suit holds a red cross sign, bring the suit far from the item present on the sign.</p><p>A Suit that has an unfulfilled need will get more and more stressed, leading to the dreaded explosion.</p><p>Try to reach the highest floor!</p>Links<ul><li>Windows (looks prettier)</li><li>Ludum Dare page</li></ul>Post Release updates<ul><li>Fixed QWERTY input</li><li>Fixed a weird light</li></ul>Credits<ul><li>The V10 team (Damien, Guillaume, Marc, Antoine)</li><li>Some audio produced by Dillon Becker, performed by Alex Brodie, Ian Lampert, Sean Lenhart.</li><li>Other audio effects by klangfabrik, davidbain, mikala oidua, rhodesmas, thezero and midfag.</li></ul>", "metacritic": null, "released": "2017-04-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/479/47982e97f40d0fc5303e9bbb83f5352a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Toone"], "genres": [], "publishers": [], "esrb_rating": null}