{"id": 978263, "slug": "broken-world-2", "name": "Broken World", "name_original": "Broken World", "description": "\"Broken World\" is an exciting adventure in the post-apocalypse world, where players will have to survive in a dangerous environment inhabited by zombies and other threats. At the same time, players must build and strengthen their shelters to protect themselves from attacks and provide the necessary resources for survival.<br/>\n<br/>\r\nFeatures of the game:<br/>\n<br/>\r\nThe style of low-poly graphics creates a unique atmosphere of the post-apocalyptic world, and also allows smooth operation even on weak devices.<br/>\r\nThe game world comes to life thanks to a dynamic day and night system that changes the landscape and the level of danger.<br/>\r\nAbility to build and strengthen shelters using various materials and tools such as wood, metal, stone and others.<br/>\r\nA variety of enemies, including zombies of different types, bandits, mutants and other dangers that can attack your hideout.<br/>\r\nCraft and create the necessary items, weapons and defenses to survive in a dangerous world.<br/>\r\nThe ability to play in both single-player and multiplayer modes, interacting with other players, exchanging resources and helping each other in the fight for survival.<br/>\r\nA variety of tasks and missions that will help players develop and immerse themselves in the exciting plot of the post-apocalyptic world.<br/>\r\n\"Broken World\" is designed to captivate players with its exciting gameplay, atmosphere and the ability to independently influence the development of your character and the world as a whole in a post-apocalyptic environment.", "metacritic": null, "released": null, "tba": false, "updated": "2024-03-11T12:54:01", "background_image": "https://media.rawg.io/media/screenshots/ceb/ceb5434f07b8a734ada1e2449890461b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hunt Studio"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["Hunt Studio"], "esrb_rating": null}