{"id": 9782, "slug": "deceit", "name": "Deceit", "name_original": "Deceit", "description": "<p>Deceit is a six-player multiplayer horror game developed by Automaton.</p>\n<h3>Gameplay</h3>\n<p>Deceit is heavily influenced by the Trouble In Terrorist Town Half-Life 2 mod. All six players spawn on a vast map, with several of your group being infected with a virus that allows them to transform in their terror form. The players have to figure out who is infected, kill them or at least attempt an escape. </p>\n<p>Most of the time, the map is lit up by portable lamps and projectors, yet there are blackout periods that last several minutes. During these periods, the infected players can transform into the terror form in which they become faster, stronger, and have night vision. They can only be countered using light. </p>\n<p>For the non-infected players, there are several objectives placed around the map, like turning on the generators, finding light sources or weapons. These objectives both increase the chance of player survival and sometimes allow the players to escape off the map. </p>\n<p>The gameplay heavily relies on its psychological component with the maps being designed in a way to place a seed of doubt in the players&#39; heads. The players have to decide with whom they&#39;d want to stay close to or leave behind. It is necessary to display your intentions correctly, so the game features an emote system, which allows the players who do not have a microphone to interact with the others.</p>", "metacritic": null, "released": "2017-03-03", "tba": false, "updated": "2024-04-16T14:08:38", "background_image": "https://media.rawg.io/media/screenshots/ff5/ff594fc8b1ada40fe2ae9a5d549dc197.jpg", "website": "http://www.playdeceit.com/", "rating": 2.97, "rating_top": 3, "added_by_status": {"yet": 143, "owned": 2809, "beaten": 46, "toplay": 17, "dropped": 281, "playing": 10}, "playtime": 2, "achievements_count": 14, "ratings_count": 400, "suggestions_count": 318, "game_series_count": 0, "reviews_count": 402, "platforms": ["PC"], "developers": ["Automaton"], "genres": ["Action"], "publishers": ["Automaton"], "esrb_rating": null}