{"id": 978241, "slug": "fountain-2", "name": "Fountain", "name_original": "Fountain", "description": "        \"Fountain\" is a turn-based tactic roguelike game. Player leads a squad of up to 7 members entering a constantly changing barrier. In this mysterious adventure, meet interesting companions, fight against various enemies, collect rare treasures, and reveal the secrets concealed within the barrier.<br/><br/><strong>Features</strong><h3>Space Emphasized Combat</h3>        The combat strategy emphasize on space and position. It includes beat rules on mechanism but not stats, \"Mobility beats Range, Range beats Strength, Strength beats Mobility\". Mobility represents the capability of moving, Range means attack range, Strength is the stat numbers of ATK/DEF. In addition, there are plenty of space synergy elements. Factors like formation, distance and move path will have significant impact on combat. These can bring new perspectives of strategy. Try to make use of beat rules and space synergy to get victory!<h3>Rich Variety Of Levels </h3>        Each level has competely different randomized landscape. Whether it is plain, forest or rocky ground, it will have a significant impact on Mobility, Range and Strength, requiring players to rethink their strategies. In addition, fog may appear in level. Be more cautious when facing the mist with full of danger. Luckily, enemies have no god perspective. They also needs exploring in the fog. Try to see who is more adaptable to the fog? And especially, the enemy and the player use the same units and equipments. Because Fountain was designed to be a PVP game at first. Although it has become PVE, we still look forward to using our various builds to have some fun duels with players.<h3>Collect Companions, Then Lost Them?</h3>        In addition to common units, there are several heroes who can join the team and fight together. Heroes can level up and gain unique abilities, and as captain they can bring different abilities to the team. In new run, there is a chance to reunite with hero companions who you met before, and they will retain all the abilities they had when they were separated last time. This means that the team gains great immediate combat power to face later levels with greater challenges. Although reunions are a matter of chance, clues can sometimes be found in level. They will lead you to reunite with your companions again.", "metacritic": null, "released": "2024-03-06", "tba": false, "updated": "2024-03-11T12:06:55", "background_image": "https://media.rawg.io/media/screenshots/8df/8df0c9005cc4cf31cde343edde616f15.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Tiny Tiger Games"], "genres": ["Strategy", "Indie"], "publishers": ["Tiny Tiger Games"], "esrb_rating": null}