{"id": 978246, "slug": "la-hollywood-zombies", "name": "LA Hollywood Zombies", "name_original": "LA Hollywood Zombies", "description": "--------------  PC &amp; STEAMDECK  -------------- <br/>\r\nThe day of mankind is at fault for being greedy to the world than Anubis`s army of the dead will punished the world for its Greed of Destruction. Death the Reaper spawn the zombie apocalypse, try to survive from this madness with out turning into a zombie not getting touched by the zombies get infection from the dead. Get to the EVAC Point to next area with trying to survive from the dead without getting infected. Use vehicles to destroy the dead to survive the Anubis`s army of the dead, Apocalypse!? <br/>\n<br/>\r\n*Reboot Remix game of alike (House of the Dead/Time Crisis/Call of Duty) Fusion mixed game with Shock Support Gamepad - STEAMDECK Handheld controller.<br/>\n<br/>\r\n* Select as four human characters to battle save the world from extinction from Anubis`s army of the dead that world released from the worlds greed. <br/>\n<br/>\r\n* Use combat weapon with high power laser to defeat Anubis`s army of the dead with Death the Reaper helping out caring out plan Apocalypse!?<br/>\n<br/>\r\n* Follow the Checkpoints to Evec point without dying from the dead, if so you start all over again from start of level.<br/>\n<br/>\r\n* Fly Helicopter to defeat boss fight, and use vehicle attack enemy`s to escape to next area!?<br/>\n<br/>\r\n* Get points for shooting the zombies and gain extra time to your timer by more time to search for the Evec point to escape.<br/>\n<br/>\r\n* Unlock hidden character of light to destroy the final boss save the world?!<br/>\n<br/>\r\n* Find Bonus like (Checkpoint) to unlock riding level Jet Ski, Atv, and Tank race though checkpoints.<br/>\n<br/>\r\n* Players Guide - https://steamcommunity.com/sharedfiles/filedetails/?id=3137391095 <br/>\n<br/>\r\n* DLC - Download Content TBD", "metacritic": null, "released": "2024-03-06", "tba": false, "updated": "2024-03-11T12:16:39", "background_image": "https://media.rawg.io/media/screenshots/fa3/fa33d060a16242b1fc7f9fecc5b9cea2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AXR-STUDIOS"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["AXR-STUDIOS"], "esrb_rating": "Adults Only"}