{"id": 978255, "slug": "anime-girls-sun-of-a-beach", "name": "Anime Girls: Sun of a Beach", "name_original": "Anime Girls: Sun of a Beach", "description": "🌴 Welcome to \"Anime Girls: Sun of a Beach\"! 🌊<br/>\n<br/>\r\nEmbark on an exciting adventure where the captivating aesthetics of anime meet thrilling beach battles against alien crabs. Immerse yourself in dynamic gameplay set on a stunning tropical beach, where every moment is infused with action.<br/>\n<br/>\r\nKey Features:<br/>\n<br/>\r\n🎮 Dynamic Gameplay: Engage in fast-paced action where agility and strategic thinking lead to victory.<br/>\n<br/>\r\n👧 Choose Your Heroine: Select from a diverse cast of anime girls, each equipped with unique abilities tailored to your playstyle.<br/>\n<br/>\r\n🦀 Alien Crab Menace: Confront a variety of alien crabs emerging from the ocean, each posing a new challenge.<br/>\n<br/>\r\n🔥 Epic Boss Battles: Test your skills and firepower in intense clashes against massive monsters.<br/>\n<br/>\r\n🔫 Diverse Arsenal: Access a wide array of weapons, from pistols to RPGs, to devise varied combat strategies.<br/>\n<br/>\r\n🏖️ Tropical Battlefield: Experience thrilling combat amidst the serene beauty of a picturesque beach setting.<br/>\n<br/>\r\nExperience the perfect blend of beauty, action, and strategy in \"Anime Girls: Sun of a Beach.\" With engaging gameplay, a diverse cast, and stunning visuals, this game promises excitement for anime and action game fans.", "metacritic": null, "released": "2024-03-06", "tba": false, "updated": "2024-03-11T12:35:42", "background_image": "https://media.rawg.io/media/screenshots/2be/2befc0990642f3395df2f73186443cd9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 300, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HALVA Studio"], "genres": ["Action", "RPG"], "publishers": ["HALVA Studio"], "esrb_rating": null}