{"id": 978206, "slug": "succubus-life", "name": "Succubus life", "name_original": "Succubus life", "description": "<h3>◆Story Overview</h3><br/>◇ Simulate a Steamy Coexistence with a Succubus!<br/>Embark on a sweet and loving cohabitation journey with the super cute and alluring succubus, \"Noel.\"<br/><br/>From being unexpectedly attacked by Noel to becoming roommates with her (you can change the player's name), cohabitation means... having Noel by your side, always desiring to quench her thirst by consuming your semen, working to earn money for buying lots of adorable new clothes and strengthening the connection between the two of you through conversations and intimate physical encounters (yes, that means making love)♪<br/><br/>How you choose to spend your cohabitation life is up to you, not just limited to \"intimate activities\"! This story offers multiple endings determined by your affection levels with Noel~<br/><br/><br/><br/>◇ Completing the game will take approximately 4-5 hours!<h3>◆Game Features</h3><br/>◇ Role-Playing with Costume Changes<br/>Get ready to enjoy various role-play scenes with a wide variety of costumes you can purchase with your hard-earned money! Anticipate:<br/>・ Noel in her seductive swimsuit<br/>・ Gothic Lolita outfits<br/>・ Maid costumes<br/>...and more! Dress her up in your favourite outfits for the most exciting moments of passion! There are a total of 7 costumes waiting for you to collect!<br/><br/>◇ Basic CG: 22 varieties<br/>◇ Animated CG: 5 varieties<br/><br/><br/><br/>Every corner of your home becomes a playground for passion during cohabitation!<br/><br/>Living with a succubus is truly a thrilling experience!<br/>You can indulge your desires anytime, anywhere, without constraints, following your heart's desires!<br/><br/>After H events, the intimacy level rises, and Noel's satisfaction increases as well. If you continuously keep Noel hungry, you might just be attacked (one-way, consensual H events )!<br/><br/><h3>◆Preview of H events</h3><br/>I helped Noel buy a super cute special outfit...<br/>\"This is a maid-made herbal tea♪,\" Noel said joyfully. Though my instincts hinted it wasn't that simple, I hesitated for a moment and took a sip... little did I know, it was herbal tea laced with a powerful aphrodisiac! Its effect was so potent that my manhood immediately sprang to life.<br/>Noel mentioned she would take care of my aroused member with her maid-style fellatio and succubus tail service.<br/>And then... Her oral advances pleasured me until I reached climax...<br/><br/>◇ The game's distinctiveness lies in events like these costume-changing HCG scenes and various cohabitation stories with the succubus who loves indulging in passion.<br/><br/><br/><br/>⚠️Notice⚠️<br/>If changing the language causes problems with the archive, simply delete the archive.<br/>Here's how to do it.<br/>1. Click on Gear/Manage/Browse Local Files.<br/><br/><br/><br/>2. Delete the entire [Save] folder.<br/><br/>", "metacritic": null, "released": "2024-03-06", "tba": false, "updated": "2024-03-11T10:58:30", "background_image": "https://media.rawg.io/media/screenshots/b90/b90920bfbd47ec8bbd353c45619fed32.jpg", "website": "https://www.facebook.com/gaming/playmeowGame", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EXAMGAMES"], "genres": ["RPG", "Simulation", "Casual"], "publishers": ["Playmeow"], "esrb_rating": null}