{"id": 978323, "slug": "farmer-survivors", "name": "Farmer Survivors", "name_original": "Farmer Survivors", "description": "Explore rural life in a completely new way with Farmer Survivors, an exciting Arcade Survivor game that puts you in the shoes of a brave farmer facing a bug infestation on their farm. Get ready for a gaming experience filled with challenges, skills, and plenty of action!<br/><br/><strong>Farmer Survivors is an arcade survival game where you must withstand endless waves of insects hungry for your harvest. How long can you endure?</strong><br/><br/><h3>Automatic Targeting:</h3> Don't worry about aiming; the game's automatic targeting system automatically focuses on the nearest enemy, allowing you to concentrate on survival strategies.<br/><br/><h3>Rising Challenge:</h3> The waves of insects become increasingly stronger and numerous, testing your skills and resilience at every moment. There are 4 seasons you can unlock as you progress through the waves!<br/><br/><h3>Farm Environment:</h3> The farm is the perfect setting for the epic battle that unfolds. Immerse yourself in rural life as you defend your precious crops. Face a variety of enemies, all based on typical farm insects. Some of them even launch projectiles, keeping you on your toes!<br/><br/><h3>Strategic Choices:</h3> At the end of each wave, you'll have the opportunity to choose items that can aid you on your journey. Make wise choices as they may be the key to your survival! Unlock and upgrade a wide range of abilities with unique effects to aid in your fight against the insects.<br/><br/><h3>Weapon Diversity:</h3> Choose from a variety of weapons, each with unique passives, and discover which suits your playstyle best. Each game is unique, thanks to randomness in the distribution of items and abilities. You never know what surprises the farm holds for you!<br/><br/><br/><br/>Get ready for an epic battle for survival in the countryside with Farmer Survivors. Put your skills to the test, make strategic decisions, and defend your farm against the invasion of hungry insects. Are you ready to be the rural hero the farm needs?", "metacritic": null, "released": "2024-03-07", "tba": false, "updated": "2024-03-11T15:11:51", "background_image": "https://media.rawg.io/media/screenshots/8f6/8f6c3ee85c2b85b4cb4cb6e4b5a63e88.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Afil Games"], "genres": ["Action", "Adventure", "Strategy", "Casual", "Indie"], "publishers": ["AFIL Games"], "esrb_rating": null}