{"id": 978316, "slug": "wwe-2k24", "name": "WWE 2K24", "name_original": "WWE 2K24", "description": "FORTY YEARS OF WRESTLEMANIA<br/><br/>WrestleMania is the biggest event in sports entertainment, where Superstars become WWE Legends. Experience a gripping retelling of WrestleMania’s greatest moments in 2K Showcase of the Immortals, where you can relive a collection of some of the most unforgettable, career-defining matches.<br/><br/>AN ICONIC ROSTER<br/><br/>WWE 2K24 boasts a star-studded roster featuring WWE Legends like “Stone Cold” Steve Austin, Undertaker, and Andre the Giant, alongside current WWE Superstars like “The American Nightmare” Cody Rhodes, John Cena, Rhea Ripley, and Roman Reigns, whose larger-than-life entrances and signature moves are heightened by ultra-realistic graphics.<br/><br/>NEW MATCH TYPES<br/><br/>From Guest Referee to Casket, Gauntlet, and Ambulance matches, there are a bevy of new match types to experience in WWE 2K24, including support for multiple Superstars in Backstage Brawl.<br/><br/>PROVE YOURSELF IN MyRISE<br/><br/>Unleash your raw talent and become the undisputed champ in MyRISE, featuring two thrilling career arcs and original storylines chronicling your ascent to WWE stardom from the men's and women’s divisions.<br/><br/>BUILD YOUR FACTION<br/><br/>Assemble your favorite WWE Superstars and Legends in MyFACTION. Acquire cards, build a dominant faction, compete in online multiplayer and the all-new ranked quickplay. Plus, earn exciting promotional and final rank rewards as you climb the new seasonal leaderboard!<br/><br/>CONTROL THE WWE UNIVERSE<br/><br/>Develop feuds, weekly shows, and more in Universe mode, WWE 2K24’s ultimate sandbox, with expanded rivalry actions, all-new cutscenes, and support for double-title matches!<br/><br/>CALL THE SHOTS IN MyGM<br/><br/>Oversee the biggest brands and Superstars in sports entertainment as you challenge rival general managers for the top spot in MyGM. Explore more match types, more brands, and new general managers. Trade Superstars between brands, make executive decisions on contracts, and amp up the drama.<br/><br/>**Online play including MyFACTION requires an internet connection and 2K Account. Terms apply.", "metacritic": null, "released": "2024-03-07", "tba": false, "updated": "2024-03-11T15:00:04", "background_image": "https://media.rawg.io/media/screenshots/1d8/1d893a5291d5e7f032cd0fa3bb62c6d7.jpg", "website": "https://wwe.2k.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Visual Concepts"], "genres": ["Simulation", "Sports"], "publishers": ["2K Games"], "esrb_rating": "Mature"}