{"id": 978381, "slug": "moviestarplanet-2-star-life", "name": "MovieStarPlanet 2: Star Life", "name_original": "MovieStarPlanet 2: Star Life", "description": "MovieStarPlanet 2 is rolling out the Hollywood red carpet! We are ready to welcome the biggest stars in town, come and join the fun! Create your avatar TODAY and explore a new world of fun, fashion, friends, fame and fortune all for FREE!<br/><br/>Be a part of the world’s largest social media dress up game for fashionable teens and tweens. At MovieStarPlanet 2 you are always among friends. Chat and hang out with them all at amazing locations or just invite them for a stunning makeover at your fabulous new home. <br/><br/>MovieStarPlanet 2 is a safe, creative and social online playground for children. Dress up and style your own Hollywood style movie star character and then earn Fame and StarCoins, the currency of MovieStarPlanet 2. StarCoins can be used to buy designer costumes, colorful animations and eye-catching backdrops to create your own distinctive style or make your selfies bigger, better and blockbuster!<br/><br/>Everyone can be a star, playing and interacting with friends in the MovieStarPlanet world! Life is never boring on MovieStarPlanet 2 - it's all about playing, being social, developing and showing off your creative skills with dazzling makeovers! Designed with children aged 8 -13 in mind, MovieStarPlanet 2 is for tweens and teens who want to experience a world of fashion, fame, fortune and friends.<br/><br/>Design your own avatar and be who you want to be, let your creativity loose! Become a shining Hollywood style star today and find out how much fun, fashion, fame and fortune can be! Meet exciting new friends or just hang out with your old friends, go shopping, find that perfect look with a stylish makeover, dress up in designer clothes and so much more.<br/><br/>Be the world’s best social media influencer and show everyone how it’s done. Join the other celebrities at the VIP Club and show off your moves on the dance floor or be the coolest DJ Hollywood has ever seen!<br/><br/>Get ready to hit the shops on a shopping spree and find the latest in teen fashion and accessories. Create your own unique look, dress up and become the fashion designer of your dreams! Snap a cool selfie in the studio and share it with other MovieStars.<br/><br/>Rise to stardom, go fully Hollywood and become a celebrity on MovieStarPlanet 2! Express yourself with a stunning makeover, share your creations, have fun, hang out with your friends, chat and play games.<br/><br/>Download MovieStarPlanet 2 for FREE now. Your adoring fans are waiting for you! <br/><br/>www.moviestarplanet2.com<br/><br/>MovieStarPlanet 2 is a family-oriented game for teens and tweens that has child safeguarding at the heart of what we do. An online game with a social networking aspect, MovieStarPlanet 2 is popular with 8-13 year olds. The game allows children to customise and dress up a movie star avatar then explore a virtual world with a movie star theme. <br/><br/>Children can design artbooks, hang out with friends and play online games. The social networking aspect of the game allows users to use chat rooms to make contact with other users. We are dedicated to games that are fun and safe for everyone, so there are a range of safety features and advice available. <br/><br/>Discover the safety features in MovieStarPlanet 2 here: <br/><br/>https://moviestarplanet.zendesk.com/hc/en-gb <br/><br/>https://moviestarplanet.zendesk.com/hc/en-gb/articles/214480005-Digital-Family <br/><br/>Includes: <br/><br/>Reporting: Alert bad behaviour to moderators by pressing on the yellow triangle. <br/><br/>Moderation: MovieStarPlanet has trained human moderators with tools able to identify keywords not allowed on the site (rude words, personal information, bullying terms). <br/><br/>Blocking: stop another avatar in the game from contacting you or sending you a friend request by clicking the block button, available at all times to users.<br/><br/>Visit our Help Center to read more about how we keep MovieStarPlanet 2 a safe place for kids. <br/>https://moviestarplanet.zendesk.com/hc/<br/><br/>End user license agreement is available here: https://www.apple.com/legal/internet-services/itunes/dev/stdeula/", "metacritic": null, "released": "2020-04-02", "tba": false, "updated": "2024-03-11T17:20:17", "background_image": "https://media.rawg.io/media/screenshots/54a/54a4a8240d6a35444ec630b984fe1158.jpg", "website": "https://help.moviestarplanet.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MovieStarPlanet"], "genres": ["RPG", "Simulation"], "publishers": ["MovieStarPlanet Aps."], "esrb_rating": "Everyone 10+"}