{"id": 978493, "slug": "angler-quest", "name": "Angler Quest", "name_original": "Angler Quest", "description": "Welcome to the fantastical world of Marendum, where giant fish and other aquatic animals are top of the food chain! You play as an Angler, a specialized hunter of these great beasts for the sake of both the common people and the interests of the guild you work for. Fish, craft and battle your way to victory as you move through ranks in the guild and get ever closer to finally beating the dreaded Vermundus, King of the Depths.<br/>\n<br/>\r\nAngler Quest is a monster hunting game inspired by the Monster Hunter series, Souls games and classic turn-based RPGs like Pokemon and Final Fantasy. Hunt fish to get materials, use materials to craft better weapons and armor and experiment with different builds, all while engaging in a strategic combat system in which you must manage your stamina, make every move count and narrowly avoid defeat at every turn.<br/>\n<br/>\r\nGame Features:<br/>\r\n-10 to 15 hours of gameplay with 4 classes to choose from and thus lots of replayability!<br/>\r\n-20 unique aquatic monsters to fight, each the equivalent of a boss encounter in another game + 17 more encounters with variant monsters with new stats, combat styles and gimmicks to overcome.<br/>\r\n-Heaps of armor and weapons to chose from, as well as an armor augmentation system to customize your build and exploit enemy weaknesses!<br/>\r\n-A charming game world and characters.<br/>\r\n-A crafting system for both equipment and much needed items.<br/>\r\n-6 unique maps to explore and find unique fish and crafting materials alike.", "metacritic": null, "released": "2024-03-13", "tba": false, "updated": "2024-03-15T08:28:33", "background_image": "https://media.rawg.io/media/screenshots/e04/e04dfcd742d647dcf7e34c3f14ae0f2d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BDTH Studios"], "genres": ["RPG"], "publishers": ["BDTH Studios"], "esrb_rating": null}