{"id": 978450, "slug": "hellbreach-vegas", "name": "Hellbreach: Vegas", "name_original": "Hellbreach: Vegas", "description": "<strong>Made with passion by a one man dev team:</strong><br/><br/><br/><br/>Hellbreach: Vegas is a wave-based demon shooter, made by Ash, the one-man army behind Infinity Ape Studios. Play as a solo survivor or a team of up to four and face a demonic threat. Set new records as you shoot your way through waves of demons in the neon-lit streets of Las Vegas.<br/><br/><br/>Slay your way through a series of maps, each round more challenging than the last. Earn cold hard cash to upgrade your guns, and unlock other bonuses that will help you survive what’s to come.<br/><br/><br/>Unlock over 19 weapons. Slaughter demons in your preferred style with a combination of modern and futuristic firearms and melee weapons.<br/><br/><br/>What happens in Vegas, stays in Vegas, so you might as well play the slots! Run the 'Win A Weapon' machine for a wide variety of weapons, or try your chances on our 'Spin A Boost' for a power-up. Not done winning? Give the 'Bag A Prize’ or 'Rand A Bang' machines a shot. Are you just looking to unlock those awesome cosmetics? Play our 'Pull A Skull' Machine for a chance to increase your end-game payout.<br/><br/><br/>Endure endless rounds in our 'Survive' mode to see demon bodies pile up and go for a high score. Looking for something more confined? Play on a challenging smaller version of the map in 'Trapped'. Alternatively, just looking to hone your marksmanship? Try 'Gun Pro' instead to train your accuracy with every weapon type.<br/><br/><br/><ul><li> 3 game modes: Survive, Trapped, and Gun Pro.<br/></li><li> 3 maps<br/></li><li> 16 guns<br/></li><li> 3 melee weapons<br/></li><li> 10 perks<br/></li><li> 5 slot machines<br/></li><li> 9 enemy types</li></ul>", "metacritic": null, "released": "2024-03-11", "tba": false, "updated": "2024-03-15T07:04:34", "background_image": "https://media.rawg.io/media/screenshots/ab0/ab06598377a9c7fed47449f5d3a194b2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Infinity Ape Studios"], "genres": ["Action", "Indie"], "publishers": ["Iceberg Interactive"], "esrb_rating": null}