{"id": 978469, "slug": "empyre-earls-of-the-deep-earth", "name": "EMPYRE: Earls of the Deep Earth", "name_original": "EMPYRE: Earls of the Deep Earth", "description": "<strong>Overview</strong><br/><br/>You think the year is 1899, but you seem to have lost your memory. You can confirm you’re on a ship, and you've been told that you're heading for Shanghai. Whatever the truth may be, the only thing you have left is a name: Elias. Who is he? Why is he important? and what does he have to do with your missing past? The only way to find answers is to venture forth, exploring an exotic and unfamiliar land.<br/><br/>EMPYRE: Earls of the Deep Earth is a classic isometric tactical RPG with a story-driven campaign. Taking place before the Great Flood that changed the EMPYRE world, your journey takes you through the land of China at the end of the 19th century. The adventure ahead places you in a new setting where a Neo-Victorian renaissance with science fiction/fantasy twists is taking place! <br/><br/>On your journey, you will visit many strange villages encounter many peculiar characters, and explore mysterious underground locations. Your allies and enemies are intent on guiding you toward an unknown goal. Only time will tell if you have the bravery and ingenuity to survive the search for answers in the final EMPYRE adventure: Earls of the Deep Earth.<br/><br/><strong>Features</strong><br/><br/>- Explore a surreal new landscape with vivid locales and a colorful cast of characters.<br/>- Experience new ways to wage combat with an all new armory of 19th century Chinese weaponry.<br/>- Test your wits against improved enemy AI in battles that will challenge you at every turn!<br/>- Experiment with Ancient Chinese medicines", "metacritic": null, "released": "2024-03-12", "tba": false, "updated": "2024-03-15T07:48:30", "background_image": "https://media.rawg.io/media/screenshots/4ef/4ef950e3ab43dbd91ae58e177320513d.jpg", "website": "http://empyrethegame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 360, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Coin Operated Games"], "genres": ["RPG", "Strategy"], "publishers": ["Work Shift Play"], "esrb_rating": null}