{"id": 978478, "slug": "tribes-3-rivals", "name": "TRIBES 3: Rivals", "name_original": "TRIBES 3: Rivals", "description": "<strong>TRIBES 3: Rivals is a team-based first person shooter that elevates the genre with jetpacks, skiing, and class-based warfare. </strong><br/><br/>Players ski, jetpack, battle, and race to capture the enemy team’s flag, all while ferociously defending their own. Players can choose from unique classes to customize their abilities, perks, and weapon loadouts, while moving across epic terrains from snow covered peaks to haunting deserts. Teamwork, tactics, high speed, and intense combat reign supreme in this rebirth of the world’s fastest shooter.<br/><br/><strong>CAPTURE THE FLAG:</strong> The core of the game lies in its intense team based capture-the-flag mode, demanding individual skill along with strategic team play.<br/><br/><br/><br/><strong>DYNAMIC MOVEMENT:</strong> Jetpack flight and skiing allow unparalleled freedom and fluidity in movement across the battlefield.<br/><br/><br/><br/><strong>STUNNING ENVIRONMENTS:</strong> Navigate beautiful and complex maps from arid deserts to icy mountains, each designed to offer a different gameplay experience.<br/><br/><br/><br/><strong>CLASS BASED WARFARE:</strong> Tailor your character with a wide array of weapons, skins, perks, and abilities, offering endless ways to compete and strategize. Light classes excel in speed, Medium classes offer mobility and firepower, and Heavy classes bring formidable armor and weapons to the fray.<br/><br/><br/><br/><strong>COMMUNITY FOCUSED DEVELOPMENT:</strong> The game is crafted with input from the TRIBES community, ensuring an experience that honors the series' legacy while introducing fresh elements to keep gameplay exciting and engaging. <strong>GIFs created by: chickenNwaffles, Colonel Blair, Howsya.</strong><br/><br/><br/><br/><strong>CUSTOM MATCHES &amp; MODES</strong>: Custom matches allow players to select from a variety of maps, adjust their team sizes, and configure game settings such as player health, energy, thrust, and gravity.<br/><br/><strong>Buy now to experience the world's fastest shooter game, Shazbot!</strong>", "metacritic": null, "released": "2024-03-12", "tba": false, "updated": "2024-03-15T08:05:31", "background_image": "https://media.rawg.io/media/screenshots/f9e/f9ec02c3a75c886d8b32955e4f749a98.jpg", "website": "https://www.tribes3rivals.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 484, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Prophecy Games"], "genres": ["Action"], "publishers": ["Prophecy Games"], "esrb_rating": null}