{"id": 978441, "slug": "dizital-imageclub-neo", "name": "Dizital ImageClub - Neo", "name_original": "Dizital ImageClub - Neo", "description": "Dedicated VR and MR games<br/><br/>Enjoy the H store with a choice of situations in VR (store) or MR (home).<br/><br/>A situation where she is an idol and has loving sex with her.<br/>She accepts everything the player does.<br/><br/>A situation where the company is fired and the president's daughter is kidnapped and confined for sex.<br/>She refuses to kiss him, but when certain conditions are met?<br/><br/>Use the camera and monitor to view the H scene from any angle you like.<br/>Items can be moved to any position by hand.<br/><br/>You can experience a realistic kiss that only a game can provide, which cannot be experienced in a VR movie.<br/><br/>Equipped with voice recognition function<br/>Speak \"Coming\" into the microphone and the sex scene will head toward the finish.<br/>Several other keywords are supported.<br/>Please read the in-game instructions.<br/>You can speak lines from the menu without using the voice function.<br/><br/>Equipped with bukkake function, let's pour a lot of it on them.<br/><br/>Interlocking of vibration of VR controller and electric masturbator<br/>The VR controller vibrates in accordance with the animation. On PC, it also works with an electric masturbator.<br/>(Electric masturbator is limited to PC only.　 Operation has been confirmed with A10 Cyclone SA and The Handy. )<br/><br/>Playable in MR. (PCVR will be green background (Color 0,153,51))<br/>You can adjust the position of the scene and the lighting to fit your room.<br/><br/>In addition to characters, MR can also display beds and restraints.<br/><br/>Other features include the ability to customize the girl, the ability to react when touching or licking the girl, and the ability to remove her clothes by hand,<br/>There are many other elements that enhance the sense of realism.", "metacritic": null, "released": "2024-03-11", "tba": false, "updated": "2024-03-15T06:48:12", "background_image": "https://media.rawg.io/media/screenshots/f77/f777eb95a550a51aaceda867f9e978a5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AhrpuXR"], "genres": ["Simulation", "Indie"], "publishers": ["AhrpuXR"], "esrb_rating": null}