{"id": 978507, "slug": "uootoy-3671", "name": "Uootoy 3671", "name_original": "Uootoy 3671", "description": "The legendary comical action puzzle game 'Uootoy' -- which was first published in the August 1984 issue of I/O Magazine (published by Kougaku-sha), gained popularity on the FM-7, PC-88, and Sharp X1. Now the ultimate evolution has arrived in the form of 'Uootoy 3671'.<br/>\n<br/>\r\nThe objective of the game is simply to arrive at the goal. However, a plethora of obstacles stand in your way. Simplistic yet amazingly varied, every stage is bound to keep you entertained.<br/>\n<br/>\r\nTENTEN-kun, the star of the original 'Uootoy', will be joined by TELTEL-chan. As either the hero or heroine, players can take on all 100 of the original Uootoy's stages. An even greater challenge awaits in the story mode, which contains 100 new stages. A map editor is also included, ensuring many sleepless nights for dedicated players.<br/>\n<br/>\r\nUootoy 3671 features a team of massively talented musicians. WING, whose credits include the 'Mega Drive Mini 2' and previous Mindware titles, has produced the sound system. Junko Ozawa, the legendary Namco composer.<br/>\n<br/>\r\n*  WING, whose credits include the 'Mega Drive Mini 2' and previous Mindware titles, is the producer of the game's sound system.\"<br/>\r\n* Junko Ozawa, the legendary NAMCO composer who has worked on Nintendo classics such as 'Rhythm Heaven' &amp; 'Tomodachi Collection'.\"<br/>\r\n*  Daisuke Shiiba, another fantastic artist responsible for works on 'Rhythm Heaven', 'Tomodachi Collection', and the 'Final Fantasy Pixel Remastered' series.\"", "metacritic": null, "released": "2024-03-13", "tba": false, "updated": "2024-03-15T09:08:57", "background_image": "https://media.rawg.io/media/screenshots/06b/06b96ef31fea818c61c99b3acc5bb739.jpg", "website": "http://www.pinball.co.jp/games/Uootoy/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mindware Co.,Ltd."], "genres": ["Action", "Casual", "Indie"], "publishers": ["Mindware Co.,Ltd."], "esrb_rating": null}