{"id": 978509, "slug": "slime-masters-2", "name": "Slime Masters", "name_original": "Slime Masters", "description": "In Slime Masters, you, as the town protector, are tasked with defending the villagers from hordes of menacing monsters that threaten to overrun the land. As darkness descends upon the world, you must take on the role of a valiant hero, select from a diverse range of characters, and prepare to level up, acquire new powers, and lead the charge against the forces of evil.<br/><br/><h3>Game key Features:</h3><br/><ul><li>Diverse Playable Characters: Choose from a selection of five unique heroes, each with their own distinct stats, weapons, and special abilities. Whether you prefer the swift and agile rogue, the powerful and sturdy warrior, the wise and versatile mage, the precise and deadly archer, or the mysterious and tactical necromancer, there's a hero that will suit your playstyle.<br/><br/></li><li>Character Progression: As you battle through waves of monsters and complete quests, your chosen hero will gain experience points and level up. With each level gained, you'll have the opportunity to customize their abilities, boosting their combat powers and unlocking devastating attacks.<br/><br/></li><li>In-Game Upgrades: Throughout your journey, you'll have access to over 15 in-game upgrades that will significantly improve your hero's combat effectiveness.<br/><br/></li><li>Permanent Upgrades: Beyond the in-game enhancements, the game also offers more than 10 permanent upgrades that will shape the course of your adventure. These upgrades could include character-specific traits, slime improvements, general powers, or other enhancements that will help your heroes survive the challenges they face.<br/><br/></li><li>Quests: Embark on a series of quests that will present you with challenges and allow you to explore the world. From the surroundings of the town to mysterious locations, you will be tasked with defeating monsters and collecting various items to fulfill villagers' needs, earning you unlockables and currency to further improve your heroes.<br/><br/></li><li>Endless Adventure: With a wealth of content and surprises to discover, Slime Masters offers an endless adventure that will keep you engaged for hours on end. The dynamic gameplay ensures that no two battles are the same, making each encounter a unique and thrilling experience.</li></ul><br/>Prepare yourself for an epic journey of bravery and heroism as you face the relentless onslaught of evil monsters. Only through strategic thinking, skillful combat, and the unyielding determination of the chosen hero can the world be cleansed from the malevolent creatures. <br/>Are you ready to defend the town and become the legendary Slime Master?", "metacritic": null, "released": "2024-03-13", "tba": false, "updated": "2024-03-15T09:12:27", "background_image": "https://media.rawg.io/media/screenshots/87a/87a71da55ad750213763987436d78a14.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GlitchStudioGames"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["GlitchStudioGames"], "esrb_rating": null}