{"id": 978506, "slug": "yubu-the-shoeventure", "name": "Yubu: The Shoeventure", "name_original": "Yubu: The Shoeventure", "description": "\"Yubu: The Shoeventure\" is a 3D platformer with a twist - It let's you build your own playstyle with equipable movesets!<br/><br/><br/><br/>Yubu, a brave young Footarian, embarks on a mission to dismantle the Reseller's dominion over the Maibli Isles, using an unexpected weapon: shoes!<br/><br/>In this epic quest, your mission is clear aid Yubu in his battle against the Reseller, a foe seeking to disrupt harmony in the shoeless society of Footaria. With your help, Yubu will navigate challenging platforms, uncover hidden secrets, and unleash his extraordinary shoe-based abilities.<br/><br/><br/><br/><br/><br/>Make Yubu's journey your own with customizable movesets and special moves. Equip different shoe enhancements to alter his abilities. Whether you prefer enhancing agility, boosting jumping power, or a balanced approach, the choice is in your hands. Mix and match these abilities to overcome obstacles and enemies in creative ways.<br/><br/>With each decision, Yubu's skills adapt to your playstyle, making every run through the game unique. Your strategy will determine the outcome of each challenge.<br/><br/><br/><br/><br/><br/><strong>Special Moves for Special Moments</strong><br/>Boost Yubu's agility and power with special move shoe parts. Propel upwards with a burst of water, soar through the skies, or perform high-speed slides into enhanced jumps.<br/><br/><strong>Control the way your shoe hit</strong><br/>Discover shoe parts that do more than complement footwear. Some parts scattered around Maibli Isles can cause explosions upon impact, trap enemies in ice, or release devastating lightning strikes.<br/><br/><strong>Tactical Throwing Mechanics</strong><br/>Master the art of the throw with shoe parts that offer unique throwing patterns. Whether targeting the nearest enemy, a circle pattern, or bouncing off enemies.<br/><br/><strong>Innovative Movement Options</strong><br/>Personalize Yubu with different shoe parts that affect Yubu's basic movements!<br/><br/>Customize your shoe, combine four different attributes and find what suits you!", "metacritic": null, "released": "2024-03-13", "tba": false, "updated": "2024-03-15T09:06:35", "background_image": "https://media.rawg.io/media/screenshots/3dc/3dc9305c5cce7ee4e03c01862251138f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 309, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OTTO Games"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["OTTO Games"], "esrb_rating": null}