{"id": 978543, "slug": "fang-zhi-di-xia-cheng-idle-dungeon", "name": "放置地下城-Idle Dungeon", "name_original": "放置地下城-Idle Dungeon", "description": "The monsters in the dungeon are restless, attempting to occupy the mainland kingdom on earth! Warriors, pick up your weapons and go to the dungeon to eliminate monsters. Victory must belong to brave heroes!<br/>\n<br/>\r\nThis is a Idle game,  a dungeon monster fighting game, and a game that takes your graphics card and computer to work all day. Of course, you don't have to go to work anymore. It's almost all automatic monster hunting. You just need to finish work, have a cup of coffee, and let the computer work automatically. When you go to work, you can turn off your computer and go offline. When you go online again, you will settle the profits from this period and put them in your backpack.<br/>\n<br/>\r\nGame core gameplay:<br/>\n<br/>\r\nNormal Dungeon<br/>\n<br/>\r\nTo unlock the next level, one must pass each level one by one and defeat the monsters on this level. The equipment dropped in each dungeon is different, and after collecting a set of equipment, you need to fight monsters in several dungeons. At the end of every 10 levels, there is a boss level. Winning the defending boss will unlock the next 10 levels of regular dungeons.<br/>\n<br/>\r\nBOSS Tower<br/>\n<br/>\r\nBOSS towers are all dangerous and powerful bosses, including some gatekeepers. Advanced book fragments, monster fragments, boss materials, and more have fallen inside. Defeating one boss will automatically challenge the next boss until you are defeated. Every day, you can challenge countless times and ultimately defeat your boss. If you fail, you can hang better equipment in regular dungeons, strengthen your equipment, and embed gemstones in your equipment.<br/>\n<br/>\r\nInfinite Tower<br/>\n<br/>\r\nThere are both ordinary monsters and boss monsters in the Infinite Tower, which can gain a lot of experience and materials. They will challenge each monster until they defeat you.<br/>\n<br/>\r\nSuit<br/>\n<br/>\r\nThe game provides sets made of BOSS materials, which can also be upgraded to higher-level sets. These sets have special effects and better attributes than ordinary equipment.<br/>\n<br/>\r\nMining<br/>\n<br/>\r\nSometimes, if you need to obtain more gems, you can go to the gemstone mining area for mining, which is also automatically completed. Just collect the following gemstones after a while.<br/>\n<br/>\n<br/>\r\nAs for strengthening, forging, and refining, they are all old ways of playing with equipment and numerical values. It goes without saying that there are too many, and the main focus is on numerical cultivation.<br/>\n<br/>\r\nThere are two types of currency in the game: gold coins and diamonds. Gold coins can be automatically dropped when fighting monsters in dungeons. Just do the task with diamonds and sell the purple equipment in your backpack.", "metacritic": null, "released": "2024-03-14", "tba": false, "updated": "2024-03-15T10:19:48", "background_image": "https://media.rawg.io/media/screenshots/fb6/fb640163f4e1eec0b51131dc9d5c801e.jpg", "website": "http://www.dashugame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MagicJellyGames"], "genres": ["RPG", "Casual"], "publishers": ["MagicJellyGames"], "esrb_rating": null}