{"id": 978534, "slug": "escape-from-andromeda-2", "name": "Escape from Andromeda", "name_original": "Escape from Andromeda", "description": "Escape from Andromeda is an overhead 2D sci-fi spaceship looter shooter based in a procedurally generated galaxy. In Escape from Andromeda, every planet is a level, and every star is a part of your story.<br/>\n<br/>\r\nThe game is currently in an Alpha state. I am still adding new features.<br/>\r\nFeatures currently in the game:<br/>\r\n-A new procedurally generated galaxy is created on each new save<br/>\r\n-All ships and weapons are procedurally generated<br/>\r\n-Intense, top-down ship to ship combat influenced by planet heat (based on closeness to the system star), procedural weapon and ship variety, asteroids, and miniboss events.<br/>\r\n-Complex block-based damage system factoring in projectile type, size, and speed<br/>\r\n-Different ship pieces hold different traits, such as more/less speed, more/less HP<br/>\r\n-Solar system seeds that determine planet size/color and enemy equipment/behavior<br/>\r\n-Breakable asteroids with realistic physics; they can serve as obstacles and cover. You can also push them towards enemies and cause massive damage<br/>\r\n-Space station invasions with procedurally placed turrets, ships and minibosses<br/>\r\n-Ship and weapon marketplaces with procedurally generated assets. You can buy and sell items at these<br/>\r\n-The ability to change ships and weapons<br/>\r\n-Ship and weapon stats UI with easy-to-read statistics indicators<br/>\r\n-Special abilities based on race<br/>\r\n-End-match loot with multiple different weapon rarities<br/>\r\n-A player character with clothing color customization<br/>\r\n-Faction affinity with your chosen faction; you have the option to invade friendly systems but will lose affinity with your faction which affects interactions at space stations<br/>\r\n-A high score system displayed by a reputation bar and status; your high score is saved into the name of your save<br/>\r\n-Heavy metal procedurally generated OST with orchestral backtones that dynamically ramps up and ramps down based on what's going on in the game<br/>\r\n-Shrapnel explosions that can cause collateral kills and killchains<br/>\r\n-Credit management system<br/>\r\n-Fuel management system", "metacritic": null, "released": "2024-03-14", "tba": false, "updated": "2024-03-15T10:02:29", "background_image": "https://media.rawg.io/media/screenshots/007/007cec8c910988a0fe6018eee52462df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["WereFull Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["WereFull Games"], "esrb_rating": null}