{"id": 978521, "slug": "the-scarlet-chaos-2", "name": "The Scarlet Chaos", "name_original": "The Scarlet Chaos", "description": "<h3>Gameplay Features</h3>The Scarlet Chaos is a semi-open world turn based RPG with an immersive and ambient world, dynamic weather, and interactable environments.<br/>Build and customize your party members the way you want to play them, you can decide what they specialize in through specific gear, weapons or Ethermancy skills.<br/>Explore the world to grow your stats, gear and skills.<br/>Survive the nightmare realm. Run or fight your way though to see the next day.<br/><br/>Level up Haerrison's special Mind Stats through actions and consumables to unlock persuasion and intimidation checks in some dialogue.<br/>The core Mind Stats are: <br/><ul><li>Cognition - Can open special dialogue options</li></ul><ul><li>Elder Sight - Can make the Nightmare more hostile or unlock new items/areas</li></ul><ul><li>Perception - Can reveal items and things that normally you wouldn't see</li></ul><br/>More notable gameplay features are:<br/><ul><li>Lockpicking minigames</li></ul><ul><li>Collectable costumes</li></ul><ul><li>Unlockable Fast-travel stations</li></ul><ul><li>Rich exploration</li></ul><ul><li>Rich lore and environmental storytelling</li></ul><ul><li>35+ Quests</li></ul><h3>The World and Story Setup</h3>In the New World of Kelaura, The Scarlet Order have forced their will upon the land by upholding the Order given to them by their God, Nyrataeus, any who oppose their Order are imprisoned or put to death, forbidding all use of Ethermancy and other manipulation of the Ether. <br/>The Order's arrival in Kelaura marked the start of a war with the native tribes across the continent, the Sidaquisi, the Udenvatoi, the Kawadinage and other smaller tribes all fought against the Order until one day, their infamous Lord, Yarlthon, disapeared, and the Order's power was weakened.<br/><br/>Decades later things are at a cold stand still between the Sidaquisi and the Scarlet Order, war is brewing back across the sea to the Order's homeland of Westervale, and corruption runs rampant amongst the Order's ranks.<br/>Detective Haerrison and his partner and wife, Detective Brock, investigate the murder of a local council member which leads to a derelict fortress swathed in cerebral nightmares of The Hat Man, and an encounter with a powerful woman with seemingly supernatural abilities.<br/><br/>https://store.steampowered.com/app/2799970/The_Scarlet_Chaos/", "metacritic": null, "released": "2024-03-14", "tba": false, "updated": "2024-03-15T09:37:58", "background_image": "https://media.rawg.io/media/screenshots/24a/24adae54e078a873ab8bd96d795409f0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Daydreamer"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["DayDreamer"], "esrb_rating": null}