{"id": 978595, "slug": "dadoo-twists-turns-and-mischiefs", "name": "DADOO: Twists, Turns, and Mischiefs", "name_original": "DADOO: Twists, Turns, and Mischiefs", "description": "<strong>DADOO: Twists, Turns, and Mischiefs is a Snake and Ladder Game, with superpowers!</strong><br/><br/><br/><br/>Welcome to the mad, chaotic, and thrilling world of DADOO - a reinvention of the classic Snake and Ladder game that you thought you knew so well! <br/><br/>This is no ordinary multiplayer game. It's a ruthless battlefield where your strategic thinking will be tested. Do not rely on luck, and the only thing that you can trust is yourself. But remember, there's more to this game than simply reaching the top. Enjoy the ride, let the chaos unfold, and don't forget to make the others feel miserable.<br/><br/>So, what are you waiting for? Roll the dice, play your cards, and invite your friend into the pandemonium of chaos. Just make sure you're still friends after playing <strong>DADOO: Twists, Turns, and Mischiefs</strong>.<br/><br/><br/><br/><strong>1. There are Snakes.</strong><br/><br/><br/><strong>2. There are ladders (They are cannons in this gif, tho). </strong><br/><br/><br/><strong>3. More than 20 superpower cards that you can use to attack your enemy (Or defend too!)</strong><br/><br/><br/><strong>4. Cross-platform multiplayer game! Play the game together with your friend on PC and Android smartphone.</strong><br/><br/><br/><strong>5. Oh, each character has their own unique superpower too.</strong><br/><br/><br/><strong>Buy the Steam version of Dadoo and get an exclusive bundle! Unlock a new card and skin with this unique offer.</strong>", "metacritic": null, "released": "2024-03-14", "tba": false, "updated": "2024-03-18T05:54:42", "background_image": "https://media.rawg.io/media/screenshots/d9c/d9ca0b8222c968513d88c097f59b0889.jpg", "website": "https://algo.rocks/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["algorocks"], "genres": ["Strategy", "Casual"], "publishers": ["Algorocks"], "esrb_rating": null}