{"id": 978535, "slug": "soul-shifters-online", "name": "Soul Shifters: Online", "name_original": "Soul Shifters: Online", "description": "WELCOME TO THE EPIC WORLD OF SOUL SHIFTERS: ONLINE!<br/>\n<br/>\r\nExplore a vibrant universe where humans and Daemons collide in an epic battle for supremacy. Uncover the power of assimilation, transforming into powerful Daemons to face unimaginable challenges. Immerse yourself in this electrifying journey, where your courage will shape the destiny of the world.<br/>\n<br/>\r\n---<br/>\n<br/>\r\nINCREDIBLE FEATURES<br/>\n<br/>\r\n- ASSIMILATION: Become a hybrid warrior by absorbing Daemons, using them in combat, each with unique and deadly abilities.<br/>\n<br/>\r\n- TACTICAL DAEMON SWAPPING: Switch between Daemons to face diverse challenges. Swap during battle, choosing the best Daemon for each combat moment.<br/>\n<br/>\r\n- UNIQUE ABILITIES: Evolve your synergy with your Daemon to master up to 1 standard skill, 3 elite skills, and 1 supreme skill for each Daemon. Unleash elemental powers to crush your adversaries.<br/>\n<br/>\r\n---<br/>\n<br/>\r\nIMMERSIVE WORLD<br/>\n<br/>\r\n- EPIC CONFLICTS: Battle other hybrid warriors in epic duels and defeat powerful Daemons while exploring dangerous areas to become the mightiest Daemon Lord.<br/>\n<br/>\r\n- INTRIGUING NARRATIVE: Explore diverse micro-narratives with NPCs, featuring light and humorous storytelling.<br/>\n<br/>\r\n---<br/>\n<br/>\r\nCHALLENGES AND ACHIEVEMENTS<br/>\n<br/>\r\n- INTENSE BATTLES: Challenge yourself in intense battles as you grow stronger. Reach the final showdown with Legendary Daemons in epic battles that will determine the world's fate, with the possibility of absorbing them to become even more powerful.<br/>\n<br/>\r\n- MAP EXPLORATION: Freely explore the map, discover hidden chests, unravel mysteries, and uncover new areas.<br/>\n<br/>\r\n---<br/>\n<br/>\r\nTECHNICAL FEATURES<br/>\n<br/>\r\n- PLAY WITH FRIENDS: Soul Shifters is an online game, so invite your friends for epic adventures. Form strategic alliances to face even greater challenges.<br/>\n<br/>\r\n- MULTIPLATFORM: Enjoy the flexibility of playing on various platforms. Sync your progress and dive into the action wherever you are.<br/>\n<br/>\r\n---<br/>\n<br/>\r\nDOWNLOAD NOW AND EMBRACE YOUR DESTINY IN SOUL SHIFTERS: ONLINE<br/>\n<br/>\r\nGet ready for a unique experience where strategy, courage, and power converge. Download now and embark on this thrilling journey. Humanity relies on you to become the true Daemon Lord and save the world!", "metacritic": null, "released": "2024-03-14", "tba": false, "updated": "2024-03-15T10:04:59", "background_image": "https://media.rawg.io/media/screenshots/f12/f1204786022a3a823de0ea41eae09cb2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Xtreaming"], "genres": ["Adventure", "RPG", "Massively Multiplayer", "Indie"], "publishers": ["Xtreaming"], "esrb_rating": null}