{"id": 978550, "slug": "midnight-monitor-aldercourt", "name": "Midnight Monitor: Aldercourt", "name_original": "Midnight Monitor: Aldercourt", "description": "Aldercourt City Council, in association with Sequre Transport Authority, welcome you into Aldercourt Station.<br/><br/>Aldercourt Station is a sprawling and expansive addition to London's Travel Network. Come get lost amonst its tile halls and take in the scenery as you pass through its liminal spaces.<br/><br/>It can be a little difficult to find your way through the station however - Follow the signs, keep your eyes open and you'll be just fine.<br/><br/><h3>What is Midnight Monitor: Aldercourt?</h3><br/>Midnight Monitor: Aldercourt is a \"walking simulator\" anomaly spotting game, heavily inspired by creepy internet stories around the Backrooms, the concept of Liminal Spaces, and other games of this genre such as \"The Exit 8\".<br/><br/>In Midnight Monitor: Aldercourt, you will need to watch your surroundings for any changes (big or small) as you loop through the Station. Anything can change - Walls and windows can appear, gravity can change, people can act strangely... And your life could be in danger.<br/><br/><h3>Play Time</h3>The game features 40+ anomalies for players to find with an approx. playtime of 15 Mins - 2 Hours. Completionists may opt to find every anomaly.<h3>Is Midnight Monitor: Aldercourt scary?</h3>There are some mild jumpscares depending on how sensitive you are to sudden changes.<br/><br/><h3>Is Midnight Monitor: Aldercourt a complete game?</h3>Midnight Monitor: Aldercourt is a complete game. Some additional anomalies may be added in the future, but it is releasing feature-complete.<h3>How does Midnight Monitor: Aldercourt tie into the Midnight Monitor series?</h3>The security firm \"Sequre\" featured through Midnight Monitor: Anomaly Watch features again in this game with some small callbacks to \"Anomaly Watch\". The plan is to continue growing the Midnight Monitor ethos as the series grows.<br/><br/>", "metacritic": null, "released": "2024-03-14", "tba": false, "updated": "2024-03-15T10:47:39", "background_image": "https://media.rawg.io/media/screenshots/e4c/e4cc1ed3f10bb710f9c0b72ea4449fec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Viexi Games"], "genres": ["Action", "Simulation", "Casual", "Indie"], "publishers": ["Viexi Games"], "esrb_rating": null}