{"id": 978657, "slug": "pestersim", "name": "Pestersim", "name_original": "Pestersim", "description": "The complete MSPA Reader Saga with all 32 volumes included.<br/>\n<br/>\nEmbark on a quest of epic importance in this compilation of both parts of the visual novel adventure set in the darkly funny Homestuck / Hiveswap universe, created by American author and artist Andrew Hussie.<br/>\n<br/>\nExperience the friend-finding escapades of MSPA Reader as you first crash land on Alternia amongst the cast of the Hiveswap point and click adventure series and then bounce between Earth and Alternia reconnecting with classic characters from the Homestuck webcomic.<br/>\n<br/>\nThe Pestersim bundle includes Hiveswap Friendsim and Pesterquest for one bargain price.<br/>\n<br/>\nHiveswap Friendsim<br/>\nHiveswap Friendsim is a quick, loosely-canonical visual novel adventure following the efforts of the unnamed protagonist (that’s you!) to survive and maybe even thrive on the harsh surface of ALTERNIA.<br/>\n<br/>\nSet in the time of Hiveswap: Act 1 and featuring the cast of Hiveswap Act 2, this episodic visual novel is sure to satisfy Homestuck and Hiveswap fans who are eager for a darker stroll across the Alternian landscape.<br/>\n<br/>\nPesterquest<br/>\nCanon is looking a little messy, and it’s probably all your fault. Continue your visual novel adventure through the world of Homestuck! Insert yourself into the lives of beloved characters! Get dinner at Olive Garden!<br/>\n<br/>\nOver 14 volumes, you'll dive deeper into Homestuck lore and reconnect with up to 20 familiar friends in all-new stories about Homestuck’s classic cast of characters, both extra and terrestrial.\n\n<br/>\n<br/>\n<p>\n\t\nLanguages, features and system requirements may vary between games - please check individual product pages for details. \n\n</p>", "metacritic": null, "released": null, "tba": false, "updated": "2024-03-18T07:55:51", "background_image": "https://media.rawg.io/media/screenshots/727/727949b118276b31bedd6c5e6d97c123.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["What Pumpkin Games"], "genres": [], "publishers": ["Fellow Traveller"], "esrb_rating": null}