{"id": 978654, "slug": "potato-salad", "name": "Potato Salad", "name_original": "Potato Salad", "description": "Potato Salad is a collection of 7 games across different genres. Each game covers a potato from a different time period and highlights the never ending battle against The King of Spud Town who is always scheming to get his way.<br/><br/><strong>FEATURES</strong><br/>- 7 unique games across different genres.<br/>- Obtain extras from completing challenges.<br/>- Remastered and formatted to HD resolution.<br/>- Designed with the Steam Deck in mind.<br/>- Play the games in any order you wish!<br/><br/><strong>THE LEGENDARY POTATOES</strong><br/>Below you will find information on the potatoes and types of games contained within this collection:<br/><br/><br/>Inspector Smith<br/>GENRE: Point and Click<br/>This potato has always found an explanation to every mystery possible. Until now! At the cost of his sanity, he attempts to solve the case of the missing television.<br/><br/><br/>Potatoman<br/>GENRE: Platformer<br/>An ordinary potato has his life upended when he is magically transported to a new dimension. In this universe, he is the Potatoman and must save the world.<br/><br/><br/>Beat Hiratio<br/>GENRE: Beat em' Up<br/>The only justice this potato knows is at the end of his fists. Asked to provide food in exchange for monies, he agrees to make the biggest feast in history.<br/><br/><br/>Boxer Yakuzomo<br/>GENRE: Boxing<br/>A potato determined to become the strongest punchmaster in all the lands. Win all the belts and claim the championship once and for all.<br/><br/><br/>Spaceace Alexius<br/>GENRE: Shooter<br/>The legendary spaceace is contracted to obtain an item of great power. The grizzled veteran sets off for one last trip; sure to be the deadliest yet.<br/><br/><br/>Chaos Vasquez<br/>GENRE: Action<br/>Wandering the wasteland without a cause, a hapless king approaches him with a proposal he can't refuse. Everything he's ever known is about to be tested...<br/><br/><br/>8Bit Potato<br/>GENRE: Arcade Minigame Collection<br/>Trapped in an arcade machine, 8bit potato must beat the high scores to become the ultimate gamer.", "metacritic": null, "released": "2024-03-16", "tba": false, "updated": "2024-03-18T07:50:56", "background_image": "https://media.rawg.io/media/screenshots/cfa/cfa2b8d0a132b21fe67f57ebeaa75328.jpg", "website": "http://gzstorm.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GZ Storm"], "genres": ["Action", "Casual", "Indie"], "publishers": ["GZ Storm"], "esrb_rating": null}