{"id": 97862, "slug": "simple-3d-shapes-objects-games", "name": "Simple 3D Shapes Objects Games", "name_original": "Simple 3D Shapes Objects Games", "description": "<p><strong>Controls: Arrows to walk and turn (Shift to run); Ctrl to act on objects like throw/take or push</strong></p><p>If you want to help your kids to learn more about shapes in a cool way, then you will need to let them try playing our 3D shapes game, they will be addicted to this brain game for kids! The objective of the game is to let your kids play with 3D shapes and learn more about them.<br/></p><p>Features :<br/>- Beautiful HD Graphic that will give your kids a very great experience playing this simple 3D Shapes Kids game. <br/>- You can install our game for FREE and enjoy play it. <br/>- We added weather effects of sunny, rain, winds, storms, snowfall, fog to make the game looks real and great.<br/>- Discover 3D Shapes in SimTown is a daily brain learning game and it can be played by kids. And they will enjoy it. <br/>- Our game will help your kids to:<br/>Create a Sphere from circle.<br/>Create a Cone from triangle.<br/>Create a Cylinder from rectangle.<br/>Create Torus from circle.<br/>Build a Pyramid from pyramid net.<br/>Build Prism from prism net.<br/>Build a Cube from cube net.<br/>- Earn new skins for player avatar when successfully finishing missions.<br/>- Switch cameras: Choose between front view and back view.<br/><br/>How to Play?<br/>① You need to install this game in your phone for free!<br/>② The game starts in a simple town with living area and business downtown area, the town is like real. <br/>③ On this town, you will find vehicles driving in the streets, citizens walking on the streets of downtown and interacting with the player. <br/>④ You are a citizen, able to navigate across the town and interact on various missions and games and there is a professional voice-over assistant that will guide you and teach you about the 3D Shapes.<br/><br/>Missions:<br/>We created a lot of fun missions that will give your kids a cool experience while playing and learning from this 3D shapes kids game. The missions are:<br/>- Playing with spheres. Bowling on the parking place.</p><p>- Playing with cylinders. Move boat into the water.</p><p>- Cone play. Street runner. Run fast! Reach the finish line before the countdown ends.<br/>- Playing with sphere and torus. Marbles at the beach. The goal is to hit the ball with the same color.<br/>- Playing with pyramids. Find and collect Pyramids in downtown.<br/>- Playing with prisms. Find and collect Prisms in uptown.</p><p>- Playing with cubes. Build something from cubes.<br/><br/>What are you waiting for ? Download our game and let your kids enjoy the best cool 3D shapes kids game ever!<br/><br/>- Interstitial full screen ads are natively integrated in the game in form of movie rental or visiting the cinema, giving to the player choice and seamless experience.<br/><br/>Credits:<br/>- Simple town: Synty Studios.<br/>- Simple citizens: Synty Studios.<br/>- Professional English voice-over: Ines Marques.</p><p>- Professional Hebrew voice-over: Daniel.<br/>- Achievement sound: by Mike Koenig</p>", "metacritic": null, "released": "2016-03-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d98/d98af34c1dd8cc2e5dcfef127fe3d5ff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["kindergarten"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}