{"id": 978615, "slug": "my-sweet-floating-in-the-void", "name": "My Sweet Floating in the Void", "name_original": "My Sweet Floating in the Void", "description": "# Immerse yourself in My Sweet Floating in the void!<br/><br/>The Game is a philosophical journey toward the betterment of one's being; it is advancement, evolution and rebirth. The more we advance, facing and overcoming the obstacles in our lives, the more we improve ourselves, subsequently achieving a reward, a satisfaction of being, what is called happiness by many!<br/>Each section consists of a labyrinthine system of arrows and numbers; to unlock each section you will have to follow an arrow path to its finish line (remembering the sequence of numbers on your path) and complete each puzzle through a number pad.<br/><br/><br/><br/>To advance and move forward, you will also have to discover the meaning of each symbol and color so that you can complete the puzzles and access all areas of the game. <br/><br/><br/><br/>Get carried away by a new and unique gaming experience for your mind, completely Retro graphics and style, a player control system that is nothing short of unique and equally ingenious, accompanied by extremely strange and difficult Rebuses where not only intellect will be needed to complete them, but also a good memory!<br/><br/><br/><br/>+ GAME PECULIARITIES +<br/><br/>° The player will always be able to float throughout the game without ever falling below the point where he is suspended, except if he ends up in an area marked by a purple border, in which case he will fall by accessing or in the area below, or by teleporting to the next section.<br/>° It contains a labyrinthine rebus system never seen before, that the player will have to complete to unlock the following areas through the interaction of a particular and bizarre numeric keypad (which will also often be decipherable).<br/>° Graphically, the game is totally made with basic color textures and, within many areas, there are many psychedelic parts to make it decidedly more particular, original and captivating.<br/>° The game contains 6 game worlds, each with its own graphic and artistic theme. As you complete more sections, you will be able to return to previous worlds in order to access newly unlocked areas.<br/><br/><br/><br/>+ REPRESENTATION OF GAME WORLDS +<br/><br/>White World:<br/>A strange portal that will take you to a new dimension.<br/><br/>Grey world:<br/>The beginning of the mystery or the end of something... a limbo in which you are sometimes without actually being there, that takes us and sends us further, finally leading us inexorably to itself.<br/><br/>Green World:<br/>Inspired by nature, it is definitely the most structurally weird and psychedelic world; it offers more vegetation and color, along with as many puzzles that will engage the player to make the most of their memory to complete all the puzzles and discover all the secrets.<br/><br/>Orange World:<br/>A arid, desert world, where the few central cubic structures (including those outside) are full of charm and mystery. They will lead you on strange paths and offer you extremely difficult puzzles.<br/><br/>Red World:<br/>A part of the game that approaches an artistically oriental theme, with very complex puzzles that can only be completed by looking beyond the traditional logic. It will offer you a slow descent (or fall) towards something that is there, but until the end it keeps us hidden among the green and bright structures of which it is composed, hiding the occult to itself and to everyone.<br/><br/>Blue World:<br/>Cubes that intertwine logic and mystery, broken castles that offer a new vision of their path and that, thanks to the snow, offer cold and dispersive puzzles, where the common logic will not be enough to complete them, but also a real change of perspective.<br/><br/>", "metacritic": null, "released": "2024-03-15", "tba": false, "updated": "2024-03-18T06:28:12", "background_image": "https://media.rawg.io/media/screenshots/9ea/9eae5b8639136c0991d53607639a09ab.jpg", "website": "https://www.oculusdigital.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Andrea Puglisi"], "genres": ["Adventure", "Indie"], "publishers": ["Oculus Digital"], "esrb_rating": null}