{"id": 978621, "slug": "world-air-war", "name": "World Air War", "name_original": "World Air War", "description": "Embark on an exhilarating journey into the heart of aerial warfare with World Air War, where the skies are your battleground and adrenaline is your constant companion. Commandeer powerful fighter planes as you take on the role of a seasoned pilot thrust into the midst of a high-stakes conflict for air superiority. Your mission: to soar through the clouds, engage enemy aircraft, and reclaim control of vital military installations from hostile forces. Brace yourself for pulse-pounding dogfights, execute tactical maneuvers with precision, and experience the rush of airborne combat like never before.<br/>\n<br/>\r\nGame Features:<br/>\r\n- **Epic Aerial Battles:** Engage in epic confrontations amidst the vast expanse of the sky, where every maneuver counts and victory hangs in the balance.<br/>\r\n- **Three Thrilling Game Modes:**<br/>\r\n   - **Pacific War:** Dive into the chaos of the Pacific theater, where the clash of mighty air fleets shapes the course of history.<br/>\r\n   - **WWII Air Combat:** Relive the iconic battles of World War II, where bravery and skill will determine the fate of nations.<br/>\r\n   - **Avatar Fight:** Unleash your creativity and customize your avatar, then take to the skies in electrifying one-on-one duels against other players.<br/>\r\n- **Immersive Cockpit View:** Experience the action from the pilot's perspective with a dynamic camera angle that puts you right in the cockpit, providing unparalleled immersion and intensity.<br/>\n<br/>\r\nPrepare to soar, strategize, and seize victory in World Air War, where the sky is your domain and aerial supremacy awaits the boldest of pilots.", "metacritic": null, "released": "2024-03-15", "tba": false, "updated": "2024-03-18T06:40:26", "background_image": "https://media.rawg.io/media/screenshots/eae/eaec0661466553c20769758ea0ef5a48.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Atomic Games"], "genres": ["Action", "Strategy", "Simulation", "Sports", "Casual", "Indie"], "publishers": ["Atomic Games"], "esrb_rating": null}