{"id": 978629, "slug": "out-of-the-park-baseball-25", "name": "Out of the Park Baseball 25", "name_original": "Out of the Park Baseball 25", "description": "We are incredibly excited to announce <strong>Out of the Park Baseball 25</strong> - the special 25th Anniversary edition of our award-winning baseball strategy series. Can you believe it's been a quarter of a century? Out of the Park Baseball is not just a game - it's a legacy.<br/><br/><br/><br/>If it happens in real baseball, it happens in Out of the Park Baseball! Discover new talent, draft the next superstar, negotiate with free agents, enter trade talks with other teams, build your dynasty and guide a franchise into an infinite future! As a manager, dive into the more hands-on management and set your team's lineups, pitching staffs, in-game strategy and call the shots from the dugout. You can oversee your league at a high level, or play out each game in the gorgeous 3D game mode, managing play by play or even pitch by pitch. OOTP has it all covered!<br/><br/>Here are just a few of the new features coming to <strong>Out of the Park Baseball 25</strong>:<br/><br/><strong>A game-changing new Player Development Lab!</strong><br/><br/>Shape the future of your upcoming stars! You can channel your inner Player Development Director like never before. A modern new Player Development Lab is here for every team that allows you to give players individual programs to work on, developing them how you like. Do you want your hitter to work on improving their baserunning? Bunting? Contact? Would you prefer your pitcher to work on building up their stamina? Developing a new pitch? Velocity? It's all up to you - for each of your upcoming future stars!<br/><br/><strong>Massive Player Ratings and AI Upgrade!</strong><br/><br/>It’s the most comprehensive player ratings upgrade in the 25 year history of Out of the Park Baseball! Batting, Pitching, and Fielding ratings have been painstakingly modified to capture the essence of baseball, with modifications to Contact and Power for hitters, Movement and Stuff for pitchers, the addition of Catcher Framing and Stealing Aggressiveness, and much more. BABIP is now front and center for hitters and hurlers, while new internal ratings updates allow for even more flexibility for Commissioners around the world to adjust the game to their detailed delight. Plus, the AI throughout the game has been improved dramatically to deliver the most challenging OOTP experience ever! <br/><br/><strong>Even More Detailed Player Development Control!</strong><br/><br/>Delegate how each and every player on your team will spend their time day in, day out with coaches at practice. Want your power hitter to worry less about avoiding strikeouts and put that time and effort into working on his home run swing instead? Want your aging starter to spend more time practicing his control instead of spending that time worrying about his stuff? By allocating their time and focus to the areas you want, over time you can influence how players develop, maintain their skillset, and fight the aging curve.<br/><br/><strong>2024 Rosters and Rules!</strong><br/><br/>As always, Out of the Park Baseball features up-to-the-minute 2024 MLB rosters that get updated all season long, with every franchise represented from its big league club all the way down to the low minors, and everywhere in between! Plus, OOTP 25 features officially licensed leagues from South Korea (KBO) and Europe.<br/><br/><strong>Improved Historical MLB Modes!</strong><br/><br/>Set up historical MLB games in an all new streamlined way - and benefit from vastly improved historical player ratings! It’s never been faster or easier to experience the entire history of Major League Baseball, now producing even more realistic outcomes thanks to those comprehensive ratings and simulation engine upgrades.<br/><br/><strong>New Retro Visual Immersion!</strong><br/><br/>Watch games with a variety of experiences, including retro-style black and white, ‘50s-era, and ‘70s-era television presentations. Choose from all of these to play games, watch highlights, or just catch a ballgame from a bygone era!<br/><br/><strong>New Licensed Leagues!</strong><br/><br/>For the first time ever, Out of the Park Baseball features an officially licensed Honkbal Hoofdklasse league from The Netherlands and the British Baseball Federation from the United Kingdom! Look for their official clubs, players, competitions, and more!<br/><br/><strong>For the first time ever - an official partnership with the Baseball Hall of Fame!</strong><br/><br/>What happens when you combine the only game that has the entire history of baseball and the the greatest Hall of Fame in sports? An incredible, year-long journey! Join us as we partner with the Baseball Hall of Fame all season - and beyond. Explore Hall of Fame Plaques, with the official, accurate text for each Hall of Famer. Discover incredible Hall of Fame artifacts, curated and released in fun \"exhibits\" over the course of the season in concert with the Hall - and more surprises too. It's going to be amazing! <br/><br/><strong>Dozens of upgrades big and small!</strong><br/><br/>--&gt; Updated in-game engine base advancement and camera movements<br/>--&gt; A new manager decision history screen gives you a look back on your best and worst trades and transactions<br/>--&gt; Improved trade packages for prospect packages <br/>--&gt; Updated two-way functionality with injured players<br/>And much more!<br/><br/><br/><br/><strong>Perfect Team is back - bigger than ever!</strong><br/><br/>It’s an all-new Perfect Team! There’s nothing in the world like the incredible online competitions of Perfect Team. Featuring by far the largest player pool ever, and taking advantage of all the player rating and balance upgrades, this year’s Perfect Team is a whole new ballgame.<br/><br/><strong>Brand New Perfect Team Combinator Series Cards!</strong><br/><br/>Pulled non-live cards have a chance to be a special Combinator Series version of the card! Use other cards that share a link (for example being teammates) with the player to get a chance to boost the raw ratings of the Combinator Series card.<br/><br/><strong>A Perfect Team Tournament Roster Builder!</strong><br/><br/>Want to design rosters for the incredible array of Perfect Team Tournaments - all on your own? For the first time ever, Perfect Team will feature a Tournament Sandbox! You can tinker to your heart's content with varying rosters for every type of tournament, with no pressure. This long-requested feature makes its debut in Out of the Park Baseball 25!<br/><br/>In addition to the brand-new Tournament Roster Builder and Combinator Series, Perfect Team 25 also features:<br/><br/><strong>Team Chemistry</strong> - Players who played together in real life will get extra bonuses when on your roster together. Players gain bonuses for seasons they played together, as well as simply being part of the same team or from the same decades<br/><strong>Perfect Team competitions starting on the first day</strong>, including a huge Opening Weekend of Tournaments with big prizes and Perfect Team Championship Series qualifying from Day One! <br/><strong>New content all season long - and beyond!</strong> All new programs, missions, competitions, and excitement await you every day.<br/><br/>Out of the Park Baseball 25 runs on PC/Mac and features the American League and National League logos, the World Series trophy, official logos and jerseys for all 30 MLB teams and 15 KBO teams, over 150 Minor League Baseball league and team logos, and historical MLB logos.", "metacritic": null, "released": "2024-03-15", "tba": false, "updated": "2024-03-18T07:09:54", "background_image": "https://media.rawg.io/media/screenshots/de0/de0220e9503cbc1aaf816fb342514228.jpg", "website": "https://www.ootpdevelopments.com/out-of-the-park-baseball-home/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 300, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Out of the Park Developments"], "genres": ["Strategy", "Simulation", "Sports", "Indie"], "publishers": ["Out of the Park Developments"], "esrb_rating": null}