{"id": 978622, "slug": "pixel-royale-3d", "name": "Pixel Royale 3D", "name_original": "Pixel Royale 3D", "description": "Welcome to <strong>Pixel Royale 3D</strong>, where you'll embark on an immersive journey into the heart of intense <strong>pixelated FPS</strong> action! Prepare to dive into a world of thrilling gunfights, strategic gameplay, and an impressive arsenal of over 40 meticulously designed weapons. With three captivating maps and a constant stream of <strong>bimonthly updates</strong>, this game is sure to keep you on the edge of your seat.<br/><br/><strong>Pixel Royale 3D</strong> offers an extensive collection of uniquely crafted weapons, catering to every playstyle imaginable. From classic firearms to futuristic energy guns, you'll find the perfect tools to dominate the battlefield. Experiment with different weapon combinations, discover your favorites, and unleash havoc upon your adversaries.<br/><br/>But that's not all - <strong>Pixel Royale 3D</strong> takes customization to a whole new level. Express your creativity and design your own character skins (Purchase may be necessary), standing out from the crowd with a personalized touch. Become the envy of both allies and foes as you showcase your unique style and prowess.<br/><br/>Prepare for an intense and action-packed gameplay experience like no other. Engage in heart-pounding battles across <strong>three unique maps</strong>, each adorned with stunning pixel art that creates a visually captivating backdrop for your epic encounters.<br/><br/>With <strong>three separate game modes</strong>, <strong>Pixel Royale 3D</strong> ensures endless variety and re-playability. Dive into Team Deathmatch, where teamwork and communication are paramount. Embrace the chaos of Deathmatch, where survival of the fittest is the ultimate goal. Or test your tactical skills in Duels, where a tense 1v1 situation and pure skill determine the victor.<br/><br/>We are dedicated to providing a phenomenal gaming experience, which is why we deliver <strong>bimonthly updates</strong> packed with exciting new content. From weapons and maps to game modes and thrilling features, we constantly strive to keep the gameplay fresh and engaging. Our team is committed to refining the game and delivering the <strong>best possible experience</strong> to our players.<br/><br/><strong>Pixel Royale 3D</strong> combines the nostalgic charm of pixel art with the adrenaline-pumping mechanics of <strong>FPS gameplay</strong>. Immerse yourself in a dynamic world where bullets fly, strategies unfold, and the thrill of victory awaits. Are you ready to jump into action? Gear up, lock and load, and experience the chaos of <strong>Pixel Royale 3D</strong>!", "metacritic": null, "released": "2024-03-15", "tba": false, "updated": "2024-03-18T06:41:51", "background_image": "https://media.rawg.io/media/screenshots/9f2/9f2fda6d933a937b708c7013b12b6c84.jpg", "website": "https://www.pixelroyale3d.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Squidy"], "genres": ["Action"], "publishers": ["Squidy"], "esrb_rating": null}