{"id": 978643, "slug": "my-step-family", "name": "My step family", "name_original": "My step family", "description": "My step family is a love simulation genre that enjoys a young man's story. You can enjoy various videos and scenes that unfold depending on the situation with a simple mouse and keyboard operation. The game is packed with humor, sex, romance, drama and a rich story.<br/><br/>A young man has a new life after a short study abroad life. A sudden stepmother and three sisters. the sex life beyond your imagination, now unfolds before him.<br/><br/><br/><br/>stepmom : Ga-yeong<br/>age : 43 years old<br/>height : 173cm<br/><br/>Ga-yeong, the stepmother who is married to the Kyu-hyun's father, is hungry for sex all the time. Disappointed with her husband who no longer looks at her, She's obsessed with dildo every day. But from the moment she saw the Kyu-hyun's cock...<br/><br/><br/>stepsister : Yoo-yeon<br/>age : 23 years old<br/>height : 165cm<br/><br/>Yoo-yeon is the first of three sisters. She is characterized by a cynical personality and does not like the Kyu-hyun. But there is a heartbreaking reason for her personality.<br/><br/><br/>stepsister : Jae-kyeong<br/>age : 20 years old<br/>height : 162cm<br/><br/>Jae-kyeong is a twin old sister. she have a boyfriend, but she is worried about the conflict between Kyu-hyun and her's boyfriend.<br/><br/><br/>stepsister : Kyu-yeong<br/>age : 20 years old<br/>height : 158cm<br/><br/>Kyu-yeong is a twin younger sister. She feels love for Kyu-hyun and is confused. But soon her accept that feeling and become a woman who is more active than anyone else.<br/><br/><br/>girlfriend : Jin-hwa<br/>age : 26 years old<br/>height : 168cm<br/><br/>Jin-hwa is Kyu-hyun's girlfriend. Kyu-hyun feels uneasy about Jin-hwa, who has been neglected recently. Turns out she's another...<br/><br/><br/>friend : Lisa<br/>age : 28 years old<br/>height : 171cm<br/><br/>Lisa is Kyu-hyun's part-time friend. She is more open and active than anyone else. But it turned out that she had a heartbreaking past.", "metacritic": null, "released": "2024-03-15", "tba": false, "updated": "2024-03-18T07:32:58", "background_image": "https://media.rawg.io/media/screenshots/89b/89bf108b78c5e6b28d12c4a1a11cac91.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Kun family"], "genres": ["Simulation"], "publishers": ["Kun family"], "esrb_rating": null}