{"id": 978789, "slug": "master-maker-3d-ultimate", "name": "Master Maker 3D Ultimate", "name_original": "Master Maker 3D Ultimate", "description": "<h3>Clear retro 3D levels or build your own in this 3D action platformer for all ages!</h3><br/><br/>Play as Master Maker, a young builder who possesses a special boomerang hammer capable of collecting items, destroying boxes and defeating enemies from a distance! In this 3D adventure inspired by classics of the ’90s, you can explore and build freely. Adventure mode features 50 colorful levels to inspire your constructions. Just move Master Maker from the starting point to the flag at the end of the stage by jumping across platforms, knocking out enemies and avoiding traps! Then Level Creator lets you build original stages however you like by adding blocks, coins, spikes, cannons, trees, decorations, ramps and much more!<br/><br/><br/><br/>Presented in high-definition 3D style, Master Maker 3D Ultimate is a low-poly action experience that’s fun for the whole family, and replay value is practically limitless since you can use your imagination to keep creating long after the main stages have been cleared. Plus, if you complete Adventure mode, you’ll unlock 350 new levels to enjoy at any time!<br/><br/><br/><br/><strong>Features:</strong><br/><br/><ul><li>Run, jump and use your boomerang hammer to clear retro 3D platforming stages!<br/></li><li>Master 50 unique levels in Adventure mode.<br/></li><li>Create new original stages by placing blocks, coins, traps, enemies and more!<br/></li><li>Unlock hundreds of bonus levels for extended replay value.<br/></li><li>Enjoy low-poly style inspired by genre classics of the ’90s!</li></ul><br/><br/><br/>", "metacritic": null, "released": "2024-03-20", "tba": false, "updated": "2024-03-22T09:30:09", "background_image": "https://media.rawg.io/media/screenshots/7e7/7e7a75a1bf4d6593874fc9b32306133d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 275, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Derik D.F"], "genres": ["Adventure", "Strategy", "Indie"], "publishers": ["eastasiasoft"], "esrb_rating": null}