{"id": 97871, "slug": "pharaoh-the-pixel-adventure", "name": "Pharaoh, the pixel adventure", "name_original": "Pharaoh, the pixel adventure", "description": "<p>Now also in Google Play:</p>\n<p>Pharaoh, the pixel adventure<br/><br/></p>\n<p>Pharaoh, the pixel adventure game, your girl has been kidnapped by the Pharaoh of the pyramid, goes through the 55 rooms of the pyramid to rescue her, but beware, the mummies, scorpions, zombies, snakes, bats and traps of the pyramid will try to prevent it.<br/><br/>Play this pixilated adventure and show that you are a hero, face the innumerable dangers of the pyramid, and defeat Pharaoh to rescue your girl in this fantastic adventure.</p>\n<p>To avoid the enemies and the traps, you must go jumping at the right moment, you play with a single touch, it is a one touch game, with a B.S.O. original and emotive, set in ancient Egypt.<br/><br/>Pharaoh's world has:<br/><br/>- Beautiful graphics pixel art.<br/><br/>- Epic B.S.O. by Guillermo Cañete.<br/><br/>- Many enemies, mummies, zombies, snakes, traps, bats and the final boss, the Pharaoh of the pyramid.<br/><br/>- A girl to rescue.<br/><br/>- Millimeter jumps.<br/><br/>- 55 levels.<br/><br/>- One touch control.<br/><br/>- Free  game.<br/><br/>- For all ages.<br/><br/>- Retro style.<br/><br/>- Die again and again, it can be fun.<br/><br/>If you like pixel art, retro games and indie games, play Pharaoh, the pixel art adventure, overcome all the rooms of the pyramid and rescue your girl, show that you are a hero.<br/></p>\n\n<p>--------------------------------------------------------------------------------------------------------</p>\n<p>Faraon, la aventura pixelda, tu chica ha sido raptada por el Faraón de la pirámide, recorre las 55 peligrosas habitaciones del la pirámide para rescatarla en este juego de plataformas, con la B.S.O. original de Guillermo Cañete, pero cuidado, las momias, escorpiones, zombies, serpientes, murciéalogos y trampas que esconde la pirámide intentarán impedirlo.<br/></p>\n<p>Juega esta aventura pixelada, y demuestra que eres un héroe, supera los cientos de peligross que esconde la pirámide, y derrota al Faraón para recuperar a tu chica en esta fantástica aventura.</p>\n<p>Faraón es un juego de plataformas, que se juega con un sólo toque, basta con pulsar la pantalla para saltar e ir evitando los enemigos y trampas, juegas con la ventaja de doble salto, pero no siempre será buena elección.<br/></p>\n<p>El fantástico mundo de Faraón, la aventura pixelada, gustará a todos los amantes de los juegos de platafomas:</p>\n<p>- Bonitos gráficos pixel art.</p>\n<p>- B.S.O. Original de Guillermo Cañete</p>\n<p>- Muchos enemigos, momias, zombies, serpientes, escorpiones, murciélagos, trampas y como no podía faltar, el jefe final, el Faraón de la pirámide.</p>\n<p>- Sé un héroe y rescata a tu chica.</p>\n<p>- Demuestra tu habilidad con saltos milimétricos.</p>\n<p>- 55 niveles repleteos de enemigos y trampas.</p>\n<p>- Controla a tu héroe con un solo toque.</p>\n<p>- Juego gratis.</p>\n<p>- Juego para todas las edades, niños y adultos.</p>\n<p>- Morir una y otra y otra vez será divertido, verdad? </p>\n<p>Si te gusta el estilo pixel art, los juegos de plataformas retro, juega Faraón, la aventura pixelada, recorre todas sus habitaciones evitando las tramapas y enemigos hasta llegar a lo alto de la pirámide, derrota al Faraón y rescata a tu chica, sé un héroe ;)</p>", "metacritic": null, "released": "2017-03-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a42/a42954c36d69fbf582a42917fbb4b393.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Ixel Games"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}