{"id": 978770, "slug": "the-darkness-below-2", "name": "The Darkness Below", "name_original": "The Darkness Below", "description": "<h3>Overview</h3>Embark on an epic journey into <strong>The Darkness Below</strong>, a cRPG that pays homage to the golden era of 90's cRPGs. With grid-based movement, turn-based combat, and 2.5D perspective, the game transports you to a vast and colorful fantasy world filled with puzzles, exotic creatures, forgotten dungeons and ancient guardians.<br/><br/>Drawing inspiration from Dungeon Master, Eye of the Beholder, Lands of Lore, and Might and Magic 3-5, this retro adventure seamlessly blends classic cRPG elements with D&amp;D mechanics, where your choices truly shape your destiny. Dive into a rich and immersive world filled with monsters, npcs, skill trainers, intricate dialogues and meaningful interactions.<br/><br/>Uncover forgotten lore and solve challenging puzzles as you navigate through abandoned places and bustling towns. Engage in endless side quests, forging your path towards character advancement. With full character generation and quick party options, your adventure is as unique as the hero you become. Are you ready to explore a realm where every decision matters?<br/><br/>Set to be the largest single-player first person grid-based cRPG of all time, \"The Darkness Below\" promises a rich tapestry of lore, skill challenges, and grinding gameplay that will captivate fans of the genre. Are you ready to uncover all of its secrets?<h3>Features</h3><ul><li>Windows / Linux<br/></li><li>First person grid-based dungeon crawling experience, as traditional as it gets<br/></li><li>Pixelart aesthetic, event cutscenes and a colorfully vibrant world, straight from the 90' golden era<br/></li><li>Grid-based animated movement, through mouse and keyboard (with custom key bindings)<br/></li><li>Blazingly fast turn-based combat, much like M&amp;M 3-5<br/></li><li>Interactable items &amp; objects (ground items, levers, doors, keylocks, text banners, traps etc.)<br/></li><li>Various NPCs and voice-overs (greetings, death, refusals etc.)<br/></li><li>Recruitable NPC companions (CPU based), each one with specific talents in combat (skill, weapons, spells, quest NPCs etc.)<br/></li><li>Skills learning based on usage (skill XP increases by using), expertise level (initiate, adept, master etc.) and requirements (profession, ability scores etc.)<br/></li><li>Skill advancing through multiple skill trainers on villages and towns, each one advancing characters to specific expertise (initiate, adept, master etc.)<br/></li><li>Spell system based on slot allocation, very similar to D&amp;D mechanics<br/></li><li>Spells sorted into specific magic schools / elements (\"Fire magic\" etc.), sorted by expertise (initiate, adept, master etc.) and cast through staffs, holysymbols, scrolls and wands<br/></li><li>Passive / active skill checks, similar to D&amp;D challenge checks<br/></li><li>Dynamic itemization, with about ~300 base items and on-demand creation of random items with various enchantments (\"of Fire damage\" etc.) or uniquely named (\"Pyroblade\" etc.)<br/></li><li>Enchantments to further improve items like \"of Fire damage\" and \"of Titan\", allowing more strategic decisions on party equipment and leading to tens of thousand items<br/></li><li>Shops dealing with various trades (weapons, magic, books, general store, stable etc.)<br/></li><li>Create new characters or choose prebuilt ones, through a very fast and intuitive character generation system<br/></li><li>Local / world / mini map, with local and world completion %<br/></li><li>Unlimited saves with screenshot thumbnail, world completion % etc.</li></ul><h3>Early access content (the \"Prelude\")</h3><ul><li>Game's rulebook contains most of the following details<br/></li><li>7 maps (about ~3 hours gameplay, straight from full release content)<br/></li><li>6 quests (major and side quests)<br/></li><li>30 skills (from \"Long blade\" and \"Fire magic\" practitioners to D&amp;D environmental like skills like \"Fitness\" and \"Survival\")<br/></li><li>20 spells (sorted into 5 levels of expertises like initiate, adept, master etc. and 7 elements like Fire, Air etc.)<br/></li><li>300 base items (from \"Short sword\" and \"Long sword +1\" to \"Lightning Bow +2\" and \"Master Scroll of Firebolt\")<br/></li><li>50 item enchantments (from \"of Fire damage\" and \"of Cavalier\" to uniquely named ones like \"Pyroblade\")<br/></li><li>15 monsters (from \"Skeleton\" and \"Goblin\" to menacing \"Devil\", each one with custom actions similar to D&amp;D)<br/></li><li>8 conditions (from \"Poisoned\" to \"Cursed\" and \"Maddened\")</li></ul><h3>World</h3>The following might give an idea about the scope and length of the game<br/>", "metacritic": null, "released": "2024-03-19", "tba": false, "updated": "2024-03-22T08:36:50", "background_image": "https://media.rawg.io/media/screenshots/b6b/b6b43133756ade74abe31e376a1ff54f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 486, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["ELEFTHERIADIS SAVVAS"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["ELEFTHERIADIS SAVVAS"], "esrb_rating": null}