{"id": 978836, "slug": "industria-2", "name": "INDUSTRIA 2", "name_original": "INDUSTRIA 2", "description": "<p>\n \n</p>\n<p>\nYears after the events of the prequel INDUSTRIA, Nora is stuck in a parallel dimension, far away from home. Surviving alone on a peaceful island, an empty apartment building in a vast sea of hostile solitude, she constructs a machine to return to her home dimension: 1989 East Berlin.\n</p>\n<p>\n \n</p>\n<p>\nJust before she completes the year-long project, a chain of unforeseen consequences pulls her back into the pulsating heart of the artificial intelligence ATLAS.\n</p>\n<p>\n \n</p>\n<p>\nNora soon comes to the realization that she cannot evade her past and must face the haunting responsibility that lies within it – her involvement in the creation of the uncontrollable A.I.\n</p>\n<p>\n \n</p>\n<p>\n</p>\n<p>\n \n</p>\n<ul>\n<li><strong>Immersive gameplay:</strong> Physics-based interaction, crafting and a diegetic inventory ground the gameplay in the game environments</li>\n<li><strong>A hero's journey:</strong> A narrative FPS to its core, where you'll meet memorable characters and progress through a touching story</li>\n<li><strong>Unique setting:</strong> Industrial decay in a vast boreal nature meets otherworldly sprawling machine structures</li>\n<li><strong>Upgradable weapons:</strong> Upgrade five weapons with various attachments like silencers, extended magazines or special attacks</li>\n<li><strong>Robot body horror:</strong> Vivid machine oil spilling and body dismemberment lead to intense firefights</li>\n<li><strong>Compact Indie Experience:</strong> A 4-6 hour long filler free journey made by a passionate small indie team</li>\n<li><strong>Cinematic audio:</strong> Full voiceover, dynamic music and detailed sound design are merged together by real-time audio reflection through Wwise</li>\n<li><strong>Next-gen visuals:</strong> Carefully crafted assets are empowered by Unreal Engine 5's fully dynamic lighting engine Lumen</li>\n</ul>", "metacritic": null, "released": null, "tba": false, "updated": "2024-03-22T11:30:39", "background_image": "https://media.rawg.io/media/screenshots/0b8/0b8aacb52d69df6964fe9d0fe1a19672.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bleakmill"], "genres": [], "publishers": ["Headup Games"], "esrb_rating": null}