{"id": 978899, "slug": "aicybercraft", "name": "AI.Cybercraft", "name_original": "AI.Cybercraft", "description": "<strong>THIS GAME OFFERS THREE IMMERSIVE MODES: SPACHESHIPS BATTLES, TOWER DEFENSE,  &amp; FIRST-PERSON SHOOTER</strong><br/> -  39 Levels of Spaceships battles<br/> -  10 Levels of Tower Defense<br/> -  7  Levels of Battles against AI Bosses<br/> -  3 Levels of Endless Space Battles<br/><br/><br/><br/>Prepare for high-stakes Spaceship Battles where strategy meets adrenaline-pumping action. Throughout the campaign, unlock a diverse array of spacecraft to navigate cosmic conflicts. Each mission pits you against relentless waves of enemies—from AI robots and drones to formidable mini-Bosses and epic end-level Bosses.<br/><br/><br/>Each vessel boasts unique attributes and customizable load-outs, allowing you to tailor your approach to the battles at hand. Before each mission, meticulous planning in the lobby involves purchasing and upgrading tactical missiles, destructive warheads, squad reinforcements, Super weapons, Health boosts, Shields, and more. Mastering these tools is key to navigating the chaos, outmaneuvering foes, and emerging triumphant in the thrilling expanse of space combat.<br/><br/><br/><strong>Steam Achievements</strong><br/>Test your mettle and prove your mastery in AI.Cybercraft through an array of Steam Achievements. From conquering challenging missions to unlocking hidden story segments, these achievements provide an additional layer of motivation. Showcase your dedication as a defender of Ulara and a beacon of hope for humanity.<br/><br/><br/><strong>THE STORY</strong><br/>\"AI.Cybercraft\" thrusts players into a gripping futuristic scenario where humanity fights for survival against invading AI robots that decimated Earth in 2068. As battles spill into the galaxies, humans stake their claim on new planets like Ulara, seeking refuge and a chance to strike back.<br/><br/><br/><br/><br/>Engage in Tower Defense Mode, where your critical task is to fortify defenses by tactically placing an array of ground and air defenses. The relentless AI adversaries launch calculated assaults from strategic points encircling your base, requiring astute management of defenses while safeguarding key elements: energy reserves, technological advancements, and the central machine gun tower - the linchpin of your defense strategy.<br/><br/><br/>the dynamic battlefield demands swift action. When the situation escalates, seamlessly transition to a first-person perspective. As you switch to FPS mode, assume the frontline defender role, wielding the potent Machine Gun Tower. Your accuracy and reflexes become pivotal in repelling successive enemy waves and preventing breaches that could compromise your mission or base integrity.<br/><br/><br/><br/>In the adrenaline-fueled First-Person Shooter mode, you're the critical support for your defenses under siege. Operating the potent machine gun emplacement at your base's core, your task is to fend off relentless assaults. <br/><br/><br/>Alongside the machine gun, an anti-air guided missile system stands ready to intercept drones and stray satellites hurtling towards your stronghold. Your precision and speed are paramount as you thwart aerial threats and prevent breaches that could jeopardize your mission.<br/><br/><br/>Amidst the chaos, the Tech Center sends crucial drops containing ammunition and raw materials. Your sharpshooting skills come into play as you shoot down these supplies, securing resources vital for maintaining your defense. Balancing offense with defense, your role as the frontline defender is pivotal.<br/><br/>Throughout the game, players experience thrilling combat, delve into strategic planning, and engage in high-stakes battles against powerful AI adversaries. With its diverse modes and challenging gameplay, \"AI.Cybercraft\" offers an immersive and adrenaline-pumping experience set in a captivating futuristic universe.", "metacritic": null, "released": "2024-03-21", "tba": false, "updated": "2024-03-25T07:24:11", "background_image": "https://media.rawg.io/media/screenshots/908/908b2e8e6d37e8fed5b2f2ceec1e269e.jpg", "website": "https://www.youtube.com/@desinovation", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Khalil Al Gemayel", "Desinovation Games"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["Desinovation Games"], "esrb_rating": null}