{"id": 97883, "slug": "paint-the-sky-golden", "name": "Paint the Sky Golden", "name_original": "Paint the Sky Golden", "description": "<p>\n<strong>Paint the Sky Golden </strong>was an entry for <strong>Resist Jam 2017</strong>, an event focused on resisting to oppresive authoritarianism in all of its forms and empowering people through the power of interactive media.\r\n</p><p>\r\n\tOur objective was to design a game which made the player reflect about how our actions as individuals may have an impact on others and, in the context of authoritarianism, as part of a priviliged majority.</p><p>Use the gold citizen to solve puzzles and paint the world golden; use the green citizen to grow plants and reach unaccesible locations. But watch out, green citizens may not touch anything golden.</p><p>Move with AD, Jump with Space and Grow Plants with S. Best played on 1024x768.</p><p>Background story</p><p>In another world, somewhere far away from our own, there lived a civilization who turned everything they touched into gold. They lived together with others who didn't have that same ability; over time, they ended up feeling uncomfortable with this fact, so it didn't really surprise anyone when, overnight, they disappeared without leaving any trace of their life there. nobody knows what happened to them once they left the golden cities, but legends say they're still lurking in the forests, avoiding everything golden out of shame, not wanting to be seen ever again. some people say they made some oath to Mother Nature. those more skeptic doubted they'd even existed... </p><p>One day, the Empress, a steely heroine admired and beloved by everyone, sent her people into a quest for making the kingdom the most beautiful place on Earth. Because they considered gold to be their identity symbol and proof of their queen's beauty, the citizens started turning everything they could grasp into pure gold. What should become of that prosperous kingdom?<br/></p><p>\r\n\tThe Resistance is formed by:\r\n</p><ul>\n<li>Marina de Bustos - Art and Design</li>\n<li>Yolanda Mojena - Gameplay Programming and Design</li>\n<li>Eric Oliver - Physics and Gameplay Programming</li>\n<li>Pablo Rincón - Gameplay Programming, Design and UI</li>\n<li>Rubén Rincón - Music</li></ul><p>\n<em>First they came for the Socialists, and I did not speak out<em>—</em> </em>\n</p><p>\n<em>Because I was not a Socialist.</em>\n</p><p>\n<em>Then they came for the Trade Unionists, and I did not speak out— </em>\n</p><p>\n<em><em>Because I was not a Trade Unionist.</em></em>\n</p><p><em>Then they came for the Jews, and I did not speak out—</em><br/></p><p>\n<em>Because I was not a Jew.</em>\n</p><p>\n<em>Then they came for me— </em>\n</p><p>\n<em>and there was no one left to speak for me.</em></p><p>\r\n\tMartin Niemöller\r\n</p>", "metacritic": null, "released": "2017-03-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1c5/1c53e94c9989177786a2110dfc1972b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Saprolin", "yomowilce", "Pablo Rincón", "Neddea"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}