{"id": 978897, "slug": "remington-the-ai", "name": "REMINGTON, the A.I.", "name_original": "REMINGTON, the A.I.", "description": "<h3> PLEASE NOTE: This game is an episodic game. The first episode has just been released on March 21, 2024. </h3><br/>Disclaimer: The story plot of REMINGTON, the A.I. is entirely fictional. None of it is based on real-life events, NOR is it meant to predict the future. It is simply a story meant to entertain. (end of disclaimer)<br/><br/>REMINGTON, the A.I. is a kinetic (linear) visual novel set in the year 3000. Human society has reached super-civilization, and A.I.s and robots are part of our daily life.<br/><br/>At the forefront of the A.I. industry stand two giants -- the United States government and a private European company called ENTROPY. <br/><br/>The US government created REMINGTON, a scientific-research A.I. <br/><br/>ENTROPY created Waverly, a socializing humanoid. <br/><br/>Until 2 weeks ago, REMINGTON was the undisputed NO.1 artificial technology in the world. Now his competition WAVERLY threatens to overtake him with a mega-upgrade. <br/><br/>Who will win the International Artificial Technologies Award this year? The American scientist REMINGTON, or the European socialite WAVERLY?<br/><br/>Join REMINGTON as he prepares for fierce competition with WAVERLY, and discover a global conflict far bigger than themselves...<h3>What to Expect?</h3><ul><li> NOTE: Even though the gameplay trailer video has no sound, the actual game does have background music<br/></li><li> There are a total of 6 episodes<br/></li><li> Each episode is set in a different place. For example, one episode is set in a party, the next episode is set in a military compound<br/></li><li> Each episode has many new characters. The main characters will appear in every episode, but each episode will have somewhere between 2 to 6, or 8 new side characters who are just there for the one episode. This is to keep the story feeling fresh and something new always coming-in<br/></li><li> Very few, if at all any deaths. This is NOT a game where everyone dies. The story is focused on competition and growing as a person, rather than death and grief<br/></li><li> The first episode will be released FAR BEFORE the other episodes. This means there will be a time gap between the first episode's release and the other episodes. The purpose of this is to gather feedback and see if any changes need to be made to the future episodes, as well as dealing with any code bugs and other coding issues.</li></ul><h3>Want Notifications When the Game Comes Out?</h3>Add this game to your Wishlist and ALSO click the \"follow\" button on this store page. <br/>When the game is out, notifications will be sent to your Steam inbox<h3> Mac and Linux Users Please Read </h3>This game was originally planned to be released on all platforms (Mac, Linux and Windows). Due to many factors, the Windows version will be released first. Whether the game will be released for Mac and Linux remains to be seen. <br/><br/>If you like this game, add it to your Wishlist + Click 'Follow' on the Store Page. All followers will get a notification if a Mac/Linux version is announced<h3> Credits </h3>All the writing, coding and artwork of this game is done by CM Pictures. NO A.I.s were used for ANY part of the game. <br/><br/>All the soundtrack used in Episode 1 is made by Infraction (inAudio): https://inaudio.org/.", "metacritic": null, "released": "2024-03-21", "tba": false, "updated": "2024-03-25T07:18:30", "background_image": "https://media.rawg.io/media/screenshots/a65/a65b235afb5ac4b18cce4681265490c0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 287, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CM Pictures"], "genres": ["Casual", "Indie"], "publishers": ["CM Pictures"], "esrb_rating": null}