{"id": 978931, "slug": "amusement-park-simulator", "name": "Amusement Park Simulator", "name_original": "Amusement Park Simulator", "description": "https://discord.gg/TPNTYkQrPv<h3>Build and manage your own amusement park! </h3><strong>Amusement Park Simulator</strong> is a fun simulation experience that is now available in early access. It offers both management and simulation experiences. You can <strong>build and manage</strong> your own park in any way you like. With its brand new mechanics and absurd sense of humor, <strong>Amusement Park Simulator</strong> is coming soon to Steam ! Don't forget to add it to your <strong>wishlist now !</strong><br/><br/><strong><h3>Renovate the abandoned amusement park in the middle of the city and make it the city's new jewel.</h3></strong><h3>Manage !</h3>Track your daily statistics and progress towards building a profitable amusement park. Be the best of all amusement parks and serve more customers. Try to become the richest by managing your financial situation.<br/><h3>Build !</h3><strong>Build</strong> any amusement park machine you want and make your customers happy.<strong> Build</strong> dozens of different machines to create the best amusement park. <strong>More machines = more fun = more money!</strong><br/><h3>Beat Them !</h3>Catch and teach your customers a lesson! Identify and discipline customers who have not paid for tickets.<br/><h3>Adrenaline !</h3>Adjust the adrenaline level according to your customer's requests and promise them the heights of entertainment! Adjust the speed and adrenaline level of each tool from its own control panel, so that you can be sure that your customers are having enough fun!<br/><h3>Fails !</h3><strong>Be careful!</strong> If your customers can't handle this speed, they may start throwing up and cause you more cleaning work.<br/><br/><h3>Unlock New Areas !</h3>Expand your amusement park by opening new areas and creating new construction areas. Have more machines to manage and make your customers happy!<br/><h3>Features of the game:</h3><br/><ul><li>Build your dream amusement park!<br/></li><li>Manage your own amusement park.<br/></li><li>Build the machines you want and entertain your customers.<br/></li><li>Decorate your park as you like.<br/></li><li>Unlock new skills manage your lifestyle.<br/></li><li>Repair broken machines or explode and get punished!<br/></li><li>Provide a clean environment for your customers by cleaning around.<br/></li><li>Check ticketless customers.<br/></li><li>Pay attention to your energy and hunger bar.<br/></li><li>SLAP customers who sneak into the machines!<br/></li><li>Adjust the excitement level of the amusement park machines to the most suitable level for your customers.<br/></li><li>Earn money and develop your park like a real simulation game.<br/></li><li>Set up food stalls and serve your customers.<br/></li><li>Expand your land and have a bigger amusement park!</li></ul>[url][/url]", "metacritic": null, "released": "2024-03-22", "tba": false, "updated": "2024-03-25T09:34:42", "background_image": "https://media.rawg.io/media/screenshots/c39/c3967b3dd59c02b002ddffc612f58a3f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 330, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SlosGames"], "genres": ["Simulation"], "publishers": ["SlosGames"], "esrb_rating": null}