{"id": 978902, "slug": "kakuriyo-village-moratorium-of-adolescence", "name": "Kakuriyo Village ~Moratorium of Adolescence~", "name_original": "Kakuriyo Village ~Moratorium of Adolescence~", "description": "<strong>As they mature, will they be together forever?</strong><br/><br/>Summer<br/>Emerald, green plants growing everywhere.<br/>Sparkling white dirt shimmered on the gravel road from sunlight.<br/>The storm clouds resemble the intimidating gates of a grand castle.<br/>Most importantly, is the strange and endless blue sky.<br/><br/>Summer<br/>The landscape filled with primitive colors looked so blindingly bright.<br/>The climate ravages the flesh and revives memories of the past.<br/>The shifting mirage reflects the fullness of being homesick.<br/><br/>Summer<br/>The most special season for children.<br/>The most ordinary season for adults.<br/><br/>Summer<br/>The past that can't be revived.<br/><br/>6 months later a couple of childhood friends Ao &amp; Hinori met again during the New Year.<br/>Escaping from a boring family party, their friendship sways between maturity and youthfulness...<br/>Unexpectedly, on the way home, they accidentally broke into a village called \"Kakuriyo Village\".<br/><br/>They didn't realize that it was a sexist village where men and women had unequal statuses.<br/>Because of Hinori's boyish appearance, the villagers mistaken her as a boy.<br/>So, until they find a way to escape from the village, they must figure out how to hide that Hinori is a girl...<br/><br/>There's only one rule in this village that can not be broken, and that is \" You can not disguise your physical gender\".<br/>Rumor has it, whoever breaks this rule will be punished horribly…<br/><br/>Can they successfully escape from the village?<br/>It's all left to the players to decide.<br/><br/><br/><br/><br/><strong>They experienced young love that sways between youthfulness and maturity.</strong><br/><br/>\"Even if you're destined to love--And even if the gods wish you to love each other--<br/>but you can't be together because of fate,<br/>to fight against this fate, <br/>the god summoned his people here. To give happiness to the world--\"<br/><br/>Hinori &amp; Ao asked for help from the Shrine Maiden to escape but learned a shocking truth instead.<br/><br/>\"If they return to their world, their paths will never cross again──\"<br/><br/><br/><br/>The two of them will spend a year here.<br/>They love each other forever in this constantly cyclical world that does not age or die,<br/>or they find the courage to overcome their separation and look towards the future.<br/>Their fate is all decide by \"You\" the player.<br/><br/><br/><br/><strong>Explore the open village!</strong><br/><br/>From morning to night, there are countless events in the village that are waiting for you to explore.<br/>Let's explore &amp; discover all 4 seasons of this beautiful village with Ao and Hinori!<br/><br/><br/><br/><br/><br/><br/><br/><br/><br/>More than 20 fully-voiced supporting characters!<br/>Enjoy interacting with all the residents!<br/><br/><ul><li>Basic CG 80 pics (color)<br/></li><li>Total of 200 scenes<br/></li><li>All scenes are voiced<br/></li><li>Expected playing time over 20 hours</li></ul><br/>", "metacritic": null, "released": "2024-03-21", "tba": false, "updated": "2024-03-25T07:34:38", "background_image": "https://media.rawg.io/media/screenshots/e57/e5704829d1c9b2bbbe3d0dee0d342577.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["I'm moralist"], "genres": ["RPG", "Casual", "Indie"], "publishers": ["BokiBoki Games"], "esrb_rating": null}