{"id": 978957, "slug": "climber-animals-together", "name": "Climber Animals: Together", "name_original": "Climber Animals: Together", "description": "Climber Animals: Together is an exciting and challenging parkour experience for 1 to 8 players. In this game, players try to find their way through a world full of dynamic and challenging obstacles. Each obstacle tests players' strategy, speed and skill. On unique and vividly designed courses, you have the goal of reaching the top by racing shoulder to shoulder with or against your friends.<br/><br/><br/><br/>One of the most important features of the game is that with every fall, your progress is lost and players have to start all over again. While this creates an equal starting point for all players at the beginning of each level, it also increases the difficulty level of the game. This allows for different strategies and paths to be explored each time a level is retried.<br/>Players need to keep their balance and overcome obstacles to reach the top. In this process, it is important for players to use their reflexes, speed and strategic thinking skills. Players can cooperate with or challenge their friends to make their way through this challenging and fun course.<br/><br/><br/><br/>Climber Animals: Together offers a fun and challenging course experience that appeals to all age groups, opening the door to enjoyable moments with your friends. <br/>Every climb is a new adventure and every fall is another opportunity to try something new. Dodge spinning hammers, dodge boxing gloves and keep your balance on spinning poles on this exciting journey!<br/><br/>", "metacritic": null, "released": "2024-03-22", "tba": false, "updated": "2024-03-25T11:17:25", "background_image": "https://media.rawg.io/media/screenshots/3fe/3feba3f71a8b68ac9ffc2e4747129768.jpg", "website": "https://www.payoffgames.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Payoff Games"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Weakfish Studio Publishing"], "esrb_rating": null}