{"id": 978945, "slug": "farmers-father-the-origins", "name": "Farmer's Father: The Origins", "name_original": "Farmer's Father: The Origins", "description": "<strong>Farmer's Father: The Origins</strong> is a free prologue of Farmer's Father. You have 60 minutes to explore, have a glimpse of the story and game mechanics. Fight with hunger, wounds, cold, disease, and enemy cruelty. Defend your family and survive the war! If you like a prologue. Get a full game here:<br/><br/>https://store.steampowered.com/app/1905980/Farmers_Father_Save_the_Innocence/<br/><br/>\"The first casualty of war is innocence\"<br/><br/>War breeds heroes you've never heard of. You are the ordinary person holding a huge burden of protecting what's most precious and innocent. Fight with hunger, wounds, cold, disease, and enemy cruelty. Defend your family and survive the war!<br/><br/>Imagine waking up in the middle of the snowy night to the sounds of a falling sky. Explosions, fire, chaos, the frightened whimper of your child. It’s your turn: now or never, slip away from your enemies before it's too late…<br/><br/><h3>FEW OF MAIN FEATURES IN THE GAME</h3><br/>🕊️ Building - animal homestead, baby cradle, trough, and more<br/>🕊️ Crafting - create something useful out of junk<br/>🕊️ Cooking - prepare all kinds of food out of what you can find<br/>🕊️ Sneaking - move quietly then you'll survive<br/>🕊️ Hunting - use guns and provide needed food<br/>🕊️ Exploring - strange sounds, enemies, unknown territories<br/>🕊️ Taking care of family - making family safe, fed, and warm<h3>PROTECT YOUR FAMILY</h3>As a father, since the first breath of your child, you’ve always known the responsibility relies on your shoulders… but the stakes were never that high. Do what you must to keep your wife and son alive.<br/><br/><h3>FARM, HUNT, IMPROVISE</h3>Nothing can be taken for granted now. You will have to earn every meal and bargain for each piece of comfort for you and your family using extreme measures. Hunt for wild animals, make forest recipes, and, as a farmer, use your skills to create a new home during the occupation…<br/><br/><h3>SURVIVE</h3>Sneak, wait for your moment, and ATTACK! Every. Second. Counts. Your enemies are cunning and trained. Can you handle that while being \"just\" a farmer? Your everyday abilities may come in handy so don’t underestimate yourself and keep trying!<br/><br/><strong>After all, you’ve got nothing to lose and everything to gain.</strong>", "metacritic": null, "released": "2024-03-22", "tba": false, "updated": "2024-03-25T10:24:18", "background_image": "https://media.rawg.io/media/screenshots/74b/74bf2ae4ab5769af0e3c86d22be30fe6.jpg", "website": "http://www.freemind.games", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 450, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Freemind"], "genres": ["Action", "Adventure", "Simulation", "Casual", "Indie"], "publishers": ["PlayWay", "FreeMind"], "esrb_rating": null}