{"id": 978921, "slug": "battle-room-beta", "name": "Battle Room Beta", "name_original": "Battle Room Beta", "description": "<strong>BATTLE ROOM BETA</strong> offers an immersive online multiplayer TPS shooter experience, completely free as a beta version. No daily maintenance, installation or complex configuration required: Just start the game! As simple as opening a door, incredibly easy to get into the action! <br/><br/>Non-stop adrenaline-filled excitement awaits you in different battle rooms where 2 teams will face each other! Players will be able to enjoy high-quality graphics even on very low-end devices!<br/><br/><br/><br/><h3>KEY FEATURES</h3><br/><ul><li><strong>Limited edition characters with unique abilities</strong> for the beta version, but with fairly balanced gameplay.<br/><br/><br/><br/><br/><br/></li><li>2 different levels that present familiar objects and interesting environments for exploration.<br/></li><li>Continuous weapon discoveries and utilization for strategic advantage.<br/></li><li>Cross-platform playability between PC and mobile devices, supporting multiple languages.</li></ul><h3>FUTURE UPDATES</h3><br/>In the near future, <strong>BATTLE ROOM</strong> will introduce:<br/><br/><ul><li>2 additional game modes.<br/></li><li>Over 10 new levels and 20 additional characters for expanded gameplay.<br/></li><li>Character customization options for personalization.<br/></li><li>Features like ranking systems, achievements, and new items for enrichment.<br/></li><li>A diverse array of unique weapons to unlock and master.<br/></li><li>New abilities like climbing and dodging bullets.</li></ul>", "metacritic": null, "released": "2024-03-22", "tba": false, "updated": "2024-03-25T08:33:57", "background_image": "https://media.rawg.io/media/screenshots/b2c/b2c33d5b776a7db78a9decf6a65a787f.jpg", "website": "https://axhorn.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 341, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Axhorn Games"], "genres": ["Action"], "publishers": ["Axhorn Games"], "esrb_rating": null}