{"id": 978918, "slug": "the-forgotten-worldprologue", "name": "The Forgotten World:Prologue", "name_original": "The Forgotten World:Prologue", "description": "<strong> The difference between the prologue and the official version<br/>Characters: 2 are available in the prologue and 8 in the official version.<br/>Chapters: 2 prologues, 6 official versions</strong><br/><br/><br/><strong>This is about Alice after Wonderland.<br/>Oblivion is the vilest of spells. As an adult, Alice also experiences a less fairytale-like life and stops dreaming, which also means that everything about Wonderland is slowly disappearing. The people of Wonderland have even forgotten why they exist, and before everything dissipates, the Cheshire Cat casts a phantom spell to try to find Alice in the hope that she can save Wonderland once more.<br/>But the Cheshire Cat can't remember the spell either, and the wrong spell sends it traveling to a parallel world, a world where Alice has no idea that Wonderland even exists.<br/>In order to keep Wonderland from being forgotten, the Cheshire Cat brings Alice from each parallel world back to Wonderland, trying to awaken people's memories, and despite failures after failures, the Cheshire Cat still believes that he will find the right Alice. </strong><br/><br/><br/><br/><strong>Play as different Alice and utilize different abilities and decks to defeat your enemies, each Alice has her own story! </strong><br/><br/><br/><br/><strong>Spellbound \"monsters\" are not real monsters, so defeat them to break the spell and discover their true nature! </strong><br/><br/><br/><br/><strong>Playing cards, which seem to be everywhere, will become your biggest fighting force at this moment! Poker soldiers can get different runes to increase combat power! </strong><br/><br/><br/><br/><strong>Arrange Poker Pawns of the same number of points or color to get a reinforcement effect, they don't have emotions but are very good at fighting! </strong>", "metacritic": null, "released": "2024-03-22", "tba": false, "updated": "2024-03-25T08:21:18", "background_image": "https://media.rawg.io/media/screenshots/3a0/3a0eb34400dbd46d3b61153f7b10ad66.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 11}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 261, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Meowtoy Games"], "genres": [], "publishers": ["BD Games"], "esrb_rating": null}