{"id": 978926, "slug": "wishbound-desires", "name": "Wishbound Desires", "name_original": "Wishbound Desires", "description": "<h3>Dynamic Strategy</h3><br/>Craft your card deck in the heat of battle, strategically adapting to the challenges presented by each enemy. Each foe can be defeated in various ways, offering different rewards to shape your next turn. Therefore, even a well-placed strategy against the weakest enemy can turn the tide of battle. Each conquered mission offers powerful cards and perks that enhance and personalize your deck. Choose wisely, as the unclaimed rewards may be lost forever, and enemies grow stronger and fiercer after each mission.<h3>Enchanting Artistry</h3><br/>Immerse yourself in a world brought to life with breathtaking artwork. Enjoy the alluring charm of the beautiful girl spirits that befriend you on your journey. Each character, creature, and landscape is intricately designed and meticulously crafted, drawing inspiration from the rich tapestry of Japanese folklore. Let the music serenade you with a mesmerizing score as you delve deeper into this enchanting realm.<h3>Enigmatic Romance</h3><br/>Traverse a narrative brimming with fun, heartwarming romance, melancholic sadness, poignant regret, and unexpected plot twists. Fall in love with your enchanting but mysterious companions, betray your friends, make a deal with an ancient devil, dabble in dark magic to grant your wish. Your story await in this enchanting odyssey. Just be careful what you wish for; it might just come true.<br/><br/>", "metacritic": null, "released": "2024-03-22", "tba": false, "updated": "2024-03-25T08:54:31", "background_image": "https://media.rawg.io/media/screenshots/a80/a80abb7209328e8023e2c32508cf04cd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 524, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Minami chan"], "genres": ["Adventure", "Strategy", "Indie"], "publishers": ["Minami chan"], "esrb_rating": null}