{"id": 978951, "slug": "lost-love-island", "name": "Lost Love Island", "name_original": "Lost Love Island", "description": "Every party is only as good as its healer. A motto followed by young adventurer Lloyd when he teams up with Meryl, a healer whose talent is only surpassed by her beauty. Everything seems to go fine up until their ship gets sunk by a kraken, leaving them both stranded on a lone island. From now on it's up to Lloyd to survive and take care of Meryl. Clothes, food, tools and weapons, he has to scout the island for resources and crafting materials while hunting animals and chopping wood in a game of survival and exploration.<br/><br/>Eventually, Lloyd and Meryl learn that they're not alone on the island. Other survivors made it out of the ship too, and they even meet a small number of local inhabitants. Some of them join Lloyd and Meryl, united in their will to find a way to set sail back home again.<br/><br/><h3>Survival Mechanics:</h3>Lloyd has to manage his stamina as he's exploring the island. If it runs out while he's traveling alone, he won't be able to make it back to Meryl at the camp until the next day. Stamina can be replenished by cooking various meals.<h3>Crafting System:</h3>To progress the game and explore the island, Lloyd will need to craft an assortment of tools. Cutting wood, catching fish, hunting wild animals and setting up new pathways with bridges or ropes will be among the most essential tasks in the quest for survival.<h3>Changeable Appearance:</h3>Meryl has four different outfits to pick from. Some need to be found before she can wear them. Furthermore, the island's bright sun may have an effect on Meryl's skin, lending her pale complexion a darker, tanned tone. Meryl's appearance can be changed at any time, only depending on game progress.<h3>Affection:</h3>Manage an affection system based on character actions. The choice is yours!<br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/>", "metacritic": null, "released": "2024-03-22", "tba": false, "updated": "2024-03-25T10:48:08", "background_image": "https://media.rawg.io/media/screenshots/70b/70b0d3b20d9d3735adc13d93cce07f0f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OneCoin"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Saikey Studios"], "esrb_rating": null}