{"id": 979066, "slug": "acolyte-of-the-altar", "name": "Acolyte of the Altar", "name_original": "Acolyte of the Altar", "description": "Hunt through the wastelands for colossal Beasts in this roguelike deckbuilder. Beware! Beasts grow stronger during battle, allowing them to consume your creatures or counter your spells. Carve profane Gifts from these behemoths and grow stronger to serve your Patron! But serve them to what end?<br/><br/><h3> Hunt the Beasts </h3>Test your wits and your deck against titanic creatures called Beasts, who evolve as you fight them! Rush them down before they reach their potential, or bring large threats of your own to match their strength. Feel the tension of fighting a giant and the excitement of triumphing against the odds with each encounter!<br/><br/><br/><h3> Their Rage Builds </h3>As you fight a Beast, their rage will grow and they will unlock new abilities! Beat the whimsical Gilded Grifter at his cup game to gain an advantage. Or, feed The Yearning Woods' Consume ability, which fills its health bar and its stomach... until eventually it bursts!<br/><br/><br/><h3> Cut Off their Limbs! </h3>Fight back against the Beasts by infesting them with various swarms of insects, setting parts of them on fire, even cutting off limbs and depriving them of their abilities. Interaction with the Beasts lies at the heart of Acolyte of the Altar.<br/><br/><br/><h3> Gifts From Above... Or Below? </h3>After slaying a Beast for the first time, you can offer their body to your Patron, who will carve a new Gift.  At the start of a new area, your Patron will bless you with a choice of these gifts that can dramatically alter how you hunt. Take the Crumbling Monument's Skyscraper Sword and make your tallest creatures even bigger. Or capture the elusive Mini Jelly who will zap enemies when you cast spells! However, these profane gifts weigh down your spirit by varying amounts, so be careful with your choices!<br/><br/><br/><br/><br/><br/>Best of luck, Acolyte, and may your Patron bless you!<br/><br/><br/>", "metacritic": null, "released": "2024-03-25", "tba": false, "updated": "2024-03-29T06:34:58", "background_image": "https://media.rawg.io/media/screenshots/8d8/8d8724a8a736299f85c7fcdf85fd3cd0.jpg", "website": "https://blackkitegames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 422, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Black Kite Games"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Black Kite Games"], "esrb_rating": null}