{"id": 979007, "slug": "wandering-cat-2", "name": "Wandering Cat", "name_original": "Wandering Cat", "description": "\nThis is the story of a cat without a name and family who wanders in search of the best food in the world. He is a demanding cat, who is not satisfied with anything. He has tasted a thousand different flavors, but has not yet found the perfect one. <br/>\nOne day he is in danger, but is saved by a mysterious human who also offers him some excellent food. The cat decides to follow him, heading towards a small village called Dofos. <br/>\n<br/>\nHere begins his adventure to discover a new and dangerous world. He must learn to survive in a hostile environment, full of monsters and dangers. But he also has the chance to make new friends, experience new flavors and discover his true place in the world. <br/>\n<br/>\n <br/><br/>\nAs you embark on your adventure, you will need to use your skills and cunning to survive. You will also need to use your sense of smell to find the best food in the world! <br/><br/>\nWandering Cat is a must-play for all cat lovers and adventure fans. <br/> \n\n<ul>\n<li><strong>The world of Wandering Cat</strong> is full of colorful characters and creatures. Players can meet other cats, humans, monsters and even mythical creatures.</li>\n<li><strong>The story of Wandering Cat</strong> will guide you in a whirlwind of flavors, friendship and even some good moments of relaxation.</li>\n<li><strong>The gameplay of Wandering Cat</strong> is challenging and rewarding. Players will need to use their skills and creativity to overcome obstacles and solve puzzles.</li>\n</ul>\n<p>\n<br/>\n <br/><br/>\nThis project is developed only by me and is a gift for my children, which is why I want to make it in the best way. If you want to support the project I will greatly appreciate your feedback!\n</p>\n<p>\n</p>", "metacritic": null, "released": null, "tba": false, "updated": "2024-03-25T15:01:16", "background_image": "https://media.rawg.io/media/screenshots/2ec/2ecbf050856fe9fcade8f0e78b0d6672.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 403, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Daevis"], "genres": [], "publishers": ["Daevis"], "esrb_rating": null}