{"id": 979093, "slug": "nyzd", "name": "NYZD", "name_original": "NYZD", "description": "NYZD is a Third person zombie shooter featuring up to 4 players local and online co-op.  <br/>\r\nYou have to battle swarms of mutants in order to survive. You can choose 4 different characters and buy new weapons from the trader buy earning money killing zombies or collecting the gold bars scattered around the maps. There are 8 different maps for you to choose and play with your friends by LAN. <br/>\n<br/>\n<br/>\r\nEverything started after meteorite hit New York and scientists found a living virus after examining the meteorite. Government tried to turn this virus into a bioweapon by infecting worms with the virus and genetically altering them but it ended up with a catastrophe soon the whole world was devastated. Only couple cities were left those who survived walled off their cities in order to protect themselves from hoards of mutants. You are one of the few NYZD infection control units  who somehow managed to survive the hordes of mutants. Your duty is to clean up the designated areas near New York City to help expand the city.<br/>\n<br/>\n<br/>\r\nAnd before you say bro it's just another zombie shooter game.<br/>\r\n Well..... you may be right lol but give it a try this time there's more explosions and cool maps to consooom. <br/>\n<br/>\r\nAnd one more thing if you end up stuck in backrooms Developer does NOT take any responsibilities whatsoever you gotta noclip yourself back to reality <br/>\r\n(alt f4 might help)", "metacritic": null, "released": "2024-03-25", "tba": false, "updated": "2024-03-29T07:26:54", "background_image": "https://media.rawg.io/media/screenshots/e20/e20ea7e609a88c6a4fde0e1e5ac9bb11.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 444, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Plasma  Interactive"], "genres": ["Action"], "publishers": ["Plasma  Interactive"], "esrb_rating": null}