{"id": 979002, "slug": "letmeout-2", "name": "LetMeOut", "name_original": "LetMeOut", "description": "Bundy is a scholar with a long history. <br/><br/>You witness deep within him his research to cure his wife's dementia. <br/><br/>The research involves extracting all electrical signals from neurons in living people, and you may also be a victim.<br/><br/>You must escape from deep memories and solve various puzzles that he prepares to test others.<br/><br/>Escape by solving problems such as chess, which he enjoyed playing with his wife, complicated hospital facilities, and locked doors.<br/><br/>He must also run away from his wife's symptoms, the attacks from the test subjects, and his memories of the past.<br/><br/><strong>Gameplay</strong><br/>Let Me Out is a game in which players must survive through five stages by finding items that can help them escape from each test subject. Solve puzzles, gimmicks, subject tracking, and more to survive and pass the final stage.<br/><br/><strong>SYNOPSIS</strong><br/><br/>Bundy studied dolls with artificial nerves to preserve memories for long periods of time.<br/><br/><br/>He recruited outstanding scholars from various fields to the academy to treat his wife. And we tested whether they had developed memories and brains.<br/><br/>Let Me Out consists of a total of 5 stages and experiences various places in Bundy's memories. <br/><br/>There are also past images in the form of electrical signals. <br/><br/>You must retrieve your mind and memories through the countless puzzles and layers of memories he shared with Julia. <br/><br/>No, should I take it back? <br/><br/>Does it matter?<br/><br/>We must remember, in memory.<br/><br/>---------<br/><br/><strong>Part of Bundy's research diary</strong><br/><br/>Is the human subject the body? Is it mental?<br/><br/>If it is the mind, is it memory? Or is it something like a soul that creates thoughts?<br/><br/>If someone else can take it, will I be that person?<br/><br/>Dementia...isn't it about losing that...?", "metacritic": null, "released": "2024-03-23", "tba": false, "updated": "2024-03-25T14:36:52", "background_image": "https://media.rawg.io/media/screenshots/1cf/1cff412bc2f03ab4af0e436f6afa4eeb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Eojin Kim", "Hojin Lee", "Seungyong Sim", "JunHoo Lee", "Eunhye Kim"], "genres": ["Strategy", "Indie"], "publishers": ["EclipseStudio"], "esrb_rating": null}