{"id": 97903, "slug": "tiny-combat-redux", "name": "Tiny Combat Redux", "name_original": "Tiny Combat Redux", "description": "Demo Day 20 Build\r\n<p>Tiny Combat Redux is an almost complete rebuild from the ground up of Tiny Combat. The original game started as one thing, but as I built it out, it started to become something completely different. Redux is the game that Tiny Combat was trending towards, but built with that purpose, and game mechanics, in mind.</p>\n<p>Currently the game is in a very prototype/proof of concept stage. There are a lot of core mechanics missing (such as the campaign map, munitions, and hangar) that would push the game beyond the very simple arcade flying game it is now.<br/></p>\r\nDemo Gameplay\r\n<p>Choose a jet to fly around in the Arena mode and shoot at the targets. They are patrolling their respective areas and will engage you if you get too close. Each group has a different difficulty level along with different aircraft.</p>\n<p>If you get shot down, you can restart by going to the main menu and reloading the Arena. The Campaign mode is meant to be the meat of the game, but it's currently under heavy development and not playable yet.</p>\r\nAvailable Aircraft\r\n<p>There are four aircraft available. I recommend flying the first two as they are the easiest to fight and fly in, but there are two more planes if you want an extra challenge.</p>\n<p>The current flight models are <strong>very</strong> placeholder, so there's not much to flying right now, but in the future they should be more nuanced with more believable physics.</p>\n<p><strong>F-8 Crusader</strong> - The dogfighter of the bunch, it's the most nimble and has quad cannons that can put out a wall of lead. However, they have a low muzzle velocity and the guns aren't particularly accurate.</p>\n<p><strong>MiG-29 Fulcrum</strong> - The most balanced and easiest to fly of the aircraft available. Very stable, very maneuverable, and with a reliable gun.<br/></p>\n<p><strong>MiG-21 Fishbed</strong> - Primarily a high speed interceptor. Is the fastest, with a balanced cannon and a very fast roll rate, but can't turn with the other planes. Its tiny profile makes it difficult to hit.</p>\n<p><strong>F-105 Thunderchief - </strong>Big fighter with an amazing gun. The M61 Vulcan has an obscene rate of fire and is very accurate with a high muzzle velocity. However, it is heavier and can't turn very well.</p>\r\nControls\r\n<p>For the demo, the game is optimized around an Xbox One controller. If you have it, it's highly recommended you use it. In the future I'd like to have much more robust options for input. I can't guarantee it'll work well with other gamepads. Backup mouse and keyboard controls have been added.<br/></p>\n<p>There are <strong>three control schemes </strong>selectable from the pause menu.</p>\n<p><strong>Gamepad</strong> - Disable all mouse controls completely.</p>\n<p><strong>Delta Mouse</strong> - Controls the aircraft similarly to a first person shooter. Dragging the mouse will drag the nose of the aircraft in that direction. When the mouse stops moving, the aircraft stops turning.</p>\n<p><strong>Virtual Joystick </strong>- Uses the mouse to emulate joystick inputs. Centering the mouse on the center of the HUD will center the virtual stick. Pushing it up/down will pitch the nose up/down. Moving it to the left or right will perform a blended yaw/roll to turn the plane in that direction.</p>\r\nXbone Controller (Recommended)\r\n<ul><li>Gun: A</li><li>Pitch: Left Thumbstick Up/Down</li><li>Roll: Left Thumbstick Left/Right</li><li>Yaw: Left/Right Triggers</li><li>Speed up: Left Bumper</li><li>Slow down: Right Bumper</li><li>Look around: Right Thumbstick</li></ul>\r\nKeyboard\r\n<ul><li>Gun: Left Mouse Button / Space</li><li>Rudder: Q/E\r\nPitch: Mouse Y</li><li>Roll: Mouse X</li><li>Speed up: Left Shift</li><li>Slow down:Left Ctrl</li><li>G: Landing gear</li></ul>\r\nKnown issues\r\n<p>Both these issues can be resolved by restarting the game.</p>\n<ul><li>Delta mouse has a visible mouse</li></ul>\r\nChangelog<p><strong>1.3</strong></p>\n<ul><li>Mouse re-appears correctly when going from the spectator camera to the main menu. This is a partial fix, but good enough for the demo.</li><li>Fixed bug where AI spawned without AI and flew off the map</li><li>Shadow flickering on terrain should be reduced</li><li>Guns have infinite ammo</li></ul>\n<p><strong>1.2</strong></p>\n<ul><li>Cleaned up interaction between spectator cam and pause menu</li><li>Delta mouse made the default setting</li></ul>\n<p><strong>1.1</strong></p>\n<ul><li>Spectator cam shows a message about what to do after death</li><li>Spectator cam text shouldn't clip through terrain anymore </li></ul>\n<p><strong>1.0</strong></p>\n<ul><li>Release</li></ul>", "metacritic": null, "released": "2018-05-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d7e/d7e75ce97024a20f6a6a604166919ef4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Why485"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}