{"id": 979079, "slug": "do-a-barrel-roll", "name": "Do A Barrel Roll??", "name_original": "Do A Barrel Roll??", "description": "<strong>Do A Barrel Roll??</strong> provides a challenging and punishing platforming experience. Despite the punishing level design that may undo a lot of progress with a mistake. There is no time for being sad because the hesitation will only increase the damage. With a combination of skill and level knowledge. Taking appropriate action in the right time can minimize the damage. Providing a punishing yet fair gameplay experience. Exploring more potential save or route when progressing through the level. Providing a unique and satisfying experience. Climb the mountain or not, it's up to you. This is a journey only belongs to you. So may it be meaningful.<br/><br/>Each area presents different themes and Characters. Apart from the first area, each later area will also introduce a new level mechanic to keep the gameplay fresh. The first area act as the training area. Introducing most tricks from basic mechanic. Ability of preforming these tricks will be truly put to the test in the later areas.<h3>Gameplay:</h3>- Unique Control Scheme<br/>The barrel is fully controlled by the cursor. Where Moving the cursor around the barrel to spin it. And clicking on the ground to jump toward the opposite direction. Player will needs to adjusting the momentum of the barrel and aiming for the jump at the same time. Which the two controls directly affecting each other. Demanding a constant attention to the barrel and the level at the same time.<br/><br/><br/>- Exploring and Observing the Level<br/>The barrel won't stop moving since it is rounded. But it doesn't mean no resting is allowed. You can press [esc] to stand up when on a flat ground and being almost still. Sometime taking a break can have you better prepare for the future. When standing up, you can look further. Identifying potential speed run route or saving method from a mistake.<br/><br/>- Recover from Mistake<br/>Human makes mistake, we all do. It is ok to make mistake, but there is no time to feel bad. As you will have to minimize the damage the mistake does to you. It do make a huge different. Since it is possible to undo all the progress if you do nothing and just watch it fall. Therefore, identify potential danger and saving method will be a big deal.<br/> <br/><br/>- Creative Use of Mechanics<br/>The control may looks simple. But there is probably a lot deeper than you think. Apart from how well can you control it to do platforming. It is almost also a puzzle game for the way of progressing through level with the mechanics you have on your hand.<br/><br/><br/>Credit:<br/>Featuring Music by Matthew Pablo<br/>http://www.matthewpablo.com<br/><br/>Featuring Music by The Cynic Project<br/>https://cynicmusic.com/", "metacritic": null, "released": "2024-03-24", "tba": false, "updated": "2024-03-29T07:01:27", "background_image": "https://media.rawg.io/media/screenshots/136/136402a088b4aafcd0ee216c9b120102.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SolThunder"], "genres": ["Indie"], "publishers": ["SolThunder"], "esrb_rating": null}