{"id": 979069, "slug": "artifact-seeker", "name": "Artifact Seeker", "name_original": "Artifact Seeker", "description": "<strong>The unique “Artifacts sharing code function” allows you to share the Artifacts you collect with your friends! !<br/>Artifact Seeker is a 3D Roguelike Survivor RPG game. A game of gods, with Aurorium as the board, And all the mortals as their pawns and swords. You can obtain artifacts by slaying corrupted enemies, collecting gold to exchange it for artifacts at mysterious merchants. How to use the power of artifacts, to play the game of gods? to end the game of gods or to become a god yourself. Artifact Seeker, Your choice. </strong><br/><br/><br/><br/><strong>Dozens of evolvable skills, extreme sprint dash, and the ultimate special skill to slay enemies! </strong><br/><br/><br/><br/><strong>Intense paced battles, you can buy artifacts to boost your power after each battle! </strong><br/><br/><br/><br/><strong>Hundreds of different artifacts with matching skills to create a wide variety of bond Synergy, and utilize the power of the synergy to challenge higher level enemies! </strong><br/><br/><br/><br/><strong>RPG like Events, diverse choices, adventuring dungeons, exploring magical worlds, befriend different heroes and unlock new characters! </strong><br/><br/><br/><br/><strong>Hundreds of affixes and attributes, dozens of different meta-progressions, weapon unlocking and strengthening, and sharing your own unique artifacts with your pals! There's new contents to experience after every run! </strong><br/><br/><br/><br/><strong>Explore the world and discover the hidden secrets behind the story! </strong>", "metacritic": null, "released": "2024-03-24", "tba": false, "updated": "2024-04-17T19:13:35", "background_image": "https://media.rawg.io/media/screenshots/ee8/ee8a71947d1a7d4f31e490739e9d400c.jpg", "website": "https://space.bilibili.com/477798708", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 465, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Lynkpin Game"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["BD Games"], "esrb_rating": null}