{"id": 97902, "slug": "after-the-bell-rings-yuri-jam-2015", "name": "After The Bell Rings (Yuri Jam 2015)", "name_original": "After The Bell Rings (Yuri Jam 2015)", "description": "<p><strong>Prototype Release:</strong> October 28th, 2015 (YuriJam 2015 Demo)<br/><strong>Final Release:</strong> 2018<br/>\n</p>\n<p>\n<em>After The Bell Rings</em> is the story of Mana and Sayaka, two young adults whose roads suddenly crossed one night. Mana is an English teacher in High School and Sayaka is a punk-rock free spirit who wants nothing but make Mana's life more enjoyable.</p>\n<p>Meanwhile, Mana needs to deal with the fact that her students are experiencing troubles of their own. From the deeply depressed Saki who struggles to open up about herself to the constantly-in-trouble Yuri who can't keep herself from breaking school rules. <br/>\n</p>\n<p>\r\n\tDealing with the topic of clashing perceptions of marginalized gender and sexuality groups along with the trouble romances can bring, \r\n\t<em>After The Bell Rings</em> is a fairly serious visual novel inspired by the struggles people face every day.</p>\n<p>\r\n\tFor \r\n\tYuriJam 2015 we released the prologue chapter, then called chapter 1, as a free demo to download. This demo shows off the first portion of the story as it was written at the time, though it's not reflective of the final game any more.</p>\n<p>Character designs and illustrations are drawn by storyboos, who've been part of the project since 2015. The full game is set to hopefully release some time in 2018.<br/>\n</p>", "metacritic": null, "released": "2015-10-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1b6/1b6604f46a89c78c9c25d210b0d5c422.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Andrea律"], "genres": [], "publishers": [], "esrb_rating": null}