{"id": 979085, "slug": "tensei", "name": "TENSEI", "name_original": "TENSEI", "description": "\"Tensei\" is an ultra-casual endless action game.<br/><br/>Leap and fall over and over in the style of a brush flowing across paper,<br/>and go on a relaxed journey into the sky. Leave the hectic routine of life behind<br/>for a chance to enjoy this deeply immersive experience.<h3>Playstyle</h3><strong>[Unique Low-Gravity Floating]</strong><br/>Project yourself into the game, relax, and let yourself become immersed in gameplay.<br/><br/><strong>[Purifying Worldly Desires]</strong><br/>You can purify damage zones by dropping (rapidly falling) onto them.<br/>Focus and master the tricks of aiming as you make your way into the skies, avoiding damage as you go.<br/><br/><strong>[Become a Majestic Dragon]</strong><br/>Use triple jumps to navigate from platform to platform while collecting Orbs (ink droplets). Orbs can grant you Boost Mode, letting you turn into a dragon and giving you dynamic flight abilities to navigate new areas.<br/><br/>Game livestreams and videos may be distributed freely<br/>for this title subject to confirmation of and compliance<br/>with the following guidelines.<br/><br/>We do not issue separate software licenses. Your understanding is appreciated.<br/><br/><strong>・Please display the following copyright notice.</strong><br/><br/><br/><strong>・Creation of content including the following is not permitted.</strong><br/>　　- Content encouraging discrimination based on race, sex, etc.<br/>　　- Sexually abusive or explicit content<br/>　　- Content encouraging injurious, anti-social, illegal, or criminal actions<br/>　　- Content that contravenes social morality or other offensive videos<br/><br/>　We may delete or request deletion of any content that we find<br/>　to be inappropriate or undesirable, at our own discretion.<br/><br/><strong>・Extraction of individual images, music, soundtrack and other<br/>　elements of the game for posting or distribution is not permitted.<br/>　(Such as extracting only the soundtrack for a stream, etc.)</strong><br/><br/><strong>・We are not liable for any issues experienced by streamers or<br/>　audience members arising from streaming or posting of videos.</strong>", "metacritic": null, "released": "2024-03-25", "tba": false, "updated": "2024-03-29T07:13:11", "background_image": "https://media.rawg.io/media/screenshots/e9b/e9bf7c0f05d26056c656e91f7de5174c.jpg", "website": "https://tensei-game.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 483, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Project Pegasus"], "genres": ["Action", "Casual", "Indie"], "publishers": ["NEURON-AGE"], "esrb_rating": null}