{"id": 979136, "slug": "colony-city-27l", "name": "Colony City 27λ", "name_original": "Colony City 27λ", "description": "<h3>◆ Chaotic Era of Space Colonization </h3>The Universal Security Bureau is the official institution maintaining cosmic order. Investigator Youzi, in pursuit of team achievements and to aid her captain boyfriend, ventures away from Earth to undertake perilous missions alone.<br/><br/><h3>◆ Rich battle contents and battle sex scenes</h3>In the chaotic space colony, there are three major types of enemies: humans, tentacles, and machines. Each of the 36 types of enemies has its own unique battle sex scenes (some actions are duplicated).<br/><br/>◇Choose from random skills to build your ideal command card deck. There are hundreds of skills waiting for you to unlock.<br/>◇Ripping clothing, bondage, and forced intercourse—make good use of these mechanisms to find the possibility of victory in adversity!<br/><br/><h3>◆ The inevitable path of corruption...?</h3>In the face of the violations from various enemies and the training of malicious businessmen, can Youzi hold on to her feelings for her boyfriend?<br/><br/>◇Sex of defeat on the different stages will increase the heroine’s corruption value.<br/>◇6 types of endings, each containing cockhold elements!<br/><br/><h3>◆ Review mode outside the main storyline</h3>Including: plot recap, free battle, and battle sex replay modes.", "metacritic": null, "released": "2024-03-26", "tba": false, "updated": "2024-03-29T09:15:36", "background_image": "https://media.rawg.io/media/screenshots/1bb/1bba796e10393f49167055530d0d14b3.jpg", "website": "https://www.facebook.com/gaming/playmeowGame", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bunny Eats Tiger"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Playmeow"], "esrb_rating": null}