{"id": 979104, "slug": "epic-of-brave", "name": "Epic of Brave", "name_original": "Epic of Brave", "description": "<strong>Epic of Brave</strong> is a <strong>multiplayer online battle arena (MOBA)</strong> adventure where the players can create strategical tactics, craft exceptional weapons, combine powerful spells and experience ultimate battles.<br/><br/>Enhanced with real-time multiplayer experience, flawless controls and beautiful graphics the players can join different matches, collect rare and exceptional materials, customise their heroes and team up against powerful enemies.<br/><br/><strong>Join the battle between Sentinels and Resistance!</strong><br/><br/><h3>Battle or Campaign</h3><strong>Matches</strong> are intense, quick-fire engagements where you face off against other players or AI-controlled opponents. Victories in Matches earn you a variety of Resources such as currency, experience points, and specific match-related loot. The more challenging the Match, the greater the rewards. Additionally, exceptional performances may grant bonus Resources, encouraging players to push their limits and strive for excellence in every engagement.<br/><br/><strong>Campaigns</strong>, on the other hand, are more extended, story-driven missions that are solo endeavors. These offer a different set of challenges and opportunities. Successful completion of Campaign objectives yields not only substantial Resources but also rare and unique Materials that are crucial for crafting advanced weaponry and armor.<h3>Meet the Metropolis of Champions</h3>Choose any of the four Champions - <strong>the Paladin Tyriel</strong>, <strong>the Warrior Barath'Dur</strong>, <strong>the Archer Alessia</strong> or <strong>the Mage Rachel</strong>. Every one of them is gifted with different set of skills and expertise, making them unique and invaluable allies in the face of any challenge. Each champion possesses unique strengths and abilities that can be utilized to strategically overcome any obstacle.<h3>Climb the Ranking</h3>Every <strong>Match</strong> and <strong>Campaign</strong> gives you the chance to prove your battle expertise and brings you closer to one of the five exceptional <strong>Ranks</strong>:<br/>- <strong>Apprentice</strong> 1-6 Level<br/>- <strong>Champion</strong> 6-12 Level<br/>- <strong>High Lord</strong> 12-18 Level<br/>- <strong>Manipulator</strong> 18-24 Level<br/>- <strong>Illuminati</strong> 25 Level<h3>Craft Epic Weapons and Armors</h3>The participation in <strong>Matches</strong> and <strong>Campaigns</strong> grants you <strong>Resources</strong> and <strong>Materials</strong>, which you can exchange or use to build unmatched Weapons and Armors. As you engage in the thrilling <strong>Matches</strong> and challenging <strong>Campaigns</strong> that await you, you will amass an abundance of Resources and Materials. These valuable resources are the key to crafting the ultimate weapons and armor, empowering the Look of your Champions.<h3>Accomplish Quests and Achievements</h3>The Excellence in Battle is recognised and collected in the form of <strong>Achievements</strong>. They enhance your <strong>Visual Representation</strong> and serve as a testament to your prowess on the battlefield. <strong>Achievements</strong> are badges of honor, earned through skill, strategy, and valor. As you accumulate these accolades, your <strong>Visual Representation</strong> undergoes a transformation, reflecting the milestones you've achieved in your journey.", "metacritic": null, "released": "2024-03-25", "tba": false, "updated": "2024-03-29T08:08:09", "background_image": "https://media.rawg.io/media/screenshots/2db/2dbb98345311ee6a92399588abfcd042.jpg", "website": "https://epicofbrave.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Epic of Brave"], "genres": ["RPG", "Massively Multiplayer"], "publishers": ["Epic of Brave"], "esrb_rating": null}