{"id": 979194, "slug": "the-wrath-of-the-goose-king", "name": "The Wrath of the Goose King", "name_original": "The Wrath of the Goose King", "description": "The <strong>Wrath of the Goose King</strong> is a turn-based roguelite, where you recruit red pandas, collect powerful spells and gear to fight the evil Goose King and his minions. Create your perfect team and show the geese who is the boss!<h3>Fight your way through the Goose Army</h3>Join Hiro, our red panda protagonist, as he tries to break free from the Goose King's grasp. Each of your escape attempts are unique: you will encounter different power-ups, team members, enemies and events. You can even unlock permanent bonuses as you progress through the story.<br/><br/><h3>Join the panda party</h3>Other red pandas have your back! Recruit combat specialists, such as Sir Muffins, the devoted paladin; or Pandalf a traditional spellcaster, to boost the power of your pandaparty. There are 12 classes to choose from. Give all of them a try and master their combat style.<h3>Designed for replayability</h3>Enhance the might of your party even further by obtaining additional spells, gear and ice cream bonuses. There are over a 100 spells to try, another 100 gear pieces to equip and 12 ice cream bonuses to taste for additional flavor. Find powerful synergies to become stronger than the Goose King himself!<br/><br/><h3>A journey you will remember</h3>On your quest to save all red pandakind, you will meet dozens of funny characters and enemies to ensure your journey is memorable. Once you have finished the main story, you can unlock 9 secret endings to discover secrets about the main characters, learn more about the world or just to have a good laugh!<br/><br/>Don't be a silly goose: recruit your pandamembers and join the fray!<br/><br/>", "metacritic": null, "released": "2024-03-27", "tba": false, "updated": "2024-03-29T11:53:43", "background_image": "https://media.rawg.io/media/screenshots/22a/22a19ec31611d0484264db19544eb809.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SillyGooseGames"], "genres": ["RPG", "Indie"], "publishers": ["SillyGooseGames"], "esrb_rating": null}