{"id": 979175, "slug": "outflow", "name": "Outflow", "name_original": "Outflow", "description": "The year 2450, Earth's energy resources were running out. So mankind went to another planet in search of a sustainable source of energy. The discovery of Spica A, a new planet with similar characteristics to Earth, gave people new hope, but it lacked a source of electricity. No other resource on Spica A could replace electricity. Ever since they left Earth, it has been impossible for humans to return. The facelesses have taken control of the world's electricity. <br/>\n<br/>\r\nConnections had to be established with the electric fields and energy had to be transported to Spica A from areas of rugged conditions.  Facelesses built towers resistant to the energy of this region and the Earth's atmosphere. These towers provide resources of their own by transferring energy. Therefore, the enemies started a fierce struggle against humanity to protect the energy towers.<br/>\n<br/>\r\nThe main character is tasked with the difficult process of energy transfer and defense against the enemies in order to transfer electricity to Spica A. He landed at the only remaining headquarters on Earth and began his preparations.<br/>\n<br/>\r\nYou are Atlas and will keep fighting with the enemies until you reach to the electricity transfer point. Atlas can interact with the objects like cars or checkpoints in this third person action role playing game. He can also perform some sword and bow skills to defeat the enemies. Manually simulated sword mechanic allows you to improve your fighting skill with your experience. You will need to take care of your car's damage and fuel state while you try to keep your journey in track.", "metacritic": null, "released": "2024-03-26", "tba": false, "updated": "2024-03-29T10:56:42", "background_image": "https://media.rawg.io/media/screenshots/a74/a74007ce0bc0590943b4b67d05c7bce7.jpg", "website": "https://horizonity.com/outflow/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 362, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Horizonity"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Horizonity"], "esrb_rating": null}