{"id": 979145, "slug": "go-fight-fantastic", "name": "Go Fight Fantastic", "name_original": "Go Fight Fantastic", "description": "<strong>Go Fight Fantastic</strong> is a 1-3 player hack n’ slash starring a crew of interstellar smugglers, led by their space-dog captain Bowie. When they stumble into an invasion during a mission to Bird Planet, they become the only hope of this once peaceful world. <br/><br/>Team up in<strong> co-op </strong>(local and online) or switch between the different characters on-the-fly in <strong>solo play.</strong><br/><br/><h3>Story Mode</h3>Fast-paced. Light-hearted. Vibrantly hand-drawn. Fight across treacherous marshlands, steep summits and picturesque settlements and meet an imaginative cast of friends and foes along the way. A unique touch is added to each playthrough by a degree of randomized level composition, enemy encounters, and upgrade drops.<h3>Horde Mode</h3>Fire up captain Bowie’s combat simulator and plow through an endless alien assault to climb the online leaderboards! Use the strengths of all your characters to prevail, pick powerups between the waves, and repeat. The longer you stay alive, the more challenging it gets.<br/><br/><br/><h3>Build Your Crew</h3>Play as four different characters, each representing their own playstyle, and tailor them with persistent <strong>Meteorite</strong> upgrades found throughout the game. Want a Healer who can deal some serious damage? Or a Striker with poisonous blades? Have at it!<h3>Join the Community</h3>Join our official Discord Server and let us know what you think of the game! Come hang out, join contests and get the latest news about the development.<br/><br/>https://discord.gg/GoFightFantastic/", "metacritic": null, "released": "2024-03-26", "tba": false, "updated": "2024-03-29T09:48:37", "background_image": "https://media.rawg.io/media/screenshots/a5b/a5b8ae60c49c9f08215f255347b10575.jpg", "website": "https://www.gofightfantastic.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 308, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dinomite Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Kinda Brave"], "esrb_rating": null}