{"id": 979188, "slug": "peraglees-the-ooloufian-resistance", "name": "Peraglees - The Ooloufian Resistance", "name_original": "Peraglees - The Ooloufian Resistance", "description": "Embark on an electrifying journey with \"Peraglees: The Ooloufian Resistance,\" a heart-pounding action-adventure arcade shooter that thrusts you into the action of the thrilling Fennyverse! Brace yourself for an adrenaline-fueled mission as the universe hangs in the balance, besieged by the malevolent Old Whiplin.<br/><br/>Join the epic battle as KAOTIX &amp; Dexter Fury, teaming up with the formidable Slade Fury in dynamic two-player coop mode. Unleash your firepower across 9 planets, each teeming with danger and excitement, on a quest to liberate the galaxy from the clutches of Old Whiplin's nefarious plot. It's a race against time, and the fate of the Fennyverse rests in your hands – can you thwart Old Whiplin and restore peace to the planets? Get ready for an explosive adventure that will keep you on the edge of your seat!<br/><br/><br/><br/>In the face of ruthless peril, the Fennyverse stands on the brink of annihilation! KAOTIX, Dexter, and Slade Fury launch into the vast expanse of space, determined to secure crucial supplies and precious Oreient. Their mission: to ensure the prosperity of their kind, the Ooloufians.<br/><br/>Little do they know, Old Whiplin has seized control of every celestial body in the Fennyverse. As KAOTIX, Dexter, and Slade Fury return from their critical supply run, they discover Peraglees, their cherished planet, under a relentless assault by unwelcome Goblin invaders dispatched by the diabolical Whiplin.<br/><br/>In a bold and daring move, it falls upon them to rise to the challenge, to defend Peraglees, and to free every other planet from the clutches of Old Whiplin's nefarious reign. The stakes are high, and the battle is fierce—can they put an end to Whiplin's malevolent regime and save the Fennyverse from utter devastation? Brace yourselves for an epic saga of courage, resilience, and unyielding determination!<br/><br/><br/><br/><strong>* A faithful arcade style game with 16 bit graphics and gameplay.<br/><br/>* XINPUT Support up to two control pads.<br/><br/>* Incredible pixel art from David Jones &amp; Elizabeth Wright.<br/><br/>* Intense FM chiptune soundtrack by Glyn Humphreys &amp; Diives, using a software based solution of the YM2612!<br/><br/>* Four difficulty levels.<br/><br/>* Nine unique areas to traverse.<br/><br/>* A variety of different enemies to tackle.<br/><br/>* Currently 9 bosses to destroy.<br/><br/>* An arsenal of 8 weapons to master along with the Mega Bomb, Mines and Melee Roll.<br/><br/>* Upgrade weapons and speed and compete with the hardest enemies.<br/><br/>* Play solo or local co-op with a friend, play online with a friend with Steam Remote Play Together.</strong><br/><br/><br/><br/>Gear up for an arsenal of epic proportions in \"Peraglees: The Ooloufian Resistance\" with a dazzling array of 8 formidable weapons to obliterate the onslaught of enemies that await you. Unleash the power of the Ooloufian Rifle, Spread, Chargrill Chester, Rocket Launcher, SMG, Laser, Homing Missile, and the devastating Cluster Launcher. Each weapon is a game-changer, offering a unique and thrilling way to vanquish your foes as you navigate the pulse-pounding challenges that lie ahead. Choose your weapon wisely and prepare for an explosive journey through the Fennyverse!<br/><br/><br/><br/>Prepare for a strategic onslaught as each weapon in \"Peraglees: The Ooloufian Resistance\" serves a distinct purpose in your quest. The versatile SMG emerges as the go-to choice for tackling a wide array of adversaries, unleashing a relentless barrage of firepower. For smaller foes, the Chargrill Chester (Flame Thrower) proves its supremacy, transforming enemies into nothing but ashes with its scorching intensity.<br/><br/>When faced with menacing vehicles, the explosive arsenal becomes your weapon of choice, delivering explosive devastation to anything in its path. Elevate your game to the next level when confronting formidable bosses by harnessing the precision and power of the Laser. Each weapon in your arsenal is a finely tuned instrument, perfectly suited for its specific role, ensuring that you are well-equipped to overcome every challenge that the Fennyverse throws your way. Engage in the ultimate battle with the right tool for every job and witness the spectacular results!<br/><br/><br/><br/><br/>Unlock the full potential of your character with the versatile roll mechanic in \"Peraglees: The Ooloufian Resistance.\" Not just a nimble dodge, your roll doubles as a formidable melee attack against smaller adversaries, adding a dynamic layer to your combat strategy. Take control of the battlefield by seamlessly planting destructive mines with a quick follow-up press of the same button while in mid-roll, leaving chaos in your wake.<br/><br/>As an added bonus, execute this masterful roll technique in water to traverse the aquatic terrain with enhanced speed, turning every environment into your advantage. Your roll isn't just a move; it's a tactical masterpiece that elevates your gameplay to new heights. Embrace the fluidity of combat and unleash a symphony of destruction as you effortlessly dance through challenges in the Fennyverse!<br/><br/><br/><br/>Step into the exhilarating realm of Peraglees, where the spirit of the greatest 80's and 90's action arcade shooters comes alive in an explosive two-player co-op experience! Just like the iconic classics, Peraglees is a dynamic duo adventure that beckons you and your friend to join forces and dive headfirst into the heart-pounding action.<br/><br/><br/><br/>Picture this: an epic gaming night with your pal by your side, unleashing a barrage of firepower to annihilate enemies in tandem. The energy is electric, the stakes are high, and the camaraderie is unmatched. But the excitement doesn't end there – whether your friend is across the street or across the globe, Peraglees brings you together with the option to play via Parsec, a free streaming software, for seamless online play. Alternatively, conquer the galaxy through Steam Remote Play, ensuring that the thrill of co-op extends beyond the boundaries of your living room. Grab a friend, brace yourselves, and get ready for a co-op experience that will transport you straight into the golden era of action-packed gaming!", "metacritic": null, "released": "2024-03-28", "tba": false, "updated": "2024-03-29T11:23:56", "background_image": "https://media.rawg.io/media/screenshots/d54/d548206541cbbcb88c98fd2721798cfd.jpg", "website": "https://www.twitch.tv/dpad_ftw", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 298, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DPADFTW"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["DPADFTW"], "esrb_rating": null}