{"id": 97917, "slug": "re-prince-of-nigeria", "name": "RE: Prince of Nigeria", "name_original": "RE: Prince of Nigeria", "description": "<p>\"<em>RE: Prince of Nigeria</em> is hilarious, fun… Set aside an hour or two and prepare to fall in love with the most charming scammer ever.\" – Jenni Lada</p>\r\nStory\r\n<p><em>\"Once upon a time, I met a prince… the Prince of Nigeria. Throughout his lovely poetry and wonderful serenades of emails, I couldn't help but fall in love with him. Too bad falling in love with a prince isn't all flowers and bunnies as fairytales claimed – we were playing a dangerous game of passion, wildfire and strife. What awaited us both was a story of heartbreak, of tragedy, of broken romance, and deer droppings…\"</em></p>\n<p><strong>RE: Prince of Nigeria </strong>is a crack comedy about a girl who falls in love with a prince – or rather, just the perpetrator of a commonly known Nigerian internet scam.</p>\r\nCharacters\r\n<p><strong>Protagonist</strong></p>\n\n<p><em>\"The moment I saw his email, my heart felt like it could burst, with the greatest sense of salvation I've ever felt… like a roller-coaster slamming itself into a puddle of… salvation gas? I don't know. I'm not very good with metaphors. \"</em></p>\n<p>Her default name is Horai Owen. She likes butter cookies, her ex-boyfriend Zak, and badass steamrollers.</p>\n<p><strong>The Prince of Nigeria</strong></p>\n\n<p><em>\"DEAR HORAI MY FATHER AND MOTHER RECENTLY DIDEDED AND I NEED UR MONEH NAO THX I AM 100% TRUSTWORTH DUN WORRY BEST REGARD – PRINCE APARA\"</em></p>\n<p>A mysterious yet totally unsuspicious person who sent the protagonist a series of emails one fateful day…</p>\n<p><strong>The Mother</strong></p>\n<p><em>\"Horai? Are you dead or something?\"</em></p>\n<p>The mother. Nothing else about her shall be said… Cue ominous music.</p>\r\nEpilogue Characters\r\n<p><strong>Mr. Copern McRooney</strong></p>\n<p><em>\"I am not old. I am just middle-aged!\"</em></p>\n<p>A publisher for an online comedy website.</p>\n<p><strong>Rich Hastley</strong></p>\n<p><em>\"Hi. I'm your senior in middle school.\"</em></p>\n<p>A senior in middle school. He's never gonna give you up. </p>", "metacritic": null, "released": "2015-05-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/65b/65b9c2d328ee965ac98cc4617c4d5522.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Coren Baili"], "genres": [], "publishers": [], "esrb_rating": null}