{"id": 979154, "slug": "engineered-to-purpose", "name": "Engineered To Purpose", "name_original": "Engineered To Purpose", "description": "Engineered To Purpose is a narratively-driven sci-fi tower defence game which allows players to design their own towers, customising attacks, targeting schemes, and more. As pressure mounts, plan out and optimise your defences in order to defeat hordes of enemies!<br/><br/><strong>Tower Design</strong><br/><br/><br/><br/>Our design system is based on combining sets of components and then assigning modifiers to the attack to customise each tower into a unique form and effect. The system allows you to use your unlocked components to build and experiment, adding a new layer of strategy to the tower defence formula.  <br/><br/><br/><br/>Designing a tower can be done mid-level if you have enough room, or between levels in our workshop, where towers can be tested against any enemy you have encountered, and you can see the effect of your choices in real-time. <br/><br/><br/><br/><strong>Key Demo Features:</strong><br/><ul><li>Design your towers!<br/></li><li>Face hordes of unique and challenging enemies!<br/></li><li>Test your towers in the Workshop to prepare for missions!<br/></li><li>The first chapter of our story-driven campaign!</li></ul><br/><strong>Coming Soon!</strong><br/><ul><li>Three more worlds: more story, more enemy types, more tower components, and more maps!<br/></li><li>Over 100 enemy types!<br/></li><li>Gameplay Modifiers, allowing you to customise the challenges you face per level and adding deep replay options for even the simplest map! <br/></li><li>Post-game advancement - Once the campaign is complete, continue to collect new components and upgrade your collection!</li></ul>", "metacritic": null, "released": "2024-03-26", "tba": false, "updated": "2024-03-29T10:09:43", "background_image": "https://media.rawg.io/media/screenshots/ebf/ebfe2c747556237659cc0a5486dba605.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 450, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Confidence Roll Games"], "genres": ["Strategy", "Indie"], "publishers": ["Confidence Roll Games"], "esrb_rating": null}