{"id": 979182, "slug": "river-town-factory-prologue", "name": "River Town Factory: Prologue", "name_original": "River Town Factory: Prologue", "description": "River Town Factory: Prologue vs. Official Version Differences<br/>*Special Note: Prologue save data can all be transferred to the official version.<br/><ul><li>In the Prologue version, players can increase the favorability of all romanceable NPCs up to 4 hearts.<br/></li><li>In the Prologue version, players can increase the favorability of all regular NPCs up to 4 hearts.<br/></li><li>In the Prologue version, players can access up to T1 node in the Oracle Temple.<br/></li><li>In the Prologue version, 15% of buildings and technologies are available.<br/></li><li>In the Prologue version, players can explore the Central Region, including martial arts and relic caves within the region.<br/></li><li>In the Prologue version, players can reach a maximum of Level 2 on the SwordWay Sect and River Town Bounty Board (Somewhat Famous).<br/></li><li>In the Prologue version, players can participate in the Spring Festival, including the Flower Festival and Qingming Festival.</li></ul><br/><br/><br/><br/>Create automated production assembly lines, from wooden planks to circuit boards, design every step of your production line.<br/>Unlock future technologies gradually, from silicon purification to photovoltaic power generation, and build your futuristic workshop.<br/>Use inter-district teleportation stations to receive products at various levels, expanding your factory's territory to the entire continent.<br/>From brewing and oil pressing to manufacturing ovens, even producing watches and antibiotics, astound ancient people with your futuristic goods!<br/>Reinforced concrete, rubber, and large-scale computers, these will be the mass-produced materials you use in the ancient times, a thousand years ago!!!<br/><br/><br/><br/><br/>There are 12 characters that can be pursued in the game - the royal, the martial arts world, the merchant, etc. Unlock the secrets of each character and pursue the friendships and romances you desire. Choose your partner and discuss marriage, and together move into the workshop where they will provide powerful assistance. Make connections with nearly 30 historical figures, each with their own changing schedules throughout the four seasons. Participate in their lives and use modern knowledge to solve their problems. In the River Town, everything happens naturally, and you have the final say on when to work, explore, and engage in romantic pursuits.<br/><br/><br/><br/><br/><br/>A fast-paced combat system that is easy to pick up, combining evasion and offense to defeat your enemies through strategic maneuvers. Whether through formal training or adventures in the martial arts world, master more than 40 martial arts techniques including external skills, internal skills, light skills, and hard skills, allowing you to dominate the martial arts world.<br/><br/><br/><br/><br/>Explore the four major villages on the map, complete village quests, and uncover their secrets.<br/>Explore the mystical realms left behind by ancient predecessors, delve deep into them, and defeat bizarre creatures.<br/>Explore the entire continent, discover treasures, explore bat caves, and punish bandits for the people.<br/>Sign contracts with mine owners throughout the entire map, allowing ancient people to work for you.<br/><br/><br/><br/><br/>Be a skilled craftsman or a social butterfly? Become the top martial artist or a versatile expert in everyday life? It's all up to you to decide.<br/>Craft spiritual medicines, weapons, and clothing, becoming a master of ancient craftsmanship.<br/>Create over 20 different dishes with various enhancements, such as Five Treasures Stew and Snowy Sunset Soup... Make them in your kitchen!<br/>Fill the Heavenly Workshop with the products you create, allowing ancient people to visit and witness modern technology.<br/>Utilize the power of future technology to repair the time machine and fulfill a mission that only you can accomplish.<br/>", "metacritic": null, "released": "2024-03-27", "tba": false, "updated": "2024-03-29T11:10:15", "background_image": "https://media.rawg.io/media/screenshots/4c6/4c60854ca30c199c8565640cbf17813f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 356, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["iFAction Studio"], "genres": ["RPG", "Simulation", "Indie"], "publishers": ["iFAction Studio"], "esrb_rating": null}