{"id": 979277, "slug": "just-another-night-shift", "name": "Just Another Night Shift", "name_original": "Just Another Night Shift", "description": "<strong>Just Another Night Shift is a casual competitive PvP multiplayer online game.</strong> You get to play as a security guard and a thief. The Thief’s objective is to steal a specific item from the mansion, while the Guard tries to stop him. Join us for hours of fun gameplay with your friends!<h3>Basics Of the Game</h3><br/><ul><li> The winner of the game is whoever wins six (6) rounds first.<br/></li><li> Players switch sides after five (5) rounds.<br/></li><li> Both characters have strengths and weaknesses, and a special ability.<br/></li><li> The Guard has additional tasks, he must feed the fish, protect the cheese and water the exotic plant. If he fails to do so, the Thief will win the round.</li></ul><br/><br/><br/><strong>Sneak into the mansion and steal the statue! Buy useful items from the black market, use the Thiefs agility and special hiding ability to avoid the Guard. </strong><br/><br/><br/><br/><br/><strong>Guard the mansion and catch the Thief! Use the dog or the cameras to gain advantage over the Thief. Remember to do the tasks, light the shadows with the flashlight and buy helpful items from the security shop.</strong><br/><br/><strong>Attention!</strong><br/><br/>The game works using a peer-to-peer (P2P) system. Player 1 works as a server and the player 2 as a client. Players are required to be Steam friends in order to connect. Over long distances between these two you may expect high latency and problems in the game.", "metacritic": null, "released": "2024-03-28", "tba": false, "updated": "2024-03-29T15:04:55", "background_image": "https://media.rawg.io/media/screenshots/ae8/ae8eafe7e7edc54db1582427d45306bd.jpg", "website": "https://www.justanothernightshift.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 387, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RantaKoira", "FinnGames"], "genres": ["Action", "Strategy", "Casual", "Indie"], "publishers": ["RantaKoira"], "esrb_rating": null}