{"id": 979210, "slug": "fancyland", "name": "Fancyland", "name_original": "Fancyland", "description": "Embark on a harrowing journey through the eerie corridors of <strong>Fancyland</strong>, an abandoned candy-themed indoor amusement park shrouded in mystery and darkness. Take on the role of Jackson Wright, a determined 22-year-old on a quest to uncover the truth behind his father's disappearance during a nightguard shift a decade ago. <br/><br/>As you step foot into the desolate halls of Fancyland, you'll soon realize that your investigation is not just a search for answers, but a desperate struggle for survival against a sinister force that lurks within.<br/><br/>Delve deep into the forgotten recesses of Fancyland as you navigate its long winding hallways, solve intricate puzzles, and unearth cryptic clues left behind by former employees. Every step you take brings you closer to unraveling the park's chilling secrets, but also closer to the malevolent entity that hunts you relentlessly. Keep your wits sharp and your senses keen as you evade detection and uncover the truth that lies buried beneath layers of deception and fear.<br/><br/>Will you emerge victorious and uncover the truth about your father and Fancyland's dark past, or will you become another missing victim of its long-kept mystery? Prepare to face your deepest fears as you embark on a heart-pounding adventure that will test your courage, intellect, and will to survive in this haunting tale of mystery and suspense. <br/><br/>Excellent and crispy PSX-styled graphics with a modern gameplay approach.<br/><br/><br/><br/>Welcome to Fancyland – where only fun and sugary goodness await you...right?<br/><br/>", "metacritic": null, "released": "2024-03-27", "tba": false, "updated": "2024-03-29T12:25:04", "background_image": "https://media.rawg.io/media/screenshots/ea8/ea80d4e168cd0ec01d9be79b7de41b38.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MOONBIT"], "genres": ["Adventure", "Strategy"], "publishers": ["Moonbit"], "esrb_rating": null}