{"id": 979234, "slug": "zen-with-a-pen", "name": "Zen With A Pen", "name_original": "Zen With A Pen", "description": "Step into the intense world of <strong>Zen With A Pen</strong>, where serenity collides head-on with a mind-bending arcade challenge! Get ready to take command of your virtual pen and embark on an enthralling journey through a variety of levels filled with obstacles to overcome.<h3>What's in Store for You?</h3>In this offbeat indie game, your mission is crystal clear: guide the enso symbol, the Zen embodiment, to its serene destination. But beware! The path is riddled with ingeniously designed obstacles, engineered to test even the steeliest of nerves. It's a tightrope walk between tranquility and rage as you sketch guiding lines on parchment to navigate the enso through intricate terrains.<br/><br/><h3>Key Features:</h3>🖌️ Craft guiding lines to maneuver the enso symbol through intricate maps<br/>🎨 Immerse yourself in a visually pleasing minimalistic art style that soothes the soul<br/>😂 Confront obstacles that will push not only your steady hand but also your sanity<br/>🌟 Embark on a journey through multiple maps, each with varying levels of difficulty<br/>⚡️ Experience the perfect blend of casual arcade gameplay and hair-tearing frustration<br/><br/>Experience the enchantment of minimalistic art as you journey through a captivating array of maps. Each map unveils a unique set of challenges, handcrafted to both sharpen your skills and keep you on the edge of your seat. To succeed at the challenge you need to use your wit, patience and calm inner self. This together with some special powers and you have all the tools neccessary, even for the more challenging difficulties!<br/><br/>Moreover, <strong>Zen With A Pen</strong> immerses you in an auditory experience with its collection of calming and mesmerizing music tracks. Dive into a realm of tranquility, as each stroke of your pen is accompanied by soothing melodies that effortlessly meld with the game's serene atmosphere. Let these gentle tunes wash over you, elevating your gaming experience to new heights of relaxation (or perhaps a touch of frustration).<br/><br/><br/><br/>So, are you ready to unleash your inner Zen artist and conquer the enso? <strong>Zen With A Pen</strong> eagerly awaits your artistic touch! Brace yourself for a challenge that leaves you feeling both serene and victorious, and most certainly frustrated. Grab your pen, take a deep breath, and let the Zen flow through your fingertips!", "metacritic": null, "released": "2024-03-27", "tba": false, "updated": "2024-03-29T13:16:24", "background_image": "https://media.rawg.io/media/screenshots/74e/74eb290f60305029e762c55ed7e6de3c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Felix Arnestrand"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Felix Arnestrand"], "esrb_rating": null}