{"id": 979208, "slug": "hebereke-enjoy-edition", "name": "HEBEREKE Enjoy Edition", "name_original": "HEBEREKE Enjoy Edition", "description": "Where am I pyooooo???<br/>HEBEREKE is back and so is his great and surreal adventure!<br/><br/>A mysterious little creature Hebe fell into a mysterious world.<br/>Discover a brand new world, explore every corner, find the treasures with your new wonderful friends, and use their skills to find new places.<br/><br/>The \"Enjoy Edition\" adds two new modes, useful features and challenging elements.<br/><br/><br/><br/>You can rewind anytime by pressing the Rewind button.<br/>(*This function can be enabled or disabled)<br/><br/><br/>You can save and load your play anytime. Up to 12 slots can be saved.<br/><br/><br/> In Enjoy mode, the status of achievements can be displayed.<br/>(*Achievement display can be optionally switched ON/OFF.)<br/><br/><br/>Hebe's wall climbing and Jennifer's rapid ascent from underwater, can be made easier with continuous firing (jumping)!<br/><br/><br/><br/><br/>This is the mode to see how fast you can clear the game.<br/>In RANKING, you can compete with users all around the world by total time and challenge to set a new record! In addition to the total time to clear the game, the time to pass check points are also recorded.<br/><br/><br/><br/><strong>1)Enjoy the story twice as much with Special Snaps.</strong><br/>Every time you discover a new event, you get a special snapshot! At any time during the game, you can enjoy comparative images and Japanese-English translations of the Japanese version of \"HEBEREKE\" and the Nordic version of \"Ufouria: The Saga\". You can see how that scene in \"HEBEREKE\" looks like in \"Ufouria: The Saga\"...!<br/>And the unique and expressive Hebe language in English translation! From core fans to international users, you can enjoy the story of \"HEBEREKE\" to the fullest. Two worlds with different characters and stories. Record every scene and discover the mystery of HEBEREKE. (Can you make it?)<br/>The in-game menu is available in Japanese and English, but the main story of \"HEBEREKE\" is only in Japanese. Please enjoy the English translation at Special Snap.<br/><br/><br/><strong>2) Extra</strong><br/>You can browse the package designs and instructions for the original versio of HEBEREKE.<br/>You can also view the package design and instructions for the Nordic version of 'Ufouria: The Saga'.<br/>(*Instructions can also be viewed from the menu in each game.)<br/><br/><br/><strong>3) Achievements</strong><br/>You can view all 35 achievements from the title screen.<br/><br/><br/><strong>4) Ranking</strong><br/>This is the mode to see how fast you can clear the game.<br/>In Ranking, you can compete with users all around the world by total time and challenge to set a new record!<br/><br/><br/><strong>★About HEBEREKE</strong><br/>HEBEREKE is a game developed by Sunsoft in 1991.<br/>The main character, Hebe, is a little creature with a unique manner of speaking. The comical universe of the game and its cute characters are what made it so popular back then.<br/>Another reason for its popularity is its action maze-like design. The player must explore every corner of the map to find their way in this surreal universe. The soundtrack is also to be mentioned: in contrast to the surreal world depicted, the music is more down-to-earth and straight to the point.", "metacritic": null, "released": "2024-03-27", "tba": false, "updated": "2024-03-29T12:20:43", "background_image": "https://media.rawg.io/media/screenshots/178/178f69926694a924a48635a0d58e698b.jpg", "website": "https://city-connection.co.jp/hebereke/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CITY CONNECTION"], "genres": ["Action"], "publishers": ["CITY CONNECTION"], "esrb_rating": null}