{"id": 979369, "slug": "other-side-of-mist-and-mountain", "name": "Other Side Of Mist And Mountain", "name_original": "Other Side Of Mist And Mountain", "description": "<h3>Other Side Of Mist And Mountain is a Japanese-style horror mystery adventure game.</h3>The game's story blends elements of horror, mystery, deduction, and folk tales. Gameplay is primarily based on visual novels, enriched with interactive scenes and puzzle-solving mechanisms. Through meticulously crafted scripts, it presents a series of captivating and enigmatic stories that will tug at your heartstrings.<br/><br/><br/><br/><br/><br/>Five years ago, sophomore student Maha Igarashi took a late-night train to Soukyo City to attend a social flash mob event organized by an occult forum. She disappeared midway after getting off at a station called Kisaragi, and the station itself vanished thereafter. Maha's boyfriend, Shizuno Yokoyama, never stopped searching for her. He opened a detective agency in his hometown, specializing in peculiar requests, all in pursuit of clues to find Maha. As his investigation deepens, he finds himself increasingly entangled in the mist of mysteries...<br/><br/><h3>Explore diverse maps, engage in dialogues, and investigate clues within scenes.</h3><h3>Interact with mechanisms to solve puzzles.</h3><h3>Make different choices to trigger various storylines.</h3><h3>Investigate various peculiar supernatural requests.</h3><br/><br/><br/><br/><br/><br/><br/><br/>", "metacritic": null, "released": "2024-03-28", "tba": false, "updated": "2024-04-01T06:31:34", "background_image": "https://media.rawg.io/media/screenshots/46a/46a1c5d9ca58dc275a51a0d9e7c7fea1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 366, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Universe Studio"], "genres": ["Adventure", "RPG", "Simulation", "Indie"], "publishers": ["2P Games", "Universe Studio"], "esrb_rating": null}