{"id": 979301, "slug": "model-human", "name": "Model Human", "name_original": "Model Human", "description": "Embark on a captivating adventure with Model Human, a unique game that seamlessly blends the  platforming genre with the intrigue of programming. Perfect for both seasoned gamers and those new to coding, this immersive experience takes you through the fundamentals of programming, from mastering basic flow control to implementing clever search algorithms. Delve into a world of puzzles where each level introduces a fresh and intriguing concept, making learning as enjoyable as it is challenging.<br/><br/>Your ultimate objective? Liberate the protagonists and guide them to freedom in the real world.Are you ready to unravel the mysteries within and lead your characters to a triumphant escape?<h3>Game Features</h3><ul><li>Innovative Fusion of Genres: Immerse yourself in a groundbreaking gaming experience that seamlessly blends platforming excitement with the intriguing challenges of programming.<br/></li><li>Accessible Learning: Perfect for both seasoned gamers and coding novices, Model Human provides a user-friendly journey through programming fundamentals, introducing concepts from basic flow control to elementary search algorithms.<br/></li><li>Puzzle-Solving Adventure: Navigate through a series of engaging puzzles, each level introducing a distinct programming idea. Sharpen your problem-solving skills in a dynamic and ever-evolving environment.<br/></li><li>Player-Driven Motivation: Your progress is not just about completing levels; it's about liberating the protagonists and guiding them to escape into the real world.</li></ul>", "metacritic": null, "released": "2024-03-28", "tba": false, "updated": "2024-03-29T16:06:54", "background_image": "https://media.rawg.io/media/screenshots/4bd/4bdd50fe3d233f8abd2c07e54afdbdee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Roberto Serrano López"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["Roberto Serrano López"], "esrb_rating": null}