{"id": 979407, "slug": "furtive", "name": "FURTIVE", "name_original": "FURTIVE", "description": "Prisoners of war, your team was captured but on the run on a large military controlled island. Explore, gather resources, build a shelter and survive the dangerous military presence on the look out for your team in this epic first person, multiplayer, open world, survival adventure.<br/><br/><br/><br/>Test your mettle and pull your team together to take on the dangers of this massive island by gathering necessary resources, building a small base or large stronghold, hunting or farming for food to survive, and defending yourself against the formidable Corocotta military out to hunt your team down. Can you escape before things take a turn for the worse?<br/><br/><br/><br/>Traverse massive landscapes across this huge beautiful island. Explore the unknown, encounter strangers on the way, meet the wildlife this island has to offer, and raid military outposts for top tier resources. There's plenty to experience in this vast open world environment.<br/><br/><br/><br/>Gather your friends in this 4 player online co-op experience. Work together as a team to take on the dangers of this island. Share resources together, build together, fight together.<br/><br/><br/><br/>Your team was captured by the Corocotta military and taken to an unknown island for containment, but you've escaped. Embark on your epic journey outrunning recapture from the Corocotta, uncover the truth of the island's military presence, and find your way off the island. Complete various quests and missions to achieve your goal.<br/><br/><br/><br/>", "metacritic": null, "released": "2024-03-29", "tba": false, "updated": "2024-04-01T07:49:25", "background_image": "https://media.rawg.io/media/screenshots/d1b/d1bfd1b00d5003ed7f8bafd609bbecc1.jpg", "website": "https://www.frozenbulletgames.com/furtive", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 486, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Frozen Bullet Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Frozen Bullet Games"], "esrb_rating": null}