{"id": 979400, "slug": "holo-x-break", "name": "Holo X Break", "name_original": "Holo X Break", "description": "It was your usual daily life over at hololive HQ in Holo City, until one day their CEO mysteriously disappears!<br/>\n<br/>\r\nMoments later, a nefarious organization who called themselves \"holoX, the Secret Society\" announces their plans to take over the world! Play as the talents of the Vtuber group Hololive to fight your way through the minions of holoX and put a stop to their plans in this classic style beat-em-up!<br/>\n<br/>\r\n-Play as different talents of hololive, such as the talents of Generation 5's \"NePoLaBo\", each equipped with their own unique abilities and super attacks!<br/>\r\n-Find various kinds of equipment that will change the way you play each time!<br/>\r\n-Use quick consumable defensive or offensive items to change the tide of battle<br/>\r\n-Fight action packed boss battles against the members of holoX<br/>\r\n-Up to 4 players local with online in an upcoming update<br/>\r\n-Easy to pick up and get right into the action<br/>\r\n-Challenge harder difficulties that will put your skills to the test!<br/>\r\n-The \"X\" in the title is silent.<br/>\n<br/>\n<br/>\r\nThis game is published under CCMC Corp(※1)'s Indie game brand \"holo Indie\".(※2)<br/>\r\nThis game is allowed to be monetized under the examination and terms of \"holo Indie\".<br/>\r\nPlease note that any monetized derivative work games that include Cover Corp.'s content outside of holo Indie is not covered by these terms and is not allowed.<br/>\n<br/>\r\n※1. About CCMC Corp.<br/>\r\nCCMC Corp. is entrusted with website management (ex: steam) including, examination,  publishing and other necessary tasks by Cover Corp.<br/>\n<br/>\r\n※2. About \"holo Indie\"<br/>\r\nholo Indie's objective is to cooperate with hololive production fans and creators.<br/>\r\nIt is a game brand that offers \"Game Creator Support Program\" for the derivative work games.<br/>\r\nFor more details about \"holo Indie\",  Please refer to the Cover Corp.'s \"Derivative work guidelines\".", "metacritic": null, "released": "2024-03-29", "tba": false, "updated": "2024-04-01T07:37:26", "background_image": "https://media.rawg.io/media/screenshots/795/7956a366fd1f88f7ff620833d6acc2b8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "toplay": 1}, "playtime": 0, "achievements_count": 19, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KayAnimate"], "genres": ["Action", "Casual", "Indie"], "publishers": ["holo Indie"], "esrb_rating": null}