{"id": 979401, "slug": "love-x-crotch-x-gym", "name": "Love X Crotch X GYM", "name_original": "Love X Crotch X GYM", "description": "「MASTERPIECE」<br/><br/>Masterpiece is a fitness center that exclusively provides services for women. It is also a well-known brand managed by AKI, the girl next door who we've known since childhood. <br/>Due to overseas investors recognizing the business opportunities brought by the female fitness market, AKI needs to travel abroad to negotiate business collaborations. <br/>As the manager, she appointed you as a fitness instructor to manage the fitness center for two months.<br/><br/>Your are SEIGI, and those who are familiar with you call you SEI.<br/>Nobody knows that there will be a romantic encounter waiting for you in the near future.<br/><br/><br/><br/><br/><br/><br/><h3>YUIKI</h3>Freshman girl has a large number of fans on SNS/IG, and often posts selfies and food photos. <br/>She is a popular campus beauty at school, and to maintain her popularity and figure, she starts working out. <br/>Therefore, her SNS/IG also features sexy photos, which has attracted more male fans. <br/>On the surface, she seems innocent, but in fact, she is well-experienced. <br/>The unsuspecting person would be deceived by her naive appearance and fall into the sweet trap she weaves.<br/>After successfully seducing and entering a relationship, she quickly loses interest and ended the relationship, breaking the hearts of many men. <br/>On the surface, she was called a bitch, but behind all these, no one knows that she is a deeply hurt child. <br/><br/><h3>MISUZU</h3>Working at a well-known law firm, she is a lawyer. <br/>Seemingly dignified and elite in appearance, she actually has to endure verbal harassment from her superiors and sarcastic remarks from unreasonable customers and colleagues. <br/>Over time, she got into the habit of secretly masturbating in the office to relieve stress, and she was worried that once she was found out, her image would be damaged. <br/>Instead, she started to go to the gym to exercise and vent her depression.<br/>She graduated from an all-girls school, she is inexperienced in relationships and holds herself to high standards. <br/>She is afraid of exposure, pretends to be experienced, and always shows indifference and arrogance towards you. <br/>However, deep down, she longs for companionship and harbors countless fantasies about men's bodies, often resulting in inexplicable giggles and blushing. <br/><br/><h3>KUREA</h3>She used to be a university professor during YUIKI's studies, known for her gentle and motherly nature.<br/>She always treated SEIGI with care and treats him as a child, but she also likes to chat with young people. <br/>Because her husband has been working overseas for a long time, he always made excuses not to go home to accompany her, and she realizes the loneliness and depression that every married woman will experience. <br/>As far as appearance is concerned, she is a mature and charming woman, with an impressive breasts.<br/>She was unable to stand her husband's absence and lack of care, she finally began to go to the gym to exercise and relieve stress. <br/>However, no one knows that her intention was to hunt hunk at the gym. <br/><br/><br/><br/>\"LOVE X CROTCH X GYM\" is a AVG game with the gym as the background.<br/>It combines the cultivation and management of the gym's operation.<br/>Enhance likability through training and guidance for grils, or through gifts.<br/>It can present a complete story according to different degrees of likability.<br/>To choose different endings according to your own preferences!<br/><br/><strong>【MINI GAME】</strong><h3>DANCING</h3><h3>JOGGING</h3><br/><br/><strong>【TRANING】</strong><h3>WEIGHT TRANING</h3><br/><br/><br/><br/><br/><ul><li>Story content exceeding 200,000 words<br/></li><li>All heroine are fully voice-acted throughout.<br/></li><li>5 selectable game endings<br/></li><li>Simple and amusing mini games</li></ul>", "metacritic": null, "released": "2024-03-29", "tba": false, "updated": "2024-04-01T07:38:44", "background_image": "https://media.rawg.io/media/screenshots/b47/b47d165379ac42ee682288b0fc3d8247.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 390, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["奶油貓工作室", "バター貓スタジオ"], "genres": ["Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["072 Project"], "esrb_rating": null}