{"id": 979434, "slug": "the-land-past-redemption", "name": "The Land Past Redemption", "name_original": "The Land Past Redemption", "description": "The Land Past Redemption is a medieval rogue-lite with turn-based combat. Take on bounties, explore procedurally generated dungeons, outfit and level up heroes, and earn enough money to escape the Land Past Redemption.<h3>Key Features</h3><ul><li><strong>Rogue-lite</strong><br/>Heroes can permanently die but even if a battle is lost, three new heroes are generated and the game mostly continues where it left off.<br/><br/></li><li><strong>Customize heroes</strong><br/>Armor and weapons can be equipped to suit play style and hero class. At certain levels, a new skill can be selected and there are two skills to choose between. Even if there are two heroes with the same class, they can be built to have different skills.<br/><br/></li><li><strong>Procedurally generated loot</strong><br/>Buy gear at the store to make heroes stronger, or use loot from enemy drops. The store's items refresh every time the heroes rest so there's always something new and better to find.<br/><br/></li><li><strong>Positioning plays an important role in battle</strong><br/>Heroes in the back row will be safer, but will be unable to melee attack without the added reach of a spear. A hero in the front row with heavy armor and a shield can tank enemy attacks.<br/><br/></li><li><strong>No two dungeons are alike</strong><br/>The layout of the dungeon and the events are all procedurally generated.</li></ul>", "metacritic": null, "released": "2024-03-29", "tba": false, "updated": "2024-04-01T08:40:19", "background_image": "https://media.rawg.io/media/screenshots/c21/c2103087219e5f57b0eb64511335a1ac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Up Next Games"], "genres": ["Action", "RPG"], "publishers": ["Up Next Games"], "esrb_rating": null}