{"id": 97948, "slug": "allergory", "name": "Allergory", "name_original": "Allergory", "description": "<p>* For the best experience, play with Chrome in fullscreen mode (via the button on the right).</p><p><strong>Overview</strong></p><p>Children with food allergies experience higher levels of stress, anxiety, and bullying than non-food-allergic children.1 <em>Allergory</em> addresses this issue through the gameful story of Mia, a young girl who is allergic to peanuts. Players work with Mia as she migrates to a new school where she is the first food-allergic student. The game is intended to help non-food-allergic persons understand the social, cultural, and practical reality of having a food allergy. </p><p><em>Allergory </em>is a knowledge translation game developed by Steve Wilcox as part of his dissertation. His thesis is that games can be used to translate knowledges between communities and cultures. This is accomplished by training the player's imagination to discover knowledge that is situated in unfamiliar social and cultural situations. As a game design philosophy it draws inspiration from feminist epistemology (Haraway; Harding), situated learning theory (Gee), and disability scholarship (Siebers).</p><p>The game itself is based on interviews with food-allergic children as reported by Fenton et al. It was produced as part of the GET-FACTS project. Funded by the Canadian Institutes of Health Research, GET-FACTS (Genetics, Environment and Therapies: Food Allergy Clinical Tolerance Studies) creates and disseminates research on food allergies. This game was also developed at the Games Institute (University of Waterloo).</p><p>1 \"Illustrating Risk: Anaphylaxis Through the Eyes of the Food-Allergic Child\" by Fenton et al. </p><p><strong>Works Cited</strong></p><p>Fenton, Nancy et al. \"Illustrating Risk: Anaphylaxis Through the Eyes of the Food-Allergic Child.\" Risk Analysis, 31. 1 (2011). Print. <br/></p><p>Gee, James Paul. \"Learning and Games.\" <em>The Ecology of Games: Connecting Youth, Games, and Learning.</em><em> </em>Ed. Katie Salen. Cambridge, MA: The MIT Press, 2008. 21–40. Print.</p><p>Haraway, Donna. \"Situated Knowledges: The Science Question in Feminism and the Privilege of Partial Perspective.\" Feminist Studies, 14.3 (1988). 575-599. Print.</p><p>Harding, Sandra. \"Rethinking Standpoint Epistemology: What is 'Strong Objectivity'?\" Feminist Epistemologies.Routledge. Ed. Linda Alcoff and Elizabeth Potter. 49-82. 1993. Print.</p><p>Siebers, Tobin. \"Disability and the Theory of Complex Embodiment—For Identity Politics in a New Register.\" Disability Studies Reader, 4th edition. Ed. Lennard Davis. 278-97. Print.</p><br/>", "metacritic": null, "released": "2017-04-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/500/500e8d5a7d0015b30ea5e13e142a574e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Praxis Games"], "genres": [], "publishers": [], "esrb_rating": null}