{"id": 979494, "slug": "anomaly-exit", "name": "Anomaly Exit", "name_original": "Anomaly Exit", "description": "You were on your way home one day when you realised the train was stopping at the same station over, and over again... at least you thought they were all the same station...<br/><br/>Inspired by The Exit 8 and I'm on Observation Duty, Anomaly Exit is a carefully crafted spot-the-difference and psychological-horror walking simulator. It balances atmosphere, psychological horror, and is designed with singleplayer and multiplayer in mind.<br/><br/><strong>GAMEPLAY</strong><br/><strong>If the station is as you remembered, leave the station, or else get back on the train.<br/><br/>Take your time, remember the station... and don't forget it... something lurks in the tunnels...<br/><br/>Hidden in plain sight. The anomalies are not subtle, but you need to pay attention.<br/><br/>The station is small, but the anomalies are random and numerous.<br/><br/>No cheap jumpscares. As long as you're paying attention of course...<br/><br/>This is a memory based game. So take your time, be patient, no quick reflexes required.<br/><br/>But you need to stay alert, avoid any strange beings in the stations, and avoid... the Anomaly Exit!</strong><br/><br/><strong>CO-OP MULTIPLAYER</strong><br/>The station is scary on your own, so team up with other passengers to try and help to remember your way out of the station together! Or you can go your separate ways, and see who makes it out alive.<br/><br/><strong>PROXIMITY VOICE CHAT</strong><br/>Keep your fellow passengers in shouting distance, or you won't know what may happen to them in the other room...<br/><br/>A headset is highly recommended!<br/>Average playtime: 0.5 to 1.5 hours.<br/><br/>Come join the Discord, I would love to hear your thoughts/feedback if you have any!<br/>https://discord.gg/EENtKDTCKD", "metacritic": null, "released": "2024-03-31", "tba": false, "updated": "2024-04-01T10:41:00", "background_image": "https://media.rawg.io/media/screenshots/a7f/a7f4f2935f9bb3e0edd909241999588c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ExamlGuy"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["ExamlGuy"], "esrb_rating": null}