{"id": 979436, "slug": "fuck-you-witch", "name": "Fuck You Witch", "name_original": "Fuck You Witch", "description": "Use a microphone because only Russian obscenities can save you from a witch.<br/>If your Mom is home and there is no way to yell obscenities at the witch, then you can disable this function.<br/>But make sure to wear headphones, because the main character will swear at your behalf, and the chance of getting a bollocking from your parents is very high.<br/><br/><br/><br/>Explore yurts in the Qazaq steppe and a post-Soviet apartment. There are a couple more locations that are fucking amazing, one is definitely to your taste... well, you'll see for yourself.<br/><br/><br/><br/>Find out what camels like, take a crash course in sewing, saddle a horse, discuss philosophy with others and just enjoy yourself.<br/><br/><br/><br/><br/><br/>Unravel to the world the most important secret—how to cook beshbarmak. There are also fucking awesome riddles that you can tell us from the heart and soul.<br/><br/><br/><br/><br/><br/>Along the way, figure out what kind of witch she is and why she fucked with you. This Alsou chick is there, maybe she will help somehow, because friends help each other, and you and she are only friends and nothing more.<br/><br/><br/><br/><br/><br/>1. Use a microphone and yell obscenities at the witch to drive her away.<br/>2. If you wish, you can disable the microphone and use a keyboard or gamepad. <br/>3. The game is a walking simulator.<br/>4. Hidden objects.<br/>5. Interesting storyline.<br/>6. Average time to complete the game: 2:00:01<br/><br/>Note! The game features machine translation into the following languages:<br/>- French<br/>- German<br/>- Spanish<br/>- Portuguese (Brazilian)<br/>- Chinese (Simplified)<br/>- Korean<br/>- Polish<br/>- Japanese", "metacritic": null, "released": "2024-03-29", "tba": false, "updated": "2024-04-01T08:43:54", "background_image": "https://media.rawg.io/media/screenshots/4a6/4a6e3dc8ddf9fc4dd0dfc515efdf3e6e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Beshbarmak games"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["Beshbarmak games"], "esrb_rating": null}