{"id": 979594, "slug": "evostrike", "name": "Evostrike", "name_original": "Evostrike", "description": "<h3>Story</h3>Drifting along the edge of humanity's galaxy, your ship comes across an unknown threat.<br/>An entire sector infested with hostile creatures. It is your objective to engage these beings, eradicate as many of them as possible, and gather data for your home sector.<h3>Evolve</h3>Your ship contains a small group of mercenaries which can evolve and improve their equipment and skills.<br/>Choose from 4 different evolution paths each with unique strengths and skills.<br/>Evolve your squad of 5 Evo-Mercs, choosing from the 12 different evolutions available.<h3>Mastery</h3>While your Evo-Mercs are fighting in their current evolution, they will gain mastery over their role. Each evolution has 3 mastery steps, granting them increasing buffs. These buffs persist even after changing evolutions, and their effects stack.<br/>Combine the 39 Masteries together with the 12 evolutions to create powerful combos.<br/><br/>Stack the mastery of damage to allow the Sniper-Evo to punch through armor.<br/>Stack magazine efficiency to the point where the single shot Mortar-Evo becomes a twin barreled beast.<br/>Many more combos are there to find.<h3>Events</h3>Along your journey through the infested sector your ship and crew will come across different events. Be it a desire for more unstable mutations, or just simply broken parts in the med-bay. Choose how you react and live with the consequences.<h3>Choose your Route</h3>You'll be able to choose your own missions as you approach the heart of the infestation. Multiple paths will open up; some are harder but grant better rewards. The further you push on, the more advanced the alien threat will become.<h3>Engage the enemy</h3>Fight in missions against big alien armies. Analyze the map, make your plan and execute on it.<br/>Defend!<br/>Build defensive structure around your ship to protect it from the aliens.<h3>Survive the night!</h3>Nighttime is brutal, this is where the aliens hunts, they are faster stronger and more active. Survive the night and prepare for the daybreak.<br/>Use the advantage of the burning daylight to push ahead. Use airstrikes and aggressive maneuvers to take out the alien nests one by one.<h3>Attrition.</h3>Some fights are too hard to be won at first. but the aliens aren't endless... The longer we persist the less of them there are. Even if it looks hopeless at first, hold fast and endure. The aliens will tire, and our ship's supply generator will increase in power as it warms up.<h3>Elites</h3>As we reach the heart we will encounter the elites of the infestation. Bigger stronger and with the only goal to take out our ship. Destroy their vital parts one by one and stop them from reaching our ship.<h3>Meta-Tech</h3>Sooner or later we will fail. We are the Drifting-Edge, we're meant to be the scouts and first responders, we're not here to do this on our own. Once we die, our date gets sent back home, and with the data we collect we'll be able to research new constructs for our fellow Drifting-Edges. They'll charge in after we have perished, stronger and with more info.", "metacritic": null, "released": "2024-04-01", "tba": false, "updated": "2024-04-05T08:01:49", "background_image": "https://media.rawg.io/media/screenshots/ab0/ab004d34d987825fca853a314189ea0a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DrTronik"], "genres": ["Strategy"], "publishers": ["DrTronik"], "esrb_rating": null}