{"id": 979542, "slug": "minishoot-adventures", "name": "Minishoot' Adventures", "name_original": "Minishoot' Adventures", "description": "<h3>THE UNCHOSEN HAS RETURNED...</h3>His minions have emerged from the underworld, your village has been destroyed, and all your friends are now trapped in corrupted crystal... Embark on a journey to save the world in this bullet-filled adventure, born from our desire to mix the joy of open-ended exploration with a top-down shooter's juicy game feel.<br/><h3>ENGAGE WITH TIGHT COMBAT</h3>Take control of a swift and responsive spaceship, and shoot your way through handcrafted encounters supported by a crystal clear esthetic and crispy game feel. Overcome bosses in intense Bullet Hell battles, with difficulty options for both newcomers and veterans.<br/><h3>VENTURE ON YOUR OWN</h3>Plunge into an entirely handcrafted world built with many interconnections to explore on your own. Lush caverns, ancient temples and sunken cities await you with their unique treasures, challenges and secrets.<br/><h3>RECLAIM THE STOLEN POWERS</h3>Finding the Primordial Powers will improve your combat and exploration abilities while also opening up the map bit by bit as you unlock new paths and reveal shortcuts.<br/><h3>IMPROVE YOUR SHIP</h3>Upgrade your ship by leveling up, finding various items and buying equipment. Don't forget to rescue your adorable friends; each of them will help you in their own way!<br/><h3>A GAME MADE FOR YOU</h3>Whether you like chill exploration or hardcore Bullet Hell, we got you covered with 3 difficulty modes, aiming assistance, auto fire and more accessibility options.", "metacritic": null, "released": "2024-04-02", "tba": false, "updated": "2024-04-16T07:27:20", "background_image": "https://media.rawg.io/media/screenshots/f9e/f9e56960654865428323477c3b03712e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "beaten": 3, "toplay": 2}, "playtime": 7, "achievements_count": 24, "ratings_count": 1, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "PC"], "developers": ["SoulGame Studio"], "genres": ["Action", "Adventure", "RPG", "Casual"], "publishers": ["IndieArk", "SoulGame Studio"], "esrb_rating": null}