{"id": 979626, "slug": "eye-of-the-void-unleashed-tower-defense", "name": "Eye of the Void: Unleashed - Tower Defense", "name_original": "Eye of the Void: Unleashed - Tower Defense", "description": "In \"Eye of the Void: Unleashed\", you are thrust into a world where an ancient and malevolent entity known as the \"Eye of the Void\" has mysteriously appeared in the realm of the forest goblins. The eye possesses an ability to infect susceptible goblins with its mind-controlling powers, turning them into formidable minions that follow its every command. Like a virus, it grows stronger and more powerful with every host it infects.<br/>\n<br/>\r\nThe goblin tribes and their allies, terrified by this newfound foe, have cast aside their differences and joined forces to confront the cosmic menace. Your task is to strategically build towers, fortify walls, and construct gold mines to gather resources and mount a defense. Additionally, you possess the arcane knowledge to cast powerful spells to fend off waves of determined goblins who seek to destroy you.<br/>\n<br/>\r\nThe game is an endless test of your tactical skills, challenging you to withstand increasingly relentless assaults from the united goblin forces. You must utilize your wits, resource management, and mastery of spells to hold the line against the ceaseless tide of goblins to protect the Eye for as long as possible.<br/>\n<br/>\r\n\"Eye of the Void: Unleashed\" offers an immersive and challenging rogue-like tower defense experience, where your decisions shape the fate of the ancient and enigmatic entity and determine whether the goblins will succeed in their quest to obliterate the Eye. As its unwavering guardian against the impending darkness, how long can you keep the goblin forces at bay?", "metacritic": null, "released": "2024-04-02", "tba": false, "updated": "2024-04-05T09:08:21", "background_image": "https://media.rawg.io/media/screenshots/ea8/ea867735d4517b49baec15ab3253bd5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["PerpetualOOMM"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["PerpetualOOMM"], "esrb_rating": null}