{"id": 979669, "slug": "seren-nova", "name": "Seren Nova", "name_original": "Seren Nova", "description": "<h3>Protect the Seren Solar System</h3>Seren Nova is a top-down retro 3D sci-fi action game with FMV cutscenes and a puppet!<br/>Fight as part of Nova Force as they protect the planet Brython and the Seren Solar System.  <br/>Follow the story of Nova Force's best pilot, Aderyn, as she tries to keep invading forces away.  <br/>Choose the best ship for each mission and fight across various planets and locations. <br/><br/><h3>Nova Force</h3><ul><li>Fight for Nova Force and protect Brython over 7 completely different levels!<br/></li><li>Classic 90's style retro 3D space fighter gameplay!<br/></li><li>Use your tractor magnet to pick up and drop objects across the levels.<br/></li><li>FMV cutscenes filmed in a classic low-budget sci-fi style.<br/></li><li>Choose your fighter: A quick attack with lasers or blow everything to smithereens with missiles!<br/></li><li>Includes the prologue level as seen in the demo, but with all the improvements of the main game!<br/></li><li>Get involved and read the lore of the Seren system in the game menu.</li></ul><h3>Gameplay</h3>Pilot your ship from above in each location, completing the mission objectives, that can go from search and destroy, to recovering stolen technology.  However, with more delicate mission objectives, you may prefer to land and take the war to the enemy on foot.  Choose whether you want to fight using the heavier bomber, or get in and get out with the fast but more fragile fighter.  Use your tractor magnet to move objects, lift and drop bombs.<br/><br/><h3>Live-Action Story</h3>Featuring a live-action cutscenes inspired by classic sci-fi TV series of old, featuring a cast of actors and puppets! Follow top pilot Aderyn as she struggles to protect the lives of billions and her dislike of her robot sidekick, Robo.<br/><br/><h3>JOIN NOVA FORCE NOW!</h3><br/>", "metacritic": null, "released": "2024-04-03", "tba": false, "updated": "2024-04-05T10:46:11", "background_image": "https://media.rawg.io/media/screenshots/b00/b00fe37f60d37fdd94b692b9efcb7349.jpg", "website": "https://www.galaethgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Galaeth Games"], "genres": ["Action", "Indie"], "publishers": ["Galaeth Games"], "esrb_rating": null}