{"id": 979616, "slug": "criminal-archives-murder-in-the-pages-collectors-e", "name": "Criminal Archives: Murder in the Pages Collector's Edition", "name_original": "Criminal Archives: Murder in the Pages Collector's Edition", "description": "A gripping detective series filled with mystery and riddles awaits you! You are a crime reporter, striving to capture in your book the most unusual cases you have encountered. You help the San Francisco police solve murders and catch criminals to make life in the city a little better. If people doubted it, now, they just have to look no further than your articles - monsters do exist, and they are among us! Meanwhile, Secret societies are not slumbering, and the owl-masked killer continues to lead the police by the nose! A prominent writer Damian Crow comes to you for help since all the mayhem seems to have slipped through to the city streets right from the pages of his crime novels. Can you solve all the murders and stop the villains? Or maybe the master of the pen himself masterminded this bloody nightmare? It all falls to you to find out the truth! Don't let this city swallow another innocent soul! Challenge your investigator skills in this spectacular  new Hidden-Object Puzzle Adventure!<br/>\n<br/>\r\nThis Collector's Edition includes:<br/>\n<br/>\r\n📜\tYour own choices!<br/>\r\nYou have the ability to choose the characters' phrases for one action or another and influence the plot of the mystery story. Don't forget that only your choice determines the course of these complex investigations and can affect the lives of the characters! <br/>\n<br/>\r\n📜\tA variety of achievements!<br/>\r\nConduct your own investigation by solving intricate puzzles, solving complex riddles and playing various mini-games. You need to solve the most important mystery by searching various places, collecting things and interviewing passers-by. Unlock all the achievements to highlight your success!<br/>\n<br/>\r\n📜\tBonus materials!<br/>\r\nCollect all the clues and save the residents, successfully solve the mystery to gain access to bonus locations, where you'll discover some interesting details about the characters. You might think that some mysteries are not meant to be solved, but you can do it, can't you?<br/>\n<br/>\r\n📜\tCollectible items!<br/>\r\nThis exciting new edition of the mystery story is filled with various clues and mysterious items that you need to find in order to advance your investigation! Find the collectibles at each crime scene and find the hidden objects. You'll have to be a very careful detective to collect the entire collection!", "metacritic": null, "released": "2024-04-02", "tba": false, "updated": "2024-04-05T08:49:06", "background_image": "https://media.rawg.io/media/screenshots/05c/05c7915ecf384e1b706b73ba9ae31a6b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Do Games"], "genres": ["Adventure", "Casual"], "publishers": ["Do Games"], "esrb_rating": null}