{"id": 979654, "slug": "historical-invaders", "name": "Historical Invaders", "name_original": "Historical Invaders", "description": "The most wicked men that ever lived on earth. Authoritarians, dictators, and tyrants, from Hitler to Stalin, they are all back. Historical Invaders it's a fixed shooter game where you are the chosen one to annihilate the demons of our past and save mankind.<br/><br/>Intense combat, stunning pixel art, story-driven and cinematic hand-drawing. Historical Invaders send the player across planet Earth to destroy spaceships that came out of nowhere mysteriously, bringing back enemies that humanity had already destroyed: the nazi, the communists, the fascists, and many more. Players will solve this mystery, put down these threats, and save mankind again.<h3>Key Features </h3><br/>Old school Space shooter <br/>Historical Invaders is a love letter to the gold era of lovely shooter games from the 80s and 90s. The players will shoot the spaceships from above, collect power-ups, escape danger, and fight against time to beat the levels. <br/><br/>The Story <br/>Set in a dystopian future when a cryogenic corporation decides to bring back from the dead, monsters like Hitler, Stalin, Mussolini, and many others. <br/><br/>Challenge Gameplay <br/>To fight the Historical Invaders, the player will need to move quickly, learn enemies' patterns, and never stand still.<br/><br/>Power-ups<br/>Beautiful to look at, hard to get, and wonderful to use. With them, you are powerful. Without them, the Historical Invaders will tear you apart.<br/><br/>Soundtrack<br/>Your ears won't be disappointed as you destroy the Historical Invaders.<br/><br/>Bosses <br/>For each boss, a different strategy is needed. They won't be easy on you, so be prepared.", "metacritic": null, "released": "2024-04-02", "tba": false, "updated": "2024-04-05T10:16:53", "background_image": "https://media.rawg.io/media/screenshots/6b0/6b044136b07e08cbc61328279aa963a9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jonatas Duarte"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Jonatas Duarte"], "esrb_rating": null}