{"id": 979687, "slug": "azoove", "name": "Azoove", "name_original": "Azoove", "description": "Azoove is a co-op card roguelike in which you manage your resources and cooperate with your allies to eliminate the threat of the Cursed Book.<br/>In each round, communication with allies is limited to exchanging cards from your hand. Without direct conversation, you must read your friends’ actions, creating unique and memorable moments.<br/>In this digital board game, you and your allies must undertake the perilous journey to the fountain city of Miz'rak to seal the book at the Grand Gallery, and save your village from Ur'gan's evil curse.<h3>WILL YOU MAKE IT IN TIME OR WILL YOU FIND YOURSELVES LOST IN THE DUNES?</h3><br/><br/><br/><br/><br/><br/>Survive on your dangerous journey by collecting <strong>Rations</strong>, scout the region to maintain your <strong>Orientation</strong>, and keep <strong>Stress and Despair</strong> low.<br/>Play <strong>Action Cards</strong> each round to keep your expedition on the right path.<br/><br/> <br/><br/><br/><br/><strong>Silently work together</strong>. For half of the round, team members are not allowed to talk to allies, keeping their Action Card hand secret.<br/><strong>Exchange</strong> cards strategically to optimize the use of limited resources and share information with allies.<br/><br/><br/><br/> <br/><br/><br/><br/>Survive each day’s <strong>Disaster</strong> and lead your expedition forward past dangerous monsters, sandstorms and terrifying curses. <br/><strong>Gather your friends</strong> and strive to overcome the odds, avoiding an untimely end!<br/>The journey is <strong>different every time</strong>, with events drawn randomly from a large deck. Keep your wits ready and lean on your skills to survive the adventure and weave incredible stories with your friends.<br/><br/>Player count: Currently up to 2 players. At 1.0 release, up to 4 players.<h3>CAN THE HEROES REACH THE GRAND GALLERY, RETURN THE CURSED BOOK AND SEAL UR'GAN?</h3><br/><br/>", "metacritic": null, "released": "2024-04-03", "tba": false, "updated": "2024-04-05T11:34:22", "background_image": "https://media.rawg.io/media/screenshots/12e/12e0cfed5418044c9f42d6d06cddc10c.jpg", "website": "https://www.azoove.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Timeless Toucan"], "genres": ["Strategy"], "publishers": ["Timeless Toucan"], "esrb_rating": null}