{"id": 979612, "slug": "speedway-challenge-2024", "name": "Speedway Challenge 2024", "name_original": "Speedway Challenge 2024", "description": "Have you ever dreamed of sitting on a powerful machine that can reach speeds of up to 120 kilometers per hour and has no brakes? \"Speedway Challenge 2024\" meets your expectations and allows you to take on the role of those who risk their health every day. You can become the fourth Polish world champion or prove that women can also rule in this man's world.<br/>\n<br/>\r\nThe game offers the user several game modes:<br/>\n<br/>\r\nQuick match - the fastest way to get on the track and face your opponent. Select two teams, determine the location and face each other in a friendly match. What are you waiting for? Two-minute clock is ticking!<br/>\n<br/>\r\nCareer (after in-app purchase) - create your own player or choose one of almost a thousand available and manage their career. It's up to you whether you will be a legend of the world speedway in the future. Sign contracts in foreign leagues, which will allow you to improve your virtual rider's skills. Remember to invest in equipment and make sure you have appropriate facilities, such as transport or basic accessories.<br/>\n<br/>\r\nLeague (after in-app purchase) – choose one of two possible paths. Build a power team from scratch by creating a new speedway center or lead one of a hundred European clubs to success - from Poland, Great Britain, Sweden, Denmark, the Czech Republic, Germany or France. Take on the role of the club president - contract players, take care of finances and the expansion of training and medical infrastructure. Also be a good manager who will arrange the squad appropriately and build tactics that allow you to defeat your rival. Finally, put on virtual Kevlar and defeat your opponent.<br/>\n<br/>\r\nChallenges – take up the challenge and complete the tasks. For each goal you achieve, you will receive an attractive reward in the form of SCP points. Thanks to them, you will be able to unlock elements of individual personalization of the player's clothing and change the appearance of your motorcycle. The higher the difficulty level, the greater the bonus on your account.<br/>\n<br/>\r\nOnline – are you tired of competing with bots? Test your skills in ranked play against players from all over the world or simply invite your friends (after in-app purchase) and find who is the best.<br/>\n<br/>\r\nEach virtual game mode offers racing on over 50 tracks around the world at three levels of difficulty. You can see the difference in riding styles for each rider, and the entire competition takes place in accordance with the current speedway regulations.<br/>\n<br/>\r\nAs part of official cooperation with the Polish Motor Association, some competitors, clubs and competitions are fully licensed.", "metacritic": null, "released": "2024-04-01", "tba": false, "updated": "2024-04-05T08:41:21", "background_image": "https://media.rawg.io/media/screenshots/f1e/f1e7fbb7ccf65513f3c0adc7edb02676.jpg", "website": "https://speedwaychallenge.pl/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 388, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Artur Berkowski Berobasket"], "genres": ["Sports", "Racing"], "publishers": ["Artur Berkowski Berobasket"], "esrb_rating": null}