{"id": 979636, "slug": "nasty-zombies", "name": "Nasty Zombies", "name_original": "Nasty Zombies", "description": "Step into a world overrun by hordes of Nasty Zombies, where survival is a constant battle against the relentless undead. Armed with an arsenal of brutally devastating weapons capable of dismembering the undead, you'll fight tooth and nail to stay alive amidst the chaos. Every wave brings increasingly challenging foes, testing not only your skill, reflexes, and strategic thinking, but also your adaptability, where procedural elements ensure no encounter is ever the same.<br/><br/><br/>As you fend off the zombie onslaught, you'll earn money for every nasty nuisance you dispatch. Use your hard-earned cash wisely to unlock powerful perks and game-changing power-ups that can turn the tide of battle in your favour. Whether you're boosting your firepower, enhancing your survivability, or dropping nukes, every upgrade brings you one step closer to victory.<br/><br/><br/>Surviving isn't just about firepower; it's also about agility and precision. Master the snappy movement mechanics, deftly navigating through swarms of zombies with finesse and grace. Whether it's sliding under obstacles or running over their heads, use every trick at your disposal to outmaneuver the undead horde and emerge victorious.<br/><br/><br/>Challenge yourself to conquer over 60 achievements of varying difficulties, each presenting a unique test of your abilities. From limiting yourself to one room, to surviving 100 waves of onslaughts, these achievements offer a tantalizing challenge for players seeking to prove their skills.<br/><br/><br/>Inspired by the classic shooters of yesteryears, this wave-based zombie survival experience delivers an adrenaline-fueled thrill ride that will keep you on the edge of your seat. Immerse yourself in the heart-pounding action, as you face down wave after wave of undead horrors in a battle for survival. Do you have what it takes to withstand the relentless onslaught of the Nasty Zombies and emerge as the ultimate survivor?", "metacritic": null, "released": "2024-04-04", "tba": false, "updated": "2024-04-05T09:40:09", "background_image": "https://media.rawg.io/media/screenshots/c67/c671a74e101845df2c61742d3f934c8d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 388, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Con No 1"], "genres": ["Action"], "publishers": ["Con No 1"], "esrb_rating": null}