{"id": 979693, "slug": "auto-riskrisk", "name": "Auto RiskRisk", "name_original": "Auto RiskRisk", "description": "A strategic 2D equipment-based auto battler. Equip your fighters with different items and artefacts to form a team. Then send them off to fight against AI opponents in single player or against other human players online. By combining certain types of items you can increase your strength or counter the opponents' strategies.<br/><br/><h3>How to play</h3><br/>Auto RiskRisk is an equipment-based auto battler. This means your goal, as the one managing your fighters, is to assemble the strongest team possible using different equipment and strategies in order to win.<br/><br/>Use the money you earn each round to buy new equipment for your fighters.<br/>Buying multiple of the same items combines them into stronger versions.<br/>Each item belongs to two different sets. If you collect multiple of the same set you get additional set bonuses.<br/>Position your fighters and their equipment to make the most of them during battles.<br/><br/>Each round you face off against an opponent's team.<br/>Your fighters will automatically run out and fight for you with the equipment you have assigned to them.<br/>The loser of the battle will lose health and if you go down to 0 health you are out of the game.<br/>The last player standing is the winner!<br/><br/><h3>Key Features</h3><br/>- Relaxed play mode<br/>Face off against 7 other AI players of varying difficulty in single player or play against real opponents in the asynchronous cross-platform multiplayer.<br/>Play as fast as you want. No turn timers and you will never have to wait for any AI players to finish. Pause and pick it back up whenever you got some time to spare or watch a stream while playing.<br/><br/>- Items<br/>Use a total of 60 different items spread over 11 different classes and 15 different enchantments, each with their own flavour and strategy.<br/>Over 70 different artefacts you can use to bolster your strategies or create entirely new ones.<br/>Combine items of the same types to unlock set bonuses. Find a combination that bolster your fighters or counter your opponents.<br/><br/>- Game modes<br/>In addition to the normal game, there are several other game modes to unlock.<br/>Each game mode alters the game slightly which will make you come up with new strategies.<br/><br/>- Achievements and rewards<br/>35+ achievements testing your skill of all the aspects of the game.<br/>Unlock new icons, playmats and squads to personalise your team and brag to your opponents.", "metacritic": null, "released": "2024-04-03", "tba": false, "updated": "2024-04-05T11:48:16", "background_image": "https://media.rawg.io/media/screenshots/ed1/ed18f1ccd0ccc77dd56c5b71f84b2699.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Parrexion Games"], "genres": ["Strategy"], "publishers": ["Parrexion Games"], "esrb_rating": null}