{"id": 979671, "slug": "dishwashing-simulator", "name": "Dishwashing Simulator", "name_original": "Dishwashing Simulator", "description": "Experience the unexpected thrill of a house-hold chore in the latest next generation AAAAA simulation experience: Dishwashing Simulator. New ground has been broken in the simulation genre, with a never seen before level of detail in the act of Washing Dishes. Explore a simulated world where every dish matters and survival hinges on your ability to keep things clean. Navigate through a twisted cycle of chores, rewards, and mysteries, as you uncover secrets behind your menial tasks.<br/><br/><ul><li> Immerse yourself in a unique emergent simulation experience, where detailed gameplay mechanics interact in unpredictable ways.<br/></li><li> Engage in an immersive physical interaction system that breaks the barriers of conventional gameplay.<br/></li><li> Uncover the secrets of \"The Depths\", a procedurally generated realm of resources and dream-like encounters.<br/></li><li> Construct your base and production line, optimizing your dishwashing operations.<br/></li><li> Navigate through a living survival environment, managing food, water, and agriculture.<br/></li><li> Choose your pathway and upgrade your stats, tailoring the experience to your playstyle.<br/></li><li> Unravel a cryptic narrative that keeps you questioning your purpose and reality.</li></ul><br/><br/>In Dishwashing Simulator, washing dishes is not just a chore, it's your existence, a puzzle to solve, and a journey to freedom. Don't be fooled by the suds and bubbles, there's more beneath the surface than you'd expect.", "metacritic": null, "released": "2024-04-03", "tba": false, "updated": "2024-04-05T10:48:25", "background_image": "https://media.rawg.io/media/screenshots/a60/a600fcb5725610022c4befa0f2d63645.jpg", "website": "https://www.frinky.games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Frinky", "frosty"], "genres": ["Simulation"], "publishers": ["Frinky"], "esrb_rating": null}