{"id": 979707, "slug": "reconnoitre", "name": "Reconnoitre", "name_original": "Reconnoitre", "description": "Unending nightfall has swept across the forest, sending all the animals fleeing from monstrous shapes in the dark!<br/><br/>A last refuge, Light Springs, survives; and now it's time for you to chart the lost paths back into the forest!<br/><br/>Collect and use charms and glyphs of power to make your way through the forest, reconnect villages and help towns-critters as you work to solve the cause of the nightfall.<h3>Features</h3><ul><li><strong>Explore:</strong> The forest is dark and filled with danger! Find the safest path for convoys to travel, and uncover long forgotten locations to help your journey!<br/><br/></li><li><strong>Scout:</strong> for nearby enemies and locations in each region. Use your intuition and skills to solve each map.<br/><br/></li><li><strong>Use:</strong> glyph powers to move and defeat enemies. Rolls glyphs against your challengers to unlock better dialogue paths.<br/><br/></li><li><strong>Customise:</strong> Grow your loadout of glyphs, find shrines and quests to make strategic upgrades to them as you travel.<br/><br/></li><li><strong>Quest:</strong> for towns-critters to improve your reputation and build convoys. Find side-quests in the forest for rich rewards.<br/><br/></li><li><strong>Journey:</strong> to different biomes and towns. Different enemies, challenges, and secrets you'll need to uncover to save the forest!</li></ul>", "metacritic": null, "released": "2024-04-03", "tba": false, "updated": "2024-04-05T12:14:17", "background_image": "https://media.rawg.io/media/screenshots/ec5/ec596775d390c5ed2a53d7fe0a3c7cd2.jpg", "website": "https://www.notgood.com.au/home/Reconnoitre", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Not Good Digital PTY"], "genres": ["Adventure", "Indie"], "publishers": ["Not Good Digital PTY"], "esrb_rating": null}