{"id": 979788, "slug": "mazelit", "name": "Mazelit", "name_original": "Mazelit", "description": "<h3>What is this?</h3><br/>It's a maze game with lights, enemies, and upgrades.<h3>Tell me more</h3><br/>Be your own beacon of light as you roll through hardships, collecting energy to build yourself up along the way. Enemies in the maze chase you once they see you - make sure you are not cornered and use your upgrades wisely.<br/><br/>If an enemy does catch you, despite all your attentiveness, a random upgrade will get damaged. Repairing is caring! If you are out of lights and all your upgrades are damaged, you will have to find your way through the next maze without them, until you gathered enough energy to pay for repairs.<br/><br/><h3>How do the upgrades work?</h3><br/>There are passive (vision radius, speed, stealth, magnet) and active upgrades you can choose (teleports, guides, traps, drones). As you play the game, you will find out which upgrades are best to pick. An improved vision radius means enemies will find you more easily, which you can counter with more points in stealth. The magnet lets you pick up energy in a wider radius. Speed makes you faster.<br/><br/>When it comes to your active skills, you can learn teleporting (pick a direction and press your assigned button), get guides (arrows that show you the way), traps (enemies can't move for a short time and you can get past them), or drones (they fly through the maze for a while and collect energy for you).<br/><br/><h3>How many maze levels are there?</h3><br/>As many as you want to play - with a maximum size of 50x50 tiles. All mazes are auto-generated and you will find collectible energy in them. As you grow stronger, you draw the attention of the Eyes, which are your enemies. The difficulty of the mazes depends on your player level which rises with the energy you collect.", "metacritic": null, "released": "2024-04-07", "tba": false, "updated": "2024-04-08T06:12:55", "background_image": "https://media.rawg.io/media/screenshots/43d/43d5eb0b938087cd1062d4d218892109.jpg", "website": "https://something.pink/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Something Pink"], "genres": ["Casual", "Indie"], "publishers": ["Something Pink"], "esrb_rating": null}