{"id": 979892, "slug": "flint-the-treasure-of-oblivion", "name": "Flint: The Treasure of Oblivion", "name_original": "Flint: The Treasure of Oblivion", "description": "<p>\n<strong>Play a tactical-rpg set in a pirate world with a strong, original narrative.</strong>\n</p>\n<p>\n \n</p>\n<p>\nAssisted by his friend Billy Bones and his crew, Captain Flint sets sail for a mysterious treasure. If the call of the unknown galvanizes him, he doesn’t yet suspect this adventure will set him free.\n</p>\n<p>\n \n</p>\n<p>\nDive into the world of piracy bordering on fantasy of Flint: Treasure of Oblivion. Immerse yourself into a rich well-documented and exciting universe thanks to comic-book styled narration and tactical turn-based combat.\n</p>\n<p>\n \n</p>\n<p>\n</p>\n<p>\nA good preparation is key: Choose your crew members with unique abilities, obtain new skills, improve your dices.<br/>\nDuring the tactical phases, use cards to trigger skills and attributes, and influence the fight with dice throws.\n</p>\n<p>\n \n</p>\n<p>\n \n</p>\n<p>\n</p>\n<p>\nEnjoy a unique storytelling experience with a comic-book styled visual (speech bubbles, onomatopoeia, comic strips).\n</p>\n<p>\n \n</p>\n<p>\n \n</p>\n<p>\n<br/>\nDiscover a magnificient world, from the french city of Saint-Malo to the exotic landscapes of central America. Visit diverse environments (cities, camps, jungle, caves…) using the power of the Unreal Engine 5.\n</p>\n<p>\n \n</p>\n<p>\n <br/>\nThe game faithfully recreates a world of piracy, incorporating historical elements (language, costumes, weapons) making the experience even more immersive.\n</p>", "metacritic": null, "released": null, "tba": false, "updated": "2024-04-08T12:09:15", "background_image": "https://media.rawg.io/media/screenshots/e48/e486f0d7781e7c8218a78ab403c5c986.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 511, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Savage Level"], "genres": [], "publishers": ["Microids"], "esrb_rating": null}