{"id": 979867, "slug": "shadow-strikers", "name": "Shadow Strikers", "name_original": "Shadow Strikers", "description": "\"Shadow Strikers: Arena of Rivals\" is a thrilling fighting game that immerses players in a world of corruption, dark secrets and epic fights. In the city of Shadowhaven, several underworld organizations have joined forces to create the mysterious \"Shadow Tournament\", where each organization chooses its champion to fight in a secret arena. Victories in this tournament mean power, influence and control over shady businesses.<br/><br/><br/><br/>• Simple Controls, Deep Combat: The game offers simple controls for gameplay, with four buttons for main attacks (Light Punch, Light Kick, Heavy Punch, Heavy Kick). By combining these buttons with the arrow keys, players can perform a variety of special attacks. Even with simplified commands, the game offers a wide range of possibilities for creating combos during fights. Additionally, you can perform simple combos by pressing the Heavy Punch button multiple times.<br/><br/><br/><br/>• Online and Local Multiplayer: Challenge your friends online or play locally in multiplayer mode (a controller is required for local multiplayer). Enter exciting combat and test your skills against players from around the world or challenge your friends in intense battles.<br/>Get ready to enter an arena where deadly secrets mix with powerful blows. Who will be the champion of \"Shadow Strikers\" and shape the destiny of Shadowhaven? Join the fight and find out!", "metacritic": null, "released": "2024-04-07", "tba": false, "updated": "2024-04-08T11:14:02", "background_image": "https://media.rawg.io/media/screenshots/81a/81a998a9e065307d0fa998415324a571.jpg", "website": "https://pisgamesstudio.com/shadow%20strikers", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 301, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PIS Games"], "genres": ["Action", "Indie"], "publishers": ["PIS Games"], "esrb_rating": null}