{"id": 97988, "slug": "pickin-panki-demo", "name": "Pickin' Panki DEMO", "name_original": "Pickin' Panki DEMO", "description": "<p><em>Join our young adventurer to discover exciting new places across the ocean. Explore jungles, caves and snowy mountains. Battle monsters, hunt for treasure and snack on tasty treats!</em></p>\n\r\nGame info\r\n<p>The focus of this game is exploration, discovery and reward. It aims to capture the simple look and feel of games like <em>Link's Awakening</em> and <em>Kaeru no Tame ni Kane wa Naru</em>.</p>\n\n\n<p><strong>EATING:</strong> There are many types of food in this world. The kid never has to go hungry. When you eat something it will increase your maximum energy limit. The increase varies depending on the type of food, but every little piece matters.</p>\n\n\n<p><strong>FIGHTING:</strong> When standing face to face with a monster it is time to test your strength. The fight command makes the kid engage the monster, but the method of attack is all up to him. The kid will lose energy whenever he takes a hit. If his energy meter gets low he will not try his very best. Restore his energy by giving him fruit drinks.</p>\n\n\n<p><strong>EXPLORING:</strong> Sometimes you will stumble upon a mysterious hole or a cave. You can explore these at your own pace! The kid is so strong he can shatter rocks with his bare fists. This lets you dig through walls and dirt that may seem impassable at first. A curious adventurer may find both food and treasure hidden deep underground.<br/></p>\n<p>* The full release of the game will include a 40-page instruction booklet. Complete with item descriptions, sneaky game hints, as well as character art and profiles. A handful of pages are included in the demo version.</p>\n\r\nDevelopment\r\n<p>Design and development - Harkenman<br/>Music - Teodor Dumitrache</p>", "metacritic": null, "released": "2018-07-01", "tba": false, "updated": "2019-08-28T23:25:24", "background_image": "https://media.rawg.io/media/screenshots/1c4/1c42f57fbbf708a4fddca4cb45f65a4c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Harkenman"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}