{"id": 979873, "slug": "curse-seal-rotation", "name": "Curse seal rotation", "name_original": "Curse seal rotation", "description": "Curse Seal Rotation  is a stand-alone rougelike card game. Inspired by 《Tower of the Sorcerer》 and 《Slay the Spire》. In the game, you need to build a powerful deck by collecting cards, spells, blessings, etc. to conquer this tower.<h3>Unsuitable players</h3>- There is no novice guide in the game, and you may be tortured to pieces in the first few hours. If you just want to have fun at a fast pace, please don't buy it.<br/>- There is no plot in the game. If you have high requirements for the plot of the game, please do not buy it.<br/>- The game adopts hand-painted style. If you don't like the solid color hand-painted style, then this is not for you.<h3>Suitable players</h3>- If you like studying different genres. This game does not provide career choices, but different props and cards can produce a lot of combinations, so whether you want to play a single genre or a mixed genre, you can get a good gaming experience.<br/>- If you like calculations. The props in the game have a chain effect, and every attack you make is not just a linkage between cards. You also need to go through a lot of prop bonuses. This will be very interesting for players who like calculations.<h3>Game features</h3>- Cursed Seals are one of the features of the game. Cursed Seals can directly increase the player's combat attributes. Not only can different cursed seals be freely matched, but even different assembly sequences can produce different effects. Through the combination of cursed seals, you can form your unique fighting style.<br/>- Inspired by \"Magic Tower\", the game uses open levels. You can decide which monsters to challenge based on the strength of your deck. When your deck is strong enough, you can directly challenge the elite gatekeepers.<br/>- Various resources are provided in the level selection, including curse seals, curse seal forging, cards, card enhancement, card cleaning, blessings, weapons, blood bottles, etc. Each game is completely random, and you need to choose the path forward based on the specific map.<br/>- This tower currently has 6 floors, and different monsters have different mechanisms. Monsters at higher levels are more powerful, so be careful when dealing with them.<h3>Community</h3>If you have any questions during the game, you may want to share your game live. Welcome to join our QQ group: 325015284", "metacritic": null, "released": "2024-04-05", "tba": false, "updated": "2024-04-08T11:28:46", "background_image": "https://media.rawg.io/media/screenshots/e7a/e7abb780b7040e127b0c490c61e7af1c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hubei Qinghe Technology Co., Ltd"], "genres": ["Strategy", "Indie"], "publishers": ["Hubei Qinghe Technology Co., Ltd"], "esrb_rating": null}