{"id": 979852, "slug": "silent-breath", "name": "SILENT BREATH", "name_original": "SILENT BREATH", "description": "<h3>What is This Game?</h3><strong>\"Silent Breath\" is a horror experience powered by Unreal Engine 5. Featuring photorealistic graphics, fully dynamic scares and microphone detection.</strong><h3>How Do I Play?</h3><strong>You find yourself in the middle of a mysterious forest. Your goal is to find people who have previously gotten lost in the forest. You must be SILENT at night because the forest is listening to your voice through your microphone as you explore. It tries to make you SCREAM with various jumpscares. When you scream, you get one step closer to losing. You also have to constantly check your surroundings because real threats that are trying to hunt you down are on your tail. You lose when you scream or get caught by threats, and the game restarts, but this time the locations of the previously found lost people have also changed. You can't even predict what fear the game will throw at you at any given time because the whole process is randomized.</strong><h3>Game Features</h3><ul><li> <strong>Microphone Detection</strong><br/></li><li> <strong>Unpredictable FULL Dynamic Jumpscares</strong><br/></li><li> <strong>Found-Footage - VHS Style Graphics</strong><br/></li><li> <strong>Different AI's Hunting You Down</strong><br/></li><li> <strong>Photorealistic Environment</strong><br/></li><li> <strong>Huge Forest with Different Locations in Every Direction</strong><br/></li><li> <strong>Replayability (Scares and missing person locations are dynamically randomized every playthrough, making each playthrough a unique experience.)</strong></li></ul><h3>Game Lore</h3><strong>After a night you can't remember, you find yourself at a familiar-looking crime scene. You notice that a body has been found, with his own missing person's poster attached to his chest.<br/><br/>This forest has a reputation for a reason. People have been coming here for years to experience different types of horror, but most of them have never returned. You think you can find more missing people after this one, but be careful. There are many threats in the forest that can kill you, including yourself.</strong><h3>There are so many places to explore.</h3> <strong>Discover a different direction in each playthrough, as a unique experience awaits you every time. Getting lost in the forest can even be an exciting adventure for you. </strong><br/><h3>Your microphone is your enemy!</h3><strong>You must be silent at night in the forest, and staying silent when faced with fear will be a challenge to yourself!</strong><br/><h3>The Sisters of the Forest</h3><strong>The sisters who have been rumored to roam the forest for years. They come out to hunt at night, playing games with you. You must face them!</strong><br/><h3>Watch your back at all times</h3><strong>There are many threats that can approach you from behind and kill you. You should be careful around you!</strong><br/>", "metacritic": null, "released": "2024-04-05", "tba": false, "updated": "2024-04-13T17:28:20", "background_image": "https://media.rawg.io/media/screenshots/6bb/6bbcf6e4fff28491bbd0c6925553ae6d.jpg", "website": "https://exodiacstudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "beaten": 2, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["EXODIAC STUDIOS"], "genres": ["Adventure", "Indie"], "publishers": ["EXODIAC STUDIOS"], "esrb_rating": null}