{"id": 9798, "slug": "throne-of-lies-the-online-game-of-deceit", "name": "Throne of Lies The Online Game of Deceit", "name_original": "Throne of Lies The Online Game of Deceit", "description": "<p>In a modern take on tabletop games like Werewolf/Mafia and set during a time of medieval conflict, each player is randomly assigned one of 40+ classes, ranging from the King, himself, to a hapless Fool. Most players will be loyal members of the Blue Dragon faction, but each game will feature members of either the wicked Cult or mysterious Unseen faction, along with a few Neutral characters to mix things up.</p>\n<p>The unique Day/Night cycle allows players to congregate around the table, discuss their findings and accuse players of treason during the day and use their abilities to occupy, spy on, conspire against and even kill their fellow players at night.</p>\n<p>While Cult and Unseen players know their allies, members of the Blue Dragon must be suspicious of every other player to ensure that they don’t fall to an evil plot.<br />\nEven the King is suspect in Throne of Lies, and the enemy’s ability to convert other players to their side means that allegiances are always shifting.</p>\n<p>The game concludes when the Blue Dragon faction has disposed of all hostile threats against the kingdom or their enemies have seized control of the Throne of Lies!Additionally:Use social abilities to silence opponents, manipulate their words and actions, or even speak with the dead.<br />\nKeep precise notes in a journal to expose your investigation in the event of an untimely death.<br />\nLeave behind a custom, hand-drawn Deathnote to mock your attackers.<br />\nEquip armor &amp; weapons to customize your character and executions with absolutely NO pay-to-win mechanics.<br />\nNeutral players have their own objectives and missions to complete. While this could be as simple as ensuring their own survival, it may be to quietly eradicate everyone at the table.Join Our Epic CommunityJoin thousands in the official Throne of Lies Discord and Forum now for an enhanced ToL experience!</p>", "metacritic": null, "released": "2017-09-29", "tba": false, "updated": "2023-05-07T06:17:59", "background_image": "https://media.rawg.io/media/screenshots/3e1/3e19d6172be1c91e4f87d3b2c2a7d412.jpg", "website": "https://www.ThroneOfLies.com", "rating": 2.12, "rating_top": 1, "added_by_status": {"yet": 35, "owned": 696, "beaten": 1, "toplay": 1, "dropped": 10}, "playtime": 8, "achievements_count": 0, "ratings_count": 17, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 17, "platforms": ["PC", "macOS", "Linux"], "developers": ["Xed", "Boslof", "Imperium42™ Game Studio"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Imperium42™ Game Studio"], "esrb_rating": null}