{"id": 979836, "slug": "biomorph", "name": "BIOMORPH", "name_original": "BIOMORPH", "description": "In BIOMORPH, players must use their skills to explore a vast, varied world. Solve puzzles and platforming challenges, fight deadly monsters and take their shapes to use their powers. But beware – every conquered creature can come back with new and even more threatening powers. Players will level-up their character as they fight through the vast areas around the city, collecting new abilities, mementos and chips. The journey will reveal surprising and alarming truths about our hero’s own origins.<br/><br/><br/>Play as the enemies by killing them and taking their shape. You will be able to use their skills to fight other enemies or use their powers to navigate in uncharted territories.<br/><br/><br/><br/>Fight your way through a challenging AI system where previously mimicked creatures unlock new powers to create a unique experience while revisiting areas of the game.<br/><br/><br/><br/>Choose your fighting style by using an arsenal of melee and range weapons, each of them having its own upgrade tree, to bash and shoot enemies. Create different builds in support of your play style by equipping and mixing different unique skills that you can upgrade.<br/><br/><br/><br/>Explore a vast non-linear, interconnected world composed of many different environments, home of optional boss fights, eccentric NPCs, tons of secrets and upgrades to reward the most daring explorer.<br/><br/><br/><br/>Rebuild the city of Blightmoor and befriend it's inhabitants, learning more about their daily life and the town’s origins. Customize the look of the city to make it your own.<br/><br/><br/><br/>", "metacritic": null, "released": "2024-04-05", "tba": false, "updated": "2024-04-21T21:58:57", "background_image": "https://media.rawg.io/media/screenshots/3df/3df7d43dba864991840eb56e87b4f1d2.jpg", "website": "https://www.luciddreamsstudio.com/biomorph", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 488, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Lucid Dreams Studio"], "genres": ["Action", "Adventure"], "publishers": ["Lucid Dreams Studio"], "esrb_rating": null}