{"id": 979944, "slug": "dice-crypt-2", "name": "Dice Crypt", "name_original": "Dice Crypt", "description": "Unleash the magic of randomness in Dice Crypt, a thrilling digital board game that combines elements of strategy, luck, and adventure! Gather up to three of your friends and dive into the role of vibrant mages, conquering a mysterious dungeon one roll at a time. <br/>\n<br/>\r\nIn Dice Crypt, every roll of the 4-sided dice is a step into the unknown. Each dice drop reveals a new dungeon tile, unveiling a world of surprises. Will you face a fearsome monster, discover a treasure-filled room, or perhaps encounter an opportunity to outwit your rivals? The fate of your journey lies in the hands of Lady Luck and your strategic prowess. Will you choose to loot rooms brimming with treasure or unleash havoc on your competition? Every choice you make could lead to glory or doom. <br/>\n<br/>\r\nDice Crypt is not just a game of chance, but a battlefield of wits and strategy. Loot cards can change your rolls, turning the tide in your favor or sabotaging your friends when they least expect it. But remember, what goes around comes around. Use your loot cards wisely, or you might find yourself on the receiving end of a friend's cunning plan.<br/>\n<br/>\r\nEvery round in Dice Crypt is a new experience, thanks to the unpredictable event cards. These game-changers can spice things up, adding an extra layer of suspense and excitement to each round. Will the event card be a boon or a bane? Only the roll of the dice will tell.<br/>\n<br/>\r\nMonsters in Dice Crypt are more than mere obstacles; they're an integral part of your strategy. Each monster comes with unique effects that can change the way you approach your dice toss. For instance, reveal a bandit monster in the dungeon, and you'll think twice about where your dice lands. Miss the bandit, and you'll lose a coin. It's a thrilling game of risk and reward, where every roll could lead to fortune or failure.<br/>\n<br/>\r\nAs you delve deeper into the crypt, the stakes get higher. Monsters grow fiercer, treasures more tempting, and the competition more ruthless. Will you emerge as the ultimate dungeon explorer or fall victim to the crypt's countless perils? <br/>\n<br/>\r\nDice Crypt is an adrenaline-pumping, dice-rolling, dungeon-crawling extravaganza that promises countless hours of fun and excitement. It's time to gather your friends, roll the dice, and embark on an unforgettable adventure. Are you ready to test your luck in the Dice Crypt?", "metacritic": null, "released": "2024-04-08", "tba": false, "updated": "2024-04-12T07:10:10", "background_image": "https://media.rawg.io/media/screenshots/281/281a3b247e4cc83c32569a6fddd45105.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["YarnCat Games"], "genres": ["Casual", "Indie"], "publishers": ["YarnCat Games"], "esrb_rating": null}