{"id": 979979, "slug": "night-grove", "name": "Night Grove", "name_original": "Night Grove", "description": "It is a first-person indie horror game in the walking simulator genre.<br/><br/><h3>Night Grove</h3>A building standing in the deep woods has had a bad reputation for years. <br/>According to the residents of nearby towns, the rest of their days are spent in this hostel by people whom society has long since abandoned. <br/>The physically and mentally unhealthy people who inhabit this place are always described differently in each story. <br/><br/><br/><br/>The people who visited this place changed radically. They became more withdrawn, as if something had shaken them. No one wanted to talk about what they'd seen.  Some came back with their psyches shaken. The line between reality and mysticism was blurred.  <br/>After such notices, the police visited the place several times, but found nothing of the sort. The only person they found in the house was a lonely elderly man who was quite cooperative. He explained these rumors by the fact that there was a mental hospital near his territory. Perhaps people were under the impression it was because of this place. But then why does everyone flinch when they hear \"Night Grove\"? <br/><br/><h3>Gameplay</h3>You will have to visit an unusual place inhabited by strange individuals.<br/>Will you be able to fulfill a seemingly ordinary order?<br/>Beautiful graphics and high quality 3D sound will help you to fully experience the atmosphere of the game.<br/><br/><strong><h3>Warning!</h3></strong><br/>The game contains flashes of light that can cause epileptic seizures.", "metacritic": null, "released": "2024-04-09", "tba": false, "updated": "2024-04-12T07:58:04", "background_image": "https://media.rawg.io/media/screenshots/968/9683af48a457c3e5c17b09b2b26306f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Admia"], "genres": ["Adventure", "Strategy", "Simulation", "Indie"], "publishers": ["Admia"], "esrb_rating": null}