{"id": 979954, "slug": "black-trail-vr", "name": "Black Trail VR", "name_original": "Black Trail VR", "description": "It’s the gold rush era. Native people attacked the Snake Canyon mine just after a few days when white men discovered ancient artifacts. Jack, an experienced bounty hunter, and White Eagle, a respected warrior among his people, are after the same artifacts for different reasons.<br/><br/>Switch between characters throughout the chapters, use unique, historical weapons, fight hundreds of men in a wide Old West world, and change the fate of the war.<br/><br/><ul><li><strong>Dive into intense and varied combat encounters with a wide range of weapons. Each weapon introduces a unique mechanic and a new play style.</strong><br/><br/></li><li><strong>Survive, defend, infiltrate, or escape! Discover a new area and overcome a new challenge in each chapter.</strong><br/><br/></li><li><strong>Witness the clash of two worlds through the eyes of different characters and unravel the mysterious powers of ancient artifacts.</strong><br/><br/></li><li><strong>Unlock the Bounty Hunt after the main campaign and earn bounties when you kill in style and find timed bounty bags. Use the money to create unique weapon-enhancement combinations, and compete with other players to become a legend!</strong><br/></li><li><strong>Experience a realistic and smooth VR interaction while using weapons and objects.</strong><br/></li><li><strong>Choose from multiple movement and ease-of-use options designed for VR.</strong><br/></li><li><strong>Follow the characters' epic stories through fully narrated and animated shorts.</strong><br/></li><li><strong>Walk in delicately designed, Old West-inspired environments.</strong><br/><strong>And much more!</strong><br/><br/><strong>Are you ready to embark on this epic adventure and prove your mettle in the wild, untamed West?</strong></li></ul>", "metacritic": null, "released": "2024-04-08", "tba": false, "updated": "2024-04-12T07:22:52", "background_image": "https://media.rawg.io/media/screenshots/680/680f74cb31d7141ba8ca0122db1a7491.jpg", "website": "http://www.blacktrailgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Red Horizon"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Red Horizon"], "esrb_rating": null}