{"id": 979928, "slug": "yellow-taxi-goes-vroom", "name": "Yellow Taxi Goes Vroom", "name_original": "Yellow Taxi Goes Vroom", "description": "<strong>Yellow Taxi Goes Vroom!</strong> is a trippy arcade platformer ready to take you on a crazy adventure!<h3>Wait, It's Not A Driving Game?</h3> In this chaotic platformer you spend more time in mid-air than on the ground, even though you have 🚫 <strong>NO JUMP BUTTON!</strong> String together moves to reach spots even the developers haven't accounted for, as you flip, dash and bump your way to new heights!<br/><br/><h3>Hoarder's Paradise</h3>We took <strong>\"collectathon\"</strong> seriously! Make your way to the most obscure and difficult to reach corners of our hand-crafted retro levels and we made sure there's something there for you to collect! ... We <strong>dare</strong> you, try to get out of bounds 👀<br/><br/><h3>The Questionable Crew</h3>Pizza King, Morio and Ultra Chad are only a few of the <strong>weirdos</strong> you'll interact with as you piece together the narrative puzzle and unravel the grand conspiracy happening on Granny's Island! 🌴<br/><br/><h3>Genuine Passion Project</h3>This entire project is the brainchild of <strong>Matteo</strong> and <strong>Lorenzo</strong>, who made everything from scratch out of genuine passion for the olden days of video games! 🎮 The game wholly reflects their personality, and judging by the trailer... trust us, it's a trip worth taking!<br/><br/><br/><br/><br/><br/> <br/> <br/>", "metacritic": null, "released": "2024-04-09", "tba": false, "updated": "2024-04-12T06:49:31", "background_image": "https://media.rawg.io/media/screenshots/219/219fe7d4221aac6a30531ee3a8e690f8.jpg", "website": "https://taxi.game", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Panik Arcade"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Those Awesome Guys"], "esrb_rating": null}