{"id": 979989, "slug": "cirrus-business", "name": "Cirrus Business", "name_original": "Cirrus Business", "description": "In this wholesome community-focused adventure, Cloudi is tasked with restoring nature to its original pristine state. <br/><br/><br/>This is accomplished by cultivating and upgrading an assortment of magical crops.<br/><br/><br/>However, watch out for the slobsters - they don’t take kindly to a clean environment!<br/><br/><br/>Luckily, Cloudi has a squad of loyal friends to help out.<br/><h3>Unique Features of Cirrus Business</h3><ul><li><strong>Story-Driven Farming:</strong> Experience a unique farming simulator that weaves an engaging narrative with several possible endings.<br/></li><li><strong>Dynamic Farming System:</strong> Manage upgradeable crops in a highly dynamic system, requiring players to balance enemy generation and resource production for a challenging yet rewarding experience.<br/></li><li><strong>Character Abilities:</strong> Each character comes with unique abilities intricately interwoven into the farming system, adding layers of strategy to the gameplay.<br/></li><li><strong>Community Focus:</strong> Immerse yourself in a heartwarming sense of neighborly community, enhanced by cutscenes that bring characters together and unfold a coherent story.<br/></li><li><strong>Handcrafted Aesthetics:</strong> Enjoy a cozy aesthetic as all assets and music are created from scratch, contributing to a heartfelt gaming experience. :)</li></ul>", "metacritic": null, "released": "2024-04-11", "tba": false, "updated": "2024-04-12T08:12:26", "background_image": "https://media.rawg.io/media/screenshots/a9f/a9fe425cffd9922b99197cf46bc21449.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Oofin Sprouts"], "genres": ["RPG", "Casual", "Indie"], "publishers": ["Oofin Sprouts"], "esrb_rating": null}