{"id": 979933, "slug": "amulet", "name": "Amulet", "name_original": "Amulet", "description": "Embark on an epic journey into the heart of darkness in \"Amulet,\" a gripping hack-and-slash RPG dungeon crawler with a haunting gothic theme. Channeling the spirit of classics like Diablo 2, \"Amulet\" sets itself apart with innovative gameplay mechanics that redefine the way you approach your adventure.<br/><br/><strong>Key Features:</strong><br/><br/><ul><li> <strong>Minimalist Inventory:</strong> Embrace the challenge of decision-making with only four precious item slots - Weapon, Helm, Armor, and Shoes. Every discovery forces you to weigh the value of new loot against your current gear, ensuring a constant thrill of trade-offs.<br/><br/></li><li> <strong>Pure Loot System:</strong> Forget experience points and leveling up. In \"Amulet,\" your character's attributes and skills are entirely determined by the mystical items you carry. Manage your limited inventory like a hand of cards, each item granting unique skills, magical abilities, and class points.<br/><br/></li><li> <strong>Dynamic Class System:</strong> Choose your path as a Knight, Wizard, or Rogue, but the beauty lies in your flexibility. Items bestow class points, allowing you to reshape your character on the fly. Found an ultra-rare sword? Embrace the change and craft a new, unstoppable build.<br/><br/></li><li> <strong>Linked Sub-Attributes:</strong> Delve into the intricacies of sub-attributes tied to your characteristics. Gain health, magic, regen rates, run speed, and more based on your class points. Every decision echoes through your character's performance, creating a dynamic and strategic gaming experience.<br/><br/></li><li> <strong>Varied Weaponry:</strong> Wield the power of swords, bows, and staffs, with more weapon types promised in future updates. Engage in tactical combat with four types of damage - piercing, slashing, bludgeoning, and magical - each impacting your encounters with creatures having resistances and vulnerabilities.<br/><br/></li><li> <strong>Rich Item Qualities:</strong> Seek out the best gear with normal, unique, rare, and legendary item qualities. Uncover the mysteries of the forsaken castle, battling through hordes of evil creatures to confront the malevolent witch who threatens a peaceful village.</li></ul><br/>Are you ready to face the darkness and become the hero the village desperately needs? Uncover the secrets of \"Amulet\" as you embark on an unforgettable adventure filled with peril, loot, and the ever-present allure of the unknown.", "metacritic": null, "released": "2024-04-07", "tba": false, "updated": "2024-04-12T06:57:09", "background_image": "https://media.rawg.io/media/screenshots/420/4204e2cceef8602e1ab6cf47ed85f55b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FlipSide Games"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Flipside Games"], "esrb_rating": null}