{"id": 979973, "slug": "illang", "name": "iLLANG", "name_original": "iLLANG", "description": "Gather a group of friends and hunt down the Illang (wolf) hiding in Koji Village!<br/>In the peaceful Koji Village, a wolf in sheep's clothing is hiding among the villagers, plotting to hunt you and your friends down. Complete various mini-game missions before you are eaten, and team up with your friends to banish the beast from the village! <br/><br/>Work together or turn against each other to emerge victorious in this exciting tug-of-war of deception!<br/><br/><br/><br/><br/><ul><li>Outsmart the Illang using the special skills from the unique jobs available to the Villagers team.<br/></li><li>Look for clues that will lead you to the identity of the Illang.<br/></li><li>Vote against the suspected player and banish them from Koji Village!</li></ul><br/><br/><ul><li>Do not let the Villagers complete their missions.<br/></li><li>If the number of Illang is equal to or higher than of the Villagers, the Illang team wins.<br/></li><li>Use secret passages to get around Koji Village undetected and eat the villagers.</li></ul><br/><br/><br/><h3>Game Features</h3><ul><li>Cute and adorable chibi characters!<br/></li><li>Various mini-games such as Flower Bloom, Cat Finder, Treasure Hunt and more!<br/></li><li>Missions and skills that vary depending on your character's role!<br/></li><li>Wide range of customization options for outfits, accessories, pets, etc.<br/></li><li>Communicate with your friends via text chat, voice chat, and more!<br/></li><li>Cross-platform play between PC, Android, iOS, .</li></ul>", "metacritic": null, "released": "2024-04-08", "tba": false, "updated": "2024-04-12T07:50:23", "background_image": "https://media.rawg.io/media/screenshots/595/59509935ce691a9f420babc4c2d0843b.jpg", "website": "https://www.playillang.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Challengers Games Corp."], "genres": ["Casual"], "publishers": ["Challengers Games Corp."], "esrb_rating": null}