{"id": 979991, "slug": "gigantic-rampage-edition", "name": "Gigantic: Rampage Edition", "name_original": "Gigantic: Rampage Edition", "description": "<strong>GO GIGANTIC! THE UNIQUE MOBA HERO SHOOTER RETURNS! </strong><br/><br/><strong>GIGANTIC: RAMPAGE EDITION </strong>is a premium and definitive release of the original 5v5 MOBA Hero Shooter, GIGANTIC, that provides a dynamic and exciting team-based multiplayer experience for fans of both genres. Choose from a diverse roster of unique heroes, each with a set of upgradeable abilities, and team up with four other players to control objectives and take down the opposing team’s mighty Guardian, all while protecting your own. <strong>GIGANTIC: RAMPAGE EDITION</strong> includes a new game mode, cross platform play, new heroes, new maps, and gameplay improvements that give fans a bigger and more complete GIGANTIC experience than ever before, while welcoming new players to the action and fun-filled world of a Hero Shooter. <br/><br/>FEATURES: <br/>EVERYTHING FROM THE ORIGINAL GIGANTIC AND MORE! <br/><br/>EXCITING ROSTER OF HEROES - 23 returning heroes and new heroes to select from, all with a unique set of offensive and defensive capabilities, including their own ultimate abilities. Choose a hero, join a team and go against another team in 5v5 battles to see who will win it all! <br/><br/>NEW HEROES: <br/><ul><li>ROLAND - A world-hardened man, who lost his arm, but gained unparalleled reach. <br/></li><li>KAJIR - A fast reflexed feline who has a taste for fighting in the alley and streets. </li></ul>EXPANSIVE AND INTRICATE MAPS – Set in a vibrant fun-filled world, prepare to jump into and blast your way across expansive battlefields with creatures, such as massive Guardians, to aid you in battle! <br/><br/>NEW MAPS: <br/><ul><li>PICARO BAY -   A breezy seaside map with verticality, narrow alleyways, and a pirate ship for waging fast paced clashes. <br/></li><li>HEAVEN’S WARD – A heavily industrialized district that showcases an old power plant, warehouses, and factories with many nooks and crannies for players to have a blast in. </li></ul><br/>CUSTOMIZATION AND HERO PROGRESSION – Make your favorite GIGANTIC hero your own! Build and customize individual hero loadouts that match your playstyle, unlock and choose from a variety of hero and weapon skins, including new skins not from the original game, and unlock additional content for your hero as you progress! <br/><br/>GAME MODES:  <br/><ul><li>RUSH – A new game mode that is more accessible, fast-paced and action-packed for all players bringing a streamlined GIGANTIC experience that lets players jump in and get into the action with ease. <br/></li><li>CLASH – The original game mode from the classic version of GIGANTIC is back, bringing a deeply strategic and thrilling team-based experience for more epic matches. <br/></li><li>CUSTOM – Create your own exciting matches where you can pick a map, compete against friends to refine your skills on the battlefield, and also spectate. </li></ul><br/>CROSS PLATFORM PLAY BETWEEN CONSOLES AND PC <br/>Team up and jump into epic matches with friends across multiple platforms. <br/><br/>FREE POST LAUNCH CONTENT: <br/>Following the launch of RAMPAGE EDITION, a Ranked Mode and new hero skins will be released for free via updates.", "metacritic": null, "released": "2024-04-09", "tba": false, "updated": "2024-04-12T08:16:07", "background_image": "https://media.rawg.io/media/screenshots/e69/e69ad8ab699d1b61e15f9e1c4244dc66.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 521, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Abstraction Games"], "genres": ["Action"], "publishers": ["Arc Games"], "esrb_rating": null}