{"id": 979934, "slug": "master-of-vtuber", "name": "Master of Vtuber", "name_original": "Master of Vtuber", "description": "◆Game Introduction◆<br/>There are various reasons why someone would want to become a Vtuber. It could be a simple love for singing, gaming, or drawing, with the desire to share those passions with others. It might also be a means of practicing social skills or escaping from reality. Once a Vtuber begins streaming, they inevitably encounter challenges and obstacles. Some choose to give up, while others persist, continuously improving themselves and acquiring various skills to enhance their streaming quality, aiming to become a more formidable Vtuber.<br/><br/>Those who persist till the end will discover that, regardless of their initial motivations, the ultimate goal is the same – to become a Vtuber Master who is beloved and welcomed by the audience, capable of standing out on their own!<br/><br/><br/>◆Gameplay◆<br/>Players will take on the role of a manager or boss, accompanying Vtubers on their journey to growth. Together, decisions will be made on various matters, including life, learning, and streaming activities, in order to achieve goals at each stage until becoming a Vtuber Master.<br/>Of course, the assistance of classmates is indispensable throughout the process.<br/><br/><br/>◆Characters◆<br/>・Lin Mei 林梅<br/><br/>\"I'm a national-level magician; this won't be a challenge for me!\"<br/>A nationally appointed magician from a secluded world, she accidentally crossed over to this world while creating an elixir of immortality for the king.<br/><br/>・Lan Xiangchu 蘭香楚<br/><br/>\"All the assigned tasks are done. What else do you need from me?\"<br/>A person living up to her name, \"difficult to get along with.\" Silent and serious, though not overtly expressive, she won't easily back down when it comes to things she likes or cares about.<br/><br/>・Lu Tianhui 綠天繪<br/><br/>\"My drawings are awesome, right? Quick, praise me!\"<br/>Facing numerous challenges in job interviews after entering society, she joined the Ninth Game thanks to her family's recommendation. Now, she balances her life in a game company, drawing and livestreaming her artwork.", "metacritic": null, "released": "2024-04-07", "tba": false, "updated": "2024-04-12T06:58:24", "background_image": "https://media.rawg.io/media/screenshots/350/350a115586b6f5e9f5173423457da7e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Ninth Games Co"], "genres": ["RPG", "Simulation", "Casual", "Indie"], "publishers": ["Ninth Games Co., Ltd"], "esrb_rating": null}