{"id": 980003, "slug": "final-factory", "name": "Final Factory", "name_original": "Final Factory", "description": "<h3>Join the Discord</h3><h3>The Game</h3>In <strong>Final Factory</strong>, create a space-faring factory as vast as the cosmos. Explore and expand across space on an infinitely generating map, filled with stars, planets, black holes, the ruins of an ancient civilization, and ancient artifacts that will help your factory.<h3>Automate Everything</h3><br/><br/>Set up automation to make all aspects of your stations run like clockwork. <strong>Design space stations</strong> and connect them through careful logistical planning. Use your infrastructure to<strong> advance through a sprawling tech tree</strong>. Automate the production of a <strong>massive fleet of ships</strong> that will grant you special abilities and help you <strong>defend your base</strong> against the local aliens.<h3>Design Space Ships</h3><br/>Every station in Final Factory <strong>can move</strong>! Slap a rocket onto anything to make it go faster. <strong>Design huge battleships</strong> that can house their own fleets for battle. Send out exploration vessels to <strong>explore </strong>new parts of the map. Or <strong>design and program</strong> cargo haulers to carry items to different parts of your factory.<h3>Build Mega Structures</h3><br/><strong>Create mega structures</strong> like Dyson Spheres and Dark Star Gates to super charge your factory and delve deeper into the unexplored reaches of space. <strong>Build a mega-factory</strong> with massive scale across an infinite map.<h3>Command Your Fleet</h3><br/>The local aliens aren't happy about your presence in the system. <strong>Command a great fleet</strong> to defend your factory and expand. Gain access to <strong>new abilities </strong>depending on your fleet composition and take on your enemies in bullet-hell style combat. Or play the game on <strong>pacifist mode</strong> for a relaxed experience!<h3>Wishlisting helps a bunch!</h3>", "metacritic": null, "released": "2024-04-09", "tba": false, "updated": "2024-04-12T08:35:14", "background_image": "https://media.rawg.io/media/screenshots/bdf/bdf8c1ac3c3130485dac53a2f8394de3.jpg", "website": "https://nevergames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 344, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Never Games Limited"], "genres": ["Strategy", "Simulation"], "publishers": ["Never Games Limited"], "esrb_rating": null}