{"id": 980085, "slug": "ignited-in-cavern", "name": "Ignited in Cavern", "name_original": "Ignited in Cavern", "description": "\"Once upon a time, there were ten suns in the sky...<h3>Story Overview</h3>In the waning years of the Northern Wei Dynasty, in the town of Dunhuang, a rumor circulates about a stone statue that bestows blessings in the mortal realm. General Anu of the Northern Wei, accompanied by Chu Qingqing, rushes to this place only to discover that the merchant holding the stone statue has already met his demise. A mysterious murder, a hidden thief among the crowds, and the sudden manifestation of the stone statue. What do the spirits within the statue seek, and what do they offer? In the darkness, the two are forced to reminisce about the past, choosing once again the paths that lead them to the present and the next moment.<br/><br/><strong>Strange Events in Luoyang</strong><br/>Chu Qingqing, son of a wealthy family, grew up inseparable from his younger sister and cousin. As they matured and his sister married their cousin, a hidden desire began to stir within Chu Qingqing. Lost in confusion, he returns to the old mansion of his childhood, where a secret awaits him behind the plum tree in the garden...<br/>\"You must feel that you love her, otherwise you'll become a joke.\"<br/><br/><strong>Turmoil in the Six Towns</strong><br/>In the sixteenth year of Taihe, Anu, daughter of the Tuoba family, follows her sister-in-law, a Xianbei shaman, to the town of Wuchuan to partake in her first war. Subsequently, her sister-in-law dies unexpectedly, the capital relocates to the south, and over a decade passes... Six years after the death of Emperor Xiaowen, she returns to the turbulent town of Wuchuan. With the garrison town ravaged by plague and the shaman of Lu Tou walking through fire, what answers will the spirits provide to the truths Anu once sought? In the green eyes of a woman, burgeoning ambitions begin to shine...<br/>\"I am no longer your pet... I am a hunter now, just like you.\"<h3>Game Introduction</h3>This game is a fantasy family drama set in the Northern Wei Dynasty, with a choice-driven visual novel AVG format.<br/>The game features about 100,000 words of text, with two main character storylines and six endings. After completing the first playthrough, players can choose another storyline for the second playthrough. The total playtime for the entire story is approximately 3 to 5 hours.<br/>The story includes non-traditional intimate relationship plots, including GL/BL/BG/GB orientations, LGBTQ+ content, and polyamorous relationships.<br/>Content warning: This game contains depictions of violence, sexual innuendo, unethical and criminal behavior. The viewpoints of characters do not necessarily reflect those of the author. If you feel uncomfortable, please close the game promptly.<br/>This story is purely fictional and has no connection to any real individuals, events, groups, or organizations.<h3>Production Team</h3>Copywriting: Guai'an, Zhanqintai, Ze<br/>Art: Guai'an, Rink, Zhideng<br/>PV Production: Zeixique, Zhideng<br/>UI: Zeixique, Zhideng<br/>Programming: Guai'an<br/>Historical Advisor: Zheng Xiaoshuang<br/>Music: Canniles, Darwin Bai Lu, RSxingmouyu, Luoyang, Qianmengying @ Low Battery Studio<br/>Production Tool: Ren'Py\"", "metacritic": null, "released": "2024-04-11", "tba": false, "updated": "2024-04-12T13:30:05", "background_image": "https://media.rawg.io/media/screenshots/4aa/4aaab144e992c4f29d5328e449ffdca9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 393, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["伤官制作组"], "genres": ["Indie"], "publishers": ["伤官制作组"], "esrb_rating": null}