{"id": 980038, "slug": "poop-spotter-the-game-to-improve-the-quality-of-po", "name": "Poop Spotter ~ The game to improve the quality of poop~", "name_original": "Poop Spotter ~ The game to improve the quality of poop~", "description": "This is a \"spot the difference\" game with poop.<br/>\n<br/>\r\nYou are an employee of a poop factory and your job is to ensure the quality of the poop produced.<br/>\r\nCompare the poop flowing on the conveyor belt with a sample of acceptable poop and remove all the defective poop you found!<br/>\n<br/>\r\nThe flow of play is as follows.<br/>\n<br/>\r\n1.Many poo-shaped characters flow down the conveyor belt.<br/>\r\n2.The poo-shaped characters are randomly given various colors and shapes.<br/>\r\n3.You compare them one by one with the previously given sample.<br/>\r\n4.If it is the same shape as the sample, it is an accepted product and you don't have to do anything.<br/>\r\n5.If the shape is different from the sample, it is defective and you need to remove it immediately by clicking the mouse.<br/>\r\n6.The type of accepted product will be changed periodically and the time allowance will decrease as the days go by.<br/>\r\n7.Repeat the above steps, and if you can continue to work for 5 days in game time without making a mistake, you have cleared the level.<br/>\r\n8.The game is over if the player fails to remove defective products or discards accepted products.<br/>\n<br/>\r\nThere are four levels in this game.<br/>\n<br/>\r\n1.A level in which the player monitors one slow production line.<br/>\r\n2.A level in which the player monitors one fast production line.<br/>\r\n3.A level in which the player monitors two production lines.<br/>\r\n4.A level in which the player monitors four production lines.<br/>\n<br/>\r\nOnce all levels are completed, an endurance mode with no day limit will be unlocked.<br/>\r\nThis game will test your split-second judgment and memory.<br/>\n<br/>\n<br/>\r\n*** Additional elements only for the Steam version ***<br/>\n<br/>\r\n1.Endurance mode is available when you complete the game.<br/>\r\n2.Steam Achievements can be obtained.", "metacritic": null, "released": "2024-04-10", "tba": false, "updated": "2024-04-12T09:32:06", "background_image": "https://media.rawg.io/media/screenshots/7f3/7f31d6bf3051a121359f42d9ea864d06.jpg", "website": "https://exogamesjapan.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Exo Games"], "genres": ["Casual", "Indie"], "publishers": ["Exo Games"], "esrb_rating": null}