{"id": 980073, "slug": "over-islands", "name": "Over Islands", "name_original": "Over Islands", "description": "Immerse yourself in a single-player, first-person adventure that combines frenetic action, city management and thrilling quests in an immersive universe. You will develop your flying island and explore the unknown lands of Azordian. Reconnect the islands together and rally their inhabitants to your cause! Face demonic enemies and become more and more powerful during your adventure!<br/><br/>You play as \"the stranger\", an air adventurer in search of fortune and glory chosen for a large-scale mission: defeat the children of the goddess and defeat their demonic armies to restore balance in the world. Bring order to these islands by helping their inhabitants and build a thriving city for your new citizens!<br/><br/><br/>Explore a fantasy world of flying islands with diverse landscapes, each home to unique secrets, treasures and dangers. Journey through enchanted forests, ruined cities, tropical expanses and more, as you uncover the captivating history that connects this celestial archipelago.<br/><br/><br/><br/><br/>In addition to liberating the captive population, you will be tasked with rebuilding and thriving the city and its inhabitants. Collect taxes, construct buildings, upgrade them and make important decisions to develop the city and gain access to new services.<br/><br/><br/><br/><br/>As you travel, air pirates will try to intercept you. Eliminate them before they get you in trouble!<br/><br/><br/><br/><br/>During your journey, you will have to fight enemies in growing numbers. Choose your arsenal wisely and upgrade it to increase your power. If resistance persists, look for temporary bonuses hidden on the island for a decisive boost.<br/><br/><br/><br/><br/>Delve into complex puzzles scattered across the islands, exploring ancient temples, mysterious ruins and other enigmatic locations. Solve challenging puzzles to uncover clues to the islands' history and unlock valuable rewards.<br/><br/>", "metacritic": null, "released": "2024-04-11", "tba": false, "updated": "2024-04-12T13:15:37", "background_image": "https://media.rawg.io/media/screenshots/e0f/e0fb19a7d1bc2068aa988b9b2c242e29.jpg", "website": "http://aridide-production.com/overislands", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aridide Production"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Aridide Production"], "esrb_rating": null}