{"id": 980115, "slug": "nba-infinite", "name": "NBA Infinite", "name_original": "NBA Infinite", "description": "Run the court in NBA Infinite — a real-time PvP mobile game crafted to supercharge your love of NBA basketball. Stake your claim as one of the best to lace up your sneakers as you build your team from the ground up — collecting and customizing your first-class lineup. Then hit the court with your star team and cross up your opponents as you create your legacy in this mobile basketball game experience.<br/><br/>Just one download puts NBA Infinite in your pocket — we keep our game current with the latest basketball stars, new game modes, and a wide variety of trendsetting customization options — so you can focus on ruling the court.<br/><br/>RUN THE COURT: Be a floor general in Dynasty, team up with friends, slam dunk the competition in 1v1 pickup games — or hone your skills in casual basketball game modes like the Three-Point Contest and 11-Point Game. Make those critical late-game decisions and build off them for your next run at the Larry O’Brien Championship trophy.<br/><br/>TEAM UP AND COMPETE: Gather your friends to build your championship PvP team in 3v3, or see who really has game in 1v1 and 5v5 modes. The online competitive modes offer a unique NBA basketball experience for mobile. Hop into a quick session, multiplayer experience between all NBA Infinite players to fuel your competitive spirit! Play and compete anywhere and share your highlights with the world.<br/><br/>COLLECT YOUR NBA STAR PLAYERS: Collect real NBA basketball stars, each with a unique moveset just waiting for you to master. Level up your players to drive to the hoop and slam dunk like Giannis Antetokounmpo, step back and shine like Kevin Durant, put the defense on skates like Trae Young, or sink three-pointers like Stephen Curry all day. To go along with this star power, veteran NBA announcer Mark Jones joins the NBA Infinite desk for the play-by-play in English-speaking territories and regional sportscasters are available in Germany with Michael Körner, France with Xavier Vaution and Brazil with Rômulo Mendonça.<br/><br/>NONSTOP NBA MOBILE ACTION: Cross up your opponents with Exclusive and Dominance skills that are unique to each NBA star, nail the perfect give-and-go, and hit the game-winning buzzer beater to become a basketball hoops legend — all from the comfort of your phone.<br/><br/>MANAGE YOUR TEAM TO VICTORY: Make the big decisions that turn your starting five into a legendary lineup that will win championship after championship. Upgrade your coaching staff to strengthen their core defensive and offensive tactics and execute them on the hardwood.<br/><br/>Join the community for all the latest news:<br/><br/>Discord: https://discord.gg/NBAInfiniteGame<br/>Instagram: https://www.instagram.com/NBAInfiniteGame<br/>Facebook: https://www.facebook.com/NBAInfiniteGame<br/>X: https://twitter.com/NBAInfiniteGame<br/>YouTube: www.youtube.com/@NBAInfiniteGame<br/><br/>This game requires an internet connection: 4G, 5G, or Wi-Fi.<br/><br/>Privacy Policy: https://www.nbainfinite.com/Privacy-Policy.html<br/>Terms of Use: https://www.nbainfinite.com/EULA.html<br/><br/><br/><br/><br/>Feedback or Questions? support@nbainfinite.com", "metacritic": null, "released": "2024-02-17", "tba": false, "updated": "2024-04-12T15:11:51", "background_image": "https://media.rawg.io/media/screenshots/a13/a133450f0e4084e9877f7ed698c47929_RGjowM7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Level Infinite"], "genres": ["Sports"], "publishers": ["PROXIMA BETA PTE.LIMITED"], "esrb_rating": "Everyone 10+"}