{"id": 980109, "slug": "rally-one-race-to-glory", "name": "Rally One: Race to glory", "name_original": "Rally One: Race to glory", "description": "Rally One is a full-featured racing game for mobile gamers. It features an easy-to-understand interface, a physics system improved based on user feedback, and well-optimized graphics.<br/><br/>In Rally One, you can participate in championships with powerful cars in exotic locations, race against people from around the world, and test your speed, maneuverability, and drift skills in special events.<br/><br/><br/>Key features include:<br/>- Long-lasting career mode<br/>- Online and offline game modes (Internet connection is still required to keep services active.)<br/>- Special racing events updated regularly<br/>- Extra bonus content such as car parts, posters, and special games<br/>- Group B, WRC, RX, Legends, and Classic car groups<br/>- Over 40 rally cars<br/>- Championship, Versus, Rallycross, Endurance, Drift, and Time Attack race types<br/>- Rainy, snowy, and sunny weather conditions<br/>- 27 racing locations<br/>- Customization, repair, and upgrade options for cars<br/>- Realistic vehicle dynamics with a consistent physics system<br/>- Optimized, device-scalable graphics and special effects<br/>- Gamepad support<br/><br/>Rally One is a well-tested and continuously updated game that is free of errors. Download it today and experience the thrill of rally racing!", "metacritic": null, "released": "2023-08-04", "tba": false, "updated": "2024-04-12T14:32:56", "background_image": "https://media.rawg.io/media/screenshots/3f6/3f643432cce6efa7ed781034c9c0f1c5_YETnXYQ.jpg", "website": "https://vodigitalarts.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["VO Dijital Sanat Teknolojileri LTD. STI."], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["VO Dijital Sanat Teknolojileri LTD. STI."], "esrb_rating": "Everyone 10+"}