{"id": 980126, "slug": "tuscany-adventure", "name": "Tuscany Adventure", "name_original": "Tuscany Adventure", "description": "Welcome to Tuscany Adventure! Our brand-new farm game with exquisite graphics, offers you the chance to enjoy the leisurely life of Tuscany in a garden-like farm. You can not only plant a range of crops, but also raise various cute animals as you build your very own slice of paradise by the babbling stream!<br/><br/>Features of Tuscany Adventure:<br/><br/>Story: Olivia's parents left the family farm under her care, but the Count Bianchi will take it away if she doesn’t run it properly! The Steward urgently calls Olivia, who has been traveling in lands far away, back to the farm to help revive it to its former glory. Meanwhile, Olivia learns that her mother's sudden disappearance may be related to a mysterious treasure. Come and help her solve the confusing puzzles together.<br/><br/>Exploration: Follow Olivia and solve puzzles on the tall mountain peaks, the pirate-infested tropical islands, the misty forests, and in the vast yellow sand desert. Along the way, you will experience various mysterious and thrilling challenges, experience local customs, and encounter many romantic surprises.<br/><br/>Treasure: You will find many treasures in your travels, including rare sea snail pearls left by pirates, priceless antique handicrafts, and golden jewels rewarded to ancient warriors. Find them and give these bounties a new home on your farm!<br/><br/>Love: Facing Vincenzo, a poor but charming gentleman, and Andre, the son of the Count who looks cold but has a kind heart, who will Olivia fall in love with?<br/><br/>Planting and Production: You can plant various special Tuscan crops on your farm, raise adorable animals, and cook a wide range of cuisines from Italy and the world including pizza, cheese, ice cream, and salami. Come and show off your skills!<br/><br/>Decoration: You can decorate your farm with many beautiful flowers such as roses, lavender, and lilies. You can also upgrade and decorate the buildings on your farm. Come and design a farm as beautiful as a flower garden!<br/><br/>Animals: In your travels, you will encounter an injured puppy. You can choose to bring it back to the farm, and it will become your most loyal companion.<br/><br/>Scenery: On your adventures, you will encounter rich and beautiful sceneries, such as romantic rose gardens, enthusiastic harbor towns, mysterious ice valley tribes, dangerous foggy forests, and beautiful blue islands. All of these wonderful locales and more are waiting for you to come and experience!<br/><br/>Friends: In the game, you can compete with friends from all over the world to see who is the real Farm Master!<br/><br/>Tuscany Adventure is a free-to-play farm simulation game. Some paid items we provide in the game can speed up the game process, but payment is not mandatory. All activities in the game are accessible for free.<br/><br/>If Olivia's farm is poorly managed, it will be taken over by the powerful Count Bianchi. Come and use your business strategies and trading skills to help her return her farm to its former glory! Start your Tuscany Adventure today!", "metacritic": null, "released": "2023-04-22", "tba": false, "updated": "2024-04-12T17:46:12", "background_image": "https://media.rawg.io/media/screenshots/ac4/ac4bd26b1ce8f5f66d6f5c24fc7f12a9_vj5zz7O.jpg", "website": "http://www.lor-game.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lor Game Limited"], "genres": ["Adventure", "Simulation"], "publishers": ["Lor-game Limited"], "esrb_rating": "Everyone 10+"}