{"id": 98015, "slug": "the-chameleon-creator", "name": "The Chameleon Creator", "name_original": "The Chameleon Creator", "description": "<p><strong>THE CHAMELEON CREATOR </strong>is a visual novel about the nature of stories, and the different ways they can affect our world. The novel follows the adventures of young Elora Lamplight, but there might be focus on <em>characters</em> down the road...</p><p>The visual novel is intended to be about six chapters long, of varying lengths. The first chapter is available right now, with the other chapters coming later on in the year... maybe. All chapters plan to be free, so the only thing you're gonna be giving up is your time (and potentially faith in humanity), so hopefully I don't waste it???</p><ul><li>Story and writing was done by me?</li><li>Character art was done by Osteo! Check her out she's awesome!!</li><li>Additional character art was done by starglow! Check her out she's equally awesome!!</li><li>Royalty Free stock music by: Kevin MacLeod, Daniel Nering, Kai Engel, and audioblocks.</li><li>Royal Free stock backgrounds.</li></ul><p>This is my first attempt at creating anything, so comments and opinions are much appreciated! Positive or negative, I'll love you all the same!!</p><p><strong><em>The Chameleon Creator - Prologue (30~ Minutes)</em></strong></p><p><em>Princess Elora Lamplight wakes up to another wonderful day in her Kingdom of Solstoria. However, today is not just any ordinary day; it happens to be her 14th birthday, despite her family's attempts to hide the fact. Read the story of the curious Princess who tries to discover what surprises are waiting for her on her special day...</em></p><p>*** There are two \"endings\", as well as some minor spooks and loud noises.</p>", "metacritic": null, "released": "2016-01-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/574/574011ea254858f8008d8fa970894783.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["MotternMind"], "genres": [], "publishers": [], "esrb_rating": null}