{"id": 980195, "slug": "ultimate-scroll", "name": "Ultimate Scroll", "name_original": "Ultimate Scroll", "description": "Welcome to join our official discussion group and stay updated on the game: 728493646.<br/><br/>\"Ultimate Scroll\" is a casual card game set in the backdrop of cultivation in the world of immortals. As immortal cultivators in this realm, players challenge demonic caves, explore treasure vaults, and ascend the Heavenly Tower to enhance their own cultivation.<br/><h3>How to Play</h3>\"Ultimate Scroll\" supports up to 6 players. Each player possesses 6 talismans (from the same set of talismans) and can use them to move within the game area and perform various actions. You can continue playing the game until reaching a certain score, number of rounds, or time limit.<br/><h3>Strategic Decision-Making and Planning</h3>This is an intense strategic game where every round requires careful decision-making. Formulate your movement plans and adjust them based on the actions of other players and the new talismans drawn. The game area's design and various optional features (which can be toggled on or off as needed) allow players to adopt different strategies. The more you play, the more paths to victory you will discover, utilizing combination functions based on specific game settings. The game provides a rich resource system, allowing you to make a comeback even after setbacks. Cultivation levels, cultivation base, spiritual energy, and demonic cultivation keep you engaged until the final round.<br/><h3>Events and Details</h3>The game includes a total of 165 talismans, including artifacts, regular talismans, secret talismans, and demonic talismans. There are 40 Heavenly Tribulation events that occur unpredictably during the game, which can significantly impact the current status of all players, especially when used against specific opponents. Additionally, there are 7 sets of character skills to further enhance gameplay strategy. The game features 11 immortal sects: Penglai Wonderland, Bone Refining Pool, Sky Battle Cliff, Purple Bamboo Forest, Netherworld, Old Book Pavilion, Qiankun Platform, Medicine Hall, Treasure Vault, Danxia Palace, and Heavenly Tower; and 7 mystical realms: Demon Cave, Inner Demons, Heavenly Inquiry Pavilion, Pavilion of Righteousness, Blessed Land, Miasma, and Cataclysm.", "metacritic": null, "released": "2024-04-12", "tba": false, "updated": "2024-04-15T07:08:49", "background_image": "https://media.rawg.io/media/screenshots/ea9/ea90b7179a39c356e6297c72ab004740.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ZetaGame"], "genres": ["Strategy", "Casual"], "publishers": ["ZetaGame"], "esrb_rating": null}