{"id": 980124, "slug": "nba-2k24-myteam", "name": "NBA 2K24 MyTEAM", "name_original": "NBA 2K24 MyTEAM", "description": "NBA 2K24 MyTEAM offers a new way to play and upgrade YOUR lineup and collection in your favorite NBA simulation console game on the go. With MyTEAM, you can assemble a roster of your favorite NBA players from any era and dominate the competition. Play NBA 2K24 MyTEAM for free, or link your PlayStation or Xbox account to seamlessly sync your progress between your console and mobile device. MyTEAM caters to casual NBA fans, card collectors, and competitive gamers alike, delivering an incredible gaming experience that will keep you engaged. <br/><br/>NBA 2K24 MyTEAM boasts many different game modes with varying formats to put your skills to the test. Earn rewards across all modes, in 3v3, 5v5, and full-lineup game types with unique win conditions and game formats. Whether you want to compete in Triple Threat Online: Co-Op, take on the entire NBA in Domination or prove your mettle in Clutch Time, a fast-paced single-quarter mode. Hungry for more? Showcase your skills against the best players across the world in Unlimited, or win the weekend in Limited, with new rules requiring different lineups every week. Flex your championship-caliber lineups in Draft, Domination, Pick-Up, Skills, and Signature Challenges, with new rewards to earn every Season.<br/><br/><br/>Explore the all-new Salary Cap mode where you are given a maximum salary for assembling your lineup. Each card is given a value that goes against your Salary Cap, so choose wisely to ensure you have the deepest team possible. Salary Cap games use a new one-of-a-kind game format; build your lead in the first half, then be the first to the target score in the second half to get the win! With new rounds and rewards every two weeks, it’s never a bad time to compete in Salary Cap.<br/><br/><br/>The newly added Player Market allows you to build the lineup of your dreams on Day 1. Earn reward cards for playing one of the many game modes or use the MTP earned from gameplay to acquire players. Whatever you decide, the choice is yours!<br/><br/><br/>There’s even more to do off the digital hardwood in NBA 2K24 MyTEAM. Enter weekly challenges and earn rewards for your team. Send your players on Exhibitions missions where they will leave your collection temporarily and return with new rewards. Upgrade your lineup through the Pack Market, Token Market, and the Exchange. In NBA 2K24 MyTEAM, you can create limitless lineup variations on your quest for greatness. Play, earn, and craft your way to the top!<br/><br/><br/>---<br/><br/><br/>Authenticate with your XBOX or PlayStation account to enable cross-progression between mobile and console - play, progress, and enjoy content everywhere. <br/><br/>You can also use Guest, Game Center, Apple login and start playing MyTEAM now - your progress, content, and currencies will be available on your mobile device only.<br/><br/><br/>---<br/><br/><br/>Requires an Internet connection and iPhone 8 or above with 4+ GB of RAM. <br/> <br/><br/>Do Not Sell My Personal Information: https://www.take2games.com/ccpa<br/><br/>Please note that NBA 2K24 online features are scheduled to be available until December 31, 2025 though we reserve the right to modify or discontinue online features without notice in accordance with our Terms of Service (https://www.take2games.com/legal/). Visit www.nba2k.com/status for more information.", "metacritic": null, "released": "2024-01-30", "tba": false, "updated": "2024-04-12T17:36:53", "background_image": "https://media.rawg.io/media/screenshots/93b/93bf80b079a97cd415deba8bf5b1ae62_xeWvS0a.jpg", "website": "https://nba.2k.com/2k24/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["2K"], "genres": ["Sports"], "publishers": ["2K Sports"], "esrb_rating": "Everyone 10+"}