{"id": 980117, "slug": "dragon-robot-firefighter-truck", "name": "Dragon Robot FireFighter Truck", "name_original": "Dragon Robot FireFighter Truck", "description": "Welcome to flying dragon robot car games. In these multi-robot transforming games, you can transform into fire flying dragon and firefighter truck in all robot shooting games. This grand robot battle is full of revenge story missions to shoot the rivals with all your superpowers in mega robot wars in this dragon robot games. Get ready for the grand robot wars with alien robots, you are the only hope of the city in this police truck robot game. Flying dragon robot transform war is full of alien invasion which can be stopped by your magical powers in all multi-robot transformation games. You might like this robot shooting game by vanishing all the alien robot rivals with sniper guns and machine guns in your hands in all flying dragon robot car games.<br/><br/>There are three challenging modes in this Dragon Robot FireFighter Truck Game:<br/><br/>1- ' Story Mode ' in this mode you will get to know what was the story behind this war against alien robots, which cause led you to transform into a dragon robot to save the civilians.<br/>2- ' Mech Mode ' in this mode you have to play the role of mech robot and fight a war against mech rivals. You have to transform into a dragon and firefighter truck to win this war.<br/>3- ' Free Mode ' in this mode you are free to pick your task and to go anywhere in the city to be the lead of robots and dragons. You are free to use any superpower to win this battle.<br/><br/>Objectives: Every mode consists of a number of objectives. Complete all the objectives and tasks to accomplish the missions.<br/><br/>Note: Follow the indicators and arrowheads to reach your destination. Kill all the rivals timely otherwise you'll be dead.", "metacritic": null, "released": "2021-11-25", "tba": false, "updated": "2024-04-12T17:05:58", "background_image": "https://media.rawg.io/media/screenshots/7ae/7aec50fa7dbd251cf23f76340fe388f7.jpg", "website": "http://www.appricotstudio.com/#contact", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Appricot Studio"], "genres": ["Action", "Adventure"], "publishers": ["Appricot Studio"], "esrb_rating": "Teen"}