{"id": 980207, "slug": "virtu-pilot", "name": "Virtu-Pilot", "name_original": "Virtu-Pilot", "description": "<h3>A Letter from The Developers</h3>To the next generation of aviators,<br/><br/>We hope this experience encourages and helps you to embark on your first lesson, grit through ground school, feel the joy of your first solo flight and pass your check ride.<br/><br/>And if piloting isn't quite your cup of tea, there is a plethora of aviation careers out there. <br/><br/>Yours,<br/>Aries VR - a squadron of aerospace enthusiasts, trainee pilots and licensed pilots sharing their first person experiences of their training journeys<h3>Overview</h3>Virtu-Pilot was originally tailored for the Meta Quest 2 to equip aspiring pilots with a cost-effective and engaging VR training tool, empowering them to gain confidence and master aviation skills at their own pace.<br/><br/>For the most immersive experience, we recommend using VR, allowing you to step into the pilot's shoes and perform checks and procedures using your virtual hands as if you were in real life. Be prepared to crouch, chuck obstructions, check for ice, open doors, flick lights on and remove tie downs. <br/><br/>NOTE: We excited to bring Early Access to the aviation community, but please remember, this is an early access experience, and your input is invaluable in shaping the future of aviation training. The Windows desktop mode adaptation is quite limited and compatibility with non Meta Quest VR headsets is unknown.<h3>Levels Available</h3><ul><li>Start Screen<br/></li><li>Briefing Room<br/></li><li>Hangar, Lesson 1 - Preliminary interior and walk around checks</li></ul><h3>Key VR Controls</h3><ul><li>Move - left joystick<br/></li><li>Teleport - right joystick<br/></li><li>Grab - hold front or side triggers, release to drop items<br/></li><li>Open Checklist book - look at the left palm in a lesson</li></ul><h3>Demo Locked Levels</h3><ul><li>Lesson 2 - Exterior checks (surface movements, fuel, undercarriage exploded view)<br/></li><li>Lesson 3 - Engine Start Up</li></ul><h3> Exciting Planned Features</h3><ul><li>JSBSim Flight Simulation<br/></li><li>Taxing<br/></li><li>Take-off<br/></li><li>End of lesson quizzes<br/></li><li>Follow along animated Instructors<br/></li><li>AI instructors<br/></li><li>Multiplayer capabilities<br/></li><li>Radio communications training</li></ul>", "metacritic": null, "released": "2024-04-12", "tba": false, "updated": "2024-04-15T07:23:02", "background_image": "https://media.rawg.io/media/screenshots/d3a/d3a281a36e18215e6035c2faa7e293b7.jpg", "website": "https://ariesvr.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aries VR"], "genres": ["RPG", "Simulation", "Indie"], "publishers": ["Aries VR"], "esrb_rating": null}