{"id": 980239, "slug": "island-of-penance", "name": "Island of Penance", "name_original": "Island of Penance", "description": "Dr. Brian, the genius scientist behind the rediscovery of Crest Magic, dies in an accident under mysterious circumstances. Years later, Illumina, the man's only daughter, pursues the career of prison guard in order to gain access to Prison Island and investigate her father's death. Only those with magic affinity get to become guards though, and only men so far have displayed this quirk... But by some miracle and to everyone's surprise, Illumina is compatible, allowing her to become the first female prison guard in the whole nation!<br/><br/>And yet, as the only woman on an island full of men, things will only get more difficult for Illumina from here on out. The wardens rule with abandon and impunity, and their word is law... Will she be able to solve the mystery behind her father's death? And what will it cost her?<br/><br/><br/>While Illumina has studied for years to become a prison guard, things don't work quite as the books said once she gets there. She'll have to navigate a hierarchy corrupted to the core and perform favors for guards and wardens in order to find the information she needs and uncover clues about her father's death.<br/><br/>Many of these favors involve combat, of course, but Illumina's brand-new magic crest comes in handy for that. Not only can she wield a powerful non-elemental spell that allows her to damage all kinds of enemies, but she's also an Omni-Spec, meaning she can wield each and every element... provided she can afford to get more powerful magic crests, that is!<br/><br/>Talk and fight your way through the various blocks of Prison Island while trying to keep your moral compass pointed north.<br/><br/><br/><br/><br/><br/><strong>A Ruthless Tale</strong><br/>The story doesn't pull any punches, and neither do the guards and wardens of Prison Island. Corruption runs so deep it's inextricable from routine, and anyone with an ounce of power will use it to twist their neighbor's arm and get an advantage. As the latest and most naive hire, Illumina will have to sink low before she can rise high once more.<br/><br/><strong>Rampant Prison Violence</strong><br/>Prison Island is a secluded archipelago penitentiary and home to many heinous criminals, but sometimes the inmates can be indistinguishable from those meant to keep an eye on them. All guards on Prison Islands wield powerful magic and don't hesitate to put it to use to torture and murder prisoners with utter impunity. The legacy of Illumina's father is being sullied every day.<br/><br/><strong>Classic Elemental Combat</strong><br/>Fight your way through the various islands as you complete missions for the wardens, trying to garner their favor and stay afloat in this dog-eat-dog world. Rack up funds to afford new Magic Crests that will improve your arsenal and give you a chance against increasingly powerful foes. Master the elements and take advantage of weaknesses to come out on top and solve the mystery of Prison Island.", "metacritic": null, "released": "2024-04-12", "tba": false, "updated": "2024-04-15T08:11:09", "background_image": "https://media.rawg.io/media/screenshots/93d/93d84d2719c1c61869a39f51e6831494.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ONEONE1"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Kagura Games"], "esrb_rating": null}