{"id": 980226, "slug": "vga-planets-nu", "name": "VGA Planets Nu", "name_original": "VGA Planets Nu", "description": "Welcome to the Echo Cluster, a dense cluster of star systems, rich in resources and native life. Over three hundred years ago the 11 races arrived marking the start of a complex and brutal history which is still unfolding today.<br/>\n<br/>\r\nThey brought with them a dangerous and powerful technology, which has allowed elite members of society to skip through time by accelerating close to the speed of light, slowing relative time and then decelerating to alter the course of history again and again. These people are commonly referred to as Echos.<br/>\n<br/>\r\nAs an ambitious leader, you seek access to this technology to make your mark on history. To get it you’ll need to learn the lessons of the past and climb the ladder of society. Unlocking the secrets of history and forging glory in the present.<br/>\n<br/>\r\nBe aware though, the road is more perilous than ever, as a new ruthless species has arrived, and is disrupting life in the Echo Cluster. They are known as the Horwasp Plague.<br/>\n<br/>\r\nClaim your home sector now to start your journey!<br/>\n<br/>\n<br/>\r\nVGA Planets Nu is a graphical multi-player play by turn war game that simulates combat in space between galactic empires. The game emphasizes mining, colonization and the construction of starships. Players compete against each other economically and militarily on a galactic scale.<br/>\n<br/>\r\nThe game system allows players to construct starships by selecting various components and placing them on a given hull type. There are usually 11 players in a game, each playing a different race with special ships and abilities, but there are other formats as well.<br/>\n<br/>\r\nAt the start of a game, each player is given a planet, a starbase, and a ship. The players have to manage their planet's population and resources wisely.<br/>\n<br/>\r\nThey can create more ships and expand their domain through colonization or conquest of neighboring planets. Of course, all players are attempting to do the same thing, so the fleets will, inevitably, engage in combat from time to time.<br/>\n<br/>\r\nVGA Planets Nu can be compared to a multi-player chess game in which all players move all their pieces simultaneously, one turn at a time.", "metacritic": null, "released": "2024-04-12", "tba": false, "updated": "2024-04-15T07:53:41", "background_image": "https://media.rawg.io/media/screenshots/2ad/2ad09897790bdf524be9bd5ad15752d1.jpg", "website": "https://planets.nu", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Planets Nu"], "genres": ["Strategy"], "publishers": ["Planets Nu"], "esrb_rating": null}