{"id": 980351, "slug": "melting-passion", "name": "Melting Passion", "name_original": "Melting Passion", "description": "Waking Up, You have one goal, and one motivation... Money. With all your other memories erased you can't think of anything else, and to make it you're going to start a business selling a lucid dreaming drink to people. Play as Koschei, a slime in a mixed world between fantasy and reality. Manage your time by creating your product, hunting for resources, and dealing with customers. However, the world you find yourself in is dangerous, and do not like your kind...<br/>\n<br/>\r\n- Includes 2 individual gamemodes, Story Mode and Endless Mode. In the 7 Day Long Story Mode, Explore your World and Impress Igor to eventually discover a Cure to your Amnesia. In Endless Mode, Grind out for resources and create an empire making as much profit as possible.<br/>\n<br/>\r\n- Daily gameplay consists of three segments. A 3D Micromanagement section where you create Lucidity Drinks with QTE minigames while managing your workers and customers, a 2D Platformer/Run &amp; Gun Level in which you Hunt for Resources while trying to avoid (or shoot up) the enemies while trying not to die, and finally a Management Menu at the end of each day where you manage your Money, Lucids, and Resources and acquire upgrades.<br/>\n<br/>\r\n- Several characters including Koschei: Our protagonist who must decide what motivation to fulfill, Igor: the CEO of a Public Relations Firm who wants to help you succeed however may have dark intentions, and Ali: A corrupt scammer who stands in the way between you and success.", "metacritic": null, "released": "2024-04-15", "tba": false, "updated": "2024-04-19T05:58:01", "background_image": "https://media.rawg.io/media/screenshots/d65/d65434fbd3969c042c6c6b955dfd046c.jpg", "website": "https://www.voidwaypr.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Frank Carpenter", "Damon Sanchez", "MaximumOverdrive922"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Voidway PR"], "esrb_rating": null}