{"id": 9803, "slug": "nock-hidden-arrow", "name": "Nock: Hidden Arrow", "name_original": "Nock: Hidden Arrow", "description": "<strong>Nock: Hidden Arrow</strong> is a stealth archery dungeon crawl that eschews the resource-management elements you'd normally see in a dungeon crawl in favor of focusing on an immersive dungeon delving experience.  The entire focus is on action and theme.  I'm aiming to have minimal (ultimately no) UI, with all necessary information received through visual and audio cues, and physical feedback.<br/><br/>Core gameplay will consist of:<br/><ul><li>Sneaking around to avoid detection.<br/></li><li>Luring monsters into more advantageous positions (eg alone) so you can happily murder them or slip past them unseen.<br/></li><li>Shooting stuff in the face.  Or the back of the neck.  I don't judge.<br/></li><li>More shooting stuff in the face.<br/></li><li>Avoiding traps.<br/></li><li>\"Accidentally\" setting off traps while monsters are in unfortunate positions.<br/></li><li>Throwing stuff.<br/></li><li>Solving classic dungeon puzzles.</li></ul><br/>I have all sorts of things I'd love to put in this game, but I'm focusing on a tight set of core elements I know I can produce, and that I believe will make for a fun game.<br/><br/>There's still work to be done, but things are shaping up pretty well.  AI is improved, Obviously things are still super early.  The stealth mechanics still need tuning.  But the theme and feel matches what I'm aiming for, and hopefully from this you can get an idea where I'm hoping to go with it.", "metacritic": null, "released": "2016-11-29", "tba": false, "updated": "2019-08-28T22:14:46", "background_image": "https://media.rawg.io/media/screenshots/ca9/ca9e5c47e199570134209fc62064ceb2.jpg", "website": "http://nockgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 20, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["CodeBison Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["CodeBison Games"], "esrb_rating": null}