{"id": 980370, "slug": "the-night-guard-2", "name": "The Night Guard", "name_original": "The Night Guard", "description": "This institution was built in a very interesting place and had an interesting history. It was built on the site of a former hospital for the mentally ill, the only one of its kind. People suffering from a number of ailments spent their last days there. But for some reason, the institution was closed permanently. The patients were distributed to other hospitals, and the two-story building and the adjacent buildings were demolished. And six months later, on the site where the mentally ill were dying in agony, the station grew.  But even here not everything was smooth.  Others complained that things were going missing in their store or electronics were malfunctioning. And Alexei's coworkers repeatedly complained about camera outages.<br/>\r\nYou're on the night shift at the bus station. You keep hearing noises. You need to find out what it is. As you progress you will need to find keys and open locked rooms. A first-person game with elements of horror. Explore the bus station and its rooms, collect batteries for a flashlight. Darkness can hide various secrets.<br/>\n<br/>\r\nF - flashlight, Tab - inventory<br/>\r\nIn-game controls WASD - move, left mouse button - pick up an item. Right mouse button - inspect the item.<br/>\n<br/>\r\nFeatures:<br/>\r\n- pleasant graphics;<br/>\r\n- simple control;<br/>\r\n- interesting gameplay", "metacritic": null, "released": "2024-04-16", "tba": false, "updated": "2024-04-19T06:24:51", "background_image": "https://media.rawg.io/media/screenshots/ba6/ba65b66d3c5b164990d1232a2d3144c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["STuNT"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["STuNT"], "esrb_rating": null}