{"id": 980308, "slug": "cthulhus-reach-devil-reef", "name": "Cthulhu's Reach: Devil Reef", "name_original": "Cthulhu's Reach: Devil Reef", "description": "In the bleak 1920s, luck abandons you, gripped by debt and entangled by the local gangster, Mr. Blackwood. Your path veers to the accursed seaside town of Innsmouth, where a hidden treasure is rumored to lie within Devil Reef.<br/><br/> <strong>Embark solo or with companions</strong> <br/>Ferry to Devil Reef alone or with friends — let the journey begin.<br/><br/><br/><br/><br/> <strong>Explore Devil Reef and its horrors</strong> <br/>What is thought to be an effortless treasure hunt changes fast as you venture deeper, amassing gold. The once-promising labyrinth reveals its sinister nature. Corridors contort, and eldritch horrors multiply, presenting a daunting challenge. Are you strong enough to reach the mythic treasure at the bottom of Devil Reef?<br/><br/><br/><br/><br/> <strong>Unlock powerful weapons and upgrades</strong> <br/>Bolster your chances for survival with arcane scrolls and incantations. Unlock and enhance weapons to confront the impending otherworldly battle ahead. <br/><br/><br/><br/><br/> <strong>Key features</strong> <br/><ul><li>Isometric action roguelike gameplay <br/></li><li>Up to 4 player online co-op multiplayer<br/></li><li>Unlock weapons and upgrades to progress further<br/></li><li>Atmospheric soundtrack and effects<br/></li><li>Wide range of Incantations boosts and give you new abilities<br/></li><li>Generative dungeons - Three Acts with unique bosses will be added during early access<br/></li><li>Map Editor for custom player created maps - Will be added during early access</li></ul><br/> <strong>Plunge Into the Abyss!</strong> <br/>Prepare for a chilling journey into the heart of darkness with Devil Reef, an action-packed roguelike co-op dungeon crawler developed by The Fine Arc Nordic AB. Immerse yourself in a haunting universe inspired by H.P. Lovecraft's twisted tales, where pixel-art graphics and atmospheric soundscapes pay homage to the golden era of 90s gaming - <strong>Wishlist now!</strong><br/><br/>Join the discussion on the Steam Forums or dive into the abyss on our Discord Server.<br/><br/>", "metacritic": null, "released": "2024-04-14", "tba": false, "updated": "2024-04-19T04:53:05", "background_image": "https://media.rawg.io/media/screenshots/ec2/ec239f2eb6c9c4833fe03cd6c31d8f7e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Fine Arc"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["The Fine Arc"], "esrb_rating": null}