{"id": 980383, "slug": "solforge-fusion", "name": "SolForge Fusion", "name_original": "SolForge Fusion", "description": "SolForge Fusion is a card-battling game where players tactically deploy creatures and cast potent spells to outmaneuver their adversaries—each card played levels up, amplifying its power! Designed by <strong>Richard Garfield</strong> (Magic: The Gathering) and <strong>Justin Gary</strong> (Ascension Deckbuilding Game). <br/><br/>The heart of SolForge Fusion lies in its distinctive deck mechanics. Here, every playable deck is crafted from a fusion of two algorithmically-generated and unique faction decks. When you play a card, it doesn't just impact the current round—it levels up, becoming a more powerful version and adding more strategy to your play! So, even though it’s easy to learn and set up, there are infinite possibilities! <br/><br/><br/><br/><br/><ul><li>Take on the role of a mighty Forgeborn, a champion granted incredible powers by the mysterious tower known as the SolForge, and battle against other forgeborn in competitive or casual PvP duels or venture into the frozen world of Solis, earning rewards and collecting experience in the campaign mode!<br/></li><li>Each deck can be customized as it levels up through campaign play, giving you more powerful cards to take on higher-level bosses and adventures!</li></ul><br/><br/><ul><li>Because no two decks are the same, every combination of fused decks will provide a unique play experience. Learn and master each combination in PvP and PvE games</li></ul><br/><br/>Experience the endless possibilities in SolForge Fusion:<br/><br/><ul><li>Unlock a vast array of cosmetics and power-ups <br/></li><li>Play with new cards and adventures released regularly<br/></li><li>Explore each deck's unique leveling capabilities<br/></li><li>Challenge opponents in casual play or online tournaments</li></ul><br/>", "metacritic": null, "released": "2024-04-16", "tba": false, "updated": "2024-04-19T06:43:18", "background_image": "https://media.rawg.io/media/screenshots/852/8525da3f5e5d58d9cbf647d755745f0b.jpg", "website": "https://solforgefusion.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Justin Gary", "Richard Garfield"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Stone Blade Entertainment"], "esrb_rating": null}