{"id": 980361, "slug": "steel-republic-rail-defender", "name": "Steel Republic Rail Defender", "name_original": "Steel Republic Rail Defender", "description": "<strong>S.R.R.D.</strong> is a hybrid of <strong>Strategy Railroad Logistics</strong>, with resource gathering, base building, and tower defense mechanics.<h3>Logistics Wins Wars</h3>You begin each Single Player level with limited supplies, and will need to allocate rolling stock and locomotives to gathering resources and building out your defensive positions. To be successful you will need to learn the best logistics plan for resources and routes in order to optimize income, all while keeping your trains and infrastructure safe from enemy raiders. There are three primary resources to gather along the rail system, and two secondary products - Steel and Supplies - to produce at your home Factory.<h3>Defend Your Operations</h3>The Deploy-able Turrets, Mobile Outposts, and Forward Bases will need to be built up along the rail system to keep the enemy out. Combat units will attempt to take down your Command HQ, but also will deny you access to resources and routes. The better your defensive array the more resources your can gather from the map.<br/><br/><h3>Take Them Out</h3>While the early game is all about defending, to win you will need to build up weaponry and bring the battle to the enemy's home base to destroy it. Spend resources to build up a stock of <strong>Combat Locomotive</strong> units and advanced <strong>Combat Railcars</strong>. For additional supporting fire you can build and deploy  Railway Artillery to fire on the enemy from far across the map.<h3>Retro Historical Setting</h3>The setting and story is fictional, but with a historic mid-20th century Cold War era visual design. Diesel Locomotive Power, Kinetic Weaponry, Heavy Industry, and off-road light vehicles define the technical era.<h3>The Initial game will release as an episode #1</h3>Save the Steel Republic: Play through a single-player Campaign of six mission game levels, with three levels of enemy bot difficulty. New episodes will contain more interactive features and present a new set of challenges. The episodes will be released as a patch/update and will not require a new purchase.", "metacritic": null, "released": "2024-04-15", "tba": false, "updated": "2024-04-19T06:12:53", "background_image": "https://media.rawg.io/media/screenshots/79c/79c883d361e99f166f8ea119cb14e411.jpg", "website": "https://www.indiedb.com/games/steel-republic-rail-defender", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 444, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["spyVspy"], "genres": ["Strategy", "Casual"], "publishers": ["spyVspy"], "esrb_rating": null}