{"id": 980360, "slug": "adventures-in-anglonia", "name": "Adventures in Anglonia", "name_original": "Adventures in Anglonia", "description": "Created for a master's thesis on learning games, engagement, and language instruction, Adventures in Anglonia is a text-based RPG created in RPGMakerMZ meant to be played in local groups of four students (though it can be played singleplayer) in the first-year Japanese university classroom.<br/><br/>Play as one of four unique adventurers sent into the dangerous and mysterious land of Anglonia to search for a mystical wish-granting Artifact, the Heart of the Word. Engage in narratively driven battles that test your listening comprehension about the story of the game, solve dialogue puzzles, and negotiate deals. Make impactful narrative decisions that shape the future of your adventure, Anglonia, and the world.    <br/><br/>In battle, harness the power of language to use impactful skills by associating TOEIC vocabulary, and constructing sentences. <br/><br/>Please be aware that the game features blood, fantasy violence, and language (the bad kind). It features themes of colonialism and native exploitation, and these themes feature heavily in the choices that players are asked to make throughout the game. <br/><br/>When incorporated in the classroom, Adventures in Anglonia took 6 weekly classes (roughly 9 hours). The game is divided into five 'weeks' but oftentimes (particularly for week two) groups took multiple classes to complete them. If playing singleplayer, these divisions can be safely ignored. Originally, the game experience contained supplemental materials such as readings, but those have been incorporated into the game as scrolling text and items. It should work. <br/><br/>It was a truly rewarding experience to build and then play this game with my students, and the results of the research should be published somewhere online at some point in the future following the completion of my thesis.", "metacritic": null, "released": "2024-04-15", "tba": false, "updated": "2024-04-19T06:11:10", "background_image": "https://media.rawg.io/media/screenshots/269/269bb12d63f94a47fa48aa0a41c24e8f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["BoyNamedCrow"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}