{"id": 980336, "slug": "survival-nation-lost-horizon", "name": "Survival Nation: Lost Horizon", "name_original": "Survival Nation: Lost Horizon", "description": "The zombie apocalypse happened. What caused it? Who's behind the plague? How do you contract it? All of these trivial questions have gone with the first bite, turning humans from Earth's apex predator to the new predators' most delicious prey. Join the Survival Nation, fight zombies, and keep what remains of the human civilization alive! <br/><br/><br/><br/><br/>Survival Nation: Lost Horizon is first and foremost a survival RPG. It isn’t just a robust crafting system:  Each survivor is precious, potentially developing a unique set of skills and abilities. All of which may be of use to your group of survivors, spread across three distinct skill trees: Combat, Survival, and Endurance. Each also has needs that need to be met. Harness their potential and survive in a collapsed world: Scour derelict buildings for canned goods, hunt animals and fish, or try and keep your camp intact long enough to harvest fresh produce from the garden.<br/><br/><br/><br/><br/>After all, it's not a zombie apocalypse without zombies. Every decision must be considered against these ravenous hordes who want nothing more than munch on your survivors' precious internal organs. <br/><br/>Work together with your fellow survivors to stem the tide and protect your camp, cooperate to take down powerful mutants, and - if you feel lucky - go on the offensive to hunt down roaming boss zombies, who might hold precious loot. But be wary, the zombie might not be as dangerous as your fellow man.<br/><br/><br/><br/><br/>If you prefer online play and multiplayer, Survival Nation: Lost Horizon has you covered. Adventure across the post-apocalypse in groups and face challenges together in PVE. Prefer solitary pursuits without the threat of other players hanging over you? Set up your own server, where you can explore the open world and experience Survival Nation: Lost Horizon at your own pace!", "metacritic": null, "released": "2024-04-15", "tba": false, "updated": "2024-04-19T05:34:19", "background_image": "https://media.rawg.io/media/screenshots/053/0536037ef3d52eb6e1b26f9659693f7f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Wenkly Studio"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Freedom Games"], "esrb_rating": null}