{"id": 980385, "slug": "unnamed-project-2", "name": "Unnamed Project", "name_original": "Unnamed Project", "description": "Explore a game developer’s projects and help them test their game by interacting with objects and in the environment in unexpected ways. Depending upon the objects you interact with, the game developer will comment on your actions or decide to have you playtest a different “project”. The projects are levels that are represented by singular playspaces for the player to explore in Unnamed Project.<br/><br/>At the beginning of the game, the player spawns into a completely dark room surrounded by the sounds of a typing keyboard. In front them they see a bright white door among the darkness. Walking to it, they're greeted with a with the sounds of increasingly loud typing. Opening the door, the player finds Room 1: The Hall. Explore the room and find a way to get the developer's attention. The more you explore the more paths you unlock. Each level has multiple actions possible that will split the path to where your exploration leads you. Some levels are rarer than others. We recommend screenshot ting it in the event you do find it for bragging rights. Completing specific actions  will also unlock steam achievements. At the end of the game, the developer will explain what all he observed from you. Have fun!<h3>Features</h3><ul><li>Multiple Paths</li></ul><ul><li>Steam Achievements</li></ul><ul><li>Single-player</li></ul><ul><li>Subtitles</li></ul><ul><li>Free Cake</li></ul>", "metacritic": null, "released": "2024-04-16", "tba": false, "updated": "2024-04-19T06:45:33", "background_image": "https://media.rawg.io/media/screenshots/d57/d57f25af00334d1a892e37372a1a03ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Highlander Interactive"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Highlander Interactive"], "esrb_rating": null}