{"id": 980472, "slug": "klabater-complete-bundle", "name": "Klabater Complete Bundle", "name_original": "Klabater Complete Bundle", "description": "<p>Save more money with this bundle!\n<br/><br/>\nIf you already own any of the games contained within this pack, you'll receive additional codes for them via email when purchasing the Bundle.\n<br/><br/>\nPlease note that this pack contains Moonshine Inc., Best Month Ever!, orbit.industries, Castle on the Coast, The Amazing American Circus, Alice VR, Help Will Come Tomorrow, We. The Revolution, Apocalipsis: Wormwood Edition and Crossroads Inn Anniversary Edition!</p>\n<br/>\n\nKlabater Complete Bundle includes:\n\n<br/>\n\n\n\nMoonshine Inc.\n - We love moonshin’. Now, you get to play a story-rich management game focused on crafting moonshine, brandy, whisky, and vodka. You’ll ferment, distill, then name your booze how you want it. You’ll run that business big. Smart, yet discreetly. Cause ain’t nothin’ illegal... ‘til you get caught! \n\n\n\n\nBest Month Ever! - Take part in a roller coaster of emotions with Louise embarking on a road trip of a lifetime through the late 1960s USA, trying to show her son Mitch how to navigate the often cruel modern world. Your choices matter!\n\n\n\n\norbit.industries - Become a Space Pioneer by building and managing a station of your own on the orbit of distant planets! Focus on design and management or fulfill objectives to progress. Explore, Build and Prosper! \n\n\n\n\nCastle on the Coast\n - A hand-drawn, retro 3D collectathon. Parkour through a magic castle as George the Giraffe! String together sweet moves to explore crystal caverns, stone laden halls, and trippy alternate dimensions. \n\n\n\n\nThe Amazing American Circus - Roll up and play a deck building game like no other! Gather weird and wonderful performers, amaze audiences, explore Gilded Age America, and transform your run down circus into an entertainment empire. Play your cards right and you could claim the crown of greatest showman from P.T .Barnum! \n\n\n\n\nAlice VR - Alice VR is a single player story-driven exploration game with puzzles designed to be a unique VR experience. Set on a mysterious planet and inspired by Alice in Wonderland, it's a thrilling, immersive adventure with beautiful graphics and an atmospheric electronic soundtrack. \n\n\n\n\nHelp Will Come Tomorrow\n - In an uninhabitable Siberian wilderness, in a wake of October Revolution, a group of passengers survives the mysterious catastrophe of Trans-Siberian railway train. They must endure in a harsh ice-clad climate until rescue arrives. Facing many dangers, their own weaknesses and, their own prejudice. \n\n\n\n\nWe. The Revolution - As a judge of the Revolutionary Tribunal, preside over complicated cases of ordinary citizens, dangerous criminals, and enemies of the revolution in revolutionary Paris. Make judgments, plot political intrigue, and try to not lose your own head! \n\n\n\n\nApocalipsis: Wormwood Edition - Apocalipsis is a point-and-click adventure game, in the vain of Samorost and Machinarium, where all puzzles have a hidden meaning. With a unique artstyle inspired by 15th century engravings it tells a story about heartbreak, redemption and, quite literally, the end of the world. \n\n\n\n\nCrossroads Inn Anniversary Edition - Crossroads Inn, a real-time management sim, unfolds in Delcrys' unique fantasy realm. Construct and oversee your inn, delight traveling heroes, and achieve renowned status for your services across the kingdom. \n\n\n<br/>\n<p>Languages, features and system requirements may vary between games - please check individual product pages for details.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2024-04-19T13:48:21", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Klabater"], "genres": [], "publishers": ["Klabater"], "esrb_rating": null}