{"id": 980461, "slug": "europa-universalis-iv-winds-of-change", "name": "Europa Universalis IV: Winds of Change", "name_original": "Europa Universalis IV: Winds of Change", "description": "Europa Universalis IV: Winds of Change Pre-Purchase Bonus Pack<br/>\n<br/>\nA new music pack is available exclusively for those armchair conquerors who pre-order the Winds of Change expansion for Europa Universalis IV. This collection of three songs draws inspiration from the soundscapes and cultures of the regions highlighted in this wide-ranging add-on to Paradox’s flagship historical grand strategy game, evoking thoughts of lands distant in both time and space.<br/>\n<br/>\nThis pack includes three new songs:\n<ul>\n<li>One inspired by the discovery of the Americas, a sea shanty with nautical themes.</li>\n<li>One drawing on the North Sea and Hanseatic cultures</li>\n<li>One inspired by the cultural crossroads of Central Asia, with sounds of the Silk Road</li>\n</ul>\n<br/>\nEuropa Universalis IV: Winds of Change<br/>\n<br/>\nThis expansion pack for Europa Universalis IV focuses on three regions of the world that are dramatically transformed by the rapid changes of the early modern world. In the Americas, regional empires are solidifying their position as a new threat prepares to overwhelm their societies. In Europe, the Reformation, new trading routes and the rise of a proto-nationalist spirit challenge old nations to reform and present lucrative opportunities for the financially astute. In Central Asia, the erosion of Mongol power has left a number of nations scrambling to fill the power vacuum.<br/>\n<br/>\nWinds of Change makes wide-ranging changes to twenty nations stretching from the Andean highlands to the vast steppes of Mongolia. There are many new branching missions, government reforms, events, estate privileges and more, including dramatic game-changing options like returning the Timurid Empire to a nomadic society, pursuing the Glorious Revolution to unite the Dutch and English thrones, or leading an indigenous American invasion of Europe.<br/>\n<br/>\nOn top of hundreds of new missions, Europa Universalis IV: Winds of Change makes unique changes to:\n<ul>\n<li>Aztec Empire: New “Tonalli” mechanic encourages warfare and sacrifices. Pursue the goal of centralizing the loose empire of vassals, and new government reforms including famous chinampa farming.</li>\n<li>Mayan Nations: Build a united confederation of Mayan nations, thrive in the tropics of the Yucatan and centralize your union into a stronger kingdom to meet the coming storm.</li>\n<li>Inca Empire: Expand from Cusco to conquer or colonize nearby territories, resist the traditional power of mummified rulers and manage Incan Imperial authority.</li>\n<li>The Netherlands: Explore more economically themed government reforms and decisions, participate in the power struggle between the stadtholders and monarchists or switch to English national content through Glorious Revolution.</li>\n<li>Venice: Resist or bow to the power of the Council of Ten in a new Government mechanic, establish the Golden Republic, and enjoy the cultural power of the Venetian Renaissance.</li>\n<li>Austria: Make critical decisions in the new “Universal Empire” Imperial incident, establish the Austro-Hungarian Empire variant nation, choose from a dozen branching missions, and use new diplomatic options.</li>\n<li>Hungary and Bohemia: Resist imperial domination through unique Hungarian Government Reforms and decisions, new Hussite-themed content for Bohemia, and the ability to form Greater Moravia nation.</li>\n<li>Timurids: Continue a lifestyle of cavalry-led conquest or consolidate power in Persia, establish new Government Reforms including Plunder Economy, new Soyurghal subject type and use Chinese Conquest casus belli.</li>\n<li>Mughals: Victories on the battlefield will help missions as you extend your power over the riches of a very diverse region. You can promote the syncretic Divine Religion to reduce intolerance while promoting monarch power, and embrace new reforms, including the Mansabdar warrior-bureaucrats.</li>\n<li>Nomadic Horde Nations: Make decisions about faith through religious branching missions as well as dozens of specialized missions depending on your Horde starting point - Mongol, Tartar or Moghul Khanate.</li>\n<li>Germany and Italy: Unite their culture groups to establish major European nations, with new government reforms and flavor content.</li>\n<li>Theodoro and Trebizond: Strengthen and revive Eastern Orthodox power in the Black Sea in a challenging environment between mighty empires with strong claims and stronger armies.</li>\n<li>Hisn Kayfa and Hormuz/Oman: Expand from the Persian Gulf through Abbuyid revival missions for Hisn Kayfa and trade-oriented content for Hormuz/Oman.</li>\n</ul>\n<br/>", "metacritic": null, "released": "2024-05-07", "tba": false, "updated": "2024-04-19T13:30:59", "background_image": "https://media.rawg.io/media/screenshots/efa/efabd1cbab1532d2a96969746746ce35.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Paradox Development Studio", "Paradox Tinto"], "genres": [], "publishers": ["Paradox Interactive"], "esrb_rating": null}