{"id": 980429, "slug": "rogue-samurai", "name": "Rogue Samurai", "name_original": "Rogue Samurai", "description": "<strong>Fight against relentless waves of incoming enemies!</strong><br/><br/><br/><strong>Use your skills!</strong><br/><h3>Main Features</h3><ul><li><strong>Rogue-Lite Action:</strong> Engage in fast-paced, rogue-lite action gameplay where you must survive relentless waves of enemies.</li><li><strong>Power-Ups:</strong> Collect various power-ups scattered throughout the game world to enhance your samurai's abilities and improve your chances of survival.</li><li><strong>Special Abilities:</strong> Unlock and utilize unique samurai abilities that add depth and strategy to your battles.</li><li><strong>Immersive Visuals:</strong> Enjoy high-quality graphics and attention to detail that bring the samurai world to life.</li></ul><br/>Rogue Samurai offers a dynamic and challenging gaming experience that combines traditional rogue-lite elements with unique samurai-themed gameplay mechanics and immersive boss battles<br/><br/>Miyamoto Musashi is struggling to survive in this dark world with the mastery of courage and the sword. Now, choose the way of the samurai and illuminate the night!<br/><br/>Rogue Samurai is an action game with a unique style. This game encourages players to learn as they play and allows them to choose their own playstyle by using different types of attacks.<br/><br/>Rogue Samurai is an action game in the roguelite genre where players find themselves constantly surrounded by attacking enemy waves and must strive to overcome these perpetual threats. This extraordinary gaming experience requires players to continually enhance their skills and strategies to survive while also allowing them to engage in epic battles with boss enemies, creating unforgettable competition. In the game, players are presented with an environment where they must continually improve themselves to survive against enemy waves by using their combat skills masterfully, encountering different challenges with each new game attempt. Rogue Samurai expertly combines the roguelite and action game genres, offering players an immersive gaming experience.<br/><br/>\"It may seem difficult at first, but everything is difficult at first.\" - Miyamoto Musashi", "metacritic": null, "released": "2024-04-17", "tba": false, "updated": "2024-04-19T11:15:01", "background_image": "https://media.rawg.io/media/screenshots/97e/97ef058af00009d37bd77b41e1d17322.jpg", "website": "https://www.cosentertainment.org/en/kipon", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 312, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CO's Entertainment"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["CO's Entertainment"], "esrb_rating": null}