{"id": 980436, "slug": "solar-kingdoms-human-survival", "name": "Solar Kingdoms: Human Survival", "name_original": "Solar Kingdoms: Human Survival", "description": "Solar Kingdoms: Human Survival is a real time strategy set in the distant future. different human factions struggle for dominance extends across vast solar systems and sectors of space. Merging classic RTS mechanics with colony simulation elements, the game aims to bring an immersive experience where players seamlessly transition between planetary warfare, colony management and space combat/exploration.<br/><br/><br/>At the heart of Solar Kingdoms lies its exceptional integration of planetary and space-based gameplay. As players embark on their journey, they start with a space station and navigate the vast expanse of the solar system. Their exploration lead to uncovering planets, asteroids, and anomalies, expanding their influence and unearthing valuable resources and artifacts along the way. This exploration not only fuels research and unit advancement but also grants strategic advantages in combat engagements.<br/><br/>Space combat serves as a cornerstone of Solar Kingdoms, offering dynamic and intense warfare scenarios. Factions clash in skirmish mode, each commanding strategically positioned space stations capable of producing various specialized units. Players engage in battles across the cosmos, confronting enemy ships, land units, and naval forces while strategically mining resources and gathering invaluable knowledge.<br/><br/>Moreover, players encounter intelligent alien life forms and diverse flora and fauna inhabiting the planets. These encounters present both challenges and opportunities, enriching the gameplay experience. Furthermore, the game aims to introduce a diplomacy system, enabling players to forge alliances, declare wars, and negotiate peace treaties, thereby adding depth and complexity to the strategic landscape.<br/><br/>Colonization emerges as a crucial aspect of expansion and resource acquisition within Solar Kingdoms. Players establish colonies on suitable planets, recruiting colonists and robotic workers to spearhead development efforts. These colonies serve as pivotal hubs for resources, military outposts, and staging grounds for further expansion, playing a vital role in securing victory.<br/><br/>Whether engaging in intense skirmish battles against up to eight players or delving into immersive campaign missions, Solar Kingdoms offers a rich and diverse gaming experience. With its blend of classic RTS mechanics, seamless integration of planetary and space combat, and extensive exploration opportunities, Solar Kingdoms: Human Survival promises players an immersive and captivating journey across the vastness of the cosmos.<br/><br/><br/><br/><br/><strong>Key Features</strong><br/><br/>Classic RTS Experience with Sim Elements: Immerse in a unique blend of classic real-time strategy gameplay with elements of colony simulation and exploration. Make strategic decisions that shape the destiny of your faction in ways rarely seen in RTS games!<br/><br/>Seamless Planetary Warfare and Space Combat: Engage in dynamic battles across a vast array of celestial bodies, including planets, asteroids, stars, and expansive stretches of space. Solar Kingdoms seamlessly integrates both planetary warfare and space combat, offering an immersive and exhilarating gaming experience.<br/><br/>Vast Exploration: Embark on expansive exploration journeys across solar systems or sectors in space. Discover other players' stations, encounter alien life forms, gather precious resources, and unearth artifacts and anomalies. Exploration fuels research, learning, and unit advancement, providing crucial strategic advantages in battles.<br/><br/>Dynamic Space Combat: Command strategically positioned space stations capable of producing various specialized units for space combat. Engage enemy ships, land units, and naval forces while strategically mining resources and gathering valuable knowledge amidst intense space warfare scenarios.<br/><br/>Strategic Colonization: Secure vital resources and expand your faction's territory through strategic colonization efforts. Establish colonies, recruit colonists, and construct robotic factories to produce specialized units for combat and planetary defense. Colonies serve as crucial resource hubs, military outposts, and staging grounds for further expansion.<br/><br/>Multiplayer Battles: Engage in epic skirmish matches against up to eight players in multiplayer mode. Employ strategic tactics and teamwork to fight for supremacy over solar systems and sectors in space, experiencing intense battles and emergent gameplay moments.<br/><br/>Strategic Maneuvering: Navigate the game's vast map strategically, utilizing colonies as bases for exploration and conquest. Expand your faction's territory, confront rival factions, and defend against alien threats, ensuring humanity's survival through strategic maneuvering and tactical brilliance.<br/><br/>Dynamic Encounter with Alien Life: Encounter intelligent alien life forms commanding large hostile spaceships and space stations. Convert these units into friendly allies to aid in battles against common enemies, while exploring lush planets teeming with both hostile and friendly flora and fauna, offering opportunities for hunting, research, and combat engagements.<br/><br/>Skirmish Mode: Dive into action-packed skirmish battles, starting with a space station and deploying units to attack enemy ships and land units. Mine resources, gather knowledge, and colonize the solar systems.<br/><br/>Exploration and Expansion: Scout and expand borders quickly to discover new planets, gas giants, asteroids, anomalies, and other objects. Colonize planets by recruiting colonists and robotic workers, strategically expanding your influence across the cosmos.<br/><br/>Combat and Conquest: Build barracks and robotic factories to train a diverse array of units, from tanks and infantry to large mechs, for planetary defense and attack. Engage rival factions in intense battles for control of space and planets, aiming to emerge as the last faction standing with a standing space station.<br/><br/>Colony Simulation: Establish colonies on planets, starting with one building and expanding to cover entire planets. Utilize resources efficiently as you progress to the next planet, strategically managing your colonies for maximum efficiency and effectiveness.<br/><br/>Unique Ship Types: Command a variety of ship types, starting each game with a space station and the ability to construct ships such as scouts, builders, and mining vessels. Progress through the game to unlock massive cruisers, carriers, destroyers, and other specialized units, offering diverse strategic options and gameplay possibilities.", "metacritic": null, "released": "2024-04-17", "tba": false, "updated": "2024-04-19T12:54:11", "background_image": "https://media.rawg.io/media/screenshots/331/3311ccd57264a72e33bc9cbb7e2e8b09.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Little Dreams Gaming"], "genres": ["Action", "Strategy", "Simulation"], "publishers": ["Little Dreams Gaming"], "esrb_rating": null}