{"id": 980454, "slug": "artificers-tower", "name": "Artificer's Tower", "name_original": "Artificer's Tower", "description": "Artificer’s Tower is a cozy colony sim resource management game that features base-building, tower defense systems, and powerful enemies to defeat. You are tasked with building and defending an out-of-this-world tower that would make even Merlin himself proud! Keep your mages happy and your tower safe by building up your tower, gathering resources and crafting everything you might need. Build your tower however you like and unleash your inner architect wizard. It's like Hogwarts, but with more explosions (and less sorting hat drama).<br/><br/><br/><br/>Are you ready to let your architectural creativity run wild? Build the wizard tower of your wildest dreams - whether that's a snowman-shaped tower, or something even more bizarre. The possibilities are endless and the only limit is your imagination (and, you know, boxy rooms). So go ahead, unleash your inner wizard-architect, and design the tower you've always wanted!<br/><br/><br/><br/><br/>Are you tired of dealing with unhappy, unproductive wizards? Keep your tower running like a well-oiled magical machine by managing your mages like the boss that you are. Pay generous wages, fulfilling their needs, or they'll be out of there faster than you can say \"abracadabra\"! Don't let a quitting workforce be the downfall of your wizarding empire!<br/><br/><br/><br/>Are you tired of dealing with unhappy, unproductive wizards? Keep your tower running like a well-oiled magical machine by managing your mages like the boss that you are, and train the next generation of powerful wizards! Pay generous wages, fulfill their needs, and teach them the ways of the wizard – watching as they grow from low-potential, bumbling novices to masterful artificers before your eyes!<br/><br/><br/><br/>What started as simple recipes will quickly become complex crafting chains as your ambitions grow and your mages advance. You'll want to invest research into administration so you can spend less time micromanaging to turn your essence into gold.<br/><br/><br/><br/>Are you tired of pesky monsters waltzing into your wizard tower uninvited? Want to keep your tower safe and secure? Fill your entrance with traps, and watch as the monsters drop like flies. Experiment with different types of traps – or even summon bosses you’ve defeated to help defend your tower – to find the perfect build for your tower's security.<h3>Features:</h3><ul><li><strong>Defend Your Base:</strong> Fill the entrance of your tower with traps and watch as the monsters trying to take down your tower drop like flies.<br/></li><li><strong>Manage Your Mages:</strong> Keep your tower running like a well-oiled magical machine by managing your mages. Pay them generous wages, fulfill their needs and keep them happy.<br/></li><li><strong>Summon Powerful Bosses:</strong> Challenge the biggest bad guys in their area and their lackeys. Show off your tower’s strength by defeating these foes and taking home all the bragging rights.<br/></li><li><strong>Train and Practice:</strong> Train your next generation of powerful wizards! Watch as they grow from low-potential, bumbling novices to full-fledged artificers. <br/></li><li><strong>Flex Your Alchemy Skills:</strong> Start with simple recipes and watch as your expertise grows and you can start making even more advanced items. Invest research into administration so you can spend less time micromanaging your mages.</li></ul>", "metacritic": null, "released": "2024-04-18", "tba": false, "updated": "2024-04-19T13:17:48", "background_image": "https://media.rawg.io/media/screenshots/02b/02ba423bdf6910829c39d97fa0086b07.jpg", "website": "https://www.rodentgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["RodentGames"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["RodentGames"], "esrb_rating": null}