{"id": 9805, "slug": "tower-unite", "name": "Tower Unite", "name_original": "Tower Unite", "description": "<p>Tower Unite is a living, evolving world, fueled by the community. Play online games with your friends or make new friends from around the world!<br />\nTower Unite is a large online multiplayer game that spans genres.<br />\nPlay minigames such as Minigolf, Ball Race, Virus, and more!<br />\nEarn items<br />\nHang with your friends in your own personalized house<br />\nConnect with others through a massive Plaza with various attractions and games<br />\nParty with friends!<br />\nWatch synchronized media such as YouTube or Soundcloud<br />\nSuggest new features - we listen!<br />\nNo microtransactions or subscription fees<br />\nTower Unite has many games to play, with more to come, such as...<br />\nSupports up to 16 players online<br />\n8 courses with 18 holes (144 holes total) and more in the works!<br />\nBased on the original 2009 minigolf hit from GMod Tower that inspired other minigolf games<br />\nUnique controls (100% skill, no timers)<br />\nHole-in-one fireworks<br />\nWear tiny hats on your golf ball<br />\nPutt in snow, gardens, mines, sky, and even in space!<br />\nSimultaneous putting (everyone putts at once!)<br />\nPlayer hosted servers<br />\nSupports up to 8 players online<br />\n4 unique levels and more in the works!<br />\nThrilling 1 vs All gameplay<br />\nPlay as the Dragon and devour the knights<br />\nTurn off the rampaging Dragon as the knights<br />\nPlayer hosted servers<br />\nSupports up to 16 players online<br />\n8 unique worlds and more in the works!<br />\nRoll around in a giant ball<br />\nSpeed past tricky obstacles<br />\nPlayer hosted servers<br />\nSupports up to 12 players online<br />\nSurvive in 5 unique levels and more in the works!<br />\nFast paced old school first person shooting action<br />\nBlast infected away with 12 sci-fi weapons<br />\nTeam tag elimination, with weapons<br />\nPlayer hosted servers<br />\nSupports up to 8 players online<br />\nBattle in teams as cat or dog in a struggle for the planet&#39;s resources<br />\nFrantic gameplay with lots of sci-fi shooting<br />\nPlayer hosted servers<br />\nOnce you&#39;ve played some of the games, head on over to your personal space...<br />\nIn Tower Unite, everyone has their own personal space, called a Condo.<br />\nPlace tons of different furniture and items<br />\nWatch synchronized media such as YouTube<br />\nPlace images from the internet directly into the game synced with online players<br />\nListen to synchronized music with Soundcloud<br />\nCustomize wallpapers, lights, and time of day<br />\nInvite friends to party, chat, voice chat, drink, and eat virtual pizza!<br />\nPlay instruments like a piano or drums<br />\nInteract with various weird and cool items<br />\nBuild unique creations<br />\nGet a pet cat or dog<br />\nCOMING SOON: Cook/craft food and new items<br />\nFrom the Condo, you can exit through your front door into a bigger online experience called the Plaza. The Plaza acts as a gathering point, like a shopping mall.<br />\nGamble at the Casino<br />\nWalk along the Boardwalk and enjoy:<br />\nLaser Tag<br />\nBowling<br />\nTrivia<br />\nTyping Derby, a keyboard racing game<br />\nFerris Wheel<br />\nMonorail<br />\nCOMING SOON: Bumper Cars<br />\nCOMING SOON: Rollercoaster<br />\nCOMING SOON: FishingWatch synchronized YouTube videos in the Theater<br />\nUnlock new items at 15 different in-game stores<br />\nConnect to the bigger Game Worlds<br />\nCOMING SOON: Explore the ocean with your friends<br />\nCOMING SOON: Play games at the Arcade<br />\nVoice chat and text chat<br />\nPlayer hosted serversDO MORE THAN OTHER VIRTUAL WORLD GAMESTower Unite isn&#39;t just a walk-around-and-chat simulator. You can run, jump, crouch, use jetpacks, get drunk, dance, sit, throw-up, lounge in pool tubes, and much much more.<br />\nPlay multiplayer games of various genres online with friends.<br />\nPlay online Minigolf with up to 16 players.<br />\nCustomize yourself with accessories.<br />\nFurnish and design the layout of your personal space (the Condo) with furniture and interactive toys.<br />\nInvite other players over to your Condo for parties and mini-games.<br />\nWatch synchronized YouTube videos in a virtual theater or your Condo.<br />\nFly around in jetpacks.<br />\nImbibe alcohol to an irresponsible extent.<br />\nJoin official servers or host your own server.<br />\nHang out with your friends or find new friends!<br />\nEnjoy free DLC, no microtransactions, and developer support.<br />\nCollect tons of unique items with Steam Inventory support.</p>", "metacritic": null, "released": "2016-04-08", "tba": false, "updated": "2023-11-19T23:41:13", "background_image": "https://media.rawg.io/media/games/f7a/f7a6e262d7ede199f8a0b68d8cc9f43e.jpg", "website": "http://www.towerunite.com", "rating": 3.63, "rating_top": 4, "added_by_status": {"yet": 64, "owned": 895, "beaten": 7, "toplay": 4, "dropped": 32, "playing": 13}, "playtime": 7, "achievements_count": 363, "ratings_count": 58, "suggestions_count": 398, "game_series_count": 0, "reviews_count": 59, "platforms": ["PC"], "developers": ["PixelTail Games"], "genres": ["Action", "Adventure", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["PixelTail Games"], "esrb_rating": null}