{"id": 980572, "slug": "mesh-replica", "name": "Mesh Replica", "name_original": "Mesh Replica", "description": "Humanity is finally expanding through the universe and ultimately leaving the Earth.<br/>Humans are packing everything to several space stations (really everything, even that small typewriter or this huge radio antenna). But an annoying alien species infiltrated the galactic convoy and wreaks havoc, causing chaos and making a mess of the carefully packed supplies. Damn Slugs!<br/><br/><br/><br/>Up to 12 players are Slugs. As a Slug, you must hide from Hunters and reach the score goal before the match is over.<br/>Up to 4 players are Hunters. As a Hunter you must kill Slugs to prevent them from reaching the score goal.<br/>The game last up to 10 minutes, depending on the number of players.<br/><br/><br/><br/><br/><br/>You get score points when you are transformed into the same object for 10 seconds. The bigger the object, the more score you get.<br/>Slugs can regroup to get a score boost.<br/>Entering freeze mode allows you to be in third person and lock your mouvements. Freeze mode can be activated mid-air.<br/>If you die, you revive after a brief period of exile. <br/>If all Slugs are dead at the same time, Hunters win the game.<br/>Slugs lose the game if they fail to reach the score goal, even with one Slug alive.<h3>Slugs Expertises</h3><br/>Slugs are on a mission to keep their expertise gauges up. Bounce, transform, and tease your way to victory in the most outrageous way! Remember, keep those gauges full, or face death.<br/><br/><ul><li> Jump - It's as easy as hopping, but watch out, it might give away your location to those pesky Hunters!<br/></li><li> Random transformation - Cross your fingers and hope the Hunters blink while you undergo a spontaneous morphing. Who knows what you'll become next!<br/></li><li> Taunt - Let out a spirited taunt to grab the Hunters' attention. Just remember, it's all part of the plan...kind of!</li></ul><h3>Slugs Special Abilities</h3><br/><ul><li> Invisibility - In the future, you don’t need a ring or a cloak to do that<br/></li><li> Leap - Instantly teleporting a short distance forward, beware of solid surface like walls<br/></li><li> Snare mine - Because sometimes, even Hunters need a little time to reflect on their life choices...while stuck in goo</li></ul><br/><br/><br/><br/><br/>You loose health if you hit anything but a Slug. <br/>Health pickup can be found on every maps.<br/>If you die, you revive after a brief period of exile. <br/>If all Hunters are dead at the same time, Slugs win the game.<h3>Hunters Special Abilities</h3><br/><ul><li> Sensor - With the Sensor ability, you're like a detective with Slugs on your radar! Tracking down those sneaky critters becomes a breeze for you.<br/></li><li> Reveal - No more guesswork! The Reveal ability unveils which objects those shape-shifting Slugs have morphed into.<br/></li><li> Blackout - Lights out, Slugs! With the Blackout ability, you plunge them into darkness, turning their sneaky maneuvers into an unfair game of cat and mouse!<br/></li><li> Security Camera - Security Camera ability gives you an exclusive peek into Slug territory. Say cheese!<br/></li><li> Grenade - Boom! Classic but effective, with the Grenade ability, you're the master of explosive surprises.</li></ul><br/><br/><br/>Expect the unexpected as objects spawn at random across the map, keeping every game fresh and full of surprises! Not only does this keep players on their toes, but it also adds a fun twist never knowing for sure if that object is a Slug or not!<br/><br/>Random events spice things up, making Slugs jump, taunt, or perform a transformation at any given moment! Get ready for a wild ride of unpredictability and laughter!<br/><br/><br/><br/>As a solo indie developer with over a decade of software engineering experience, making Mesh Replica was an exiting journey. After years of dedication, learning Unreal Engine as a hobby since university, doing several clunky projects from my student room, I wanted to create a game that could be played during LAN parties with my folks. Mesh Replica has emerged as a testament to my unwavering love for playing and having fun with other people.", "metacritic": null, "released": "2024-04-19", "tba": false, "updated": "2024-04-22T07:09:23", "background_image": "https://media.rawg.io/media/screenshots/9a0/9a0db4a2b8425383c14270988f55a37f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["nexyvoid"], "genres": ["Action", "Indie"], "publishers": ["nexyvoid"], "esrb_rating": null}