{"id": 980514, "slug": "wash-sim", "name": "Wash Sim", "name_original": "Wash Sim", "description": "Welcome to Wash Me, where every car enthusiast's dream of owning a pristine garage of meticulously maintained vehicles comes to life! Experience the exhilaration of reviving your cars to their peak performance with our tuning service that goes beyond just a simple wash.<br/>\n<br/>\r\nIn this immersive game, you take on the role of a dedicated garage owner in a town where the roads leave much to be desired. Your collection of four unique cars awaits your expert care, needing regular maintenance to stay in top-notch condition. But beware, as the challenging terrain often leaves your vehicles caked in mud, dampening the thrill of ownership.<br/>\n<br/>\r\nWith multiple levels of increasing difficulty, you'll embark on a journey to uphold your reputation as the ultimate car enthusiast. From sedans to sports cars, each vehicle in your garage requires meticulous attention, from filling up their tanks with fuel to giving them a thorough wash to rid them of dirt and grime.<br/>\n<br/>\r\nNavigate through the twists and turns of your town's roads, tackling mud and debris to ensure your cars remain immaculate. As you progress, unlock new challenges and rewards, showcasing your prowess as a true connoisseur of automotive care.<br/>\n<br/>\r\nGet ready to immerse yourself in the addictive world of Wash Me Please, where every wash brings your cars one step closer to perfection. Show the world that you're not just a driver – you're a proud householder committed to keeping your fleet in pristine condition.", "metacritic": null, "released": "2024-04-19", "tba": false, "updated": "2024-04-22T05:51:51", "background_image": "https://media.rawg.io/media/screenshots/498/49892ac5961be512a74147abaaedeb5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vipek Kuwalowskii"], "genres": ["Action", "Adventure", "Simulation", "Sports", "Casual", "Indie"], "publishers": ["Vipek Kuwalowskii"], "esrb_rating": null}