{"id": 980507, "slug": "hotel-perkkow-and-the-two-vegetarian-werewolves", "name": "Hotel Perkkow and the Two Vegetarian Werewolves", "name_original": "Hotel Perkkow and the Two Vegetarian Werewolves", "description": "<h3>Genre:</h3>Visual Novel / Interactive story<h3>Setting:</h3>Welcome to Hotel Perkkow, a mysterious enclave situated in the heart of Romania, just a whisper away from the legendary Dracula's castle. In the present day, this establishment stands as a testament to a world where mythical creatures coexist harmoniously with humans, blending medieval and gothic atmosphere with elements of the fantastic and the modern.<h3>Overview:</h3>Assume the mantle of a seasoned detective who finds themselves embroiled in a web of mystery upon their arrival in Romania. Initially seeking respite in the tranquil halls of Hotel Perkkow, your plans take an unexpected turn when Count Grozdan, the owner, summons you with troubling news. Recent weeks have seen a series of unexplained disappearances among the guests, leaving no trace behind. As the only one capable of untangling this enigma, you must navigate a labyrinth of secrets within the hotel's walls. Uncover the truth behind the vanished guests and confront the malevolent forces threatening the hotel's peace.<h3>Key Features:</h3><br/><ul><li>Engaging Storyline: Immerse yourself in a captivating narrative filled with intrigue, suspense, and unexpected twists. Your choices and decisions will shape the outcome of the investigation.<br/></li><li>Dynamic Dialogue: Engage in meaningful conversations and make crucial decisions that impact the course of the story. Some choices are limited, adding depth to the investigation.<br/></li><li>Artistic Fusion: Experience a unique blend of digital artistry for backgrounds and anime-style character designs, seamlessly transitioning between comedic and mysterious atmospheres.<br/></li><li>Multiple Endings: Whilst the game concludes with the same ending, your choices throughout the investigation will influence the outcome, offering a personalized experience for each player.<br/></li><li>Ambient Soundtrack: Immerse yourself in the haunting ambiance of Hotel Perkkow with a subtle yet evocative soundtrack that sets the tone for your investigation.<br/></li><li>Unique Characters: Interact with a diverse cast of characters, including Count Grozdan, the charming vampire proprietor; Ivanka, the ghost maid; and Jack, the werewolf receptionist.<br/></li><li>Steam Achievements: Test your detective skills and unlock a variety of in-game and meta achievements as you progress through the story and beyond.<br/></li><li>Short Playtime, Deep Story: Experience a rich and complex storyline designed to be completed in just 30 minutes, perfect for a satisfying gaming session.</li></ul><br/>Embark on a thrilling journey into the heart of Hotel Perkkow, where secrets abound and every choice matters. Can you solve the mystery before it's too late?", "metacritic": null, "released": "2024-04-21", "tba": false, "updated": "2024-04-22T05:44:05", "background_image": "https://media.rawg.io/media/screenshots/ce8/ce8602fe57dc350c6c3b1f098d6bb66b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["John Flex"], "genres": ["RPG", "Casual", "Indie"], "publishers": ["John Flex"], "esrb_rating": null}