{"id": 980551, "slug": "hexplanx", "name": "Hex.Plan.X", "name_original": "Hex.Plan.X", "description": "<strong>The Hex Planet Experiment </strong>: A research outpost has been experimenting with automation but something went wrong. Now machines and organic material are corrupted. Most inhabitants cower in underground shelters and need urgent medical attention. Some have vehicles and try to help, go about their normal business, or take advantage of the situation for their own benefit. Military and emergency vehicles do their best to regain control but are outnumbered. You are sent to tip the balance, restore order and rescue the injured.<br/><br/>The research facility has six main areas joined by pathways with service areas where you can recharge, deposit goods and get medical help for humans. You can only move between way-points so choose your route with care and manage your energy use.<br/><br/>The object is to destroy all the mechanical ants that have taken over the facility. You are also tasked with rescuing as many humans as possible - they will follow you if they see you or if you call them. There are goods and tokens that can be picked up if they are within range. Some goods can be sold at deposit points and if you sell enough you might get an upgrade! Other goods are contraband – they are valuable, but can only be deposited in criminal controlled areas and holding them is illegal.<br/><br/>Other vehicles are present in the facility. Ambulances may pick up humans. Police patrol some areas and will become aggressive if provoked or if you choose to carry contraband goods. Military vehicles help to attack enemy creatures but don’t pick a fight with them unless you want trouble. Some civilian vehicles are active and may also attract human followers or pick up goods - some may be aggressive and greedy.<br/><br/>A top-down, retro-style, sci-fi shooter and strategy game that's unashamedly full of old-school gaming cliches. Best played with a twin stick controller but can also be played as point-and-click with a mouse. Enjoy!", "metacritic": null, "released": "2024-04-19", "tba": false, "updated": "2024-04-22T06:39:08", "background_image": "https://media.rawg.io/media/screenshots/96f/96fbf2373561c64cab9700d4e82027df.jpg", "website": "https://pixelfandango.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pixel Fandango"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Pixel Fandango"], "esrb_rating": null}