{"id": 98057, "slug": "historia-battles-rome", "name": "Historia Battles Rome", "name_original": "Historia Battles Rome", "description": "<p>Historia Battles Rome is a 2D multiplatform turn-based strategy game reproducing real historical battles. Inspired by classic chess game and traditional war board game, the main game design philosophy is player involvement in real historical context, fun and challenge, keeping low game complexity and time to learn. <br/></p>\n<p>The reproduced battles are:<br/></p>\n<p>- 508 B.C. Porsenna siege of Rome (Romans VS Etruscans)<br/>- 390 B.C. Allia Battle (Romans VS Celtics)<br/>- 280 B.C. Pyrrhus Heraclea Battle (Romans VS Greeks)<br/>- 275 B.C. Pyrrhus Beneventum Battle (Romans VS Greeks)<br/>- 218 B.C. Hannibal Ticinus Battle - (Romans VS Carthaginians)<br/>- 218 B.C. Hannibal Trebia Battle - (Romans VS Carthaginians)<br/>- 217 B.C. Hannibal Trasimene Battle - (Romans VS Carthaginians)<br/>- 216 B.C. Hannibal Cannae Battle - (Romans VS Carthaginians)<br/>- 202 B.C. Hannibal Zama Battle - (Romans VS Carthaginians)<br/>- 58 B.C. Caesar Bibracte Battle (Romans VS Celtics)<br/>- 58 B.C. Caesar Ariovisto Mulhouse Battle (Romans VS Celtics)<br/>- 57 B.C. Caesar Sabis Battle (Romans VS Celtics)<br/>- 52 B.C. Caesar Gergovia Battle (Romans VS Celtics)<br/>- 52 B.C. Caesar Alesia Battle (Romans VS Celtics)<br/>- 48 B.C. Caesar Pharsalus Battle (Romans VS Romans)<br/>- 9 A.D. Teutoburg forest Battle (Romans VS Germans)</p>\n<p>The deluxe version of the game has more available battles and will be updated adding new scenarios. It has artistic historical 32 bit colour depth maps, general picture bookmarks on units and Military Strategy View based on APP-6A standard. if the game is of your interest consider to support the developer downloading the complete chapter. <br/></p>\n<p>Rules of the game:<br/>If all units are killed or home location conquered the player loses the game.<br/>The unit attacked from side or back is damaged considering zero defend points.<br/>The unit attacked can not move (it has no move points).<br/>Unit severely wounded causes panic damage to near ones.<br/>Unit located near home location gets +1 healing point for each turn.<br/>Unit that kill other unit increases experience,attack and defend points, all life points are recovered.</p>", "metacritic": null, "released": "2018-01-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a1c/a1ce1a56e78539f7b60ee41eada3c533.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "PC", "macOS", "Linux"], "developers": ["vpiro"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}