{"id": 980545, "slug": "cargo-master-transporter", "name": "Cargo Master Transporter", "name_original": "Cargo Master Transporter", "description": "Embark on an adrenaline-fueled journey as you assume the role of a seasoned Cargo Master Transporter in this pulse-pounding gaming adventure. As the captain of a specialized car transporter, your mission is to meticulously ferry valuable cargo and vehicles across perilous terrain, from origin to destination. Every second counts as you confront the relentless ticking clock, showcasing your mastery in logistics and razor-sharp driving skills to conquer intricate routes and deliver your payload within unforgiving time limits. Prepare for an immersive experience where precision driving meets strategic cargo management, offering a thrilling blend of challenge and excitement at every turn.<br/>\n<br/>\r\nKey Features:<br/>\r\n- Immerse yourself in the art of Precision Driving and meticulous Cargo Management.<br/>\r\n- Choose from a selection of 3 distinct trucks, each with its own strengths and capabilities.<br/>\r\n- Conquer 10 adrenaline-pumping levels, each presenting unique challenges and obstacles to overcome.<br/>\r\n- Navigate treacherous terrains and unforgiving environments with finesse and skill, pushing the limits of your driving prowess.<br/>\r\n- Experience the rush of high-pressure transport missions, where every decision can mean the difference between success and failure.<br/>\n<br/>\r\nPrepare to test your mettle as you embark on a high-stakes journey filled with danger, excitement, and the promise of lucrative rewards. Are you ready to become the ultimate Cargo Master Transporter?", "metacritic": null, "released": "2024-04-19", "tba": false, "updated": "2024-04-22T06:30:52", "background_image": "https://media.rawg.io/media/screenshots/b20/b2072f820283da94305190372ed17f4f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Crazy DEVs"], "genres": ["Adventure", "Simulation", "Sports", "Casual", "Indie"], "publishers": ["Crazy DEVs"], "esrb_rating": null}