{"id": 9806, "slug": "heartomics-lost-count", "name": "Heartomics: Lost Count", "name_original": "Heartomics: Lost Count", "description": "Heartomics: Lost Count is a vertical shooting game that uses fan service to entice <br/>players that were too timid to try the genre. Humanoid monsters called \"Heartomics\" <br/>are summoned wrecking havoc outside the town of Tori. Hero has long been <br/>missing and was recently recovered with the help of three beautiful girls \"Euphony\", <br/>\"Lyra\", and \"Melody\". With their powers combined with technological advancements,<br/>Hero must brave the hostile lands to find the cause of these summonings and put an<br/>end to their destruction.<br/><br/><strong>Main Features:</strong><br/><ul><li>Explore a stunning fantasy world across 11 stages, including forests, mountains,<br/>oceans, and the stars. Play through mesmerizing patterns as every boss encounter<br/>reveals an iconic pattern in an attempt to destroy you.<br/><br/></li><li>A smaller hitbox than the character's sprite is revealed when you use the <br/>appropriate commands. Thanks to this Heartomics: Lost Count can challenge the<br/>players with some of the most unique and innovative shot patterns in the bullet hell <br/>genre. Conquer and boast about your success on dodging thousands of bullets at the <br/>same time.<br/><br/></li><li>Steam Leaderboards and Achievements help you in your quest to boast to friends<br/>that you are indeed the champion of all bullet hell games including <br/>Heartomics: Lost Count. Challenge yourself on making it to the top of the <br/>leaderboards for both score and time.<br/><br/></li><li>Enjoy beautiful scenes of our lovely ladies in their most precious poses. Each stage<br/>cleared rewards you with an unforgettable view (sometimes a few).<br/><br/></li><li>Earn Steam Trading Cards and craft your way into an epic set of collection.</li></ul>", "metacritic": null, "released": "2016-11-26", "tba": false, "updated": "2019-08-28T22:14:46", "background_image": "https://media.rawg.io/media/screenshots/929/9297375f3e8f203b3ec452e4096f3295.jpg", "website": "http://www.heartomics.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 29}, "playtime": 7, "achievements_count": 22, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Heartomics"], "genres": ["Action", "Indie"], "publishers": ["Heartomics"], "esrb_rating": null}