{"id": 980626, "slug": "room-817-directors-cut", "name": "Room 817: Director's Cut", "name_original": "Room 817: Director's Cut", "description": "Welcome to the Room 817 at 6 Lane Street, the scariest place in the United States. Rumors say that Evil himself resides there. Residents throughout the neighborhood consider this creepy apartment to be cursed, but fear always attracts adventurers, and secrets are only revealed to the brave. In August 1997, two police officers disappeared in this place and their bodies were never found.<br/><br/><br/><br/>Almost a year after those terrified events, journalist Alan Parker decides to conduct his own investigation and find out what happened to the missing police officers. On his behalf, you will have to solve interesting puzzles, avoid traps, and come face to face with the terrible monsters that inhabit the place.<br/><br/><br/><br/>Will you have the courage to find out the scariest secrets of The Room 817 and survive?<h3>GAME FEATURES</h3><br/><strong>A true old-school horror experience.</strong> There are no maps, hints, or tutorials here. No one will hold your hand and tell you how to breathe. Remember what <br/>  it means to survive.<br/><br/><strong>Gameplay that doesn't forgive mistakes.</strong> Death is awaiting around every corner. Watch where you step! Traps and bottomless pits abound!<br/><br/><strong>One life, one try. </strong>This game isn't for those who like to save their progress every 10 seconds. There are no checkpoints or save points here. Either you survive or you die.<br/><br/><strong>Run or hide. </strong>You're not the predator, you're the prey. The Ancient Evil lurking here awaits its encounter with you.<br/><br/><strong>Listen to what's happening around you. </strong>The faint creak of the floorboards or the heavy tread of the monster can help you understand where not to go.<br/><br/><strong>Look around and remember. </strong>There's no logic in this place, only your memory and attention to detail will help you solve all the puzzles and find a way out.<br/><br/><strong>An atmosphere of primal terror. </strong>Explore the cursed apartment with your camera and flashlight. Uncover all the secrets of this place and find out what happened here.<br/><br/><br/>", "metacritic": null, "released": "2024-04-21", "tba": false, "updated": "2024-04-22T09:17:22", "background_image": "https://media.rawg.io/media/screenshots/288/28815560a1e07b76a30a2afb6f9015a7.jpg", "website": "https://bormakstudio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bormak Studio"], "genres": ["Action", "Indie"], "publishers": ["Bormak Studio"], "esrb_rating": null}