{"id": 98077, "slug": "13-minutes-of-light", "name": "13 minutes of light", "name_original": "13 minutes of light", "description": "<p>When your girlfriend gets on the Virgin Commercial spaceflight to start her career as a teacher at Mars University, you realise the relationship has... a bit of a challenge. Will your penmanship be enough to keep the relationship warm?</p><p>13 minutes of light is a short story about a long distance relationship between two young lovers set in the near future where Mars has been colonised.</p><p>The following concepts are featured in this Visual Novel:</p><ul><li>Writing letters to your beloved</li><li>Jealousy</li><li>/r/mars </li><li>War </li><li>Peace </li><li>Five different endings</li><li>Cheeky girlfriend(s) </li><li>Viserys (the cat, not the dragon) </li><li>Ron </li></ul><p>This Visual Novel was originally created fin 48 hours in 2015 for Ludum Dare number 30, which had a 'Connected Worlds' theme. It has been slightly polished for its post Ludum Dare release. The original plan was to have much more letters and to involve the conflict between Mars  and Earth more. As it is now, the game shows a pretty good idea of what it <em>could</em> do. Maybe if there's enough interest I could put more time in more elaborate letters and different story paths.</p><p>The tracks 'Acoustic Breeze', 'Tomorrow', 'Ukulele', 'Actionable' and 'Love' are made by Bensound and are generously made available under CC-attribution.<br/></p><p>All feedback is welcomed with open arms!</p>", "metacritic": null, "released": "2016-03-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e2e/e2e237425796d3a3f052a50d21be39c9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Jod"], "genres": [], "publishers": [], "esrb_rating": null}