{"id": 98081, "slug": "3souls-parallel-edition", "name": "3Souls Parallel Edition (itch)", "name_original": "3Souls Parallel Edition (itch)", "description": "<p>With 3Souls Parallel Edition, you will discover the<strong> world of Mustland,</strong> a place full of rules and secrets... and its own people, the Ánimas, who are mysterious characters wearing a mask with them own soul floating around them. </p>\n<p>This adventure is not really about you. It is more about them! So perhaps <strong>you could offer them some assistance from your world</strong>. </p>\n\n<br/>\n\n<p>In this world <strong>you will be able to play as Nelesa, Nophes and Nidemon </strong>in a story of 3 chapters. Each Ánima is different and all of them have a them soul floating around them and <strong>chaging the colour depending of them feelings: sadness, fear, hapyness</strong>... But now you will be able to connet to them world and help them in them adventure thanks to your keyboard or gamepad!<br/></p>\n<p><strong>3Souls Parallel Edition is a version created for PC from the Wii U™ game 3Souls</strong>, which changes on the gameplay to adapt the use of the GamePad into the PC controllers and keyboard but sharing the same story, graphics and music from the world of the Ánimas! </p>\n<p><strong>UPDATE!!!</strong></p>\n<p>We want to make sure that everyone interested have the chance to try and play <strong>3Souls Parallel Edition</strong> for PC, so we update the price as <strong>FREE</strong> but the we accept your support by letting you pay what you think is fair for the game!<br/></p>\n<p>If you are still not conviced, we prepared a online <strong>DEMO</strong> for you to play the game via browser (we recommend to use google chrome). The demo contain the first two stages of Nelesa, the first character of the game. Here is the direct link:</p>\n<p>http://3souls.redcolumn.com/demo</p>\n<p>Do you like the <strong>OST</strong> of the game as well? You can get it as well for free in Bandcamp:</p>\n<p>https://redcolumn.bandcamp.com/album/3souls</p>\n<p>Enjoy!!!!<br/></p>", "metacritic": null, "released": "2018-03-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a5f/a5fad6bc93166db0a97e59e5c0285bf7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Red Column"], "genres": ["Adventure", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}