{"id": 98115, "slug": "acidsouldemo", "name": "AcidSoulDemo", "name_original": "AcidSoulDemo", "description": "<p><strong>Hi guys. Check it out, AcidSoul kicksartet campaign is live.</strong></p>\n<p>https://www.kickstarter.com/projects/1846712900/acidsoul</p><p><strong>ACIDSOUL - An ultra dynamic air hockey game with splitscreen or online multiplayer and RPG style storytelling ! </strong><br/></p>\n<p>A rapid-fire game with a unique Japanese manga inspired art style. Full campaign mode, thrilling story and intense play mechanics!  </p>\n\n<p><strong>What is AcidSoul?</strong>  </p>\n<p>AcidSoul is a fast-paced air hockey game with an adventure filled story, solo and multiplayer modes, and intense hard to master gameplay. We imagine it as the spiritual successor to Shufflepuck Café with a dark side. The goal is simple, score more points than your opponent. You can unlock powers and collect them, you can play alone (against the A.I. in the story mode, or match by match in Arcade), online (against other players from around the world), or as several players on the same screen (at home or at a friend’s home).</p>\n<p><strong>•\tUNIQUE ARTSTYLE</strong> – Inspired by popular 80s and 90s media, AcidSoul brings air hockey back to the gaming world. Fall into the world of AcidSoul and save the world, one puck at a time.</p>\n<p><strong>•\t17+ LEVEL (so far)</strong> – Every level is its own universe. Every playable level has its own story and unique characteristics that affect the gameplay. If we meet our stretch goal we hope to double the number of playable levels.</p>\n<p><strong>•\tHAND-DESIGN LEVELS</strong> – Nearly everything is hand-drawn, from the characters to animations, the sets and even the underpants on the clothesline that swing in the wind.</p>\n<p><strong>•\tHYPER DYNAMIC GAMEPLAY</strong> – The gameplay is very fast paced. Add in powers and unique environmental elements and the game becomes even faster. Easy to learn, hard to master!</p>\n<p><strong>•\tSPLITSCREEN AND ONLINE MULTIPLAYER </strong>– Yes you read right, Splitscreen is back! Sit comfortably on a sofa with friends, share the controllers and fight! Or sit on a desk chair, grab your mouse and face players online!</p>\n<p><strong>•\tCONTROLLERS</strong> - Mouse, game controllers, or touchpad. Choose your weapon!</p>\n<p><strong>•\tCHOOSE YOUR STYLE</strong> - Equip your character with the powers of your defeated enemies! More than 30 different powers to unlock (so far). Choose well because the fate of humanity is at stake.</p>\n<p><strong>•\tDEATH STRIKE</strong> - End your enemies with a special end shot FATALITY. Explode your enemies, in every sense of the word. </p>\n<p><strong>•\tCHALLENGING ENEMIES AND BOSSES</strong> - 17 different and exciting enemies, with their own personalities, and their unique way of playing (…so far. We want to add way more opponents in the game with the stretch goals). The enemy attacks your world, you should defend them, or attack before they are at the doors of our universe. Take on leaders with immeasurable powers and save lives. Or destroy them all.</p>\n<p><strong>•\tCALM BEFORE STORM</strong> - Enjoyable cast of characters to meet and fight throughout the adventure. Discover unique persona with unforgettable characters and discover their personalities before confronting them and roasting them! Or make friends in a happy enjoyable and colorful rainbow feeling of happiness, you never know.</p>\n<p><strong>•\tFULL CAMPAIGN</strong> – Take advantage of an off the wall story of an anti-hero who does not want to die now, especially not now! And discover why the fate of humanity is not that important for him. The strange entity that chose him to save his home planet seems to have another plan in mind too, what is it really? Why did he choose him? Where is the real chosen one, the real hero?</p>\n<p><strong>•\tSTORY MODE OF CHARACTERS</strong> - A unique story drawn by hand for each character. Defeat your enemies and win the chance to play them. Discover their stories by playing them in the Story mode and enjoy more storytelling. </p>\n<p>www.destroycommand.com</p>", "metacritic": null, "released": "2017-11-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/75e/75eefe85c2ad8a4585d18f30efcb42f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 243, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["acidsoul"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}