{"id": 98161, "slug": "kulten", "name": "Kulten", "name_original": "Kulten", "description": "<p><strong>Note:</strong><br/></p><p><em>I </em><em>am currently in the process of adding sound to the project and rounding a few edges. I have disabled downloads temporarily until after the end of lowrezjam 2016's rating period. I'll upload updated files with sound afterwards. Thanks you for you patience ;D</em></p><p>This game is a submission for the 64x64px  #lowrezjam 2016. It's a micro Cthulhu Mythos adventure game based loosely on the stories of H.P.Lovecraft. Solve the mystery of a murder and prevent the summoning of an elder god.<br/></p><p>Scour dusted volumes of occult books to find hints on which aspect will arrive that night and how to banish it back to where it came from. All hints are in the books. But did you find all books? Do you have time to find every hint? Maybe there is another way out.</p><p><strong><strong>Version 0.8.3</strong><br/></strong></p><p>Additions:</p><ul><li>Added preliminary touch support</li></ul><p>Fixes:</p><ul><li>Fixed Bug where the Hidden Library was available although it was locked</li><li>Fixed Bug where a clock button could be pressed more than once and still count for the clock puzzle</li></ul><p><strong>Version 0.8.1</strong><br/></p><p><strong>Fixes:</strong></p><ul><li>Fixed game breaking bug where the names of the outer gods could not be read</li><li>Fixed bug where the clock would not reset after reading a new book</li></ul><p><strong>Version 0.8.1</strong><br/></p><p><strong>Fixes:</strong></p><ul><li>Fixed typo that prevented the clock puzzle being solved accoring to the hints in the books</li><li>Fixed a typos in books</li><li>Fixed issue with one book being displaced after being read</li><li>Fixed small graphical glitch on the clock</li></ul><p><strong>Additions and Improvements:</strong></p><ul><li>Changed the \"D\" character in the font to be more distinguishable from the \"O\"</li><li>Undiscovered Entries in the \"Final Encounter\" will now be invalid and marked as \"???\"</li><li>Added naviagation arrows to books to make multi page navigation more clear</li></ul><p><strong>Version 0.8</strong></p><ul><li>Fixed missing labels in \"Final Encounter\" after dying once</li><li>Fixed randomization during \"Final Encounter\"</li></ul><p><strong>Missing things</strong></p><ul><li>Sound. At the moment there is no audio in game. But there will be.</li><li>Menu needs to be cleaned up.</li></ul>", "metacritic": null, "released": "2016-04-18", "tba": false, "updated": "2019-08-28T23:25:23", "background_image": "https://media.rawg.io/media/screenshots/f06/f0660f13872e588baaa404b760db1c6a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Visionvortex"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}