{"id": 9816, "slug": "gladius", "name": "Gladius", "name_original": "Gladius", "description": "Gladius is an immersive VR sword fighting game set in the ancient Rome. As a gladiator, you will choose your weapons, train against different enemies, and finally fight for your freedom in an epic battle against the mightiest warriors and creatures of the ancient world.KEY FEATURES AT EARLY ACCESS LAUNCH:<ul><li>Sword fighting: Hold weapons directly in your hands, block enemy strikes with your shield or sword, throw your sword at the enemy, and cut their limbs and heads! The longer you play Gladius, the more you'll hone your skills. <br/><br/><strong>DISCLAIMER</strong>: This is an area of very active development right now, so there are some features that still are NOT developed yet: <br/><ul class=\"bb_ul\"><li>Collisions are not 100% accurate (e.g. from time to time you might get hit even if the a sword is blocked by a shield)<br/></li><li>Weapons physics are still not fully implemented</li></ul>These features are going to be included in the coming weeks but are not included right now.<br/><br/></li><li>Bow and arrow: If swords are not your thing, you can still open your way in the arena with a bow. Use your arrows wisely as you have a limited number of them!<br/></li><li>Three Game Modes: engage in casual training in the small arena, survive in the blood arena, or fight in campaign mode in the glorious Colosseum.<br/></li><li>Ten different enemies: Gladiators, Legionaries, Praetorians, Barbarians, Archers, Tigers, Lions, Skeletons, Mummies and Minotaurs.<br/></li><li>Three locomotion options: You can either teleport, sprint or use the trackpad movement. <br/></li><li>Energy system: allows you to teleport and to slow time for spectacular moves that will wow the crowd.  <br/></li><li>Armory: Unlock new weapons, shields and helmets in the armory as you progress through the levels. <br/></li><li>Market: Buy new equipment with your hard earned cash in the arena. You can buy more weapons, shields, helmets and food! <br/></li><li>Three grip modes: You have different options to hold your weapons: \"hold\" maintain trigger pressed to hold the weapon, \"sticky\" use grip buttons to toggle the attachment, \"lock\" use the combination of grip+trigger to unlock your weapon and pick another one. <br/></li><li>Dynamic crowd: People in the stadium react to your actions, they root for you if you do spectacular moves, they get bored, and throw you food if you deserve it. Win the crowd, and you will win your freedom!</li></ul>", "metacritic": null, "released": "2016-12-21", "tba": false, "updated": "2019-08-28T22:14:46", "background_image": "https://media.rawg.io/media/screenshots/225/2255613e945ba9b043b84a61f48ba33c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 11}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Multiverse"], "genres": ["Action", "Indie"], "publishers": ["Multiverse"], "esrb_rating": null}