{"id": 98203, "slug": "iterazer-vr", "name": "Iterazer VR", "name_original": "Iterazer VR", "description": "<p><strong>Iterazer </strong>is a tool to play with complexity and create intricate sculptures in space with very intuitive and simple controls.</p><p>This version works on Windows with Oculus Rift runtime 0.7 and Leap Motion.</p><strong>Instructions:</strong><ul><li>there is a tutorial - if it isn't shown, please press \"T\".</li><li>with one hand, you can grab and move around the Transform Spheres to change the structure.</li><li>with both hands, you can grab and navigate through space in all directions.</li><li>making a Thumbs Up! gesture saves the current image - both as screenshot as well as 360 panoramic left/right eye images.</li><li>making a Thumbs Down! gesture creates a new random structure.</li></ul><p><strong>Pro Tip:</strong> You can export hi-res 360° panoramic images directly from the app, both for the left and right eye (thumbs up gesture). They get saved to \"Users/<name>/Pictures/Iterazer VR\". See the gif on the picture gallery.</name></p><p><strong>Technical details</strong></p><p>The fractal is created using DX11 compute shaders and instanced drawing, to allow for the massive amount of meshes on the screen.</p><p><strong>Thoughts on the interaction model</strong></p><p>I deliberately didn't use Image Hands, because I think that in abstract worlds an abstract metaphor for hands and interaction makes much more sense, and also doesn't hide so much screen space (it's for the art!).</p><p>Opposite to many demos that require \"touching\" of objects to manipulate them, Iterazer uses something that is more similar to telekinesis - allowing to manipulate objects regardless of their size or distance.</p><p>The moment the hand grabs an object, it moves from its original place depending on hand movement - allowing for very fine motion controls, as that hand-object mapping does not need to be one-to-one. Also, the user immediately sees what he is controlling and how, as the \"hand circle\" moves to the target object for the duration of interaction.<br/></p><p><strong>Future development</strong></p><ul><li>improve gesture detection (takes a bit of trial and error right now)</li><li>make transform helpers more visible</li><li>make panorama upload for easy distribution and viewing.</li></ul>", "metacritic": null, "released": "2015-10-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bd8/bd8a66bb1a5c878ce7d11e345143dfca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 260, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["herbst"], "genres": [], "publishers": [], "esrb_rating": null}