{"id": 98202, "slug": "survivor-gentechs-revolution", "name": "Survivor: GenTech's Revolution", "name_original": "Survivor: GenTech's Revolution", "description": "<p>Survivor: GenTech's revolution is a 2.5D Sci Fi Adventure game that will take a heavy emphasis on storytelling and allowing the player to make game changing decisions. You will either bring people closer or push them away in your attempt at making it through till the end. Make too many enemies and things may just turn upside down while if you stay on the good side of others you may find people will go out of their way to protect you. How will all of this work? How do you know that I can do this? Well to put it simple: most choices will effect your relationship, this won't be noticable visually as in you can't see what your score is but if you talk to people generally you will notice in what they say if they appreciate you or not. Or it will be very obvious. Someone may have a gun at your head and they have a clean shot they will decide whether to shoot you based on whether they despise you or not, of course depending on the severity of the situation will decide how they react so in that situation it will be only if they hate your guts, no one is going to let you die for stealing a chocolate bar though only if that's the only thing you should be guilty for. Essentially It will be your decision to decide how people percieve you and how they act.</p><p>Currently the game is in an early beta demo stage, we are currently focusing on our main project New Outbreak so we've put this game on hold until that is done, we are planning on continuing this in the future since we have a tonne ideas for it!</p><p>If you want to help us at the moment and help give us a better understanding of if this game is a good idea and if you like it feel free to pay a small amount for this game as it will help us out a lot or give a comment down below!</p>", "metacritic": null, "released": "2016-05-16", "tba": false, "updated": "2019-08-28T23:25:23", "background_image": "https://media.rawg.io/media/screenshots/077/077010f767b07f9bae1d2505a4be49e0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["0Bennyman"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}