{"id": 98259, "slug": "break-it-dojo", "name": "Break it! Dojo", "name_original": "Break it! Dojo", "description": "<p><em>Helllooooooooooo!!</em></p><p>My name is Abe Arata and today I will show you the best game show in the world.</p><p>With you, BREAK-IT! DOJOOOOO!</p><p>In this awesome game, you'll will burn yourself and your friends in laser! While this doesn't happen, let me teach you how this game works:  </p><p>Destroy the blocks in the enemy's arena to knock him on the laser! Defeat will come quick, so don't forget to Build blocks in your arena to defend against the enemy! You need to change between the builder and the destroyer characters at the right moments to win this game! During the match, you can win Power-Ups - they can be the difference in a stressful match! It may seem complicated, but stay calm, there will be a video explaining everything before the game starts. You can also check the controls below.</p><p>Only a few warnings: this games is for 2 players only, so don't try to play it alone. As I like to describe it, Break-it! Dojo is a Multiplayer Arcade Party Game of Indirect Combat. You can play with Xbox Controllers, USB Dancepads and, if you're a little low on $$, even with the keyboard.</p><p>Xbox Controller</p><p>Left and Right on the Analog Stick - Move between columns<br/>Y - Change between Build and Destroy modes<br/>LT and RT alternately - Build or Destroy blocks, depending on the currently active mode<br/>A and X simultaneously - Use Power-Up</p><p>Dancepad</p><p>Left and Right Arrows - Move between columns<br/>Up Arrow - Change between Build and Destroy modes<br/>Down-Left and Down-Right Arrows alternately - Build or Destroy blocks, depending on the currently active mode<br/>Up-Left and Up-Right Arrows simultaneously - Use Power-Up</p><p>Break-it! Dojo was developed by GetCompt. GetCompt is:</p><p>Emerson Fonseca<br/>Felipe Nanni<br/>Jonnathan Cazarotto<br/>Thiago Kozusko</p><p>The game uses the music \"Fun and Games\", made and distributed with Royalty and Copyright Free by Klubz Productions on Youtube.<br/></p>", "metacritic": null, "released": "2016-12-16", "tba": false, "updated": "2019-08-28T23:25:22", "background_image": "https://media.rawg.io/media/screenshots/eb8/eb8e8d15145ad95eae951fdaf2ccd7e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kozuskoo", "GetCompt", "Felipe Nanni", "Emerson Fonseca"], "genres": ["Action"], "publishers": [], "esrb_rating": null}