{"id": 98273, "slug": "doodle-defense-itch", "name": "Doodle Defense (itch)", "name_original": "Doodle Defense (itch)", "description": "<p>Doodle Defense is a tower defense game that turns your drawings into weapons.</p><p>There are two versions currently available for download. The Mac-only installation version of Doodle Defense lets players draw their mazes and towers on a whiteboard, with everyday dry-erase markers, to stop projected foes from reaching the other side. Colored circles are transformed into towers that attack the foes in several unique ways, and black lines turn into walls that can redirect foes. The experience is enhanced by the magical feeling of seeing projected game elements interacting with real word drawings.</p><p>In the iPad version, the whiteboard is replaced with the touchscreen, and players use their fingers to draw their battlefield.</p><p>Doodle Defense was created during my MFA thesis year at Parsons, the New School For Design, for a class taught by Zach Lieberman. After the class ended, I put the game up on Kickstarter, and was delighted to see an outpouring of support, reaching 150% of my goal. After finishing the whiteboard version, I ported the game to the iPad. The project was developed in openFrameworks, and is open-source: the code is freely available on Git Hub.</p><p><strong>SETUP NOTE</strong><br/></p><p>The whiteboard thing is not a metaphor. You will need a Mac, a projector, an HD webcam, a whiteboard and some dry erase markers to play. A dark room and a tripod for the camera highly recommended. The game will walk you though the setup, but this is an instillation project. Have fun!</p><p><strong>CREDITS</strong><br/></p><p>Game by Andy Wallace<br/>Audio by Jay Brawn<br/>Art by Midge Belickis</p><p>More info at doodledefense.com</p><p><strong>SHOWN AT</strong></p><p>San Francisco Museum of Modern Art<br/>San Francisco, USA 2013</p><p>Come Out And Play<br/>San Francisco, USA, 2012</p><p>Science Gallery's GAME: The Future Of Play<br/>Dublin, Ireland, 2012</p><p>Parsons Spring Fair<br/>New York City, USA, 2012</p>", "metacritic": null, "released": "2015-02-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/00d/00dc1575703ab5dfdbb0b22d6d506233.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["AndyMakes"], "genres": [], "publishers": [], "esrb_rating": null}