{"id": 98335, "slug": "gourmet-quest-vr", "name": "Gourmet Quest VR", "name_original": "Gourmet Quest VR", "description": "Description<br/><p><strong>Gourmet Quest</strong> is a virtual reality cooking simulator. The player is dropped into the life of a chef aspiring to own a prestigious restaurant. From your simple starting as a street side vendor you cook up delicious and challenging dishes. With the latest virtual reality and hand capture technologies the player is able to use their own hands through the entire cooking process.</p>Story<p>The game will allow a single player to play against the system. Players take on the role of Zane, who is the cook. They must fulfill the orders of customers to the best of their abilities. The score will determine their rating boost and earnings. These earnings can be used to upgrade cooking equipment, or entertainment. Throughout the game, players will receive hints about Zane's life, family, and marriage problems. On the last level, Zane receives a family surprise. (Please note this is a prototype and so the scope of the release is limited.)</p>Requirements<p>This game require Oculus Rift (CV1 or DK2) and Leap Motion devices to play.</p>Team<p><strong>Game Designer</strong><br/>Toutoua Vang, is a Web Design student at CSUMB. In this project his role was to manage the team.</p><p><strong>Developers</strong><br/>Michael Wolff is a Computer Science student at CSUMB. His focus was on development and implementation of major game features.</p><p>Adam is a Senior at California State University Monterey Bay. He was a programmer for this project. His main focus in the project was getting the various appliances to work such as burners on the stove and soda dispenser. In Adam's free time he enjoys working on his car, playing Warhammer 40k and aggressive rollerblading.</p><p> <br/></p><p><strong>3D Modelers</strong><br/>Paweł Korczyński and Matusz Waluś, are 3D Artists. They designed and modeled our restaurant environments, and many kitchen equipments.</p><p><strong>2D Artist</strong><br/>Maja Solecka, is an artist who did a lot of the concept design for our game. She also designed the customers and ingredients used in the game.</p><p><strong>Sound Designer</strong><br/>Karolina Jachna, \"I synthesize, record and compose, Yes I am a sound geek\". She is a 5th year student of University of Silesia in Cieszyn. Her focus is on Games and Virtual Reality Design with a specialization in games sounds. Her responsibilities for Gourmet Quest was music composition, SFX, Voiceovers, and Mix &amp; Mastering.</p><p><strong>Thank you from the team at Gourmet Quest, and we hope you enjoy the game!</strong><br/></p>", "metacritic": null, "released": "2016-12-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f00/f0022b7f8f84b02afa49b079fe803277.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Student Games"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}