{"id": 98334, "slug": "kings-men-demo", "name": "King's Men Demo", "name_original": "King's Men Demo", "description": "<p>King's Men is a puzzle platforming game, featuring silly human characters that resemble iconic chess pieces. As The King, the player must rescue their men from the enemy! Once a character has been rescued, they are available to use as long as they stay alive. The player can easily switch between rescued characters to fight enemies, solve puzzles, or sacrifice themselves for the King. If a rescued character dies, they might be found again at a later point. Just as in real chess, if at any point the King dies, the game will be over, and the enemy will provide an insult with one of several unkind phrases.</p><p>Each character will have strengths and weaknesses, loosely inspired by the way their chess counterpart behaves on the chess board, as well as any historical significance associated with the chess piece's name. The Pawn will move slightly faster, but have a weaker attack. The Bishop will find unconventional and strategic ways to deal with enemies. The Queen will have an area of effect attack and quickly come to the aid of other characters.</p><p>I've always been a fan of games in which challenges can be solved differently based on the tools you have. In King's Men, there will be multiple ways to overcome puzzles and obstacles. It's possible the Knight, who is a powerful combatant, isn't available because she died or fell off the map during a previous fight. In this case, you could move some blocks around to safely pass an enemy, or risk losing a different character by attacking the enemy. There will be points in the game where the players will have a choice between platforming, solving puzzles, or combat, and will be able to choose based on their currently unlocked characters and personal taste. The demo has one such point towards the end, where the player can choose between a dastardly puzzle or a difficult series of platforms.</p>", "metacritic": null, "released": "2014-04-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d13/d137a5c15eb0a0e50a3d33d94daaaedc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Breadman"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}