{"id": 9834, "slug": "dark-train", "name": "Dark Train", "name_original": "Dark Train", "description": "<strong>DARK TRAIN is an oppressive sci-fi/industrial 2D adventure made of paper.</strong> Assume the role of mechanical squid ANN 2.35f 💙that is tied to a railroad tamagotchi and deliver the mysterious order for the deceased D. W. Tagrezbung, famous inventor from the Border City. <br/><br/><br/>* controls - dynamic, no point-n-click<br/>* narration - strong, non-textual, situational<br/>* atmosphere - dark, oppressive<br/>* exploration - non-casual<br/>* audiovisuals - paper-made<br/>* no hints, no help - solve it<br/><br/><br/><br/>Dark Train in its game mechanics core is an adventure without point-n-click mechanics. You take control of a mechanical squid Ann 2.35f 💙 via a controller or a mouse. By exploring the train structure, environments within wagons, train control panels and its surroundings, you are progressing further in the game and story.<br/><br/><br/><br/><br/><br/>Our story follows the journey of the inventor D. W. Tagrezbung and the mysterious contract from unknown client which he received years ago. Even as a child, he created a functional model of the universe and throughout his life drew attention to himself thanks to a number of significant inventions. At an advanced age of his peaceful life he received the last big contract with a very strange assignment. The client requested the creation of a model of the human world that embraces changeable weather and civilization. What he did not want to be part of the model was the human face or even people themselves. The actual challenge was presented by creation of transportation that would be capable of delivering the order. Inhospitable territory stretching between the client and the inventor is for centuries connected only by rail. Therefore D. W. decided to create a self-sufficient train with four wagons where each wagon will contain one familiar environment from his world. Eventually D. W. Tagrezbung devoted the rest of his life to the client's order. The day the train was finally ready to go, the famous inventor died.", "metacritic": 79, "released": "2016-10-25", "tba": false, "updated": "2019-09-17T11:26:37", "background_image": "https://media.rawg.io/media/screenshots/9bb/9bb75fd92d72fe53f879c4b9a8775d0f.jpg", "website": "http://www.paperash.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 129, "beaten": 1, "toplay": 3, "dropped": 3}, "playtime": 4, "achievements_count": 16, "ratings_count": 3, "suggestions_count": 451, "game_series_count": 0, "reviews_count": 4, "platforms": ["macOS", "PC"], "developers": ["Paperash studio"], "genres": ["Adventure", "Indie"], "publishers": ["Paperash studio"], "esrb_rating": null}