{"id": 98341, "slug": "healing-hearts-otome", "name": "Healing Hearts Otome", "name_original": "Healing Hearts Otome", "description": "<p><strong>This is a free rough demo, but any support you want to give us would be incredibly appreciated. </strong><br/></p><p><strong>What's Available to Play:</strong> </p><ol><li>The 'common route' introduction that leads up to your choice of Primary (aka your guy of choice). <em>Around 8,000 words.</em></li><li>The first few scenes of John's route. <em>Around 6,000 words.</em></li><li>The total word count for the Introduction and ALL five demo routes is: 20,640 words</li></ol><p><strong>Status:</strong><br/></p><p><strong>8/21/15- </strong>Discovered an issue with a sprite in John's route. This has been fixed. No other changes made.</p><p><strong>8/20/15- </strong>Demo updated with extra content in Introduction, all bachelors now have at least the first scene done in each route. John has additional expressions, but still NO expression for other sprites, John's sprites still incomplete. Mamoru's new sprite is DONE, one more scene added to the end of John's current demo route. (Castor WILL have a shirtless sprite for the start of his route, don't worry.)</p><p><strong>8/11/15-</strong> First in-progress demo uploaded. MC's sprites generally done, NO expressions for the other sprites other than default. Mamoru's sprite still needs to be re-done, others still need minor fixes.<br/></p><p><strong>The Game:</strong><br/></p><p>Healing Hearts is a Modern Fantasy otome game/visual novel, created in Ren'py.</p><p><strong>Story:</strong> Leah (name can be changed) Parrish is in her second year at Faelands School of Magic. It is time for her to be assigned to a team of other magic-users to continue her training for the next three years. Protecting the mundane world from magical threats is a dangerous job, and her teammates are incredibly important to her future –in more ways than one. The problem: the rest of Leah's teammates are all guys, and the team lives together! On top of that, as the team's Healer she has to choose one of them to be her Primary –the one whose job it is to protect her over all else. Who will she pick?</p><p>The story will have a common beginning, but once you pick your bachelor of choice each story will be unique. Right now there are <strong>five planned bachelors</strong>, with possibly <strong>two more</strong> depending on how long everything takes.</p><p>With the fact that each route is totally different in mind (and therefore multiplying the amount of writing that needs to be done), right now the plan is to release the game in increments. For example, when the first two bachelors are done, I'll do a first release. Then probably additional releases after each one is done. I'll have to look into the details.</p><p>But, there are only two of us working on this game, so please be patient with us.</p><p><strong>We would love to hear from you! Please visit our Tumblr pages to contact us with any feedback you might have, or if you just want to say hi!</strong><br/></p><p><strong><em>Healing Hearts Otome Official Tumblr</em></strong></p><p>Written and Coded by: OnaDacora (onadacora.tumblr.com)</p><p>Art by: nittanynn (nittanynn.tumblr.com)</p><p>Music by: N.C.H (syncopika)</p>", "metacritic": null, "released": "2015-08-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5f7/5f78b3663bb6289fb882d3f039cc11a4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["dacora"], "genres": [], "publishers": [], "esrb_rating": null}