{"id": 9835, "slug": "outlast-2", "name": "Outlast 2", "name_original": "Outlast 2", "description": "<p>Outlast 2 is a first-person survival horror game developed by Red Barrels. While continuing the ideas of the first Outlast, the game&#39;s story does not continue the plot of the first title in the series. </p>\n<h3>Plot</h3>\n<p>Blake and his wife Lynn are journalists that investigate a case involving the murder of a pregnant woman. The set out to visit the crime scene in the remote Arizona village by a helicopter that breaks down mid-air and crashes. Blake has to find his wife and figure out what is going on in the village.</p>\n<h3>Gameplay</h3>\n<p>As the first game in the series and it&#39;s expansion pack, Outlast 2 is a single-player survival horror experience. The main protagonist is unable to fight his enemies, so stealth is used to avoid confrontation. Unlike the previous titles, Outlast 2 features a stamina bar and new additions to the movement system, such as sliding and going prone. </p>\n<p>Blake has a camera with him at all times. This camera is used for activating night vision, eavesdropping to distant conversations with its microphone. The camera requires batteries for it to work, so the players have to look for them on the levels. </p>\n<p>There is no automatic health regeneration present in the game. So when the player suffers some damage, they need to find a medkit in order to restore their agility and health.</p>", "metacritic": 76, "released": "2017-04-24", "tba": false, "updated": "2024-04-09T01:01:51", "background_image": "https://media.rawg.io/media/games/880/880f6aa65fe9d786f1a455963df76180.jpg", "website": "http://www.redbarrelsgames.com/games/outlast-2/", "rating": 3.67, "rating_top": 4, "added_by_status": {"yet": 360, "owned": 2935, "beaten": 546, "toplay": 150, "dropped": 190, "playing": 35}, "playtime": 5, "achievements_count": 84, "ratings_count": 673, "suggestions_count": 314, "game_series_count": 2, "reviews_count": 679, "platforms": ["Xbox One", "PlayStation 4", "PC", "Nintendo Switch"], "developers": ["Red Barrels"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Red Barrels"], "esrb_rating": "Adults Only"}