{"id": 98384, "slug": "i-bash-zombies-minecraft-wiimote-mini-game", "name": "I Bash Zombies (Minecraft Wiimote Mini-Game)", "name_original": "I Bash Zombies (Minecraft Wiimote Mini-Game)", "description": "<p><strong>What Is It?</strong><br/> 'I Bash Zombies (with my wiimote of doom)' is that monster-bashing thing I've wanted to make ever since I realised I could. In its current form, it's a Minecraft mini-game where you hit zombies with your sword by swinging a Wii remote. Don't let them push you into the pit!</p><p>The video on the right shows what the game play looks like. Skip to 1:15 to see the Wii remote bit. (I'm using a Sonic Screwdriver -themed Wii remote in the video, it looks a little different from a normal Wii remote but works the same.)</p><p><strong>Sounds Cool, What Do I Need?</strong><br/>This physical game prototype requires:<br/> - A Windows-based system, Minecraft version 1.64 with Forge Modloader and mods MobSpawn Controls 2 and GuiLib installed<br/> - GlovePIE programmable input emulator<br/> - A Wii remote *without* Motion Plus<br/> - Bluetooth to connect the Wii remote to your computer.<br/>- Pasting a Minecraft savefile into the folder where Minecraft keeps your game worlds.<br/><br/>You probably want a wrist strap on your Wii remote so you don't throw it at your screen.<br/></p><p>If you're comfortable with all that then great, go ahead and set it up! Details and download links can be found here:</p><p>http://redacted.org.uk/altctrl/ibashzombies.html<br/><br/></p><p>(If you don't have a Wii remote that works with your computer, then you can still play the mini-game without the physical aspect - for this follow the bits of the setup that don't involve GlovePIE or the Wiimote.)<br/></p>", "metacritic": null, "released": "2015-01-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7ae/7aea8c33b3c4fe0084260f99eed95b74.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["%name%"], "genres": ["Action"], "publishers": [], "esrb_rating": null}