{"id": 98415, "slug": "happy-hedgehog-beta", "name": "Happy Hedgehog (Beta)", "name_original": "Happy Hedgehog (Beta)", "description": "<p><em>Happy Hedgehog</em> is a hedgehog pet simulator for the original Game Boy that was developed for Porpentine's Pet Jam. It was written in C using the Game Boy Development Kit. The game is currently in Beta, but new features will be added regularly until the final release.</p><p>You can name your hedgehog, feed it, play games with it and watch it walk around and be cute!</p><p>Play games to earn money, and use the money to buy food and toys.</p><p>The game can be played in any Game Boy emulator or flashed onto a cartridge and played on real hardware. It will automatically save your data so you can stop and go as you please.</p><p>As the game is currently in Beta (v0.1), here is a list of TODO items (everything else is assumed to be working already. If not, feel free to file a bug report at patrick@patchworkgam.es!).<br/></p><ul><li>Add music and sounds</li><li>Implement \"how to play\" on main menu (buttons should be intuitive or marked on screen, \"how to play\" will basically say that minigames earn money, money unlocks things, etc.)</li><li>Add more hedgehog animations (currently can walk and idle/blink)</li><li>Add 2 more minigames</li><li>Only the first two items in the shop list have been implemented.</li><li>Implement toys and props (toys and props can be unlocked and purchased, however activating them in the inventory screen does nothing as of yet).</li><li>Add a prettier main menu screen</li></ul><p>And a list of known bugs:</p><ul><li>At about 75% food or fun, the bars might render glitchy, but will fix themselves when the number changes and they get redrawn.</li><li>Sometimes when loading the game, the hedgehog can enter a state of permanent eyes closed. This will correct after entering/exiting a menu.</li></ul>", "metacritic": null, "released": "2015-08-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/91e/91eac1a8cb87cda46767794c4d785641.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Patchwork Games"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}