{"id": 98449, "slug": "zombie-invasion", "name": "Zombie Invasion", "name_original": "Zombie Invasion", "description": "<p>Zombie Invasion is a deadly mixture of RPG and Zombie killing. This game allows you to be the hero who shoulders the protection of his village and entire human race. The only goal you have is to go beyond your limits to terminate zombies!<br/><br/>As soon as you choose your character you will be drawn in to the world of zombies. With your weapon in hand, you start killing zombies one by one. There will be waves of zombies coming which will grow stronger with each level. You will be able to collect coins and gems by killing them. Same goes for you, with each wave you will gain experience and level up as well.<br/><br/>There will be zombies covered in blue and red auras. The zombies in red aura will drop potions for HP and strength. These Potions will help you in dire circumstances.<br/><br/>The controls are very easy, by tapping left and right your character will attack. Train your hero, you can choose to upgrade the abilities of your hero. At each level up you will be able to choose which ability you want to learn, from the three, only one ability can be granted. The games graphics are very good. The game includes various terrains and environments for you to fight in. It has more than twelve types of terrifying zombies which will do anything to make you dead. <br/><br/>Gems – While battling you will experience zombies which are emanating blue aura. If you kill those zombies you will get blue coloured gems. These gems are very precious as they help you strengthen your characters stats. There are seven characters so make sure you spend your gems wisely.<br/><br/>Characters – All the heroes are strong and their might could even lead fear in the heart of zombies. There are seven mighty heroes and each of them has their own unique abilities and skills.<br/><br/>• Charlotte :- A girl dressed in blue with a pistol in her hand is Charlotte. She will kill her enemies even before they move!<br/><br/>• Alissa :- Another beauty with a shotgun in hand. Don't be wooed by her beauty, she will slaughter mercilessly.<br/><br/>• Kitto :- One of the mighty ninjas has joined the battle! With his Katana, he will slash his way through zombie waves!<br/><br/>• Jame :- A mighty hunk wearing gladiators helm and a huge machine gun in his hands, making him look like the doom bringer himself!<br/><br/>• Ichiko :- Ichiko dressed in green and has a blue shotgun in hand. The attacks are stronger than Alissa and are able to create holes in even the strongest of zombies.<br/><br/>• Elise :- Elise, having a bow and arrow in her hand emanates the aura of war god! Her arrow will never miss its target and ignoring the defense will land a killing blow instantly!<br/><br/>• Hikari :- Don't let the cute girl in maid dress fool you, she has a Scythe in hand! She is the strongest of heroes with a melee weapon. For zombies, she is their Grim reaper!<br/><br/>How to play:<br/>- Tap on the left to attack on the left<br/>- Tap on the right to attack on the right<br/>Hints:<br/>- Tap on flying Pumpkin to get the rocket help on fighting<br/>- Pay attention on indexes, keep off running out of shot<br/>- Add suitable abilities before fighting<br/>- Upgrade as soon as possible to defend giant, speedy Zombies<br/>Are you ready to face the zombie apocalypse? Get it for free now</p>", "metacritic": null, "released": "2017-04-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ec2/ec22cd4bdf4ff810412f2622c60b52c9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Stomstudio"], "genres": ["Action"], "publishers": [], "esrb_rating": null}