{"id": 98483, "slug": "global-conflicts-world", "name": "Global Conflicts: World", "name_original": "Global Conflicts: World", "description": "<p>In Global Conflicts series, you are brought closer to a series of problems that are occurring across the world,yet, these problems are far from the everyday that the students traditionally witness. You will interact with individuals who are greatly affected by these conflicts. You are forced to navigate a virtual chaotic world, in which there is no one truth. The games challenge the way you perceive conflicts and society while encouraging you to analyze and relate to international issues, such as globalization, corruption, democracy and human rights. <br/><br/>The Global Conflicts series has won numerous prizes ex. BETT. The games make it possible for players to explore and learn about different conflicts across the globe. In Global Conflicts, you perceive the world through the eyes of a journalist who is attempting to find the best possible story. <br/><br/>WORLD is a game series that places you in the middle of different conflicts worldwide, from war related issues to human rights. The different assignments does not only put you on the spot as a journalist but also challenging you as a human being with the expertise, knowledge and understanding how life is different around the world. <br/><br/>MISSIONS: <br/>* Afghanistan <br/>* Child Soldiers <br/>* Checkpoints <br/>* Military Operations <br/>* Sweatshops</p>", "metacritic": null, "released": "2016-04-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/89e/89ef1d6fdf7fb11e4615e9bbde629063.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["seriousgames"], "genres": ["RPG", "Educational"], "publishers": [], "esrb_rating": null}