{"id": 98498, "slug": "sugawara-chronicle-demo", "name": "Sugawara Chronicle - Demo", "name_original": "Sugawara Chronicle - Demo", "description": "<p><em>Sugawara Chronicle is currently under development! The demo is now available for free download for Mac and PC and includes the first three chapters for you to play. </em></p><p><em>Play the early access today and see the game as it develops! </em><em>Help us out by sharing our page and inviting all your friends to check us out! We plan for all routes to be completed in spring of 2019. The game is being updated regularly and all aspects are subject to change. </em></p>\n<p>Hiroya Tachibana doesn't need anyone's help. At least that's what he told himself on the night his father threw him out. Day by day he goes to school, keeping his head down to draw as little attention as possible. But between a vicious rivalry with the private school across town, a friend who can't go one day without getting in trouble, and a strange rumor surrounding a mysterious transfer student, Hiroya finds it impossible not to get distracted, while his own life crumbles around him.  Will he make his own way and become a champion of his school? Will he delve into the lives of his classmates? Forge new relationships? Or will he spend his senior year sleeping under the bridge that divides the town? It's up to you to decide. <br/></p>\n<p>Sugawara Chronicle is an anime inspired choice-based VN which splits into two distinct paths early in the game. One route will have you team up with a group of club leaders on a mission to save you school the villainous private academy and their student body president. The other route will take you into the daily life of a girl who can't help but get involved in some mischief wherever she goes. The two stories, while played independently, are highly connected, and lead to a third unlock able route in which you can have a chance to learn the true nature of the phenomena at Sugawara High. </p><p>Full game will feature:<br/>110,000+ words across 3 story arcs, with over 100 <strong>events</strong> that will affect the following chapters. <br/><strong>8 major characters</strong> with multiple poses, outfits etc. <br/><strong>30+full color CGs</strong> in beautiful <strong>4k Ultra HD</strong> resolution! (1080 will also be available)<br/><strong>30+</strong> full color backgrounds.<br/><strong>80 minute</strong> instrumental soundtrack.<br/><strong>Unlockable Extras!</strong><br/>Fully voiced characters (if budget allows)<br/><br/>The demo release was made available in 2018 and is playable now for free!</p>\n<p>What's in the game now?</p><p>Chapters 1 and 2, with partial completion of art/music<br/></p>\n<p>Introduction to 6 of the major characters</p>\n<p>Alternative plot developments depending on your choices</p>\n<p>Introduction to both of the game's primary routes. </p>\n<p>Additionally: 4 CG artworks, 6 songs from the soundtrack, 10 backgrounds. </p>\n<p>*The demo is released at 1920 x 1080p while in development (easier upload/download) The final version will also be available at 4k resolutions at no extra charge. </p>\n<p>Join us on Discord for discussions, updates, or if you're interested in working with us to develop this awesome game! https://discord.gg/kskryAR We'd love to hear from you!</p>", "metacritic": null, "released": "2017-08-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c2c/c2c833cb504a0e6fb05e27f83a8da7d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 376, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Sarchalen Visual Media Group"], "genres": [], "publishers": [], "esrb_rating": null}