{"id": 98537, "slug": "the-inner-light", "name": "The Inner Light", "name_original": "The Inner Light", "description": "<p><strong>Description</strong><br/></p><p>You wake up at night, alone in your room, all the while the shadows close in and the sounds of the night grow louder. Leave the comfort of your room and explore the rest of the house at your own peril if you wish. But what will you find? Will you find the light, or face the darkness forever?</p><p><strong>Synopsis &amp; Gameplay</strong><br/></p><p>'The Inner Light' is a short experimental game in which you play a child who wakes up alone in their bedroom and must explore the house around them while facing off against the darkness of the night. The game doesn't feature any kind of combat, instead relying on exploration and carefully crafted atmosphere to draw in and engage the Player. The game places a strong emphasis on the concept of 'darkness', with the only sources of light in the house coming from moonlight shining from the windows that dot the outer walls, and whatever few other lights that are still on.</p><p>The game was built in Unity in just over a week, creating as a part of a Student Project for Studio 2 at SAE QANTM in Brisbane, Australia. The goal behind the development of the game was to convey the emotional experience of being alone at night as a child, fearing the dark and the unknown world around them. It draws on the authors own childhood experiences, and the house setting is an amalgamation of houses that the author has resided in at one point or another over the years.</p><p><em>A Postmortem for 'The Inner Light' is available here.</em></p><p><strong>Legal</strong></p><p>'The Inner Light' is an educational project, and is not for sale or commercial reproduction. It is provided free of charge. Any and all assets used including but not limited to Audio, Video, and 3D Models, were created solely for this project by the author, are available for use free of charge, or used in manner that falls under the use of the <em>'Fair Dealing'</em> clause of the <em>Australian Copyright Act of 1968</em>. Any remaining works consist of a mix of Freeware, Creative Commons, Public Domain, and Non-Commercial licenses. Due to their limited use and the non-profit nature of the project as an educational piece, their use in 'The Inner Light' falls under the umbrella of <em>'Fair Use'</em>.</p>", "metacritic": null, "released": "2017-02-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/964/96462bb10a1b1abbf8c8c38df00f5331.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Kira Zingmark"], "genres": [], "publishers": [], "esrb_rating": null}