{"id": 98564, "slug": "renegade-agent", "name": "Renegade Agent", "name_original": "Renegade Agent", "description": "<p>Welcome to a world full of conspiracy theories, secret operations, stealth missions and unsolvable ciphers.</p>\n<p>You are the secret agent. Betrayed and alone you search for the truth and at the same time try to save the very world in which you no longer have a place. </p>\n<p>Many stealth missions and exciting action await you in Renegade Agent!</p>\r\n\r\n The Hub  \r\n<p>Every day begins in the safest place you know – your office. Here you have everything you need: your telephone, projector, file folders and various gadgets to aid you. Everything you see you can fully interact with. Gather pieces of information from the daily newspaper as new puzzles and riddles await you every day. Solve them all to get the best ending.</p>\n<p> </p>\r\n The Quest  \r\n<p>It is time to set out on your quest for the truth! Be careful though; every step you take will have consequences and only fully prepared you can overcome the challenges that await you. Read every bit of intel you have before setting out on your quest; even the smallest details matter!</p>\r\n\r\n The Infiltration\r\n<p>Get ready for difficult and dangerous missions at various locations. Will you enter a building unnoticed or will corpses pave your way? It is on you to decide how you will tackle each mission and what its ultimate outcome will be.</p>", "metacritic": null, "released": "2017-12-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/945/945e7a960b0d86b98d22b20f68dabf0a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Autumn Fall Studio"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}