{"id": 98594, "slug": "dawgmageddon", "name": "DAWGMAGEDDON", "name_original": "DAWGMAGEDDON", "description": "<p>Dawgmageddon is actually a playable music video experiment stuff with an indonesian indie rock band \"No reason why\" music titled \"genosida moral\" or \"moral genocide\" in English.<br/></p><p>Dawgmageddon is about a duck with a vengeance raging and killing all hunters in his sight with a machine gun after knowing a cruel reality that his family and fellow comrades had fallen in the hand of vicious hunters and his evil accomplice dog for the sake of fun and sport 30 years ago.</p><p>the game play is basically \"duck hunt\" with a twist, instead hunting a duck we are playing as a duck hunting hunters. kill all hunter in sight with rage and reveal the real mastermind behind the duck cruel past.</p><p>if you notice you will find bunch of bad ass movie quotes along the game, all hail to bad ass movie scriptwriter around the world.</p><p>____________________________________</p><p>control</p><p>use mouse to aim and left click mouse to shoot, press \"R\" button to reload.</p><p>____________________________________</p><p>the game is a prototype and still in early stage of development. i believe there's always room for improvement. so please feel free to contact us at  contact@mojikenstudio.com if you find bug, glitches or suggestion and idea for further development of the game.</p><p>____________________________________</p><p>For updates about the developments and stuff you can catch us on mojikenstudio.com<br/><br/></p><p>art and programming</p><p>Pandu Rukmi Utomo</p><p> http://www.kreavi.com/pamanovsky</p><p>music \"Genosida Moral\"</p><p>No Reason Why</p><p> http://www.reverbnation.com/noreasonwhysub</p><p>SFX - Ittou's Soundworks</p><p>http://ittousoundworks.tumblr.com/</p>", "metacritic": null, "released": "2015-05-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e5f/e5f70632e1a6b5ac9dc75c1b54f4e6db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["Mojiken"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}