{"id": 98617, "slug": "capybarbra-a-new-brow", "name": "CapyBarbra: A New Brow", "name_original": "CapyBarbra: A New Brow", "description": "<p>You are a Capybara and you're our only hope.</p>\n\n<p><strong>STORY:</strong></p>\n<p>Help a fellow get back his self confidence by chewing off the eyebrow hairs sprouting all up in the space between his 2 predominate brows (Uni-brow territory). Put him back at full confidence and maybe… just maybe… he can salvage his relationship and save Milk Chocolate for EVERYBODY! (This will probably make more sense after a play…)</p>\n\n<p><strong>CONTROLS:</strong></p>\n<p>-[ ARROWS to Move | (Hold)SPACEBAR to eat ]</p>\n<p><strong>KNOWN ISSUE</strong></p>\n<p>-After enough time has passed, there really is no chance of saving him…</p>\n<p>-Huh. Looks like I forgot to add depth to the sprites.</p>\n<p><strong>FAVORITE MECHANICS DITCHED LAST MINUTE</strong></p>\n<p>-<strong>Voice Shake</strong> As the man’s confidence goes up and down, he comments on his mood and other random things. While this happens, there is an incredible screen shake (based on Volume spectrum) because this man is flippin’ massive in comparison.(I wrote and recorded over a hundred lines of dialog for this haha oh man. )</p>\n<p>-<strong>Giant Finger</strong> When you step out of the Brow Area, it triggers the man to say something like “GOT THAT ITCH ON MY FACE AGAIN”! After a couple seconds a massive finger slowly approaches the area to scratch the itch. If it hits you, game over.</p>\n<p>-<strong>Roll Over</strong> This is a secondary move where Barbra rolls over and it’s so adorable that the hair implodes. This move has a cool down so you can’t spam.</p>\n<p>@Ratherjolly<br/></p>", "metacritic": null, "released": "2018-08-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3d3/3d3ce0dc0351ef1370f1a784fe0c9823.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Ratherjolly"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}