{"id": 98613, "slug": "among-the-distant-stars", "name": "Among the distant stars", "name_original": "Among the distant stars", "description": "<p><strong>Game Synopsis:</strong></p><p>Dara Arreal is a White Mage, a practitioner of healing magic renowned for her rare abilities. When the world of Mitalia faces a devastating pandemic, she is dispatched to the planet with her friend Derek as a final hope for the dying population. Bus as soon as they enter deep space, a powerful surge of magic rips through a nearby constellation. After recognizing a life force, they locate a shell within the energy pulse and bring it on board. Inside, they find an unconscious man at its core, barely clinging to life and in dire need of aid. As a healer, Dara is compelled to save anyone she can, but the dangerous aura she senses from the man torments her thoughts. Who is he? And why was he floating through space? While these questions haunt her conscience, Dara can't escape the premonition that her life has been changed forever.</p><p><strong>Game Description:</strong></p><p>\"Among the Distant Stars\" is a short, non-commercial visual novel set in open space that details the lives of three characters brought together by chance. The story is \"interactive\", meaning that the decisions and choices you make will alter the flow of the story and the relationships between the characters.</p><p><strong>Game Features:</strong></p><p>• An original story and artwork</p><p>• Animated backgrounds</p><p>• A dynamic story featuring 2 routes and 4+ endings: a light-side and dark-side ending for each route + bad endings</p><p>• Approximately 1 hour of gameplay for 1 each route</p><p><strong>Characters:</strong></p><p><strong>Dara Arreal</strong></p><p> </p><ul><li>Race: Half-Elf </li><li>Age: 27</li><li>Height: 5'4\" </li><li>Weight: 110 lbs. </li><li>Magic Affinity: Healing </li><li>Ability: Empathy </li><li>Spirit: N/A</li></ul><p> Description: One of the few White Mages left in the galaxy, Dara's rare healing abilities are constantly sought across the star systems. Despite the high risks involved, she never abandons those in need, choosing to siphon away her own life force to heal her patients. Her endless compassion is her greatest strength, but her selfless regard for her own life often frustrates her closest friends.</p><p><strong>Derek Reyes</strong></p><ul><li>Race: Human </li><li>Age 28</li><li>Height: 6'1\" </li><li>Weight: 200 lbs. </li><li>Magic Affinity: Fire </li><li>Ability: N/A </li><li>Spirit: Fierra</li></ul><p> Description: Known as the Crimson Shadow, Derek Reyes has earned galactic renown for his daring missions. As a freelance space captain, his commission fees are astronomical, but his abilities are well worth the cost. Harboring a deep confidence in his own abilities, he cares little for the intrigues of galactic politics, choosing instead to pave his own way in the universe. Impassioned and—at times—impulsive, his devil-may-care attitude has earned him a fair share of enemies, but those closest to him attest to his unshakeable loyalty and tireless defense of the weak.</p><p><strong>???</strong></p><p> </p><ul><li>Race: Human </li><li>Age: ???</li><li>Height: 6'2\"</li><li>Weight: 180 lbs.</li><li>Magic Affinity: ???</li><li>Ability: ??? </li><li>Spirit: ???</li></ul><p> Description: A mysterious man found floating through space, shrouded in a strange energy field. His time in space has shattered his mind, leaving him with no memory of his past.</p><p><strong>Game Staff:</strong></p><ul><li>Director Katta</li><li>Writer Jethro Robbins-Dyer, Tnm6 (demo)</li><li>Artist JustSyl</li><li>Background artist Badriel</li><li>Gui art and programming Badriel</li><li>Music Creative Commons</li><li>Programming Anne</li></ul><p><strong>Links:</strong></p><p>Game development blog</p><p>Lemmasoft thread</p>", "metacritic": null, "released": "2015-09-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/007/007d97d7d1490d8c3cc03816e76cbfc9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Katta"], "genres": [], "publishers": [], "esrb_rating": null}