{"id": 9864, "slug": "the-isle", "name": "The Isle", "name_original": "The Isle", "description": "DISCLAIMER: THIS GAME IS IN EARLY ACCESS. PLEASE DO NOT PURCHASE IT UNLESS YOU WANT TO ACTIVELY SUPPORT THE DEVELOPMENT OF THE GAME AND ARE PREPARED TO HANDLE SERIOUS ISSUES AND POSSIBLE INTERRUPTIONS OF INTENDED GAMEPLAY FUNCTIONALITY.Foreward and CautionFirstly, thank you for looking at and possibly considering the purchase of our game. Despite the fact we aspire to create a fun game approachable by many, we feel the need to caution any potential users. We have begun updating the game towards the point of intended hardcore functionality. As this happens, difficulty will gradually become more brutal and chances of survival become less likely. We, the developers, are actively going to design the future game islands and creatures to counteract known player tactics of survival. Your mistakes will be punished. Expect no survivors.The Isle: A World Designed to Kill You<br/>The Isle is a realistic, gritty, open-world survival horror game. There is only one goal in mind: Survival. The islands and its inhabitants will radically change, ever-evolving as players themselves learn how to survive. There are no waypoints, tutorials, or ulterior precepts in mind to alter play styles or purpose. In the end, the only person you can trust is yourself.KEY FEATURES IN EARLY ACCESS<br/>These features are currently in the game and though they are listed, may have bugs that have not been discovered or addressed.<br/><br/><ul><li>The Island: A vast landscape of dense jungle and open plains, hidden within are various ruins and expanses that hold insight as to what was here...<br/></li><li>Up to 100 players per server based on server hardware and bandwidth.<br/></li><li>Progression System - Start as a defenseless creature and work your way up to the mighty titans of the prehistoric era, falling all the way to the bottom of the food chain upon death.<br/></li><li>Basic Dinosaur Simulation - Basic needs such a thirst and hunger are present. Stalk your prey and avoid your predators among the dense forests and swamps.<br/></li><li>Playable Dinosaurs - Choose between more than 15 playable dinosaurs such as Austroraptor, Carnotaurus, Tyrannosaurus Rex, Gallimimus, Utahraptor, Acrocanthosaurus and Allosaurus, with many more planned ahead.<br/></li><li>Dedicated Server Binaries with Steam integration<br/></li><li>Basic Dinosaur AI<br/></li><li>An expansive island stretching larger than 16x16km²</li></ul>Planning Ahead: The Future Development Goals<br/>We realize that there is a long road ahead and a lot of work to be done in order to turn this into the dinosaur game we want it to be. Throughout the year, we will be adding a lot more to the Isle based off of current planning and user feedback Some of these features are as follows:<br/><br/><ul><li>Mac/Linux/Steam OS Support<br/></li><li>Full Mod Support - Skins, additional dinosaurs, and various gamemodes such as deathmatch and a tycoon sim<br/></li><li>Additional Steamworks Features - Achievements, Trading Cards, etc.<br/></li><li>VR Support<br/></li><li>Localization of all Game UI/Text<br/></li><li>Realistic Dinosaur AI with complex ecosystems<br/></li><li>20+ Playable Dinosaurs<br/></li><li>Cannibal Faction implementation<br/></li><li>Mercenary Faction implementation<br/></li><li>Player Crafting System implementation<br/></li><li>Base Capturing<br/></li><li>Dynamic Aerial Drop-In Spawn System<br/></li><li>Human/Dinosaur Body Painting<br/></li><li>Dinosaur Capturing and Training<br/></li><li>Advanced Vehicle System<br/></li><li>Improved Sound FX, including regional sound localization<br/></li><li>Improved and expanded vegetation system, including interactive foliage<br/></li><li>Functional Steam economy<br/></li><li>\"The Escape\" global in-game world quest</li></ul><br/>Aside from the necessity of community feedback finds for bug fixes, content suggestion, and creative feedback, the Isle will have a post-release content structure after Early Access has been polished to the best of our ability.Unique Triple-Faction Gameplay<br/>Choose between three playable factions and find yourself stranded on a merciless island of harsh wildernesses, rampaging dinosaurs, vicious cannibals, lethal mercenaries and rival players. Explore dark and foreboding jungles, unforgiving swamps and beautiful but deadly mountain vistas for the supplies you will ultimately need to survive. As you progress and explore, you will happen across ancient ruins and abandoned military bases that, with perseverance and time, can convert into your own outpost or nesting ground in this hostile world.<br/><br/><ul><li>As the Mercenary, you'll experience a sense of both wonder and terror as everything on the island has evolved to kill you. However, you will find yourself armed to the teeth and more than capable when it comes to survival skills. Nothing will stand in your way... so long as you still have ammo.<br/></li><li>As the Cannibal, you will find yourself in-tune with the natural environment. Capable foragers and natural hunters, you will form tribes or survive alone. Armed with spears, bows, poison, and makeshift camouflage, you must be as ruthless as the beasts among you.<br/></li><li>As a Dinosaur, you'll be the epitome of cunning and ferocity. From the small agile Austroraptor to the unstoppable Tyrannosaurus Rex, you will survive from being a juvenile until adulthood, forming packs, creating and defending your nests, hunting prey, and claiming territory. All roads lead to death, or becoming the apex predator of the island.</li></ul>A Global Community Story<br/>The Isle features a narrative told strictly through the environment, achievable only through immense cooperation among players. Hidden locations and artifacts are dynamically created within the open world that reveal the answers to all the questions that would arise. Why are you here? Why dinosaurs? What is causing them to mutate? Why can’t you just leave? It will take the entire global community to unravel the purpose to their being on the Isle and each discovery will directly affect the future of the game.Become the Beast<br/>One key focus of the Isle is the unique element of playing as dinosaurs and other creatures found on the islands. All will have a general familiar play-style, while each retain their own uniqueness of capability. Players can select a variety of creatures and grow from juvenile to adulthood. As your dinosaur grows, you can select different palette options and skins, growing your abilities to hunt, create your pack, and eventually mutate into a much powerful version of your dinosaur and claim the right as the Apex.Unparalleled Mod Support<br/>We will support all the features of Steamworks and allow for any aspect of the game to be modded by the community using Steam Workshop. Members of the community will be able to download a free copy of Unreal Engine 4 from Epic Games and generate mods and change all aspects of the game. This includes everything but not limited to making a new map, adding new dinosaur types or new game modes such as a Dinosaur Park Simulator or a role playing focused game mode.<br/><br/>You can subscribe to mods on the workshop and select what ones you want enabled when you start your server. Players joining the servers will automatically obtain the required mods without even needing to restart the game.", "metacritic": null, "released": "2015-12-01", "tba": false, "updated": "2024-01-04T20:21:56", "background_image": "https://media.rawg.io/media/screenshots/0f8/0f877afe45beb6db4be762a2a9b99137.jpg", "website": "http://findtheisle.com", "rating": 4.11, "rating_top": 4, "added_by_status": {"yet": 12, "owned": 166, "beaten": 4, "toplay": 13, "dropped": 8, "playing": 13}, "playtime": 4, "achievements_count": 0, "ratings_count": 36, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 37, "platforms": ["macOS", "PC"], "developers": ["The Isle Development Team", "Afterthought"], "genres": ["Action", "Adventure", "Simulation", "Massively Multiplayer", "Indie"], "publishers": ["The Isle Development Team", "Afterthought"], "esrb_rating": null}