{"id": 9865, "slug": "onraid", "name": "ONRAID", "name_original": "ONRAID", "description": "Onraid is a challenging 2D shooter game, where you are free to develop your own play style and tactics to destroy your enemies.<br/><br/><br/><br/><br/><br/><br/>Onraid offers intense battle modes, a varied set of character classes and cosmic visuals. Team up with friends or strangers to strengthen your chances as you battle unknown enemies, strange bots and mighty bosses. Use the items collected on raids to craft powerful weapons, gadgets and skins and customize your quirky character. Time to Raid!<br/><br/><br/><br/><ul> <li> <strong>9 character classes</strong>, each of which has its own strengths and weaknesses, weapons and gadgets. Tweak your character for your preferred game style.<br/> </li><li> <strong>4 unique battle modes</strong>, each with different settings and goals. Players form teams by inviting their friends or being randomly paired, and you can fight against each other or against game bosses.<br/> </li><li> <strong>Craftable equipment.</strong> Collect items from raid boxes to craft different weapons, gadgets and skins, each of which has their own strengths and weaknesses. Build over <strong>45 weapons</strong>, <strong>80+ gadgets</strong>, and  <strong>60+ skins</strong>. Customize your character in ways that can directly affect your tactics, and develop your own play style.<br/> </li><li> <strong>PVP leagues.</strong> Get to the top of the rankings as an individual or as a team!<br/> </li><li> Much more yet to come in regular updates!</li></ul>", "metacritic": null, "released": "2017-03-01", "tba": false, "updated": "2023-07-27T03:31:43", "background_image": "https://media.rawg.io/media/screenshots/db7/db7473e7f29ff99e55f6e3a95a04c6ca.jpg", "website": "http://pragmatixgames.com/onraid", "rating": 2.35, "rating_top": 1, "added_by_status": {"yet": 14, "owned": 433, "beaten": 1, "toplay": 2, "dropped": 11, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 23, "suggestions_count": 457, "game_series_count": 0, "reviews_count": 23, "platforms": ["macOS", "PC", "Linux", "iOS"], "developers": ["Pragmatix"], "genres": ["Action", "Strategy", "Massively Multiplayer", "Indie"], "publishers": ["Pragmatix"], "esrb_rating": "Teen"}