{"id": 98677, "slug": "sleepless-temple", "name": "Sleepless Temple", "name_original": "Sleepless Temple", "description": "UPDATE: Game development is on hold indefinitely. You are free to download latest version but please note it's  buggy and unfinished version.Current version: 0.01bChangelog:<p><strong>New:</strong></p><ul><li>From now actions can take more than one turn to complete</li><li>Added graphical and text progress to planned actions (icons on the left side of screen)</li><li>Green color of icon now symbolizes completed action and as action progresses icon is changing color via gradient white-&gt;green</li><li>Added text indicators for health and stamina</li></ul><p><strong>Balancing:</strong><br/></p><ul><li>Move action now takes 500 ms to complete<br/>Attack action now takes 375 ms to complete<br/>Rotate action now takes 200 ms to complete</li></ul><p><strong>Fixes:</strong><br/></p><ul><li>Made direction arrow (next to planned action) smaller</li><li>Icons now looks disabled rather than dissapearing completly</li><li>A lot of refactoring</li></ul>What is a Sleepless Temple?<p>It is a dark-fantasy, top-down and turn-based tactical  rogue-like focused on exploration, fighting and interaction - heavily inspired by Dark Souls I, Dark Souls II and Demon Souls games.</p><p><strong>Sleepless Temple will be a game about exploring unknown underground temples to fulfill your character unique goal. Depending on mission you can team up with or fight against other NPCs. You will need to use whole arsenal of abilities to survive long enough... That includes making friends, doing buisnesses, convincing others to your goal, but also fighting, deceiving, lying or plotting against others. All of that while managing your sanity and trying not to go insane before you reach your destiny. Are you going to play along with your character personality or are you going to risk your mental health and become different person? It is known that those who got back from the temples are changed forever...</strong></p><ul><li><strong>Procedurally generated terrain</strong></li><li><strong>Permadeath</strong></li><li><strong>Nice graphics (no ASCII)</strong></li><li><strong>Turn-based, tactical fights</strong><br/></li><li><strong>Dark-fantasy theme</strong></li></ul>Is it already done?<p>Nope, it is in <strong>pre-alpha state</strong>, which means that there is a little of actual game right now. I am working on creating solid code base that will allow me to create interesting and deep systems.</p>So why did you release it?<p>To give myself more motivation to keep going. I got inspired by the Annual Roguelike Release Party - to do that as early as possible.</p>I see, what can I expect in foresable future?<p>When I hit my first big milestone -  fighting system - you can expect: <strong>Duels with simple AI fueled by interesting and deep fighting system heavily based on Souls series. You will need  to know your weapon, manage your stamina and position as well as figuring enemy next move.</strong></p><p><strong>When I hit this milestone, you can expect at least one weapon from each type.</strong><br/></p>So what can I expect in this version?<ul><li><strong>Very simple game where you can kill (or be killed by) enemy that has random movements/actions</strong></li><li>Moving hero around and attacking</li><li>Unique time system where every action in game takes specific amount of miliseconds to finish and each of you turn is dictated by human reaction time.</li><li>Nice GUI controllable by mouse and by keyboard (WIP)</li><li>Placeholder art and sounds</li><li>Main theme music</li></ul>Do you have an idea in mind? That`s great!<p>If you have neat idea that fits well with the game you might see it on my TODO list. Be warned I have very strong vision of what Sleepless Temple should be, which means that I may not agree with you...</p><p>Best place to post your suggestions is Official subreddit or you can check my Trello Board to see what I am working on - maybe your idea is already there! </p>Modding?<p>Definitely, but not right now. As soon as any of planned features gets stable, I will move everything I can to csv files and share nice formatted template file with some tutorials how to use them. This will allow to add new content that doesn`t require any new code. After I hit 1.0 release I will work on adding custom dlls to game.<br/></p>You want to talk to me?<p>Feel free to contact me via mail (dagon()dagondev.com) or by any forum or social network from links you can find below.</p><p>I appreciate any feedback, suggestion or even hello message. :)</p>Links:<p><strong>My dev blog/Tumblr</strong></p><p><strong>Official subreddit</strong> (best place to leave your ideas and check existing ones)</p><p><strong>Trello Board </strong>(second best place to leave your ideas and check existing - you can leave comment)<br/></p><p><strong>Roguebasin page</strong></p><p><strong>Roguetemple forum topic</strong><br/></p><p><strong>Tigsource forum topic</strong></p><p><strong>Twitter</strong> (but not using it much)<br/></p>System Requirements:<ul><li>Graphics card: DX9 <strong>(shader model 2.0)</strong> capabilities; generally everything made since 2004 should work. (minimum Intel HD 4000) </li><li>OS: Windows XP+, Ubuntu 12.04+, SteamOS+</li><li>Minimum resolution: <strong>1024x768 (anything less will be scaled down and blurry)</strong></li><li>CPU: SSE2 instruction set support.</li></ul>Inspirations:<ul><li>Dark Souls I and II</li><li>Demon Souls</li><li>Sunless Sea</li><li>Frozen Synapse</li></ul>", "metacritic": null, "released": "2015-09-19", "tba": false, "updated": "2019-08-23T11:30:55", "background_image": "https://media.rawg.io/media/screenshots/c31/c311d9f25108fe4ba153cc82d97f9939.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Linux"], "developers": ["DagonDev"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}