{"id": 98679, "slug": "citrouille-itch", "name": "Citrouille (itch)", "name_original": "Citrouille (itch)", "description": "<p>\r\nCitrouille is an arcade platformer featuring adorable little witches on a quest for candy. Despite the childish appearance, the gameplay is merciless. There is no jump, you have to rely on your magic ladders, spells and power ups to get through. Brave the danger, face your nemesis, cover the world with flowers and claim the treats you deserve!\r\n</p>\n<p><strong>Story Mode:</strong><br/>Play as Praline or Vanille, the two main characters, through 50+ levels within 5+ unique worlds. If going through the quest on your own feels too hard, you can cooperate with a friend on a shared screen. But beware, for both players share the same life counter. Also, your spells and weapons make no difference between friends and foes.\r\n</p>\n<p><strong>Versus Mode:</strong> <br/>Two to four players can face each others on a shared screen. Anis and Reglisse, the two antagonists, are joining the fray to claim their share. There are two different modes with 5 unique arenas for each:</p>\n<ul><li>Death match: the last one standing wins</li><li>Time limit: the player with the most flowers on screen when the time is over wins\r\n</li></ul>\n<p><strong>Features:</strong>\n</p>\n<ul><li>Four playable witches, with a unique spell each\r\n</li><li>Cover the ground with flowers to win and charge your power\r\n</li><li>No jump, summon magic ladders to make your way through\r\n</li><li>Open surprise gift boxes to find deadly weapons and crush your foes\r\n</li><li>Cooperate with a friend in story mode or settle the score in versus mode on shared screen\r\n</li><li>A 30 minute-long story mode, if you don’t die, but you will…\r\n</li><li>Enchanting graphics</li></ul>", "metacritic": null, "released": "2018-08-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0f7/0f7ea0dc2dfb790f67a27a4b1658137e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Plug In Digital"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}