{"id": 9872, "slug": "the-hurricane-of-the-varstray-collateral-hazard", "name": "The Hurricane of the Varstray -Collateral hazard", "name_original": "The Hurricane of the Varstray -Collateral hazard", "description": "<strong>【About \"The Hurricane of the Varstray\"】</strong><br/>\"The Hurricane of the Varstray\" is a vertically scrolling shoot'em up with a SF story: in the distant future, to defend the Earth against the invasion of mystery mechanical structures, 4 girls head to \"the Varstray sector,\" far away from the Earth and considered as the villain.<br/><br/>This is the latest original work by \"Studio SiestA\" which produced \"The TOMBOYISHl☆WITCHES\" after an interval of 7 years, into which we exhaustively poured our long-held shooting game development know-how!<br/><br/><br/><strong>【Feature】</strong><br/>■Abundant in game mode <br/>・Arcade mode : basic mode with 12 stages total<br/>・Score attack mode : mode to compete on how much you can score within a certain time <br/>(This mode will be implemented with an additional free patch in early Jan.)<br/>・Story mode : mode to enjoy the story with voices attached to all the characters<br/>・Unlock mode : special mode which will appear when you fulfill certain conditions <br/>Additionally, you can freely select (by default) 1 character from among 4. Every character has different properties and you'll get a wide range of attack methods.<br/><br/>■Supporting English<br/>The game interface supports Japanese and English. You can also select subtitle language in \"Story mode.\" Therefore, English-speaking people can enjoy the game content exhaustively.<br/><br/>■Offering various download contents<br/>After the release of the main story, the successive provision of download contents such as additional modes or characters is scheduled; you can play it long time.<br/><br/>■Offering refreshed feeling for a wide range of users<br/>Various relief measures for beginners are ready to have them experience the same refreshed feeling as that of experts.<br/>Additionally, methods of operation are designed to be user-intuitive; anyone can enjoy the game right away.<br/><br/>For more information, please visit our website at<br/>http://varstray.com/<br/><br/>", "metacritic": null, "released": "2015-12-21", "tba": false, "updated": "2019-08-28T22:14:44", "background_image": "https://media.rawg.io/media/screenshots/e64/e64b68fc2962432329bc39b79a27e4a8.jpg", "website": "http://varstray.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 52, "toplay": 1}, "playtime": 5, "achievements_count": 68, "ratings_count": 2, "suggestions_count": 445, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Studio SiestA"], "genres": ["Action", "Arcade", "Indie"], "publishers": ["Rocket-Engine Co.,Ltd."], "esrb_rating": null}