{"id": 9876, "slug": "shock-tactics", "name": "Shock Tactics", "name_original": "Shock Tactics", "description": "Your team are the trailblazers for the first wave of Free Space Pioneers exploring a newly discovered alien planet. While searching the hostile world for alien technology you lead your team into tactical combat against pirates, alien creatures and the troops of the Imperial Consortium. Set up outposts and dig sites to exploit the secrets that this new world holds, in order stand against the incoming invasion. Everything is out there for the taking, but nothing will come free.<br/><br/><ul><li> <strong>Challenging squad tactics combat:</strong>Lead your strike team against smart enemies that employ a large array of tactics. Know your enemy, build a strategy, rule the battlefield.<br/>Strike team progression: Harness the power of the alien artifacts to upgrade your base, built new weapons and armor and train your soldiers with different abilities to fit your playstyle.<br/></li><li> <strong>Full Control:</strong> Action Points allow you to move your soldiers with full control and the interrupt system enables long sprints, that are stopped when new enemies are spotted, so you can assess the situation and spend your remaining Action Points accordingly.<br/></li><li> <strong>Aggressive Tactics:</strong> Always drop right into the action and bring the fight to the enemy before he can reinforce his positions. Play fast tactical assaults on time sensitive objectives and stay in full control.<br/></li><li> <strong>Hostile Planet:</strong> The procedurally generated world map leads to different strategic situations in each game session. Fight in three different environments of Hephæst to claim the alien artifacts.<br/></li><li> <strong>Fate of Hephæst:</strong> Experience a story revealing the secrets of the planet while the great factions steer towards a final battle deciding their fate in the galaxy.</li></ul>", "metacritic": null, "released": "2017-04-11", "tba": false, "updated": "2019-08-28T22:14:44", "background_image": "https://media.rawg.io/media/screenshots/b7f/b7f5df5f8bdb8b49ee4f647ceffb8860.jpg", "website": "http://www.shock-tactics-game.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 23, "playing": 1}, "playtime": 4, "achievements_count": 23, "ratings_count": 1, "suggestions_count": 532, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Point Blank Games"], "genres": ["RPG", "Strategy"], "publishers": ["EuroVideo Medien"], "esrb_rating": null}