{"id": 98761, "slug": "reflection-of-mine-itch", "name": "Reflection of Mine (itch)", "name_original": "Reflection of Mine (itch)", "description": "<p><strong>Reflection of Mine</strong> is a dark puzzle video game about the <strong>dissociative identity disorder</strong>. The entire game takes place in the broken mind of Lilly Witchgan and the goal is to discover who is real – Lilly herself or one of her many personalities. The plot will tell us about her many minds and how are they <strong>fighting each other.</strong></p><p>During the game, <strong>the player controls two characters</strong> at the same time and one of them repeats the actions after another. If the player turns left – both of the girls will go left, if the player turns right – both of them go right, if one dies – the other is <strong>buried with her.</strong> The difficulty is in finding the exit of the map, which is separated into two different parts. Maybe one of the girls will see only flowers in front of her, but that doesn't mean that there isn't a trap before her second personality. You will find a <strong>variety of traps</strong> that bring diversity into the game mechanics. <br/>Here, madness is represented as it really is – Lilly is a foreigner in her own body and her memory is broken into peaces by the other personalities. She can't remember many hours of her life, even days, months and years. Her live is a broken puzzle and we are here to help this girl.<br/></p><p>- More than 10 hours of gameplay.<br/>- Story driven psychological game.<br/>- 55 unique puzzles with big variety mechanics.<br/>- 10 stages of arcade mode.<br/>- Original soundtrack.<br/>- More than 10 unique personalities.<br/>- Perfect way to challenge your mind.<br/>- Use gamepad, keyboard, mouse or touch to play.<br/></p><p>The game was developed by one person – <strong>Slava Gris</strong> who combined his art skills with his knowledge of psychology and programming to bring to life Reflection of Mine. The soundtrack is provided by <strong>Expecte Amou</strong>r whose music inspired Slava to create this dark world of madness.</p>", "metacritic": null, "released": "2017-02-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e83/e8348a37d502a730f368cf7c88e7aefa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["RedBlackSpade"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}