{"id": 98787, "slug": "galaxy-brawl", "name": "Galaxy Brawl", "name_original": "Galaxy Brawl", "description": "Follow us on TWITTER.\r\n<p>\"TheGrimGhoul\" is a small team of only 2 people. </p>\n<p>We made our first steps in game dev by creating custom maps and mods for various games. Now we want to take it to the next level, since we have enough skills and tons of ideas for projects we’d love to bring to life.</p>\n<p>We are indie devs, not $ machine, 1st at all we are looking for feedback. ALWAYS.<br/></p>\n\n\n<p><strong>Galaxy Brawl is a Sci-Fi action game with classic elements of RPG/Strategy.</strong></p>\n<p><em>Feel the burden and face the challenges of a Space Pirate!</em><br/></p>\n<p><em>Discover a new galaxy, full of valuable resources and deadly dangers!</em><br/></p>\n<p><em>Slay your enemies, capture their resources, conquer the enemies' bases, lead one of the greatest clans, create your own “Star Gang”, customize your spaceship, calculate the strategies and earn the fame of the deadliest pirate!</em><em><strong>Galaxy Brawl is a mix of ARPG and H&amp;S genre, just in a sci-fi theme.<br/></strong></em></p>\n<p><em><strong>GALAXY MAP: Discover a large Galaxy with randomly generated events and as a result – endless gameplay.</strong></em></p>\n<ul><li>Step by step discover Galaxy sectors with playable stages.\r\n </li><li>You’ll have to risk your life if you plan to pick up some good stuff.</li><li>Pirate Fame is important. You can receive or lose some, when you are acting in the Galaxy.   </li><li>Not everything can be solved with brute force! Plan your resources to trade, raid, build and discover new sectors.</li></ul>\n\n<p><em><strong>BRAWL STAGES: Playable locations with different gameplay, such as brawling, object defense, escort, dueling, boss fights, raids… etc. </strong></em></p>\n<ul><li>Playable stages are always modified with affixes. You will have to adjust to certain encounters and use different strategies if you don’t want to fail miserably.</li><li>There are punishing mechanics and penalty for death… but if you take a risk and succeed – the reward will be generous!</li></ul>\n\n<p><em><strong>CUSTOMIZABLE SHIP: Customize your default spaceship with prime parts such as carcass, wings and turbo system.</strong></em></p>\n<ul><li>Switch between different primes to maximize turrets power.</li><li>Each prime is unique and contains special perks with node tree.</li></ul>\n\n<p><strong><em>CAPTAIN TURRETS: Equip deadly Captain Turrets that will grant you unlimited pirate power! </em></strong></p>\n<ul><li>Large amount of Captain Turrets with level progression and unique stats, mechanics, damage types and fire system.</li><li>All turrets can aim automatically or you can control them manually.</li><li>Turrets aren’t all-purpose. Some of them will be useless against a large number of fast enemies, but will be the best choice when fighting heavy units.</li></ul>\n\n<p><strong><em>PIRATE ORDERS: Choose unique abilities with different mechanics to crush your foes even more effectively. </em></strong></p>\n<ul><li>More than 20 abilities: shoot cannons and space rifles, summon allies and bunch of other things, that may burn, shock, explode and barbie-size your enemies. </li></ul>\n\n<p><em><strong>STAR GANG: Find and recruit most wanted pirates!</strong></em></p>\n<ul><li>Each Crewman has a unique perk with “game-changer” mechanics.</li><li>Crewman has different specialization that grants different bonuses to your turrets.</li></ul>\n\n<p><em><strong>PIRATE CLANS: There are “Iron Owls”, “Bone Bearers” and “Wolf Riders” pirate Clans across the Galaxy with their own pirate codex.</strong></em></p>\n<ul><li>Climb ranks, show your loyalty to the clan by carrying out pacts to increase your authority and get access to special bounties.</li><li>Each clan have a specific reputation and pacts.</li></ul>\n\n<p><em><strong>BUILDING: Help yourself to explore the Galaxy by building bases on the Global Map and in between the brawls.</strong></em></p>\n<ul><li>Your buildings will help you in different ways: increase your income, supply-loot, weaken your enemies, etc.</li><li>Collect resources by killing enemies and mining deposits.</li></ul>\n\n<p><em><strong>THEORYCRAFT:  Classic attributes and in depth mechanics – Join old school mechanics and theorycraft in general.</strong></em></p>\n<ul><li>Different damage, armor, status types, many classic mechanics such as stuns, disorients, “magic finds” and others combat feautres.</li><li>Node trees, items hunting, manage resources, high customization options and others.</li></ul>", "metacritic": null, "released": "2018-04-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d7b/d7b7cfd86114b9b659f9f7d93686d491.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TheGrimGhoul"], "genres": ["Action", "Strategy"], "publishers": [], "esrb_rating": null}