{"id": 98833, "slug": "the-chocolate-postulate", "name": "The Chocolate Postulate", "name_original": "The Chocolate Postulate", "description": "<p>Have you ever wanted to boost your reaction speed to get better at that one game?<br/>Have you ever had the desire to improve hand-eye coordination to help you in real life?<br/>Have you ever just wanted to keep yourself mentally fit? (Seniors here's looking at you!)<br/><br/>Have no fear. We are a team of three individuals from high school (DNK Studios), and are currently conducting independent studies in neuroscience. Having learned JAVA recently, we had a strong desire to help others and therefore created...<br/></p><p> <strong>The Chocolate Postulate</strong>: An open-source prototype of an experimental game designed to improve reaction speed, hand-eye coordination and mental sharpness through repeated play.</p><p>Our results were based on a statistical study on students and teachers in our high school. After 50 players volunteered to try out the game for a two week period for just 10-15 minutes a day, an overwhelming 92% of players reported that:<br/></p><p>1. Their reaction speed in regards to other PC games had a moderate to significant improvement.<br/>2. Their individual hand-eye coordination improved moderately. This was tested by giving players a ping-pong paddle and asking them to bounce a ping-pong ball upwards into the air as many times as possible. 74% of the players who reported their hand-eye coordination improved actually did improve in the amount of times they could bounce the ping-pong ball!<br/>3. Primarily teachers and adults reported that it helped their mental sharpness and alertness throughout the work day.<br/><br/>So what are you waiting for? Give The Chocolate Postulate a try! Also, if you would like to suggest anything for future updates, please feel free to leave a comment. Once again, this game is in it's early prototype stages, and is under constant development.</p>", "metacritic": null, "released": "2016-06-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/158/1580c175e230b716f70a5952dd7bc6ea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Android"], "developers": ["mahim"], "genres": [], "publishers": [], "esrb_rating": null}