{"id": 98836, "slug": "super-frogs-quest-itch", "name": "Super Frog's Quest (itch)", "name_original": "Super Frog's Quest (itch)", "description": "<p>Those who are fans of classic SNES and Genesis platformers such as Ristar, Dynamite Headdy, etc will enjoy this pleasant throwback. Inspired by the aforementioned games, this was the culmination of about one year of work by one guy to share this gift to other fans of old-school platformers, old and new. Take control of our brave frog hero and travel through nine unique levels. Gobble, spit, smack, zap and pound your enemies on your way to rescue your captive tadpole brethren. Will you be the one to take down the alien menace and save the day?<br/><br/><strong>FEATURES:</strong><br/>- Twelve different power-up abilites, each with their own unique play style.<br/>- Two players simultaneous co-op<br/>- Over 20 different enemies including flies, snowmen, robot ducks and fire-breathing dragons<br/>- Nine unique worlds to explore and challenging bosses to beat<br/>- Many coins and collectibles for completionists<br/>- Play the game and find out!<br/><br/>I would recommend using a controller, specifically a 360 controller, for maximum enjoyment. I mean, come on, you don't want to play a platformer with a keyboard, right? If you don't like the controller mappings, you may have to use Joy2Key to map to the correct buttons. Unfortunate, but those are my limitations.<br/><br/>Anyway, I truly hope you enjoy the game if you decide to pick it up! If you don't enjoy it, well, let me know what you didn't like and we can work something out. :)<br/><br/><br/><strong>HOW TO PLAY</strong><br/><br/>If using a 360 controller:<br/><br/>A - JUMP<br/>X - ACTION<br/>B - DISPOSE (of a power)<br/>Y - PAUSE<br/><br/>If not using a controller, you'll have to use the keyboard. The controls are:<br/><br/>X - JUMP<br/>C - ACTION<br/>Z - DISPOSE<br/>Enter - PAUSE<br/><br/>I haven't tested the game with other controllers or gamepads. Every controller has different mapped buttons, so if you don't like the button layout, you may just have to use Joy2Key. Perhaps in the future, I will update with an option to remap controls.<br/><br/><br/><strong>TWO PLAYERS</strong><br/><br/>A second player can join the quest by simply pressing the JUMP button on the second controller at any time during play. I wouldn't recommend using keyboard controls for both players unless you're fine with huddling around a keyboard with a friend.<br/><br/><br/>Good luck and have fun!<br/><br/><br/><br/>See you in cyberspace.<br/><br/>JC<br/></p>", "metacritic": null, "released": "2018-02-08", "tba": false, "updated": "2019-08-28T23:25:18", "background_image": "https://media.rawg.io/media/screenshots/5f9/5f95877d8b6d33cdcddd38614bfd546b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["James C Gray"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}