{"id": 98843, "slug": "rough-rush-alpha", "name": "Rough Rush [Alpha]", "name_original": "Rough Rush [Alpha]", "description": "<p><strong>Summary</strong><br/></p>\n<p>Rough Rush is an awesome endless runner with upcoming story, weapons, cars and robots! Experience an action-packed gameplay by blowing up robots and obstacles in your way!</p>\n\n<p><strong>Cont</strong><strong>rols</strong></p>\n<ul><li>Arrow keys to navigate</li><li>F to shoot and confirm</li><li>S, D to switch weapons and menu sections</li><li>A to repair a vehicle</li><li>Space to use turbo</li><li>ESC to pause the game</li></ul>\n<p><strong>Description</strong></p>\n<p>You are a driver warrior in a dystopian future, where robots have taken over cities that used to be inhabited by humans. You have been sent to explore one such place and destroy any hostile robot if necessary. Your goal is to take back the control of this robot city.</p>\n\n<p>You can play Rough Rush for as long as you like or you can advance through the game and unlock all 5 districts. Each district has its own mission.</p>\n<p>The gameplay is simple enough for anyone to just pick up the game and play -<br/>avoid obstacles, collect gears and shot/smash robots (which also give you gears). However, to get really good you have to develop your skill and use strategies.<br/>Rough Rush has different weapons with distinctive functionalities, different cars with varying properties and power-ups like turbo, flying, invisibility and shield. You can unlock cars and weapons and upgrade power-ups using gears. Furthermore, you can also fix your car on the go by using gears.<br/>All of this gives you a lot of freedom to accomplish the goals as you prefer.</p>\n\n<p>On top of the storyline missions, Rough Rush has quests you can collect during a rush trough the city. Complete these tasks to earn more gears.</p>\n<p>Since we are still working on the game, right now you can access only 1 district and there is no story yet. We appreciate any feedback and comments.</p>", "metacritic": null, "released": "2017-08-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d05/d052c823552e122d22c37482f7dadc00.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["rocknightstudios"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}