{"id": 98873, "slug": "total-smash-monster", "name": "Total Smash Monster", "name_original": "Total Smash Monster", "description": "<p>Go ahead with dogging and demolition monsters cars in this reckless racing game with fast speed and easy controls in the most intense array of annihilation.<br/>The art of Monster Smash game is to enter in a gameplay where you need to destroy Cars in a brand new concept in cars Racing Games. It's time to show your best ever driving tactics, Test your reflex and driving skills and smash up all of the Monsters cars in the ground. In the time of reckless race Go angry, chase enemy cars and crash them with your crazy racing car. Will you dare to undertake this demolition challenge? Where you have to supercross all of the limits and play against rc cars and many other crazy racing cars. Maximum Car crash is the main target to achieve so don't show mercy and crash all of them in your way.<br/>Total Smash monster is the racing game for those who are the best chasers and racers and accept the challenges of reckless cars racing.<br/>- REALISTIC DESTRUCTION<br/>Get ready to enjoy the thrill of crazy driving adventure in this thunder car driving game where you have to chase and crash others in the realistic display of destruction.<br/>- MONSTER GAME<br/>Smash more and more cars to earn money and upgrade your sports car to get ultra-maximum power. Destroy and crash minimum numbers of cars needed to complete a contest. Make use of handbrake to make tight turns in quest or for a last- second dodge.<br/>Features of Total Smash Monster <br/>- Crazy Car Stunts<br/>- Easy GUI and controls<br/>- Stunning 3D graphics with realistic crash and smash effects <br/>- Easy to play and realistic car handling Controls <br/>- Variety of Vehicles to choose <br/>- Different addictive racing Arenas to play<br/>- Thrilling and impressive gameplay<br/>- Realistic Cars physics and a dynamic damage system<br/>- Excellent visuals and a head-banging soundtrack<br/>- Total Wreckage<br/></p>", "metacritic": null, "released": "2015-10-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7d8/7d886334ddd8e3ca78a5754dfbcdb633.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["CogSoul"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}