{"id": 98895, "slug": "there-are-tourists-in-my-castle", "name": "There are Tourists in my Castle", "name_original": "There are Tourists in my Castle", "description": "<p>A Vampire Sandbox Adventure, made in 72 hours for Ludum Dare 33:</p>\n<p>Somehow, your castle became a tourist trap while you slept. This is a problem. What's worse, your bat friend has been scared away, and you've got to rescue him! What's a Vampire to do? You could avoid the sun and keep a low profile until you find your friend, but that might be hard. You could try to scare them off, or even make them into a quick snack, but that could make things even more hectic. Or you could just go find some dark corner of the castle to nap in until this blows over... I'm not your boss.</p>\n<p>CONTROLS: </p>\n<p>Move: Arrows, WASD <br/>Jump: Space <br/>Descend: Down + Jump <br/>Interact: Enter/Up/C/Y/Z <br/>Guard/Hide: Down <br/>Feed: V/X/F</p>\n<p>TIPS:<br/></p>\n<ul><li>Find your bat friend somewhere in the castle to win! </li><li>To fall through some platforms, crouch and press jump. </li><li>You're a Vampire, so stay out of bright light unless you want to be dust. </li><li>You can turn into a bat to jump in mid-air, but this will startle others. </li><li>Scaring or hurting other characters will cause panic to escalate, bringing in new and more dangerous NPCs. But it is fun. </li><li>Feed on other characters to recover lost health, and make a new friend! </li><li>You can change some background objects by pressing Interact near them (try this on curtained windows). </li><li>If you're in danger, you can hide in closets by crouching in front of them.</li></ul>\n<p>EDITOR CONTROLS: <br/></p>\n<ul><li>Left Click: Place a Walkable Path for all characters (Yellow). </li><li>Ctrl + Left Click: Place a Walkable Path for the player only (Green). </li><li>Shift + Left Click: Place a Vertical Limit/Ceiling (Cyan). </li><li>1-8: Place object type. Hold Shift to mirror object. </li><li>Tab: Test Game </li><li>Enter: Save Edited Level. *WARNING* Overwrites Local Level Data. Proceed at own risk!</li></ul>\n<p>CREDITS:</p>\n<p>MagmaMcFry: Game Design, Programming<br/>Solifuge (@Dahold): Level Design, Art, Audio</p>", "metacritic": null, "released": "2015-12-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0c4/0c43f3c8584179d828f607ea6ae635c0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Sunspider"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}