{"id": 98898, "slug": "historical-beef", "name": "Historical Beef", "name_original": "Historical Beef", "description": "<p>Historical Beef™ is a meat curation simulator featuring meat from game history. You play the protagonist, the meat curator, whose job it is to prepare museum displays of exquisite meats for public consumption (with the eyes, not the mouth). When your exhibit is opened, you arrangement of meats will be judged and graded.</p><p>Will your displays get the brisket, or be a load of tough rump?<br/></p><p>Created by Elliot Page and Hugh O'Brien in a confused haze.</p><p>Controls:</p><p>WASD / Arrow Keys: Move player<br/>Space: Jump<br/>Left mouse: Select things<br/>Esc: Menu</p><p>Click on a pedestal to choose a piece of meat to put there. Use your mouse wheel or drag the scroll bar to scroll through available meats.<br/>When you have finished your arrangement, click on the ribbon that is draped across the doorway to open the exhibit to judging.<br/></p><p>Damn Son, here comes<br/><strong>THE LORE DUMP</strong></p><p>The Near Future.<br/>Humanity, after vanquishing countless ills such as Cancer and Anime, has started to become more and more demanding in the arena of artistic entertainment.</p><p>The task falls to you as a well-known curator in the art world to satisfy the intense and fickle demands of the gallery-visiting public, not to mention critics.<br/>One of your most prominent clients has asked you for something fresh, something original, and you have been left stumped.<br/>Where else can you go after putting on such stellar displays as \"Thermal Paste + Verticality\" and \"Audio Equipment Fashion\"?</p><p>The answer comes to you at your darkest moment - walking home from the pub you are accosted and bitten by a rabid Double Dragon Arcade Cabinet, which scampers off into the night.<br/>Otherwise unharmed, you return home and are blighted by intense dreams while you sleep. Waking in a sodden bed, you realise you have found your answer.</p><p>Two words escape your lips, unbidden:<br/>Historical Beef.</p>", "metacritic": null, "released": "2016-12-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/699/69943808e5398a988a3895a17fb43636.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Questionable Systems"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}