{"id": 98901, "slug": "tiny-galaxy-the-do-over-beta", "name": "Tiny Galaxy: The Do-Over Beta", "name_original": "Tiny Galaxy: The Do-Over Beta", "description": "<p>\r\n\t*This is for the beta of Tiny Galaxy: The Do-Over featuring the 1st 10 levels.*\r\n</p><p>\r\n\tTiny Galaxy: The Do-Over will release summer 2016 on Xbox One, Nintendo Wii U and Itch.io as well as Steam GreenLight.\r\n</p><p>\n<br/>\n</p><p>\r\n\tTiny Galaxy is a 360-degree platformer that blends modern, gravity-defying jumps with a retro aesthetic. Follow Orion, a tiny blue sprite from a neighboring galaxy, on a voyage across space and time as he slays the jerks who stand between him and his prized headphones, stolen by the dastardly Big Metal Jerk. Traverse a network of wormholes spanning 8 distinct worlds and 96 levels, dodging all manner of sharp obstacles and doing battle with bosses that range from an angry buzz saw to a bloodthirsty ninja star! Tiny Galaxy: The Do-Over is a fully remastered edition of the underground Wii U hit, incorporating all-new art assets, cut scenes, bonus courses, and a brand-new EDM soundtrack for the Xbox One and Windows 10 releases.\r\n</p><p>\r\n\tControls:\r\n</p><p>Keyboard<br/>Left and right arrows to move<br/>Space Bar to jump/select<br/>Q to exit level</p><p>Game Pad:<br/>Left stick/d-pad to move<br/>A button/X button to jump/select - Xb1/ps4<br/>Back/View/Select to exit level</p><p>Please keep in mind this is a beta build of Tiny Galaxy and you<br/>may encounter errors or bugs. Not everything is finished yet,<br/>some music and sound effects etc... may be missing in this build.<br/>Feel free to email us any issues or bugs you encounter.<br/>hello@arcanepixelgames.com</p>", "metacritic": null, "released": "2016-05-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/891/8919d2f27d893b583cc2b87476ddac19.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Arcane Pixel Games"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}