{"id": 98930, "slug": "mastering-tedium", "name": "Mastering Tedium", "name_original": "Mastering Tedium", "description": "<p><em>Mastering Tedium</em> is a tongue-in-cheek laundry simulator.  A traditional text adventure in the spirit of games such as <em>ZORK</em> (1980), <em>MT</em> uses the regular chore of laundry to juxtapose life's necessity of action with the futility and impermanence of acting for those aware of their own mortality.  <em>MT</em> draws upon the prose of Portuguese writer Fernando Pessoa and his musings on the tedium of everyday life:<br/></p>\n<p><strong>Excerpt from Fernando Pessoa’s </strong><strong><em>The Book of Disquiet</em></strong><strong>:</strong></p>\n<em>It is said that tedium is a disease of the idle or that it attacks only those who have nothing to do. But this ailment of the soul is in fact more subtle: it attacks people who are predisposed to it and those who work or who pretend they work (which in this case comes down to the same thing) are less apt to be spared than the truly idle.</em>\n<em>Nothing is worse than the contrast between the natural splendour of the inner life, with its natural Indias and its unexplored lands and the squalor [...] of life’s daily routine. And tedium is more oppressive when there’s not the excuse of idleness. The tedium of those who strive hard is the worst of all.</em>\n<em>Tedium is not the disease of being bored because there’s nothing to do, but the more serious disease of feeling that there’s nothing worth doing. </em>\n<br/>Can the task of laundry, with its unending pressure—forever looming, ever truly be completed?\r\n\n<p>⟳⟳⟳⟳⟳⟳⟳⟳⟳⟳⟳⟳⟳⟳⟳⟳⟳⟳⟳⟳⟳⟳⟳⟳⟳⟳⟳⟳⟳<br/></p>\n\n<p><em>Mastering Tedium</em> and <em>Mastering Tedium 2</em>* are played in unix-style terminals and feature the most cutting edge ANSI art graphics of 1986.  Understimulating and devoid of conventional visual attractiveness, the world offered by <em>MT</em> is basic and functional. Players are faced with text prompts and input verbal commands, allowing them to interact with and navigate the textual world.  A typical playthrough lasts less than 15 minutes. </p>\n<p><strong>*</strong><em>Mastering Tedium 2 is an update to Mastering Tedium featuring improved graphics, bug fixes and is not a true sequel.</em></p>\n\r\nARTISTIC INTENT (spoilers below)\r\n<p>While brainstorming new game concepts, no idea seemed worth executing, so I did what I always do and went ‘meta,’ creating a representation of that pessimistic perspective and the perceived futility of action in the face of impermanence. Players are provided with a glimpse into this mindset through the sisyphean task of doing laundry, drawing upon Pessoa’s writings on tedium and his own mundane experience of life.  <br/></p>\n<p>The decision to create a classic terminal-based game was driven by a desire to appropriately reflect this experience of the world.  Games and digital media often entertain users through engaging in simple pleasures, which are regularly dismissed as being ‘pointless wastes of time’.  Yet, similar to literature and writing, they provide both a necessary form of imaginative exercise and a safe space from which to explore, always serving to reflect aspects of the world in which they are created.  Hopefully, <em>MT</em> will allow players to better contemplate their own personal search for meaning when faced with feelings of futility and pessimism.</p>\n<p>While playing the game, players are presented with a description of their surroundings and/or suggestions for potential actions to enter into the space below. Although the player is initially presented with some illusion of choice in commands, the programming pushes the user along a single convergent path regardless of their wishes.  Playful interactions and imaginative possibilities are suppressed throughout this progression, replaced by unthinking mechanics stripped of everything in search of the ‘correct’ command to advance the narrative. Once the game is completed, the player starts again from the beginning, their actions nullified by time and the social demands of personal hygiene.<br/></p>\n\r\nON INNOVATION\r\n<p><em>Mastering Tedium</em> revives this classic genre, breathing new life into it by contrasting this with a younger, more contemporary milieu and Pessoa’s early 20th century prose. <em> Mastering Tedium</em> innovates in a field of ever improving AAA graphics and increasingly captivating indie art and sound by stripping the game down to the basics, in stark contrast to the prevailing game culture. These trends even pervade contemporary interactive fiction, which increasingly  incorporate images, CSS animations and sound.  <em>Mastering Tedium</em> uses this classic utilitarian format in the hope that its stripped aesthetic ironically proves to be novel for players unfamiliar with the genre and nostalgic for those that are.<br/></p>", "metacritic": null, "released": "2016-01-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/123/1237f0be1f887de8a747986102294a4b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Juno AM"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}