{"id": 98944, "slug": "late-night-chef-ludum-dare-version", "name": "Late Night Chef [Ludum Dare Version]", "name_original": "Late Night Chef [Ludum Dare Version]", "description": "<p><strong>NOTE - We're working on a polished version of the game! </strong></p><p><strong>This is the Ludum Dare editon of the game, we're working a lot on a new version of Late Night Chef, and we hope to have something to share with you soon.<br/></strong></p>\n<p><strong>New Chefs wanted:</strong></p>\n<p>Looking for an experienced chef to take on the night shifts. Must be enthusiastic and willing to take on new experiences, and keep calm under high pressure situations.<br/>Shifts will begin at 12 PM, and finish at 6 AM every night.</p>\n<p><strong>Requirements:</strong><br/>- Following health and safety standards, as to not provoke the local health inspectors<br/>- Keep customers happy by serving food as soon as possible<br/>- Serving whatever the customer wants</p>\n<p><strong>Chef should be able to prepare the following items with ease:</strong><br/>- Pancakes<br/>- Burgers<br/>- Coffee</p>\n<p>Please direct all inquiries to 0800░░░░░ <strong>or</strong> ░░░░░@░░░░.com</p>\n<p><strong>Some Game Tips</strong>:</p>\n<p><strong>Movement:</strong><br/>Pressing [A] will take you to the stove, Pressing [D] will take you to the counter, Pressing [S] will allow you to Hide and access cups and the phone.</p>\n<p><strong>Cooking:</strong><br/>The 3 eggs on the far top left, use them with the pan to make the pancake! <br/></p>\n<p>The burger can be served raw, however this will make the game harder the more you do this. Make sure you cook them to prevent this! <br/></p>\n<p>The Coffee cups are stored under the counter, hold the coffee machine till it stops, and then click the cup again to give it to the customer.</p>\n<p><strong>Stages:<br/></strong>There are 4 shifts to play! All stages but the last will introduce something new. The last is over-time, which is the hard mode of the game. <br/></p>\n\n<p><strong>DISCLAIMER</strong>: Contains jump-scares and some potentially disturbing pixels.<br/></p>", "metacritic": null, "released": "2017-12-04", "tba": false, "updated": "2019-08-28T23:25:18", "background_image": "https://media.rawg.io/media/screenshots/fea/fea297a67b2bab65bac7c9b71132699e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Newhia"], "genres": [], "publishers": [], "esrb_rating": null}