{"id": 98990, "slug": "golden-hour", "name": "Golden Hour", "name_original": "Golden Hour", "description": "<p>We are on Kickstarter! Help bring the full game to life by checking it out, pledging, or sharing about us! <br/><br/><br/><br/>This game is a demo covering the first day of Golden Hour! For the full game, each route will last 10 days and will be playable on iOS and Android.<br/></p>\n<p>Please join us on Discord to meet the game developers (we're very friendly!), and give feedback on any bugs or your overall experience of the game! https://discord.gg/Vb5ehtg</p>\n\n<strong>Overview</strong>\n<p>A young woman transfers into a new school in her mother’s distant hometown just as the term is nearing its close. She finds herself caught up in a whirlwind of activity leading up the school’s annual Festival of Lights.\r\n</p>\n<p>Amidst a tangle of friendships, rivalries, courtships and conflicts she comes to learn the dreams, joys, fears, and foibles of those close to her—and must confront her own, as well. Will her choices lead them to a new light? Or sink them deeper into the dark?</p>\n<ul><li>Four romantic interests, each with their own multiple-ending storylines\r\n</li><li>Multiple illustrated (CG) scenes per storyline\r\n</li><li>Built-in guidebooks to the world of Golden Hour and the protagonist’s school</li></ul>\n<strong>Main Characters</strong>\n\n<p><strong>Isanagi Ayara </strong>| Second Year | Student Council</p>\n<p>Isanagi Ayara—Nagi, as he prefers to be called—is the second son of the illustrious Ayara family, who halfway own the city and everyone in it. His lineage is both blessing and curse, and Nagi is determined to chart his own path, proving he’s more than just a second son.</p>\n<p><strong>Kouya Ibara</strong> | Second Year | Discipline Committee</p>\n<p>With fiery hair, a cold glare, and countless cuts and bruises as his signature, Kouya has a reputation for delinquency. There’s more than meets the eye, of course, but no one knows what exactly that “more” is.</p>\n\n<p><strong>Rui Ferreira </strong>| Second Year | Soccer Team</p>\n<p>Although he only recently moved in from Brazil, Rui’s already everyone’s best friend. Renowned as the school’s—no, the city’s star player, he tries to keep his otaku side hidden deep in the closet. Too bad the closet’s too full of merch already.</p>\n<p><strong>Solomon Lee</strong> | First Year | Literature Club</p>\n<p>The son of a preacher man, Sol’s God-given talents in the arts, especially music, were nurtured throughout his childhood. But both angel and devil sit at Sol’s pink-sweater-clad shoulders and he plays their tunes in equal measure.</p>\n<strong>Narrative Modes</strong>\n<p><em>Golden Hour</em> has two main gameplay modes.<br/></p>\n<p><strong><em>Visual Novel Mode</em></strong>\n</p>\n<p>Put yourself in the protagonist’s shoes: make the right choices and you just might have a happy ending come festival time!</p>\n\n<p><strong><em>SNS Mode</em></strong></p>\n<p>See what’s going on in the school through its exclusive student network. What happens online doesn’t always stay just online.</p>\n<strong>Rival Stories</strong>\n<p>It’s not all about the boys.\r\n</p>\n<p>The protagonist needs female friends, too, and her choices will affect their lives as well. Depending on those choices, her friends might get happy endings of their own or…well, stop being her friends.\r\n</p>\n<p>The triumphs and travails of our heroine’s friends-slash-rivals unfold throughout the four main storylines.</p>\n<strong>Supporting Characters</strong>\n\n<p><strong>Elias “Sir San” Crisanto </strong>| Teacher | Visual Culture Club Moderator</p>\n<p>Just who is this eccentric teacher? The truth may be forever hidden behind his shutter shades. Either way, “Sir San,” as he is fondly called, is popular among the students for his easygoing attitude and genuine concern for the whelps he calls his own.</p>\n<p><strong>Mayumi Ayara</strong> | First Year | Fine Arts Club\r\n</p>\n<p>The youngest child and sole daughter of the Ayara family, Mayumi must deal with the venomous infighting of her family and the bleak prospect of a political marriage. But as they say, it is in adversity that strength blooms.</p>\n\n<p><strong>Reina Aranetta</strong> | Second Year | Student Council</p>\n<p>Known throughout the school for her intelligence, elegance, and uncompromising ambition, Reina is poised to take the Student Council’s top seat from Nagi. She’s also his erstwhile and unknowing rival in near everything else.</p>\n<p><strong>Iris King | </strong>First Year | Drama Club</p>\n<p>She might be a diva of deception, but King—there is no “Iris”—strongly prefers the direct approach. Except, of course, in matters of the heart. And while half the school’s boys are after her, she only has eyes for one.</p>\n<strong>Demo + Discord</strong>\n\n<p>Golden Hour’s playable demo, covering the first day of the story, has its own playtester community!</p>\n<p>If you want to stay up-to-date, give feedback,  or just talk to us about Golden Hour, join us here:</p>\r\nhttps://discord.gg/Vb5ehtg", "metacritic": null, "released": "2018-05-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7da/7da8cf2f71657ddc9a984b019f9fcdc7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Matchaa Studio"], "genres": [], "publishers": [], "esrb_rating": null}