{"id": 9899, "slug": "aquanox-deep-descent", "name": "Aquanox Deep Descent", "name_original": "Aquanox Deep Descent", "description": "<p>Aquanox Deep Descent is a first person underwater vehicle shooter, in which players control a variety of customizable ships to engage in fierce battles in the dystopian deep sea world of Aqua.<br />\nIn the near future the Earth&#39;s surface has become uninhabitable. What remains of humankind lives in former mining and research stations, deep below the surface of the sea. Born and raised in the only world we know, the loose network of underwater settlements, torn by the war for resources and dominance between various factions.<br />\nTake control of a team of highly trained fighter pilots and experience an epic story in the dark world of Aquanox. Send your enemies down to Davy Jones&#39;s Locker with well-aimed torpedoes, mortars, mines and more. Explore the deepest corners of the oceans - mysterious, hazardous, uncharted.<br />\nFight - Action-packed vehicle shooter combat that supports a wide variety of play styles<br />\nCo-op - 4 player drop-in co-op, with four unique pilots who are all involved in the game story<br />\nCustomize - Create your ship from an extensive range of ship pieces and various customization options<br />\nExplore - Discover the deepest corners of the ocean<br />\nRPG Elements - Mining, salvaging, trading and looting<br />\nPVP - Classic multiplayer modes, including Deathmatch and Team Deathmatch Dogfighting<br />\nThe Original Series<br />\nAquanox Deep Descent is a re-imagining of both the gameplay and world of the original AquaNox-series. The Aquanox-series has its roots in the game Archimedean Dynasty (German: Schleichfahrt), released in 1996, which was followed by AquaNox in 2001 and AquaNox 2: Revelation in 2003.<br />\nAll games are vehicle-based shooters set in a dystopian future where mankind has had to flee the surface and live in underwater stations in the oceans.<br />\nThe AquaNox games were powered by the groundbreaking KRASS Engine that lead to the popular benchmark AquaMark.</p>", "metacritic": 65, "released": "2020-10-15", "tba": false, "updated": "2023-04-25T01:29:37", "background_image": "https://media.rawg.io/media/games/ee2/ee266b77b44ff50c0c9d855ce2cb6ee5.jpg", "website": "http://www.aquanox.com/", "rating": 1.92, "rating_top": 1, "added_by_status": {"yet": 11, "owned": 208, "toplay": 16, "dropped": 7}, "playtime": 1, "achievements_count": 31, "ratings_count": 12, "suggestions_count": 261, "game_series_count": 0, "reviews_count": 12, "platforms": ["PC", "PlayStation 4", "Xbox One"], "developers": ["Digital Arrow"], "genres": ["Action", "RPG", "Simulation"], "publishers": ["THQ Nordic"], "esrb_rating": null}