{"id": 99042, "slug": "dimlit", "name": "Dimlit", "name_original": "Dimlit", "description": "<p>Dimlit is a Roguelike game played in the terminal with ASCII graphics. You play as a Sage surviving in an apocalyptic world consumed by infinite darkness populated by grues. Your only defense against them and the oppressing darkness are crystalline structures you build, some of which provide light.<br/></p>\n<p> <strong>You — The Sage</strong></p>\n<p>You are a sage. You cannot attack and you die instantly by any grue attack. You can hold off attacks in the darkness  for a short while  with your glow suit, but it can only be powered at a functioning  crystalline structure. Your glowsuit is your life in the darkness.</p>\n<p>You start off in the center of an infinite map of darkness, with  a single crystalline structure next to you providing light. To keep yourself alive you must build more of these structures with crystals found only in the darkness.</p>\n<p><strong>The Crystalline Structures</strong></p>\n<p>Crystalline Structures are essential to the survival of the Sage. You must build more if you wish to survive. You will experience darkness surges and grue attacks which can leave you stranded. The events and attacks cannot be prevented, you must be prepared to survive.</p>\n<p>Some structures require power, specifically tech upgrade structures and more advanced structures. You start off with the ability to build a basic power-providing structure  aptly named \"Power Structure.\" It provides one power to a structure it links to directly next to it (horizontally/vertically).</p>\n<p>Power structures are not the only structures that have links. Explore different structures by unlocking them.</p>\n<p><strong>The Light</strong><br/></p>\n<p>Light is essential. Without it your glowsuit loses and power and you will succumb to the darkness and the grues. A larger network of light gives you a safe place to run if a storm or grue takes out your nearby structures.</p>\n<p> <strong>The Darkness</strong></p>\n<p>The darkness is infinite, and becomes more oppressive after each turn. The grue population is continuously increasing and dark surges and storms put your protected structures at further risk. </p>\n<p><strong>The Grues</strong><br/></p>\n<p>Most grues avoid any and all light, however there are some which can withstand the light for a short while to take out structures or attack you. Grues can  and should be killed by late game structures. If they aren't, more of them attack you. </p>\n<p><strong>The Goal</strong></p>\n<p>The goal is to survive for as long as possible.</p>\n<p><strong>Controls</strong><br/></p>\n<ul><li>Sage<ul><li>Move — HJKL, arrows</li><li>Wait — Period</li><li>Action — Space</li></ul><ul><li>Interact with Structure — Bump into it</li></ul></li><li>Menus / Structure Menus<ul><li>Select — Space, L</li><li>Back — Escape, Q, H</li><li>Up/Down —JK</li></ul></li><li>General<ul><li>Quit — Escape, Q</li></ul></li></ul>\n<p><strong>Gameplay Tips</strong><br/></p>\n<ul><li>Keep your glowsuit charged! It's your only shield against grues and decreases in the dark. Any light providing structure can charge it.</li><li>Collect crystals to build more structures.</li><li>Build light to find more crystals deep in the darkness.</li><li>Some structures require light to function in addition to power, some don't.</li><li>Unlock new structures by powering tech structures.</li><li>Hampered structures only last as long as the storm does. Wait it out.</li><li>Structures damaged by grues can be repaired.</li><li>Lit up structures are functioning.</li><li>Late game you may need to hold onto crystals for an emergency charger or light source.</li><li>Sound only <strong>works</strong> on Mac OS X 64-bit.</li><li>You can <strong>disable sound</strong> by renaming the \"data\" folder to something else.</li></ul>\n<p><strong>Have fun!</strong></p>", "metacritic": null, "released": "2018-03-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5c7/5c78a963b7035c5a88f9abc42eb6b18c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["gruebite"], "genres": [], "publishers": [], "esrb_rating": null}