{"id": 99133, "slug": "insignia-demo-alpha", "name": "Insignia - Demo Alpha", "name_original": "Insignia - Demo Alpha", "description": "<em>Mac Version coming soon!</em>\n\r\nA Classic Adventure\r\n<p>Over a hundred years have passed since the last great war among kingdoms. \r\n<br/>\r\nIn this time of peace, men of practical trades are sanctioned to take up wares and travel the land as merchants. Armin's father was one such man, a renowned blacksmith who disappeared on an excursion just one year ago. Now, having come of age, Armin must accept his fate as the only successor to the craft in his home town of Ohrenstead.\r\n</p>\r\nCharming 16 bit graphics\r\n<p>Explore a colourful world of beautifully animated pixel art, harkening back to the golden age of 2D games. With hand drawn frame-by-frame sprites and gorgeously expansive tile-sets, playing Insignia will have you reminiscing about blowing on plastic cartridges and calling expensive hotlines for hints, no time machine required!\r\n</p>\n\r\nGripping Action Combat\r\n<p>Dive into an easy to learn, hard to master combat system that combines the twitch tempo of modern action games with the deep customisation of an RPG. Discover and forge new gear and abilities into Armin's reportoire to become a legendary fighter of your own design.</p>\n\r\nA story to remember\r\n<p>\r\nAccompany Armin through a rich fantasy world full of treacherous foes, valuable treasure and a wealth of secrets. Meet lovable characters and encounter wicked villains as Armin faces the fate of his lost father and the usurption of the kingdom he calls home.\r\n</p>\n\r\nSupport the development\r\n<p>While Insignia is in active development, the project is yet unfunded. If you enjoy the demo and believe in this project, consider becoming a supporter by offering a price above or subscribing on twitch or joining our discord.</p>\n\r\nMore on the official website!", "metacritic": null, "released": "2018-07-13", "tba": false, "updated": "2019-08-28T23:25:16", "background_image": "https://media.rawg.io/media/screenshots/f2e/f2e4297249d7393aacc684c5ccc2ca97.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Uppon Hill"], "genres": ["Action"], "publishers": [], "esrb_rating": null}