{"id": 9917, "slug": "vector-36", "name": "Vector 36", "name_original": "Vector 36", "description": "<strong>Vector 36 is  Physics-Based Racer set on the terraformed surface of Mars.  You pilot a Skimmer, a completely customizable, surface skimming vehicle.  With total control over every component, you are responsible for how your Skimmer performs.  Piloting skill and engineering make the difference between winning and losing. </strong><br/><br/>Race other pilots through various tracks on Mars.  Compete in Sprint, Circuit, or Tournament modes to win credits, parts, or new Skimmers.  Race your friends through Vector 36's amazing ghost replay system.  Take on the world with Global Leaderboards.  Push your machine to the limits until you are the fastest settler on Mars.<br/><br/><br/><br/>Each part of your Skimmer is bound by the laws of physics. Moving internal components will shift the center of gravity, adjusting angles to thrusters will affect its flight characteristics. <br/> <br/>Fine tuning is the difference between winning and losing.  Choose from a wide selection of parts, accessories, passive weapons, or support gear to adjust your Skimmer to its task. Whether it's a quick sprint at full boost, an endurance race with hardened parts, or a hill climb where lift is more important than thrust; evolve or get left behind.  <br/><br/>Witness new skimmers, tracks, obstacles, support bots, parts, weapons, opponents and game modes. Vector36 will be growing over time. <br/><br/>Supports HTC Vive and Oculus Rift.  No VR? No problem. Vector 36 still plays seamlessly on your PC Monitor. Vector 36 also now supports Track IR.", "metacritic": null, "released": "2017-01-25", "tba": false, "updated": "2019-08-28T22:14:43", "background_image": "https://media.rawg.io/media/screenshots/91d/91dc83d7904192ba605d30234fcf6596.jpg", "website": "http://www.vector36.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 13, "toplay": 1, "dropped": 1}, "playtime": 3, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 540, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC", "Linux"], "developers": ["Red River Studio"], "genres": ["Action", "Simulation", "Racing", "Indie"], "publishers": ["NA"], "esrb_rating": null}