{"id": 9920, "slug": "war-for-the-overworld", "name": "War for the Overworld", "name_original": "War for the Overworld", "description": "<strong>Tired of invading dungeons? It's time you built your own!</strong><br/><br/>Do you feel you are in a slump? Monotonously disembowelling evil guys in endless quests for gold and a slightly better pair of boots? You are starting to wonder... are heroics really your calling? Welcome to the War for the Overworld! <br/><br/>War for the Overworld is a Dungeon Management Game that employs your favourite aspects of the RTS and God Game genres. You play an all-powerful, malevolent Underlord, long banished to the Aether. With unrivalled dark power and an insatiable desire for bloody conquest, you will arise once more, and reclaim your realm! <br/><br/>In your absence, the Underworld lost its way. It became feeble and afraid of the Empire of the Overworld, which grew strong and boldly comfortable in its quiet retirement from evil-slaying. Carve out your dungeon from the soil and stones of the Underworld, and build dozens of unique rooms to attract a myriad of creatures to your halls to work and fight for you. <br/><br/>In addition to your faithful followers, you have destructive spells and powerful rituals to cast upon any unsuspecting goodly Hero (or rival Underlord) who dares to breach your unhallowed halls. With your unmatched dark powers and mighty army of bloodthirsty minions, you are ready for your War for the Overworld!Key Features<ul><li><strong>Build Your Dungeon</strong> - Excavate and build your dungeon beneath the earth of the Overworld. Design its layout as you see fit, creating an underground fortress filled with a wide variety of rooms, each with a unique use and purpose. <br/><br/></li><li><strong>Evil Is Back</strong> - Play as an Underlord who has awakened from a deep slumber after countless years drifting in the Aether. This realm hosts a variety of enemies — both Heroes and Underlords will stand  in your path as you fight for dominance of the Overworld.<br/><br/></li><li><strong>Veins of Evil</strong> - Choose from over 60 rooms, spells, potions, rituals, defences and constructs in the Veins of Evil as you progress through the game. There are a plethora of possible Vein combinations you can use to conquer the Overworld. Create your own unique flavour of evil! <br/><br/></li><li><strong>Fortify Your Domain</strong> - Build a wide variety of defences within your walls to defend against — and destroy — those who seek to invade your domain. <br/><br/></li><li><strong>Cast Wicked Spells</strong> - Call down  unholy magic to strengthen your dungeon, rout enemy forces, flood corridors with Micropiglets, or simply turn a meddlesome Hero into a geyser of giblets. <br/><br/></li><li><strong>Unleash Devastating Rituals</strong> - Punish your foes or empower your own forces with game-changing Rituals that can do anything from raising an undead army, to instantly fortifying your entire dungeon. <br/><br/></li><li><strong>Command Powerful Minions</strong> - Over 20 minions await your call, and will gladly work and fight under your banner... if you provide them with all the creature comforts they demand. <br/><br/></li><li><strong>Conquer the Overworld</strong> - Play through a feature-length campaign, facing off against the Emperor of the Overworld as you fight for complete supremacy in the Realm of Kairos.<br/><br/></li><li><strong>Destroy Your Rivals</strong> - Take the fight to your rival Underlords in Skirmish or Multiplayer matches with up to four players.<br/><br/></li><li><strong>Challenge Ruthless AI</strong> - Team up with a friend or fly solo and challenge devastatingly sophisticated AI Opponents in Skirmish or Multiplayer!<br/><br/></li><li><strong>Shape the Underworld</strong> - Create entirely new levels in the Map Editor and share them with other Underlords via the Steam Workshop!<br/><br/></li><li><strong>Test Your Mettle</strong> - Run the gauntlet of the Crucible mode and see if you can top the high score against waves of enemies!<br/><br/></li><li><strong>Gameplay Mutators</strong> - Tweak every possible setting to create and save custom game types.<br/><br/></li><li><strong>Community Translation Support</strong> - So you can bring War for the Overworld to other Underlords across the Underworld.<br/><br/></li><li><strong>Richard Ridings</strong> - The entire game is supported by narration, tutorials and status updates from the original and best dungeon mentor, Richard Ridings!<br/><br/></li><li><strong>Massively Improved</strong> - Tons of improvements, rebalancing, bug fixes and polish since the original launch!</li></ul>", "metacritic": 65, "released": "2015-04-01", "tba": false, "updated": "2024-04-06T11:54:06", "background_image": "https://media.rawg.io/media/screenshots/2a7/2a780e763065c940130264772725b52a.jpg", "website": "http://www.wftogame.com", "rating": 3.06, "rating_top": 4, "added_by_status": {"yet": 69, "owned": 982, "beaten": 16, "toplay": 7, "dropped": 23, "playing": 7}, "playtime": 5, "achievements_count": 135, "ratings_count": 64, "suggestions_count": 651, "game_series_count": 0, "reviews_count": 67, "platforms": ["PC", "Linux", "macOS"], "developers": ["Brightrock Games"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Brightrock Games"], "esrb_rating": "Teen"}