{"id": 99223, "slug": "tombs-of-temeria", "name": "Tombs Of Temeria", "name_original": "Tombs Of Temeria", "description": "<p>Tombs of Temeria is an in-development game exploring procedural content generation as a game mechanic. Deep below the ruined city of Temeria lies the intricate passageways of its crypts and burial chambers. Your whole life you've dreamed of exploring them, and now you're finally getting your chance! As the game develops you'll uncover treasure, stumble across dangerous traps, and find ways to bend the tombs of Temeria to your will.</p><p>Right now, the game is in a very early prototype stage, but if you want to you can take a peek and play around with the game. The levers control the procedural generator, tweaking parameters and letting you control the level design. A red arrow at the edge of the screen points towards the exit.</p><p> The controls:</p><p><strong>Arrow Keys</strong> - Movement</p><p><strong>Spacebar</strong> - Jump (you can double-jump in the current build)</p><p><strong>Up Arrow</strong> - Pull lever</p><p><strong>Q</strong> - Skip Level (our level designer isn't perfect yet, and makes lots of mistakes!)</p><p>Throwing levers causes the level to shift and change, but the effect is always reversible. Experiment with the levers to discover new areas of the level! A quick tip: flipping a lever left usually removes tiles, flipping it right usually adds them.</p><p>Comment below to let me know what you think! I'm hoping to incorporate this game into my research in 2017.</p>", "metacritic": null, "released": "2015-08-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/74c/74c917564cdc63dfa317d9b9449da2c1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Cut Garnet Games"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}