{"id": 99264, "slug": "eat-the-king", "name": "Eat the King!", "name_original": "Eat the King!", "description": "<p>Steve is, unfortunately, a zombie. And, like most zombies, he's hungry. He's got the world's biggest craving for some juicy brains, and only one brain in the realm will do...the brain of the king himself.</p>\n<p>Guide Steve and his similarly life-inhibited compatriots through tactical battles, utilising dark magic and feral claws to infect the land of Lyonica. Inspired by Fire Emblem, Final Fantasy Tactics Advance, bad attempts at humour and of course, the theme of the game jam this was created for, Eat the King! is a bite-sized, cutesy strategy RPG you can play in under an hour.</p>\n<p>Features:</p>\n<p>- Brand new graphics: not a hint of the usual RPG Maker graphics in sight!</p>\n<p>- Tactical gameplay: learn how to best utilise your team of undead to accomplish their dark deeds.</p>\n<p>- Irreverent humour: I'm a pretty dumb person and so are my jokes (although it should be noted that \"irreverent\" doesn't mean \"offensive\" - no four-letter words here).</p>\n<p>- Loads of British slang: if you're not from my neck of the woods and you've ever wondered what a berk, or a tosser, or a prat is, this game won't teach you! But they're in there, cause some words are just inherently funny to say.</p>\n<p>---------------------------------------</p>\n<p>This game was created in under 4 days for the RPG Maker Jam #3. It's the first time I've ever released a game, and hopefully some of you think it's decent!<br/></p>", "metacritic": null, "released": "2018-07-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/42b/42b74a3af6415cbe12d2c0dac7aef6b6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["onipunk"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}