{"id": 99283, "slug": "ascendants-power-rising", "name": "Ascendants: Power Rising", "name_original": "Ascendants: Power Rising", "description": "<p>The long-lost ascendants are back. But what is this? They are an enemy now? They even ascended themselves! Discover what lies beyond this mystery. Collect all the elemental orbs that re-emerged and use them to re-create the Ascension Orb. Your enemies are ascended, it's time that you ascend too.</p>\n<p>GAME FEATURES:<br/>- Classic RPG!<br/>- Explore the vast world of the ascendants!<br/>- Discover secret dungeons and find hidden treasures!<br/>- Search for Mystic Fruits that permanently increases hp when consumed!<br/>- Travel through the land and the sea!<br/>- Climb mountains, explore mysterious caves, survive in a jungle, cross a desert, stay cool in scorching lands, and many more!<br/>- Use a Teleport Scroll to instantly travel in different places!<br/>- Complete Quests that are filled with adventure, mysteries, and thrilling battles!<br/>- Hunt for monsters that have the ingredients to Craft items, weapons, and armors!<br/>- Set bonus, rewards using a complete set of equipment! Each set of equipment have unique Set bonus that provide unique effects!<br/>- Each skills are unique!<br/>- You will never spam just one powerful skill, you need different kinds of strategy in every battle!<br/>- Each monsters have their own skillset too! And they have a smart AI! Making battles more challenging!<br/>- Watch your health bar at all times because in every battle, you don't just attack, you need to think of your defense too!<br/><br/><br/></p>\n<p>Found a bug?<br/>Email us at ascendants.quelgames@gmail.com</p>", "metacritic": null, "released": "2017-06-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/537/53727e1531c6346c476e63f430238bc6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 324, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["QueL Games"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}