{"id": 9935, "slug": "soldiers-arena", "name": "Soldiers: Arena", "name_original": "Soldiers: Arena", "description": "<strong>Soldiers: Arena</strong> will take you to the battlefields driven by the largest and bloodiest conflict of all time - World War II. This is the height of war, this is the time for real heroes. <br/><br/>Both new and already battle-proven multiplayer gamemodes to the original tactical gameplay are waiting for you. Interactive destructible environments and the ability to direct-control any combat unit. Steam support: matchmaking, workshop, steamcloud. Redesigned graphics, models and special effects. Conceptual new interface and convenient control, new battlefields and new opportunities.Features:<ul><li>Revival of the “Men of War/Soldiers” game series. This multiplayer tactical RTS absorbed the best of the original series, favourite of players all over the world.<br/></li><li>Huge roster of units. Within a single game session, players will have access to a large number of unique units for every nation: tanks, vehicles, infantry and artillery of various types.<br/></li><li>The “Direct Control” mode. This mode provides the ability to play from the third person for any unit in the player’s army. The movement of the unit, firing the various guns, control of ammunition types, etc. all relying and directly controlled by player and thus the game conveys tactical action in it’s very essence.<br/></li><li>Destructible interactive environments. During the battle almost any object of the game can be destroyed or set on fire. Furthermore, all objects, including craters from explosions, may be used as cover.<br/></li><li>Atmosphere and realism. Even in large-scale game battles, it is necessary to take into account factors such as the supply of fuel and ammunition of each single unit. The precense of inventories for each unit limits the number and size of transported objects. Guns’ accuracy and penetration decreases with distance. Tired soldiers reduce the movement speed during long crossings. The influence of these and many other factors makes possible to reproduce the battles of World War II with a adequate degree of realism, most involving the player into the atmosphere of heated battles of the past.<br/></li><li>Modular realistic damage system. Any vehicle, regardless of its type, is composed of a set of modules that can be broken or destroyed. Types of ammunition, characteristics of guns, shooting distance, angle of armor, armor plate thickness and the threshold of material fatigue are taken into account, when calculating the piercing capability and damage caused to each of the component. Additionally, there are calculations of the probability of detonation of ammunition, engine fires, damage to wheels or tracks (which leads to immobilization of combat units). If a component is not destroyed, it can be repaired.<br/></li><li>Wide range of opportunities for infantry. Intelligence, combat, capture and repair of equipment, installation of anti-personnel and anti-tank obstacules of different types, construction of protective structures, health treatment, cover usage, ability to change through primary and secondary weapons, capture of buildings and territories.<br/></li><li>Great number of different types of weapons and ammunition. Pistols, submachine guns, machine guns, rifles and carbines, various types of grenades, dynamite, mines, knives and other items of equipment that are unique to each nation.<br/></li><li>Advanced Artificial Intelligence (Advanced AI). Infantry’s behaviour based on the feedback information from their own sensors (vision and acoustics), as well as allies’ signals. This allows the use of diversionary tactics, sending scouts into the enemy's rear, as well as to open the visibility with the help of special devices - observation towers, binoculars, telescopic tubes and sniper scopes. The morale of the infantry depends on the balance of forces on the battlefield - the soldiers may decide to advance or to withdraw from the fight.<br/></li><li>Conceptual new interface for convenient control.<br/></li><li>Enhanced game engine Gem2. Reworking of the game engine allows to provide a new level of graphics, the implementation of new and improvement already familiar to users game mechanics.<br/></li><li>OSX, Mac. Linux support.<br/></li><li>Full Steam support. Matchmaking, workshop, steamcloud, tradecards, achievments, steamstats, inventoryitems.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T12:12:49", "background_image": "https://media.rawg.io/media/screenshots/c2e/c2e439e61a3e5f66fd7963dc31c7a2a1.jpg", "website": "http://eng.bestway.com.ua/index.php/projects/soldiers-arena", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "toplay": 1}, "playtime": 545, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 534, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "Linux", "PC"], "developers": ["Best Way"], "genres": ["Action", "Strategy"], "publishers": ["Best Way Soft"], "esrb_rating": null}