{"id": 99367, "slug": "corto-maltese-the-secret-of-venice", "name": "Corto Maltese - The Secret of Venice", "name_original": "Corto Maltese - The Secret of Venice", "description": "<p>Let's set off in the footsteps of Corto Maltese! Along Venice's canals and narrow alleys, fight against a poison that ravages you, avoid bullets and explosions, face the unknown, and eventually open the doors of knowledge.</p><p>This video game unravels a thrilling quest based on a point and click riddle-driven gameplay within the worlds of Corto Maltese, the main character created by Hugo Pratt, the genius of graphic novels (more than 5 Million hardcopies sold worldwide).</p><p>Searching for a fabulous emerald, you may find a magical balance and finally, utopia.</p><p>Features:</p><ul><li>An intimate experience with one of the most charismatic graphic literature's figures : the iconic Corto Maltese for the first time in a video game</li><li>An original story featuring existing characters from Corto Maltese's comic books, as well as brand-new characters</li><li>Gorgeous artworks combining: original settings based upon sceneries and places in Venice, cutscenes using stunning photographic work of Marco d'Anna, and animated comic strips from Corto Maltese's adventures all over the world. </li><li>A mysterious compass and a gazette full of stories and hints will help you throughout the adventure.<br/></li><li>Two difficulty levels for the riddles : for beginners or insiders…<br/></li></ul>", "metacritic": null, "released": "2016-05-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0d5/0d571a3991867e2a1009782c4757d04b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 428, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Plug In Digital"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}