{"id": 99362, "slug": "12-orbits-itch", "name": "12 orbits (itch)", "name_original": "12 orbits (itch)", "description": "\r\n\r\n12 orbits is the only game for up to 12 players at once,<br/>\r\nno matter what you play on.\r\n\r\n<p>\r\n\tAll you need is a single keyboard, touchscreen, gamepad, dance mat, makey makey...\r\n</p>\n<p>\n</p>\n<p><strong>Features</strong><br/></p>\n<ul><ul><li> Local competitive multiplayer for everyone at once. Anywhere. On anything.</li><li> 4 vastly different game modes to choose from</li><li> Setup takes seconds, even for 12 players at once</li><li> The basic mechanics are simple and can be taught to a group quickly</li><li> ...yet the physical nature of the game provides you with a lot of room for mastery</li><li> One Switch accessible</li></ul></ul>\n\n<p>\n<br/>\n</p>\n<p>\n<strong>\r\n\tYou can choose from 4 vastly different game modes:\r\n\t\r\n\t</strong>\n</p>\n<p>\n<br/>\r\n\t ◯\r\n\t\r\n\t<strong> Multiball</strong> (Teams)\r\n</p>\n<p>\r\n\tKind of like football, but with exploding goals and multiple balls at once, which change color all the time.\r\n</p>\n<p>\r\n\t◯\r\n\t<strong> A</strong><strong>rena </strong><br/>\n</p>\n<p>\r\n\tFill the arena with spheres of your own color and avoid those of your opponents. A bullet hell that constantly grows more intense.\r\n</p>\n<p>\r\n\t◯\r\n\t<strong> </strong><strong>Trails </strong>\n</p>\n<p>\r\n\tCollect spheres to grow longer than your opponents. Block their path and pay attention to your own, similar to Snake or Achtung die Kurve / Zatacka. On top of that, you also have the ability to shoot with your own spheres.\r\n</p>\n<p>\r\n\t◯\r\n\t<strong> Blizzard</strong> (Teams)\r\n</p>\n<p>\r\n\tThink Pong. But you play in teams, can roam freely on your side of the court, and have to defend against a whole shower of spheres at once. \r\n\t<br/>\n<br/>\n</p>\n<p>\n<br/>\n</p>\n<p>\n<strong>\r\n\tSome questions you might have:\r\n\t</strong><br/>\n<strong><br/>\n</strong>\n</p>\n<p>\n<strong>• Why?</strong> <br/>\n</p>\n<p>\r\n\tSo you can play with everyone around you, anywhere. 12 orbits will run on almost any hardware, and any input will do. Most keyboards can only process 3 or 4 inputs at the same time, but that does not mean you can only play with 3 players. \r\n\t<br/>\r\n 12 orbits uses only one button per player, which you never have to keep pressed. So it is highly unlikely that many players use their button during the very same frame. While I can not guarantee that a three-button-keyboard will never ever miss a single input, there were no problems with any number of players yet.\r\n\t<br/>\r\n If you are on the go, or simply do not have 12 gamepads lying around, that is why. \r\n\t<strong><br/>\n</strong>\n</p>\n<p>\n<strong><br/>\n</strong>\n</p>\n<p>\n<strong>• Is this actually playable?</strong> <br/>\n</p>\n<p>\r\n\tYes! There are a few one-button-multiplayer games around that are fun or funny, but are based on a single action and don't really work for longer than 5 minutes. 12 orbits is not one of those games. It is fun of course, but this is also a game that can actually be played competitively. \r\n\t<br/>\r\n It will take you only a few minutes to get the hang of the controls, but it is much harder to actually master movement and to skillfully hit spheres exactly the way you want to. In addition, 12 orbits is a lot about anticipating the movements of other players, becoming almost chess-like if you have the right opponents. \r\n\t<br/>\r\n You can of course also play the game in a more relaxed fashion, especially in the team modes or with activated modifications. It's your choice.\r\n</p>\n<p>\n<strong><br/>\n</strong>\n</p>\n<p>\n<strong><strong>•</strong> How many players do I need?</strong> <br/>\n</p>\n<p>\r\n\t2 is enough. All game modes automatically adjust to any number of players. There are also practice modes that can be played with 1 to 12 players on one team, but that isn't the main attraction of this game. So grab someone nearby, and add players as they turn up. \r\n\t<strong><br/>\n</strong>\n</p>\n<p>\n<strong><br/>\n</strong>\n</p>\n<p>\n<strong><strong>•</strong> Is 12 orbits One Switch accessible?</strong> <br/>\n</p>\n<p>\r\n  Yes. From the moment the game starts, it can be completely controlled with only the spacebar, including all menus. Just press it a few times when the main menu screen is shown, and on-screen prompts will further guide you through the process. More infos here.</p>\n\n<p> <strong><strong>•</strong> Is there a colorblind mode?</strong> <br/> </p>\n<p> Yes. It is based on black and white symbols, so it should work for any type of color blindness.</p>", "metacritic": null, "released": "2016-07-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/843/843081334d86ec1a40c7675800e120db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Roman Uhlig"], "genres": ["Action"], "publishers": [], "esrb_rating": null}