{"id": 99376, "slug": "state-operative", "name": "State Operative", "name_original": "State Operative", "description": "<p>Almost fifty years ago, the city Nexus was caged inside a vast Faraday dome, removed from the outside world, thanks to hacker attacks and cyber-terror which drove it into isolation. As the fiftieth anniversary of Nexus' self-imposed isolation approaches and public restlessness begins to boil beneath the surface, a freak accident sees a dome tile come dislodged and fall into one of the outer urban sectors. While miraculously not landing directly on anyone, it shattered on impact and piercing fragments injured many, including a mortal injury inflicted on one Evren Serpentine – though that wasn't their name then. When a citizen is in need of life-or-death medical treatment that they cannot afford, the State will graciously see to their care. For a price. Serpentine discovers this when they come to in hospital, fitted with a new cybernetic throat and jaw, and are informed that they are now one of the State's BiOs - Bionic Operatives - and will start training immediately.<br/></p><p>You are Serpentine, and your choices matter. Will you do as the State tells you, upholding their ideals and crushing all opposition? Will you side with the Anti-State Alliance and shine light upon the State's dark secrets for all to see? Or will you side with VIXEN, a mysterious hacker group, whose only goal is freedom – and chaos?</p><p>As a Joint Honours student at Brunel University, I did two dissertation projects in my final year; one for English Literature and one for Game Design. <em><strong>State Operative</strong></em> is the name of my game design project, an art project wherein I had to create an aesthetically pleasing game with a focus on art and assets. The story above unfolds in my game, as the player meets the inhabitants of Nexus – good and bad – and makes choices that will affect the ultimate outcome.</p><p>While my focus was on the visuals, the game is fully playable; I hope that you enjoy it!</p>", "metacritic": null, "released": "2016-05-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ab6/ab60bce8f4c855ad631a28abac168314.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ren"], "genres": [], "publishers": [], "esrb_rating": null}