{"id": 99395, "slug": "tombagotchi", "name": "Tombagotchi", "name_original": "Tombagotchi", "description": "<p>UPDATE: Fixed every person being given the same random id resulting in pets being overridden.</p><p><strong>Battle virtual pets trained by players around the world with Tombagothi!</strong></p>\n<p>Every single player's pet battles in real time through the power of <strong>THE INTERNET!</strong></p>\n<p>Raise your very own tombagotchi to be the very best fighter the world has ever seend. You need to be prepared, as every 5 minutes a grand <strong>BATTLE ROYALE</strong> takes place to determine the greatest tombagotchi of them all!</p>\n\n<p><strong>Instructions</strong><br/></p>\n<p>Leave your pet running, keep it fed and clean, and play with it frequently to create the very best fighter! It will evolve every so often, reaching full evolution at around 45 minutes. It can still become more powerful after this.</p>\n<p><strong>Speed </strong>controls how fast a tombagotchi moves.</p>\n<p><strong>Strength </strong>controls the health and damage output of a tombagotchi.<br/></p>\n<p><strong>Dex </strong>controls how good a tombagotchi is at getting away from danger.<br/></p>\n<p>Play minigames to improve these stats, selecting them on the menu with the 1 and 2 buttons on your keyboard.</p>\n<p>Every 5 minutes a battle will start. You have no input, but if you have trained your tombagotchi well, it will triumph</p>\n<p><strong>Controls</strong></p>\n<p>Control the tombagotchi handheld with the 1, 2, and 3 keys.</p>\n<p>On the main screen, use 2 to change modes and 1 to perform an action. Other screens have instructions on how to use the buttons.</p>", "metacritic": null, "released": "2018-04-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1e6/1e6dd67a3ef48f92872675ec38b8097d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Terracottafrog"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}