{"id": 99408, "slug": "rift-world", "name": "Rift World (itch)", "name_original": "Rift World (itch)", "description": "<p>This little Tower Defense game was made for Ludum Dare #38 by:</p>\n<p>Jessica Barros - Game Art, Game Design;</p>\n<p>Lênon Kramer - Game Design, Programming;</p>\n<p>Music by Chocochurros;</p>\n\n<p>[BIG UPDATE 01 - INTERFACE AND SOUND UPGRADE + TUTORIAL LEVEL]</p>\n<p>- Fixed some bugs</p>\n<p>- Remade completely the interaction with the characters</p>\n<p>- Added music and SFX</p>\n<p>- Created a Tutorial Level, which is playable through the \"Instructions\" button on Main Menu<br/></p>\n\n<p>Backstory:</p>\n<p>The interns of a time travel agency tried to prove themselves while the boss was away… and got stranded on a tiny dimension. Their entrance there made the place unstable, and some time rifts started to crack around, through which some monsters are trying to invade and eat the interns. Now it's in your hands to help them defend themselves and repair the time machine to get back to the agency HQ… before Jack finds out, preferably.</p>\n<p>The quadruple twins are strong and able combatants. They may defend the rifts against the monsters. They may also mine the crystal necessary to repair the Time Machine (luckily those are abundant on the Rift World!). Be careful to make them Rest a bit if they get too injured, so they can recover.</p>\n<p>The impetuous Alja is the leader of the team, because she is the only one with more than two months of experience on the agency. She will provide valuable help on mining and repairing.</p>\n<p>The shy Nick is the genius of the team. He will research the way of getting out of Rift World. Also, he can repair the Rifts if the monsters are close to getting in, and also medics the injured combatants.</p>\n<p>If the Rifts don't get defended the monsters will start ripping them open apart. That will allow them to enter the dimension and then nothing will be able to stop them eating our little interns as a hard-to-digest lunch. Don't let that happen, by defending and repairing them.</p>\n<p>To win you need to repair the Time Machine and get out! Setting Nick to Research will do the job, but it takes time and resources… and sometimes Nick will be needed somewhere else.</p>\n<p>Mining is important - the crystal is used for repairing the Rifts and for the Research to get out of that damn place. Do not forsake it.</p>", "metacritic": null, "released": "2017-04-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/63a/63a101bbb48f1c52318a13873a5471b4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Lênon Kramer"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}