{"id": 99449, "slug": "one-button-real-time-twenty-six-player-party-golfi", "name": "ONE BUTTON REAL TIME TWENTY-SIX PLAYER PARTY GOLFING", "name_original": "ONE BUTTON REAL TIME TWENTY-SIX PLAYER PARTY GOLFING", "description": "<p><em>Version 2.0 Update: <br/></em></p>\n<ul><li><em>Balls are always coloured</em></li><li><em>Balls can be bounced before the game starts by pressing button</em></li><li><em>Course is 9 holes, not 18</em></li><li><em>Game starts automatically once second player joins (with ten second delay for more people to join). Game automatically returns to menu at end of game.</em></li><li><em>Ball can now be charged up even more to account for some mountains previously being impossible (this also makes it more possible that the leading player will overshoot and kill themselves)</em></li></ul>\n<p>-----------------------------------------------------------</p>\n<p>With apologies to <em>Desert Golfing</em> and <em>One Button Nipple Golf</em>. Both these games are great and more worthy of your time than this one.</p>\n<p>This is a real-time, one-button, multiplayer take on <em>Desert Golfing</em> for up to 26* players.  Hold your button to charge and aim, release to hit. Winner is first to sink Hole 9 or the last one left standing after everyone else falls off the edge of the screen (the camera follows the current winner).</p>\n<p>Arrow next to the letter at bottom of the screen points towards your next hole.</p>\n<p>Custom settings to make balls able to collide with other balls, or turn on a single-player mode that disables the 'last one left alive' victory condition. </p>\n<p>The levels are procedurally generated and I don't guarantee they will always be possible. Massive thanks to Greg Quincey for showing me how to create the level generation system.</p>\n<p><strong>WARNING:</strong> Most keyboards don't actually allow 26 simultaneous button presses. In which case, you should probably only play with as many players as your keyboard allows. Unless you want an extra challenge and some wrestling. You can also try plugging in multiple USB keyboards as that gets around the maximum key presses issue. </p>\n<p><em>(In 2017 I am challenging myself to make 50 little videogames to get more familiar with the tools. I make no guarantee that any of the games are good, but that's not really the point. This is game #22 of 50.)</em><br/></p>", "metacritic": null, "released": "2017-08-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5eb/5eb95f307714bc3fc65498605f56dd46.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Brendan Keogh"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}