{"id": 99451, "slug": "south-of-real-rough-beast", "name": "south of real: rough beast", "name_original": "south of real: rough beast", "description": "The stars have come to reap, and you are out of time.<br/><p>\r\n\tYou--Alex--left home two years ago. The air reeks of dust, chemicals, and blood. Memories crawl wormlike under every surface. This was a mistake, perhaps, but you've come back. If you do not find something--anything at all--to stop the reaping, this is where you'll die.\r\n</p><p>\r\n\tNo place like home.\r\n</p><p>\n<em>South of Real: Rough Beast </em>is a short psychological horror game about memory, trauma, and the excuses we make for our actions.\r\n</p><p><strong>(Note: <em>South of Real: Rough Beast</em> contains content that may cause problems for some players. Content warnings are available here.)</strong></p>Features<ul>\n<li>Explore a swiftly-unraveling world in search of answers.</li>\n<li>Dive into the horrors of your past.</li>\n<li>Thoroughly modern, extravagantly expensive soundtrack by the most popular musicians of our age.\r\n\t<ul>\n<li>(that is a bald-faced lie please download my game.)</li>\n</ul>\n</li>\n<li>Obligatory library, according to the stringent demands of the genre.</li>\n<li>You can set the table if you want.</li>\n<li>Sincere encouragement.</li>\n<li>Move on. Or don't.</li>\n</ul>Credits<ul>\n<li>Game by Matthew B. Hare.</li>\n<li>Art resources by DEGICA, Sebastian Bini, and Matthew B. Hare.</li>\n<li>All other media from Wikimedia Commons, Archive.Org, and KADOKAWA.</li>\n<li>Pathfinding script by Theo Allen. Thanks, Theo!</li><li>Save game script by Yanfly. Thanks to you too, Yanfly!</li><li>Thank you.</li>\n</ul>Contents<ul>\n<li>Includes game, readme, and soundtrack (dig around in them thar files, you magnificent treasure hunter you!</li>\n</ul>More by Matthew B. Hare?<p>What an odd question! Are you--the person who's talking right now--asking me if I've made more stuff? Or to <em>see</em> more stuff? You should be less ambiguous with your writing, person who wrote that odd header.</p><p>Still, I can answer several possible meanings of this header with links to my Tumblr and Facebook pages.</p><p>Hopefully, that's what you were getting at. If not, shoot me a tweet! I might be able to answer your confusingly-worded header questions!</p>", "metacritic": null, "released": "2016-08-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/fb1/fb1226194cc6908f550aab03f19e63cf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Matthew B. Hare"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}