{"id": 99528, "slug": "stacker-2", "name": "S.T.A.C.K.E.R.", "name_original": "S.T.A.C.K.E.R.", "description": "<ul>\n<li>Loot, drink, smoke and fight your way through three levels of irradiated hell</li>\n<li>Overcome dogs, soldiers, swamps and fanatics with rocket launchers</li>\n<li>Struggle with outdated 80s equipment</li>\n<li>Discover the perverted secrets of Soviet science</li>\n<li>Have your wishes granted in the mysterious heart of the Zone</li>\n</ul><p>\r\n\tThree years ago, in 1986, an explosion at the Chernobyl nuclear power plant scattered deadly radiation across Europe. One hundred thousand people were hastily evacuated and a Zone of Alienation was created around Chernobyl.\r\n\t<br/>\n</p><p>\r\n\tSoon stories began to leak out of the Zone - of mutated animals and men, of the earth and sky twisting into weird shapes, and of alien objects with wonderful powers that would drop out of thin air.\r\n</p><p>\r\n\tFor these, people would pay well. So scavengers were drawn to the Zone. Men drifted there from across the USSR, to make a living gathering what they could from this lonely, hostile new world. These men became known as \"Stackers\".\r\n</p><p>Rock, Paper, Shotgun says:<br/></p><p>\r\n\t\"... it's a quiet joy to see how all these mechanics of a more traditional shooter are worked into Tetris ... pretty funny and terribly well executed\"\r\n</p><p>\r\n\tFirst released in 2008.\r\n\t<br/>\n</p><p>\n<br/>\n</p>Instructions<p>\r\n\tComplete horizontal lines to sell objects, earn money, and progress through the level.  Selling several lines at once gives a bonus.\r\n</p><p>\r\n\tObjects can affect your health (red), psi (blue) and radiation (yellow) stats. Low psi causes visual glitches. High radiation damages your health.\r\n</p><p>\r\n\t  Objects either take effect every round, or only when they are sold, in which case the effect is multiplied by the number of blocks of the object sold. If an object is partially sold, what is left is junk and loses its value and effects.\r\n</p><p>\r\n\t A weapon in your inventory reduces the frequency of enemy attacks.  Armour reduces damage taken. Artefacts are the most valuable objects and can have powerful effects.\r\n</p><p>\r\n\tPress SPACE or ENTER to flip your inventory upside down, allowing you to stash useful objects at the bottom.<br/>\n</p><p>\r\n\tUP, Z and X rotate objects.  P pauses the game and ESC quits immediately.  F4 switches between windowed and full-screen.\r\n\t<br/>\n</p><p>\r\n\t(Cheat code: type \"strugatsky\" at the main menu to unlock all levels.)\r\n</p>", "metacritic": null, "released": "2017-04-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/451/451171c59cc252cae3378ffe019bca8f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Neil Thapen"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}