{"id": 9960, "slug": "primal-carnage-onslaught", "name": "Primal Carnage: Onslaught", "name_original": "Primal Carnage: Onslaught", "description": "Prehistoric terror comes to VR in the latest installment from the Primal Carnage universe. Slice, shoot, and blast your way through hordes of predatory reptiles as you make your way back to the top of the food chain! Have you got what it takes? The onslaught is here… survive or be eaten!Arsenal of ExtinctionAll of your favorites from the trusty hunting knife through to the reptile wrecking grenade launcher. Channel your ‘inner commando’ by dual wielding your favourite weapons!Immersive EnvironmentsStand your ground in a variety of rich, detailed environments, from high-tech cloning labs to lush forests and abandoned supply facilities.Combative AITake on the likes of pouncing Raptors, spitting Dilos, ankle-biting Compys, and more! Each species has its own unique AI, and all of them want you dead.Intuitive GameplayPC:O offers an arcade style experience with plenty of heart stopping action and ‘Oh Snap!’ moments to keep you and your friends entertained for hours. Interact with weapons in the virtual space to aim, reload, remove clips and attack dinosaurs in new and exciting ways.Amazing Sound EffectsFrom the lightest leaf crunch to the loudest roar, PC:O features an impressive collection of high quality sound effects to keep you immersed in the action.Steam LeaderboardsSurvive for as long as you can and compare your evolutionary prowess with friends and other players from around the world using online leaderboards!HTC Vive and Oculus Rift supportPlay Primal Carnage: Onslaught on your favorite VR headset!", "metacritic": null, "released": "2016-12-29", "tba": false, "updated": "2019-08-28T22:14:41", "background_image": "https://media.rawg.io/media/screenshots/c03/c031aeb36e2de8ee1340d2b3c96844d1.jpg", "website": "http://www.pubgames.net.au/projects/primal-carnage-onslaught/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 3, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 350, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pub Games"], "genres": ["Action", "Indie"], "publishers": ["Circle 5 Studios"], "esrb_rating": null}