{"id": 9975, "slug": "folk-tale", "name": "Folk Tale", "name_original": "Folk Tale", "description": "Folk Tale is a fantasy village builder ARPG game in which you lead a ragtag band of peasants in growing a thriving market town, while dastardly minions plot your downfall! Recruit heroes and head out into the wilds to fight back against evil. Or, you know, to get sweet sweet loot. Either or.<br/><br/>Players are comparing <strong>elements</strong> of gameplay with Warcraft 3, The Settlers, Banished, The Guild 2, Majesty 2 and Black and White 2. Folk Tale is not a pure play role-playing game such as Pillars Of Eternity, and adopts more of a MOBA approach to hero abilities than a CRPG. Nor is it an RTS game (although some of the controls are similar).Features<br/>For more information please visit the Development Roadmap on our website.<br/><br/> Build your own impressive settlement and economy<br/><br/> Defend your village with palisade, gatehouses and watchtowers *<br/><br/> Train a small army of Spearmen, Crossbowmen, City Watch and Cavalry<br/><br/> Manage villager needs and happiness<br/><br/> Meet, recruit, and level-up heroes and special abilities<br/><br/> Explore a rich and diverse world including dungeons and boss battles<br/><br/> Take direct control of your villagers and heroes similar to RTS games<br/><br/> Research new technologies unlocking crafting recipes and economic bonuses<br/><br/> Collect resources and loot corpses for new gear and ingredients to be used in crafting<br/><br/> Beautiful stylized graphics with voice-acted characters<br/><br/> Tongue-in-cheek humor for a refreshing blend of fantasy<br/><br/> Campaign and sandbox modes<br/><br/> Endless hours of fun with random events including crime, building fires *<br/><br/> Free-building - no fixed plots<br/><br/> Customizable difficulty settings to support players of all ability levels<br/><br/> Download new worlds via Steam Workshop<br/><br/> Create and share your own world using the integrated editor<br/><br/>* these features are currently available in the experimental buildUpdates<br/>Folk Tale is in active development and is regularly updated, most frequently with patches to the easy to opt-in to experimental build. Please visit the news section to view the patch notes.<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-17T11:57:16", "background_image": "https://media.rawg.io/media/screenshots/31f/31fae55cda3d86e550b2121e7b1d19be.jpg", "website": "http://www.gamesfoundry.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 102, "toplay": 2, "dropped": 5}, "playtime": 2, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 569, "game_series_count": 0, "reviews_count": 4, "platforms": ["macOS", "PC"], "developers": ["Games Foundry"], "genres": ["RPG", "Strategy", "Simulation", "Indie"], "publishers": ["Games Foundry"], "esrb_rating": null}