{"id": 99782, "slug": "null-space", "name": "Null Space", "name_original": "Null Space", "description": "<p>In Null Space, you play as Newman, a postman who delivers mail throughout the galaxy. You were tasked with picking up a new planetary shield prototype from a research station on your normal route. Apparently a race of pint-sized aliens had the same idea. They attacked and destroyed the research station that produced the new shield. Luckily, you made it out with the packages and need to get them delivered right away before the aliens destroy all of the other planets in the galaxy.</p>\n<p>Your ship, the Daedalus, is carefully crafted to maneuver tight spaces and deathly situations. Use your ship's size and agility to your advantage as you navigate randomly generated puzzles featuring asteroid fields, dying stars, coronal mass ejections, black holes, and other space phenomena. Move fast to protect as many colonized asteroid fields and planets as possible.</p>\n<p><strong>Features</strong></p>\n<ul><li>Puzzles where you must plan the most efficient path to your destination while navigating through black holes, asteroid fields, lasers, and wormholes</li><li>Make your way through 40 levels that are randomly generated every time you play through them</li><li>Leverage space stations to prepare your strategy for dealing with black holes and the onslaught of The Swarm</li><li>Deliver shield technology throughout the galaxy to planets and colonized asteroids</li><li>Create your own levels with our level editor and then share them with the community of other players</li></ul>\n<p><strong>Early Access</strong></p>\n<p>Null Space is in early access as we're still adding in some optional and extra features. The base game has been finished and includes all 40 levels that we intended to add along with the custom level editor. It also includes the ability to save your custom levels for everyone in the community to play. </p>\n<p>After we've had enough feedback from players and have added all of the features that the community has requested, we will release out of early access at the full price.</p>\n<p><strong>Latest Update<br/></strong></p>\n<ul><li>Reduced the difficulty level by decreasing the ships size and increasing its speed.</li><li>Resolved bugs that may have prevented a complete play-through of the game.</li><li>Allowed skipping text scrolling during cut-scenes.</li><li>Fixed bugs with displaying angles.</li></ul>\n<p><strong>Contact</strong><br/></p><p>To give us feedback or report a bug please leave a comment here or send an email to luke@mantisdigitalarts.com - it's greatly appreciated!</p>\n<p><strong>Links</strong>: Mantis Digital Arts, @MantisDA<br/></p>", "metacritic": null, "released": "2016-06-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/31e/31ed9717800701340a491e0af2dfe6c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MantisDA"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}