{"id": 99815, "slug": "mace-itch", "name": "M.A.C.E. (itch)", "name_original": "M.A.C.E. (itch)", "description": "<p><strong>M.A.C.E. – Space Shooter</strong><br/>MACE is a classic space shoot ’em up, inspired by the legendary Amiga games of this genre. Handdrawn 2D graphics in HD resolutions, parallax scrolling,<br/>explosion effects and optimized games mechanics, combined with the proven gameplay are transporting the “Spirit of Amiga” in today’s Age.</p>\n\n<p><strong>Gameplay<br/></strong>In MACE, the player navigates a spaceship across three different worlds with 6 vertical scrolling levels and various enemies, trying to destroy or avoid them. Hidden items (weapons, bombs, energy), upgradeable weapons and accessories, such as rocket and companions help to defeat the enemy in difficult battles.</p>\n<p><strong>Definition M.A.C.E.</strong><br/>Military Alliance of Common Earth<br/>Founded after the first alien invasion on earth in the year 2054. M.A.C.E. is the epitome of the new cohesion of all peoples of the earth to fight against the aliens to serve life on earth in a military path.</p>\n<p><strong>Story</strong><br/>While heavy fights rages on earth against incoming alien ships and the M.A.C.E. units are to prevent the construction of additional land bases for the alien<br/>ships, a group of specially trained fight pilots whith space warships try to prevent the arrival of more aliens and distroy the alien mother ships and<br/>troops of aliens.</p>\n<p><strong>Your Mission</strong><br/>Fight in an exceptional space mission by foreign galaxies to prevent the arrival of more alien swarms on the earth. Your spaceship is one of the first one which is built by people using alien technology including engines, weapons and shields to survive against the aliens.</p>\n<p><strong>Features:</strong><br/>3 different worlds<br/>18 levels<br/>3 big end bosses<br/>endless waves with unique enemies<br/>3 difficult levels (easy, normal, hard)<br/>3 gfx details for lower and faster devices<br/>fantastic gameplay for many hours<br/>brilliant handdrawn graphics<br/>30 minutes epic soundtrack<br/>Achievements<br/>online highscores<br/>8 different weapons (3 upgrades each)<br/>additionals: companion, rocket, shield, smart bomb<br/>hidden Items for weapons, lives, energy, rocket, companion, bomb<br/>2 player coop mode on Windows, AmigaOS and Xbox360</p>", "metacritic": null, "released": "2017-11-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/573/573ed3e06cb5f84877c00ea7d61f82fb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 275, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EntwicklerX"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}