{"id": 9985, "slug": "notruf-112-emergency-call-112", "name": "Notruf 112 | Emergency Call 112", "name_original": "Notruf 112 | Emergency Call 112", "description": "<strong>Emergency Call 112 – The Fire Fighting Simulation</strong> is an exciting, fully detailed simulation of the eventful life of a big city fire department. It was developed in cooperation with and modelled on the fire brigade of Mülheim, Germany. Mülheim has one of the largest and most modern fire stations in Europe. Particular attention was paid to realism and accuracy in creating the various missions.<br/><br/>Never before has a simulation offered such great level of detail for the fire department vehicles, including and especially the LF24, the fire truck. All of the equipment and functionality have been incorporated. The water tender, turntable ladder and swap body vehicle are also fully functional and available for the virtual fireman. An  command vehicle is also included. And of course, equipment can be removed and kept available for later use.<br/><br/>Accidents involving cars and trucks, oil slicks, external and internal fires requiring breathing equipment, these exciting scenarios are randomly generated and promise hours of excitement. The authentic spread of the fires and lifelike, movable fire hoses with realistic handling needed to fight the fire make for an authentic playing experience.<br/><br/>Turn on the emergency lights and sirens and experience one of the world’s most exciting professions – the fire brigade. No previous fire simulation has gone to such lengths to provide such depth and realism.<br/><br/><br/><ul><li>Fire brigade modeled on Mülheim’s real state-of-the-art fire department, set in a fictitious town<br/></li><li>Highly-detailed vehicles, such as the LF24 fire truck, a tender truck, turnable ladder vehicle and command vehicle <br/></li><li>Removable equipment<br/></li><li>Realistic, flexible, moveable hoses<br/></li><li>Interior and exterior fires<br/></li><li>Technical assistance for accidents<br/></li><li>Realistic fire spread using a fluid, dynamic simulation</li></ul><br/><strong>Many different scenarios including:</strong><br/><br/><ul><li>Traffic accidents<br/></li><li>Oil slicks<br/></li><li>Burning rooms<br/></li><li>Small fires in industrial areas<br/></li><li>Blocked roads<br/></li><li>Fire alarm</li></ul><br/><ul><li>Night operations<br/></li><li>Navigation systems in the fire trucks<br/></li><li>Functional light pole on the LF24<br/></li><li>Sophisticated AI to control the interaction between the fire fighters<br/></li><li>Realistic traffic at the site of the fire or accident<br/></li><li>An open game world where all of the buildings can be a scene of the action</li></ul>", "metacritic": null, "released": "2016-11-09", "tba": false, "updated": "2019-08-28T22:14:40", "background_image": "https://media.rawg.io/media/screenshots/415/415aeb519642f0fee56922653bc7441b.jpg", "website": "http://en.shop.aerosoft.com/eshop.php?action=article_detail&amp;s_supplier_aid=13392&amp;s_design=simulation4u&amp;shopfilter_category=Simulation4u&amp;s_language=english", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 13, "toplay": 1, "dropped": 3}, "playtime": 13, "achievements_count": 21, "ratings_count": 4, "suggestions_count": 349, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Crenetic GmbH Studios"], "genres": ["Simulation"], "publishers": ["Aerosoft"], "esrb_rating": null}