{"id": 99859, "slug": "data-burst-bonus-material-on-the-set", "name": "Data Burst - Bonus Material: On The Set", "name_original": "Data Burst - Bonus Material: On The Set", "description": "<p><strong>CALLING ALL INTERSTELLAR TOURISTS!!</strong></p><p>Grab your fanny pack and Local Group passport and get a glimpse \"behind the scenes\" of episode one: Data Burst! Walk the streets of the Vegas Prime Central District between deep space jumps with your own digital tour guide. Explore notable locations and learn about the history and lore of Vegas Prime and its role in unravelling the story of Vegas Prime Retrograde. And watch out, our guide system may have been hacked.</p><p>Pay attention! There's a test after. (No, there's not.)</p><p><strong>Game Play</strong></p><p>Take a look around Central District. When you see the yellow location icon that says \"There is information here\" you're in an area that has something interesting for you to read. Click the mouse button or whatever button magically seems to work (A? X? Square?) on your controller.</p><p>The number in the top left shows you how many Points of Interest you've checked out. </p><p>There's no time limit. Just enjoy the level now, because Data Burst is going to be crazy.</p><p><strong>This release features:</strong></p><p>Lore: +1</p><p>Corporate: +2</p><p>Government: +1</p><p>Conspiracy: +2</p><p><strong>Vegas Prime Retrograde</strong></p><p>This is playable bonus material for the first episode of Vegas Prime Retrograde. Think of it like a \"behind the scenes\" or \"on the set\" kind of release. VPR will be releasing semi-regular episodes online (here!) and you should definitely join in and give us suggestions about the plot as it unfolds! :D</p><p>Like us on Facebook for updates!</p><p>https://www.facebook.com/vegasprimeretrograde<br/></p><p>And check out our website, it's kinda where we keep everything. Sort of.</p><p>http://www.vegasprimeretrograde.com/<br/></p><p>SUPPORT, QUESTIONS, OTHER SHENANIGANS:</p><p>https://twitter.com/XamalgaPrime<br/></p>", "metacritic": null, "released": "2015-03-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/642/64262a81e126c593b148c509f6518cc9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Open Form Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}