{"id": 9991, "slug": "versus-squad", "name": "VERSUS SQUAD", "name_original": "VERSUS SQUAD", "description": "Versus is a fast action twin-stick shooter from the creator of Nation Red. Create your own sandbox defense before doing battle with thousands of enemies in fast-paced top down combat. Face up to a dozen bosses. Simultaneously. Play in single player, on-line or local coop with up to 4 players.<br/>\n<br/>\r\nSet up your player class, attributes and weaponry, then choose your map setting and build barricades, tactically place explosives, sentry guns, ammo and medical kit stockpiles, weapon stations and more.<br/>\n<br/>\r\nBuild defenses or keep the map free-roam with only weapon stations and sentry guns.<br/>\n<br/>\r\nThen hit the Play button to battle it out in Free Play or Tactical Mode, alone or with friends and survive against 360-degree enemy attack or defend one or more breach points.<br/>\r\nSave your diorama map to disk or Steam Cloud to play later or rearrange your defenses after a defeat to try a different tactical approach.<br/>\n<br/>\r\nDuring your play earn dozens of perks ranging from increased weapon accuracy to setting up drone strikes.<br/>\n<br/>\r\nVersus supports leaderboards, per-game and lifetime player and weapon stats, achievements, custom map making and more.<br/>\n<br/>\r\nTry it, build your sandbox defense and see how long you survive on your own map!", "metacritic": null, "released": "2016-10-26", "tba": false, "updated": "2022-09-30T00:40:07", "background_image": "https://media.rawg.io/media/screenshots/e7e/e7eef1a0dc1df4a171fdecdad7f9efb8.jpg", "website": "http://www.versussquad.com", "rating": 0.0, "rating_top": 3, "added_by_status": {"yet": 3, "owned": 115, "beaten": 1, "dropped": 2}, "playtime": 3, "achievements_count": 68, "ratings_count": 5, "suggestions_count": 555, "game_series_count": 0, "reviews_count": 5, "platforms": ["macOS", "PC"], "developers": ["DiezelPower"], "genres": ["Action", "Indie"], "publishers": ["DiezelPower"], "esrb_rating": null}