{"id": 9994, "slug": "battlecrew-space-pirates", "name": "BATTLECREW Space Pirates", "name_original": "BATTLECREW Space Pirates", "description": "<strong>JOIN THE CREW, RAID THE WORLDS</strong><br/>BATTLECREW™ Space Pirates is a fast-paced competitive multiplayer shooter that offers a really dynamic and nervous gameplay.<br/><br/>Choose your hero, call a few friends and join in on the fun!<br/><br/>Each character has unique abilities (attack, defense, and movement attributes) that not only change the entirety of your playstyle but also the way in which you navigate the maps! It's up to you to find the one that suits you best!<br/><br/>Create your own crew of pirates and lead your team into intense and epic battles! Steal as much of your ennemies' gold as you can in Gold Rush mode or turn them into space dust in classic Team Deathmatch mode!<br/><br/>Between battles, dock at Tortuga, a space station that has become the lair and meeting-place of the worst buccaneers in the galaxy! Find new team members or invite your friends to play, check the leaderboards, and take part in the ongoing community challenges… <br/><br/>BATTLECREW is more than just a shoot 'em up - it's alive! Players can unlock new content like environments, taunts, skins, emotes and game modes by winning regularly-updated community challenges!Features<br/><ul><li>\tFast and addictive gameplay designed for competition: in BATTLECREW, games are based on skill and cooperation with up to 8 players!</li></ul><br/><ul><li>\tGold Rush 4vs4 mode in which you and your team have to collect as much gold as possible to win!</li></ul><br/><ul><li>\tTeam Deathmatch 2vs2 mode in which you have to kill as many of the enemy pirates as you can to claim victory!</li></ul><br/><ul><li>\t4 character classes, each with entirely different playing style! A richly-colored cast of cool and charismatic pirates!</li></ul><br/><ul><li>\tPirate Bounties &amp; Pirate Points: BATTLECREW regularly challenges the community! Earn Bounties Points and Pirate Points (XP) to unlock new content (maps, skins, taunts…)</li></ul><br/><ul><li>\t18 unique maps already unlocked, 9 maps for the Gold Rush mode and 9 maps for the Team Deathmatch mode. More to unlock by the community through our Pirate Bounties system</li></ul><br/><ul><li>\tTortuga, the game community’ hub, is where pirates can meet, chat, check the game statistics and leaderboard, customize their avatar, check the community challenges, and launch games.</li></ul><br/><ul><li>\tCrews (Unlimited version only) - Create your own squad of 4 players for the Gold Rush mode or 2 players for the team Deathmatch mode. When your crew is complete, you will enter your own Tortuga. </li></ul><br/><ul><li>\tTutorials &amp; Training mode Player vs. Bots – BATTLECREW’s fast-paced action can be daunting for newcomers, but that shouldn’t be a problem anymore thanks to a tutorial that introduces novice players to the core concepts of each character’s gameplay and skills. </li></ul><br/><ul><li>\t20 unique Steam Achievements are now waiting to be unlocked!</li></ul><br/><ul><li>\tSteam Item Trading – BATTLECREW now supports the Steam Inventory and Trading systems, where players can trade 8 BATTLECREW cards.</li></ul><br/>Website : http://battlecrewgame.com<br/>Facebook : https://www.facebook.com/battlecrewgame<br/>Twitter : https://twitter.com/BATTLECREWGame<br/>YouTube : https://www.youtube.com/battlecrewgame", "metacritic": null, "released": "2017-01-31", "tba": false, "updated": "2022-10-01T23:44:04", "background_image": "https://media.rawg.io/media/screenshots/21c/21ca7cd56b877571fbecff374a0b88f2.jpg", "website": "http://www.battlecrew-game.com", "rating": 2.0, "rating_top": 3, "added_by_status": {"yet": 5, "owned": 239, "toplay": 1, "dropped": 4}, "playtime": 1, "achievements_count": 20, "ratings_count": 8, "suggestions_count": 582, "game_series_count": 0, "reviews_count": 8, "platforms": ["PC"], "developers": ["DONTNOD ELEVEN"], "genres": ["Action", "Indie"], "publishers": ["DONTNOD ELEVEN"], "esrb_rating": null}