{"id": 99964, "slug": "the-power-of-45-brains", "name": "The Power of 45 Brains", "name_original": "The Power of 45 Brains", "description": "<p>A puzzle game about creating computational networks that perform simple tasks.</p>\n<p>On the left-hand side of the screen, you'll see two bars, one contains an input sequence, and one a desired output sequence. The input is produced by the grey hexagon in the top right corner of the screen. You have to recieve the input, manipulate it, and output it to the output sensor, in the lower left corner.</p>\n<p>Do that by connnecting \"brains\" to each other and to the input and output modules. Connections can be formed by right clicking and dragging between two brains.</p>\n<p>After you are satisfied with the connections you've formed, press play, and watch your network process the input. You can slowdown or speedup the playback using the slider in the bottom right corner.</p>\n<p>The basic brain component takes in set of X color signals, and returns either a new signal of their color, if it's homogeneous, or nothing at all, if it's not.</p>\n<p>As the game progresses, you'll be presented with other brains, that do different operations on the input they recieve.</p>\n<p>Is the game too hard or too easy? Is the art style clear? Did you find a bug? We plan on updating the game in the coming weeks, so we would love to hear your feedback.</p>\n<p>Thanks for playing, and have fun,</p>\n<p>Itamar and Yaniv</p>\n\n<p>/* update #1 */</p>\n<p>A new art style, many new levels, some bug fixes, main menu and level selection screens, a new level description system.</p>\n\n<p>/* update #2 */</p>\n<p>More levels, and now they will generate a save file so that you can start and stop playing at any point of the day! Also, bugfixes and small improvements.</p>\n\n<p>/* update #3 */</p>\n<p>Even more levels, and important bug fixes. Also, brain puns!</p><p>/* update #4 */</p><p>Small fixes, mostly to levels.</p>", "metacritic": null, "released": "2017-06-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/edc/edcc1d19fc93995ee5cd1ca6dbace13e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Foggy Cornslakes"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}