{"id": 99972, "slug": "shenanigans-multiplayer-x", "name": "Shenanigans Multiplayer X", "name_original": "Shenanigans Multiplayer X", "description": "<p><strong>Child tested, mother approved! The successor to the wacky do-random-crap-with-your-friends mutltiplayer shootysandbox Shenanigans Multiplayer.</strong><br/> Ladies and gentlemen, meet <strong>Shenanigans Multiplayer X!</strong></p><p>Shenanigans Multiplayer X improves on many downfalls of the original - better physics, better netcode, better graphics and better user interface.</p><p><strong>Battle it out in the new Buildmatch gamemode!</strong><br/> In the buildmatch gamemode, players are given time to build bases. Once that time runs out, it's a battle for elimination. <em>Is someone chickening and fortifying themselves?</em> Don't worry, you'll still have a chance to take them on!</p><p><strong>Fight with new weapons!</strong> Improved is the pitiful attempt at melee weapons made in Shenanigans Multiplayer 1, in SMP X melee weapons act like melee weapons! <strong>ROCKET LAUNCHERS!!!</strong> Blast your friends and foes like you've never done before.</p><p><em><strong>Shenanigans Multiplayer X is still an early access beta</strong></em>, this means that some of the features from the original are still missing. There is no customization, no explosive barrels and no physics blocks. I hope to achieve feature parity soon.</p><p><strong>WHAT ARE YOU WAITING FOR? IT'S FREE!</strong> and invite friends too :)</p>", "metacritic": null, "released": "2016-08-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/480/480eb134c43d869ae89dcc10d3b4000b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Gampixi"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}