{"id": 99983, "slug": "virtual-climbing", "name": "Virtual-Climbing", "name_original": "Virtual-Climbing", "description": "<p>----------------------------------------------------------------------------------------------------------</p><p>This game is more of a prototype than a complete game, new updates should be out every week.</p>\n<p>This game is for VR. If you do not have a VR helmet (Any VR Headset will work if it connects to your PC).</p>\n<p>----------------------------------------------------------------------------------------------------------</p>\n<p>Welcome to the world of Virtual Climbing! This is a Cartoon climbing game made for Virtual Reality! Virtual Climbing is under development at the moment,  so please consider donating to help development! Thanks for viewing!</p>\n<p>Tutorial: Use the circle pad to find your way to the first blue box. Move your controller toward the colored block, when it is inside and or close to it, pull the back trigger on your controller to grab onto the block. Pull yourself up, and repeat these steps until you make it to the top! The key \"Space\" changes the level. Having bugs with the flag and unfortunately it has not been added to the game yet.</p>\n<p>Questions and answers: Q: Why does my screen go red? A: That means the camera is inside the tower, pull your head out before it pushes you off the tower. </p>\n<p>Controls: Back trigger:  Pulls you up the wall. Circle pad: Teleportation.  F4: Deletes your save file (Not fully implemented). Space: change the level. (You may have to take off your headset to change the level)</p>\n<p>Contact:</p>\n<p>Email: Jfstudios.indie@gmail.com</p>\n<p>Steam:  https://steamcommunity.com/id/Jfstudios</p>\n<p>Trello: https://trello.com/b/HHprfHgk/virtualclimbing</p>", "metacritic": null, "released": "2018-04-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/62c/62c61af1492fc5faaa875dad01623b98.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jfstudios"], "genres": [], "publishers": [], "esrb_rating": null}